{"organizations": [], "uuid": "97c1177d82d012b858b8d962514d599123c10244", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cajnewsafrica.com", "main_image": "http://cajnewsafrica.com/wp-content/uploads/2015/08/Alternative-energy.jpg", "site_section": "http://cajnewsafrica.com/category/finance-banking/feed/", "section_title": "CAJ News Africa » Finance & Banking", "url": "http://cajnewsafrica.com/2015/08/18/youth-proffer-solutions-to-resolve-power-crisis/", "country": "US", "title": "Youth proffer solutions to resolve power crisis", "performance_score": 0, "site": "cajnewsafrica.com", "participants_count": 1, "title_full": "Youth proffer solutions to resolve power crisis", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T08:04:00.000+03:00", "replies_count": 0, "uuid": "97c1177d82d012b858b8d962514d599123c10244"}, "author": "Admin", "url": "http://cajnewsafrica.com/2015/08/18/youth-proffer-solutions-to-resolve-power-crisis/", "ord_in_thread": 0, "title": "Youth proffer solutions to resolve power crisis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Youth proffer solutions to resolve power crisis \nFrom OKORO CHINEDU in Lagos, Nigeria LAGOS, (CAJ News) – YOUNG inventors at the recently-concluded Sahara Light up Nigeria Challenge have proffered alternative and renewable energy sources that have the potential to enhance eco-friendly and sustainable electricity supply in the country. \nThe competition, a yearly event that has been held in Lagos, hosted by Sahara in partnership with ENACTUS Nigeria, seeks to inspire students of higher institutions of learning across the nation to explore opportunities for achieving sustainable power supply within their environment. \nIt also serves as Sahara’s contribution to the growth and development of the Power sector where it has affiliates in the generation and distribution sectors through the Sahara Power Group. \nThe 2015 challenge involved the development of simple Power Models that can reduce production cost and encourage the broad utilization of different energy sources to power communities and schools. Kaduna Polytechnic’s Renewable Energy Advancement Project (R.E.A.P) emerged as the winning entry in the competition that had impressive projects from 28 schools. \nSahara Foundation’s Manager, Babatomiwa Adesida said Sahara was always delighted to provide platforms that inspire and empower youths to transform opportunities in their environment into solutions that enhanced socio-economic development. \n“We believe the Sahara Light Up Challenge has started a movement that will ultimately redefine the way we produce, store and consume power in Nigeria, whilst ensuring environmental protection. We are confident that the competition will ultimately light up Nigeria,” he stated. \nMichael Ajayi, Country Director Enactus Nigeria, said the competition, which was in its second edition, showed the nation’s youths only need the right platforms to express their huge potential. “The Sahara Light Up Nigeria Challenge provides the opportunity for young minds to stretch their creativity as they seek to find solutions to the challenges in Nigeria’s power sector. Over the years we have seen teams present incredible inventions,” said Ajayi. \n– CAJ News \nShort URL : http://cajnewsafrica.com/?p=7576   18 2015. Filed under Africa & World , Electricity , Energy   , Finance & Banking , Investing , Oil & Gas , Solar & wind  ", "external_links": [], "published": "2015-08-18T08:04:00.000+03:00", "crawled": "2015-08-18T08:07:46.673+03:00", "highlightTitle": ""}