{"organizations": ["Standard Life Plc", "AstraZeneca"], "uuid": "4ca47e18e9cfe1dc623e2c0481ad2206953e73fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/why-standard-life-plc-itv-091300425.html", "country": "GB", "title": "Why Standard Life Plc, ITV plc, AstraZeneca plc And SABMiller plc Are 4 Of The Hottest Growth Stocks Out There", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Why Standard Life Plc, ITV plc, AstraZeneca plc And SABMiller plc Are 4 Of The Hottest Growth Stocks Out There", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T12:13:00.000+03:00", "replies_count": 0, "uuid": "4ca47e18e9cfe1dc623e2c0481ad2206953e73fd"}, "author": "", "url": "https://uk.finance.yahoo.com/news/why-standard-life-plc-itv-091300425.html", "ord_in_thread": 0, "title": "Why Standard Life Plc, ITV plc, AstraZeneca plc And SABMiller plc Are 4 Of The Hottest Growth Stocks Out There", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nWed, Aug 19, 2015, 10:54 BST - UK Markets close in 5 hrs 36 mins Why Standard Life Plc, ITV plc, AstraZeneca plc And SABMiller plc Are 4 Of The Hottest Growth Stocks Out There By Royston Wild | Fool.co.uk – 41 minutes ago \nToday I am looking at the earnings prospects of four London-listed heavyweights. Standard Life \nThanks to colossal investment in its product portfolio and distribution network, I believe life insurance giant Standard Life (LSE: SL) is a great selection for those seeking juicy earnings expansion. And the London firm also has the financial clout to supercharge its growth outlook through shrewd acquisitions in hot markets -- just last week Standard Life agreed to raise its stake in Indian partner HDFC to 35% from 26% at a cost of £169m. \nAs a consequence, the City expects Standard Life to follow last year's 11% earnings improvement with rises to the tune of 52% and 18% in 2015 and 2016 correspondingly. These projections push the insurer's P/E multiple of 18.4 times for the current period to just 15.6 times for next year -- any reading around or below 15 times is widely considered a snip. And sub-1 PER ratios through to the close of next year underline Standard Life's brilliant value relative to its growth prospects. ITV \nWith revenues surging across the business I fully expect the bottom line at ITV (LSE: ITV) to swell in the coming years. The company's ITV Studios arm has a great track record of producing cash cows like Downton Abbey and Coronation Street , while acquisitions in this area are boosting its geographical reach not to mention exposure to red-hot areas like 'reality TV'. And with ad revenues ticking steadily higher it is easy to see the London firm delivering mammoth earnings growth. \nThis view is shared by the calculator bashers, and ITV's exceptional growth record is anticipated to keep rolling in 2015 with a 15% advance. This reading leaves the broadcaster dealing on a P/E multiple of 16.3 times, a figure that drops to 15 times for next year amid forecasts of an extra 9% earnings increase. AstraZeneca \nMake no mistake: the earnings turmoil at AstraZeneca (LSE: AZN) is not expected to end anytime soon thanks to the enduring problem of patent expirations across key drugs. Sales of its blockbuster Nexium and Crestor labels are expected to be smashed by generic competitors in the coming years, a phenomenon which the City expects to drive earnings fractionally lower in 2015 before barging earnings 3% lower in the following year. \nStill, I for one believe AstraZeneca's bubbly pipeline should deliver the long-term firepower to offset these mammoth sales problems. While the firm has accelerated capital expenditure in its lab operations over the past 12 months to rush product to market, targeted investment in hot areas like oncology and diabetes also promises to deliver rich rewards. Consequently I believe a P/E ratio of 15.6 times for 2015 represents a very decent entry point. SABMiller \nBeverages giant SABMiller (LSE: SAB) has not has an easy time of late thanks to the effect of cyclical headwinds in emerging markets and adverse currency movements. Still, for more patient investors I am convinced the firm's steady expansion in developing territories should deliver excellent earnings growth in line with surging personal income levels and rising populations. \nSABMiller noted in July that \" both revenue and volumes grew strongly in Latin America and Africa \" during April-June, driven by the formidable pricing power of products like Peroni and Castle . With such labels also powering sales in Asia Pacific higher again, the number crunchers expect SABMiller to recover from a 2% earnings decline in the period to March 2016 with an 8% bounce in 2017. So while P/E ratios of 21.8 times for this year and 20 times for 2017 may appear expensive at first glance, I reckon SABMiller's long-term prospects fully merit this premium. \nSo if SABMiller and its peers have whetted your appetite for even more big-cap superstars, I strongly recommend you check out this totally exclusive report that singles out even more FTSE winners waiting to kick-start your investment income. \nOur \" 5 Dividend Winners To Retire On \" wealth report highlights a selection of incredible stocks with an excellent record of providing juicy shareholder returns. Among our picks are top retail, pharmaceutical and utilities plays that we are convinced should continue to provide red-hot dividends. Click here to download the report -- it's 100% free and comes with no further obligation . \nRoyston Wild has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-19T12:13:00.000+03:00", "crawled": "2015-08-19T12:55:22.242+03:00", "highlightTitle": ""}