{"organizations": [], "uuid": "085910ca39bd80557a68f05a3bb93f5be0c5e39f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/ek_phuket_2.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/637245/1/emirates-boosts-services-to-phuket-with-four-addit.html", "country": "US", "title": "Emirates Boosts Services To Phuket With Four Additional Weekly Flights", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Emirates Boosts Services To Phuket With Four Additional Weekly Flights", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T13:47:00.000+03:00", "replies_count": 0, "uuid": "085910ca39bd80557a68f05a3bb93f5be0c5e39f"}, "author": "", "url": "http://www.modernghana.com/news/637245/1/emirates-boosts-services-to-phuket-with-four-addit.html", "ord_in_thread": 0, "title": "Emirates Boosts Services To Phuket With Four Additional Weekly Flights", "locations": ["Europe", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ernestina Boadi"], "text": "  19 August 2015 11:47 CET Emirates Boosts Services To Phuket With Four Additional Weekly Flights ....Improved Connections From Destinations In Europe, Middle East And Americas By Ernestina Boadi \nACCRA, GHANA – 19 August 2015 - Emirates, a global connector of people, places and economies today announced four new weekly flights between Dubai and Phuket to commence on 1 December 2015. \nAdding a capacity increase of 57 percent the four new flights will introduce connectivity from most cities in the Americas for the first time as well as improve connections to a number of destinations in Europe and the Middle East where Emirates currently flies from more than 50 cities. \n“Since the launch in 2012 Phuket has been a solid success story. The fact that we are now adding a further four weekly flights highlights not only the desirability of the destination but also the demand for passengers wishing to travel with Emirates,” said Thierry Antinori, Emirates’ Executive Vice President and Chief Commercial Officer. \n“These new flights have been well timed to not only maximise connections across our network but also allow for a morning arrival in Phuket, giving travellers even more time to enjoy the island and its surrounds.” \nPhuket island is the gateway to the southern part of Thailand making it easier for people to expand their travels to Khao Lak, Phang-nga, KohSamui, Trang, as well as Krabi and Koh Lipe. Known for its abundance of white, sandy beaches and easy access to the Andaman Sea for world class diving, Phuket has grown in popularity as an international destination, welcoming more than six million visitors to the island in the first five months of 2015 (source: www.tourism.go.th ) \nEmirates will operate the new weekly flights with a Boeing 777-300ER, offering eight seats in First Class, 42 seats in Business Class and 310 Economy Class seats. \nEmirates’ increase in flights to Phuket closely follows the announcement of the airline’s codeshare agreement with Bangkok Airways, which has added 14 new destinations to the Emirates network. Together with this codeshare agreement and the increased capacity to Phuket, Emirates’ customers now have even greater flexibility when planning their travel throughout South East Asia. \nThroughout all cabin classes, passengers can enjoy more than 2,000 channels of entertainment on demand on ice, the airline's award-winning in-flight entertainment system. Emirates customers also have the added bonus of a generous baggage allowance with 30 kilograms for those travelling in Economy Class, 40 kilograms for Business Class and 50 kilograms for First Class. \nEK396 will depart Dubai International Airport at 2255hrs and arrive at Phuket EK PHUKET 1 Other Stories Follow Us If you can reason, then complain not much, but act to the last of your breath By: Abu Ibrahim Azebre", "external_links": [], "published": "2015-08-19T13:47:00.000+03:00", "crawled": "2015-08-20T07:22:35.185+03:00", "highlightTitle": ""}