{"organizations": [], "uuid": "9c12d3421c36ec9d8a3469d5ef383e5559c3aa58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/s/i/t/0/image.related.afrArticleLead.620x365.gisbz0.png/1438783580877.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/chanticleer/a-plea-to-james-murdoch--kill-netflix-and-save-pay-tv-20150805-gisbz0", "country": "AU", "title": "A plea to James Murdoch - go after Netflix and save pay TV", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "A plea to James Murdoch - go after Netflix and save pay TV | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T17:26:00.000+03:00", "replies_count": 0, "uuid": "9c12d3421c36ec9d8a3469d5ef383e5559c3aa58"}, "author": "Tony Boyd", "url": "http://www.afr.com/brand/chanticleer/a-plea-to-james-murdoch--kill-netflix-and-save-pay-tv-20150805-gisbz0", "ord_in_thread": 0, "title": "A plea to James Murdoch - go after Netflix and save pay TV", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Netflix is challenging the status quo among Australian broadcasters. Reuters Share on twitter by Tony Boyd One month into his new job as chief executive of 21st Century Fox, James Murdoch is already under pressure to ensure the world's biggest pay TV company competes more aggressively with streaming video powerhouse Netflix.\nMurdoch has been politely but firmly asked to save pay TV in the United States before it's too late.\nThe plea came in a note to institutional investors titled \"Open Letter to Mr Murdoch\" by Sanford C. Bernstein analyst Todd Juenger. He is one of the top media analysts in the US and has an \"overweight\" rating on Fox shares.\nThere are lessons for local investors from Juenger's analysis because trends in the US media industry inevitably find their way to Australia.\nJames Murdoch has been politely but firmly asked to save pay TV in the United States before it's too late. David Rowe Netflix is already disrupting the Australian market by forcing people to question the value of pay TV bundles . Also, millennials do not want to have their program viewing times determined by \"big brother\" at a free-to-air station.\nJuenger starts his letter to Murdoch by proclaiming his love of TV. He even named his first child Emmy. If it had been a boy he would have been called Oscar.\n\"I hope to spend my golden years helping to contribute to, or even increase, the five hours per day the average American spends watching TV.\n\"But I'm increasingly afraid I won't be able to, because I'm afraid TV, or at least TV as we know it, may no longer exist. We need a hero. James Murdoch, you may be our last hope.\"\n Juenger pumps up Murdoch's ego with a few compliments before telling him what to do. \"You are taking control of some of the most important entertainment assets in Hollywood,\" he writes.\n\"You have the (global) experience to know the original wisdom of the 'old' pay TV bundle model.\n\"You are also connected to the younger generation enough to understand they want a different model.\n\"You are a fresh set of eyes in an industry that hasn't had a new CEO for a long time. \"You have the opportunity, some would say the mandate, to put your personal stamp on 21st Century Fox.\n\"You have a board and management team that is willing to make tough short-term decisions for the greater long-term good.\n\"Please, please, use that power to save TV. You know what needs to be done. It's not that complicated. You have all the tools in place.\"\nSVOD has jump on pay TV Juenger argues that the big media companies, including Fox, were outflanked by Netflix and other streaming video-on-demand (SVOD) companies in the US because they failed to do the most simple of things – provide consumers with what they wanted.\n\"Unfortunately, the TV networks essentially outsourced the on-demand viewing business to the SVOD's, starting with Netflix,\" Juenger says.\nHe says the $45 billion market value of Netflix is really the amount of value that has been lost by the large cap media companies\nin the US, with the exception of Disney. \"That $45 billion has accrued to Netflix, while a similar amount of value has been lost by the big content owners,\" he says. \"If the content owners hadn't outsourced on-demand to Netflix, maybe they would be worth $45 billion more.\"\nThe problem of value transfer from pay TV to SVOD is made worse because consumers are being asked to pay $US80 a month for a product that they don't like versus $US8 a month for a product they vastly prefer.\nJuenger does not completely write off the traditional pay TV business model of bundling. He says it is an efficient way to deliver a wide variety of content, reduces the cost of capital for content production and it is probably stickier than widely feared.\nBut he says pay TV bundles are at more risk than ever.\n\"The more viewers get accustomed to commercial-free SVOD, the less tolerance they have for conventional ad-supported linear TV,\" he writes.\n\"And the more they will question paying $US80 for the product they don't like as much as the $US8 product.\n\"Eventually, some of them will stop paying for the $US80 product. You must not let that happen. Even more disastrous, the bundle itself could fracture, which would cause the cost of capital for content production to increase dramatically, and much less content will get made.\"\nSport still a drawcard These fears must be on the minds of News Corp Australia and Telstra , which own Foxtel. It has cut its monthly subscription rates but its strongest drawcard remains sport.\nThere are some in the media industry who believe we now live in a 10-channel world. In other words that is the maximum amount of channels a person will want and if you can get that many for free you only need to add one SVOD service. Unless you are a sports fanatic, a Foxtel subscription does not enter the equation .\nBut these are problem for Lachlan Murdoch who is co-chairman of News Corp. Juenger's advice for James Murdoch is as follows: \"Please take back all the on-demand rights to your content, and make on-demand access freely and easily available to pay-TV subscribers, as a privilege of their pay TV subscription.\"\n\"Signal what you are doing, and why, clearly to all your peers.\"\nThe first step is make Hulu, which is owned by Fox, an authenticated service only available to pay TV subscribers.\nJuenger turns his attention to affiliate fees, which are the main revenue stream that pays for content development in the US.\n\"At all costs, retain the affiliate fees,\" he says. \"Start from a new base. Capture the value of on-demand over time the same way the SVODs have been, with a longer tail of growing affiliate fees.\"\nFinally, Murdoch is given some tips on keeping the millennials involved in pay TV, many of which might work in Australia. He says to create some family plans to put kids on their parents' subscriptions. Another idea is to create a special pricing package for those who have left school but not graduated. Or take this to another level and lower the price for people under 30 years old.\n\"We believe creative marketing/pricing/packaging options for the complete product would be much more successful than creating lower-priced, skinny bundles which lack appeal due to their limited content and functionality and, to date, lack much on-demand functionality, either – which is what millennials want,\" he writes. \"Fox alone can't recapture on-demand for the entire industry. But you are in a better position than most, and James you are in a unique position to affect change. If you do it right and explain it well, others will follow.\"\nJuenger ends his letter with some sobering information about what investors in the US are saying about media stocks at a time when earnings are falling and earnings multiples are going down.\n\"Multiples for media stocks are not going to increase given the prospect of declining earnings,\" Juenger writes.\n\"And because of that, a large and increasing number of investors we talk to believe media stocks are un-investable , with the exception of Disney and probably Time Warner.\n\"Sadly, we agree. We include 21st Century Fox in the list of investable stocks, but many people do not.\n\"Investors (and analysts) would love to have confidence in the future and a reason to own these stocks. We need a reset.\n\"Worst case, if you take action and FOXA stock happens to go down in the near-term, you can take that giant pile of cash and buy back a bunch of shares.\"\nEffects test For the last word on the effects test here is the wisdom of former Australian Competition and Consumer Commission chairman Alan Fels at the National Press Club on Wednesday.\nHe said the effects test is common in 126 countries, has been used effectively since 1900 and is backed by powerful economic logic.\n\"If a big, powerful business that has market power takes action that damages a company that should be prohibited,\" he said.\nHe said a moment of weakness in 1976 during the Fraser government meant the effects test was not made law. But Fels said the impact will be small no matter whether it is made law or not. Mental health is an issue of 50 times greater importance to the country, Fels said.\nTony Boyd\nTwitter: @TonyBoydAFR\ntony.boyd@afr.com.au", "external_links": ["https://twitter.com/TonyBoydAFR", "http://twitter.com/@TonyBoydAFR"], "published": "2015-08-05T17:26:00.000+03:00", "crawled": "2015-08-05T20:14:02.419+03:00", "highlightTitle": ""}