{"organizations": [], "uuid": "34ae7af1797968b22727051af79955fcc25f9105", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://photos.prnewswire.com/prnvar/20150825/260799", "site_section": "http://www.prnewswire.com/rss/financial-services/financing-agreements-news.rss", "section_title": "PR Newswire: Financing Agreements", "url": "http://www.prnewswire.com/news-releases/dianrong-announces-c-round-funding-of-usd-207-million-300132792.html", "country": "US", "title": "Dianrong Announces C-round Funding of USD 207 Million -- SH", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Dianrong Announces C-round Funding of USD 207 Million -- SH", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T01:43:00.000+03:00", "replies_count": 0, "uuid": "34ae7af1797968b22727051af79955fcc25f9105"}, "author": "Dianrong.com", "url": "http://www.prnewswire.com/news-releases/dianrong-announces-c-round-funding-of-usd-207-million-300132792.html", "ord_in_thread": 0, "title": "Dianrong Announces C-round Funding of USD 207 Million -- SH", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHANGHAI , Aug. 25, Dianrong.com, the leading Chinese peer-to-peer lending platform, announced on August 20 the receipt of strategic investments from Standard Chartered Bank and a number of financial institutions. It is by far the largest funding round in the Internet finance industry in China and marks the first agreement of its kind in the world between a commercial banking giant and an Internet finance company. This C-round financing for Dianrong.com is co-led by Standard Chartered Bank and China Fintech Fund (CFF), and followed by Bohai Leasing ( Shenzhen Stock Exchange ticker: 000415). Institution investors from the previous two rounds also participated. The total amount raised is 207 million USD .\nEarlier in January this year Dianrong announced its B-round of funding from Tiger Global Management, who is also an early investor in Alibaba and JD.com.\nDianrong's C-round of funding is not only the largest equity investment in the Chinese internet finance industry, but also the first time globally that a commercial bank makes a direct equity investment in an Internet finance company. This investment highlights a new chapter in the financial services industry, where traditional practice shows its openness and earnestness to embrace innovations brought by the Internet finance sector.\n\"Standard Chartered Private Equity (SCPE) rarely invests in early-stage companies; we typically focus on growth and late-stage companies. Dianrong is quite an exceptional case. Standard Chartered has a different investment strategy than typical VC funds. We do not invest in a lot of companies, but emphasize on high quality investments and overall success rate; we would only like to invest in the best and most differentiated company in the industry,\" commented by Wei Zhu , Managing Director and Global Co-Head of SCPE. Peer to peer lending is a major direction of the global finance industry transformation. It relies on technology to enhance the efficiency of financial services, and would shape the way how future commercial banking will evolve. Standard Chartered is a leading bank globally, and must proactively embrace this new model of financial services, and hope to bring higher quality services to its customers in the future.\nAs early as two years ago, Standard Chartered has started looking for investment opportunities in the internet finance industry. After reviewing the whole sector, the team selected a few leading companies and conducted in-depth due diligence, and Dianrong emerged as the most attractive choice. Standard Chartered hopes to work with Dianrong to shape the development of the peer to peer lending industry in China , and to lead innovations in the banking industry. Together we would create the \"Bank of Tomorrow\".\nCFF is the co-lead of this investment. CFF targets equity or equity-related investments in internet financial technology companies at growth expansion phase and mature stage mainly in China , Europe , U.S., and other regions.\nDianrong is the first project CFF invested in China . The fund's management team - Laurence Liao , Jarret Sha , and Lin Cong represents the fund's limited partners China Minsheng International Capital Limited, Guangfa Investments (Cayman) Company Limited, and L.R. Capital Group. They jointly commented that, \"there's no doubt that Dianrong is a benchmarking company in the industry. Based on his previous industry and technology know-how, Dianrong's founder Soul Htite led his world-class team to build another full-fledged system that's open, flexible, powerful, and efficient. It can not only service internet borrowing and lending, but also provide a total internet finance technology and services solution to other financial institutions. Dianrong used internet finance technology to innovate, disrupt, and transform traditional financial services industry. It successfully enhanced the depth and width that finance can reach and connect with consumers, and create a technology revolution of internet finance. CFF is positive about Dianrong's future and supports it fully.\"\nSoul Htite, Chairman of the Board and CEO of Dianrong.com, commented that the success of this new round of funding is not signified by the amount of money received but more importantly who the investors are. While Dianrong did raise the largest funding round in China's Internet finance industry, it is more important that our new investors are companies who have been doing finance for hundreds of years. We're very glad to become partners with these institutions.\"\n\"The government led initiative \"Internet Plus\" has been impacting every industry. Internet technology will change every industry. Dianrong hopes to provide the best financial solution to all of our partners by leveraging our technology edge.\" Soul Htite mentioned. \"In the future, Dianrong will also develop in-depth co-operations with Standard Chartered Bank and our other strategic investors.\"\nDianrong was founded in 2012, and is China's leading internet finance company. Since inception, Dianrong is committed to leveraging its key technological capability to build an efficient, transparent, and user-friendly marketplace lending platform. Dianrong would like to bring innovations to traditional lending business, with lower borrowing cost and higher investment returns for all clientele.\nIn June 2014 , Dianrong launched a unique and innovative wealth management product called \"Group Investing - TuanTuanZhuan\". The product is backed by sophisticated backend computing algorithms and system that implement an extreme level of investment diversification and support millions of micro transactions daily, while maintaining complete transparency to lenders. This innovative product is widely recognized by the market, and its ease to understand help won the hearts of many Internet consumers. As of today, TuanTuanZhuan exceeded 2.7 billion RMB in volume and have earned over 100 million RMB in interest for Dianrong lenders.\nMedia contact\nMuyang Liu\nPR Director of Dianrong.com\n(86) 13761142300\nmuyang.liu@dianrong.com\nWei Yao\nSenior PR manager of Dianrong.com\n(86) 18602130723\nwei.yao@dianrong.com\nDianrong\nDianrong is China's leading Internet finance services company headquartered in Shanghai . Named the \"Lending Club of China \", the company was founded in 2012 by Soul Htite, co-founder and former Head of Technology at Lending Club, who joined efforts with Kevin Guo , a PE fund partner and a lawyer from Shanghai to create China's most innovative financial solutions offering. With over 1,700 employees and 18 offices across China , Dianrong.com focuses on two distinct businesses.\nThe online marketplace: the platform www.Dianrong.com facilitates personal and business loans by connecting good quality borrowers to millions of potential lenders in China through our powerful, easy to use and secure internet infrastructure. We use technology to lower cost of acquisitions, operations, loan servicing and post issuing management. We pass the cost savings generated by technology to borrowers in the form of lower rates and investors in the form of attractive returns. Banking solutions services: This business unit focuses on assisting large financial institutions to transform their operations from a traditional model to a modern Internet finance enabled businesses. Our offering combines technology with risk management techniques that we have built over the few years we have been operating our own platform. Since its inception in 2012 we've built a trusted brand with a track record of delivering exceptional value and satisfaction to borrowers, lenders and business partners. Dianrong has been featured in many publications both in China and worldwide and has been named one of the most promising, fast growing Internet companies in China .\nGiants of the capital and banking market have back Dianrong.com; it has received funding from Tiger Global PE, Northern Lights VC, Standard Chartered Bank, Bohai Leasing and China Fintech Fund (the fund that was founded by China Minsheng International Capital and Guangfa Investments).\nStandard Chartered Bank\nStandard Chartered Bank is a leading international banking group, with more than 86,000 employees and a 150-year history in some of the world's most dynamic markets. We bank the people and companies driving investment, trade and the creation of wealth across Asia , Africa and the Middle East , where we earn around 90 per cent of our income and profits. Our heritage and values are expressed in our brand promise, Here for good.\nStandard Chartered PLC is listed on the London and Hong Kong Stock Exchanges as well as the Bombay and National Stock Exchanges in India .\nChina Fintech Fund\nChina FinTech Fund was founded by CM International Capital Limited (\"CMIC\"), GF Investments (Cayman) Company Limited (\"GF Investment\") and L.R. Capital Group (\"LRC\"), devoted to the advancement of internet finance through broadening and deepening the scope of internet financial technology, with an aim to enhance efficiency and quality of financial services. China FinTech Fund (\"CFF\") targets equity or equity-related investments in internet financial technology companies at growth expansion phase and mature stage mainly in China , Europe , U.S., and other regions. The mission of CFF is to transform and revolutionize innovative financial services companies that possess cutting edge technologies and help them grow quickly.\nBohai Leasing\nBohai Leasing is an Asia based, leading international comprehensive leasing industry group, being the only listed leasing company on the Chinese A-Share stock market and the largest container leasing service provider in the world. Capitalizing on the resources, advantages, and opportunities provided by the public platform of listed company, the full range of leasing licenses, and the robust capital markets, Bohai Leasing achieves a fast and balanced development in the different leasing businesses of finance leasing and operating leasing both domestically and internationally, through innovations on the business model, leasing asset trading, merger and acquisitions, and the global integration of assets and resources. Since 2015, Bohai Leasing has begun its investment into the Bohai Life Insurance and Lianxun Securities, building up a large financial holding group with leasing as core business supplemented and enhanced by other financial services.\nWith aircraft, container, infrastructure, and high end equipment as its main business segments, the company has established its footprints in the country's main economic and free trade zones of Tianjin, Shanghai, Guangdong , and Yangzi River Delta. Overseas, the company has major offices in Hong Kong , Singapore , London , and Miami.\nPhoto - http://photos.prnewswire.com/prnh/20150825/260799\nSOURCE Dianrong.com", "external_links": ["http://www.dianrong.com/"], "published": "2015-08-26T01:43:00.000+03:00", "crawled": "2015-08-25T20:43:50.217+03:00", "highlightTitle": ""}