{"organizations": [], "uuid": "0a9fcc13189d59ba3270add7590076b759e6a770", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/industry/banking-finance/", "section_title": "Banking and Finance News:Banking News,Finance News,Bank and Finance News Today | The Financial Express", "url": "http://www.financialexpress.com/article/industry/banking-finance/collapsed-bitcoin-exchange-boss-faces-usd-2-6-mn-theft-claim/123374", "country": "IE", "title": "Collapsed Bitcoin exchange boss faces USD 2.6 mn theft claim", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Collapsed Bitcoin exchange boss faces USD 2.6 mn theft claim | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T15:50:00.000+03:00", "replies_count": 0, "uuid": "0a9fcc13189d59ba3270add7590076b759e6a770"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/industry/banking-finance/collapsed-bitcoin-exchange-boss-faces-usd-2-6-mn-theft-claim/123374", "ord_in_thread": 0, "title": "Collapsed Bitcoin exchange boss faces USD 2.6 mn theft claim", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Banks seek shareholders' nod for Rs 5,934 crore capital infusion HDFC launches film on ills of borrowing from unorganised sector With yuan cut, China scripts remarkable 2-week run on financial markets The former head of MtGox reportedly faced fresh criminal charges today over allegations he stole USD 2.6 million from clients, as police questioned him about hundreds of millions of dollars worth of missing Bitcoins.\nJapanese authorities issued a fresh arrest warrant for France-born Mark Karpeles, over claims he stole millions from clients before the Bitcoin exchange collapsed, local media reported, including about USD 48,000 he allegedly spent on a luxury canopy bed.\nKarpeles, 30, who has reportedly denied the allegations, was initially taken into custody this month over the affair and has been held without formal charges for three weeks, as allowed under Japanese law. Police declined to comment when contacted by AFP.\nWith his time in custody set to end this week, a fresh arrest warrant would reset the clock on how long police can hold him and grill the self-described computer geek over the missing money.\nKarpeles was first taken into custody over claims he fraudulently tinkered with data and transferred funds to other firms controlled by him dozens of times between 2011 and 2013.\nHowever, police are also reportedly interested in questioning Karpeles about the disappearance of 850,000 coins last year, valued at around USD 480 million then and USD 387 million at current exchange rates.\nTokyo-based MtGox froze withdrawals in early 2014 and was later shuttered over the missing money, which it said was linked to a bug in the software underpinning Bitcoins that allowed hackers to pilfer them.\nThe exchange — which once boasted it handled around 80 percent of global Bitcoin transactions — filed for bankruptcy protection soon after the cyber-money went missing.\nKarpeles later said he had found some 200,000 of the lost Bitcoins in a “cold wallet” — a storage device, such as a memory stick, that is not connected to other computers.\nInvestors have demanded answers from Karpeles and called on the firm’s court-appointed administrators to make its data public so that experts around the world can help analyse what happened at MtGox.\nBut the complex case has presented a big challenge to Japanese police, as financial watchdogs around the world struggle to work out how to regulate digital money.\nIn response to Karpeles’ initial arrest, Tokyo said it would boost efforts to regulate the crypto-currency in coordination with other G7 countries.\nBitcoins are generated by complex chains of interactions among a huge network of computers around the planet, and are not backed by any government or central bank, unlike traditional currencies.\nBackers say digital currencies allow for an efficient and anonymous way to store and transfer funds online. But critics argue the lack of legal framework governing the currency, the opaque way it is traded and its volatility make it dangerous.\n 22, 2015 7:50 am", "external_links": [], "published": "2015-08-22T15:50:00.000+03:00", "crawled": "2015-08-23T02:40:43.382+03:00", "highlightTitle": ""}