{"organizations": [], "uuid": "f2094947f807c44c268d321e5edee95b02bc2e69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508071668.html", "country": "US", "title": "Ghana: Ghana's Chance to Fix Its Mercury Problem", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Ghana: Ghana's Chance to Fix Its Mercury Problem", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T19:05:00.000+03:00", "replies_count": 0, "uuid": "f2094947f807c44c268d321e5edee95b02bc2e69"}, "author": "", "url": "http://allafrica.com/stories/201508071668.html", "ord_in_thread": 0, "title": "Ghana: Ghana's Chance to Fix Its Mercury Problem", "locations": ["Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Juliane Kippenberg"], "text": "Ghana's Chance to Fix Its Mercury Problem Tagged: column By Juliane Kippenberg \nIn a village in the Ashanti region last year, I met a small, shy 9-year-old boy--let's call him Zachary. Zachary was not going school but working at a gold processing site. \nHe told me how he collects the gold particles: \"I spread the mercury with my hand. Then I tie it up with a rag... . Then I come out with gold and mercury. You put it in the fire and smoke it.\" \nMercury is a liquid, shiny, fascinating substance. One of its amazing qualities is that it can attract gold particles and form a gold-mercury mix. If that mix, or amalgam, is burned, the mercury turns to gas and leaves behind pure raw gold. It is cheap and easy to mine gold this way. Related Topics Algeria: Ould Khelifa Presents in Midrand Algerian Experience in Promoting, Protecting Women's Rights \nBut mercury is also dangerous. It attacks people's central nervous system and can cause lifelong disability, including brain damage, and even death. Mercury is particularly harmful to children, as their bodies are still developing; the younger the child, the more serious the risk. Ghana, as one of the world's top gold producers, with about one million people working in artisanal gold mining or galamsey, relies heavily on mercury for gold processing. \nUp to now, the government of Ghana has allowed the use of mercury, putting its people at risk. But that is now changing. \nEarlier this month, an unusual gathering took place in the mining town of Tarkwa. Miners, government officials, and nongovernmental organizations met to discuss and plan how to protect people better from the negative effects of mercury. It was the first meeting of its kind in Ghana, and part of a larger process to tackle the negative effects of mercury. \nLast year, Ghana took a first step by signing the Minamata Convention on Mercury--an international treaty designed to reduce mercury exposure globally. It is named after a Japanese town where mercury poisoning killed at least 1,700 people in the 1950s. The Tarkwa gathering kicked off the development of a national action plan for the reduction of mercury in mining, which the treaty requires. Ghana has also started training health workers on mercury exposure, and declared it wants to be among the first 50 countries to ratify the convention. These are important steps but much more needs to be done. \nWhen my colleagues and I visited Ghana's artisanal, informal gold mines for field research, we found that children use mercury just like adult miners. While the majority of children who work with the substance are adolescents, younger children like Zachary do this work too. \nWe interviewed 24 children working regularly with mercury, but none of them knew about the health risks connected to the work. We also met Ibrahim, now 19, who started working in artisanal gold mining at 14. He now has a tremor in his hands, a common symptom of mercury poisoning. \nGhana's mining law allows the use of mercury for small-scale gold mining in quantities that are \"reasonably necessary.\" And mercury is freely available for sale in Ghana's mining towns. Shops offer it in small quantities--wrapped in plastic film--as well as in large canisters, too heavy for one person to lift. \nIt's no surprise that Ghana's rivers, soil, and air are heavily polluted with mercury, and artisanal miners have shown very high levels of mercury concentration in their bodies. Also unsurprisingly, Ghana has a reputation internationally for being lax on mercury. Since mercury is easy to get in Ghana, traders in neighbouring countries have bought it there, too. \nNow that Ghana has taken the first steps to protect its people from mercury, parliament should ratify the treaty. The government, together with nongovernmental organizations, businesses, and donors, needs to craft a national action plan. The plan should be a roadmap for introducing mercury-free gold processing alternatives, testing and treating people suffering from mercury-related conditions, and protecting those most vulnerable to mercury--children. The plan should also include measures to control the mercury trade and steps to end particularly harmful practices of mercury use, such as burning the amalgam in residential areas. \nGhana can and should act now--there are even funds available under the convention to support governments that want to act but need resources. The road ahead is long, but Ghana has taken the first step. It should keep up the momentum for the sake of Zachary and everyone else who faces the dangers of mercury poisoning as they process gold in Ghana. Ghana \nMTN Ghana has appointed Noel Kojo-Ganson as its Acting Chief Marketing Officer (CMO), effective July 30th, 2015. see more » Copyright © 2015 Human Rights Watch. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-07T19:05:00.000+03:00", "crawled": "2015-08-07T19:50:40.082+03:00", "highlightTitle": ""}