{"organizations": [], "uuid": "1bce9e77694eb9b16839d33c22fd7fdbe5dd832d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businessinsider.com", "main_image": "http://static4.businessinsider.com/image/55dfb19a5afbd3904d8b456b/oil-markets-catch-breath-after-biggest-gains-in-six-years.jpg", "site_section": "http://feedproxy.google.com/clusterstock", "section_title": "Finance", "url": "http://www.businessinsider.com/r-oil-markets-catch-breath-after-biggest-gains-in-six-years-2015-8", "country": "IL", "title": "Oil markets catch breath after biggest gains in six years", "performance_score": 0, "site": "businessinsider.com", "participants_count": 0, "title_full": "Oil markets catch breath after biggest gains in six years", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:50:00.000+03:00", "replies_count": 0, "uuid": "1bce9e77694eb9b16839d33c22fd7fdbe5dd832d"}, "author": "", "url": "http://www.businessinsider.com/r-oil-markets-catch-breath-after-biggest-gains-in-six-years-2015-8", "ord_in_thread": 0, "title": "Oil markets catch breath after biggest gains in six years", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You have successfully emailed the post. Oil markets catch breath after biggest gains in six years Aug. 27, 2015, 8:50 PM 4 \nThomson Reuters A fuel pump is seen in a car at a gas station in Toronto \nBy Meeyoung Cho \nSEOUL (Reuters) - Crude oil futures were largely steady on Friday after posting their biggest one-day rally in over six years the day before led by recovering equity markets and news of diminished crude supplies. \nStock markets around the world rallied on Thursday, shaking off a slump related to China growth fears, as strong U.S. economic data boosted investor sentiment, and the dollar advanced for a third consecutive session. \nFront-month October Brent crude had dipped 20 cents to $47.36 per barrel as of 0046 GMT. It settled $4.42 higher at $47.56 per barrel in the previous session. \nU.S. crude edged down 3 cents to $42.53 per barrel, after ending up $3.96, or 10.3 percent, at $42.56 per barrel, its biggest one-day percentage gain since March 2009. \n\"A short covering rally, led by crude oil pushed commodities higher across the board. Better than expected U.S. GDP numbers was the main spark, although the force majeure on BP's exports from Nigeria extended the gains,\" ANZ said in a note on Friday morning. \n\"The recovery in commodity prices looks fragile with concerns over China's growth still weighing on market activity,\" the bank added. \nThe U.S. economy grew faster than initially thought in the second quarter on solid domestic demand. Gross domestic product expanded at a 3.7 percent annual pace instead of the 2.3 percent rate reported last month, the Commerce Department said on Thursday in its second GDP estimate for the April-June period. \nShell's Nigerian unit, Shell Petroleum Development Company (SPDC), declared force majeure on Bonny Light crude oil exports on Thursday after shutting down two key pipelines in the country due to a leak and theft. \nChina's falling auto sales have been at the forefront of concerns that its economy is slowing much faster than expected, weighing on oil prices. \nVenezuela has been contacting other members of the Organization of the Petroleum Exporting Countries (OPEC), pushing for an emergency meeting with Russia to come up with a plan to stop the global oil price rout, the Wall Street Journal reported. \n(Reporting by Meeyoung Cho; Editing by Joseph Radford) Read the original article on Reuters . Copyright 2015. Follow Reuters on Twitter . More from Reuters:", "external_links": [], "published": "2015-08-28T03:50:00.000+03:00", "crawled": "2015-08-28T05:01:42.583+03:00", "highlightTitle": ""}