{"organizations": [], "uuid": "db7648631c5e0594593c49bced1eec2140db7dff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wallstreetoasis.com", "main_image": "", "site_section": "http://www.wallstreetoasis.com/node/feed", "section_title": "Wall Street Oasis - Investment Banking & Finance Community", "url": "http://www.wallstreetoasis.com/jobs/fall-analyst-venture-capital-private-equity", "country": "US", "title": "Fall Analyst - Venture Capital / Private Equity", "performance_score": 0, "site": "wallstreetoasis.com", "participants_count": 1, "title_full": "Fall Analyst - Venture Capital / Private Equity", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T13:00:00.000+03:00", "replies_count": 0, "uuid": "db7648631c5e0594593c49bced1eec2140db7dff"}, "author": "startupbanker", "url": "http://www.wallstreetoasis.com/jobs/fall-analyst-venture-capital-private-equity", "ord_in_thread": 0, "title": "Fall Analyst - Venture Capital / Private Equity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Login to Start Application \nAbout Us: We are a boutique financial advisory firm that specializes in helping founders, executives, investors, and other shareholders of private, venture-backed companies achieve liquidity prior to a traditional exit. Since affiliating with a broker-dealer in 2010, we have facilitated over 300 individual transactions across dozens of companies, representing over $500 million of invested capital. Example transactions include: SpaceX, Palantir, Dropbox, Snapchat, and Cloudera. \nIn addition to our advisory services, we also invest as principals in select opportunities. Representative investments include: SolarCity (pre-IPO), Facebook (pre-IPO), MarkLogic, and Rani Therapeutics. \nRole: The fall analyst will report directly to the firm's partners and play an integral role in all aspects of our business. No two days will be alike, and you will have exposure to a breadth of functions, including: investment analysis, research, deal origination, marketing, and operations. Specific responsibilities will include: \n- Analyzing potential investments (with an emphasis on late-stage technology companies) - Identifying, contacting, and qualifying potential clients - Drafting legal documents (e.g. advisory agreements, offer letters, stock purchase agreements, etc.) - Monitoring and updating the firm's CRM database - Documenting transactions for our compliance team \nThis is primarily a remote internship, with preference given to candidates who are able to come into our San Francisco office at least one day a week. We are flexible on hours but expect at least a 12 week commitment. Compensation is commensurate with experience, and exceptional analysts may be offered a full-time role. The analyst will have direct exposure to successful tech entrepreneurs, executives, and a diverse network of investors, including VCs, hedge funds, family offices, and angel investors. \nQualifications: We are a small, entrepreneurial firm, so the ideal candidate must be comfortable wearing multiple hats and working with limited direct supervision. Though work ethic, interpersonal communication skills, and integrity are the most important qualifications for this role, the ideal candidate will also have the following: \n- Excellent academic performance at a top-tier university, preferably in a quantitative field - An interest in and familiarity with the technology landscape - Previous experience in business development, venture capital , private equity, investment banking, and/or management consulting - A strong understanding of finance and accounting. Start Date:", "external_links": [], "published": "2015-08-15T13:00:00.000+03:00", "crawled": "2015-08-15T13:15:08.353+03:00", "highlightTitle": ""}