{"organizations": ["Barclays PLC", "Kier Group plc"], "uuid": "5103b84681131e961f82e81ca8915647761f071b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-food-beverage/?format=rss", "section_title": "Food & Beverage News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/looking-brilliant-growth-income-shares-082241042.html", "country": "GB", "title": "Looking For Brilliant Growth & Income Shares? Check Out Barclays PLC, Kier Group plc, Galliford Try plc And Diageo plc", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Looking For Brilliant Growth & Income Shares? Check Out Barclays PLC, Kier Group plc, Galliford Try plc And Diageo plc", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T11:22:00.000+03:00", "replies_count": 0, "uuid": "5103b84681131e961f82e81ca8915647761f071b"}, "author": "", "url": "https://uk.finance.yahoo.com/news/looking-brilliant-growth-income-shares-082241042.html", "ord_in_thread": 0, "title": "Looking For Brilliant Growth & Income Shares? Check Out Barclays PLC, Kier Group plc, Galliford Try plc And Diageo plc", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Aug 9, 2015, 15:52 BST - UK Markets closed Looking For Brilliant Growth & Income Shares? Check Out Barclays PLC, Kier Group plc, Galliford Try plc And Diageo plc By Royston Wild | Fool.co.uk – Fri, Aug 7, 2015 09:22 BST \nToday I am taking a peek at four of London's best 'all-rounders'. Barclays \nThanks to the sustained British economic recovery Barclays (LSE: BARC) continues to enjoy splendid returns. The bank saw revenues climb 11% during January-June, a result that powered pre-tax profit 4% higher to £795m. With Barclays poised to step up cost-cutting under the interim leadership of John McFarlane, and the top-line also surging in the red-hot growth regions of Africa, I expect the bottom line to keep on swelling. \nThe City expects Barclays to deliver earnings growth of 34% and 22% in 2015 and 2016 correspondingly, driving a P/E ratio of 12.6 times for this year to just 10 times -- any reading around or below 10 times is widely considered a bargain. With earnings predicted to explode and capital ratios strengthening, dividends are expected to leap from 6.5p per share for the last three years to 7.1p in 2015, yielding 2.4%, and again to 9.5p in 2016, yielding a very decent 3.3%. Kier Group \nWith the British construction sector continuing to tick along nicely, I reckon Kier (LSE: KIE) should also deliver resplendent shareholder returns. In particular, Kier has a terrific track record when it comes to stacking up contract after contract with major customers, and late last month secured one of Highways England's largest 'Smart Motorway Programme' (SMP) contracts worth some £475m, as part of a joint venture with Carillion . \nKier is anticipated to have enjoyed earnings expansion of 19% in the 12 months ending June 2015, and an extra 12% rise is forecast for the current year. These projections push a very lovely P/E reading of 15 times for last year to just 13.1 times for fiscal 2016. But it is in the dividend stakes where Kier really sets itself apart, and a prospective payment of 63.8p per share for 2015 rises to an estimated 69.8p for the current period, creating a monster yield of 4.8%. Galliford Try \nLike Kier, I believe that Galliford Try (LSE: GFRD) should also enjoy rude revenue expansion in the coming years as the building industry ignites. More specifically the firm's huge exposure to the housing sector promises vast riches -- Galliford Try's sales rates advanced 49% during the year concluding June, the firm advised last month -- with a worsening supply/demand balance in the homes market likely to keep driving transaction values to the stars. \nAccordingly the City expects the Uxbridge business to have clocked up earnings expansion of 19% in the year ending June 2015, and a further 15% advance is chalked in for the following 12-month period. Such figures leave Galliford Try changing hands on tasty P/E ratios of 16 times and 13.8 times respectively. On top of this, the construction play is expected to hike last year's dividend of 53p per share to 64.2p for 2015 and 79.8p in 2016, yielding 3.6% and 4.5%. Diageo \nMake no mistake: drinks giant Diageo (LSE: DGE) is not likely to prove an obvious candidate for those seeking electrifying earnings and dividends prospects in the immediate term. At present the City expects the business to see earnings creep 5% higher in the year finishing June 2016, leaving Diageo trading on a slightly-elevated P/E ratio of 19.3 times. And a predicted dividend of 58.1p per share creates a decent-if-unspectacular yield of 3.2%. \nBut for more patient investors I reckon Diageo should deliver increasingly-attractive returns, particularly as abating economic headwinds in emerging regions lift the pressure on consumer spend. Meanwhile a steadily-improving North American territory -- Diageo's largest single market -- should drive revenues convincingly higher. When you also throw in the distiller's steady stream of product innovation and exciting acquisition strategy, I believe the London firm offers the perfect recipe for brilliant investor gains in the longer term. \nBut whether or not you share my bullish take on the firms mentioned above, I strongly recommend you check out this totally exclusive report that highlights even more FTSE 100 winners waiting to kick-start your investment income. \nOur \" 5 Dividend Winners To Retire On \" wealth report highlights a selection of incredible stocks with an excellent record of providing juicy shareholder returns. Among our picks are top retail, pharmaceutical and utilities plays that we are convinced should continue to provide red-hot dividends. Click here to download the report -- it's 100% free and comes with no further obligation . \nRoyston Wild has no position in any shares mentioned. The Motley Fool UK has recommended Barclays. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-07T11:22:00.000+03:00", "crawled": "2015-08-09T17:58:44.188+03:00", "highlightTitle": ""}