{"organizations": [], "uuid": "8877264cfb9275b5f596b20d6121ec280ce7c99d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn4.scmp.com/sites/default/files/styles/620x356/public/2015/08/05/3a7a93e7dea842c2bda9e604873f7dd0.jpg?itok=NFGHB8tU", "site_section": "http://www.scmp.com/rss/11/feed", "section_title": "South China Morning Post - Banking & Finance feed", "url": "http://www.scmp.com/business/banking-finance/article/1846905/chinas-finance-ministry-grants-bad-bank-licences-non", "country": "HK", "title": "China's finance ministry grants 'bad bank' licences for non-financial distressed assets", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "China's finance ministry grants 'bad bank' licences for non-financial distressed assets", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T19:09:00.000+03:00", "replies_count": 0, "uuid": "8877264cfb9275b5f596b20d6121ec280ce7c99d"}, "author": "steve_liu", "url": "http://www.scmp.com/business/banking-finance/article/1846905/chinas-finance-ministry-grants-bad-bank-licences-non", "ord_in_thread": 0, "title": "China's finance ministry grants 'bad bank' licences for non-financial distressed assets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order your FREE copy of AT YOUR SERVICE 2015 There are no official statistics on corporate bad debts, but non-performing loans at banks have hit 1.39 per cent. Photo: AFP \nThe Ministry of Finance has granted \"bad bank\" licences to three asset management companies to invest in non-financial distressed assets, further opening up the distressed assets market in China. \nHuarong, China Orient and China Great Wall will now be able to buy bad debts from companies directly. Previously, they could only do so from banks. \nThe move comes after the People's Bank of China's reiterated on Tuesday its commitment to improve the means of financing and lowering financing costs. \n\"The move is positive for re-liquefying the system by allowing companies to unload bad assets at market prices instead of having them stuck on their balance sheets as 'dead capital',\" said Chi Lo, senior economist, greater China, at BNP Paribas Investment Partners. \n\"But for the scheme to function effectively, China needs to improve its credit risk assessment and rating system, and develop a market for trading bad assets to enable the price-discovery mechanism to function properly,\" he said. \nUnlike the market for distressed assets at banks, the market for corporate assets may be a brave new world. \nThe legal framework for asset managers' ambit of activity and the parameters for company assets they can purchase are poorly defined. \nAssets could come in the form of both account receivables or inventory and companies might prefer to unload these to the managers at a discount rather than going through the costly process of sitting on accounts gone bad. \n\"The process for regulating non-financial non-performing assets will be very challenging. This set of debts arise out of normal businesses between suppliers and customers. These are not subject to the same regulations under the banking regulator. There is limited legal basis for enforcement,\" said Wilson Pang, partner in charge of special situation deal advisory at KPMG in Shanghai. \nEvaluating distressed corporate assets will be particularly challenging. \n\"In the past, the duty has largely fallen to the accounting industry. While banks have teams of legal advisers and other professional service providers involved, infrastructure supporting corporates in the recovery cycle is weak,\" Pang said. \n\"The only set of corporates asset management companies could confidently recover from is state-owned enterprises and listed firms, which are regulated under the State-owned Assets Supervision and Administration Commission, the China Securities Regulatory Commission and are independently audited.\" \nThere is little official requirement for disclosures from private and unlisted companies. \nIt is all very well that the asset managers can join in to save the economy but companies unloading debt to them without credit holders' knowledge may set off chain reactions, said Pang. \"Their credit holders may face risk and loss. The moral risks can be great.\" \nOfficial government organs do not compile statistics of corporate bad debts. The closest benchmark, coming from the banking regulator, shows non-performing loans at banks at 1.39 per cent.   MOF allows 'bad banks' to buy corporate debt Share", "external_links": [], "published": "2015-08-05T19:09:00.000+03:00", "crawled": "2015-08-05T20:18:34.066+03:00", "highlightTitle": ""}