{"organizations": ["Grant Thorntons", "Finance", "SEC", "GAAP", "Grant Thornton International Ltd", "Texas-Houston"], "uuid": "431f56bd0263fa3b22e92a27146bbbdb495102a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/p34agcuch3", "country": "US", "title": "Transaction Advisory Financial Due Diligence Experienced Man at Grant Thornton (Houston, TX)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "Transaction Advisory Financial Due Diligence Experienced Man at Grant Thornton (Houston, TX)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T16:12:00.000+03:00", "replies_count": 0, "uuid": "431f56bd0263fa3b22e92a27146bbbdb495102a4"}, "author": "", "url": "http://www.simplyhired.com/job/p34agcuch3", "ord_in_thread": 0, "title": "Transaction Advisory Financial Due Diligence Experienced Man at Grant Thornton (Houston, TX)", "locations": ["US", "U.S.", "Houston", "TX", "Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Grant Thornton"], "text": "Source: Job.com Grant Thornton is collaborative, entrepreneurial and on the move. As part of a dynamic global organization of 30,000 people serving clients in more than 100 countries, we have the agility and focus it takes to be a leader. TRANSACTION ADVISORY SERVICES SENIOR MANAGER TRANSACTION ADVISORY SERVICES PROFESSIONAL SERVICES FIRM POSITION SUMMARY: Would you like to join a team of trusted business advisors passionate about providing their clients with exceptional service? Grant Thorntons core business is audit, tax and advisory services. In short, we strive for a keen understanding of the clients business, in order to provide insightful and sound operational advice, recommend process improvement strategies, and offer suggestions to manage risk. Our professionals are thought leaders, providing personalized attention and quality service to our clients. Essential Duties and Responsibilities: * Supervise and oversee all aspects of Transactions Advisory Services (TAS) engagements throughout the transaction process, and coordinate the work performed by multiple service lines. * Serve as the day-to-day point person on engagements; lead meetings and calls with clients and target management. * Plan, execute, direct and complete financial due diligence for financial and corporate strategic buyers from a variety of industries, including manufacturing and distribution, non-profit, high-tech, real estate, and financial services. * Manage client expectations concerning project deliverables and deadlines and lead change efforts effectively. * Develop and maintain strong client relationships and cross-sell services. * Team with partners on proposals and business development calls. * Recruit, manage, mentor, and train managers, senior associates and associates. * Assess performance of managers, senior associates and associates for engagement and year-end reviews. * Perform other job-related duties as necessary. REQUIRED SKILLS AND EXPERIENCE: * Bachelor's degree in Accounting, Finance, Economics, Business Administration, or related field.Advanced degree preferred. * CPA certification and relevant professional certifications a plus. * Six to eight years of experience in the following: accounting, audit or transaction advisory services. * Strong current knowledge in US GAAP, GAAS, SEC Reporting, transaction advisory services or mergers and acquisitions. PREFERRED SKILLS AND EXPERIENCE: * Ability to manage multiple priorities and simultaneous projects in a rapidly growing practice. * Strong leadership, business development, recruitment, training, and mentoring skills. * Excellent written, presentation, leadership, and interpersonal communication skills. ADDITIONAL INFORMATION: * Ability to work additional hours as needed and up to 40% travel to various client sites. BENEFITS: Grant Thornton LLP promotes a nationally recognized culture of health and offers an extensive array of benefits to meet individual lifestyles. For a complete list of benefits please visithttp://www.gt.com/ Founded in Chicago in 1924, Grant Thornton LLP (Grant Thornton) is the U.S. member firm of Grant Thornton International Ltd, one of the worlds leading organizations of independent audit, tax and advisory firms. Grant Thornton has revenues in excess of $1.3 billion and operates 57 offices across the U.S., with more than 500 partners and 6,000 employees. Grant Thornton works with a broad range of publicly and privately held companies, government agencies, financial institutions, and civic and religious organizations. Core industries served include consumer and industrial products, financial services, not-for-profit, private equity, and technology. Grant Thornton focuses on serving dynamic organizations that pursue growth holistically whether through revenue improvement, leadership, mission fulfillment or innovation. It is Grant Thorntons policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits and termination, are made without regard to race, creed, color, religion, national origin, sex, age, marital status, sexual orientation, gender identity, citizenship status, veteran status, disability or any other characteristic protected by applicable federal, state or local law. **Title:** *Transaction Advisory Financial Due Diligence Experienced Manager* **Location:** *Texas-Houston* **Requisition ID:** *032441*", "external_links": [], "published": "2015-08-19T16:12:00.000+03:00", "crawled": "2015-08-20T14:11:50.910+03:00", "highlightTitle": ""}