{"organizations": [], "uuid": "b7d09ea45fe186f0bdc9a2cf7539674bf4522082", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/s/v/m/d/image.related.afrArticleLead.620x365.gitc79.png/1438854644889.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/news/politics/tony-abbott-faces-new-whispering-campaign-20150806-gitc79", "country": "AU", "title": "Tony Abbott faces new whispering campaign", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Tony Abbott faces new whispering campaign | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T18:00:00.000+03:00", "replies_count": 0, "uuid": "b7d09ea45fe186f0bdc9a2cf7539674bf4522082"}, "author": "Phillip Coorey", "url": "http://www.afr.com/news/politics/tony-abbott-faces-new-whispering-campaign-20150806-gitc79", "ord_in_thread": 0, "title": "Tony Abbott faces new whispering campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Abbott: \"People are getting nervous, The muttering has started again,\" said one powerbroker. Joe Armao Share on twitter by Phillip Coorey The Bronwyn Bishop expenses scandal has left Tony Abbott exposed to a fresh whispering campaign about his leadership just six months after he saw off a spill motion.\nWith Parliament to resume next week, Coalition MPs say while emotions are not near the level they reached in February, morale was once again \"pretty poor\".\n\"People are getting nervous, the muttering has started again,\" said one powerbroker.\nAs Mr Abbott soldiered on through Thursday, campaigning in the marginal Victorian seat of Corangamite, there was an awareness that this Sunday marked the six-month anniversary of the leadership motion which the Prime Minister survived by 61 votes to 39.\nAfter that self-described \"near-death experience\", it was reported that Ms Abbott told colleagues he needed a good six months to start turning things around.\n\"You could hardly argue things are much better,\" one Liberal said on Thursday.\nThe government remains 6 percentage points behind Labor in the polls and, in September or October, faces a by-election in the Western Australian seta of Canning, caused by the sudden death of Liberal MP Don Randall.\n\"The WA guys are not very confident abut that,\" said a source.\n A date for the by-election will be set once Parliament has a Speaker. This will be resolved by a ballot of the Liberal Party on Monday morning.\nIn recent days, Social Services Minister Scott Morrison, an almost certain future leader of the party, featured with his family in a spear in the Australian Women's Weekly presenting his softer side.\n\"I think it is often a good thing for people to have an understanding of the broader role families play in politics and they give me tremendous support and I love them dearly. I think they are the real stars,\" Mr Morrison told reporters.\nOn Thursday, Mr Turnbull gave a speech to the Australia-China Business Forum excoriating Labor for resisting elements of the China-Australia Free Trade Agreement.\nMr Abbott, who secured Mrs Bishop's resignation as Speaker on Sunday after three weeks of distraction, pushed back at what has become a stampede of scrutiny of politicians expenses, even the legitimate ones.\nMr Abbott said he believed MPs should still be able to use taxpayer-funded Comcars to attend party fundraisers.\n\"Members of Parliament have a number of different roles. We have a governmental role, we have a parliamentary role, we have a political role,\" Mr Abbott said.\n\"We have got to be able to do our job. If we can't do our job, we can't properly serve the Australian community.\"\nThe whole storm over expenses broke because Mrs Bishop chartered a helicopter to fly to a fundraiser in Geelong.\nIt then transpired she has claimed expenses to attend the weddings of two colleagues and claimed there was official business associated with the trips.\n\"Should you use a helicopter to get there? Well, plainly that's outside community expectations,\" Mr Abbott said.\nLabor leader Bill Shorten will call on Mr Abbott to review the use of the Prime Minister's VIP plane as part of the review he has ordered into expenses.", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-08-06T18:00:00.000+03:00", "crawled": "2015-08-06T15:13:07.203+03:00", "highlightTitle": ""}