{"organizations": [], "uuid": "7cfdc4243b615bc836fa1161a82281dc985a81ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://images.forbes.com/media/assets/forbes_1200x1200.jpg", "site_section": "http://www.forbes.com/finance/index.xml", "section_title": "Forbes - Personal Finance", "url": "http://www.forbes.com/sites/kotlikoff/2015/08/07/social-security-qa-can-i-file-on-my-exs-record-while-on-disability/", "country": "US", "title": "Social Security Q&A: Can I File on My Ex's Record while on Disability?", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "Social Security Q&A: Can I File on My Ex's Record while on Disability? - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T16:00:00.000+03:00", "replies_count": 0, "uuid": "7cfdc4243b615bc836fa1161a82281dc985a81ed"}, "author": "Laurence Kotlikoff", "url": "http://www.forbes.com/sites/kotlikoff/2015/08/07/social-security-qa-can-i-file-on-my-exs-record-while-on-disability/", "ord_in_thread": 0, "title": "Social Security Q&A: Can I File on My Ex's Record while on Disability?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Social Security may be one of your largest assets. What and when you collect will make a huge difference to your lifetime benefits.\nToday’s Social Security question is about how collecting a disability benefit affects the ability to collect a divorced spousal benefit.\nQuestion : I get disability of $1,603 monthly. My ex just retired and is remarried. We were married for 21 years. He is 65 and I’m 63. Do I qualify for any of his SS? He retired as a major on the police force after 34 years. I’m sure that he made well over six figures at retirement two years ago.\nAnswer : You can file for a spousal benefit now or at full retirement age. It will be an excess spousal benefit calculated as half of his full retirement benefit less 100 percent of your full retirement benefit. If this excess divorcee spousal benefit is positive and you take it now, it will be reduced because you are taking it before full retirement age. If it’s negative, it will be set to zero. That, unfortunately, is your case. Your disability benefit of $1,603 is well over half of the maximum current full retirement benefit.\nYou have the option, once you reach full retirement age, of suspending your retirement benefit (your disability benefit becomes your retirement benefit at full retirement age) and starting it up again at 70 when it will be 32 percent higher after inflation. If you do suspend, during the time between full retirement age and 70 you’ll continue to receive your excess divorcee spousal benefit (at the reduced level if you take it early).\nUnfortunately, as I wrote in this column , right before Christmas the disabled were denied the option to collect a full spousal benefit between full retirement age and 70. This is a clear act of discrimination, because the disabled are being denied something that one spouse in a married couple can do and that both exes in a marriage that lasted 10 or more years can do.\nThis discrimination victimized you and others like you. Your members of Congress might want to read my column on this.\nAlso, please be aware that if your ex dies before you, you should file for a divorcee widow’s benefit. If it’s larger than you own disability benefit (which is also your full retirement benefit), you’ll start to receive it rather than your retirement benefit, i.e., you’ll get the larger of the two benefits.\nMy weekly Social Security column appears on PBS NEWSHOUR’s website .", "external_links": ["http://www.pbs.org/newshour/making-sense/social-securitys-christmas-present-benefit-cuts-for-millions-of-disabled-workers/", "http://www.pbs.org/newshour/author/lkotlikoff/"], "published": "2015-08-07T16:00:00.000+03:00", "crawled": "2015-08-07T16:21:06.887+03:00", "highlightTitle": ""}