{"organizations": [], "uuid": "310a8c8191238d916ebf0dfe4ef521bda1d9e8de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/download/pic/main/main/csiid/00290640:9510eb2ed7e5f8176e229875cd61d044:arc614x376:w1200.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508211631.html", "country": "US", "title": "Congo-Brazzaville: Understanding Conflict Minerals Provisions", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Congo-Brazzaville: Understanding Conflict Minerals Provisions", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T17:47:00.000+03:00", "replies_count": 0, "uuid": "310a8c8191238d916ebf0dfe4ef521bda1d9e8de"}, "author": "", "url": "http://allafrica.com/stories/201508211631.html", "ord_in_thread": 0, "title": "Congo-Brazzaville: Understanding Conflict Minerals Provisions", "locations": ["Kenya", "Congo-Brazzaville"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kirubi"], "text": "Kenya: Ne-Yo Meets Kirubi as He Plans to Invest in Kenya \nWhat does the conflict minerals provision in the Dodd-Frank Reform bill require companies to do? \nFirst, companies who report to the Securities and Exchanges Commission, or SEC, who manufacture products that require tin, tantalum, tungsten, or gold must report on the due diligence procedures they have in place to determine whether or not their minerals originated in Congo or a neighboring country and if they are supporting armed conflict there. Until now, many companies have relied upon assurances from their suppliers that they do not purchase conflict minerals, without independent verification. With this law, the burden of proof shifts: now companies must find out from which countries their suppliers source. \nIf a company finds that its minerals do originate in Congo or one of its neighbors, more reporting is required. They then must report on the measures they have taken to understand the source and chain of custody of the minerals. \nDodd Frank section 1502 is intended to combine U.S. government, private sector, activist, and consumer pressure to bolster reform efforts within the government of Congo and to reduce the presence of armed groups in the region known to have committed some of the worst human rights atrocities in history. \nThe instability in the eastern region of Congo continues to cause immense suffering, including staggering mortality rates, mass displacement, as well as widespread sexual violence, often used as a weapon to terrorize and humiliate communities. The illicit exploitation of natural resources contributes to this instability. By creating a system that will eliminate funding mechanisms for the belligerents, the U.S. is paving the way for legitimate and sustainable resource management that will benefit the Congolese people, the government of Congo, private sector stakeholders, and concerned consumers here in the U.S. \nHow is the law being implemented? \nSection 1502 of the Dodd-Frank act involves a range of government actors including the SEC, the Secretary of State, the Comptroller General, and the United States Agency for International Development, or USAID. The center piece of the law is the disclosure requirement. \nCompanies are responsible for disclosing whether one or more of the four conflict minerals are a necessary component of their product or products. If they are and the minerals originated in Congo or an adjoining country then a company must file a report with the SEC that describes the measures taken by the company to exercise due diligence on the source and chain of custody of the minerals. \nIn 2011, the Secretary of State, in consultation with USAID, developed a strategy to address the link between armed groups, conflict minerals, and human rights abuses. Both organizations were also tasked with providing guidance to commercial entities seeking to exercise due diligence on the source and chain of custody of activities involving such minerals to ensure they did not directly or indirectly finance or benefit armed groups in Congo. Lastly, the Secretary of State developed a conflict minerals map that shows trade routes, mineral rich zones and areas under control of armed groups. \nOver 1,000 companies filed their first reports with the SEC on June 2nd, 2014, and four had independent audits conducted. While some were very thorough in documenting their efforts, overall there is need for companies to revamp their processes in the coming year. \nWhat are other governments and international organizations doing about this issue? \nMany different governments and multilateral organizations have made statements or committed resources to breaking the link between conflict and natural resources in Congo. This includes the U.N. Security Council, which has recognized “the linkage between the illegal exploitation of natural resources, illicit trade in such resources and the proliferation and trafficking of arms as one of the major factors fuelling and exacerbating conflicts in the Great Lakes region of Africa.” \nThe 2010 G8 Communiqué also highlighted conflict minerals: \n“The illicit exploitation of and trade in natural resources from the eastern Democratic Republic of the Congo has directly contributed to the instability and violence that is causing undue suffering among the people of the DRC. We urge the DRC to do more to end the conflict and to extend urgently the rule of law. We welcome the recent initiatives of the private sector and the international community to work with the Congolese authorities and to enhance their due diligence to ensure that supply chains do not support trade in conflict materials.” \nThe Organization for Economic Cooperation and Development, or OECD, is in the process of helping to develop due diligence guidelines for “managing the supply chain of key minerals from conflict-affected and high-risk areas, with particular regard to the Democratic Republic of Congo.” \nDoes the government in Congo support this law? Who else supports this law? \nThe Congolese government welcomed this law. In a statement, Minister of Information and Spokesperson Lambert Mende called it a “noble initiative.” In addition, the Catholic Church in Congo has issued a statement in support of the law, which they lobbied in support of through groups like Catholic Relief Services and the U.S. Conference of Catholic Bishops. \nThe bill has also been welcomed by international human rights groups, such as Amnesty International and Global Witness, as well as humanitarian groups like World Vision. \nCongolese civil society organizations in North and South Kivu have expressed support for the legislation, but understandably also have questions about this legislation. Why has this happened now? How is it being implemented? How do we deal with potential unintended consequences? For these reasons it is imperative that the United States government, as well as groups supportive of the legislation, facilitate the full participation of Congolese groups in the process of implementation. \nIs the conflict minerals law intended to be a \"silver bullet\" solution to stop all armed violence in the Congo? \nNot at all. As we’ve written: “While eastern Congo is a complex crisis—fueled by tensions over land, rights, identity, regional power struggles, and the fundamental weaknesses of Congo as a state—the trade in conflict minerals remains one of the key drivers of the conflict.” Efforts to curb the trade in conflict minerals are just one component of a comprehensive policy. \nHow will this legislation and related reforms contribute to reducing violence in eastern Congo? \nBy complying with this law and ensuring that their products are conflict-free, companies will contribute to excluding armed groups and military units from their supply chains. This will not only reduce the resources available to these groups, who are among the worst human rights violators in the conflict, it will also create an incentive for minerals traders to reform their business practices and contribute to a more legitimate trade, one that would deliver more benefits to the Congolese people. \nBesides compliance with the law, what additional steps can tech companies begin to take? \nThis legislation is just one step toward conflict-free products and a minerals trade that benefits the Congolese people. Achieving this will require a combination of companies, governments, and consumers taking action to trace, audit, and certify their minerals supply chain: \nTrace : Companies must determine the precise sources of their minerals. We should support efforts to develop rigorous means of ensuring that the origin and production volume of minerals are transparent. \nAudit : Companies should have detailed examinations of their mineral supply chains conducted to ensure that a) minerals are not sourced from conflict mines; and b) no illegal taxes/bribes are paid to armed groups in Congo. Credible third parties should conduct or verify these audits. \nCertify : For consumers to be able to purchase conflict-free electronics made with Congolese minerals, a certification scheme that builds upon the lessons of the Kimberley Process will be required. Donor governments and industry should provide financial and technical assistance to galvanize this process within the International Conference on the Great Lakes Region (ICGLR). \nIn addition to these steps, there are other important contributions that companies should make. Electronics, jewelry and minerals companies should partner with donors to set up a miners' livelihood fund to offer real economic opportunities and help the Congolese economy through small business, microfinance and agriculture.Can we buy conflict-free products now? Which companies are leaders and which are laggards in taking steps to rid their supply chains of conflict minerals?In January 2014, Intel announced the creation of the first verifiably conflict-free product containing minerals from eastern DRC – a microprocessor. Other companies are also taking positive steps to clean up their supply chains, though much work remains to be done before there is truly a market available for conflict-free products. \nShould companies stop buying minerals from Congo? \nNo. Enough is not calling for a boycott of minerals from Congo. In fact, we are advocating for more investment in the region, provided that investment occurs in a responsible manner that benefits the Congolese people. We are demanding greater transparency in supply chains and calling for companies to undertake the due diligence required to ensure they are not contributing to the conflict. The legislation does not ban Congolese minerals. International traders and refiners that have been purchasing minerals from eastern Congo may depend more on these sources than they admit and the interdependence between these multinational companies and their suppliers in Congo presents an opportunity to create greater due diligence down the supply chain. \nWhat about Congolese miners? Will this impoverish them even further? \nEnding the conflict in eastern Congo is the best way to help the Congolese people recover from more than a decade of suffering and violence. A critical aspect of this effort is severing the link between the minerals trade and the armed groups committing atrocities in Congo. But a comprehensive approach is required to improve the Congolese mining sector, one that improves livelihoods for miners and complements corporate responsibility. \nArtisanal miners work in extremely difficult conditions in eastern Congo and earn an average of $1-5 per day, largely because the armed groups extract such enormous profits on the backs of their labor. The bill is meant to help industry differentiate between legal and illegal mining—which is built on brutality, extortion, and slave labor including the use of children. The State Department produced a map that shows which mines in North and South Kivu are controlled by armed groups, and the legislation mandates that this map be updated every six months. However because of the fluid nature of the conflict, it will likely require even more frequent updates. \nFurther, the new bill requires the Secretary of State and USAID, to develop a plan to address the link between human rights abuses and armed conflict in Congo. These measures would reinforce efforts by companies to clean up their supply chains, and help to create a new market for conflict-free minerals. A legitimate supply chain would open up the private sector in Congo to responsible operators and improve the livelihoods of artisanal miners. \nAre conflict minerals too difficult for companies to identify? \nNo, industry is required to know what goes into its products, for quality control and health and safety reasons. Standards exist to eliminate lead paint, prison labor, and carcinogens in manufacturing. This is no different. \nSome companies already have policies that they do not buy conflict minerals from conflict areas in the Congo. What is wrong with these policies?Several electronics companies have issued statements that they ask suppliers not to source materials from conflict areas in Congo. However, these are merely written assurances that do not provide proof of where the minerals actually come from. They are not verified by any independent source. We currently have no way of knowing whether the minerals passed through the hands of armed groups in Congo or whether they came from another source. That is why we need more definitive proof, through tracing, auditing, and certifying. \nSince the passage of the recent bill many industry leaders in the U.S. have shown support for the initiative and have also shown expressed concern about the unconscionable human rights abuses associated with conflict mineral extraction in Congo. The bill is not aiming to put unwarranted or undue burden on the private sector, rather asking leaders of industry to step-up to the plate and be involved in creating an effective and sustainable regulatory process in conjunction with the U.S. Government and NGOs. \nAre electronics companies solely responsible for solving Congo's conflict minerals problem? \nNo. The Congo conflict minerals problem requires a comprehensive strategy, which must include serious policy action by the international community, the Obama Administration, the Congolese government, the UN, and NGOs - on issues of land tenure, security, governance, rule of law, and livelihoods. But electronics companies, as the main end user of minerals from Congo, bear a responsibility for cleaning up their supply chains. Our cell phones should not be fueling violent conflict. The companies have an important role to play in being part of the bigger solution. \nAre there alternative sources of these minerals besides eastern Congo? \nYes. The percentages of the global supply of the 3Ts coming from Congo is relatively small, from one percent to 12 percent, depending on the specific mineral. Tantalum is temporarily much higher, at approximately 30 percent, because the largest supplier of tantalum, Australia, recently suspended production. Major alternative sources of these minerals include:Tin: China, Indonesia, Peru, Bolivia, Brazil \nTantalum: Australia, Brazil, Canada \nTungsten: China, Russia, Canada \nGold: South Africa, Australia, the United States, China \nIt is important to note that the Enough Project is not calling for a ban or boycott of Congolese minerals, which would hurt miners. Instead, we encourage the development of legitimate, conflict-free mineral supply chains from Congo through the development of tracing and auditing. \nWhat are cassiterite, coltan, and wolframite? Why do some articles talk about metals and not minerals? \nBefore they are processed later down the supply chain into metals, the 3Ts minerals in Congo are often referred to in their mineral ore form. Tin ore = cassiterite Tanatalum ore = coltan or columbite-tantalite Tungsten ore = wolframite \nThe mineral ores are what make up the metals tin, tantalum, and tungsten. They change names once they are smelted and/or chemically processed by refining companies. To be consistent, we refer to \"conflict minerals\" because it is the mineral ores that fuel violence in eastern Congo. More on This", "external_links": [], "published": "2015-08-21T17:47:00.000+03:00", "crawled": "2015-08-21T18:57:14.311+03:00", "highlightTitle": ""}