{"organizations": [], "uuid": "1cc39d50042ab9513a1da75b9e7bca34ff30be45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/headline?s=RENT", "section_title": "Yahoo! Finance: RENT News", "url": "http://finance.yahoo.com/news/edited-transcript-rent-earnings-conference-071235827.html", "country": "GB", "title": "Edited Transcript of RENT earnings conference call or presentation 10-Aug-15 9:00pm GMT", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Edited Transcript of RENT earnings conference call or presentation 10-Aug-15 9:00pm GMT", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T10:12:00.000+03:00", "replies_count": 0, "uuid": "1cc39d50042ab9513a1da75b9e7bca34ff30be45"}, "author": "", "url": "http://finance.yahoo.com/news/edited-transcript-rent-earnings-conference-071235827.html", "ord_in_thread": 0, "title": "Edited Transcript of RENT earnings conference call or presentation 10-Aug-15 9:00pm GMT", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Operator [1] \n\nWelcome to Rentrak's FY16 first-quarter conference call. During the call, the Company will be making forward-looking statements that are subject to certain risks and uncertainties. Please refer to the Safe Harbor statement contained in today's press release, and also to Rentrak's periodic filings with the SEC for a complete discussion of those risks and uncertainties that could cause actual results to differ materially from those you may perceive today. \nRentrak will be discussing adjusted non-GAAP financial measures during this call. A further explanation of these non-GAAP measures and reconciliations to their closest GAAP measures is included in today's press release. Please also note that Rentrak has posted slides to accompany today's webcast, as well as supplemental financial information with historical trend data on its website at www.Rentrak.com. Now I would like to turn the call over to Bill Livek, Vice Chairman and CEO of Rentrak. Go ahead, sir. \n\nBill Livek, Rentrak Corporation - Vice Chairman and CEO [2] \n\nThank you, operator, and thank you all who have joined us on the call today. I'm joined by David Chemerow, our COO and CFO, who will providing a financial update, as well as several members of our executive team who will be available in the Q&A session. But I'd like to start the call off on something that's a little non-traditional. It's no secret to any of you on the call today that media stocks took a significant beating last week. \nI believe that, that was a reaction based on an erroneous perception that ad-supported television is dead. The facts clearly show that TV is not only alive and it's well and it's thriving. As we've said before, how you and I watch TV is not the same as it was a year ago, much less six years ago when Rentrak's current business plan was launched. TV has evolved. We are watching differently, on our own time and our own schedule. We are still watching live TV but we are watching more TV with our DVR and our VOD systems. \nRemember, live TV is still the overwhelming majority of viewing. The in-home viewing of TV from great networks and stations that are Rentrak's clients and prospects is stronger than ever. It is just being viewed when it's more convenient to our lifestyles. As you can see on slide 4, for the three months ending this May compared with the same period last year, in an average month, time-shifted viewing or viewing that occurs from day one to date 28 using a DVR or a VOD grew a whopping 15.3%, while live viewing and time-shifted viewing on TVs declined slightly. \nWe know based on recent comments from our partners like comScore and data from our MPVD (sic) partners that over-the-top viewing and other platform viewing, like the networks' websites and apps, has far more than compensated from that little loss. The pie has in fact expanded. Live plus three-day and seven-day ratings no longer adequately capture viewing habits. In fact, they misrepresent viewing as the consumer is doing it today. \nThe explosion of the DVR and on demand viewing has dramatically extended the lifestyle of commercial TV programs beyond live viewing. Content creators understand the impact of these changes as do advertisers and that's why they are turning to Rentrak. As the only measurement Company that includes time-shifted viewing over a 28-day period of time in a census and a [massive] and passive form, Rentrak is uniquely positioned to helping industry capitalize on these consumer mega-trends. \nSo I'll say it again as I said it before, too many people have misrepresented the simple truth. When you add VOD, DVR, and over-the-top ad-supported TV programming over the course of a month, TV viewing has never been healthier. To further talk about Rentrak's business is how it relates to the ecosystem. We are confident and committed to continue to provide the best state-of-the-art information to help our customers reach their target. \nThat's why on this call today, we are proud to announce that the Oracle Data Cloud has signed a partnership agreement with Rentrak for its businesses, which includes [Datalogix]. The agreement will allow our common customers to look at Rentrak's TV ratings and will expand our advanced demographic offerings for the benefit of advertisers and networks. \nThe agreement continues our promise to work with companies that are dedicated to providing programmers, advertising, and their advertising agencies with solutions they need to understand the consumer. You will hear your more about other strategic partnerships soon, so stay tuned. A record amount of the advertising business, about $30 billion worth, is currently under business review. \nAnd in our opinion, many agencies did not have a good understanding of how the power of TV works with digital. Brand owners have realized they need a complete picture of the consumer media usage. In other words, how the power of television works with digital. The agencies that will win or keep these billions of dollars of business are those that will use information from Rentrak and our partner companies. Most of the agencies involved in this major bake-off are using Rentrak. \nNow for a report on our business. Rentrak had another great quarter that demonstrated our operating leverage in our business of precisely measuring movies and TV everywhere. In the quarter, we entered a record number of new contracts, expanded several long-term partnerships, and grew total Company revenue by 23%. The considerable operating leverage in our business drove our EBITDA margin to up nearly 10% and 3 percentage points above last year's quarter. \nMost importantly, because of our strong pipeline and strong macro trends for our services, we are very comfortable reiterating our full-year forecast guidance. David will discuss this in detail later in our call. Before moving to our product lines, I'd like to update you on Rubik, which we announced on our last call and is shown as slide 5. We are very excited to report that we now have 14 Rubik clients, having added four during the quarter. \nThat's a 40% growth rate in the short period of time. We came out of the gate strongly, with 10 initial clients who have been since on-boarded. We are getting a great reception and these clients are telling our prospects about their success using Rubik. We expect our client base to continue to grow over the coming months. You will recall that Rubik is the most comprehensive TV analytic platform available anywhere. \nThe platform turns something very complex, TV viewing, merged with the products viewers buy, how they vote, the cars they drive, into something very simple. By giving clients the ability to perform complicated analytics to help unlock the value of television programming and advertising content, Rubik provides buyers and sellers of advertising a better understanding on most relevant household targets and that's why the industry is [buying] us to help them in this complex buying and selling environment in television. \nAs you can see on slide 7, our network client base stands at more than 100 strong, including four of the five major broadcast networks. We recently signed National Cable Communications, also known as NCC. This is the advertising rep firm for all cable advertising. They signed to a national agreement to utilize Rentrak. At the same time, we're continue to expand our work in the automated TV planning and buying, through an expanded agreement with [Clip], a supplied [sign] programmatic platform. \nWe have been very aggressive in demonstrating the power of our services in advertising and branded entertainment and we had a great quarter in these areas. We are working with several major new brands that are using Rentrak information to better target customers, including a major CPG company with thousands of local brands, Petro-Canada and two Japanese auto manufacturers. You can see our branded entertainment product works on slide 8. \nOn slide 9 and 10, we demonstrate the success we had within the agency community. As a reminder, all of the top five agency holding companies subscribe to our national TV ratings service, as do 12 of the top 15 media agencies. We recently signed new agreements with several national agencies, including Cross MediaWorks, HypeFX Marketing, and JL Media, among several others. Since the beginning of FY16, we have signed 20 local agencies, two-thirds of which has told that they will be using and are using Rentrak as the exclusive or primary TV measurement currency. \nWe continue to be highly active on the political front, having secured relationships with organizations that represent the majority of the front runner candidates and their Super PAC for the 2016 presidential election. In addition to the presidential race, we are actively engaged with companies and clients representing committees, gubernatorial and senatorial races, as well as the PACs, for both the primary and general elections. \nAccording to a recent political article, more than $4.5 billion will be spent on the election cycle on political TV advertising and our clients are telling us the actual number will be far more than that. With these relationships in place, the vast majority of political TV spend will be affected by Rentrak TV. To paraphrase one of our clients, they said that stations and networks can bring in any information they choose, but they will only be using Rentrak to price and make buys. \nGiven that a network or station needs to buy our base TV service to get our political ratings, you can see why we are bullish on our full-year forecast. In the automotive category, we are now effective television advertising decisions with more than 15 major brands and we are very active in the recent [upfronts] with a number of additional brands. With the average age of cars on the road growing steadily, now up to 11.5 years, and record sales at the same time, the ability to target customers who need a new vehicle through television advertising is extremely valuable. \nOnly Rentrak can provide the granular information that is necessary for this type of targeting in the auto brands because they use the same type of targeting in digital. We are also making significant inroads in the consumer packaged goods and retail space, as evidenced by an expanded agreement with IRI that we signed in the quarter and we are announcing for the first time on this call. As you know, IRI is a strong innovator that has been a great partner to Rentrak for several years. \nOur new agreement combines IRI ProScore purchase propensity algorithms and consumer sales data with Rentrak's TV viewing information to link media exposure to actual purchases to drive greater media effectiveness for CPG companies. As we mentioned during our last call, we recently began focusing on a major category and that's the sports category and it's a relatively new vertical for us that we believe can be as big as auto and political. \nMost recently in the quarter, we signed an agreement with an NFL team, an NHL team, and Repucom, which is a leading provider of sports and information intelligence and the Canadian Basketball League. This important category provides sports marketers with the ability to leverage specific fan and consumer targets for television buying, sponsorship opportunities, and content values. \nWe are now working with more than 100 regional and local agencies that are using Rentrak's massive and passive TV viewership information to effectively support consumer targeting, segmentation, and the buying of TV advertising. We recently began working with a very large furniture retailer in seven local markets, as well as a very large regional healthcare provider utilizing Rentrak's local TV ratings in 18 markets. \nIf you take autos, political, and healthcare, that makes up about 60% of a TV station's revenue. By locking in these categories, Rentrak is a must-have for all television stations. Additionally, two major agencies have agreed to begin using Rentrak's local household and demographic ratings in the majority of all local television markets in the US. This is a strong validation for Rentrak local. \nNext, I'd like to discuss in more detail, local, on slide 11. We added 25 stations during the quarter, including expanded deals with Nexstar, which added six additional markets, taking our footprint with them to 67 stations across 38 markets, including their largest market of Phoenix, Arizona. And with Sinclair, we added 13 new markets, including their flagship in Washington, DC, bringing their total to 60 stations across 29 markets. \nAt the same time, we opened new local markets across the United States and added the number-one-rated television station in San Diego. Now we are working with more than 465 TV stations, representing 72 station ownership groups, and providing local market ratings services to 68% of the big four and owned-and-operated stations. In 69 client markets, we have at least three of the five major network affiliate stations, including eight of the 10 largest markets. \n30% of our local station customers are using Rentrak exclusively. Another 50% use both currencies, depending on the advertiser. We recently signed an agreement with Katz Television in all 210 local markets. Katz is the leading television sales company that represents more television stations and broadcast groups than any other firm in the country. Under the agreement, Katz we utilize Rentrak's full suite of local market ratings services, including our automotive and our political advanced demographics for all common client stations. \nNext I'd like to talk about our on demand business, where Rentrak has the only complete census measurement of all VOD transactions in the US. On demand viewing is stronger than ever, as shown on slide 13. VOD viewership has steadily increased, both in share of transactions and share of time spent viewing, and has doubled over five years. As I discussed earlier, we can see this is a mega-trend in 2015 and beyond. \nWe began recently just working with two new clients, Broad Green Pictures, who is using both Rentrak OnDemand product, and our own digital download product, and Lionsgate, who expanded their relationship with us. We additionally realize growth in our transactional on demand from rate increases on renewals. We have renewed in the quarter all major ad-supported VOD clients, including NBC Universal, AMC, CBS Films, and IFC, among others. Also in the quarter, we added Shaw Media as a new client. \nFor 10 years, Rentrak has been measuring the video on demand television, with the belief that one day it would become an important advertising platform. That day is today. Rentrak is also developing products for the buyers and sellers of dynamic TV advertising, or as the professionals like to call it, DAI. In these campaigns, we are providing insights to whether the ads were viewed and by whom in a partnership with Canoe Ventures. \nAs you know, Canoe is focused on delivering dynamic inserted advertising to video on demand programming and was formed by Comcast, Cox, Time Warner Cable, and Bright House. In fact, a trial utilizing Rentrak VOD ad data viewing habits from one of our Canoe MPVD (sic) partners was completed earlier this year and we expect to have a commercial product available soon. So stay tuned. Connecting the right ads to the right programming is how TV and digital are working together. \nI will end my discussion with our Movie Everywhere business, which is shown us slide 15 and 16. Rentrak is the real census currency at the box office, with more than 95% of the world screens covered, in the US and Canada, 99% of the screens covered. Our analytics products continue to attract new customers, including most recently, Open Road Films, which is co-owned by AMC and Regal Cinemas. \nAccording to a recent article in Forbes Magazine, studios spend an average of $30 million on a typical PG-13 action film. Given what's at stake, it is very important that ad dollars are being put to work most effectively. Rentrak's PreAct and PostTrak products provide critical information that allow content creators to adjust their marketing campaigns in nearer real-time to better manage their budgets. These analytics products have a big future ahead of them. \nWe are also moving forward with our electronic box office reporting product that we call eBOR. We are currently processing large amounts of data through a beta test, which includes 13% of the 35,000 screens in North America. We initiated test feeds to Sony for the recent release of Pixels and three of the seven major studios have committed to use our new service. \nOur system is currently serving up reports in North America and we expect to begin generating revenue in our fiscal fourth quarter. We also plan to make eBOR available in all Rentrak international countries simultaneous with our US expansion over the next several months. Finally, and for the first time on this call, I'm pleased to announce a new and exclusive arrangement with MovieTickets.com. \nWith this agreement, we are developing joint products using MovieTickets' consumer information in privacy-compliant way. We plan on merging our TV viewing information with our ticket sales information, linked with MovieTickets.com information to help studios better target television advertising and to interpret the effectiveness of their ad campaigns. Combined with our other analytics offerings, the products further strengthen our ability to help studios effectively manage their business. \nThis partnership combines two of Rentrak's major areas of expertise, movies and television. Linking individual-level ticket purchasing with TV viewership information unlocks a suite of marketing and planning and ROI measurement tools for the movie and television industries. As you can tell, I remain very excited about our future opportunities and how we are going to monetize them here at Rentrak. Now I'm going to turn the rest of the call over to David for our financial results. David? \n\nDavid Chemerow, Rentrak Corporation - COO and CFO [3] \n\nThank you, Bill. Before we begin, please note that my remarks today relating to FY15 results are from continuing operations which exclude the PPT businesses sold in January. FY16 results do not include discontinued operations since the sale took place before the start of the year. As you can see on slide 18, total Company revenue for the FY16 first quarter was $27.5 million, up 23% from $22.3 million for last year's first quarter. \nOn the same slide, you will find our revenue breakdown by product line. TV Everywhere grew 49% to $15.6 million compared with last year's first fiscal quarter. Revenue declined slightly on a sequential bases. As we've discussed Rentrak and Kantar had several common customers, and as expected, those customers only retained their Rentrak contract after March 31 when our systems were fully integrated. \nExcluding Kantar, TV revenue grew by $1 million, or 7% on a sequential basis, which is the highest sequential rate of growth we've had in this product line since last year's second fiscal quarter. Movies Everywhere grew to $7.6 million. On a constant currency basis, this product line grew 8%. Foreign exchange had a negative 5 percentage point impact. \nAs a reminder, we expect Movies Everywhere growth to be more pronounced in the back half of FY16, as we book large domestic studio renewals and begin to record revenue from eBOR. OnDemand Everywhere grew 18% to $3.8 million, primarily resulting from continued increased agency use of the OnDemand platform, a trend we expect will continue. Other services was $500,000 compared to $1.2 million for last year's first quarter. \nMoving to slide 19, gross margin was 64% of revenue for the FY16 first quarter compared with 66% for the prior-year period. The reduction related to changes in revenue mix, since TV revenues have grown substantially and carry a lower margin than our other product lines, as well as the addition of DirecTV and Cox as new MVPD data providers for our TV Essentials product. \nOperating expenses totaled $15.6 million for the first quarter of FY16 compared with $16.1 million last year. For the FY16 period, we adjusted our earn-out arrangement with iTVX and recorded a benefit of $3.7 million because it was determined that only the minimum earn-out would be achieved. Let me take a moment to further talk about the iTVX acquisition, which was completed in August of 2013. \nWe paid $750,000 for iTVX, plus an earn-out based on its revenue two years later. iTVX has become the core of our branded entertainment and sports businesses, and we have renamed it Rentrak Branded Entertainment. We are in the midst of converting the business from a custom business to a syndicated one, which will be much more efficient. As such, it has grown a little more slowly than contemplated by the earn-out. \nHowever, the business is now ramping up and will be a significant contributor to Rentrak's growth. Because of where we are versus a very aggressive earn-out schedule, the sellers are willing to accept approximately $500,000 in cash, in full satisfaction of our earn-out obligations. We made that payment in July. And you'll see on slide 20, our FY16 first-quarter operating income was $2 million versus an operating loss of $1.4 million last year. \nFor the FY16 period, operating income before items would've been $345,000, which excludes $1.8 million in stock -based compensation costs, and $213,000 in acquisition costs, offset by the $3.7 million iTVX-related benefit. For the FY15 period, our operating loss would have been $122,000, which excludes $1.7 million in stock-based compensation costs and $46,000 in acquisition costs, partially offset by a $500,000 benefit related to the iTVX earn-out. \nOur income from continuing operations net of income taxes was $1.5 million, or $0.10 per diluted share, compared with a loss of $1.4 million, or $0.11 per share, for the same period last year. Excluding the items already discussed for both periods, as well as the net loss attributable to non-controlling interest, our loss from continuing operations net of income taxes would have been $157,000, or $0.01 per share for the FY16 first quarter compared with a loss from continuing operations of $131,000, or $0.01 per share, for the same period last year. \nOur after-tax results were affected by our tax rate, which was 30% last quarter, compared with a benefit of 2% for last year's first quarter. Adjusted EBITDA increased to $2.7 million, or 9.7% of total revenue for the first quarter of FY16, versus $1.5 million, or 6.9% of total revenue, for the same period last year. These numbers exclude the iTVX adjustment in both periods. To reiterate, we continue to project full-year adjusted EBITDA in the range of 16% to 18%, with a long-term target of 35%, as you can see on slide 21. \nWe used $3 million from cash for operating activities for the FY16 first quarter, versus approximately $600,000 for the FY15 first quarter. The primary use of cash was for payments to Kantar for transition services related to our acquisition of their US media assets, and related to the sale of our PPT business. We continue to expect to generate positive free cash this year. Cash, cash equivalents, and marketable securities were $79 million at June 30, 2015 versus $84 million at the end of FY15. As a reminder, we have no debt and a fully funded business plan. Capital spending for the first quarter of FY16 was $2.9 million. \nOn slide 22, you'll find our reiterated outlook for FY16. We continue to forecast growth in total revenue of 36% to 39% and TV Everywhere growth of 55% to 65%. As Bill mentioned, there will be some lumpiness in our quarterly results, primarily related to the much larger contracts we are now signing. As we told you last quarter, we believe that it is better for shareholder value creation not to be held hostage to quarterly targets because potential clients know these targets and use that information to negotiate with too much leverage against us. \nIt is far better for us to have the flexibility of being able to wait a while to maximize the deal. Our adjusted EBITDA target is in the range of $23 million to $26 million or 16% to18% of revenue. In dollars, this target is 4 to 5 times FY14 levels and nearly twice FY15's level. We continue to expect full-year capital spending of approximately $13 million to $14 million. We anticipate tax expense for the full year of approximately $4 million, most of which is expected to be non-cash. We are forecasting approximately 16.4 million fully diluted weighted average shares outstand. \nWe remain very optimistic about Rentrak's ability to continue generating significant revenue growth and expanding margins as our business continues to scale. Bill and I thank you for your continued support and interest. We look forward to seeing many of you at our upcoming conference appearances and at our investor day to be held on October 1. A save-the-date notice was sent out last month and a formal invitation will be sent in the coming weeks. Operator, we are now ready to take questions from the audience.", "external_links": [], "published": "2015-08-11T10:12:00.000+03:00", "crawled": "2015-08-12T03:24:11.405+03:00", "highlightTitle": ""}