{"organizations": [], "uuid": "819d1dc8f053e217321b18b8be294191fc0a6796", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508312467.html", "country": "US", "title": "Africa: What Africa Can Learn From China About Growing Its Agribusiness Sector", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: What Africa Can Learn From China About Growing Its Agribusiness Sector", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T17:08:00.000+03:00", "replies_count": 0, "uuid": "819d1dc8f053e217321b18b8be294191fc0a6796"}, "author": "", "url": "http://allafrica.com/stories/201508312467.html", "ord_in_thread": 0, "title": "Africa: What Africa Can Learn From China About Growing Its Agribusiness Sector", "locations": ["Africa", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "East Africa: WHO Vaccines Are Safe, They Undergo Tough Tests \nThe role of the small players \nThe potential growth of Africa's food and beverage markets will only be possible with adequate investment in small and medium-sized agribusiness enterprises. \nSmall African firms engaged in agribusiness greatly outnumber the large players. Former Malawian president Bingu Wa Mutharika observed: \nIn West Africa, 75% of agriculture-related firms are micro or small enterprises, 20% are semi-industrial, and 5% are industrial. \nValue chains in many African countries feature an informal chain that serves lower-income consumers and a formal chain that caters for high-income domestic consumers or exports. In many sectors the vast majority of the volume moves through the smaller, less formal businesses. More than 95% of the fruit and vegetables produced in Kenya move through smallholders and small and medium enterprises (SMEs). \nPolicymakers need to support agribusiness and technology incubators, export-processing zones and production networks. They must also sharpen the skills associated with these sectors. \nBanks and financial institutions also play key roles in fostering technological innovation and supporting investment in homegrown businesses. Unfortunately, their record in promoting technological innovation in Africa has been poor. \nCapital markets have played a critical role in creating SMEs in developed countries. They bring money to the table and also help groom small and medium-sized start-ups into successful enterprises. Venture capital in Africa, however, barely exists outside South Africa. \nAfrican countries also need to make a concerted effort to leverage expertise in the diaspora. This cohort provides links to existing know-how, establish links to global markets and train local workers to perform new tasks. \nMuch is already known about how to support business development. The available policy tools include: direct financing via matching grants; taxation policies; government or public procurement policies; advance purchase arrangements; and prizes to recognise creativity and innovation. \nThese can be complemented by simple ways to promote rural innovation that involve low levels of funding, higher local commitments and consistent government policy. For example, China's mission-oriented \"Spark Program\", created to popularise modern technology in rural areas, had spread to more than 90% of the country's counties by 2005. \nWhat China did for small businesses \nThere is growing evidence that the Chinese economic miracle is a consequence of the rural entrepreneurship which started in the 1980s. This contradicts classical interpretations that focus on state-led enterprises and receptiveness to foreign direct investment. \nMillions of township and village enterprises were created in provinces like Zhejiang, Anhui and Hunan. This played a key role in stimulating rural industrialisation. Over the past 60 years, China has experimented extensively with policies and programmes to encourage the growth of rural enterprises. These include providing isolated agricultural areas with key producer inputs and access to post-harvest, value-added food processing. \nBy 1995, China's village enterprises had helped bring about a revolution in the country's agriculture. They had evolved to account for approximately 25% of GDP, 66% of all rural economic output and more than 33% of total export earnings. Most of them have become private enterprises that focus on areas outside agricultural inputs or food processing. \nChina's initial rural enterprise strategy focused on the so-called five small industries it deemed crucial to agricultural growth: chemical fertiliser;", "external_links": [], "published": "2015-08-31T17:08:00.000+03:00", "crawled": "2015-08-31T17:57:57.879+03:00", "highlightTitle": ""}