{"organizations": ["Google"], "uuid": "c346c6aba17395e9d370cf1b5cf709c106e7b4e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/zXpkdc32gbG1CL8D0UsY2w--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/72852cc63cdabc2ef6df2683e30f34feca30febd_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/sundar-pichai-little-known-chief-232054246.html", "country": "GB", "title": "Sundar Pichai: the little-known new chief of Google", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Sundar Pichai: the little-known new chief of Google", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T02:20:00.000+03:00", "replies_count": 0, "uuid": "c346c6aba17395e9d370cf1b5cf709c106e7b4e5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/sundar-pichai-little-known-chief-232054246.html", "ord_in_thread": 0, "title": "Sundar Pichai: the little-known new chief of Google", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sundar Pichai"], "text": "View Photo \n\nHis name may not ring a bell, but chances are you know some of the products Google's new CEO, Sundar Pichai, has worked on, including the Chrome browser and Android mobile operating system. \nPichai, 43, was named chief executive officer of the Internet titan Monday, as Google unveiled a new corporate structure creating an umbrella company dubbed Alphabet. \nPichai will oversee the biggest company under that umbrella, which will still be called Google and will continue to include some of Google's best-known products, including its search engine, ads, maps, apps, YouTube and Android system. \nAlphabet will be run by Google chief Larry Page, who showered praise upon Pichai, the current senior vice president of products. \n\"I feel very fortunate to have someone as talented as he is to run the slightly slimmed down Google and this frees up time for me to continue to scale our aspirations,\" Page said in a blog post. \nHe said he was impressed with Pichai's \"progress and dedication to the company\" and promised to continue to groom him, who has been at Google since 2004. \n\"I have been spending quite a bit of time with Sundar, helping him and the company in any way I can, and I will of course continue to do that.\" \nIn his current role, Pichai oversees product management, engineering and research for Google's products and platforms, according to Google's filing at the US Securities and Exchange Commission. \nBefore that, he was SVP of Google Android, Chrome and Apps, working on consumer products \"used by millions of people,\" the filing said. \nPichai was part of the team that launched the Chrome browser in 2008 and, prior to that, worked on various search products, including Google Toolbar, Desktop Search, Gadgets, and Google Gears and Gadgets, according to Business Insider magazine. \nBefore joining Google, Pichai worked as an engineer at manufacturer Applied Materials, followed by a stint in management consulting at McKinsey & Company, according to Business Insider. \nUS media described him as soft-spoken, little-known, and a long-time right-hand man to mentor Page. \nOriginally from Tamil Nadu province in southeast India, Pichai received a Bachelor of Technology from the Indian Institute of Technology Kharagpur. \nHe also has a Master of Science from Stanford University and a Master of Business Administration from the Wharton School of the University of Pennsylvania. \nPage said Pichai is the man to steer the Google ship in the coming years, as it continues to innovate and expand its product base. \n\"Google itself is also making all sorts of new products, and I know Sundar will always be focused on innovation?continuing to stretch boundaries,\" he said. \n\"I know he deeply cares that we can continue to make big strides on our core mission to organize the world's information.\"", "external_links": [], "published": "2015-08-11T02:20:00.000+03:00", "crawled": "2015-08-11T02:28:43.879+03:00", "highlightTitle": ""}