{"organizations": ["Goldman Sachs", "Teesta Urja", "Vijaykumar TV", "Asian Genco", "ET Bureau", "Norwest Partners", "Everstone Capital", "General Atlantic", "Asian Genco Relief", "HSBC", "Norwest", "Morgan Stanley"], "uuid": "910a1b481dee0ea1f21104131c0a0b3c33df4317", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/thumb/msid-48737618,width-600,resizemode-4/sikkim.jpg", "site_section": "http://economictimes.indiatimes.com/rssfeeds/1286551815.cms", "section_title": "Finance-Economy-News-The Economic Times", "url": "http://economictimes.indiatimes.com/news/economy/finance/relief-for-private-equity-funds-as-sikkim-government-may-buy-back-assets-from-asian-genco/articleshow/48737611.cms", "country": "IL", "title": "Relief for private equity funds as Sikkim government may buy back assets from Asian Genco", "performance_score": 0, "site": "indiatimes.com", "participants_count": 0, "title_full": "Relief for private equity funds as Sikkim government may buy back assets from Asian Genco", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T02:43:00.000+03:00", "replies_count": 0, "uuid": "910a1b481dee0ea1f21104131c0a0b3c33df4317"}, "author": "", "url": "http://economictimes.indiatimes.com/news/economy/finance/relief-for-private-equity-funds-as-sikkim-government-may-buy-back-assets-from-asian-genco/articleshow/48737611.cms", "ord_in_thread": 0, "title": "Relief for private equity funds as Sikkim government may buy back assets from Asian Genco", "locations": ["Andhra Pradesh", "Sikkim", "Hyderabad", "Gujarat", "Teesta", "Arunachal Pradesh", "MUMBAI", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Himachal Pradesh", "Asian Genco", "Genco", "Vijaykumar", "Baiju Kalesh", "Everstone"], "text": "Relief for private equity funds as Sikkim government may buy back assets from Asian Genco By Baiju Kalesh , ET Bureau | 31 Aug, 2015, 05.13AM IST ET SPECIAL: Love visual aspect of news? Enjoy this exclusive slideshows treat! MUMBAI: In what could be one of the largest asset-buybacks by a state, the Sikkim government may buy back assets from infrastructure firm Asian Genco as it failed to develop the proposed projects in the north-eastern state. The state government's decision might bring relief to bigticket global private equity players, which have nearly written off a $425 million investment in Asian Genco, which owns several power assets. As part of the proposed arrangement, Asian Genco, which owns the 1200-MW partly completed Teesta hydro power project in Sikkim, will hand over the asset to the state government for Rs 600 crore, according to several people familiar with the development. \"There is a consensus among private equity funds and they are more or less fine with this arrangement. A final decision is expected soon,\" said one of the persons mentioned above. \"The funds are recovering some of the money, which they have nearly written off.\" The transaction would be under state sovereign rights as the firm failed to meet project obligations, paving the way for larger cost escalations, making it almost unviable. An earthquake in Sikkim had further spoilt the plot, damaging major equipment and delaying construction, said another person. The Sikkim government holds 26% in the special purpose vehicle for the project, Teesta Urja, in which Asian Genco holds a majority. The investment will end with the government owning 51% while the PE investors' stake will reduce. Apart from Teesta, the company has two hydro power assets in Arunachal Pradesh and Himachal Pradesh , a gas-based and thermal project in Andhra Pradesh and a wind farm in Gujarat. Big-ticket investors such as funds managed by Goldman Sachs, Morgan Stanley , General Atlantic, Everstone Capital and Norwest Partners have together invested $425 million in the firm in 2010. Since then, differences have cropped up between the funds and the company promoters. Investors had initiated arbitration proceedings against Asian Genco, and its chief promoter Vijaykumar TV, for management control and to recover their funds. As of now, investors hold majority in the company, with no voting rights, sources said. In turn, Vijaykumar had filed a complaint in a Hyderabad court arguing that the PE funds were trying to take away all the money from his company. There was a warrant against directors of all the big buyout funds to be present for questioning, according to various media reports. When contacted, General Atlantic declined to comment, Everstone did not respond to calls while Morgan Stanley, Norwest and Goldman Sachs could not be reached for comment. Indian asset owners' lack of urgency to cut debt will continue to restrict their ability to capture growth, HSBC said in a note about India's infrastructure and power sector. \"Who blinks first is not important; investors lose. Indian asset owners have shown limited willingness to cut debt by selling off assets. Their stubbornness to hold assets in anticipation of better valuation despite a weak operating outlook suggests near term earnings and valuation will remain under pressure,\" HSBC said. \"We argue that investors during the current cycle are unlikely to be forthcoming in funding overleveraged asset owners,\" it added.  ", "external_links": [], "published": "2015-08-31T02:43:00.000+03:00", "crawled": "2015-08-31T05:22:56.437+03:00", "highlightTitle": ""}