{"organizations": [], "uuid": "7fb73e74ddcf532706284552209223be15ebe5bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/99f067ae-ca98-4710-917b-20746d027bfd.img", "site_section": "http://www.ft.com/rss/personal-finance", "section_title": "Personal Finance", "url": "http://www.ft.com/cms/s/0/eee7e85a-3f6f-11e5-9abe-5b335da3a90e.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "country": "US", "title": "Savers favour new pensions tax reliefs", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Savers favour new pensions tax reliefs", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T19:32:00.000+03:00", "replies_count": 0, "uuid": "7fb73e74ddcf532706284552209223be15ebe5bb"}, "author": "", "url": "http://www.ft.com/cms/s/0/eee7e85a-3f6f-11e5-9abe-5b335da3a90e.html?ftcamp=published_links%2Frss%2Fpersonal-finance%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Savers favour new pensions tax reliefs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Isa", "Judith Evans"], "text": "Savers favour new ‘pensions Isa’ in poll Judith Evans ©Dreamstime \nRetirement savers have signalled their support for radical government proposals to treat pensions more like individual savings accounts (Isas) in a new poll that shows strong appetite for a simplified tax relief system. \nWhen asked to choose the most appealing pensions tax system, only 27 per cent of working adults chose the current set-up, with the remainder choosing other options, according to the survey by PwC. More Pension scam losses treble after reforms \nThe most popular choice, with 41 per cent support, was for the government to tax pension contributions but for pensions to be distributed tax-free upon retirement — the Isa-like option under consideration by the chancellor, George Osborne. Respondents said this would help them to plan better, as they would not need to factor in tax deductions in retirement. \nThe ability to take a pension tax-free would be the most popular incentive to save more, according to the survey of 1,197 working adults. \nOnly one in seven said the existing tax exemptions on pension contributions, which are combined with taxation at retirement, provided an incentive to save. \nFollowing changes to the details of pensions tax relief in recent budgets, 61 per cent of respondents said that they were put off pensions saving because “the government keeps changing how pensions are taxed”. \nWhy IFAs are scared to advise on pensions freedoms \nApril’s pensions revolution has presented a bewildering array of investment choices for the over 50s, so it’s ironic that when it comes to getting advice, the options are constricting. This week, the government began yet another consultation in the wake of the new freedoms — this time, to assess whether an “advice gap” exists. \nAlmost as many respondents said they were deterred because they did not understand how much they needed to save and because the system was too complicated. \nTwo-thirds of people were unable to identify the current system when given a choice. \n“People want a once in a lifetime overhaul of how pensions are taxed to create a simple and stable system which they can understand and trust,” said Philip Smith, head of PwC’s defined contribution pensions team. \n“However, moving to a new tax system for pensions is no easy task for an industry that is already grappling with the pensions freedom changes.” \nFrom April, pensioners have had far more freedom in how they use their pension savings, leading to a drop in sales of annuities and a move towards income drawdown products — changes to which the industry is still adapting. \nRaj Mody, head of pensions consulting at PwC, cautioned that “any reform must not reduce incentives for individuals to save for the long term”. \n“Upfront reliefs can be a very important element and they also help make it clear that pensions are intended to be different — for long-term saving.” \nThe government last month said it would consult on whether to reform pensions tax relief to “strengthen incentives to save, offering savers greater simplicity and transparency”. \nIt is considering reversing the current system to create an Isa-style regime, but could also take less drastic steps such as altering the lifetime and annual pension saving allowances. Related Topics Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-08-10T19:32:00.000+03:00", "crawled": "2015-08-11T02:31:47.205+03:00", "highlightTitle": ""}