{"organizations": [], "uuid": "e1d7641b9db0cc3f97a6f110cce2140f3c2a2212", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/06/usa-oil-sewage-idUSL1N10G3YC20150806", "country": "US", "title": "RPT-Sewage flow becomes Williston's oil bust indicator", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "RPT-Sewage flow becomes Williston's oil bust indicator | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T15:00:00.000+03:00", "replies_count": 0, "uuid": "e1d7641b9db0cc3f97a6f110cce2140f3c2a2212"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/06/usa-oil-sewage-idUSL1N10G3YC20150806", "ord_in_thread": 0, "title": "RPT-Sewage flow becomes Williston's oil bust indicator", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Repeats to additional subscribers without changes to text)\nBy Ernest Scheyder\nWILLISTON, N.D. Aug 6 (Reuters) - The population of a U.S. oil boomtown that became a symbol of the fracking revolution is dropping fast because of the collapse in crude oil prices , according to an unusual metric: the amount of sewage produced.\nWilliston, North Dakota, has seen its population drop about 6 percent since last summer, according to wastewater data relied upon heavily by city planning officials.\nThey turned to measuring effluent because it was a much faster and more accurate way to track population than alternatives such as construction permits, school enrollment, tax receipts or airport boardings.\nU.S. Census Bureau figures are usually too old as a full-fledged population count only happens once a decade, with sporadic updates in between. That's not going to catch any swift changes in the population of cities like Williston.\n\"Here in Williston, the growth rate is not predictable,\" said David Tuan, director of the city's public works department. \"Measuring wastewater flow tends to be the most-efficient way to track population.\"\nThe recent high-water mark for Williston's population was 33,866 in August of last year, just before the oil price collapse. Crude oil has fallen more than 50 percent in the past year and hurt many companies' finances, leading to massive cost cutting, including the cancellation of projects and lay offs.\nBy June of this year, the town had shrunk to 31,800 people, according to the sewage data.\n\"I attribute that to the slowdown in oil prices,\" said Tuan.\nAmong the companies who have made big job cuts here are Halliburton Co and Schlumberger NV, alongside many smaller peers.\nWilliston's restaurants and retailers still bustle with activity most days, but many newly built apartment complexes are less than 80 percent full, according to real estate experts as supply overtakes demand.\nCity officials began studying sewage data after struggling to know how many people were pouring into their city during the boom. The latest Census estimate, from July 2014, shows just 24,562 residents in Williston.\nLocal officials now estimate the population by dividing daily effluent flow by 75, the number of gallons of wastewater each resident is estimated to produce each day. Weather and construction can affect the flows.\nWhen figuring out how large to make a sewage treatment plant, engineers have long multiplied the number of residents by the 75 gallon rule of thumb. Williston simply inverts this formula, a method academics have touted for its accuracy in measuring population.\nIn contrast, authorities in some cities - such as New York - track housing supply and usage to estimate population.\nOther data points show a contracting economy: Williston's taxable sales fell 8.5 percent in the first quarter to $601.9 million, according to state data.\nThe contractions could portend an ominous turn for Williston, ranked as the fastest-growing small city in America for the past three years.\nMany locals painfully recall two previous oil booms and busts in the 1950s and 1980s, when the local newspaper was filled with home foreclosure notices and the city government was left deep in debt.\nNor is the pain relegated to Williston. Midland, a key oil hub city in west Texas, saw a planned 58-story skyscraper canceled last year as the oil price slid.\nWilliston is betting the growth will return, though some analysts are predicting oil prices will stay around $50 per barrel for some time.\nThat may mean the city's population won't double to 60,000 by 2020, as demographers have forecast. A new sewage plant - which is currently under construction and due to open in two years - was designed to handle that population spurt. (Reporting by Ernest Scheyder; Editing by Terry Wade and Martin Howell)", "external_links": [], "published": "2015-08-06T15:00:00.000+03:00", "crawled": "2015-08-06T14:07:55.561+03:00", "highlightTitle": ""}