{"organizations": [], "uuid": "e6a30049b995599368d1796eefe9e820803e3725", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508310230.html", "country": "US", "title": "Africa: As the Need for Power Surges, Are Small - or Big - Dams the Answer?", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Africa: As the Need for Power Surges, Are Small - or Big - Dams the Answer?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T09:55:00.000+03:00", "replies_count": 0, "uuid": "e6a30049b995599368d1796eefe9e820803e3725"}, "author": "", "url": "http://allafrica.com/stories/201508310230.html", "ord_in_thread": 0, "title": "Africa: As the Need for Power Surges, Are Small - or Big - Dams the Answer?", "locations": ["U.S.", "Africa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Africa: Developing Nations Need U.S.$133 Billion Geothermal Investment By 2030 - Report \n\"When you build a mega dam  your land acquisition and inundation creates a great level of displacement. This is a disastrous plan and not true development,\" charged Rajendra Singh, an Indian water activist and winner of this year's Stockholm Water Prize for his efforts in protecting rivers and boosting rainwater harvesting. \nSingh, speaking at World Water Week in Stockholm, said building small-scale dams - rather than huge ones - may be a more effective way to protect poor people while increasing access to clean power. \n\"Build your dam on the river, just before the bend, and communities can still use the free flow of water,\" he urged, drawing a serpentine line on a piece of paper. \"You can still produce energy, though in a smaller scale, and you can still ensure people's rights to use the water.\" \nAt present, about 160 countries worldwide use hydropower technology for power generation, according to Adnan Amin, director-general of the International Renewable Energy Agency. The power produced amounts to just under 16 percent of the world's total electricity generation, he said. \nIn more than 50 countries, hydropower plants provide at least 50 percent of the total electricity supply. An increase in this number, Amin said, is crucial if the world wants to shift to a sustainable society. \nThat is particularly true in Asia and sub-Saharan Africa, where much of the world's population growth is expected to occur by 2050, experts say. \nBuilding small-scale hydropower facilities can make sense, Amin said - but he warned they may not be up to meeting the coming demand. \n\"There is a strong business case for small hydro projects, but we are also facing a situation where the energy demand in Africa is set to triple and in Asia Pacific it will double by 2050. So we have to explore all possibilities,\" he said. \n\"If we look at the developing countries with large power needs, large water needs, growing populations, we have to find power and water sources that can support this growth in the future. It's very difficult to forego opportunities to develop clean power (and) irrigation because of some skeptics,\" he said. \nTHREAT TO LOCAL PEOPLE \nBut research in West Africa by the UK-based International Institute for Environment and Development, a research and policy group, suggests that building of large-scale dams is leading to widespread displacement of people there. \nSeven dams in West Africa, six of them in the Niger basin, have led to about 237,000 people losing their homes or land, researchers found. \nMany have had difficulty finding new ways to make a living, researchers said. In Burkina Faso, a planned tomato processing plant and fish stocking facility, promised to help provide new jobs, have yet to be built and in Senegal and Burkina Faso, over-fishing in dam reservoirs by displaced families who turned to fishing has led to conflict among fishermen, one study found. \nNouradine Zackaria Toure, the chief of a dam-affected village in the Gao region of Mali, said nine countries in West Africa today have 150 dams, with 40 more planned in the region. That has led to displacement, a lack of irrigated land, forced migration and conflicts over scarce food and water, he said. \nDams in West Africa, though built with the best of intentions, are failing to benefit the poorest of the communities, he said on the sidelines of the meeting. \nIn particular, the energy and the water produced by the dams is reaching others, but not those displaced by the projects, said Toure, who also heads a network of riverside communities in the Niger Basin, the Regional Coordination Group of Users of the Niger Basin (CRUBN). \nHe said the size of dams is less important than ensuring local communities share in their benefits, including access to the energy they produce and sufficient water to irrigate their fields. Dam-displaced communities must also have a genuine voice in deciding what should happen to them, he said. \n\"We don't care about the size. We just want our rights over land and water and energy to be respected,\" he said. \nSingh, of India's Rajasthan state, said the problem is that many dams and hydropower projects are designed to meet a country or region's growing water and energy needs, but at the cost of curbing the rights of people and communities living near them. \nIn India and elsewhere Asia, dams are in some cases reducing or ending community ownership or access to water and land near it, and are often the root cause of conflicts, he said. \nThe Tipaimukh dam, now under construction in northeast India, for example, is set to displace or affect the fishing or water access of about 100,000 people in India and Bangladesh, activists in the region say. \n\"Community rights have become scarce and mainly because of that, water has become scarce for people,\" he said. To prevent that problem widening, Asia must find ways to tap rivers without ending people's rights to them, largely by building small dams rather than large ones, he said. \nAmin, of the International Renewable Energy Agency, admitted there have been some negative impacts from large dams in the past, especially in countries like Brazil. But such problems are increasingly a thing of the past, he said, and builders are now ready to learn from past mistakes. \nWhile the costs and benefits of building large dams needs to be weighed, the \"greater good\" is what's important, he said. \n- Reporting by Stella Paul; editing by Laurie Goering; Please credit the Thomson Reuters Foundation Africa \nAs tens of thousands of refugees continue to flee conflict-ridden countries, including Afghanistan, Iraq, Libya and … see more » Copyright © 2015 Thomson Reuters Foundation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-31T09:55:00.000+03:00", "crawled": "2015-08-31T10:15:32.613+03:00", "highlightTitle": ""}