{"organizations": [], "uuid": "1aead0ceb487c2b306f782aa201d763b47b1b17a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12897621.htm", "country": "US", "title": "Announcement of Feature-Enhanced AccountMate 9.3 Software Release", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Announcement of Feature-Enhanced AccountMate 9.3 Software Release", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "1aead0ceb487c2b306f782aa201d763b47b1b17a"}, "author": "Donna DeRosa", "url": "http://www.prweb.com/releases/2015/08/prweb12897621.htm", "ord_in_thread": 0, "title": "Announcement of Feature-Enhanced AccountMate 9.3 Software Release", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AccountMate Software Corporation has released its update of their flagship AccountMate product line. This latest Build of AccountMate 9.3 for SQL is another example of the consistently updated customizable business management and accounting solution. David Dierke, President & CEO of AccountMate, was Quote: d, “To continue with our commitment for consistent product releases, it is my pleasure to announce the release of AccountMate 9.3 for SQL. Based on requests from AccountMate clients and our valued solution providers, this latest system update continues with our tradition of providing ever-improving financial software for the mid-market.” Key to this AccountMate 9.3 software update is the flexibility for clients managing inventory and invoicing to streamline the creation of Accounts Receivable invoices for line items from multiple warehouses. It also allows a client to generate one invoice for multiple shipments from different warehouses rather than having to generate one invoice for each of their warehouses. These timesaving new features save AccountMate clients both time and employee resources.\nIn this AccountMate 9.3 release, a new option to recalculate inventory beginning balance has been added in the Data Manager function. This configuration to recalculate the inventory item beginning as of a specific period and is valuable in the event that the inventory bin and inventory warehouse quantity and total cost to not match the Inventory Transaction Log quantity and cost. This way, the system helps fix inventory data inconsistencies and ensures generation of proprietary and accurate reports.\nEnhancements for optimized reporting in the inventory transaction logs and reports have been included to help in the verification of amounts, on-hand quantity and costs.\nMore requested enhancements by the AccountMate Solution Providers and their clients have been included in this latest build release. These are a result of prioritization by AccountMate Solutions Providers that work directly with AccountMate clients. This is AccountMate Software Corporation’s guarantee of the highest type of direct reseller feedback in order to continuously improve their products like this AccountMate 9.3 for SQL system release.\nAbout AccountMate\nFounded in 1984, AccountMate develops and markets fully modifiable business accounting software. Systems range from single user versions to those that support hundreds of users simultaneously. AccountMate software is available for local or cloud installation. It is distributed exclusively through a worldwide channel of authorized solution providers. AccountMate Software Corporation can be reached at (800) 877-8896 or at accountmate.com.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5hY2NvdW50bWF0ZS5jb20="], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-11T13:34:55.633+03:00", "highlightTitle": ""}