{"organizations": [], "uuid": "969a345f347ddbcc2738e6c0f90c3d7eb313c157", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/Building-construction-Re2s.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/economy/indian-construction-slowdown-hits-pm-narendra-modi-jobs-promise/126297", "country": "IE", "title": "Construction slowdown hits PM Narendra Modi’s jobs promise", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Construction slowdown hits PM Narendra Modi’s jobs promise | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T19:52:00.000+03:00", "replies_count": 0, "uuid": "969a345f347ddbcc2738e6c0f90c3d7eb313c157"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/economy/indian-construction-slowdown-hits-pm-narendra-modi-jobs-promise/126297", "ord_in_thread": 0, "title": "Construction slowdown hits PM Narendra Modi’s jobs promise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After a decade labouring on building sites around New Delhi, Akhilesh Kumar lost his scaffolding job last month when his employer halted work on an array of 30 residential towers.\nHe joins more than half a million workers let go from sites around India’s capital in the last 18 months, in a stark sign that the ground reality in Asia’s third-largest economy is far from as rosy as official data suggests.\nThe deepening downturn in India’s crucial real estate sector makes it easily understandable why Prime Minister Narendra Modi ’s image as the country’s economic saviour has lost its lustre just over a year after his resounding election victory.\n“If I don’t get another job, I have no other choice but to go back to my village and work as a farm labourer,” said Kumar, who is in his twenties.\nThe decade-long construction boom in burgeoning cities like Noida, where Kumar earned $165 a month, lured millions of labourers from rural hinterlands in search of a better life, creating one in every three new jobs.\nThat process is now going into reverse, undermining Modi’s promise to create more employment for the one million Indians who join the workforce every month.\nIndebted developers are cutting staff as they slow work on existing projects and postpone new buildings until they clear a backlog of 700,000 unsold homes.\nA law to clamp down on “ black money ” flows that fund as much as a third of real estate deals is further squeezing demand.\nAcross India, housing starts fell 40 per cent in the first half of the year, consultancy Knight Frank said. Cement output grew 0.9 per cent between April and June, down from 9.6 per cent a year earlier when Modi took office, government data show.\n“The slowdown in the construction sector is very, very depressing which will have a negative impact on the overall GDP growth numbers in the first quarter of the current fiscal year,” said Samantak Das, chief economist at Knight Frank India.\nRating agency Moody’s last week cut India’s growth forecast to 7 per cent for this fiscal year, against the government’s target of 8 to 8.5 per cent.\nIndia releases its GDP figures for the April-June quarter on Monday.\nHEADING HOME\nThe lack of jobs is already being felt in Bihar, source of many of the labourers toiling near Delhi.\nIn Patna, eight out of 20 labourers contacted by Reuters had this year made the 1,000 kilometre (600 mile) trip back from Delhi because they could not find work – pressuring salaries in a region where wages are already low.\nAccording to brokerage Ambit Capital, rural wages may now be falling after growing 4 per cent in the year to March – a far cry from the double-digit annual rises between 2010 and 2014.\n“Labourers are starving and are ready to work even at lower wages as there are fewer or just no jobs in the construction markets,” said Navendu Kumar Thakur, Patna chairman of the Builders Association of India.\nThe squeeze comes at a bad time for Modi.\nBihar heads to the polls this year, in an election his Bharatiya Janata Party ( BJP ) must win to gain seats in the upper house of parliament where he lacks a majority to pass economic reforms.\nHALF-BUILT\nEconomists say that lower interest rates and a government splurge on infrastructure should eventually help revive construction, which contributes a tenth of Indian GDP.\nModi’s party also wants to regulate property markets and tie investor money to specific projects to stop developers diverting cash elsewhere.\nThe slowdown around Delhi, where unsold inventory is highest, shows no sign of abating, however.\nNoida, a city of 640,000, has grown rapidly in the last decade, expanding to a point where its middle-class housing complexes now meld into Delhi’s urban sprawl on one side and rustic villages on the other.\nAround the site where Kumar worked, half-built high-rises now dot the skyline. Cranes and diggers stand idle. His former employer, The 3C Company, has cut staff on the 3,000-unit “Lotus Boulevard” by more than half, employing some elsewhere.\nSales staff at two nearby sites reported a 30 to 50 percent decline in bookings in the last year.\nReal estate association CREDAI’s Rohit Raj Modi estimates construction in Noida employed more than a million labourers at its peak in 2013, at least double today’s number.\nEven when the market recovers, a shift to mechanisation on larger sites would limit demand for new workers.\n“From a labour point of view, the peak is over,” he said.\n 27, 2015 11:52 am", "external_links": [], "published": "2015-08-27T19:52:00.000+03:00", "crawled": "2015-08-27T18:49:01.583+03:00", "highlightTitle": ""}