{"organizations": ["Congress"], "uuid": "77113b9af1c108a2bc27c2fd1983b01be320e800", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/mQ.bAbOJDdEhhGK6nrvhlg--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_SILICONALLEY_H_LIVE/Obama_is_sending_a_loaded-f836e0eeaf7b1b2c4c06a914b7e43a5f.cf.png", "site_section": "https://uk.finance.yahoo.com/news/category-international/?format=rss", "section_title": "World Business News | Finance News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/obamas-escalating-rhetoric-iran-aimed-145300225.html", "country": "GB", "title": "Obama is sending a loaded warning to Congress about the Iran deal", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Obama is sending a loaded warning to Congress about the Iran deal", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T17:53:00.000+03:00", "replies_count": 0, "uuid": "77113b9af1c108a2bc27c2fd1983b01be320e800"}, "author": "", "url": "https://uk.finance.yahoo.com/news/obamas-escalating-rhetoric-iran-aimed-145300225.html", "ord_in_thread": 0, "title": "Obama is sending a loaded warning to Congress about the Iran deal", "locations": ["Iran"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Obama"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSun, Aug 9, 2015, 16:15 BST - UK Markets closed Obama is sending a loaded warning to Congress about the Iran deal By Armin Rosen | Business Insider – 22 minutes ago Print \n(REUTERS/Jonathan Ernst) U.S. President Barack Obama delivers remarks on a nuclear deal with Iran at American University in Washington August 5, 2015. Congress could vote against President Barack Obama's landmark nuclear deal with Iran by passing a resolution of disapproval, putting the legislative branch on record as opposing perhaps the biggest foreign-policy initiative of Obama's presidency. \nBut chances remain very low that deal opponents will be able to muster the votes needed to override a presidential veto, even with the Senate's No. 3-ranking Democrat Chuck Schumer (D-New York) going against the deal . \nAssuming every Senate Republican votes against the deal, opponents would still need to recruit 13 Senate Democrats and 44 House Democrats to override a presidential veto and prevent the president from suspending US sanctions against Iran. \nAnd Obama's escalating rhetoric over a potential Congressional fight has hinted at the potential political consequences of crossing him. During a Wednesday address at American University, Obama extensively compared deal opponents to supporters fo the Iraq war. \n\" Between now and the Congressional vote in September, you are going to hear a lot of arguments against this deal, backed by tens of millions of dollars in advertising,\" Obama said. \n\"And if the rhetoric in these ads and the accompanying commentary sounds familiar, it should, for many of the same people who argued for the war in Iraq are now making the case against the Iran nuclear deal. \" \n(REUTERS/Jonathan Ernst) U.S. President Barack Obama delivers remarks on a nuclear deal with Iran at American University in Washington August 5, 2015. \nHe also said that Iranian hardliners were in a de-facto alliance with deal opponents in the US. \"It's those hardliners chanting 'Death to America' who have been most opposed to the deal,\" Obama said. \"They're making common cause with the Republican Caucus.\" \nTop-ranking Republicans quickly criticized the comment, with Senate Majority Leader Mitch McConnell (R-Kentucky) calling on Obama to \"retract his bizarre and preposterous comments.\" \n\" Members of both parties have serious and heartfelt concerns about the Iran deal,\" McConnell said in a statement. \"These Democrats and Republicans deserved serious answers today, not some outrageous attempt to equate their search for answers with supporting chants of ‘Death to America.'\" \n(Reuters) A woman walks past an anti-American mural on a wall of the former U.S. embassy in central Tehran May 1, 2008. \nOne one level, the rhetorical escalation is puzzling: Obama is raising the stakes and risking additional ill-will around an issue that's essentially been settled. The UN Security Council has already endorsed the Iran agreement and began the process of removing sanctions authorizations related to the Iranian nuclear program. \nAnd the veto override was always a longshot. The current model of congressional review is on terms that even the administration realized were favorable to it: When the bipartisan-sponsored Iran Nuclear Agreement Review Act was passed in May , Obama signed it partly in order to stave off other , far less certain congressional approval mechanisms. \nBut there is always the possibility that events intervene in a way that won't favor the administration. From the administration's perspective, the biggest danger of the Review Act is that it gives Congress a 60-day period to consider the agreement. And a lot can happen in 60 days. \n(REUTERS/Morteza Nikoubazl) A motorcyclist looks at an Iranian-made Ghadr-F missile during a war exhibition held by Iran's revolutionary guard to mark the anniversary of the Iran-Iraq war (1980-88). \nOn Wednesday , CNN reported that in July, an Iranian warship had aimed its weapon at a US helicopter in the Gulf of Aden, near Yemen. \nThe event recalls other unexpected security incidents involving the US or neutral vessels in and around the Persian Gulf: In April , for instance, the Iranian Navy commandeered a Marshall Islands-flagged ship in the Strait of Hormuz, leading to the US Navy briefly having to escort vessels through the world's most important oil chokepoint . Also in April, the US Navy helped blockade a Yemeni port in order to prevent a suspected Iranian weapons delivery. \n\nA surprise event involving US or allied vessels in the Straight of Hormuz or the Gulf of Aden — something that could expose Iran as erratic and untrustworthy, or cast additional doubt on the prudence of entering into this specific nuclear agreement with the country's current leadership — represents just about the most realistic chance for deal opponents build up enough opposition to the agreement to override Obama's veto. \nSuch an event remains unlikely. But it's clear after this week that Obama isn't taking any chances with the passage of one of his presidency's most significant legacy items. If outside events do intervene, he wants support to be solid — even if it still seems far from likely that the deal will be defeated in Congress.", "external_links": [], "published": "2015-08-09T17:53:00.000+03:00", "crawled": "2015-08-09T18:20:03.002+03:00", "highlightTitle": ""}