{"organizations": [], "uuid": "0d962788bbe0f282b651baef9aaad0ae764f6de5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/george-osborne-not-fear-selling-181035525.html", "country": "GB", "title": "George Osborne should not fear selling the state silver", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "George Osborne should not fear selling the state silver", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T21:10:00.000+03:00", "replies_count": 0, "uuid": "0d962788bbe0f282b651baef9aaad0ae764f6de5"}, "author": "", "url": "https://uk.finance.yahoo.com/news/george-osborne-not-fear-selling-181035525.html", "ord_in_thread": 0, "title": "George Osborne should not fear selling the state silver", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["George Osborne"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Aug 4, 2015, 19:28 BST - UK Markets closed George Osborne should not fear selling the state silver By Andrew Critchlow | Telegraph – 18 minutes ago 2.20 0.00 \nThe Chancellor should be more ambitious with the scale and scope of the privatisations eyed by the Government \n\"Tell Sid”. Who can forget the famous advertising slogan that encouraged thousands of Britons to profit from the privatisation of British Gas in 1986? \nIf the character in the advert had acquired the 100 shares in the company they were eligible to buy, they would have made a healthy profit over time with dividends. As did the Government, which under the leadership of Baroness Thatcher raised a cool £50bn for the Exchequer from the sale of 50 companies during her time in power. \nAs Britain emerged from the deep recession of the late 1970s, these funds were a vital part of putting the nation’s finances back on track. Although widely criticised since for selling off the family silver too cheaply, it could be argued that Baroness Thatcher didn’t go far enough in rolling back the state’s exposure to what at the time were little more that “non-performing assets” and, at worst, a drain on the pubic purse. \nOf course, Baroness Thatcher could have held on for longer in an effort to get a better price, but that would have saddled many of the companies privatised during her Government with unrealistic valuations. Ultimately, she put the necessity of raising cash to pay down debt and cut the deficit ahead of the political requirement of not being seen to have sold the country short. \nToday, the Chancellor George Osborne wants to follow in the footsteps of Baroness Thatcher’s government by raising a potential £23bn from another wave of privatisations . Once again these sales will help to bolster the nation’s finances, which are still recovering from the sobering experience of the global financial crisis. \nThe latest step in this journey has come with the £2.1bn sale of a 5.4pc share of the Government’s remaining stake in bailed-out lender Royal Bank of Scotland (RBS (LSE: RBS.L - news ) ) . Although this amounts to a £1.1bn loss for the taxpayer, that shouldn’t be a reason to condemn the policy of offloading unwanted state assets as bad business. \nGeorge Osborne could raise much more than £23bn from privatisation \nMr Osborne has already faced accusations of selling the taxpayer short when he offloaded part of the Government’s stake in Royal Mail (LSE: RMG.L - news ) in 2013. RBS, which was brought under Government control in unusual circumstances, must be seen as an exception. It is highly unlikely the bank’s turnaround can be successfully completed while its chief executive Ross McEwan still answers to the Chancellor. \nThat’s why Mr Osborne should be even more ambitious with the size and scope of the potential privatisations which the Government has already identified. Given the size of the country’s national debt stands at more than £1.5 trillion and the scale of the deficit is around 5pc gross domestic product, this is no time to time for half measures or compromises to save so-called “sacred cows”. \nJust as they did in the 1980s, a new wave of privatisations will provide a steady stream of work for the City and help to safeguard London’s status as a global financial capital. The new privatisation push will include the Government’s remaining sub-14pc stake in Lloyds Banking Group , assets held in UK Asset Resolution (UKAR), Eurostar and parts of the pre-2012 student loan book. However, the Chancellor should now be more ambitious in the scale and scope of what he plans to sell. \nResearch last year by the Adam Smith Institute highlighted a possible £90bn-worth of privatisations, including assets such as Network Rail and trust ports including Port of Dover. However, the study went further by identifying a further £337bn of assets listed under the 2007 Public Asset Register. Even (Taiwan OTC: 6436.TWO - news ) if less than 10pc of these land assets were sold it would more than double the potential windfall that the Government can hope to gain from its proposed sell-offs. \nRipe for sale is the unwanted and underused land belonging to the Ministry of Defence (MoD) . The UK is littered with virtually abandoned barrack camps, airfields and naval bases which no longer reflect the shrinking manpower of the armed forces. The MoD is estimated by the Adam Smith Institute to hold fixed assets valued at around £70bn, including land and buildings in prime Central London locations which have a questionable military purpose. \nSelling these parcels of real estate and property would not only raise billions of pounds to pay off the country’s worrying debt burden, it could provide good, usable land, with basic amenities and transport links, in order to build new residential homes, or space for urban infrastructure. \nRAF Northolt is a good example of a military installation that is arguably no longer needed. The airstrip on the western edge of London would serve a greater national purpose if it were sold for real estate development or reconsidered as a potential alternative to building another runway at either Heathrow, or Gatwick. \nNortholt could be sold or converted into a new commercial runway \nAn even bigger bounty of potential privatisation assets is controlled by the Department of Transport. The country’s network of motorways and public roads are part of an estimated £80bn portfolio belonging to the department. Selling the M25 and the M1 (Other OTC: MBOFF - news ) could unlock valuable investment for new road infrastructure, or just help to reduce the burden of paying interest on the national debt. \nGiven the total size of the Government’s total asset base, Mr Osborne’s declared targets for privatisation hardly amounts to anything approaching a sell-off of the remaining family silver. The Chancellor should arguably go much further.", "external_links": [], "published": "2015-08-04T21:10:00.000+03:00", "crawled": "2015-08-04T21:30:14.963+03:00", "highlightTitle": ""}