{"organizations": ["Citi"], "uuid": "8b29c74ec0dc584edaed073d94647b7f65ce6633", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/category-asia/?format=rss", "section_title": "Asian Business News | Financial News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/forex-dollar-weakens-receding-u-191349049.html", "country": "US", "title": "Further sizeable weakness seen in Chinese yuan, Citi says", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Further sizeable weakness seen in Chinese yuan, Citi says", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T22:01:00.000+03:00", "replies_count": 0, "uuid": "8b29c74ec0dc584edaed073d94647b7f65ce6633"}, "author": "", "url": "https://uk.finance.yahoo.com/news/forex-dollar-weakens-receding-u-191349049.html", "ord_in_thread": 0, "title": "Further sizeable weakness seen in Chinese yuan, Citi says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 00:06 BST - UK Markets open in 7 hrs 54 mins Further sizeable weakness seen in Chinese yuan, Citi says By Alexander Bueso | Sharecast – 4 hours ago 57.83 -1.26 \nLONDON (ShareCast) - (ShareCast News) - The risks of a greater slowdown in China's economy and the scope for a sizeable further depreciation in the country's currency, the renminbi or yuan as it is also called, have grown, analysts at Citi said. In a research report dated 19 August they slashed their forecast for the country's rate of economic growth in 2016 to 6.3% from 6.7%. Furthermore, the bank's economists were now anticipating that the yuan would drop to 6.80 over the next few months. \nDespite that, and the prospect for further economic stimulus in the world's most populous country, \"risks to our 2016 growth forecasts probably remain to the downside, especially reflecting China worries,\" the economists said. \nIndeed, the weakness anticipated in other Asian currencies meant that such a move lower in the yuan \"would only reverse a modest part of the sharp appreciation in the yuan's real and effective exchange rates of the last few years. \nIn Citi's latest stab at predicting the future, the rate of growth in Japan's gross domestic product was pegged at 1.3% next year, down from the 1.8% pace predicted just one month before. In parallel, activity in the euro area was set to expand at a 1.3% clip they said, and not 1.5%. \nAs a result of the above, and revisions to their forecasts for various emerging markets - especially in Asia and LatinAmerica - global GDP was expected to grow by 3.1% in 2016, down from their previous call for growth of 3.3% - for a third consecutive downgrade. \n\"We argued a couple of months ago that the global outlook was at a highly delicate point, with the combination of the sharp slowdown in China, uncertainties over the Greek bailout and the possible approach of Fed hiking. Since then, Greece-related risks have receded (but not vanished), while uncertainties over China's slowdown have escalated and early Fed tightening remains on the agenda\", Citi added. \n\"China is likely to see a structural decline in growth, not just on cyclical factors but on an excessive accumulation of capital stock and a reversal in the working age population since 2010,\" economists at BNP Paribas (Xetra: 887771 - news ) would write to clients a day afterwards. \nDespite all of the above, Citi stuck to its call for the US Federal Reserve to raise its benchmark interest rate in September, \" unless upcoming data are surprisingly soft or financial market conditions become disorderly. \" A slow tightening of policy by the Bank of England in 2016 was also still their base case scenario. \nLikewise, several other major central banks including the Bank of Japan, the Reserve Bank of Australia, the Reserve Bank of New Zealand, the Riskbank and the Norges bank were all still thought to be likely to cut their interest rates in coming months. \nThey would rather see their currencies depreciate than match the tightening in policy from the US Fed, the report concluded.", "external_links": [], "published": "2015-08-20T22:01:00.000+03:00", "crawled": "2015-08-21T02:15:09.177+03:00", "highlightTitle": ""}