{"organizations": [], "uuid": "d4932071dd96a6e13c2585680eb98acb98988cac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02023/forsale_2023326a.jpg", "site_section": "http://www.telegraph.co.uk/newsfeed/rss/money_city.xml", "section_title": "Finance - Business news and market updates - Telegraph", "url": "http://www.telegraph.co.uk/finance/property/11809375/House-prices-jump-14000-trapping-young-people-in-their-childhood-bedrooms.html", "country": "CH", "title": "House prices jump £14,000 trapping young people in their 'childhood bedrooms'", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "House prices jump £14,000 trapping young people in their 'childhood bedrooms'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T14:02:00.000+03:00", "replies_count": 0, "uuid": "d4932071dd96a6e13c2585680eb98acb98988cac"}, "author": "Anna White", "url": "http://www.telegraph.co.uk/finance/property/11809375/House-prices-jump-14000-trapping-young-people-in-their-childhood-bedrooms.html", "ord_in_thread": 0, "title": "House prices jump £14,000 trapping young people in their 'childhood bedrooms'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "House prices jump £14,000 trapping young people in their 'childhood bedrooms' The average house price in England has risen by 6.1pc in a year, according to official figures The cost of getting on the ladder in England rises by £14,000. Photo: GETTY Comments \nBuying a home in England is now £14,000 more expensive than it was 12 months ago, despite a relatively quiet period in the housing market over the last six months. \nHouse prices in England increased by 6.1pc over the 12 months to June, taking the cost of buying a new home to £290,000. \nWhile house prices in Wales fell by £2,000 during the same period, the cost of an average home in Scotland remained the same (£192,000) and values edged up just £1,000 to £154,000 in Northern Ireland. \nHowever, frenetic house price growth in the South East and the East drove up the cost of getting on the property ladder in England. \nAnnual house prices climbed 9.2pc in the East of the country - the biggest rise of any region in the UK - to 295,000 and 7.7pc in the South East to £347,000. \n• Ex-council flat sells for £1.2m \nThis shows that the London economic powerhouse is still driving the UK housing market, as commuters working in London and benefitting from wage growth and rising employment are buying in the South East and the East to take advantage of, relatively, cheaper homes. \nRoger Harding, Shelter's director of campaigns, said: “A further rise in house prices means that for an entire generation, a home of their own is nothing but a pipe dream. \n“From families trapped in expensive and insecure private renting, to young people stuck in their childhood bedrooms, a stable future is spiralling further and further out of reach for millions.\" \nHowever, after rapid growth in London over the last two years, house prices and activity in the capital has slowed. In the year to June 2014 prices rose 19.3pc. This slumped to 5.3pc in the 12 months to June 2015. \nFor properties price over the £1m mark, the market was disrupted by the general election and the stamp duty change announced last December. The new tiered tax rate on residential property makes it more expensive to purchase homes worth more than £937,000 than it was under the old system. \nBut the biggest brake by far on the London market was its prolonged period of intense house price growth. Values had reached levels deemed unaffordable by many and as a result activity has slowed. \nHowever, prices in the capital still rose by £14,000 to £513,000, year-on-year. \nAdam Challis, head of residential research at JLL, said: \"These figures show the continued steady improvements to housing markets across the UK. Strong economic grow is supporting jobs and wages; we expect to see this stable backdrop for the next few years. \n\"The deceleration in London house price growth is the noticeable exception. It is finally the case that the London market is re-aligning with the national picture – at least for now.\"", "external_links": [], "published": "2015-08-18T14:02:00.000+03:00", "crawled": "2015-08-18T14:17:00.216+03:00", "highlightTitle": ""}