{"organizations": ["The Washington Trust Company", "University of Connecticut", "University of Connecticut Washington Trust"], "uuid": "005ffb3548ce33d63f8da3e3a12d38895e0e3732", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/334484?filename=334484.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/17/Financing%20Agreements", "section_title": "GlobeNewswire: Financing Agreements", "url": "http://globenewswire.com/news-release/2015/08/13/760579/10146033/en/Washington-Trust-Provides-6-Million-in-Financing-for-Construction-of-42-Condominium-Units-Adjacent-to-the-University-of-Connecticut.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "country": "US", "title": "Washington Trust Provides $6 Million in Financing for Construction of 42 Condominium Units Adjacent to the University of Connecticut", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Washington Trust Provides $6 Million in Financing for Construction of 42 Condominium Units Adjacent to the University of Connecticut", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T22:13:00.000+03:00", "replies_count": 0, "uuid": "005ffb3548ce33d63f8da3e3a12d38895e0e3732"}, "author": "", "url": "http://globenewswire.com/news-release/2015/08/13/760579/10146033/en/Washington-Trust-Provides-6-Million-in-Financing-for-Construction-of-42-Condominium-Units-Adjacent-to-the-University-of-Connecticut.html?f=22&fvtc=1&fvtv=Financing%20Agreements", "ord_in_thread": 0, "title": "Washington Trust Provides $6 Million in Financing for Construction of 42 Condominium Units Adjacent to the University of Connecticut", "locations": ["Washington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Washington Trust Provides $6 Million in Financing for Construction of 42 Condominium Units Adjacent to the University of Connecticut August 13, 2015 15:13 ET | Source: The Washington Trust Company \nWESTERLY, R.I., Aug. 13,   Washington Trust's Commercial Real Estate Group (Nasdaq: WASH ) recently provided a $6 million line of credit to Main Street Homes-Storrs, LLC for the construction of 42 condominium units in Storrs, CT. This more than 4-acre property benefits from its walking proximity to the main campus of the University of Connecticut, one of the most prestigious public universities in the nation. \nThe condominiums to be built on the property include 32 residential townhomes within eight separate buildings as well as 10 single level flats located within a 3-story mid-rise building. The average size for each unit is 1,510 square-feet, each elegantly appointed with open floor plans, 9-foot ceilings, wall-to-wall carpet, gas fireplaces, premium cabinetry and countertops and stainless steel appliances. Additional, on-site amenities will include a 720 square-foot community center for entertainment and events, parking garages and walking trails. \nThe property is located adjacent to the main campus of the University of Connecticut as well as to the vibrant Storrs Center, a new Main Street, town square style neighborhood featuring cafés, restaurants and shopping. \n\"What is happening in Storrs in and around UConn is extremely exciting,\" said Julia Anne M. Slom, Senior Vice President & Team Leader of Washington Trust's Commercial Real Estate Group. \"The development of housing, retail and other amenities fills a strong gap in that market. These homes are a further enhancement and will be eagerly received. We are excited to do more with this client, LeylandAlliance.\" \nMain Street Homes-Storrs, LLC is owned by LeylandAlliance, LLC, a real estate development company focused on the creation of mixed-use, highly sustainable neighborhoods founded upon the principles of New Urbanism. \nWashington Trust's Commercial Real Estate Group provides commercial real estate mortgages for the construction, refinancing, or purchasing of investment real estate projects. Financing ranges in size from several hundred thousand dollars up to multi-million dollar projects. For more information, contact Timothy M. Pickering , Senior Vice President, Commercial Real Estate Group, at 401-348-1482 or 800-475-2265 ext. 1482. \nABOUT WASHINGTON TRUST ® \nFounded in 1800, Washington Trust is the oldest community bank in the nation and one of the Northeast's premier financial services companies. Washington Trust offers a full range of financial services, including commercial banking , mortgage banking , personal banking and wealth management and trust services through its offices located in Rhode Island, Connecticut and Massachusetts. The Washington Trust Company is a subsidiary of Washington Trust Bancorp, Inc., (NASDAQ: WASH ). Additional information on Washington Trust and its subsidiaries can be found at www.washtrust.com . Media Contact: Tony Nunes Public Relations 401.348.1657 Related Articles", "external_links": [], "published": "2015-08-13T22:13:00.000+03:00", "crawled": "2015-08-13T22:29:35.305+03:00", "highlightTitle": ""}