{"organizations": [], "uuid": "05c0a8aaa26c6b30cddc472d45e255f13ba0a0ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business/Finance", "url": "http://www.menafn.com/1094300572/Integratus-Solutions-Talks-To-In2town-Press-Release-About-Business-Solutions?src=RSS", "country": "US", "title": "Integratus Solutions Talks To In2town Press Release About Business Solutions", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Integratus Solutions Talks To In2town Press Release About Business Solutions | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "05c0a8aaa26c6b30cddc472d45e255f13ba0a0ea"}, "author": "Press", "url": "http://www.menafn.com/1094300572/Integratus-Solutions-Talks-To-In2town-Press-Release-About-Business-Solutions?src=RSS", "ord_in_thread": 0, "title": "Integratus Solutions Talks To In2town Press Release About Business Solutions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Integratus Solutions is co-presenting their Data Warehouse Success Story with CP Kelco During a Webcast Coming Up August 19 2015\n \nThe company offers pre-built Business Intelligence (BI) & Data Warehouse (DW) solutions to integrate cloud & on-premise data enabling self-service reporting for executives department heads managers & administrators.\n \nWe decided to get together with Ron from Integratus Solutions and learn more about business solutions. This interview is free to re-publish.\n \n \n \nRon what are some of the top issues you hear when talking to CIO’s?\n \nWithout a doubt the number one issue we consistently hear from CIO’s across the board is how to get information out to the enterprise into the hands of the people who need it to do their jobs on a day to day basis.\n \nAll organizations have invested significant amounts of money in many cases anywhere from hundreds of millions to billions of dollars into their transactional systems to improve efficiency manage their business and capture valuable data on their customers patients financials employees inventory levels and so on.\n \nOften the first challenge is to ensure employees are adopting and using these systems to consistently & accurately capture the data needed for analytics. Once these systems are in place typically for one or two years organizations realize that an enterprise data warehouse platform is required in order to fully realize the value of their disparate internal and external data. As a result- many organizations are investing as much as a 100 million into their data warehouse platform in order to fully realize the value of these investments and achieve competitive advantages whether in operational efficiency cost reduction or finding new revenue opportunities through new product offerings academic research business analysis patient care or other valuable ways to leverage their existing data.\n \nAcross all industries we consistently hear that the business is not satisfied with their ability to access actionable data needed to do their job effectively. As a result this is #1 priority for CIO’s to meet their objectives. \n \n100 million is a lot for a data warehouse how do organizations typically justify the return on this type of investment in their data strategy?\n \nThere are three ways to justify spending funds on a data warehouse strategy.\n \nThe first is to reduce the cost of data integration. In order to produce a typical enterprise internal or external report it can involve anywhere integrating from 1 to 5 or more data sources. Locating gathering and merging these disparate data sources typically take 90% of the time needed to produce a report and can take anywhere from several weeks to months. A typical enterprise needs to produce hundreds of reports annually (for the executives board members regulatory authorities managers etc.). A typical data integration cost for each report (locating gathering merging) can run anywhere from 20000 to 1 or more. Multiply this number by 100 (or more) annual reports and an organizations reporting costs could easily run anywhere from 2M - 10M/ year or higher (depending on volume and cost per report). As a result its easy to see how most businesses are not currently satisfied with the quality of reporting they are currently receiving based on the data that’s available. The issue is not with the reporting tools or team however specifically with the lack of a data warehouse strategy & effective implementation. An effective data warehouse means the data is located gathered and merged up front enabling the business to write and access their reports directly within the warehouse rather than manually doing this for each and every report request. So the first area of cost savings is in the data integration. There comes a point when organizations decide do we keep hiring additional people to manually integrate data and write reports or do we implement a data warehouse and allow these people to focus more on analytics instead.\n \nThe second are of value is in data quality. Its been estimated that poor data quality costs the US economy as much as 3 trillion / year. As an example poor data quality results shipments sent to the wrong location and strategic business decisions being made poorly with inaccurate incomplete data. How much time is wasted in business meetings debating which department has the accurate sales numbers? When gathering data on financials employees customers and patients data quality is critical and expensive.\n \nThe third area of value in a data strategy is perhaps the most valuable however very different for each organization. Business revenue opportunities abound in fully leveraging available data. Organizations such as Facebook Amazon & Google are leading the world in growth & market capitalization based on business strategies that seek maximize value from their available data. As another example I spoke with a BI director from an academic health system who was able to fulfill over 400 research requests as a result of their integrated data warehouse. There are countless ways to maximize revenue across all industries by fully leveraging available data on customers and employees. Organizations who do this will continue to achieve financial stability reduce their risk and achieve high valuations in the future.\n \nIf I’ve decided to implement a data warehouse strategy what is the best way to reduce overall implementation risk?\n \nAs in any endeavor the best way to reduce risk is by relying on professionals with proven experience. They will help provide the guidance needed to get through roadblocks and reduce or eliminate potential pitfalls along the way. They’ll help ensure the right resources infrastructure and executive sponsorship is in place to maximize value of your investments. The right professional(s) can help you hire a team of data integration and reporting experts to achieve your initial objectives and continue to evolve your data strategy over time. For different organizations this is done in different ratios of internal and external resources but it is always recommended to start with proven experts and check the references of the specific consultant/ new hire you’re bringing on. Seasoned experts with several successful implementations will be able to provide guidance on getting through roadblocks and avoiding potentially disastrous pitfalls.\n \nWhat type of successful data warehouse solutions have you seen organizations implement?\n \nRecently we’ve seen a great deal of organizations moving to cloud applications in order to simplify their IT infrastructure and reduce costs. Typically these applications satisfy line of business requirements such as HR CRM or other purposes. Often these applications may be a third party service which provides data on customer and/or patient satisfaction for example. In any case integrating data from cloud applications requires additional complexity to ensure this data is effectively included as part of a Data warehouse strategy. Often this data is hugely valuable containing employee or customer information. Integrating with financials for example can help provide a complete picture on revenue per employee across location division etc. As another example one surgeon may have excellent revenue numbers but perhaps lower patient satisfaction/ retention numbers. Without integrating these data sets there is critical information that goes missing.\n \nWe’ve recently worked with a large enterprise organization diversified across several businesses from paper to chemical manufacturing among others. They recently moved to a cloud HR application called SuccessFactors in order to reduce costs from their previous legacy PeopleSoft application. They achieved the initial value desired however wanted to be able to fully leverage this valuable employee data within their robust data warehouse which is supported by the market-share leading Business Objects toolset. The data warehouse already was providing valuable insight on their financials inventory and material costs which is captured in their SAP ERP. Their desire was to correlate this data together with employee costs in order to fully achieve their business objectives. They also used ADP for payroll and wanted to incorporate this as well. We leveraged the SAP data services 4.2 toolset in order to bring the data from SuccessFactors & ADP into their on-premise data warehouse conforming with business & data governance standards. As a result their department heads are able to easily access and forecast data on complex employee compensation scenarios taking into account financial and revenue data.    \n \nWhat are the best data warehouse solutions for each industry?\n \nThere are a great deal of “prebuilt” data warehouse and business intelligence applications available in the market for each industry. Some important questions to ask include the following:\nIs it agnostic to data sources & vendor? (i.e. if it’s a vendor data warehouse how difficult is it to integrate data sources outside of that vendor’s domain of expertise)\nIs it comprehensive for your business requirements? (i.e. if it’s a financial data warehouse how difficult is it to incorporate data from sales HR etc.)\nIs it flexible to meet your competitive advantages? (i.e. if it’s the same solution your competitors are using; how do you address the advantages inherent to your organization?) \nTypically vendor’s solutions aren’t great at integrating data outside their expertise and their objective is to achieve long-term “lock-in” with their applications. As a result many organizations prefer to own their own vendor agnostic data warehouse enabling them to achieve independence from any software vendor and change applications more easily if it can help improve efficiency and or reduce cost. Sometimes organizations end up using some type of hybrid approach of industry and/or vendor solutions combined with their own independently developed data warehouse solutions. In any case its important to have a data governance / quality strategy in place to ensure a single version of the truth and reduce complexity.\n \nWhere is the best place to start?\nTypically organizations begin with an initial health check and/ or assessment to determine their available data and resources to support a data warehouse initiative. As a result they can focus on the highest priority areas with highest available quality data to achieve an immediate impact. This is important to help reduce cost and risk of data warehouse. Typically this also includes meeting with business executives to understand the areas of highest priority for the organization in order to align with business objectives for revenue growth operational efficiency financial stability etc. Once this is in place typically a first phase data warehouse will focus on a specific subject area (i.e. finance quality sales etc.) together with a strategy to extend this platform for future phases. This strategy is much better than a big bang approach since it reduces initial timeframes and risk and allows for iteration along the way.\n \nWhat makes your offering unique at Integratus?\nHere at Integratus we bring a “best of both worlds” approach to our customers. Often vendors will tout their specific solution as optimal for all clients however we do not believe a one size fits all works for clients with unique competitive advantages. Where there are gaps in available vendor solutions we have developed and deployed prebuilt data mart solutions for applications such as SAP and SuccessFactors. This enables our customers to take advantage of our development work and learnings from past implementations and achieve quick wins within as few as four weeks rather than waiting several months or years for a Phase 1 Data Warehouse. In addition our prebuilt data marts are not Band-Aid solutions they are extensible to integrate with many other vendor data warehouse solutions (such as Epic Cogito or the RapidDecision EDW) or they can be extended for an organizations overall independent vendor agnostic strategy. In addition we provide experts with 15 or more years’ experience leading and delivering data warehouse strategies to very large complex organizations. Many of our consultants operate in a key advisory capacity to CIO's with large institutions across the US. Our combination of management consulting leadership together with hands on development expertise ensure clients are able to fully achieve the “best of both worlds” in big picture strategy together with hands on tactical wins. By putting a strategy in place to leverage their existing technology investments and achieve quick wins we can help to virtually eliminate risk for clients in achieving their DW objectives.\n \nHow can organizations learn more about Integratus?\nWe will be featured on an upcoming webcast discussing best practices integrating data from cloud applications (such as SuccessFactors) together with on-premise data sources (such as SAP) into a central vendor agnostic Data Warehouse. Our special guest speaker is JP Godette one of the first 50 employees of Business Objects (BI market-share leading toolset) discussing best practices and lessons learned over the past 2 years DW. JP worked fro many of largest enterprise org’s across the US on their data strategy and we’re so happy to have him join. Also featuring Sal Hernandez found of Integratus over 15 years cross-industry experience with org’s across the US. We highly recommend folks check out our webcast Aug 19th and we’ll be recording so if the time doesn’t work you can reach out to us for a few copy of the recording. You can also reach us toll-free at 1-888 or by email ron.lehman@integratussolutions.com\n \nFor more information on the approaching webinar hosted by Integratus Solutions please visit .\n \nAbout INTEGRATUS SOLUTIONS\n \nIntegratus is a boutique-consulting firm specializing in pre-built Business Intelligence (BI) and Data Warehouse (DW) solutions using the market-share leading SAP BusinessObjects software. They employ a team of senior BI-DW consultants each typically with over 15 years of cross-industry experience. Integratus consultants have the combined experience of 100’s of successful BI-DW implementations across North America.  \n\n\nAbout PRBuzz.com \nPRBuzz.com is a press release distribution service that distributes press releases to online news sites and blogs to help customers with search engine optimization and create buzz about their web site, news or business.", "external_links": [], "published": "2015-08-03T03:00:00.000+03:00", "crawled": "2015-08-04T09:12:34.752+03:00", "highlightTitle": ""}