{"organizations": ["Ecobank"], "uuid": "2e9d86a867f453c2ee322f9f9b8b3eb8562c924e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/samuelashiteyadjeimdecobankghana620x400.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/639020/1/ecobank-revenue-up-by-29.html", "country": "US", "title": "Ecobank Revenue Up By 29%", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Ecobank Revenue Up By 29%", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T20:44:00.000+03:00", "replies_count": 0, "uuid": "2e9d86a867f453c2ee322f9f9b8b3eb8562c924e"}, "author": "", "url": "http://www.modernghana.com/news/639020/1/ecobank-revenue-up-by-29.html", "ord_in_thread": 0, "title": "Ecobank Revenue Up By 29%", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  27 August 2015 18:44 CET Ecobank Revenue Up By 29% By Daily Guide \nEcobank Ghana recorded the highest returns in the banking industry. \nThe financial institution increased its profit before tax by an impressive 32 percent year-on-year. \nEcobank Ghana is currently the most profitable bank in the country. \nThe bank's revenues for second quarter 2015 were up by 29 percent year-on-year. This growth was propelled by a 58 percent increase in fee and commission income and an appreciable 29 percent increase in net interest income. \nTrading income grew marginally by 10 percent, reflecting the current foreign exchange challenges experienced in the country. \nAlthough operating expenses grew by 27 percent to GH¢203.8 million on the back of rising inflation and a depreciating currency, strong cost management measures ensured that the bank's cost to income ratio was low at 40.74 percent in June 2015. \nTotal assets increased by 19 percent, resulting in an asset size of GH¢6.8 billion-the biggest in the industry. \nLoans and advances to customers increased by 35 percent, as non-performing loans were kept at a low ratio of 1.54 percent compared to 5.22 percent at the same time last year. \nEdward Botchway, Chief Financial Officer of the bank, noted that despite the challenges in the country's economy, the bank continued to support its customers, hence the growth in its loan book. \n'We always aim at meeting the needs of our customers simply because we think of our customers first, and we will continue to do just that. Of course, the rate on government bills and bonds are high but for us our customers always come first,' he added. \nThe bank's deposit base is the largest in the industry, growing by 43 percent year-on-year which shows customers' confidence in the bank. \nAs the bank celebrates its 25th anniversary, it looks to end the year in a very strong position and exceed all set targets. \nA business desk report", "external_links": [], "published": "2015-08-27T20:44:00.000+03:00", "crawled": "2015-08-27T23:04:24.180+03:00", "highlightTitle": ""}