{"organizations": [], "uuid": "7fa0fcd54d392d71df69ebcdad57c6d418a530be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/i/r/w/2/image.related.afrArticleLead.620x365.gizis9.png/1439235379744.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/opinion/columnists/the-way-ahead-after-chinas-devaluation-20150814-gizis9", "country": "AU", "title": "The way ahead after China's devaluation", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "The way ahead after China's devaluation | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T10:56:00.000+03:00", "replies_count": 0, "uuid": "7fa0fcd54d392d71df69ebcdad57c6d418a530be"}, "author": "Alan Mitchell", "url": "http://www.afr.com/opinion/columnists/the-way-ahead-after-chinas-devaluation-20150814-gizis9", "ord_in_thread": 0, "title": "The way ahead after China's devaluation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China's President Xi Jinping may want the yuan to fall a lot further. Bloomberg by Alan Mitchell Which would you prefer, a Chinese hard landing or a step back from President Xi Jinping's accelerated reform?\nEconomists think they can guess Xi's preference. While the intention behind the devaluation of the yuan is the subject of debate , US economist Adam Posen thinks it is likely to be part of the \"panic set of attempts to keep the economy from declining faster\".\nAnd if that is the government's intention the Chinese currency has a long way to go yet, warns Posen who is head of the highly regarded Peterson Institute for International Economics in Washington.\nA larger depreciation of the yuan would provide a shot in the arm for the Chinese economy which, according to the official data, has slowed to its lowest growth rate in six years as it works through a major housing market correction. (Some economists who distrust the official data think China already has fallen into recession.)\nBut while a sustained, large depreciation of the yuan would benefit the export sector without inflating the already over-extended property market, it would do so at the expense of the tertiary sector.\nA lower real exchange rate would boost profits of the big state-owned manufacturers and divert investment capital away from the new service industries: the very opposite of the fundamental structural change needed to put China on a more sustainable growth path.\nThe Chinese government's intention and the ultimate size of the depreciation are uncertain because the yuan was under pressure to decline because of the economic slowdown.\nIMF welcomes the move Beijing claims it is merely allowing market forces to prevail and the International Monetary Fund has duly welcomed the Chinese move as a step towards the inclusion of the yuan in the basket of major currencies that make up the IMF's special drawing rights.\nThe risk, as Posen says, is that the devaluation will add to suspicions that the economy is in worse shape than the official statistics suggest.\nThose fears, and questions about the government's determination to put the economy on a more sustainable growth path, will increase if the yuan continues to depreciate.\nThe best antidote to those fears might be the government's demonstrated determination to press ahead with reform combined with increased government spending.\nEconomic reform and rebalancing the economy are more difficult in a period of slowing growth when there is less investment and job creation to offset the economic impact of the contracting industries.\nHowever, Yukon Huang, a former World Bank country director for China and now a senior associate at the US Carnegie Endowment, argues that fiscal reform can be used to boost domestic demand.\nThe Xi administration already has underway a program to restructure local government debts and raise more money by including services in the value added tax and increasing resource and property taxation.\nThe stronger government balance sheets promised by those reforms increase the capacity for additional spending now.\nHuang's formula for maintaining high rates of growth is accelerated reform to boost productivity over the medium term combined with increased government spending to partially offset the negative impact of structural reform in the short term.\nHe argues that increased public spending is justified. According to the World Bank's China 2030 report, China's budget financed a third less social services and other consumption than other comparable countries.\n\"This is a major factor explaining why the share of total household and government consumption is about 10 to 15 per cent lower than in other comparable countries,\" Huang says.\nPrivate consumption unlikely to accelerate further Private consumption, which has been growing at an average real rate of 8 to 9 per cent for a decade, is unlikely to accelerate further under the present conditions.\n\"With a stronger revenue base and a clearer mandate to fund social services, government consumption could increase to around 18 per cent of GDP by the end of the decade from 13 per cent today,\" he argues.\n\"That would offset significant investment declines and provide the demand needed for 7 per cent growth over the decade to come.\"\nBut it is not just the stronger future revenue base that makes that kind of additional spending possible. Huang's argument is that China's public sector balance sheet already is strong despite the very high debts racked up by local governments and their state-owned enterprises.\nThe central government has foreign exchange reserves of $US3.6 trillion ($4.9 trillion) and the overall government debt level as a share of GDP is low.\nThe real fiscal problem, he explains, is the limited taxing ability of local governments which raise less than 50 per cent of government revenue but now account for more than 85 per cent of total government spending. This means economic stimulus must be delivered via the banking system in the form of credit induced investment.\nFiscal reform should solve that problem and reduce the pressure on commercial and shadow banks to fund infrastructure projects.", "external_links": [], "published": "2015-08-16T10:56:00.000+03:00", "crawled": "2015-08-17T00:11:49.087+03:00", "highlightTitle": ""}