{"organizations": [], "uuid": "2194800abf4cebabedfcff657e7828f1d3b0f745", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/fe-columnist/editorial-tasks-before-trai/111788", "country": "IE", "title": "Editorial: Tasks before Trai", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Editorial: Tasks before Trai | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T08:22:00.000+03:00", "replies_count": 0, "uuid": "2194800abf4cebabedfcff657e7828f1d3b0f745"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/editorial-tasks-before-trai/111788", "ord_in_thread": 0, "title": "Editorial: Tasks before Trai", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Monetary policy committee: Vote or veto? Inside track Dispatches from Canada New Trai chief RS Sharma has a packed agenda even before he formally takes over. Top of his agenda, of course, will be the issue of dealing with over 1 million responses to the consultation on net neutrality put out by his predecessor and the issue of whether over-the-top (OTT) players like WhatsApp and Viber need to be licensed. To some extent, the Trai response has been overshadowed by the report of the DoT-appointed panel, but the telecom regulator will need to respond and, more important, devise a way to respond to the specific suggestions made to each question in the consultation—else, the recommendations could be challenged on grounds of inadequate consideration of responses. Doing so will be a herculean task and will involve using sophisticated software to be able to aggregate responses into certain types and then deal with each set of them. At the heart of the Trai’s recommendations, as the DoT-appointed panel’s report makes clear, will have to be the issue of how India’s internet build-up is to be financed since pure net-neutrality rules will hit the revenues of telcos—indeed, as the report pointed out, ‘managed services’ that are critical for the IT business cannot coexist with a pure net-neutrality regime; there are also several serious technical issues that need to be addressed.\nWith the government itching to get more money from the next mega auction of spectrum, the pressure will also be on Trai to quickly submit recommendations on what base prices should be for different frequency bands, including the valuable 700 MHz band. This is where Trai needs to be a bit careful. For one, since there are barely a handful of phones/tablets at reasonable price points that work on 700 MHz right now, it makes more sense to first auction the bands where spectrum is available and where there is an existing eco-system of devices. This includes auctioning 15 MHz of spectrum in the 2100 MHz band, and 5 MHz each in the 2300 MHz and 2500 MHz bands; another 10 MHz can be got by harmonisation of the 1800 MHz band. The new Trai chief also needs to take a serious look at the health of the industry since that is going to be crucial for all future auctions. Right now, based on the latest auction, spectrum in India costs the same as that in the US—except US spectrum is awarded in perpetuity and not for 20 years as in India, and customer payouts are also several times higher. So, before the next round of auctions is held, the telecom regulator needs to take a hard look at cost structures. In no other country is there a high upfront auction of the type India has—the last auction fetched R1.1 lakh crore—and, in addition, a 15% annual revenue fee, apart from service tax and other taxes on top of that. The new Trai chief would do well to take a lesson from a fellow regulator, the central electricity regulatory commission, which granted a tariff hike to some large power plants when it found that their revenues were simply not enough to take care of a surge in costs. If telcos are financially unviable—of the $80 billion of capex spent by industry so far, an astounding $45 billion has been for spectrum—the quality of voice/data will remain poor and call drops will remain a fact of life.\nFirst Published on August 01, 2015 12:22 am", "external_links": [], "published": "2015-08-01T08:22:00.000+03:00", "crawled": "2015-08-02T00:29:28.156+03:00", "highlightTitle": ""}