{"organizations": [], "uuid": "66afe65fe079ad5bb29e9aba4c89ed6e1b39f04f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508310552.html", "country": "US", "title": "Zimbabwe: Govt to Fire Thousands More in Impending Job Cull", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Zimbabwe: Govt to Fire Thousands More in Impending Job Cull", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T11:38:00.000+03:00", "replies_count": 0, "uuid": "66afe65fe079ad5bb29e9aba4c89ed6e1b39f04f"}, "author": "", "url": "http://allafrica.com/stories/201508310552.html", "ord_in_thread": 0, "title": "Zimbabwe: Govt to Fire Thousands More in Impending Job Cull", "locations": ["Kenya", "Uganda", "Zimbabwe"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: Juniors Outwit Plucky Uganda \n\"There is uncertainty; a lot is happening. Human resources officers after the so called physical headcount are now monitoring who is doing what and at what time. \nThey are clocking in the time a person enters their work-station as well as the time they take tea breaks as well as lunch and the time they knock-off. \n\"There are now weekly reports of how many hours people are spending doing productive work or not. It is not business as usual anymore. The era of relaxing in the civil service is over. \n\"There are rumours that they want to force everyone aged 55 years and above to retire and that has caused no less consternation,\" said a senior official on condition of anonymity. \nAs if to confirm this, the state media Sunday came just short of admitting job cuts are on the way. \n\"Cabinet will be considering the full package of necessary proposals in the next couple of weeks. The above interventions to manage the wage bill are meant to create the fiscal space necessary to entre medium to long-term growth,\" a Sunday paper quoted government officials as saying. \nAccording to the paper, a Civil Service Audit Report set to be tabled before cabinet has \"revealed that there is a huge number of people who are literally doing nothing and it's a cause for concern. \n\"Most employees who are idle are in a few ministries because the majority of government departments are technical. \n\"For example, the report says there is no need for agricultural extension workers in towns but they should be on the farms in order to advise farmers\". \nDuring the inclusive government from 2009 and 2013, another audit revealed that there were no less than 80 000 ghost workers on the government payroll. \nAt the time, critics said these were mainly made up of youth service graduate getting paid for doing Zanu PF work rather than state duties. \nWhile Mugabe has over the past decade and half been accusing the IMF and the World Bank of being used by the US and Britain in a regime change agenda, the paper quotes an IMF resident representative in Harare Christian Beddies saying \"rationalization will not mean there will be loss of jobs, but those doing nothing should not expect to be paid\". \n\"Government will have to decide on the kind of civil service it wants and the Staff Monitored Programs are home grown and we (IMF) can only support them,\" said Beddies. \nAn IMF team is expected in the country this week. Zimbabwe \nMORE than 20 000 untrained teachers may become jobless next year as Government has finalised the documentation for … see more » Copyright © 2015 New Zimbabwe. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-31T11:38:00.000+03:00", "crawled": "2015-08-31T12:36:05.244+03:00", "highlightTitle": ""}