{"organizations": [], "uuid": "da33559551f66e3cb17c33d02caf52fd700c2db8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-financial-services/?format=rss", "section_title": "Financial Services News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/mobile-language-apps-help-millions-115500077.html", "country": "GB", "title": "Mobile language apps help millions learn less, more often", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Mobile language apps help millions learn less, more often", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T14:55:00.000+03:00", "replies_count": 0, "uuid": "da33559551f66e3cb17c33d02caf52fd700c2db8"}, "author": "", "url": "https://uk.finance.yahoo.com/news/mobile-language-apps-help-millions-115500077.html", "ord_in_thread": 0, "title": "Mobile language apps help millions learn less, more often", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 13:16 BST - UK Markets close in 3 hrs 14 mins Mobile language apps help millions learn less, more often Reuters - UK Focus – 21 minutes ago -14.56 \nBy Eric Auchard \nFRANKFURT, Aug 21 (Reuters) - Smartphone apps that help people learn languages for free or nearly free, a few sentences at a time, are piling pressure on established education firms and setting the pace for how to make lessons more engaging. \nPhone and tablet-based mobile products from newcomers like Germany's Babbel, Britain's Memrise and U.S (Other OTC: UBGXF - news ) .-based Duolingo have overtaken names like Berlitz and computer self-learning pioneer Rosetta Stone (NYSE: RST - news ) in terms of audience, if not yet sales or teaching sophistication, market researchers say. \nTens of millions of users are being drawn to the flexibility of practising vocabulary or conversation on the go, either as part of a serious course of study or simply a more productive alternative to casual video gaming. \n\"It (Other OTC: ITGL - news ) is a matter of incremental convenience: smartphone apps offer a wide selection of content that is more easily accessible, anytime, anywhere,\" said Ed Cooke, founder of London-based Memrise, whose language apps are mostly free. \nThe best mobile apps use voice recognition, email reminders and insights from the psychology of mobile games and cognitive science to keep entry-level as well as advanced users coming back for a few minutes of practice each day. \nThese low-cost products are forcing a rethink by publishers, tutors and suppliers of classroom teaching tools who have long counted on charging double-digit dollar prices for books or hundreds of dollars for courses. \nEstablished companies in the sector are scrambling to make their existing print, software and online products more mobile or retrenching to higher-end courses aimed at businesses or schools so as not to have to compete with free or low-cost apps. \nThe rise of mobile apps is denting sales in the overall market, said Sam Adkins, chief research officer of research firm Ambient Insight. \"The language-learning market is declining in terms of revenue due primarily to the adoption of less expensive, technology-based products,\" he said. \nGlobal sales of language tools and services are expected to dip 2.1 percent to $56.3 billion by 2018, compared with 2014, according to Ambient. Meanwhile, the mobile share should climb 73 percent to around $14.5 billion by 2019, it estimates. \nFEARS FOR FUTURE \nUnder pressure from new competitors, Rosetta Stone, which popularised language self-learning with CD boxsets selling for$200, has been restructuring to focus more on business and school sales rather than consumers. To catch up in mobile, it bought LiveMocha, a free online learning site, and created Apple (Swiss: AAPL.SW - news ) and Android phone apps that give away a bit of content for free in a bid to draw intermediate users to commit to longer courses. \nVirginia-based Rosetta's share price has plunged 77 percent since its stock market flotation in 2009. Recently, it saw its second-quarter revenue fall 10 percent to $51.4 million, with sales at its consumer business dropping 26 percent. \nBerlitz, another grand name in language training now owned by Britain's Apa Publishing, gave a bleak assessment of the outlook for many established providers. \nChief Executive Rene Frey said it did not make sense for publishers to invest further in expert language content as users flock to mostly free content on the web, served up by Google Translate, crowd-sourced dictionaries such as LEO of Germany or low-cost digital companies like Babbel. Instead, Apa is focused on expanding its Insight line of travel guides and phrasebooks. \n\"Some publishers are trying to become premium-product suppliers. But it is very difficult for them to be as innovative as these technology companies,\" Frey (Paris: FR0010588079 - news ) said. \n\"I just don't see how much future there is for publishers.\" \nThe most popular mobile apps help users with written vocabulary or sentence fill-ins but also give them conversational practice, talking back to their phones - safer, at least for starters, than grilling by a punctilious teacher. \nBerlin-based Babbel, whose founders previously ran a music-mixing software business that remains one of the more popular programmes used by professional DJs, embarked on language training in 2007 to fill an online market void. \nIt has attracted tens of million of users and has 120,000 downloads a day of its apps, which come in 14 languages. \nLESS IS MORE? \nBabbel says it has been profitable since 2011, doubling revenue each year since. Users pay, on average, about $6 a month for subscriptions. That has made it the highest-grossing language app supplier in most European countries on the Apple and Google Play stores, according to research firm AppAnnie. \nChief Executive Markus Witte said Babbel quickly found that it was not how much one could learn in one sitting, but how little. \"Binge learners tend not to come back,\" he said. \"People who learn a little tend to come back more regularly.\" \nDuolingo, the top language app globally in terms of users, asks users to pick a goal, from five minutes a day for casual users to 20 minutes daily for \"insane\" users, then sets them off on short vocabulary and sentence completion games. \nPittsburgh-based Duolingo has attracted more than $83 million in financing from top Silicon Valley venture capitalists and Hollywood actor-turned-tech investor Ashton Kutcher since its founding in 2011. It says it has up to 100 million users. \nWhile keeping its services free to consumers, it has yet to settle on a sustainable revenue-generating model, having shifted recently from seeking to charge media companies for translation services to becoming more of a resource for schools. \nLanguage teachers are coming to accept the apps as useful vocabulary builders and for conversational practice but say they are no substitute for interaction with a knowledgeable teacher when it comes to grammar and sustaining motivation. \nAngelika Davey, a native German language tutor living in Wiltshire in England, says that with the rise of language apps, fewer students are interested in committing to weekly classes. She (Munich: SOQ.MU - news ) has stopped advertising with flyers in her local community and instead finds students online, via social media or Skype. \n\"Students are different now. People are quite happy to work on their own,\" she said. \"But they do need a port of call to discuss thing with when they get stuck or things go wrong with books or apps.\" (Editing by Pravin Char)", "external_links": [], "published": "2015-08-21T14:55:00.000+03:00", "crawled": "2015-08-21T15:18:56.134+03:00", "highlightTitle": ""}