{"organizations": [], "uuid": "5496cd30b57c7cf4445e58a084f4fefc0bc3c48e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/zWfJH7dPIriLLshpTUNQaA--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/UK_AFTP_AFP_LIVE_1/d2e136bbf62e04f01473fc6bf9f1f4a0ea6e700d_original.jpg", "site_section": "https://uk.finance.yahoo.com/news/provider-afp/?format=rss", "section_title": "Finance News | AFP - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/indias-economic-reform-agenda-hits-035758354.html", "country": "GB", "title": "India's economic reform agenda hits roadblocks", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "India's economic reform agenda hits roadblocks", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T06:57:00.000+03:00", "replies_count": 0, "uuid": "5496cd30b57c7cf4445e58a084f4fefc0bc3c48e"}, "author": "", "url": "https://uk.finance.yahoo.com/news/indias-economic-reform-agenda-hits-035758354.html", "ord_in_thread": 0, "title": "India's economic reform agenda hits roadblocks", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 14, 2015, 05:26 BST - UK Markets open in 2 hrs 34 mins India's economic reform agenda hits roadblocks By Trudy Harris | AFP – 28 minutes ago View Photo \n\nIndian Prime Minister Narendra Modi's ambitious reform agenda has stalled with crucial bills stuck in India's parliament, which ended its latest session this week in bitter uproar. \nAfter sweeping to power 15 months ago in a landslide election victory, Modi's right-wing government promised a string of business-friendly reforms to attract foreign investment and revive the economy. \nBut the opposition has blocked flagship tax and land reforms with rowdy protests in parliament, while a much-touted plan to overhaul archaic labour laws has yet to be unveiled. \nA year after Modi's first Independence Day speech, hailed as a political tour de force, analysts say he risks failing to deliver on his promises. \nThey will be closely watching his second on Saturday for signs that his right-wing government is still committed to pushing through reforms. \n\"PM Modi promised he would quickly change the economy and get GDP growth back on track,\" said Satish Misra, a senior fellow at the Observer Research Foundation think tank in New Delhi. \n\"People now have a lot of doubt about that. He promised more than he could deliver,\" he told AFP. \n- Landmark tax reforms - \nThe prime minister this week accused the main opposition Congress party of holding back the economy for its weeks-long protest in parliament to demand ruling Bharatiya Janata Party (BJP (Shanghai: 600578.SS - news ) ) leaders resign over graft allegations. \nThe government is desperate to pass a bill paving the way for a landmark national sales tax to replace a myriad of complex state and national levies and boost the economy. \nBut it failed to secure enough backing and now faces a huge struggle to meet a deadline of next April, the start of the financial year. \nCompanies say simplifying India's unwieldy tax system would make it easier to do business in a country clogged with red tape, boosting production and growth. \nFinance Minister Arun Jaitley accused Congress of ignoring the national interest over the goods and services tax, before parliamentary debate descended into personal insults. \nAnalyst Misra blamed Modi and his senior ministers for failing to adequately negotiate with the opposition to resolve the impasse in parliament -- where the BJP lacks a majority in the upper house. \n\"The (opposition) tactics we are seeing in the parliament are not new. We have seen them for the past 20 years,\" he said. \"It's the government's responsibility to unblock these logjams but nothing is moving.\" \nThe government has backtracked on another stuck bill meant to make it easier to buy land for infrastructure and other development projects, following mass protests led by Congress. \nCompanies complain that frustrating negotiations over purchase of land has held up billions of dollars worth of projects, sometimes for years. \nCongress says the amendments, including scrapping a need for consent of 80 percent of landowners for some projects, would hurt millions of poor farmers. \nCongress, humiliated at last year's general election, has been re-energised by the issue ahead of a critical election in Bihar state later this year. \n- Investment pouring in - \nMoody's and Fitch unit BMI Research have warned such problems in implementing big-ticket reforms were aggravating investor concerns. \nCentral bank governor Raghuram Rajan also called for clarity on the stalled bills, telling Bloomberg TV that legislative action \"would send a strong message to the outside that India is still on the move\". \nAnalysts urged Modi to use Saturday's speech, delivered from Delhi's historic Red Fort, to detail how and when he plans to deliver on a plethora of reforms announced since taking office. \n\"Give us a detailed report card on the overabundance of schemes that have been announced since May 2014,\" commentator Gurcharan Das wrote in the Times of India this week. \nThe government defends its performance, saying foreign direct investment rose to $31 billion last financial year, with firms such as Taiwan's Foxconn, the maker of iPhones, this month pledging $5 billion to build factories. \n\"We are working on a number of other reform measures and hopefully we will be able to push those along faster,\" junior finance minister Jayant Sinha told India Today TV. \nThe economy grew 7.5 percent for the first three months of this year, outperforming China's. But experts warn reforms are needed to at least maintain that pace to create jobs for India's millions of young people. \nSonal Verma, chief economist at Nomura, said investors were reassured by some initiatives already introduced, including coal auctions to replace a corruption-hit system of allocating mining licences. And some states were going it alone on reforms instead of waiting for the national government to act, she said. \n\"But the reality is that India is the world's biggest democracy and expectations around reforms have to be realistic,\" she told AFP.", "external_links": [], "published": "2015-08-14T06:57:00.000+03:00", "crawled": "2015-08-14T07:27:19.337+03:00", "highlightTitle": ""}