{"organizations": [], "uuid": "f329f00fb799f1419783a5359d64cef942b68636", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-08/DN_732571_20120731_MB_EGX_CP_P.jpg", "site_section": "http://www.menafn.com/rss/menafn_Business_Finance.xml", "section_title": "MENAFN.com Business_Finance", "url": "http://www.menafn.com/1094321439/Egypt-EGX-rises-minimally-remains-affected-by-global-performance&src=RSS", "country": "US", "title": "Egypt- EGX rises minimally, remains affected by global performance", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Egypt- EGX rises minimally, remains affected by global performance | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "f329f00fb799f1419783a5359d64cef942b68636"}, "author": "Daily News Egypt", "url": "http://www.menafn.com/1094321439/Egypt-EGX-rises-minimally-remains-affected-by-global-performance&src=RSS", "ord_in_thread": 0, "title": "Egypt- EGX rises minimally, remains affected by global performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Daily News Egypt) The Egyptian Stock Exchange (EGX) recovery continued for a second trading day on Wednesday, after witnessing a continuous dropping pattern. The benchmark index EGX-30 closed at 6,873.49 points, rising by 0.53%.\n\nThe EGX-70, which encompasses small and medium enterprises, climbed up by 0.34%, while broader index EGX-100 inched up by 0.12%.\n\n\"The response of the capital market to the global performance was violent,\" EGX Chairman Mohamed Omran said.\n\nEarlier this week, the EGX fell to its lowest level in two years, as the EGX-30 registered 6,784.09 points. On Sunday, the stock exchange reported EGP 15bn in losses. The market recovered on Tuesday.\n\nCommenting on the investors' behaviours during times of crises, Omran said that the logic is that \"war doesn't distinguish between civilian and military\".\n\nExplaining his comments, Omran stated that the extensive selling of their shares and then reinvesting in the emerging market that show potential is a \"classic [example of] emerging market overshooting\".\n\nOmran said that an extensive study of the global economy must be conducted, adding that the crises in global financial market became repetitive. The chairman added that the performance of the market should not be measured by the current period only, but by measuring what is happening in the capital market worldwide.\n\nThe global stock market has been witnessing one of its worst performances in years. The US and European markets plummeted significantly, influenced by the slowdown in China after its decision to devalue its currency. Expectations for China's economic growth fell from 7.5% to 6.8%. As a consequence, the expectations for the global economic growth declined from 3.5% to 3.2%.\n\nFollowing the 2011 uprising, the Egyptian stock market witnessed a significant performance drop. The market started to gain momentum in 2014, with an initial public offering (IPO) from Arabian Cement and several others seeking market listing. The vision for this year, however, was not as bright. The EGX has experienced several performance fluctuations and losses.\n\nDuring the first half (H1) of 2015, 135 companies registered net profits totaling approximately EGP 14bn.The profiting companies in H1 of 2015 compare to 147 companies that registered net profits of about EGP 11.9bn in the same period in the preceding year.\n\nAround 39 companies recorded losses in H1 of 2015, where the total losses of the companies amounted to approximately EGP 570m. The figure compares to the 27 companies that reported losses in the same period of 2014, with total losses equaling EGP 544m.\n\nThe total net profits of the companies went up by approximately EGP 2bn, marking a 17% year-on-year (YoY) increase.", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-29T20:24:34.533+03:00", "highlightTitle": ""}