{"organizations": ["Sirius Minerals PLC"], "uuid": "ef8f2d0c571c124032ee71a137756b6c3729c0ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-construction-materials/?format=rss", "section_title": "Construction & Materials News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/safe-buy-sirius-minerals-plc-150558684.html", "country": "GB", "title": "Is It Safe To Buy Sirius Minerals PLC, Balfour Beatty plc And DFS Furniture PLC?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Is It Safe To Buy Sirius Minerals PLC, Balfour Beatty plc And DFS Furniture PLC?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T18:05:00.000+03:00", "replies_count": 0, "uuid": "ef8f2d0c571c124032ee71a137756b6c3729c0ae"}, "author": "", "url": "https://uk.finance.yahoo.com/news/safe-buy-sirius-minerals-plc-150558684.html", "ord_in_thread": 0, "title": "Is It Safe To Buy Sirius Minerals PLC, Balfour Beatty plc And DFS Furniture PLC?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Balfour Beatty"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Jul 31, 2015, 23:26 BST - UK Markets closed Is It Safe To Buy Sirius Minerals PLC, Balfour Beatty plc And DFS Furniture PLC? By Peter Stephens | Fool.co.uk – 7 hours ago 17.46 +0.21 \n2015 has been a positive year thus far for investors in potash exploration company Sirius Minerals (LSE: SXX), support services contractor Balfour Beatty (LSE: BBY) and furniture seller DFS (LSE: DFS). That's because their share prices have risen by a lot more than the wider index, with Sirius Minerals' valuation being two thirds higher since the turn of the year, and Balfour Beatty and DFS posting capital gains of 10% and 11% respectively year-to-date. \nClearly, an improving UK economy has helped Balfour Beatty and DFS, with the two companies apparently being relatively cyclical. And, in the case of Balfour Beattu, its news flow continues to be positive with it this week being named as preferred bidder (alongside engineering company NG Bailey) for the £460m Hinkley Point C power station. \nAlthough its shares only responded with a 1% gain, Balfour Beatty should generate considerable profit from the six year project and, looking ahead, is expected to increase its bottom line at a rapid rate over the medium term. In fact, the company is expected to follow two disappointing years where it made a loss with a return to a black bottom line in the current year, followed by a trebling of earnings next year. And, even though Balfour Beatty's shares trade on a price to earnings (P/E) ratio of 51.5, such a strong rate of growth equates to a price to earnings growth (PEG) ratio of just 0.3, which indicates that they could move considerably higher. \nSimilarly, DFS also appears to offer excellent value for money at its current share price. It is expected to grow earnings by 19% next year and yet trades on a PEG ratio of just 0.6. Certainly, its performance may be held back somewhat by concerns among investors regarding the impact of a tighter monetary policy. And, while a rising interest rate may make the cost of borrowing higher and dampen demand for purchases made on credit, the improving UK economy and low inflation rate should mean that disposable incomes remain high and confidence continues to be buoyant, thereby providing DFS with a bright medium to long term outlook. \nMeanwhile, Sirius Minerals continues to benefit from encouraging news flow. Following approval for its potash mine in Yorkshire, this week the company turned its attention to the financing of the project. In fact, Sirius Minerals will complete the project in two phases, with the first being to produce 6.5m tonnes per year of potash, with the potential to double this output over the medium term. And, with numerous agreements having been made regarding potash sales, Sirius anticipates being able to successfully raise the capital to fund the project with multiple financings from the debt markets. \nCertainly, it remains a loss-making company, with pretax losses being of a similar level to last year at £10m. However, it has the potential to become a world-class fertiliser company in the long run and, now that it has the required planning consent, could be a viable investment for less risk averse investors with a long term time horizon. \nOf course, there are a number of other stocks that could be worth buying right now and, with that in mind, the analysts at The Motley Fool have written a free and without obligation guide called 1 Top Small-Cap Stock From The Motley Fool. \nThe company in question may have flown under your investment radar until now, but could help you to build a great income from your investments and retire early, pay off the mortgage, or simply enjoy a more abundant lifestyle. \nClick here to find out all about it - it's completely free and comes without any obligation. \nPeter Stephens has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-07-31T18:05:00.000+03:00", "crawled": "2015-08-01T01:27:45.571+03:00", "highlightTitle": ""}