{"organizations": [], "uuid": "8210685872cbad43aec9ade774336cf06873319d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/u/6/z/t/image.related.afrArticleLead.620x365.gity7e.png/1438930194374.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/business/mining/coal/cba-still-supports-coal-with-26b-exposure-to-the-sector-despite-adani-setback-20150807-gity7e", "country": "AU", "title": "CBA still supports coal with $2.6b exposure to the sector, despite Adani setback", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "CBA still supports coal with $2.6b exposure to the sector, despite Adani setback | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T14:49:00.000+03:00", "replies_count": 0, "uuid": "8210685872cbad43aec9ade774336cf06873319d"}, "author": "Ben Potter and Shaun Drummond with Mark Ludlow", "url": "http://www.afr.com/business/mining/coal/cba-still-supports-coal-with-26b-exposure-to-the-sector-despite-adani-setback-20150807-gity7e", "ord_in_thread": 0, "title": "CBA still supports coal with $2.6b exposure to the sector, despite Adani setback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "All the major banks have exposure to the resources sector. Bloomberg by Ben Potter and Shaun Drummond with Mark Ludlow Commonwealth Bank of Australia still has a $2.625 billion credit exposure to coal mines, ports and transport infrastructure, and is not walking away from the sector despite losing its advisory role in the troubled $16.5 billion Carmichael coal project.\nCBA's total coal credit exposure at December 31 comprised $925 million in loans to black coal mines and $1.7 billion in ports and transport infrastructure. The details are in a fact sheet summarising the bank's exposure to resource projects and carbon dioxide emissions.\n\"CBA's role is to support the Australian economy. As a major financial institution we invest in nearly every sector and believe we need to have a balanced, measured and responsible approach,\" a spokeswoman said.\nCBA was one of three banks – the others were ANZ and National Australia Bank – which withstood heavy fire from anti-coal activists in March to back a $1.4 billion loan to Whitehaven Coal to develop the controversial Maules Creek mine in NSW.\nAdani Enterprises withdrew CBA's advisory mandate to finance the first stage of the giant project a month ago, well ahead of Wednesday's federal court decision revoking commonwealth government approval for the project.\nAdani has been trimming back costs since March and it is understood the company felt it was pointless to have financial advisers raise debt for the mega-mine while they were still caught up in the courts by environmental groups.\nWestpac, which has a $1.4 billion exposure to coal loans, said it intended to stick with the resources sector despite the challenges.\n\"Westpac's commitment to the natural resources sector remains unchanged despite well publicised challenges in market conditions and outlook having an impact on the level of activity in some parts of the industry,\" a spokesman said.\n \"We bank customers in the sector through cycles and take [the] long term view when assessing project financing.\"\nThe CBA spokeswoman played down the bank's overall position in the energy industry, saying its exposure to all mining, oil and gas was less than 2 per cent of nearly $1 trillion of total credit exposures, and black coal mining just 5 per cent of that.\nBut that's still a lot of money that coal investors need if they are to build new projects, which is why the major banks are a prime target of anti-coal environmental activists.\nThe banks are acutely aware of this. \"We will only lend to projects that meet our high environmental, social and governance standards, and we work with clients to manage their ESG risks,\" CBA's spokeswoman said.\nNational Australian Bank did not comment on its $1.5 billion coal mining credit exposure.\nBut a spokesman emphasised NAB's commitment to \"Australia's transition to a clean energy future\", saying it was the largest financier of renewable energy and the issuer of the first green bond.", "external_links": [], "published": "2015-08-07T14:49:00.000+03:00", "crawled": "2015-08-08T06:27:41.109+03:00", "highlightTitle": ""}