{"organizations": [], "uuid": "07f1ee5dd2d0408159615e237f70c99249f7a8e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/heritage-newspapers/rss/627", "section_title": "Heritage Newspapers : Personal Finance", "url": "http://business-news.thestreet.com/heritage-newspapers/story/how-the-self-employed-can-still-cut-their-2014-tax-bill/13256133", "country": "US", "title": "How The Self-Employed Can Still Cut Their 2014 Tax Bill", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "How The Self-Employed Can Still Cut Their 2014 Tax Bill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T15:14:00.000+03:00", "replies_count": 0, "uuid": "07f1ee5dd2d0408159615e237f70c99249f7a8e3"}, "author": "", "url": "http://business-news.thestreet.com/heritage-newspapers/story/how-the-self-employed-can-still-cut-their-2014-tax-bill/13256133", "ord_in_thread": 0, "title": "How The Self-Employed Can Still Cut Their 2014 Tax Bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jason Notte"], "text": "How The Self-Employed Can Still Cut Their 2014 Tax Bill Written by: Jason Notte 08/14/15 - 8:14 AM EDT \nNEW YORK ( MainStreet ) –- While it's too late for much of the taxpaying public to reduce the hit they took in 2014, self-employed filers still have some time to soften the blow. \nBack in April, we made clear that you could take an extension and put off filing your 2014 tax return until October 15. However, what self-employed workers including freelancers, cab drivers, contractors and consultants often don't know is that you can also set up a Simplified Employee Pension (SEP-IRA) any time before that deadline and make tax-deductible contributions while getting deferred growth. \nReKeithen Miller, certified financial planner with Palisades Hudson Financial Group in Atlanta, points out that the SEP-IRA allows self-employed taxpayers to reduce their 2014 federal income taxes by offering them the opportunity to contribute up until their tax-filing deadline. That includes the six-month extension, he says. More Headlines Social Security Fears? It's the Solvency Issue, Stupid \n“If you got an extension and haven’t filed your return yet, you have until October 15, 2015 to make 2014 contributions to your plan,” Miller says. \nGranted, you those same workers could also contribute to a Solo 401(k) during that same timeframe, but that assumes they had the foresight to establish that plan by the end of 2014. However,if you're a self-employed individual without employees, other than a spouse, who may contribute to the plan if he or she is employed by the business, a Solo 401(k) is certainly worth your time. \n“If you are self-employed, consider adopting a retirement plan such as a SEP IRA or Solo K which allows maximum pretax contributions up to $53,000 for 2015,” said Masood Vojdani, founder and CEO of MV Financial, a Bethesda, Md.-based wealth management firm with $500 million in assets under management. “Business owners as well as self-employed individuals should consider enhanced retirement plan designs such as a new comparability profit sharing plan or a cash balance plan.” 1", "external_links": [], "published": "2015-08-14T15:14:00.000+03:00", "crawled": "2015-08-14T15:35:45.489+03:00", "highlightTitle": ""}