{"organizations": [], "uuid": "81cf00c97aef33c0316366e51ed31c3bf5297f1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12928749.htm", "country": "US", "title": "Verian Announces Newest Release of Purchase-to-Pay Suite", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Verian Announces Newest Release of Purchase-to-Pay Suite", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "81cf00c97aef33c0316366e51ed31c3bf5297f1c"}, "author": "Lindsay Munn", "url": "http://www.prweb.com/releases/2015/08/prweb12928749.htm", "ord_in_thread": 0, "title": "Verian Announces Newest Release of Purchase-to-Pay Suite", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Today Verian announced its fall release of Verian 15, the market-leading Purchase-to-Pay suite, has gone live in the cloud. This latest release adds significant efficiency to asset maintenance, contracts management, form-based buying and analytics to help companies push more types of orders through the system, resulting in control over additional areas of indirect spending. Highlights from the Verian 15.2 release include:\nFaster asset maintenance: Servicing assets now has a more streamlined workflow that enables users to easily identify assets for maintenance and tie work orders to those assets in fewer steps. Assets can be quickly selected in the system using powerful filters and barcode scanning. Creating and administrating work orders is also more efficient, driving higher user adoption and ensuring facility maintenance happens on time and within budget. Smarter contracts management: This release adds new ways to track spending to contracts in real-time. Users can now see on-contract items at each step of the buying process, tie non-catalog items to contracts, retroactively tag newly added catalog items back to contracts during receiving and create blanket purchase orders against contracts. This helps companies shift as much spending as possible to contract-based buying for better pricing and additional negotiation power. Easier buying: New item smart forms allow customers to capture spend for customizable products and services that are often too unique for standardized catalogs – like branded T-shirts in various sizes and colors. Users can now initiate purchases quickly from the dashboard, while the system calculates costs based on their specific selections.\nAdvancements in spending analytics with this release will also help companies see even more actionable details related to their performance. Users can now access:\nVendor scorecards to show performance by vendor and designated criteria Redesigned purchasing reports showing greater transactional details for better analysis of data and new filters to pull specific information More Key Performance Indicators (KPIs) to analyze project-based buying\n“Verian is always looking for new ways to help customers get the most spend under management,” said Tehseen Ali Dahya, President and CEO of Verian. “We are excited about this new release that makes it easier for companies to funnel additional spending scenarios through Verian, ultimately gaining more cost control and reaping greater savings.”\nVerian deploys new releases to customers quarterly to ensure they have the latest advancements in Purchase-to-Pay technology at their fingertips. With its true multi-tenancy architecture, all cloud customers receive the upgrades seamlessly and simultaneously, making sure everyone has the very latest innovations.\nTo learn more about Verian, register for the “Introduction to Verian” 15-minute webinar Sept. 3 at 2 p.m. EDT.\nAbout Verian\nVerian is a worldwide leader in Purchase-to-Pay solutions. Creating visibility and control over clients’ indirect spending, we help organizations achieve dramatic cost savings and contract compliance. We drive value beyond implementation by helping organizations bring every pocket of spend under management with our proven See-Manage-Save approach. Learn more by visiting Verian.com .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52ZXJpYW4uY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy52ZXJpYW4uY29tL3dlYmluYXItaW50cm9kdWNpbmctdmVyaWFuLXB1cmNoYXNlLXRvLXBheS1pbi10aGUtY2xvdWQv"], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-27T22:30:27.725+03:00", "highlightTitle": ""}