{"organizations": [], "uuid": "d5b2a1cd31d927418eca7374bb8d9eb3e80cfe04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://media3.marketwire.com/docs/wilmingtonlogoLG.png", "site_section": "http://www.marketwire.com/rss/mwFSPF.xml", "section_title": "Marketwired - Personal Finance", "url": "http://www.marketwired.com/press-release/wilmington-announces-private-placement-tsx-wcm.a-2051183.htm", "country": "CA", "title": "Wilmington Announces Private Placement", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Wilmington Announces Private Placement", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T23:49:00.000+03:00", "replies_count": 0, "uuid": "d5b2a1cd31d927418eca7374bb8d9eb3e80cfe04"}, "author": "", "url": "http://www.marketwired.com/press-release/wilmington-announces-private-placement-tsx-wcm.a-2051183.htm", "ord_in_thread": 0, "title": "Wilmington Announces Private Placement", "locations": ["Wilmington"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 28, 2015 16:49 ET Wilmington Announces Private Placement \nTORONTO, ONTARIO--(Marketwired - Aug. 28, 2015) - Wilmington Capital Management Inc. (TSX:WCM.A)(TSX:WCM.B)(\"Wilmington\" or the \"Corporation\") announces a non-brokered private placement (the \"Private Placement\") of a minimum of 750,000 and a maximum of 1,570,000 Class \"A\" Shares of the Corporation to be issued at a price of $3.50 per Class \"A\" Share, for gross proceeds to the Corporation of up to $5.5 million. Closing of this Private Placement is expected to occur on or about September 22, 2015. \nThe Corporation intends to use the net proceeds of the Private Placement to subscribe for units expected to be issued by its 42.5% owned investee entity, Real Storage Private Trust (the \"Trust\"). \nThe Private Placement is subject to a number of conditions, including the execution of formal documentation and approval of the Toronto Stock Exchange. \nAbout Wilmington \nWilmington Capital Management Inc. is a Canadian investment and asset management company whose principal objective is to seek out investment opportunities in the real estate and energy sectors, which provide shareholders with capital appreciation over the longer term as opposed to current income returns. Wilmington invests its own capital, alongside partners and co-investors in hard assets and private equity funds and manages these assets through operating platforms. \nCertain statements included or incorporated by reference in this document may constitute forward looking statements under applicable securities legislation. Forward looking statements or information typically contain statements with words such as \"anticipate\", \"believe\", \"expect\", \"plan\", \"intend\", \"estimate\", \"propose\", or similar words suggesting future outcomes or statements regarding an outlook. Forward looking statements or information in this document may include, but are not limited to: the completion of the Private Placement; the expected closing; the satisfaction of conditions including receipt of requisite approvals; business strategy and objectives; an investee unit offering; participation in an investee entity unit offering; financing opportunities and capital appreciation. No assurances can be given that the Corporation will be able to close the Private Placement to participate in the mentioned offering on favorable terms or at all nor that the Trust will issue the units as anticipated, on other terms or at all. \nSuch forward looking statements or information are based on a number of assumptions all or any of which may prove to be incorrect. \nAlthough Wilmington believes that the expectations reflected in such forward looking statements or information are reasonable, undue reliance should not be placed on forward looking statements because Wilmington can give no assurance that such expectations will prove to be correct. Forward looking statements or information are based on current expectations, estimates and projections that involve a number of risks and uncertainties which could cause actual results to differ materially from those anticipated by Wilmington and described in the forward looking statements or information. These risks and uncertainties include but are not limited to: the ability of management of Wilmington and its investee entities to execute its and their business plans; health, safety and environmental risks; uncertainties as to the availability and cost of financing; general economic and business conditions; the possibility that government policies or laws may change or governmental or regulatory approvals may be delayed or withheld; risks associated with existing and potential future law suits and regulatory actions against Wilmington; and other risks and uncertainties described elsewhere in this document or in Wilmington's other filings with Canadian securities regulatory authorities. \nThe forward looking statements or information contained in this document are made as at the date hereof and Wilmington undertakes no obligation to update publicly or revise any forward looking statements or information, whether as a result of new information, future events or otherwise, unless required by applicable securities laws. This news release should not be considered a suitable source of information for readers who are unfamiliar with Wilmington and should not be considered in any way as a substitute for reading the full report. The foregoing lists are not exhaustive, for a full discussion of the Corporation's major risk factors, see the most recent Annual Information Form, available on SEDAR at sedar.com. Contact Information", "external_links": [], "published": "2015-08-28T23:49:00.000+03:00", "crawled": "2015-08-29T00:42:54.986+03:00", "highlightTitle": ""}