{"organizations": [], "uuid": "ee540aa2b1d75a3ad3e8451ae399e50b1574af46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/i/y/0/t/1/image.related.afrArticleLead.620x365.gixzzn.png/1439447744622.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/politics/leave-it-to-the-people-just-like-the-republic-20150812-gixzzn", "country": "AU", "title": "Abbott on gay marriage: 'Leave it to the people', just like the republic", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Abbott on gay marriage: 'Leave it to the people', just like the republic | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T08:05:00.000+03:00", "replies_count": 0, "uuid": "ee540aa2b1d75a3ad3e8451ae399e50b1574af46"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/politics/leave-it-to-the-people-just-like-the-republic-20150812-gixzzn", "ord_in_thread": 0, "title": "Abbott on gay marriage: 'Leave it to the people', just like the republic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Tony Abbott: When he sensed the mood of Parliament he decided it was not the place to decide on gay marriage after all. Jesse Marlow Share on twitter by Phillip Coorey Tony Abbott's epiphany in which he has decided the people, not the politicians , should decide on gay marriage is not driven by some newfound embrace of broader democracy, but the realisation he can use a national vote to kill the issue pretty much for good.\nWhen Mr Abbott taunted Labor in Parliament on Wednesday that \"members opposite will want the politicians to decide; this government wants the people to decide\", those who have been around a while were immediately transported back the 1999 republic referendum.\nIt was Mr Abbott, then a junior minister, along with Nick Minchin, who masterminded the campaign to kill both the republic and Malcolm Turnbull's dream.\nOne of Mr Abbott's most effective lines was that politicians could not be trusted. It got him into enormous trouble with his colleagues but worked a treat among the public, which always likes to be told it is collectively smarter than the nongs it sends to Canberra.\nPrime Minister Tony Abbott during Question Time. Alex Ellinghausen Mr Abbott's line resonated with the monarchists as well as the direct-elect republicans who opposed the model on offer, which would have seen Parliament play a role in selecting the president.\nSo when Mr Abbott told Parliament on Wednesday \"what could be fairer than leaving this to the people of Australia?\", it was déjà vu all over again.\nWhen Ireland voted in a plebiscite in May to support gay marriage, Mr Abbott, both publicly and privately, was adamant no such national vote was needed here, especially a referendum.\n\"I don't think anyone's suggesting that the constitution needs to be changed in this respect,\" he said.\n \"Under the constitution, questions of marriage are the preserve of the Commonwealth Parliament; other matters of regulation of society are normally a matter for the state parliaments.\n\"Plainly, this is a matter that could quite properly come before the Commonwealth Parliament if members of parliament wanted it to be raised.\"\nBut as time wore on and it became apparent the momentum in Parliament was continuing to go only one way – more and more MPs were coming out in support of gay marriage – the Prime Minister needed something more emphatic.\nFor some months the Australian Christian Lobby and conservatives like Scott Morrison, Cory Bernardi and George Christensen had been openly calling for a plebiscite or referendum,\nGay marriage may have popular support in the opinion polls but it could be defeated by a well organised No campaign, especially in a referendum that requires a double majority of the states and the national vote.\nReferendums have no chance of passing if they are opposed by the prime minister of the day. In recent weeks, Mr Abbott has been talking to Mr Morrison and others about such a move and now, with all the zeal of a convert, he is arguing for a national vote some time in the never-never.\nThe plan not only rids the government of having to confront the issue in this term, but gives it an entirely saleable message to take to the election and, ultimately, a vehicle to kill it for a very long time.\nWhen the republic failed to get up in 1999, the misty-eyed predicted Australia would be a republic within another decade. That was 16 years ago.", "external_links": ["https://twitter.com/PhillipCoorey"], "published": "2015-08-13T08:05:00.000+03:00", "crawled": "2015-08-13T11:02:32.078+03:00", "highlightTitle": ""}