{"organizations": [], "uuid": "ef72cd24764a6091f4be2e2f8e07e8c0700febf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "undefined", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-29/treasuries-wild-ride-a-prelude-to-key-jobs-report-before-fed", "country": "US", "title": "Treasuries' Wild Ride a Prelude to Key Jobs Report Before Fed", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "Treasuries' Wild Ride a Prelude to Key Jobs Report Before Fed - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T12:01:00.000+03:00", "replies_count": 0, "uuid": "ef72cd24764a6091f4be2e2f8e07e8c0700febf2"}, "author": "Susanne Walker Barton", "url": "http://www.bloomberg.com/news/articles/2015-08-29/treasuries-wild-ride-a-prelude-to-key-jobs-report-before-fed", "ord_in_thread": 0, "title": "Treasuries' Wild Ride a Prelude to Key Jobs Report Before Fed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For Treasuries traders battered by the most volatile week since February, the biggest turbulence may still be ahead as a crucial U.S. report on August employment looms.\nFederal Reserve Vice Chairman Stanley Fischer said Friday that the bank hadn’t decided whether to raise interest rates next month, though he did say U.S. economic data had been “impressive.” Officials will monitor reports leading up to their meeting before making up their minds, he said on CNBC.\nA week marked by financial-market turmoil sent 10-year Treasury yields to the lowest since April as investors sought the debt for a haven. Yet as stocks rebounded, U.S. debt ended the week with the biggest losses since June.\nMerrill Lynch Option Volatility Estimate MOVE Index\n\"The markets are not used to seeing this level of uncertainty,\" said Aaron Kohli, an interest-rate strategist in New York at BMO Capital Markets, one of 22 primary dealers that trade with the Fed. \"We are at the precipice for a hike. The markets are going to be looking at them far more than they ever have,\" he said, referring to the labor data, set for release Sept. 4.\nThe benchmark 10-year note yield rose about 14 basis points on the week, or 0.14 percentage point, to 2.18 percent, according to Bloomberg Bond Trader data. The 2 percent Treasury due in August 2025 dropped about 1 5/16, or $13 per $1,000 face amount, to 98 3/8.\nTreasuries volatility surged this month, according to the Bank of America Merrill Lynch MOVE Index. The gauge reached 94.5 on Aug. 24, the highest since February and compared with a 12-month average of about 79.\nThe jobs report may lead traders to add to bets that the Fed will pull the trigger the following week and boost its target for the first time since 2006. It will probably show the economy added more than 200,000 jobs for a fourth straight month, while the unemployment rate dropped, according to the median forecast in a Bloomberg News survey.\nOctober Surprise\nTraders see a 38 percent chance the Fed will move next month, up from 24 percent seen Aug. 26. The probability of an increase by the Oct. 27-28 meeting rose to 48 percent, from 32 percent earlier in the week. The calculation is based on the assumption that the effective fed funds rate will average 0.375 percent after the first increase.\nFischer’s comments followed New York Fed President William Dudley’s remarks Wednesday that market turbulence made the case for a September move “less compelling\" than a few weeks ago.\nThe U.S. economy has been a bright spot amid world turbulence. Reports Friday showed that even as inflation remained below the Fed’s 2 percent target in July, consumer purchases climbed and incomes improved. Separate data this week showed the economy grew at an unexpectedly fast 3.7 percent annual pace last quarter.\nIt’s an “open question” whether the Fed moves now or waits, Atlanta Fed President Dennis Lockhart said in an interview Friday on Bloomberg TV. The October policy meeting is still in play, he said.", "external_links": [], "published": "2015-08-29T12:01:00.000+03:00", "crawled": "2015-08-29T07:29:26.969+03:00", "highlightTitle": ""}