{"organizations": ["Investment Management Business CBRE Group, Inc", "CBRE Group, Inc", "Investment Management Business CBRE Group, Inc."], "uuid": "10b24444b9233e7bb1f3f32bbe8ce6037ee830c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "http://finance.yahoo.com/rss/PropertyManagement", "section_title": "Yahoo! Finance: Property Management Industry News", "url": "http://finance.yahoo.com/news/cbre-group-inc-announces-executive-010000803.html", "country": "GB", "title": "CBRE Group, Inc. Announces Executive Appointments in Asia Pacific Region and Investment Management Business", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "CBRE Group, Inc. Announces Executive Appointments in Asia Pacific Region and Investment Management Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T04:00:00.000+03:00", "replies_count": 0, "uuid": "10b24444b9233e7bb1f3f32bbe8ce6037ee830c7"}, "author": "", "url": "http://finance.yahoo.com/news/cbre-group-inc-announces-executive-010000803.html", "ord_in_thread": 0, "title": "CBRE Group, Inc. Announces Executive Appointments in Asia Pacific Region and Investment Management Business", "locations": ["Asia Pacific Region"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CBRE Group, Inc. Announces Executive Appointments in Asia Pacific Region and Investment Management Business CBRE Group, Inc. 2 hours ago  \nLOS ANGELES--(BUSINESS WIRE)-- \nCBRE Group, Inc. ( CBG ) today announced two executive leadership appointments: \nDaniel Queenan will assume new leadership responsibilities as Chief Operating Officer, CBRE Global Investors, the company’s investment management subsidiary. Mr. Queenan has relocated back to the U.S. after serving as Chief Executive Officer, Asia Pacific (APAC), for the past two years. Mr. Queenan will have a broad charter to help drive the strategy and operations for CBRE Global Investors and will report to Matt Khourie, Chief Executive Officer, CBRE Global Investors. He will also work closely with Ritson Ferguson, recently named Chief Investment Officer, and the entire CBRE Global Investors leadership team on all facets of the business. Mr. Queenan will serve on CBRE Global Investors’ Executive Committee and Global Investment Committee. \nSteven Swerdlow will assume new responsibilities as Chief Executive Officer, Asia Pacific region. Mr. Swerdlow will oversee all operations in APAC, and will report to Robert Blain, Executive Chairman, APAC, who will retain overall responsibility for the region. Mr. Swerdlow will also play a key role on the Asia Pacific Strategic Group. A 25-year veteran of CBRE, Mr. Swerdlow has held a wide range of senior leadership positions at the company. He will maintain his management responsibilities for CBRE’s U.S. Western Division and will split his time between Asia Pacific and the U.S. \n“Steve and Danny are two of our most accomplished executives, and they are highly committed to our focus on exceptional client service and operational excellence,” said Bob Sulentic, CBRE’s president and chief executive officer. “Steve brings strong leadership skills to his new role and will work closely with Rob to drive further growth across Asia Pacific. Danny did an outstanding job of partnering with Rob to lead Asia Pacific. His more than 20 years of operating and investment experience will be a great complement to Matt, Ritson and our CBRE Global Investors team.“ \nAbout CBRE Group, Inc. \nCBRE Group, Inc. ( CBG ), a Fortune 500 and S&P 500 company headquartered in Los Angeles, is the world’s largest commercial real estate services and investment firm (in terms of 2014 revenue). The Company has more than 52,000 employees (excluding affiliates), and serves real estate owners, investors and occupiers through more than 370 offices (excluding affiliates) worldwide. CBRE offers strategic advice and execution for property sales and leasing; corporate services; property, facilities and project management; mortgage banking; appraisal and valuation; development services; investment management; and research and consulting. Please visit our website at www.cbre.com . View source version on businesswire.com: http://www.businesswire.com/news/home/20150824005915/en/ Asia Pacific", "external_links": [], "published": "2015-08-25T04:00:00.000+03:00", "crawled": "2015-08-25T07:00:47.148+03:00", "highlightTitle": ""}