{"organizations": [], "uuid": "9f8c1dcdedf265a37d0a82c1b464cc82f9bf54f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/j/7/u/c/4/image.related.afrArticleLead.620x365.gj7tvu.png/1440578936330.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/special-reports/forex/currency-fluctuations-unnerving-small-business-20150826-gj7tvu", "country": "AU", "title": "Currency fluctuations unnerve small business", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Currency fluctuations unnerve small business | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T16:00:00.000+03:00", "replies_count": 0, "uuid": "9f8c1dcdedf265a37d0a82c1b464cc82f9bf54f6"}, "author": "Post to Linkedin", "url": "http://www.afr.com/news/special-reports/forex/currency-fluctuations-unnerving-small-business-20150826-gj7tvu", "ord_in_thread": 0, "title": "Currency fluctuations unnerve small business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Richard Poulton says SMEs are either scaling back their foreign trade activity to manage the currency risk or are using hedging tools. Louise Kennerley by Mark Abernethy Australian businesses may have a more sophisticated approach to hedging currency risk compared with their global equivalents, but they are more spooked by foreign exchange fluctuations, according to the AFEX Currency Risk Outlook survey.\nNew research from AFEX, a global non-bank provider of foreign payment solutions, shows Australia's small and medium enterprises (SMEs) are the most advanced users of currency risk hedging tools, with 45 per cent using hedging tools to create certainty around cash flow and margins, in comparison with the global average of 32 per cent.\nThe annual survey polled more than 450 financial decision makers in Australia, Canada, the United States and Britain on global trade and managing foreign exchange risk.\nIn the coming year, 93 per cent of Australian businesses plan to use foreign exchange risk mitigation strategies either to the same level or more than in the previous year.\nHowever, the survey identified that 15 per cent of Australian SMEs were postponing or cancelling growth plans – and 12 per cent scaling back their businesses – due to currency volatility.\nThis result compared with the international mean of 9 per cent postponing or cancelling plans, and 6 per cent scaling back.\nGeneral manager of AFEX Australia, Richard Poulton, says the survey results point to both sophisticated treatment of currency issues among Australian business owners, as well as ongoing foreign exchange pressure.\n'Pressure for trade-exposed businesses' \"The past 12 months has seen the Aussie dollar fall against the US dollar from .94¢ to (about) 73¢,\" Poulton says. \"That's a 23 per cent drop in the value of the Aussie, and 23 per cent represents a lot of pressure for trade-exposed businesses.\"\nPoulton says the steeply falling Aussie dollar, while generally good for Australian exporters, has alarmed many businesses because of the trade terms.\nThose being caught out have been businesses converting their transactions on the currency spot market.\n\"If you're sourcing goods and materials in Asia, you're typically trading via US dollars and the payment terms are 90 days,\" Poulton says. \"When the Aussie dollar is falling rapidly against the US – as it has done in the past year – the dollar can move appreciably against you in three months.\"\nPoulton says the businesses that have stuck to the spot markets can easily watch their profit margins erode because of currency volatility.\nHe says Australian SMEs are either scaling back their foreign trade activity in order to manage the currency risk, or they are using hedging tools such as forward contracts or options.\n\"The most popular facility is buying a forward contract,\" Poulton says.\nForward contracts aligned to orders The forward contract is an agreement to buy another currency at a certain rate at a certain time in the future. Businesses usually align a forward contract with a large order, so they have certainty the price they struck for goods and materials is the price they will pay, rather than having to find the extra Aussie dollars to meet a price usually struck in US dollars.\n\"The forward contract is a hedging tool,\" Poulton says, \"but it also becomes a part of normal planning and budgeting for businesses with foreign exchange transactions. If your business operates on certain margins, you can't lose that margin simply because exchange rates have shifted.\"\nPoulton says some businesses also use currency options – it's an option, but not an obligation, to buy a currency at a certain rate in the future.\nBusiness owners use options, often in conjunction with forward contracts, when they believe the exchange rates might rally or not be as weak as the forward contract stipulates.\nThe hedging of currency risk has become a part of the operating environment at Obodo Contemporary Furniture, an importer and distributor of furniture and mattresses to retailers and fit-out contractors.\nDirector and chief financial officer, Rob Laurie, says buying forward contracts for an agreed exchange rate for euros and US dollars is about protecting the margins and therefore the business.\n\"If we just paid the invoices when they were due, and didn't do any hedging, then our margins would always be uncertain,\" Laurie says. \"We'd either have to absorb our loss of profit margin on an order, or we'd have to put up our prices. If our competitors are hedged, they're not raising their prices and they gain an advantage.\"\nOptions not for profit Laurie says Obodo has imports of about $US100,000 a month, and €50,000. Because of the steady sourcing of materials, Obodo has rolling forward contract facilities, each new one being of six months.\n\"We know what our orders are several months in advance, and we know the size and cycles of the invoices we're paying,\" Laurie says. \"We have forward contract facilities for at least 70 per cent of our payments, and we form a view about what the currency markets are going to be doing over the next six months.\"\nHe says the company also uses options, but not to make profit. \"The forward contract protects us if the Aussie currency falls before we pay the invoice. If the currency rallies, we can exercise the option – but the forward contract is always there. Buying forward protects us from downside risk.\"\nLaurie says the company has a firm policy to avoid \"playing\" the currency markets. They use a specialist foreign exchange provider, which not only provides currency at the contracted rate when the invoices have to be paid, but also provides market insight and hedging strategies.\n\"We're a furniture and mattress distributor,\" Laurie says. \"It's just that 99 per cent of our products are imported, so we have to have sensible hedging strategies to ensure the margins we budgeted for can be realised. We don't play the market or try to be experts on it.\"\nAFEX Australia's outlook on the Aussie is that Australia's \"tightening or cutting bias\" is diverging from the United States' \"loosening or raising bias\".\nPoulton says there is a chance the Reserve Bank of Australia will cut official interest rates again, which is likely to further devalue the Aussie against the greenback.\nCurrency environment volatile \"The US is talking about raising interest rates and there could be another drop in our own interest rates,\" Poulton says. \"The currency environment is still volatile and that's why Australian SMEs have such high levels of hedging compared with other countries.\"\nThe fast slide of the Australian dollar in the past year could provide the impetus for more small businesses to take advice and use hedging tools, head of markets analysis at East & Partners, Martin Smith, says.\nHe says in the \"lower corporate\" end of the SME spectrum, about 60 per cent of business owners use hedging strategies such as forwards and options to manage currency risk. But in the smaller and micro businesses, spot buying is still the norm.\n\"Only one in two small businesses have a defined treasury policy,\" Smith says. \"Most use their primary bank for trade finance, and a specialist FX provider for settling foreign accounts. But they just pay the invoice at the spot rate.\"\nHe says the specialist providers – such as AFEX, AMEX and Western Union – are including education and advice in their transactional services, allowing business owners to see hedging as a business tool rather than simply an FX cost.\n\"There's a big market for educating small business owners,\" Smith says.", "external_links": [], "published": "2015-08-26T16:00:00.000+03:00", "crawled": "2015-08-27T02:40:41.636+03:00", "highlightTitle": ""}