{"organizations": [], "uuid": "7c7a3efe15a4c758a2a69fdb9d149dbe01ee0105", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/h/v/l/2/n/image.related.afrArticleLead.620x365.giqe63.png/1438584667696.jpg", "site_section": "http://www.afr.com/news", "section_title": "Finance &amp; Political Breaking News Australia &amp; Worldwide | afr.com", "url": "http://www.afr.com/news/policy/industrial-relations/unions-should-look-at-cutting-fees-to-attract-members-says-bill-kelty-20150803-giqe63", "country": "AU", "title": "Unions should look at cutting fees to attract members, says Bill Kelty", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Unions should look at cutting fees to attract members, says Bill Kelty | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T14:51:00.000+03:00", "replies_count": 0, "uuid": "7c7a3efe15a4c758a2a69fdb9d149dbe01ee0105"}, "author": "Ewin Hannan", "url": "http://www.afr.com/news/policy/industrial-relations/unions-should-look-at-cutting-fees-to-attract-members-says-bill-kelty-20150803-giqe63", "ord_in_thread": 0, "title": "Unions should look at cutting fees to attract members, says Bill Kelty", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bill Kelty says unions should develop a more flexible fee structure based on the services they deliver. Lee Besford Share on twitter by Ewin Hannan Former Australian Council of Trade Unions secretary Bill Kelty has called on unions to consider cutting their membership fees as a way to address the decline in trade union membership.\nMr Kelty, ACTU secretary from 1983 to 2000, said he was criticised the most by union leaders when he warned them in the mid-1980s that they had to adapt to the changing nature of the workforce.\nUnion membership is at its lowest level, with just 12 per cent of private-sector employees choosing to belong to unions. Latest Australian Bureau of Statistics show total union membership at 1.74 million.\nMr Kelty said unions should have a \"more flexible fee structure based on the services they delivered to members\".\n\"You need adaptive unions providing a whole range of services, probably with lower fee structures than some of them have currently got,\" he said in an interview.\n\"In all my years at the ACTU, when did I get hammered the most? The 1985 [ACTU] Congress when I got up and said, `If you take the structure of the workforce and the structure of unionism, by 2000, we are going to have 18 per cent membership because out structures are not going to be where the workplace is,'\" he said.\nWhile he said some union leaders supported him and adapted, others resisted.\n\"I was at it for 15 years. In the end, I couldn't convince them,\" he said. \"Some just whinged and complained. The whingers and the complainers are yelling from the grave.\"\n Mr Kelty said some unions had adapted to change, describing the Australian Education Union and the Australian Nursing and Midwifery Federation as \"fantastic unions\".\n\"They are modern, they provide services, they provide effective bargaining,\" he said. \"The teachers and the nurses are as good as unions as any place in the world. Adaptive, modern, providing everything and with really good leadership.\"\nChange of focus needed Former ACTU president Simon Crean said union membership had fallen as a proportion of the workforce because unions had failed to adequately respond to employment growth in services.\n\"It's true that the proportion of workers in unions has diminished essentially because the trade union movement has never faced up to the fact properly that the huge growth in employment has been in the services sector, and it's still too narrowly focused on traditional manufacturing and the public service but not where the huge growth in employment has been,\" he said in an interview.\n\"Australia's future as an export nation, quite frankly, is increasingly going to be stronger in services than just reliant on commodities and that's what the movement, in an organisational sense, has not faced up to.\"\nAsked why unions had failed to make inroads into the services sector, he said: \"I don't think they have traditionally focused on it.\"\n\"It requires a new style of leadership. It requires an intense understanding of where the jobs and economic opportunities are coming from,\" he said.\n\"I think the union movement has to be more attuned to the model where people in these jobs are going to be changing jobs more often.\"", "external_links": ["https://twitter.com/EwinHannan"], "published": "2015-08-03T14:51:00.000+03:00", "crawled": "2015-08-03T10:55:43.170+03:00", "highlightTitle": ""}