{"organizations": [], "uuid": "e4f0111573b97deb6d6f4d85b8beb7c9e31e6cbc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-media/?format=rss", "section_title": "Media News | Media Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/britains-ftse-led-lower-itv-105744256.html", "country": "GB", "title": "Britain's FTSE led lower by ITV, William Hill", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Britain's FTSE led lower by ITV, William Hill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T13:57:00.000+03:00", "replies_count": 0, "uuid": "e4f0111573b97deb6d6f4d85b8beb7c9e31e6cbc"}, "author": "", "url": "https://uk.finance.yahoo.com/news/britains-ftse-led-lower-itv-105744256.html", "ord_in_thread": 0, "title": "Britain's FTSE led lower by ITV, William Hill", "locations": ["Britain"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["William Hill"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 7, 2015, 12:21 BST - UK Markets close in 4 hrs 9 mins Britain's FTSE led lower by ITV, William Hill Reuters - UK Focus – 24 minutes ago \n* FTSE 100 down 0.1 pct \n* ITV (LSE: ITV.L - news ) falls more nearly 4 pct \n* Miners gain 2 percent (Updates prices, adds details) \nBy Liisa Tuhkanen \nLONDON, Aug 7 (Reuters) - Britain's top equity index edged slightly lower on Friday, weighed down by sharp drops in broadcaster ITV and bookmaker William Hill (Other OTC: WIMHF - news ) . \nThe blue-chip FTSE 100 index was down 0.1 percent by 1044 GMT. It closed 0.1 percent lower on Thursday, led by weakness in miners and insurer RSA. \nShares (Berlin: DI6.BE - news ) in ITV fell 3.7 percent a day after weak earnings reports from U.S. media left Wall Street bruised and dragged the sector to its worst two-day loss since the financial crisis. \nSeveral European media companies slipped on the read-across from the U.S. sector tumble, but ITV stock was hit harder as Liberty said just days earlier it still had no intention of taking over Britain's biggest free-to-air commercial TV firm despite raising its stake in the company to 9.9 percent. \nHowever, some analysts said the read-across might be exaggerated. \n\"This is a good buying opportunity ... U.S. TV market (is) very different from UK/Europe - channels show a lot more advertising (>20 mins per hr) giving consumers a big incentive to switch off especially given the high cable fees,\" Liberum analysts said in a note. \nAlso on the downside, Britain's largest bookmaker William Hill fell more than 7 percent after posting a 12 percent fall in first-half operating profit, weighed down by increased machine games duty and a new tax on bets made online by its UK-based customers. \nIn a separate statement, the group said it had acquired 29.4 percent of NeoGames, an online lottery software and services provider, for $25 million. \n\"William Hill results highlight the speargun pressure created by the additional cost resulting from the Point of Consumption tax,\" said Eric Opara, analyst at Edison Investment Research. \n\"Going forward we would expect smaller players to suffer disproportionately enabling bigger players with the right products to increase their market share, thus mitigating the impact of the additional tax cost somewhat.\" \nIn other top fallers, Travis Perkins (LSE: TPK.L - news ) dropped 2.5 percent after a target price cut from Panmure. \nAmong small caps, UK Mail Group plummeted as much as 20 percent after warning that its full-year profit would be materially below market expectations due to additional operating costs relating to the transition to its new automated hub near Coventry. \nOn the upside, Glencore (Xetra: A1JAGV - news ) rose nearly 3 percent after South Africa's mines minister on Friday conditionally withdrew his suspension of the licence for the firm's Optimum Coal Mine. \nOther miners also recovered from the lows seen on Thursday. The FT350 Mining index was up more than 2 percent after falling 1.2 percent in the previous session. \n(Editing by Alison Williams)", "external_links": [], "published": "2015-08-07T13:57:00.000+03:00", "crawled": "2015-08-07T14:23:57.444+03:00", "highlightTitle": ""}