{"organizations": [], "uuid": "d49fa9a23e724eadb52fc5ab80d8e04934436b19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/28/japan-economy-cpi-idUSL4N1121RX20150828", "country": "US", "title": "UPDATE 2-Japan inflation stalls and spending slides, keeps BOJ under pressure", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 2-Japan inflation stalls and spending slides, keeps BOJ under pressure | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T04:29:00.000+03:00", "replies_count": 0, "uuid": "d49fa9a23e724eadb52fc5ab80d8e04934436b19"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/28/japan-economy-cpi-idUSL4N1121RX20150828", "ord_in_thread": 0, "title": "UPDATE 2-Japan inflation stalls and spending slides, keeps BOJ under pressure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Nationwide July core CPI 0.0 pct vs f'cast -0.2 pct * July household spending -0.2 pct yr/yr vs f'cast +1.3 pct * BOJ sanguine for now, Kuroda says ready to act if needed (Adds analyst Quote: , details) By Leika Kihara TOKYO, Aug 28 Japan's core consumer inflation was flat in the year to July and household spending unexpectedly fell, casting deeper doubt on the central bank's forecast that a solid economic recovery will help accelerate inflation to its 2 percent target. While the Bank of Japan has said it will look through the effect of slumping oil costs on inflation, the weak figures will keep it under pressure to expand its massive stimulus programme. The core consumer price index (CPI), which includes oil products but excludes volatile fresh food prices, was unchanged in July from a year earlier, government data showed on Friday, against a median market forecast for a 0.2 percent drop. While that was the slowest pace of growth in more than two years, a government official briefing reporters said consumer prices remained in an uptrend when excluding the effect of last year's oil price falls. A private sector analyst noted: \"Given recent further falls in oil prices, core CPI probably declined in August and there's a chance the pace of fall will accelerate in September,\" said Yoshiki Shinke, chief economist at Dai-ichi Life Research Institute. \"But the BOJ is unlikely to ease further as long as oil falls remain the key factor behind the weakness in inflation.\" Separate data showed household spending fell 0.2 percent in the year to July, confounding a median market forecast for a 1.3 percent rise and reinforcing concerns about the strength of Japan's recovery. Japan's economy shrank in April-June and analysts expect any rebound in the current quarter to be modest as fears of China's slowdown jolts markets, hurting exports and business sentiment. Policymakers sound sanguine for now with BOJ Governor Haruhiko Kuroda saying that China's slowdown is unlikely to hit Japanese exports much and that oil price falls won't stop the BOJ from achieving its price goal. But Kuroda added that the BOJ is ready to deploy additional stimulus if necessary to reflate the economy. Some lawmakers are also calling for fresh fiscal spending to ease the offset the effect of overseas headwinds. The government, however, remains cautious of big fiscal spending given Japan's massive public debt. The BOJ is also reluctant to expand an already radical stimulus programme given its rising costs and side-effects such as draining liquidity from the bond market. Finance Minister Taro Aso told reporters on Friday the government was not considering deploying new fiscal stimulus for now. (Additional reporting by Kaori Kaneko; Editing by Shri Navaratnam and Eric Meijer)", "external_links": [], "published": "2015-08-28T04:29:00.000+03:00", "crawled": "2015-08-28T03:54:00.486+03:00", "highlightTitle": ""}