{"organizations": ["Habib Bank UAE", "Barwa Bank"], "uuid": "629805fadbe8fe2045e2b274ad4ffea3d3f25e4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rssfeeds/islamic_finance.xml", "section_title": "Zawya.com - Islamic Finance News", "url": "http://www.zawya.com/story/Qatars_Barwa_Bank_net_profit_for_H1_stood_at_QAR412m-ZAWYA20150802104514/", "country": "AE", "title": "Qatar's Barwa Bank net profit for H1 stood at QAR412m", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Qatar's Barwa Bank net profit for H1 stood at QAR412m", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T15:04:00.000+03:00", "replies_count": 0, "uuid": "629805fadbe8fe2045e2b274ad4ffea3d3f25e4b"}, "author": "", "url": "http://www.zawya.com/story/Qatars_Barwa_Bank_net_profit_for_H1_stood_at_QAR412m-ZAWYA20150802104514/", "ord_in_thread": 0, "title": "Qatar's Barwa Bank net profit for H1 stood at QAR412m", "locations": ["Qatar", "Doha"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Habib Bank UAE launches call center Doha - Driving healthy growth and diversification across its portfolio of products and services, Barwa Bank, Qatar's most progressive Shari'ah compliant service provider, capped the first half of 2015 with noteworthy financial results. Announced on 12 July 2015, the resultsextend a solid performance track record for the bank,reflecting robust balance sheet growth and strong financial standing. \nBarwa Bank's net profit for the half-year stood at QAR 412 million, while earnings per share rose to QAR 1.39in the first half of 2015, compared with QAR 1.38over the corresponding period in 2014. Underlined by sizeable growth across its financing assets and investment securities, the bank's total assets soared by 16% to QAR 41.3 billionfor the first half of the year; financing assets alone registered an increase of 10% to exceed QAR 24.4 billion. \nOwing to Barwa Bank's strong focus on product and service development and integration across business segments, as well as to a heavy push on tech-driven innovation, customer deposits posted equally impressive results for the first half of 2015, increasing by 4% to stand strongly at QAR 23.2 billion. Commenting on the results, H.E. Sheikh Mohamad bin Hamad bin Jassim Al Thani, Chairman, Barwa Bank Group, said: \"This past year presented the regional banking industry with a great deal of positive challenges. The impact of the drop in oil prices has left a dent on some balance sheets but has alsopushed governments, private conglomerates and financial institutions to refocus investments away from the hydrocarbon sector and into emerging growth sectors. The Qatari banking sector was not insulated from this environment. It has, however, gained momentum on the back of strong economic growth and diversification led by the Qatar National Vision 2030. In this transforming context, we were able to, once again, stretch our objectives forward as we solidify our presence in and outside of Qatar, move with speed and purpose and integrate our products and services across disciplines to better serve our stakeholders and investors.\" \nMr. Khalid Yousef Al-Subeai, Acting Group Chief Executive Officer, Barwa Bank Group added: \"The group's results in the first half of 2015 lay on solid foundations that have been driving our performance and track recordover the past years. Our strategy remains focused on operational efficiency, process streamlining, integration and crossover of our core banking products and services.Nowhere has this strategy been more evident than in the first half-year results; resulting in increase in the total revenue by 7% in 2014, bringing cost to revenue ratio down to 39% from 40%, making, in parallel, a major push on the collection of non-performing assets, which shrunk to 1.6% of the total financing assets, compared with 1.8% as at the end of 2014. We will continue to drive profitability and efficiency across our operations as Qatar ushers in a new era of infrastructural investments. We see in this transitional period ample prospects and opportunities for our business, and equally great returns for our stakeholders. \" -Ends-\nAbout Barwa Bank Barwa Bank is a Shari'ah compliant bank in the State of Qatar, established in Doha and licensed and regulated by the Qatar Central Bank. Barwa Bank provides a full range of Shari'ah compliant banking services including retail, corporate and commercial banking, private banking, real estate finance, structured finance, investments and asset management. \nCONTACTSFor more information on Barwa BankDiane Alphonse: (+974) 4448 8348Group Head of Marketing, Communications & PRBarwa Bank", "external_links": [], "published": "2015-08-02T15:04:00.000+03:00", "crawled": "2015-08-02T17:53:58.997+03:00", "highlightTitle": ""}