{"organizations": [], "uuid": "cd363cc910a5d0b1124fd6c43c14d3a167e9a528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/g/h/2/d/g/7/image.related.afrArticleLead.620x365.giqmiz.png/1438744245467.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/banking-and-finance/will-property-investor-rate-increases-trigger-a-rise-in-margin-loans-for-shares-20150803-giqmiz", "country": "AU", "title": "Will property investor rate increases trigger a rise in margin loans for shares?", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Will property investor rate increases trigger a rise in margin loans for shares? | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T06:32:00.000+03:00", "replies_count": 0, "uuid": "cd363cc910a5d0b1124fd6c43c14d3a167e9a528"}, "author": "Simon Evans", "url": "http://www.afr.com/business/banking-and-finance/will-property-investor-rate-increases-trigger-a-rise-in-margin-loans-for-shares-20150803-giqmiz", "ord_in_thread": 0, "title": "Will property investor rate increases trigger a rise in margin loans for shares?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Margin loans are at about one quarter the level of December 2007. But might the increase in lending rates to property investors by the big banks prompt a rethink? Louie Douvis Share on twitter Share on Google Plus by Simon Evans Could renewed interest in borrowing to invest in shares through margin loans be the spark for a sharemarket battling to make much headway?\nThe $11.7 billion balance of margin loans in Australia is around one-quarter of the level it was in December 2007, before the financial crisis hit.\nExperts say there is unlikely to be a fresh surge in borrowing to invest in shares just yet, but the rate increases by the big banks for investor loans over the past two weeks may be the start of a more earnest reassessment of whether better returns might be found in other asset classes\nThe subdued appetite for margin lending means the total balance of margin loans is at about the same level in Australia as it was in September 2003. A combination of substantial volatility and some high-profile cases of people having lost their life savings after gearing at excessive levels before the financial crash combined to crimp demand in the past few years.\nMargin loans are at about one quarter the level of December 2007. But might the increase in lending rates to property investors by the big banks prompt a rethink? Louie Douvis Contrast that to the $41.6 billion in margin loan balances in December 2007. The $30 billion difference has in part been a handbrake on the broader gains made by the Australian sharemarket over the past few years, although there have, of course, been other larger forces at work such as the collapse in commodity prices and the end of the resources boom.\nCredit Suisse equity analyst Damien Boeydoesn't expect a substantial pick-up in borrowing to invest in shares because of the subdued outlook for Australian equities over the next few years and the likelihood that interest rates will slowly begin to rise around the world.\nEquities to return just over 3 per cent He estimates the average annualised return from Australian equities will be \"3 and a bit per cent\" over the next few years using a \"through-the-cycle\" approach. Given where stock valuations generally are at the moment, and the likelihood that the Reserve Bank of Australia is close to the end of its rate-cutting cycle, it will be hard for investors to justify amplifying their leverage to equities on a fundamentals basis.\n \"It is very hard to get a credit-engineered recovery in the economy and in equities,\" he said.\nThe situation is in stark contrast to the residential property market where buyers are happy to take on large loans to buy houses and apartments in Sydney and Melbourne at stretched valuations . He acknowledges that property purchases aren't just made on purely financial parameters.\n\"Not all things are equal. This is the trap that we're in,\" he said.\nMr Boey says the absence of higher leverage in the sharemarket over the past few years has been part of the reason why it hasn't been able to generate the gains that other sharemarkets around the world have generated.\n\"If there were more leverage in the system there would have been more gains,\" he said.\nSavanth Sebastian, economist with Commsec, said while margin lending was at lower levels in Australia compared with historical comparisons, the lifting of home-lending rates for investors by the big banks may prompt a rethink about whether better returns might be on offer from gearing into shares. The yields on bank shares in particular were still solid.\n\"I think greater numbers of investors will start to have a bit more of a look about which asset classes they should be investing in,\" Mr Sebastian said.\nHe expects there to be more rate rises for investor lending for properties. \"I don't think we've seen the end of it,\" he said.\nOfficial figures out in late July showed term deposits held with banks dropped $6.3 billion to $506 billion and were down 4.3 per cent on a year earlier, the biggest decline in 12 years. This showed investors were increasingly on the hunt for a better return in a low-interest rate environment.\nCredit Suisse's Mr Boey said the uncertainty in China and the slide in commodity prices meant investors were still likely to prefer safer stocks such as Telstra for some time. The Australian sharemarket's S&P/ASX 200 hit a record of 6828.7 points in November 2007 before slumping to 3145 points in early March,2009.\nThe RBA publishes regular updates on margin-loan balances and its March 2015 figures showed there were 147,000 people with margin-lending accounts; this compares with 260,000 in December 2009. It was sitting at 248,000 margin lending accounts in December, 2007.\nThe level of margin calls has also dropped as investors pulled back on gearing. In March, there were 0.35 margin calls per day for each 1000 margin lending clients, and this had dropped from 0.64 in December 2007.", "external_links": ["http://www.smh.com.au/business/markets-live/markets-live-rba-on-deck-20150803-giqtwr.html", "https://plus.google.com/https://plus.google.com/103351169357344338991", "https://twitter.com/SimonMEvans"], "published": "2015-08-05T06:32:00.000+03:00", "crawled": "2015-08-05T10:09:47.576+03:00", "highlightTitle": ""}