{"organizations": [], "uuid": "2c9157e6ee802b025ff88f5e07a1f71bfefe3e98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canberratimes.com.au", "main_image": "http://www.canberratimes.com.au/content/dam/images/g/i/r/u/q/k/image.related.articleLeadwide.620x349.girsbl.png/1438765920953.jpg", "site_section": "http://www.canberratimes.com.au/business/carbon-economy", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.canberratimes.com.au/business/markets/markets-not-ready-for-a-us-fed-hike-but-dont-rule-one-out-20150804-girsbl.html", "country": "AU", "title": "Markets not ready for a US Fed hike, but don't rule one out", "performance_score": 0, "site": "canberratimes.com.au", "participants_count": 1, "title_full": "Markets not ready for a US Fed hike, but don't rule one out", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T17:12:00.000+03:00", "replies_count": 0, "uuid": "2c9157e6ee802b025ff88f5e07a1f71bfefe3e98"}, "author": "", "url": "http://www.canberratimes.com.au/business/markets/markets-not-ready-for-a-us-fed-hike-but-dont-rule-one-out-20150804-girsbl.html", "ord_in_thread": 0, "title": "Markets not ready for a US Fed hike, but don't rule one out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to video Video settings Please Log in to update your video settings\nVideo will begin in 5 seconds.\nDon't play Play now More video Recommended Tip of the Week: Women and retirement\nMal Maiden: Dithering markets\nRBA keeps rates on hold\nNew trade deals - good, bad or indifferent?\nMal Maiden: ANZ takes a small step towards equality\nReplay video Return to video Video settings Please Log in to update your video settings\nMal Maiden: Dithering markets With nervous US markets and the RBA looking like it will hold off on further rate rises, Mal Maiden examines these issues as well as James Packers ambitious plans for the future.\nPT3M49S 620 349 Autoplay On Off Video feedback Video settings Global financial markets are not fully ready for an interest rate rise from the United States Federal Reserve if it happens next month, meaning markets are on course for disruption if they do not revise their thinking and the central bank goes ahead with the first hike in US rates since the financial crisis.\nComments overnight by the president of the Atlanta branch of the Fed, Dennis Lockhart, published in the Wall Street Journal moved markets because the perceived centrist said he required a \"significant deterioration\" in economic data to justify not voting for a rate rise at the September meeting.\nThe market doesn't have it fully priced in at all, they don't have a rate move in there until the December meeting... I would imagine that there'd be some disruption to markets when the Fed finally goes because you're always going to get some people that don't believe that it's likely.\nCommonwealth Bank of Australia senior economist Michael Workman September is the first live meeting for the Fed in the eyes of markets, but some forecasters do not think the Fed will hike until the December meeting or next year. The Fed's official line has been that it is data dependant .\nFederal Reserve chair Janet Yellen could raise rates in the US as soon as next month. Photo: Reuters\nCommonwealth Bank of Australia senior economist Michael Workman said: \"The market doesn't have it fully priced in at all, they don't have a rate move in there until the December meeting... I would imagine that there'd be some disruption to markets when the Fed finally goes because you're always going to get some people that don't believe that it's likely.\"\nThe US dollar rallied after Mr Lockhart's comments , reversing some gains by the Australian dollar on Tuesday after the Reserve Bank of Australia hinted that it was satisfied with the value of the currency for the first time in this easing cycle.\nTop-ranked Australian fund manager, Sean Fenton from Tribeca Investment Partners, said that equities were likely to feel the ructions too when the Fed makes its move. He believes that the Fed will agree to \"lift-off\" next month.\nPotential instability \"You would expect to see wobbles in the bond market, also the US dollar may be a bit stronger on the bid... That could create a little bit of volatility like we saw in the initial taper tantrum at the end of Q/E (quantitative easing).\"\nIn May 2013, at the first hint of the end of QE, the S&P/ASX 200 Index wiped out 100 points in a single session; it has rallied since then in fits and starts as volatility rises and fades. This is why fund managers say the Fed's hike will come with an assurance that the pace of tightening will be slow.\nThe downside of zero per cent interest rates was forcing people into yield and leveraged strategies that potentially builds up instability in the financial system, Mr Fenton explained.\n\"If you take the view that [rates are] a fair way from normal at the moment, the economy's not that bad and there are risks from financial imbalances building up, they do need to look at the process of normalising rates. The Fed in its communications have become clearer and lift-off is getting closer.\"\nAll things being equal, a rate rise from the Fed should push the greenback up higher and devalue the Australian dollar. It was fetching US73.70¢ on Wednesday after trading above US74¢.\nMove next month likely Emma Lawson, senior currency strategist at National Australia Bank, said that the market was 47 per cent priced for a move next month. But between now and then, two new monthly payrolls numbers are scheduled that will illuminate views around the quality of the labour market.\nNAB thinks the Fed will lift rates in September and Ms Lawson said there was plenty of time for market pricing to catch up.\n\"We would expect that if you continue to get the rhetoric from the Fed heading into the meeting and the data, particularly Friday's payrolls number, if they are solid it is more likely to be fully priced by the time we get to the September meeting,\" she said.\nThat also means more volatility in markets around speeches and economic data releases in the lead-up to the September 16-17 meeting.\n\"This can move very, very quickly and that's why you get moves in markets,\" Ms Lawson said. \"We just need that data to come in ok.\"\nIn her note to clients earlier on Wednesday, the NAB strategist noted that St Louis Fed president, James Bullard, said last week that the world's biggest economy was ready for a rise in interest rates in a separate interview.\nMeanwhile, some aspects of US economic data continue to be disappointing, distorting the picture for the world's biggest economy. Westpac economist Elliot Clarke said the second-quarter employment cost index just delivered the weakest quarterly outcome in the 30-year history of the survey.\nBank surprises CBA's Mr Workman said that central bank's had the capacity to surprise, as the Reserve Bank did in February of this year.\n\"You wouldn't rule out anything by a central bank these days.\" he said. \"Because it will be the first increase in eight-and-a-half years, they need to be very cautious about it and we just had fairly detailed statements from them about their view of the economy... there wasn't the tone of language to imply they were about to lift rates.\"\nMarkets are \"obviously not convinced it will happen in the next month and that's why they're leaning towards December\".\nForecasts for the US jobs data due this week are not overly bullish; but it would probably take labour gains of more than 300,000 jobs in July to jolt the market into readiness, he added. The unemployment rate in June was 5.3 per cent and the economy added 223,000 jobs.\n\"I think [September is] something you couldn't rule out. There's always this issue with central banks, who'd ever thought we'd see negative interest rates in parts of Europe and that's seen to be quite an acceptable action by the [European Central Bank],\" Mr Workman said.", "external_links": ["http://www.afr.com/markets/why-the-rba-might-not-have-finished-cutting-quite-yet-20150804-giqxek", "http://www.wsj.com/articles/atlanta-feds-lockhart-fed-is-close-to-being-ready-to-raise-short-term-rates-1438709252", "http://www.smh.com.au/business/markets/currencies/australian-dollar-slips-back-below-74-us-cents-20150804-girq9h.html", "http://www.afr.com/news/economy/monetary-policy/more-data-needed-before-rate-rise-fed-officials-say-20150708-gi86fs"], "published": "2015-08-05T17:12:00.000+03:00", "crawled": "2015-08-06T22:07:15.388+03:00", "highlightTitle": ""}