{"organizations": [], "uuid": "16beabef789644ef440b1d2efeded753fa788cb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/03/markets-global-idUSL1N10E1A120150803", "country": "US", "title": "GLOBAL MARKETS-Soft data weighs on oil, stocks; Europe shines", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "GLOBAL MARKETS-Soft data weighs on oil, stocks; Europe shines | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T20:04:00.000+03:00", "replies_count": 0, "uuid": "16beabef789644ef440b1d2efeded753fa788cb3"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/03/markets-global-idUSL1N10E1A120150803", "ord_in_thread": 0, "title": "GLOBAL MARKETS-Soft data weighs on oil, stocks; Europe shines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Updates prices, changes comments, dateline; previous LONDON)\n* Commodities weaken, crude extends losses after soft factory data\n* Greek stocks slump in reopening from June close\n* Canadian, Australian currencies at multi-year lows\nBy Rodrigo Campos\nNEW YORK, Aug 3 (Reuters) - Oil futures prices hit a six-month low on Monday, weighed by oversupply and weaker demand expectations, while stocks in Asia and on Wall Street were under pressure as factory data from China and the United States disappointed.\nThe Canadian dollar hit its weakest in more than a decade against its U.S. peer, weighed by lower crude.\nThe pace of growth in the U.S. manufacturing sector slowed in July and missed expectations, while China's factory activity shrank more than initially estimated last month.\nEuro zone factories, however, largely shrugged off Greece's brush with bankruptcy. The Netherlands, Spain and Italy all reported healthy growth, and Italy's expansion was its best in more than four years.\n\"The slowdown in China feeding into a slowdown in Asia, and the question becomes how much of that is feeding into the U.S.?\" said Quincy Krosby, market strategist at Prudential Financial in Newark, New Jersey.\nHowever, she added, \"We've started to see more positive data out of Europe despite the Greek situation.\"\nThe U.S. Federal Reserve is widely expected to raise interest rates before the end of the year and for the first time in nearly a decade. If Chinese weakness seeps into the U.S. economy, the Fed could reassess and markets would have to balance between more support from the central bank and the expectation for slower growth.\nAt noon ET, the Dow Jones industrial average was down 71.92 points, or 0.41 percent, at 17,617.94, the S&P 500 was down 1.95 points, or 0.09 percent, at 2,101.89 and the Nasdaq Composite added 3.92 points, or 0.08 percent, to 5,132.20.\nThe pan-European FTSEurofirst 300 was 0.6 percent higher, while MSCI's measure of stocks across major markets globally fell 0.3 percent.\nIn Athens, stocks plunged 16.2 percent as the market reopened after trading was suspended in late June as part of capital controls imposed to prevent a collapse in Greece's banks that would have likely pushed the country out of the euro zone.\nMSCI's broadest index of Asia-Pacific shares outside Japan fell more than 1 percent.\nOil slumped on worries of oversupply as OPEC pumped at record levels in July, adding to the demand concern after weak data from China.\nBrent fell 4 percent to $50.15 a barrel after touching an intraday low of $50.05, the lowest since Jan. 30. U.S. crude fell 2.4 percent to $45.99 a barrel after hitting the lowest in more than four months at $45.86.\nCopper dropped to its weakest in six years.\nCommodity-related currencies continued to weaken, with the Canadian dollar at its lowest in 11 years versus the greenback and the Australian dollar near the more than six-year low it hit last week against the U.S. currency.\nThe U.S. dollar was unchanged against the euro after the manufacturing data miss pulled it lower.\nU.S. long-dated and benchmark Treasuries yields hit their lowest levels in two months on the weaker-than-expected U.S. data.\n\"The market now is taking score of every single data print between now and September, and if the balance continues to shift more toward weaker data than stronger data, it may make September a coin flip,\" said George Goncalves, head of U.S. rates strategy at Nomura Securities International in New York, speaking to some expectations that the Fed will start to raise rates then.\nBenchmark 10-year Treasury notes were last up 9/32 in price to yield 2.173 percent, from a yield of 2.205 percent late Friday. U.S. 30-year bonds were last up 28/32 in price to yield 2.884 percent, from a yield of 2.928 percent late Friday.\n(Additional reporting by Shinichi Saoshiro; Editing by Dan Grebler)", "external_links": [], "published": "2015-08-03T20:04:00.000+03:00", "crawled": "2015-08-03T19:10:53.711+03:00", "highlightTitle": ""}