{"organizations": ["Berkshire Hathaway"], "uuid": "2ad6a9d8bc5559ed46e0a36a45c294305d204b90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-basic-materials/?format=rss", "section_title": "Basic Resources News | Yahoo! Finance", "url": "https://uk.finance.yahoo.com/news/berkshire-hathaway-builds-stake-refiner-190754385.html", "country": "US", "title": "Berkshire Hathaway builds stake in refiner Phillips 66", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Berkshire Hathaway builds stake in refiner Phillips 66", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T22:07:00.000+03:00", "replies_count": 0, "uuid": "2ad6a9d8bc5559ed46e0a36a45c294305d204b90"}, "author": "", "url": "https://uk.finance.yahoo.com/news/berkshire-hathaway-builds-stake-refiner-190754385.html", "ord_in_thread": 0, "title": "Berkshire Hathaway builds stake in refiner Phillips 66", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Phillips"], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nSat, Aug 29, 2015, 22:16 BST - UK Markets closed Berkshire Hathaway builds stake in refiner Phillips 66 Berkshire Hathaway builds stake worth nearly $4.5 billion in refiner oil Phillips 66 By The Associated Press | Associated Press – 2 hours 8 minutes ago 77.23 +2.21 \nBillionaire investor Warren Buffett's company has amassed a stake worth nearly $4.5 billion in Phillips 66 more than a year after trading a chunk of its holding in the oil refiner for a chemical business investment. \nA regulatory filing says Berkshire Hathaway Inc. has accumulated about 58 million shares, which amounts to more than 10 percent of the Houston company's stock. \nIn late 2013, the Omaha, Nebraska, company agreed to trade about $1.4 billion of its Phillips 66 stock for one of the refiner's businesses that makes additives to help crude oil flow through pipelines. \nMany investors watch Berkshire Hathaway filings closely because they like to copy Buffett's moves given his successful record. \nPhillips 66 shares closed at $77.23 Friday and have advanced about 8 percent so far this year. Tax cuts, pensions, childcare, online accounts and beer duty, here's … Related Stock Articles Follow the quotes you care about most. Access timely news and investment updates to stay on top of the market. … More » Yahoo UK & Ireland Finance Terms \nQuotes are real-time for NASDAQ, NYSE, and NYSEAmex when available. See also delay times for other exchanges . Quotes and other information supplied by independent providers identified on the Yahoo! Finance partner page . Quotes are updated automatically, but will be turned off after 25 minutes of inactivity. Quotes are delayed at least 15 minutes. All information provided \"as is\" for informational purposes only, not intended for trading purposes or advice. Neither Yahoo! nor any of independent providers is liable for any informational errors, incompleteness, or delays, or for any actions taken in reliance on information contained herein. By accessing the Yahoo! site, you agree not to redistribute the information found therein. \nFundamental company data provided by Capital IQ . Historical chart data and daily updates provided by Commodity Systems, Inc. (CSI) . International historical chart data and daily updates provided by Morningstar, Inc . Yahoo! - News Network", "external_links": [], "published": "2015-08-29T22:07:00.000+03:00", "crawled": "2015-08-30T00:17:20.063+03:00", "highlightTitle": ""}