{"organizations": [], "uuid": "d14e211e3c4ddd0448727755bd658ea18d23cce2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508110834.html", "country": "US", "title": "Kenya: 14 Kenyans Saved After Ship Sinks Off Coast of Somalia's Puntland State", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "Kenya: 14 Kenyans Saved After Ship Sinks Off Coast of Somalia's Puntland State", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T13:25:00.000+03:00", "replies_count": 0, "uuid": "d14e211e3c4ddd0448727755bd658ea18d23cce2"}, "author": "", "url": "http://allafrica.com/stories/201508110834.html", "ord_in_thread": 0, "title": "Kenya: 14 Kenyans Saved After Ship Sinks Off Coast of Somalia's Puntland State", "locations": ["Nigeria", "U.S.", "Kenya", "Puntland", "Somalia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nigeria: Buhari Probes U.S.$600 Million Rail Fund Diversion \nAccording to maritime official Andrew Mwangura, the shipping schedule indicated that the ship was set to arrive at the Kenya port on Friday, the day the stranded crew were rescued after the vessel hit a cliff. \n\"Efforts to rescue the crew were coordinated by the Puntland Maritime Police Force, closely monitored by the European Union Naval Force,\" said Mr Mwangura. \nHe added that the crew -- comprising 14 Kenyans, 12 Indonesians, six Vietnamese and two Yemenis -- would be flown to Nairobi. \n\"The efforts saved the crew from being taken hostage by pirate groups. The 34 are in Puntland's capital Garowe, waiting to be moved to Kenya,\" he said. \nVESSEL'S ACTIVITIES INVESTIGATED \nHowever, the fishing expeditions of the grounded vessel are being investigated by Puntland authorities. \n\"Al Amal and Poseidon were last year briefly seized by maritime authorities in Somalia's capital Mogadishu, and released under mysterious circumstances,\" said Mr Mwangura. \nThe two vessels have been on the radar of maritime experts for alleged illegal fishing throughout the East African region. \nThey a are said to have failed to adhere to maritime laws. \nAuthorities at the Mombasa port held both vessels early this year after suspecting that they were being used for illegal fishing in Kenyan waters. \nMaritime statistics indicate that up to 180 Iranian and 300 Yemeni vessels are illegally fishing in Puntland waters. \nSome Chinese, Taiwanese, Korean and European vessels are said to have invaded Somalia waters. \n\"Some of the Yemeni and Omani-flagged fishing vessels operating in the Horn of Africa are owned by the Taiwanese, Chinese, Koreans, Thais and Iranians,\" said Mr Mwangura. \nAccording to the United Nations' Food and Agriculture Organisation, the waters off Somalia's coastline, that runs 3,205 kilometres, is rich in yellowfin and longtail tuna, Spanish mackerel, sardines and lobsters, among other species. Kenya \nPresident Uhuru Kenyatta has promoted Fatimah Ahmed the first woman Brigadier in the country, in changes to the Kenya … see more » Copyright © 2015 The Nation. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-11T13:25:00.000+03:00", "crawled": "2015-08-11T20:10:32.474+03:00", "highlightTitle": ""}