{"organizations": [], "uuid": "a8d806f3386f7072dcb7387104d8d9fe5a1c64c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources1.news.com.au/images/2015/08/17/1227487/327517-3926bc44-44b0-11e5-b83a-5887e9d6a545.jpg", "site_section": "http://www.news.com.au/finance", "section_title": "Finance | Business and Finance News | News.com.au", "url": "http://www.news.com.au/finance/small-business/getting-prospective-business-associates-to-say-yes-can-be-tough-or-as-simple-as-one-two-three/story-fn9evb64-1227487327547", "country": "AU", "title": "Getting prospective business associates to say ‘yes’ can be tough — or as simple as one, two three", "performance_score": 0, "site": "news.com.au", "participants_count": 1, "title_full": "Getting prospective business associates to say ‘yes’ can be tough — or as simple as one, two three", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "a8d806f3386f7072dcb7387104d8d9fe5a1c64c6"}, "author": "Ross Greenwood", "url": "http://www.news.com.au/finance/small-business/getting-prospective-business-associates-to-say-yes-can-be-tough-or-as-simple-as-one-two-three/story-fn9evb64-1227487327547", "ord_in_thread": 0, "title": "Getting prospective business associates to say ‘yes’ can be tough — or as simple as one, two three", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT’S the most simple of words, but often the most difficult for businesspeople to achieve.\n“Yes.”\nThere have been tomes written about the craft of how to convince businesspeople to say yes. It’s often American psycho babble or high-pressure sales tactics that, to me, raise questions about whether it’s always responsible to sell products customers might not actually need.\nWe’ve all seen it and heard it: “You need to buy now because this offer won’t last”; “This product is so good, I have bought it myself”; ­or “This will change your life”. In my experience, when you hear these phrases you should run. The salesperson’s motivation to sell is greater than the consumer’s motivation to buy. The same is true in business.\ncut the hoopla\nIf you’re in business, you need to be able to sell — but American-style sales will generally not work here.\nYou need to convince potential customers to say yes without alienating them in your approach. The softly-spoken and committed approach seems to be preferred here, rather than the hoopla.\nHere, reputation counts. If you’re known to the people you’re speaking with, you’re more likely to get a hearing.\nOddly, I find Australian businesspeople are more closed with their ideas than Americans, who are generally more open to an informal chat. Because of this, the sales approach also has to be more conservative.\nIt is often prescribed that when seeking new business, you should seek a smaller commitment rather than the big contract you are really seeking. In other words, prove your credentials first in order to achieve a bigger deal in the future.\nA small yes before the bigger yes, if you like.\nThe other point often forgotten by smaller operators seeking business from larger operations is to put yourself in their shoes. The ability to offer a solution to a problem — rather than having a product for sale — is a far more compelling proposition to any organisation.\nKeep it real\nThe next issue is making certain you can achieve what you’re promising.\nThe old adage of chewing new business hard in order to swallow it is always going to be true. But you also need to be honest with yourself that your organisation and capital can handle the business you are seeking.\nIf you fail at the first attempt with a client, it’s unlikely they’ll be back for more.\nFrom a businessperson’s point of view, those first yeses to new business are the lifeblood that allows you to survive. There’s no doubt that after receiving a yes, many a business owner has pumped their fist in the elevator, or in their car, shortly after shouting “Yes!” themselves.\n“Yes” is an obstacle to all new business. But once it is achieved, the business is only just beginning.\nGETTING SACKED PROVED A BLESSING\nIT was 1991 and the nation’s last recession was folding in. Russell Ricketts was working for a glass-plant in Penrith. It was being closed down. He was being retrenched.\nIt was the best day of his life.\n“I feel liberated,” he told his wife that evening. He immediately set up his own construction and engineering business. All he needed was somebody to say “yes” to him.\nHe remembers going to Bathurst one Friday evening, to pitch for a big engineering job. He got the interview because of his reputation in the power-station industry. He had no staff, no premises, no equipment.\n“Eleven of the people in that meeting fell on the floor laughing at my pitch,” he recalls. “But the 12th, the person who was making the decision, said ‘yes’.” That job was worth $100,000 and later another job, worth $250,000, came from the same customer.\nRussell’s skill at getting people to say “yes” became a key part of the business that is almost 25 years old. That 90s recession actually helped, because it allowed him to hire skilled tradespeople to help him complete the work coming in.\n“I got the Railways Inspector to come into our office and he accepted us. Fairly quickly we found ourselves with a job to rebuild the Homebush Railway Station. We did that for several months, three shifts a day to get the steelwork out and then we installed it. We got more projects and we outgrew our premises.”\nWhy did these groups say yes? Russell thinks it goes back to his time working as an engineer. “I just had a reputation. I worked in industry for many years. It is one of the main things in life — keep your reputation strong.”\nThose projects have kept 30 people employed for more than 20 years. Among the projects have been railway bridges and coal facilities. RKR Engineering built and erected the metal awning that surrounds the shops at 400 George Street Sydney.\nThe niche that Russell identified was to provide a whole service: from design, to manufacturing, supply and installation. “Somebody needed to take on the whole process. People wanted turnkey projects,” he says.\nBut don’t imagine it has always been easy.\n“We overspent moving our premises from Springwood to Emu Plains. The bank wouldn’t lend us any more money so we had to sell our house. So we rented for two years and eventually we built a new house.”\nIn that case, it was Russell’s ability to get his family to say yes that was essential to his future success.\nOwner and Founder of RKR Engineering, Russell Ricketts / Picture: David Swift Source: News Limited\n ", "external_links": ["http://www.myspace.com/index.cfm?fuseaction=postto&t=Saying+yes%3A+Acting+in+the+affirmative&c=IT%26%238217%3BS+the+most+simple+of+words%2C+but+often+the+most+difficult+for+businesspeople+to+achieve.+%26%238220%3BYes.%26%238221%3B&u=http://www.news.com.au/finance/small-business/getting-prospective-business-associates-to-say-yes-can-be-tough-or-as-simple-as-one-two-three/story-fn9evb64-1227487327547?sv=96313b91e07ce40d7e72ce233c65b259", "http://digg.com/submit?phase=2&url=http://www.news.com.au/finance/small-business/getting-prospective-business-associates-to-say-yes-can-be-tough-or-as-simple-as-one-two-three/story-fn9evb64-1227487327547?sv=96313b91e07ce40d7e72ce233c65b259&title=Saying+yes%3A+Acting+in+the+affirmative", "http://www.facebook.com/share.php?u=http://www.news.com.au/finance/small-business/getting-prospective-business-associates-to-say-yes-can-be-tough-or-as-simple-as-one-two-three/story-fn9evb64-1227487327547?sv=96313b91e07ce40d7e72ce233c65b259", "http://www.newsvine.com/_wine/save?popoff=0&u=http://www.news.com.au/finance/small-business/getting-prospective-business-associates-to-say-yes-can-be-tough-or-as-simple-as-one-two-three/story-fn9evb64-1227487327547?sv=96313b91e07ce40d7e72ce233c65b259&h=Saying+yes%3A+Acting+in+the+affirmative", "http://www.kwoff.com/submit.php?url=http://www.news.com.au/finance/small-business/getting-prospective-business-associates-to-say-yes-can-be-tough-or-as-simple-as-one-two-three/story-fn9evb64-1227487327547?sv=96313b91e07ce40d7e72ce233c65b259", "http://del.icio.us/post?url=http://www.news.com.au/finance/small-business/getting-prospective-business-associates-to-say-yes-can-be-tough-or-as-simple-as-one-two-three/story-fn9evb64-1227487327547?sv=96313b91e07ce40d7e72ce233c65b259&title=Saying+yes%3A+Acting+in+the+affirmative"], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-17T22:40:27.443+03:00", "highlightTitle": ""}