{"organizations": [], "uuid": "ea4da9911d9f8b72dd54b5614747a1532a7f285c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/airtel4G06815.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/bharti-airtel-takes-its-4g-services-to-296-towns/43046.html", "country": "IN", "title": "Bharti Airtel takes its 4G services to 296 towns", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "Bharti Airtel takes its 4G services to 296 towns", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T14:33:00.000+03:00", "replies_count": 0, "uuid": "ea4da9911d9f8b72dd54b5614747a1532a7f285c"}, "author": "IANS", "url": "http://www.moneylife.in/article/bharti-airtel-takes-its-4g-services-to-296-towns/43046.html", "ord_in_thread": 0, "title": "Bharti Airtel takes its 4G services to 296 towns", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » Companies & Sectors » Company News & Trends » Bharti Airtel takes its 4G services to 296 towns 43046 Bharti Airtel takes its 4G services to 296 towns 0 Comments, Be the first to comment + COMMENT IANS | 06/08/2015 05:03 PM | India's top telecom service provider Bharti Airtel on Thursday said it has commercially launched its fourth generation (4G) communications services in 296 towns across the country. \"With the help of the feedback received from the beta launches, we have now built India’s first commercial 4G network that will make high speed mobile broadband a reality,\" Gopal Vittal, managing director and chief executive officer of the company, said at the launch event here. “The national roll-out today is another small step in our journey to be the most innovative and customer focused brand,” he said, adding that the company's journey in 4G began with the launch in Kolkata in April 2012, followed by successive beta offerings in 51 cities. “The roll-out will take place in few weeks.” Vittal said the company has a projection of $2.2 billion capital expenditure for 2015-16, but declined to divulge the details on the money spent and intended to be spent in offering 4G services. So far, 4G is available in data format in India only. Asked about the rising competition in the 4G space in the country, Vittal said: “We are the children of competition. It’s a brutal market place in India. But it makes one sharper. We thrive in competitive atmosphere.” He said the company's 4G network has, accordingly, been built on an open partner ecosystem model, bringing together the best in the industry. \"We are introducing to the Indian market some never-before experiences. Together with our network and device partners, we have enabled deep proliferation of 4G services in the country.\" Bharti has 230 million subscribers in the country, with a presence in 14 circles. Vittal conceded that the quality of the third generation (3g) services was still not up to the mark, and said: “We have been vocal about call drops.\" \"We have many challenges over spectrum. Towers and sites pose a bigger challenge. With the growth in data sector, we need more sites. That’s a genuine struggle. The government had been supportive on this.” Around three weeks ago, Vittal had written to Airtel customers across the country to provide suggestions regarding tower sites and he said at the 4G launch event that the company received 20,000 responses, out of which 500 provided leads on potential sites. Asked about the device eco-system for 4G, he mentioned the company has an exclusive tie-up with Samsung, but the team is working towards build a robust device ecosystem. “Out of the 60 million phones that are shipped into India every quarter, 20 million are smartphones. This quarter, we expect some 1 million 4G-compatible phones to be shipped,” Vittal said. He said the company’s focus is also to work with manufacturers to drive down prices. Airtel also announced the launch of a new carrier agnostic mobile app - ‘Wynk Movies’ - which it claimed was first-of-its-kind movie mall that will offer specially curated library of thousands of movies and other popular videos. More in Moneylife", "external_links": [], "published": "2015-08-06T14:33:00.000+03:00", "crawled": "2015-08-06T16:20:04.616+03:00", "highlightTitle": ""}