{"organizations": ["Glencore PLC"], "uuid": "a284c3f3cb3fac04409ec716650bc5ac8a084743", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-fool/?format=rss", "section_title": "Finance News | Fool.co.uk - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/glencore-plc-standard-chartered-plc-094326507.html", "country": "GB", "title": "Glencore PLC And Standard Chartered PLC Could Fall Another 30%!", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Glencore PLC And Standard Chartered PLC Could Fall Another 30%!", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T12:43:00.000+03:00", "replies_count": 0, "uuid": "a284c3f3cb3fac04409ec716650bc5ac8a084743"}, "author": "", "url": "https://uk.finance.yahoo.com/news/glencore-plc-standard-chartered-plc-094326507.html", "ord_in_thread": 0, "title": "Glencore PLC And Standard Chartered PLC Could Fall Another 30%!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 27, 2015, 11:14 BST - UK Markets close in 5 hrs 16 mins Glencore PLC And Standard Chartered PLC Could Fall Another 30%! By Rupert Hargreaves | Fool.co.uk – 30 minutes ago +40.500 \nIt has been a terrible year for Glencore (LSE: GLEN) and Standard Chartered (LSE: STAN). \nIndeed, year to date Glencore and Standard's shares have slumped 52% and 23% respectively, as profits have slumped, and the costly mistakes of the past have come back to haunt the companies. \nFor example, Glencore announced a $790m write-down alongside a 56% fall in profits when it released its results earlier this month. A few weeks before Standard announced a drop in first-half pre-tax profit, a jump in impairment charges for bad loans and cut its dividend. \nUnfortunately, these trends could continue and the two companies' shares could fall further before they begin to turnaround. \nChina concerns \nThe health of China's economy is the biggest concern for the majority of City analysts right now, but, in the words of Glencore's CEO Ivan Glasenberg: \"At the moment none of us can read China...None of us know what is going on there and I'm yet to find the guy who can predict China correctly. China in the first half was a lot weaker than anyone expected. \" \nBoth Standard and Glencore's futures depend on the health of China's economy. Standard is particularly reliant on the health of Asia's largest economy. \nOverweight \nBritish-based banks are the largest foreign lenders in China, with a total of $221.2bn outstanding loans to China, which is more than double the volume of loans made by US banks. During the past year, the number of Standard's outstanding loans to entities based in China expanded by 30%. \nAlso, around a fifth of Standard's loan book is linked, directly and indirectly, to the commodity market -- around $61bn in dollar terms, roughly 140% of the bank's tangible net worth. \nThat said, the bank's management is working hard to reduce the group's direct exposure to the commodity market. Direct exposure has declined 11% since the end of 2014. \nStill, there's no escaping the fact that any prolonged Chines economic slowdown will hit Standard hard. Not only will the group suffer as loans to Chinese customers turn bad, the company will also feel the effect of falling commodity prices, which are under pressure due to declining Chinese demand. \nCommodity giant \nLike Standard, Glencore is suffering as China's demand for raw materials slows and commodity prices slide. The price of coal and copper, Glencore's two main commodities, has plunged to multi-year lows this year, and it doesn't look as if prices will mount a recovery anytime soon. \nGlencore has responded by slashing capital spending. Capex this year will be cut to $6bn and $5bn in 2016. However, the group has a $29.5bn debt pile to contend with many of Glencore's mines have higher production costs those of mining titans BHP and Rio, both of which produce a similar range of commodities. \nStill, while the future doesn't look bright for Glencore, if you're willing to take the risk, the company's shares currently trade at 0.7 times book value. Glencore's projected dividend yield is 8.3%, the highest in the mining sector. \nI strongly recommend that you research Glencore yourself before making a trading decision -- you may come to a different conclusion. \nTo help you assess the company, our top analysts have put together this new report entitled, \"How You Could Retire Seriously Rich \". \nThis report takes you through the seven essential steps you need to take to become a stock market millionaire. \nWhat's more, the report from explains how spending just 20 minutes a month could help you create a portfolio that could bring you closer to financial freedom for life. \nClick here to check out the report -- it's completely free and comes with no further obligation. \nRupert Hargreaves has no position in any shares mentioned. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-08-27T12:43:00.000+03:00", "crawled": "2015-08-27T13:14:29.117+03:00", "highlightTitle": ""}