{"organizations": [], "uuid": "aa83cb6f8c5624f0665f1fdc3cfa7d7717e6cb3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://images.smh.com.au/2014/02/12/5155383/FAIRFAX-logo.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/brand/rear-window/ray-hadley-calls-it-straight-on-news-corps-nrl-threat-20150819-gj2sax", "country": "AU", "title": "Ray Hadley calls it straight on News Corp's NRL threat", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Ray Hadley calls it straight on News Corp's NRL threat | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T21:00:00.000+03:00", "replies_count": 0, "uuid": "aa83cb6f8c5624f0665f1fdc3cfa7d7717e6cb3a"}, "author": "Will Glasgow", "url": "http://www.afr.com/brand/rear-window/ray-hadley-calls-it-straight-on-news-corps-nrl-threat-20150819-gj2sax", "ord_in_thread": 0, "title": "Ray Hadley calls it straight on News Corp's NRL threat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cartoon: Rod Clement Share on twitter Share on Google Plus by Will Glasgow It has been far too long between Rear Window stints in Canberra. So we hopped on an early morning Murrays bus and made straight for Parliament House, Global HQ of \"good government\", Tony Abbott -style.\nAs best as we could make out on Wednesday, the home of federal politics is much the same as before. The Devonshire tea in the Queen's Terrace Café is still worse than ordinary, the ever present Sky News still gives us a headache and all the same lobbyists are loitering in the main coffee shop, Aussies – although, to be fair, some have changed jobs (well done to the PM's former spinner James Boyce , now at Medicines Australia).\nStill, it's always good to pop in and check the pulse of the place. To find out, for example, if everyone had got the Rupert Murdoch memo that Gill McLachlan 's AFL is now the national code after it's $2.5 billion deal .\nFrom our conversations with NSW members in both houses and all parties, not quite.\nYou will have read that Rupert on Tuesday claimed that, despite its epic battle to takeover rugby league in the 1990s, his company has \"always preferred Aussie rules\".\nNow that's probably smart business – after all, the media mogul is trying to strong-arm Dave Smith 's NRL in their ongoing pay-TV rights negotiations.\nBut whether or not News Corp prefers Aussie rules, badminton or synchronised swimming is a bit beside the point – or so said many rugby league loving politicians who represent rugby league loving electorates.\nThat's certainly the view of prominent media analyst (and league commentator) Ray Hadley , as we discovered during our morning trip on the Murrays bus.\n \"I think Mr Murdoch is simply tormenting the NRL,\" said Hadley on his 2GB morning radio show. \"At the end of the day, in my opinion, Fox needs the NRL much more than the NRL needs Fox.\"\nBy which he meant, if Newscorp's Foxtel wants to maintain – let alone grow – it's penetration rate, it will need more than those bits of the AFL it didn't get from Kerry Stokes 's Seven.\nBut what about News Corp's campaigning tabloids? Couldn't they re-write the nation's sporting tastes?\nWell it's not for charity, Hadley noted, that The Tele 's Paul \"Boris\" Whittaker and the Courier Mail 's Chris Dore fill their tabloids with coverage of rugby league. That's what their customers want to read about.\nWhich is straight talking, in our opinion. No wonder the \"Love Rub kid\" Scott Morrison is such a fan.", "external_links": ["https://plus.google.com/https://plus.google.com/u/1/113771037534783751083/posts", "https://twitter.com/http://twitter.com/wmdglasgow"], "published": "2015-08-19T21:00:00.000+03:00", "crawled": "2015-08-19T20:17:49.114+03:00", "highlightTitle": ""}