{"organizations": [], "uuid": "f56d4254d9bfb2d363ca5d5e80f3f24d2e942e41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.economist.com", "main_image": "http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150822_FNC952.png", "site_section": "http://www.economist.com/rss/finance_and_economics_rss.xml", "section_title": "The Economist: Finance and economics", "url": "http://www.economist.com/news/finance-and-economics/21661674-naming-and-shaming-tax-havens-fraught-folly-eu-hypocrites", "country": "US", "title": "EU hypocrites!", "performance_score": 0, "site": "economist.com", "participants_count": 3, "title_full": "EU hypocrites! | The Economist", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T03:00:00.000+03:00", "replies_count": 2, "uuid": "74c7efb7994268c14a4c36bd0dc849972fc70912"}, "author": "From the print edition", "url": "http://www.economist.com/news/finance-and-economics/21661674-naming-and-shaming-tax-havens-fraught-folly-eu-hypocrites#post-0", "ord_in_thread": 0, "title": "EU hypocrites!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BLACKLISTS have been a feature of tax diplomacy ever since an internationally co-ordinated assault on tax havens began in the late 1990s. One of the first lists, produced by a global anti-money-laundering body, included, among others, Panama. The Central American country rattled the only sabre it had—its canal—and was promptly taken off the list after some Western governments squealed that their companies might lose engineering contracts.\nPoliticised though blacklisting may be, it is no less popular today. Pressure to name and shame is high in a time of post-crisis austerity. The latest such list, published in June by the European Union (EU), points the finger at 30 countries it views as “non-co-operative” on tax.\nIn this section Goodbye to all that Nafta naphtha Forking hell EU hypocrites! Nice gig Graduate stock Reprints\nThe targets (see table) have cried foul. Far from being exhaustively researched, the list is an aggregation of national lists: it includes any country blacklisted by ten or more EU members. Not only does that strike many as arbitrary, but the criteria for inclusion differ from EU state to state: some consider a low tax rate alone sufficient grounds, others require secrecy and opacity too. The most avid blacklisters are financial minnows such as the Baltic states and Bulgaria; Germany and Britain are among those with no entries.\nWorse, mistakes appear to have been made in the totting-up—and left unrectified even when pointed out. Guernsey is on the list by virtue of being blacklisted by precisely ten EU countries—but one of those, Poland, has a beef not with Guernsey but nearby Sark. Guernsey’s government says that it made clear before the list was published that it has no legal authority for Sark in tax matters, but that this fell on deaf ears.\nThe list is at odds with reality in other ways, too. On it are Nauru and Niue, two Pacific microstates. Both have had problems with dodgy shell banks in the past, to be sure, but these were shut down a decade ago under international pressure. Today Nauru’s only formal financial institution, according to an anti-money-laundering group, is a branch of Western Union, a money transmitter, in a hardware store. Niue’s financial sector is by this measure at least twice as big—it boasts no fewer than two Western Union branches, plus a commercial bank. “It is hard to imagine complex tax-evasion schemes being run from such places,” says Jason Sharman, an expert in offshore finance at Griffith University in Australia.\nThough blacklists lack credibility among tax cognoscenti, they do matter. They affect public perceptions and give NGOs a rod with which to beat perceived offenders. Moreover, inclusion on a list damages more than just reputation. The information is fed into commercial risk software, making banks that use it less willing to deal with blacklisted countries. Few will want to open local outposts in places regularly denounced as financial rogues.\nA list compiled by one country or region is often used as an input for those of others, compounding the problem. That can overlook the progress made by some places to shed their pariah status by, for example, agreeing to exchange tax information systematically. The OECD, a rich-country club which oversees that process, has called the EU list “unfortunate”.\nThe more advanced jurisdictions on the list, such as Guernsey and Bermuda, are particularly annoyed. Though no angels, they have made progress and now meet more global tax and anti-money-laundering standards than many OECD countries do. Bermuda points out that at least 5 of its 11 EU blacklisters have themselves failed to meet international tax obligations. Indeed, if the EU had assessed its own members honestly, it is hard to imagine the Netherlands, Luxembourg and Ireland—home to particularly rococo tax schemes attractive to American tech groups—not being on it. Some might add Britain, too.\nThe European Commission has responded to the criticism by arguing that the list should not be viewed as a central blacklist, since the batching of the 30 names is merely a “consolidation” of national lists. That is disingenuous, given that officials themselves refer to it as “the pan-EU list”. They insist the removal or addition of countries is down to individual member states, not Eurocrats. One official says the list is already having a positive effect, by making offshore centres more willing to engage with small EU countries that have blacklisted them. After all, who knows where closer co-operation between Guernsey and Estonia could lead?\nAs pressure has mounted, however, Brussels has backtracked. At a meeting with the 30 ostracised states last month, it agreed to make clearer reference to efforts that some of them have made to adhere to new tax-transparency standards—though it is not clear if it will ditch the “non-co-operative” label. Officials have assured Guernsey that it is not considered a tax reprobate, but the island remains on the list—at least until it is formally updated later this year. “This sort of thing can make you feel like your efforts are never rewarded,” sighs Steve Wakelin, who handles Guernsey’s international relations.\n ", "external_links": ["http://cdn.static-economist.com/sites/default/files/imagecache/original-size/images/print-edition/20150822_FNC952.png"], "published": "2015-08-22T03:00:00.000+03:00", "crawled": "2015-08-21T00:45:29.669+03:00", "highlightTitle": ""}