{"organizations": [], "uuid": "d92e1384bc8adf0f6638e92c064533f6b60a8dba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/04/eurozone-greece-stockmarket-idUSL5N10F1B320150804", "country": "US", "title": "UPDATE 1-Greek banking stock plunge again as debt crisis dominates", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Greek banking stock plunge again as debt crisis dominates | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T12:24:00.000+03:00", "replies_count": 0, "uuid": "d92e1384bc8adf0f6638e92c064533f6b60a8dba"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/04/eurozone-greece-stockmarket-idUSL5N10F1B320150804", "ord_in_thread": 0, "title": "UPDATE 1-Greek banking stock plunge again as debt crisis dominates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds details)\nBy George Georgiopoulos\nATHENS Aug 4 (Reuters) - Greece's banking stocks plunged for the second day in a row on Tuesday, dragging the main Athens index down and reflecting the country's continuing financial and economic woes.\nThe banking index, comprising the four major lenders, was down 29.2 percent, virtually at its 30 percent daily limit for losses. It hit the limit on Monday.\nThe overall Athens General Index was down around 4 percent after opening higher. Some non-financial stocks gained. Gaming group OPAP was up 3.5 percent and Aegean Airlines (AGNr.AT> gained 2.7 percent.\nNo spillover was evident to other European markets. Many investors have cut their exposure to Greece and are focusing more on the state of core markets such as Germany and France.\nThe Athens index lost 16.2 percent on Monday, the worst fall on record, wiping out nearly 8 billion euros of market value as investors worried about a new bailout from the European Union and reacted to Greece's worsening economy.\nSome believe the rout will soon end.\n\"The nearly 30 percent drop in early (banking) trades should attract buyers later in the session, helping the banking index balance out at higher levels than this,\" said Takis Zamanis, chief trader at Beta Securities.\nTrading in Athens resumed on Monday after being suspended for five weeks as part of capital controls imposed to stem a debilitating outflow of euros that threatened to cause a banking collapse and force the indebted country out of the euro zone.\nAlthough Athens is in new bailout talks with its European Union partners the threat of political and economic instability remains.\nThe economy, meanwhile, has reversed course and is heading into recession again.\nOn Monday, a survey showed Greek manufacturing activity plunged to a record low as new orders plummeted and the three-week bank shutdown caused serious supply problems.\nGreece's economic sentiment also hit its lowest level in almost three years in July, a monthly report by the IOBE think tank showed. (Reporting by George Georgiopoulos, Editing by Jeremy Gaunt and John Stonestreet)", "external_links": [], "published": "2015-08-04T12:24:00.000+03:00", "crawled": "2015-08-04T11:27:32.765+03:00", "highlightTitle": ""}