{"organizations": [], "uuid": "34b798178411a903ce3f74652d41bf1f00c119fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.smh.com.au", "main_image": "http://www.smh.com.au/content/dam/images/g/i/o/z/b/4/image.related.socialLead.620x349.gioil7.png/1438328739905.png", "site_section": "http://www.smh.com.au/business/markets/sectors/share-listing/2550/consumer-discretionary/retailing", "section_title": "Business News, Economy, Finance &amp; ASX Market News", "url": "http://www.smh.com.au/business/mining-and-resources/with-coal-going-begging-its-time-to-stop-digging-20150731-gioil7.html", "country": "AU", "title": "With coal going begging, it's time to stop digging", "performance_score": 2, "site": "smh.com.au", "participants_count": 1, "title_full": "With coal going begging, it's time to stop digging", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "34b798178411a903ce3f74652d41bf1f00c119fa"}, "author": "", "url": "http://www.smh.com.au/business/mining-and-resources/with-coal-going-begging-its-time-to-stop-digging-20150731-gioil7.html", "ord_in_thread": 0, "title": "With coal going begging, it's time to stop digging", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's not like there's a shortage of cheap coal around the world at the moment.\nInstead of splashing billions of dollars building their coal mines from scratch, instead of enticing governments with fees and the illusion of jobs, instead of battling bitter local communities and tearing up farmland, you have to wonder whether Shenhua and Adani have thought of simply buying one on the cheap – a coal mine that is.\nThe notion must have dawned on them. It's not exactly a sellers' market. Vale, Anglo, Rio, BHP, Glencore, the Japanese – take your pick. All are sellers at a price, particularly Peabody, which reported this week a $US1 billion ($1.37 billion) loss for the June quarter. At $US5.8 billion, its debts tower over its sharemarket value of just $US350 million, and it has mostly unfunded mine rehabilitation liabilities of $US2.5 billion.\nAlas Adani and Shenhua are determined to do things the hard way.\nAs it staves off oblivion, Peabody would surely countenance an offer by Shenhua for one of its Hunter Valley assets, replete with existing port and rail infrastructure, all requisite approvals and an established workforce.\nYou can bet Ivan Glasenberg at Glencore, having mopped up Xstrata at the peak of the market, wouldn't mind lightening his coal portfolio either.\nAdvertisement Alas Adani and Shenhua are determined to do things the hard way. The Indians have sunk $1.3 billion into their Galilee Basin project and the Chinese have outlaid roughly $650 million on Watermark so far. The price of export coal however is in structural decline and it is the humble opinion of this observer that neither project is likely to succeed.\nAccounts fail scrutiny Getting down to the nitty-gritty, we had a good look at the financial statements of Shenhua Australia Holdings this week. Not to put too fine a point on it, it's a bit of a dog's breakfast.\nAccounting academic Jeff Knapp managed to unearth a litany of errors, so many in fact that Shenhua's statutory disclosures beg the question of whether it is a fit and proper entity to be running a project that risks contaminating the rich farmland of the Liverpool Plains.\nFor a start, and in contravention of the Corporations Act, Shenhua managed to file its accounts late in 2014, 2013, 2012 and 2011. According to the company, its auditors from KPMG resigned on August 14, 2014. But this must be a false declaration as four months earlier the financial report was signed by KPMG's successors from Deloitte.\n\"Does this demonstrate a propensity by the company to provide false information to a regulator?\" Knapp asks.\nBear in mind these were signed off by KPMG, which is well remunerated for its supposed role as auditor and guardian of the books. Also bear in mind that KPMG and its Big Four audit firm brethren advise government on tax policy – such as advocating a thumping increase in the GST – when they can't get their accounts right.\nAs Knapp puts it: \"The guardians are asleep at the wheel … again.\"\nIn Shenhua's 2012 financial report they have included interest paid as cash paid to suppliers and employees. \"Interest paid is not cash paid to suppliers and employees,\" Knapp says. \"That's a pretty basic mistake\".\nThe interest appears to be paid to Chinese banks and, if so, it should have attracted withholding tax. Was withholding tax paid? Detailed questions were put to Shenhua on Thursday but the company was unable to respond by deadline on Friday.\n\"The government is putting its public assets in the hands of people who appear to be slap-happy with the rules,\" Knapp says. \"What happens when they find an error in the mining space? Do they cover it up?\"\nThen there is the anomaly of $27.8 million in revenues recorded in the 2012 accounts even though there is no statement of material change to state of affairs in the directors' report.\nFurther, there is the broader question of whether Shenhua is masquerading as a \"small company\" for reporting purposes when it really should be disclosing as a large company.\nIn 2012, it had revenues of $27.8 million and assets of $680 million, both measures which exceed the threshold for being a small company. As for the third measure, 50 employees or fewer, it would appear to exceed that too.\nIn better shape In fairness to Shenhua it should be said that its financial position is clearly superior to that of Adani .\nIts parent is effectively the Chinese government for a start and it does boast a track record in coal mining.\nAs for the purported benefits to the national interest from the Watermark project, Shenhua's royalty estimates are overcooked and it is unlikely the group would pay much if any income tax.\nThanks to inter-company loans – a 100 per cent tax deductible debt built up over eight years – Shenhua's capital structure is stretched. Any profits, and those would occur only if the price of coal were to radically rebound, would be soaked up in interest payments to the Chinese parent.\n﻿ Hidden assumptions Shenhua has told the NSW Department of Planning – nicknamed the Department of Approvals – that $1.5 billion in royalties will be generated over the life of the project. They have not disclosed their coal price assumptions.\nIn its report of November last year, the department assumes $1.5 billion of royalties will be received over the 30-year life of the project. This equates to royalties of $9.43 a tonne assuming the 159M/t of coal produced.\nHowever, taking the current Australian dollar exchange rate of US72¢ and the current price of semi-soft coking coal and thermal coal at the current spot rate of $US60/t, this would give royalties of $6/t, that is, 36 per cent below the figure deployed by the Planning Department only eight months ago.\nPut in annual terms, the department approved the mine on the basis of $50 million per year royalties, when they will only get $32 million a year on current currency and coal price figures.\nAlso this week, Shenhua's parent, China Shenhua Energy, reported its six months to June 2015 preliminary numbers. They weren't as ugly as Peabody, but were telling nevertheless. Net profit was down 43 per cent to $US2.2 billion on a 32 per cent fall in revenues. From what used to be the largest coal producer in the world, since overtaken by Coal India, it reflects the troubled status of the coal market.\nInternal coal production was down 10 per cent to 139 million tonnes, while total coal sales were down 24 per cent year on year to 178Mt as Shenhua cut external coal suppliers and traded volumes in reflection of reduced demand.\nShenhua is also a vertically integrated coal-fired power generator, and consistent with the national figures for China, coal-fired electricity volumes were down almost 6 per cent in the first six months of 2015.\nIn its results disclosure, Shenhua said the decline in coal related to \"certain factors such as the demand from downstream sectors, climate and heightened pressure for environmental protection\".\n\"Total power output dispatch decreased by 5.8 per cent year on year, mainly due to the substantial increase in power generated by non-fossil energy such as hydro power, further taking up the market share of thermal power generation,\" it said.\nAgain, Shenhua's imports of coal have declined to zero in 2015, raising suspicions about the claim from Watermark's Australian management that Shenhua needs high-quality Australian coal for blending. They seem to be coping pretty well without it.\nAlso, Shenhua has started reporting export volumes from China. They are still tiny to date, and some observers believe they are trialling export shipments to Korea given excess coal volumes. All the rail and port infrastructure is largely wholly owned by Shenhua and is now stranded, and Korea is only two shipping days away from North China, rather than 15 days from Queensland, giving a freight advantage.\nOnce again, Shenhua has been curtailing capital expenditure and responding aggressively to these new developments by reducing production. As management see this trend accelerating rather than reversing (that is, it is structural rather than cyclical), they will have to re-evaluate the strategic merit of what is likely to be a loss-making Australian project at Watermark.\nWhy build more expensive foreign coal capacity when they are closing existing domestic Chinese mines, which they have already built, and they own all the supporting domestic infrastructure and are employing Chinese workers?\nWatermark, it would appear, remains a battle between saving face and protecting Shenhua's equity capital – that is politics versus finance.\nIn any event, the economic case for digging through the water table on the Liverpool Plains hardly stacks up. Shenhua forked out an astronomical $300 million to the NSW government to get its exploration licence, has spend another $213 million on land purchases and, with another $200 million due for a mining licence, reckons the project will owe it a cool $1 billion before it loads its first truck with coal.\nIn the light of falling demand for coal globally the NSW government could help Shenhua save face by declining a mining licence and handing back its $300 million and the potential for an adverse court case in the event that the Trans Pacific Partnership trade deal – with its mechanisms for companies to sue governments – is signed by the Australian government.", "external_links": ["http://images.theage.com.au/2015/07/31/6731134/mucci.jpg?rand=1438328259398"], "published": "2015-08-01T03:00:00.000+03:00", "crawled": "2015-08-01T09:16:03.403+03:00", "highlightTitle": ""}