{"organizations": [], "uuid": "9b6dd13a6a20ed8fb4fb3e33d8ac1545c6b314d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-reuters/?format=rss", "section_title": "Finance News | Reuters - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/ftse-hits-eight-month-low-085643891.html", "country": "GB", "title": "FTSE 100 set for worst weekly loss of 2015", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "FTSE 100 set for worst weekly loss of 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T17:41:00.000+03:00", "replies_count": 0, "uuid": "9b6dd13a6a20ed8fb4fb3e33d8ac1545c6b314d0"}, "author": "", "url": "https://uk.finance.yahoo.com/news/ftse-hits-eight-month-low-085643891.html", "ord_in_thread": 0, "title": "FTSE 100 set for worst weekly loss of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nFri, Aug 21, 2015, 15:58 BST - UK Markets close in 32 mins. FTSE 100 set for worst weekly loss of 2015 Reuters – 16 minutes ago \nA man walks past the London Stock Exchange in the City of London October 11, 2013. REUTERS/Stefan We … \nBy Alistair Smout \nLONDON (Reuters) - The FTSE 100 was headed for its worst weekly loss of the year after more weak data from China raised investors' concerns over weak global growth and possible deflation. \nNews that British public finances recorded their first July surplus in three years did little to stem the sell-off. \nThe FTSE 100 was down 1.5 percent at 6,270.54 points by 1410 GMT, a fall broadly in line with European blue-chip equities. The index is down more than 4 percent for the week, shaping up to be its worst weekly performance since December. \nThe index is down for nine straight sessions, its longest losing streak since 2011. It is 12 percent below an all-time high hit in April. \nChina's factories shrank at their fastest rate in almost 6-1/2 years in August, a private survey showed, hammering global stocks and commodity prices. \n\"There are many, and legitimate, contributing factors to the global economic slowdown narrative. These include China-related issues, such as the recent devaluation of its currency, the stock market's boom and bust in recent months, and slower GDP growth,\" Nigel Green, CEO of deVere Group, said. \n\"I believe that this volatility is likely to remain with us, at least until the end of the year ... But for most long-term investors, fears of a near-term financial apocalypse are overdone.\" \nBucking the trend, precious metals miners rallied, buoyed as gold hit a six-week high as investors sought safe havens. \nFresnillo was up 0.2 percent while Randgold Resources outperformed with a 0.7 percent drop. \nThe broader FTSE 350 mining index languished near its lowest level since 2009, however. Miners are cutting back on capital spending to cope with the China-led hit to metals prices; Rio Tinto said it expected to ship more iron ore to China in 2015. \nShares of Tesco outperformed slightly but were down 1.3 percent after Reuters reported private-equity firms Affinity Equity Partners and KKR had teamed up to bid for the retailer's South Korean unit valued at about $6 billion. \nChip designer ARM was down 1.7 percent after a downgrade from Liberum, which highlighted a slowing demand picture for smartphones globally, including in China. \n\"Growth in the smartphone market has been the key driver of ARM's royalty revenue, in our view,\" analysts at Liberum wrote in a note, reducing forecast revenue for the next three years. \n\"The reduction is due to our view that the smartphone market is slowing.\" \n(Reporting by Alistair Smout; Editing by Alison Williams and David Evans)", "external_links": [], "published": "2015-08-21T17:41:00.000+03:00", "crawled": "2015-08-21T18:00:37.954+03:00", "highlightTitle": ""}