{"organizations": [], "uuid": "23e617635d3b85af22dc80f5f328e6225997f9e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "allafrica.com", "main_image": "http://allafrica.com/static/images/structure/aa-logo-rgba-no-text-128x128.png", "site_section": "http://allafrica.com/tools/headlines/rdf/business/headlines.rdf", "section_title": "AllAfrica News: Economy, Business and Finance", "url": "http://allafrica.com/stories/201508311242.html", "country": "US", "title": "South Sudan: Business Firms Cross Their Fingers the Latest South Sudan Peace Deal Will Hold", "performance_score": 0, "site": "allafrica.com", "participants_count": 0, "title_full": "South Sudan: Business Firms Cross Their Fingers the Latest South Sudan Peace Deal Will Hold", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T13:12:00.000+03:00", "replies_count": 0, "uuid": "23e617635d3b85af22dc80f5f328e6225997f9e2"}, "author": "", "url": "http://allafrica.com/stories/201508311242.html", "ord_in_thread": 0, "title": "South Sudan: Business Firms Cross Their Fingers the Latest South Sudan Peace Deal Will Hold", "locations": ["Uganda", "South Sudan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Uganda: A Fancy Way to Light the Sigiri \nPeace in South Sudan will reopen the doors for exports from Kenyan companies. \n\"The peace accord will now help Kenyan companies to restore their original business operations and others to open new markets,\" said Mr Paunrana, who is also the chief executive officer of Athi River Cement. \nUganda's economy has been one of the worst hit by the war, disrupting exports to one of its key international markets. Its exports have declined by 60 per cent since the war broke out. \nEarly this year, Dr Adam Mugume, executive director of research at Bank of Uganda, said that the peace agreement if signed would see an increase in the exportation of Ugandan food and construction materials to South Sudan. \n\"The conflict has reduced the dollar inflows into the country because of a dip in export and trading volumes. If the situation stabilises, we hope to see an increase in trading activity,\" said Dr Mugume. \nIn 2013, Uganda's exports to South Sudan were valued at $358 million. After the war broke out, this figure dropped to $278 million last year. \nPatrick Walusimbi, chairman of the Uganda Traders Association of South Sudan, said that the peace agreement will have a positive effect on trading as the confidence levels in the market will improve. \nUgandan traders doing business with South Sudan have also had to contend with foreign exchange losses. \nKenyan banks, including CfC Stanbic, KCB and Equity, have reported either losses or a drop in earnings from South Sudan subsidiaries in the past two years. KCB has had to close three of its 22 branches in the country. \nBut it has not been all gloom with Co-op Bank -- which is in a partnership with the Juba government -- reporting this month that it had increased its profit and broken even by the first half of this year. \nLast month, East Africa Breweries Ltd said that its South Sudan business is currently operating at two-thirds below capacity due to limited access to dollars, the predominant international trading currency. \n\"In the first half of the year, our South Sudan unit performed very well. But we are currently trading at below capacity due to the foreign currency crunch,\" said Charles Ireland, the firm's managing director. \nSABMiller also hinted at closing its $50 million South Sudan unit due to dollar shortages, after only six years of operation. \n\"If we don't get access to raw materials and the lack of hard currency continues, we may do so, but we are saying not now or in the near future,\" said George Nisbet, finance director at Southern Sudan Beverages Ltd, the local unit of SABMiller. \nDaniel Kuyoh, an analyst with Kingdom Securities, said that one of the key challenges of operating in South Sudan has been the difficulty of repatriating deposits. \n\"Most company's deposits are denominated in South Sudanese pounds. With the current challenge of this currency in the market, it has been difficult to move this to the main units in Kenya, leave alone access foreign currencies like the dollar,\" Mr Kuyoh said. \nThe distribution of hard currency in South Sudan is tightly controlled by the government and is limited to supporting the importation of food, medicine, fuel, and limited building materials. \nIn March, the central bank announced that the country's foreign-exchange reserves had run out following the drop in global oil prices and the civil war which has affected oil production. South Sudan \nChina on Thursday welcomed the signing of a peace deal aiming to end the conflict in South Sudan. see more » Copyright © 2015 The East African. All rights reserved. Distributed by AllAfrica Global Media ( allAfrica.com ). To contact the copyright holder directly for corrections — or for permission to republish or make other authorized use of this material, click here. AllAfrica publishes around 2,000 reports a day from more than 130 news organizations and over 200 other institutions and individuals , representing a diversity of positions on every topic. We publish news and views ranging from vigorous opponents of governments to government publications and spokespersons. Publishers named above each report are responsible for their own content, which AllAfrica does not have the legal right to edit or correct. Articles and commentaries that identify allAfrica.com as the publisher are produced or commissioned by AllAfrica . To address comments or complaints, please Contact us .", "external_links": [], "published": "2015-08-31T13:12:00.000+03:00", "crawled": "2015-08-31T13:45:25.822+03:00", "highlightTitle": ""}