{"organizations": [], "uuid": "d48390e133e3b3bf01f54464d15eeb60abe91988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://local.mercurynews.com/common/dfm/assets/logos/1200x627/mercurynews.png", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200772.xml", "section_title": "Personal Finance", "url": "http://www.mercurynews.com/business/ci_28644200/retirement-planner-lets-take-initiative-and-create-public?source=rss", "country": "IL", "title": "Retirement Planner: Let's take the initiative and create a public bank", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Retirement Planner: Let's take the initiative and create a public bank", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T04:50:00.000+03:00", "replies_count": 0, "uuid": "d48390e133e3b3bf01f54464d15eeb60abe91988"}, "author": "Stephen J. Butler\n\nsbutler@pensiondynamics.com", "url": "http://www.mercurynews.com/business/ci_28644200/retirement-planner-lets-take-initiative-and-create-public?source=rss", "ord_in_thread": 0, "title": "Retirement Planner: Let's take the initiative and create a public bank", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Retirement Planner: Let's take the initiative and create a public bank By Stephen J. Butler sbutler@pensiondynamics.com Posted: 08/16/2015 12:01:00 AM PDT I personally think the time has come to set wheels in motion to organize a state-owned bank here in California. North Dakota has operated its own bank since the early 1900s and it has made money for taxpayers while strengthening the state's own regional banks. The net effect has been to keep bank profits in North Dakota. The only losers have been the \"too-big-to-fail\" banks that would otherwise have enjoyed making the spread on money borrowed by, and throughout, the state. \nOf course, there is little political will to organize anything this effective in California because the banking lobby deploys too much money throughout the political process. However, our state's initiative process offers voters an option to do an end-run around elected officials. We could take a major step in offering an alternative to the predations of Wall Street's major banking institutions while generating a predictable source of revenue for the state. \nI floated the idea of a public bank in an earlier column, but what set me off this time was an email I received from a reader, age 73, who was faced with eviction after doing battle for six years with one of the major financial institutions -- the latter of which is only still in business today because of a taxpayers' bailout back in 2008. All these banks have lost sight of the fact that we have every right to treat them as a public utility. \nBut back to our embattled reader: After having added to the principal at a rate of $1,000 per month, which was illegal at the time, the bank has now renegotiated with loan payments of $2,000 per month that rise by $200 per month in 2016, $400 per month in 2017 and $500 per month in 2018. The lawyer working with this couple has described their predicament as \"the worst predatory loan he has ever seen.\" Advertisement \nI had thought that situations like this were behind us until earlier this month when the New York Times ran two articles on the extent to which banks were still beating up on their borrowers. One bank was found to have rejected 87 percent of requests for loan modifications while, at the same time, denials were highly profitable thanks to the continuation of loan servicing fees. \nThanks to organizations like the Public Banking Institute, there is a growing national movement to consider the adoption of public banks. It is prompted, in part, by the inability of elected officials to make much headway against the forces of lobbyists in Washington or at state levels. How else can you explain the fact that one major bank today is back to having over $35 trillion in derivatives? That means that we're all back to ensuring that institutions backing those bets are all good for the money. It's like \"Oofty Goofty\" always bouncing back up. \nThe only antidote is to establish a parallel banking system owned by citizens much like the Resolution Trust Corporation that the federal government operated during the Depression and World War II. When it finally closed its doors, under pressure from the banking industry, it had made over $600 million in profit for the United States -- and that was back when $600 million was a lot of money. \nMeanwhile, with North Dakota as an example, the most progress could probably be accomplished here in California where we have the advantage of the initiative process. If nothing else, it would be illustrative and entertaining to see who, exactly, would be falling all over themselves to fight the initiative -- and to see how much money they would spend in an attempt to quash a standard of comparison. Steve Butler can be reached at 925-956-0505, ext. 228, or sbutler@pensiondynamics.com .", "external_links": [], "published": "2015-08-15T04:50:00.000+03:00", "crawled": "2015-08-16T15:27:52.509+03:00", "highlightTitle": ""}