{"organizations": [], "uuid": "880f4b5bf5ada812cd235ebcedbb2cd4162e611c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/16/mali-violence-idUSL5N10R0F720150816", "country": "US", "title": "UPDATE 1-Mali separatists trade blame with pro-government militia over clash", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "UPDATE 1-Mali separatists trade blame with pro-government militia over clash | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T19:42:00.000+03:00", "replies_count": 0, "uuid": "880f4b5bf5ada812cd235ebcedbb2cd4162e611c"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/16/mali-violence-idUSL5N10R0F720150816", "ord_in_thread": 0, "title": "UPDATE 1-Mali separatists trade blame with pro-government militia over clash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Adds Quote: s, comment from Chamber of Mines)\nBAMAKO Aug 16 (Reuters) - Separatists in Mali accused a pro-government militia on Sunday of breaching a two-month-old ceasefire, leading to a fierce exchange of fire, but the militia said the separatists were the aggressors.\nThe two sides presented conflicting versions of Saturday's clash in northern Mali, a region where the government is trying to damp down separatist tensions while simultaneously fighting Islamist insurgents.\nThe incident took place south of Kidal, a stronghold of the separatist movement which is led by secular Tuareg rebels and known as the Coordination of Azawad Movements, or CMA.\nThe separatists said in a statement they had travelled to a rendezvous point to meet members of the Platform alliance of pro-government militias.\n\"While they were waiting at the agreed point our men were attacked by a column of Platform militia,\" they said.\n\"Their escort defended themselves and there was an intense exchange of fire that lasted until nightfall,\" they added, urging the United Nations Security Council to take note of the incident.\nFahad ag Almahamoud, secretary general of the main Platform militia, Gatia, said his group had no intention of crossing swords with the CMA.\n\"We reject any accusations of having violated the ceasefire and we commit ourselves to the peace deal,\" he told Reuters.\n\"Yesterday we were surprised by surveillance of our positions by Barkhane planes followed by an attack by the CMA 40 km (25 miles) inside our positions,\" he said, adding that his forces had suffered no casualties.\nBarkhane is a multinational operation led by France that aims to stamp out regional Islamist militants.\nThe government condemned the ceasefire violation, which it said endangered the peace deal, but did not ascribe blame.\nThe West African country is seeking to end successive Tuareg uprisings dating to independence from France in 1960. In 2012, Tuaregs allied with Islamist militants and seized the north until a French invasion scattered them a year later.\nDespite a U.N.-backed deal in June, the Malian army and thousands of peacekeepers are struggling to impose order amid deep inter-communal tensions and frequent attacks by jihadists.\nThere have also been attacks in the west and in the capital and the government has beefed up security at all 10 of the country's gold fields, said Abdoulaye Pona, president of the Chamber of Mines. Mali is Africa's third gold producer after South Africa and Ghana.\n\"No mine has been attacked but the recent terrorist attacks ... have put us on alert,\" he said. (Additional reporting by Adama Diarra; Writing by Matthew Mpoke Bigg; Editing by Mark Trevelyan )", "external_links": [], "published": "2015-08-16T19:42:00.000+03:00", "crawled": "2015-08-16T19:26:22.977+03:00", "highlightTitle": ""}