{"organizations": [], "uuid": "b6df1ab831ca002d320f2051117a9c5ac7360df5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.afr.com", "main_image": "http://www.afr.com/content/dam/images/1/2/j/m/4/d/image.related.afrArticleLead.620x365.giu6hn.png/1439347446590.jpg", "site_section": "http://www.afr.com/", "section_title": "Financial Review - Business, Finance and Investment News | afr.com", "url": "http://www.afr.com/business/chinese-companies-look-to-list-on-asx-20150807-giu6hn", "country": "AU", "title": "Why Chinese companies like citrus grower Dongfang plan to list on ASX", "performance_score": 0, "site": "afr.com", "participants_count": 1, "title_full": "Why Chinese companies like citrus grower Dongfang plan to list on ASX | afr.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T09:18:00.000+03:00", "replies_count": 0, "uuid": "b6df1ab831ca002d320f2051117a9c5ac7360df5"}, "author": "Jared Lynch", "url": "http://www.afr.com/business/chinese-companies-look-to-list-on-asx-20150807-giu6hn", "ord_in_thread": 0, "title": "Why Chinese companies like citrus grower Dongfang plan to list on ASX", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China's second-biggest citrus grower Dongfang is seeking to list on the ASX. Supplied by Jared Lynch Chinese tangerine and navel orange grower Dongfang is hoping to list on the Australian Stock Exchange – but it will not grow one citrus tree in Australia.\nThe company, which is seeking a $400 million listing , is firmly focused on boosting its market share in its home country, where it is considered a premium product.\nIts has already raised about $40 million, the minimum it needs for its float, and says it has more cash to come from Chinese investors.\nIndeed, it has received a lot of support from its home market, so why is it – as well as other Chinese companies – planning to list on the ASX?\nDongfang's Australian advisor, Barry Dawes of Paradigm Securities, says the company isn't dodging China's IPO ban, implemented in an effort to stabilise the country's volatile share market.\n\"To us, that's just a distraction. It doesn't change anything,\" Mr Dawes said. \"The decision [to list on the ASX] was made at the beginning of the year.\n\"The government in China is encouraging companies to list on other markets to assist with technology transfer.\n\"And very importantly, China recognises Australia as a supplier of high quality, healthy, safe, green products, and they would like to use that history background of Australia in their marketing in China.\"\n In December last year China's State Council urged companies to go global, saying \"the move will raise the international competitiveness of Chinese products, especially equipment products, boost structural upgrading of foreign trade and push manufacturing and financial sectors to a medium-high level.\"\nAs well as Dongfang, several other Chinese companies ranging from food to technology are planning to list on the ASX in coming months.\nChinese investors believe a stockmarket listings, particularly on OECD exchanges, are prestigious and will help fuel company growth strategies.\n\"Listing on the ASX is a much easier process,\" said Mr Dawes, adding it could take three to four years to list in Shanghai.\n\"You just have a prospectus. You go through the procedures and you can be listed [on the ASX] in four or five months. It's very rapid.\n\"I can tell you, with over 30 years' experience in the financial markets locally and overseas, that the ASX is one of the most transparent markets and has continuous disclosure, and will assist this company in its aim to become a global producer.\"\nHSBC chief economist Paul Bloxham expects more Chinese companies will start sounding out the Australian market, citing the Abbott government's freshly minted trade deal with China.\n\"We are going to see more of this. This is part of China's strategy – and the other thing about Australia is it's not that we are one of their key trading partners and supplier of key commodities,\" Mr Bloxham said.\n\"We have got a deep liquid financial market. We have a highly accessible economy, so it makes sense that Chinese companies would be interested in investing in Australia and gaining greater access to what we are able to provide.\"\nDongfang, which is China's second biggest citrus grower, has been touring Australian capital cities in efforts to raise between $40 million and $50 million, which it needs to list.\nThe company is confident they will be fully subscribed, despite local investor appetite for floats appearing to weaken, with several and high profile IPOs being abandoned in past months, or performing poorly on listing.\nRoger Montgomery, the chief investment officer at Montgomery Asset Management, is staying clear of the float, and it has nothing to do with Dongfang.\nChina's state secret laws have deterred audit firms from releasing documents to US regulators looking into the scandals, and sovereignty concerns hampered an agreement on audit inspections.\n\"There is a fundamental problem, which is something that we have highlighted to the investment community, and that is … when the companies are listed in Australia or the US if they are Chinese or ultimately owned by a Chinese company, auditors can't conduct proper due diligence on the accounts,\" Mr Montgomery said.\n\"They can't provide an unqualified opinion because the People's Republic of China deems the financial information of the ultimate owner of the company a state secret.\"\nBut Tim Harcourt, a former chief economist at Australia's international trade promotion agency Austrade, senses a change is coming from Chinese authorities.\n\"Ultimately they'll want to have more transparency because they won't be able to raise capital without getting their corporate governance house in order,\" he said.\nMr Dawes says Dongfang has complied with the ASX listing requirements and is hoping to hit the boards later this month.\nThe company has extended the closing date for the share offer to August 17. It is understood that a significant Chinese-based institutional investor has expressed interest in buying into the company.\nIt plans to use the capital raised to buy more citrus plantations to strengthen its position in a fragmented market, he said.\n\"The company would like to go from 1.1 per cent market share, by acquiring more plantations, to 4 or 5 per cent over the next several years. It's a very fragmented industry, very large market, [and Dongfang has] very efficient operations,\" Mr Dawes said.\nWith Reuters", "external_links": [], "published": "2015-08-12T09:18:00.000+03:00", "crawled": "2015-08-12T06:05:22.059+03:00", "highlightTitle": ""}