{"organizations": [], "uuid": "5c7478a70f2efa47e7bb072a2a6a50ae6148a64a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://media.marketwire.com/attachments/201407/262605_f8d9e5_e6f9bbb0a1ab422dbaadeb26d3155b78.jpg_srz_245_140_75_22_0.50_1.20_0.jpeg", "site_section": "http://www.marketwire.com/rss/mwFSPF.xml", "section_title": "Marketwired - Personal Finance", "url": "http://www.marketwired.com/press-release/smartmetric-developing-biometric-activated-security-code-display-fight-online-card-fraud-otcqb-smme-2046098.htm", "country": "CA", "title": "SmartMetric Developing Biometric Activated Security Code Display to Fight Online Card Fraud and Identity Theft", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "SmartMetric Developing Biometric Activated Security Code Display to Fight Online Card Fraud and Identity Theft", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T21:05:00.000+03:00", "replies_count": 0, "uuid": "5c7478a70f2efa47e7bb072a2a6a50ae6148a64a"}, "author": "", "url": "http://www.marketwired.com/press-release/smartmetric-developing-biometric-activated-security-code-display-fight-online-card-fraud-otcqb-smme-2046098.htm", "ord_in_thread": 0, "title": "SmartMetric Developing Biometric Activated Security Code Display to Fight Online Card Fraud and Identity Theft", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 07, 2015 14:05 ET SmartMetric Developing Biometric Activated Security Code Display to Fight Online Card Fraud and Identity Theft \nNEW YORK, NY--(Marketwired - Aug 7, 2015) - SmartMetric, Inc. ( OTCQB : SMME ), the creator of the fingerprint biometric protected credit and debit cards is developing a credit card that has the cards security code or why is called a CVV number activated following the cards users fingerprint match. \nThe SmartMetric biometric fingerprint authentication system works with EMV chip cards with the EMV chip turned on only after a successful fingerprint scan and match with the card user. SmartMetric has created a miniature fingerprint reader that sits inside the credit and debit card so no other scanning device outside of the card is needed in order to perform a biometric scan. In order to protect the card users biometric data no fingerprint information leaves the card with all matching and authentication done within the SmartMetric electronics embedded inside the card. \nSmartMetric is now developing a biometric activated security code that is displayed on the card in order to add biometric safeguards that will add to a more secure online purchasing experience. No longer will everybody handling your card have access to this important security code that is used by consumers for online and over the phone purchases. \nSmartMetric is the developer of fingerprint authenticated and activated payments cards for use by credit and debit card issuers globally. \nTo view a video of the SmartMetric biometric chip card follow this link: \nSmartMetric Biometric Payments Card https://youtu.be/zSX59uHoHqU \nTo view the company website: www.smartmetric.com \nSafe Harbor Statement Certain of the above statements contained in this press release are forward-looking statements that involve a number of risks and uncertainties. Such forward-looking statements are within the meaning of that term in Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Readers are cautioned that any such forward-looking statements are not guarantees of future performance and involve risks and uncertainties, and that actual results may differ materially from those indicated in the forward-looking statements as a result of various factors. Contact Information", "external_links": [], "published": "2015-08-07T21:05:00.000+03:00", "crawled": "2015-08-07T21:15:50.559+03:00", "highlightTitle": ""}