{"organizations": ["Westfield"], "uuid": "883da15a2a1ed2ee901316a99a92ce197c3d8c64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/JqwPD7fmQnbcBXJIZCKuBg--/YXBwaWQ9eW5ld3M7aWw9cGxhbmU7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/images/FIN_ANZ_AAP_ART_FTP_LIVE_1/3014618_28Aug_Westfield_1280x720_original.jpg", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/westfield-track-despite-ny-delay-034711959.html", "country": "GB", "title": "Westfield on track despite NY delay", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Westfield on track despite NY delay", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T06:47:00.000+03:00", "replies_count": 0, "uuid": "883da15a2a1ed2ee901316a99a92ce197c3d8c64"}, "author": "", "url": "https://au.finance.yahoo.com/news/westfield-track-despite-ny-delay-034711959.html", "ord_in_thread": 0, "title": "Westfield on track despite NY delay", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wed, Aug 26, 2015, 2:14 PM AEST - Australia Markets close in 1 hr 46 mins Westfield on track despite NY delay AAP – 27 minutes ago View Photo \n\nShopping centre operator Westfield will meet its full year guidance despite a delay in opening its World Trade Center flagship. \nWestfield Corporation, which spun off the now separately listed Scentre group in 2014, reported net profit for the six months to June 30 of $US466 million on revenue of $US531.5 million. \nFunds from operations (FFO) were $US380.3 million, in line with its forecast, with FFO per security at 18.3 US cents. \nThe company, which is focused on shopping malls in the United States, UK and Europe, reconfirmed its full year distribution guidance of 25.1 cents per security. \nThe opening of the $US1.4 billion Westfield World Trade Center, which is being constructed by the New York Port Authority and then leased by Westfield, has been pushed back to the first half of the next financial year. \n\"We see the impact as immaterial,\" co-chief executive Steven Lowy said, adding that the shopping centre had been fully leased. \n\"I wouldn't factor any earnings impact into it.\" \nWestfield has started $US1.6 billion of the $US2.5 billion of development projects it has planned for 2015, including expansion or redevelopment of centres in Silicon Valley, Los Angeles and San Diego. \n\"The performance of WFD's (Westfields's) pre-eminent portfolio remains strong,\" Steven Lowy and fellow co-chief executive Peter Lowy said. \n\"The benefits of our restructure last year can be seen in the significant progress being made on our $11.4 billion development program.\" \nWestfield expects to start extending Westfield London in the second half of 2015, making it the largest shopping centre in Europe, and is continuing pre-development activity on the construction of 2,500 apartments at its two sites in the city. \n\"We're working in a very solid market. There's a serious undersupply of apartments in London,\" Steven Lowy said. \n\"The wind is behind our sales but, as it is a new business for us, we are working on how best to extract value in the long term.\" \nWestfield said the loss of $US797.3 million for the prior corresponding period is not comparable because it used only the earnings from Westfield America Trust. \nAt 1315 AEST, Westfield shares were down six cents, or 0.63 per cent, at $9.46. \nWESTFIELD WORKING WELL", "external_links": [], "published": "2015-08-26T06:47:00.000+03:00", "crawled": "2015-08-26T07:16:24.474+03:00", "highlightTitle": ""}