{"organizations": ["Ferrari IPO"], "uuid": "8834b3597c9c85457a08141f02f0287723451e9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "business-news.thestreet.com", "main_image": "", "site_section": "http://business-news.thestreet.com/south-jersey-local-news/rss/627", "section_title": "South Jersey Local News : Personal Finance", "url": "http://business-news.thestreet.com/south-jersey-local-news/story/3-things-you-need-to-know-about-the-ferrari-ipo/13236615", "country": "US", "title": "3 Things You Need to Know About the Ferrari IPO", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "3 Things You Need to Know About the Ferrari IPO", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T17:38:00.000+03:00", "replies_count": 0, "uuid": "8834b3597c9c85457a08141f02f0287723451e9d"}, "author": "", "url": "http://business-news.thestreet.com/south-jersey-local-news/story/3-things-you-need-to-know-about-the-ferrari-ipo/13236615", "ord_in_thread": 0, "title": "3 Things You Need to Know About the Ferrari IPO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ari Zoldan"], "text": "3 Things You Need to Know About the Ferrari IPO Written by: Ari Zoldan 08/05/15 - 10:38 AM EDT Tickers in this article: FCAU GM T \nNEW YORK (TheStreet) -- Ferrari, one of the world's most famous car brands, filed plans in July to go public. Fiat Chrysler Automobiles , which owns 90% of Ferrari, has announced an IPO that will spin off Ferrari into a separate, stock-listed company. Similar to Fiat Chrysler, it will be listed in the U.S. and on a European stock exchange. However, individual investors will have difficulty buying Ferrari shares due to limited supply and intense demand . \nHere are three things you need to know before jumping into the fray. \n1. A successful IPO could pave the way to Fiat Chrysler's next mega-merger More Headlines 4 Pharmaceutical Stocks to Buy in Wake of Shire-Baxalta Bid \nAccording to analysts, Ferrari will be valued at between $6 billion and $11 billion. The IPO is expected to take place early next year and could be very beneficial for Fiat Chrysler. After the merger of Fiat and Chrysler in 2014, the company needs cash in order to reduce its high debt level and fund new investments and research and development expenses. \nAdding even more to its cash needs is Fiat Chrysler's desire to expand in order to catch up with Toyota and Volkswagen . CEO Sergio Marchionne expects the IPO to raise between $400 million and $600 million for the company. \nA successful IPO could also spark another Fiat Chrysler mega-merger. Marchionne has already announced his interest in partnering with other automobile manufacturers to produce eco-friendly cars . In March, he suggested a merger to General Motors CEO Mary Barra, but his offer was rejected. A successful Ferrari IPO will increase Marchionne's chances at future offers.", "external_links": [], "published": "2015-08-05T17:38:00.000+03:00", "crawled": "2015-08-05T18:05:42.362+03:00", "highlightTitle": ""}