{"organizations": [], "uuid": "2c8e83d9c0b61dff556e099644a238028fd9a17b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l2.yimg.com/bt/api/res/1.2/xCc6YRgMPqPJ1L4q1qcqdQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/en_us/Finance/BUSINESSWIRE/de3268accc1940c8af4d6130a25adb2d.cf.png", "site_section": "http://finance.yahoo.com/rss/EducationTrainingServices", "section_title": "Yahoo! Finance: Education & Training Services Industry News", "url": "http://finance.yahoo.com/news/devry-ed-tech-incubator-welcomes-130000586.html", "country": "GB", "title": "DeVry Ed Tech Incubator Welcomes New Cohort to Chicago’s 1871", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "DeVry Ed Tech Incubator Welcomes New Cohort to Chicago’s 1871", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T16:00:00.000+03:00", "replies_count": 0, "uuid": "2c8e83d9c0b61dff556e099644a238028fd9a17b"}, "author": "", "url": "http://finance.yahoo.com/news/devry-ed-tech-incubator-welcomes-130000586.html", "ord_in_thread": 0, "title": "DeVry Ed Tech Incubator Welcomes New Cohort to Chicago’s 1871", "locations": ["Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DeVry Ed Tech Incubator Welcomes New Cohort to Chicago’s 1871 \nDOWNERS GROVE, Ill.--(BUSINESS WIRE)-- \nDeVry Education Group ( DV ), a global provider of educational services, today announced the second cohort of education technology startups to participate in its collaborative DV X Labs ed tech incubator located at 1871, Chicago’s entrepreneurial hub for technology startups. This Smart News Release features multimedia. View the full release here: http://www.businesswire.com/news/home/20150813005107/en/ \nEach company’s team will spend time at 1871 connecting with the business community and refining their technological offerings. The new cohort includes: Chicago-based StudyCloud , an online engagement hub where students can interact with their professors and one another through discussion groups, chat, automatic alerts, assignment submission and grading. NoteBowl , a social learning platform that organizes content from courses and the campus community into one place. From broadcasting lectures to saving students’ questions from that day’s class, NoteBowl gives students, professors and administrators one place to access information, communicate with each other and engage with their university. NoteBowl is based in Tucson, Arizona. Better Weekdays , a cloud-based career-management software platform company currently operating in St. Louis, Missouri, which helps universities improve job-placement outcomes for their graduates. Better Weekdays’ software uses career assessment and personalized job-matching tools to help companies target job seekers, increasing the efficiency of communications between students and employers. Better Weekdays is an alumni company of 1871. \n“DV X Labs and DeVry Education Group are thrilled to welcome our second cohort of ed tech startups,” said Jeff Dunn, senior director of DV X, DeVry Group’s research and development team. “The world of educational technology is evolving rapidly, and each company in this new cohort shows incredible promise in helping us deliver an engaging learning experience that improves student outcomes across all of our programs.” \nAs the new companies enter DV X Labs, the incubator’s inaugural cohort is now moving into the next phase of development and beta testing. Chicago-based Youtopia — a learning platform focused on improving student engagement and motivation by making education an immersive and fun activity — is working with faculty at the Chamberlain College of Nursing campus in Phoenix, Arizona, to integrate gaming into the weekly quizzes of a pediatrics course. More than 30 students will be included in the beta test of Youtopia’s gaming tools, with impact and outcomes being tracked over the course of two eight-week sessions. \n“Startups at 1871 are using technology to transform the ways students learn as distinguished from how they are taught,\" said 1871 CEO Howard A. Tullman. “These businesses are lowering the cost and improving the quality of education through new tools that measure progress and create individualized content that is more engaging and relevant. We are thrilled to join DeVry Group in welcoming the next cohort of startups to DV X Labs.” \nThe other first-cohort companies moving into the next phase include YuJa , CENTURY-Tech and Fletch (formerly The SmartyPants App). \n“Whether providing technical education expertise or teaching us about navigating the intricacies of large universities, DV X’s ed tech incubator provided Fletch with the tools to be a leader in student-centered higher education technology,” said Marquett Davon Burton, founder of Fletch. “DV X was critical in teaching us about how we could create a product that made sense to college administrators while also being something that truly serves students.” \nMore information about DV X Labs, visit: http://www.1871.com/devry-edtech-incubator/ \nAbout DeVry Education Group \nThe purpose of DeVry Education Group is to empower its students to achieve their educational and career goals. DeVry Education Group Inc. (NYSE: DV; member S&P MidCap 400 Index) is a global provider of educational services and the parent organization of American University of the Caribbean School of Medicine, Becker Professional Education, Carrington College, Chamberlain College of Nursing, DeVry Brasil, DeVry University and its Keller Graduate School of Management, Ross University School of Medicine and Ross University School of Veterinary Medicine. These institutions offer a wide array of programs in healthcare, business, technology, accounting, finance and law. For more information, please visit www.devryeducationgroup.com . \nAbout 1871 \n1871 is the home of more than 325 early-stage, high-growth digital startups. Located in The Merchandise Mart, this 75,000 square foot facility is also the headquarters of nationally recognized accelerators, Techstars Chicago and Impact Engine; half a dozen industry-specific incubators in key areas such as real estate, education technology, food and financial technology; several emerging tech talent schools (Flatiron, The Fullbridge Program, Designation and the Startup Institute), and the state's leading technology advocate, the Illinois Science and Technology Coalition. It is the second home to Chicago-based VCs, Pritzker Group Venture Capital, MATH Venture Partners, Hyde Park Angels, OCA Ventures, OurCrowd and Chicago Ventures, as well as satellite offices for Northwestern University, University of Illinois, University of Chicago, Loyola University Chicago, Illinois Institute of Technology, and DeVry. 1871 has fast become recognized as the hub for the city’s entrepreneurial/technology ecosystem and has been featured in TechCrunch, Wall Street Journal, New York Times, Chicago Tribune and Crain’s Chicago Business among other top media. 1871 is the flagship project of the Chicagoland Entrepreneurial Center. View source version on businesswire.com: http://www.businesswire.com/news/home/20150813005107/en/", "external_links": [], "published": "2015-08-13T16:00:00.000+03:00", "crawled": "2015-08-13T18:18:48.121+03:00", "highlightTitle": ""}