{"organizations": [], "uuid": "b7da62ef25f7a240cec3c9abe019cecbd0bb452c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/05/12889861/bptw_labj_2015_logo-624x701.jpg", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12889861.htm", "country": "US", "title": "TicketManager Named One of LA’s Best Places to Work", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "TicketManager Named One of LA’s Best Places to Work", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "b7da62ef25f7a240cec3c9abe019cecbd0bb452c"}, "author": "TicketManager PR Department", "url": "http://www.prweb.com/releases/2015/08/prweb12889861.htm", "ord_in_thread": 0, "title": "TicketManager Named One of LA’s Best Places to Work", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Be fast, be fun, embrace change, seek discomfort, always focus on the bottom-of the funnel, keep the team healthy, never be beholden to past revenues, encourage ambition, protect self-confidence, never fear turnover and always be relentlessly recruiting. These are the goals the founders had when they started TicketManager and they are paying off as employees have voted the firm to LA Business Journal’s Best Places to Work list for 2015. Each year, the Los Angeles Business Journal surveys thousands of employers and employees about their workplaces. The employer answers questions about company policies, benefits, and demographics. Employees respond to a separate survey that includes “Agree/Disagree” questions about their work environment, along with open-ended feedback questions. Companies that achieve the highest rankings in the county are listed on the annual Best Places to Work.\nAs a young, fast-growing startup, TicketManager is a relative newcomer to the list. They entered the corporate ticket management business in 2007, and have seen explosive growth since their first round of funding in 2010.\n“Our company and the success we’ve had is defined by the teammates we get to serve every day,” said CEO and Co-Founder Tony Knopp. “We believe in nurturing ambition and self-confidence, in constantly encouraging our team to grow by what we can provide and by covering the costs of any classes, books, seminars, or courses they can grow from.”\nUpon first glance, TicketManager appears to be a very relaxed environment. There’s no dress code, staffers roam the halls barefoot (including the CEO most days), a multitude of games to choose from (Ping Pong, a full golf simulator, bag toss, XBOX), a fully stocked bar and kitchen with healthy and not-so-healthy options and an active staff working. The amenities are strategic as the team works long hours together in a high-paced environment.\nThe close knit team works together both in the office and out joining together for monthly happy hours, mud runs, and volunteer outings such as building houses together at Habitat for Humanity.\nOf course, they also do what they do best– making use of prime sports event tickets for team-building. LeBron vs the Clippers? Dodgers in the playoffs? The team is encouraged to attend them all.\nOther reasons employees gave TicketManager high marks included the Pilates and gym memberships fully provided, the golf lessons, the fully-stocked breakfast and snack bar, and the catered breakfasts.\nCRO and Co-Found Joe Greiner said the work itself is dynamic and fun, “It’s always challenging. We’re passionate about keeping up great relationships with our customers, and that keeps us busy. And because the company is growing so fast, it’s changing all the time. It’s impossible to get bored.”\nSales and Marketing Director Paul Kim summed it up, “It’s simple: we work hard, and we play hard. It’s a good place to be.”\nAbout TicketManager\nTicketManager is where tickets mean business. TicketManager makes company tickets simple by enabling companies to measure the business impact of sports and entertainment assets while staying compliant.\nDescribed as “Necessary in Business” by CNBC, TicketManager offers a variety of web and mobile products to help companies of all sizes use the tickets they own, buy the tickets they need, and stay compliant with all federal, state, and local regulation without adding another layer of red-tape or confusing software.\nTicketManager makes tickets available where the business user lives, whether on their mobile device, in their CRM, or through their team and venue partners. TicketManager partners with over 60 professional sports teams and venues as well as industry leading partners, Salesforce.com and Concur, to offer integrated products alongside education. The company is based in Calabasas, CA.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly90aWNrZXRtYW5hZ2VyLmNvbS8="], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T16:29:17.259+03:00", "highlightTitle": ""}