{"organizations": [], "uuid": "7f386749297f9545422ebd044fc386fc278f7f2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "finance.yahoo.com", "main_image": "http://l3.yimg.com/bt/api/res/1.2/MoYa3EWWUzPLmzNtu97tzg--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_SILICONALLEY_H_LIVE/Saving_money_on_your_TV-f5c0fb7a66b845866f0e80b47dfe3b86.cf.png", "site_section": "http://finance.yahoo.com/rss/headline?s=FOXA", "section_title": "Yahoo! Finance: FOXA News", "url": "http://finance.yahoo.com/news/just-dumped-pay-tv-package-141949996.html", "country": "US", "title": "Saving money on your TV bill by cord-cutting is not nearly as easy as it sounds", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Saving money on your TV bill by cord-cutting is not nearly as easy as it sounds", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T05:25:00.000+03:00", "replies_count": 0, "uuid": "7f386749297f9545422ebd044fc386fc278f7f2b"}, "author": "", "url": "http://finance.yahoo.com/news/just-dumped-pay-tv-package-141949996.html", "ord_in_thread": 0, "title": "Saving money on your TV bill by cord-cutting is not nearly as easy as it sounds", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Somewhat suddenly, the world is realizing that the TV market as presently constructed may be in trouble . \nThe stocks of major media companies are getting hammered this year as investors discover that people are dumping cable subscriptions. View gallery . (Yahoo Finance) \nThe stocks really got wiped out in early August when Disney revealed during its earnings that ESPN subscriptions had fallen. ESPN contributes roughly half of Disney's operating income. It gets $6 per subscriber. If that revenue stream dries up, Disney is in trouble. View gallery . (Yahoo Finance) Right when all of this was happening, my two-year contract with Verizon FiOS was ending. I have a new baby, so I'm not watching much TV in my free time. I was paying $154 after taxes for TV and internet and wanted to cut back on my bill. (I had a top-of-the-line package — DVR, all the sports channels, HBO, etc.) \nFor the most part, when I do watch TV, it's Netflix, Amazon, HBO, or the odd sports event on ESPN or broadcast channels. View gallery (Gonzalo Fuentes/Reuters) Reed Hastings, founder and CEO of Netflix. Netflix costs $8 a month. Amazon is bundled in with Prime, but we use Prime for ordering stuff, so the TV is essentially free. I have a demo account for Sling TV, a service that streams live TV over the internet and gives me a \"skinny\" bundle of channels, including HBO. Sling without HBO is $20 per month. I also have an antenna from Mohu to grab local broadcast channels. (The antenna is a bit wonky, but I could get it to work well enough for my needs.) \nI figure that's more than enough TV for my needs. \nI looked at Verizon's FiOS site and saw that internet was available for $45 pretax. I figured that would be good enough for me. I could get my TV through the aforementioned channels. \nAnd so I was prepared to cut the cord. \nBut then, a twist. View gallery . When I tried to get the $45 internet package, Verizon told me I was ineligible because I was coming off a two-year deal for TV. The $45 price is available only for new customers. \nIf I wanted just internet, it was going to be $80 a month. \nIf I went with the $80 internet package, it would mean that I would be paying ~$110 for my TV needs. ($80 internet + $8 for Netflix + $20 for Sling.) \nWhile that's better than $154 (after taxes), it's not exactly a steal. \nPlus, Verizon offered me two \"channel packs\" for $10 a month, which would be a better deal than Sling. It would also be a better experience as a user. One of the biggest problems with cutting the cord is that you end up with a pile of disjointed apps and services that require you to hop around to find shows. Pay TV, for all its issues, is a pretty elegant solution compared with its internet-based competition. \nLuckily, I live in an area where I can get Comcast and FiOS. Comcast offers an internet package that includes local TV stations for $44 a month. Of course, there's a catch. (There's always a catch with these companies.) The first year is $44; the second year is $64. View gallery . (Pacific Crest) \nI used the Comcast deal as leverage to get Verizon to offer me internet plus local TV (thus negating the need for an antenna) on a month-to-month contract for $60 a month. It's not a better deal than Comcast, but the internet speed was twice as fast on Verizon as it was on Comcast. (50 megabits per second from FiOS versus 25 megabits per second.) And I didn't have to lock myself into a contract, which is nice. \nSo, what's the point of all of this? \nWell, this is a long way of saying that dumping pay TV is not as cost-effective or simple as one would hope. And, going \"over the top\" with internet-only services feels more like a political statement than anything else. It won't create a better experience. And the total cost of services such as Sling TV, HBO Now, and Netflix adds up to a cost comparable with that offered by traditional pay-TV companies. \nThat's not to say investors are wrong to be worried. New consumers will be more selective about what they subscribe to. And channels are getting carved up, allowing consumers to bail on channels they don't care about. And I did manage to cut my bill in half by dumping my premium FiOS plan for the most basic offering available. \nBut, we're still a long way from the TV industry getting totally creamed by the internet the way the newspaper and music industries have. \nIf you like watching TV, there's still nothing better than paying for traditional pay-TV services.", "external_links": [], "published": "2015-08-21T05:25:00.000+03:00", "crawled": "2015-08-21T06:28:59.051+03:00", "highlightTitle": ""}