{"organizations": [], "uuid": "345a7e3b448edb86e2c4c39f2a7bcf8a03d954f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/markets/commodities/onion-prices-fall-below-rs-50kg-at-lasalgaon/125654", "country": "IE", "title": "Onion prices fall below Rs 50/kg at Lasalgaon", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Onion prices fall below Rs 50/kg at Lasalgaon | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T08:07:00.000+03:00", "replies_count": 0, "uuid": "345a7e3b448edb86e2c4c39f2a7bcf8a03d954f1"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/commodities/onion-prices-fall-below-rs-50kg-at-lasalgaon/125654", "ord_in_thread": 0, "title": "Onion prices fall below Rs 50/kg at Lasalgaon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Centre’s directive to the Maharashtra government asking the latter to take strict action against onion hoarders has produced the desired effect. Onion arrivals at the Lasalgaon wholesale market in Nashik improved on Tuesday to 4,500 quintals and average prices dropped down by Rs 800 per quintal to Rs 4,850 per quintal.\nPrices had touched R5,700 per quintal on Saturday, the highest this season with barely 2,000 quintals of onion arrived in the market.\nWholesale markets in Nashik reopened on Tuesday after a token bandh was observed by traders to protest the Rajasthan High Court decision against ‘Santhara’.\nExperts were keenly waiting to see how the market would react on Tuesday. Ram Shinde, Maharashtra minister of state for agriculture, told FE that traders were creating an artificial shortage in the market by hoarding onions and the government had started taking strict action against them. More efforts will be made to improve onion supplies in the market, he said.\nConcerns were also being raised that farmers were holding onto their stocks and bringing less onion into the markets in hope of a better price in the future. Agriculture Produce Market Committee officials at Lasalgaon said that steps being taken by the state government against traders for stocking onions had a positive effect and they started bringing more onions into the market.\nWholesale rates at Lasalgaon had increased to around R60 per kg as against R15-16 per kg in the year- ago period, as per the official data. Lasalgaon, the Asia’s biggest wholesale market for onion, normally sets price trend for the rest of the country.\nMaharashtra, the leading onion growing state, contributes 30% to India’s total output. Onion production has reduced by nearly five lakh tonne this year causing shortage in supply. About 80,000 tonne of onions have been exported in the past 2-3 months.\nTo check rising prices, the Centre has asked MMTC to import onions and has also raised minimum export price of the commodity to $700 per tonne from $425 per tonne to restrict overseas sale.\n 26, 2015 12:07 am", "external_links": [], "published": "2015-08-26T08:07:00.000+03:00", "crawled": "2015-08-27T00:51:13.469+03:00", "highlightTitle": ""}