{"organizations": [], "uuid": "ccf5a484f59633053e5e7c876722088a87c19ddb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/eiy4cpo00v_5687809232311_5689791639231.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=46", "section_title": "Business & Finance", "url": "http://www.modernghana.com/news/636294/1/tigo-ghana-grows-subscriber-trend-with-yensor-nkoa.html", "country": "US", "title": "Tigo Ghana grows subscriber trend with 'Yensor Nkoaa' promo", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Tigo Ghana grows subscriber trend with 'Yensor Nkoaa' promo", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T23:36:00.000+03:00", "replies_count": 0, "uuid": "ccf5a484f59633053e5e7c876722088a87c19ddb"}, "author": "", "url": "http://www.modernghana.com/news/636294/1/tigo-ghana-grows-subscriber-trend-with-yensor-nkoa.html", "ord_in_thread": 0, "title": "Tigo Ghana grows subscriber trend with 'Yensor Nkoaa' promo", "locations": ["Ghana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kofi Adu Domfeh"], "text": "  13 August 2015 21:36 CET Tigo Ghana grows subscriber trend with 'Yensor Nkoaa' promo By Luv Fm | Kofi Adu Domfeh \nApostle Elijah Oluwafemi Zebulon migrated from Nigeria less than a year ago to start a church in Accra, Ghana. \nToday, he is excited to be the ultimate winner of a 30KVA power plant in the final draw of the Tigo Yensor Nkoaa promotions in Kumasi. \nIn addition, he receives Gh1,000 to fuel the generator, which he wants to use to power his church activities as it grows in congregation. \n“I am still gathering people and when the church becomes very big, I’ll use the power plant for my church,” he said “As an Apostle and Prophet of God, I’m going to pray for Tigo and the blessing of God will come upon them”. \nTelecom operator, Tigo, has in the past 90 days provided its customers with alternative sources of power in the heat of the country’s energy challenges. \nApostle Zebulon is among over 1,000 Ghanaians who have been rewarded in the promotions – prizes won include power inverters, rechargeable lamps, power banks and airtime. \nDirector of Marketing for Tigo Ghana, Jesse Agyepong, says the Yensor Nkoaa promo has brought relief to customers and the country as a whole. “Many of the customers had intimated that there were power issues and power problems and therefore we listened to them and we launched the ‘ Yenso Nkoaa Promo’ which set out to reward customers with power alleviating equipment and appliances over a 90 day period,” he said.\nMr. Agyepong says the bond between Tigo and its customers is more entrenched, because of a commitment based on an engagement to identify ideal promotions that impact on livelihoods. \nAccording to him, the investment in customers has made positive impact on Tigo’s subscriber trend and business growth. \n“Last year we suffered some very big declines but from January up until now, the businesses that we’ve done – from ‘ Drop That Yam ’ to ‘ Yensor Nkoaa ’– we’ve arrested the decline and Tigo has been on a consistent growth so far, both in terms of data and voice subscribers,” he stated. \nTigo has promised a bigger and more exciting promo in the future.", "external_links": [], "published": "2015-08-13T23:36:00.000+03:00", "crawled": "2015-08-14T06:28:50.336+03:00", "highlightTitle": ""}