{"organizations": [], "uuid": "b55a947232a965038481a233c04512766f7b7639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "http://assets.bwbx.io/images/iE12Z1120TOk/v2/-1x-1.jpg", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-06/boe-cancels-november-rate-fireworks-as-carney-inches-toward-hike", "country": "US", "title": "BOE Cancels November Rate Fireworks as Carney Inches Toward Hike", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "BOE Cancels November Rate Fireworks as Carney Inches Toward Hike - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T00:57:00.000+03:00", "replies_count": 0, "uuid": "b55a947232a965038481a233c04512766f7b7639"}, "author": "Jennifer Ryan", "url": "http://www.bloomberg.com/news/articles/2015-08-06/boe-cancels-november-rate-fireworks-as-carney-inches-toward-hike", "ord_in_thread": 0, "title": "BOE Cancels November Rate Fireworks as Carney Inches Toward Hike", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On Guy Fawkes Day, there will be no fireworks. At the Bank of England, that is.\nWith energy costs falling and the pound surging, Governor Mark Carney said inflation will stay “muted” and there may even be another period of price declines. The remarks, along with new forecasts, cut the chance of a rate increase this year. They also undermined any expectations for a move on Nov. 5, the date of the BOE’s next projections and the U.K. celebration that traditionally features bonfires and pyrotechnics.\nSterling’s advance is creating a drag on prices and staying the hand of officials as they consider when to move away from record-low borrowing costs. Just one of the BOE’s nine policy makers wanted to increase the key rate this month, indicating the Monetary Policy Committee is moving only very slowly toward tightening.\n“The communication confirmed that a later move was more likely,” said Nick Kounis, an economist at ABN Amro in Amsterdam, who changed his rate forecast to the first quarter of 2016. “We’d thought there would be a move in November, but the appreciation of sterling has taken some of the edge off the upward trajectory of inflation.”\nThe bank slashed its 2015 inflation forecast to 0.3 percent from 0.6 percent, which would be the lowest since the data series began in 1989. It’s been below the BOE’s 2 percent target since December 2013 and prices have barely budged this year.\nPersistent Pound The stronger pound has a “substantial” impact on forecasts and will push down on import prices “for some time to come,” Carney said. The currency has strengthened 3.5 percent since May and 20 percent since March 2013, according to the BOE. It’s risen more than 10 percent versus the euro this year.\nConcern about sterling’s advance was also captured in the minutes of the MPC’s meeting this month. In addition to noting the currency’s move in the past three months, most officials saw a risk that this could weigh on inflation for a “persistent period.”\nStill, the bank’s projections -- showing price growth inching above the target after two years -- point to higher borrowing costs being needed soon. Carney said the thinking about such a move, which will end more than six years of record-low rates, will come into “sharper relief” around the turn of the year.\nContinued economic growth -- the U.K. is already on a 10-quarter streak -- and a further tightening in the labor market could mean that happens in early 2016. MPC-dated Sonia forwards are pricing in the first full 25 basis-point increase for May.\n“The chances of a 2015 rate rise, which in our opinion were already low, have receded further,” said Andrew Goodwin, an economist at Oxford Economics in London. “One clear message from today’s events was that the more that sterling strengthens, the less likely a rate hike will becomes, as the appreciation would effectively do the MPC’s job of tightening monetary conditions for them.”", "external_links": [], "published": "2015-08-07T00:57:00.000+03:00", "crawled": "2015-08-06T20:15:43.363+03:00", "highlightTitle": ""}