{"organizations": [], "uuid": "ba903281f828984b3bfb9f6527f37c4e21041d91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/20/india-rates-idUSL3N10V1OK20150820", "country": "US", "title": "Indian government steps up rate cut pressure on RBI", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "Indian government steps up rate cut pressure on RBI | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T13:18:00.000+03:00", "replies_count": 0, "uuid": "ba903281f828984b3bfb9f6527f37c4e21041d91"}, "author": "Reuters", "url": "http://www.reuters.com/article/2015/08/20/india-rates-idUSL3N10V1OK20150820", "ord_in_thread": 0, "title": "Indian government steps up rate cut pressure on RBI", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "* Finmin officials encourage lobbying for more easing\n* RBI more cautious over impact of monsoon on prices\n* Government focused on growth, RBI on inflation\nBy Manoj Kumar and Suvashree Choudhury\nNEW DELHI/MUMBAI, Aug 20 (Reuters) - Indian Finance Minister Arun Jaitley is stepping up pressure on the central bank to cut rates as the economy struggles and price rises slow, with some bureaucrats working behind the scenes to argue for an immediate cut of as much as 50 basis points.\nAfter another weak quarter of corporate earnings and July inflation that undershot the central bank's medium-term target, Jaitley has made direct, public calls for faster easing, clashing with far more cautious comments from a conservative Reserve Bank of India governor, Raghuram Rajan.\nOfficials in Jaitley's ministry, meanwhile, are encouraging economists and newspapers to lobby directly for further easing, senior government officials said.\nThe public stand-off between the finance ministry and the RBI comes at a time when the two sides are already at odds over key changes to the way India takes monetary policy decisions and the government's say in such matters.\n\"Hopefully, the impact of inflation being under control is a factor which ... the central bank, with all its wisdom, will take note of,\" Jaitley told a gathering of bankers and executives in Mumbai earlier this week.\nWhile India's economic growth is outpacing China's on paper, the picture is different on the ground, where government spending has been sluggish, consumption is weak and corporate executives fret a recovery is unlikely before 2016-17.\nThe government is also emerging from a bruising monsoon session in parliament, which delayed tax and land reforms seen as critical to accelerating growth.\nIt now worries that growth could slip below its target of 8 to 8.5 percent for the year to March, and sees the RBI's caution as worsening the situation. Moody's earlier this week lowered its growth forecast to 7 percent, from 7.5 percent.\n\"Going by the (consumer price) inflation numbers, and the global economic environment, the RBI should have cut interest rates by 200 basis points (this year) by December,\" said one ministry official who works with Jaitley on this issue.\n\"It has done too little and too late.\"\nThe RBI has cut 75 basis points since January.\nAnother government official said the central bank was seen by the ministry to have scope to immediately cut at least 50 basis points off rates, now at 7.25 percent.\nMONSOON WORRIES\nThe RBI, however, has remained far more cautious, specifically on the outlook for the monsoon season, which has roughly another month to run and has a huge influence on food prices in the country.\nGovernment officials have been upbeat in their assessment of the monsoon, with the rain shortfall currently estimated at around 9 percent, but Rajan has been more circumspect.\nHis tight rein on inflation has benefited the government; rising prices are a major concern for Indian voters, and inflation was in double digits when the former International Monetary Fund chief economist took over in 2013.\nBut that is now irking a government whose officials complain they do not get sufficient insight into the dashboard of data that contribute to RBI decision-making.\nThough lauded by the government, July's inflation below 4 percent has yet to satisfy the bank, which, sources with knowledge of RBI policymaking say, frets that core inflation, which excludes food and fuel, remains too high.\nThe bank is even more nervous about food prices. Onions, the mainstay of many Indian dishes, have more than tripled in price since June 1 to almost two-year highs.\n\"It is to be seen if CPI persistently undershoots the RBI's projections,\" a source familiar with the RBI's thinking said.\nThe monsoon shortfall prediction, he said, made a rate cut before the next scheduled policy review on Sept. 29 \"very difficult\". (Reporting by Clara Ferreira Marques; Editing by Will Waterman)", "external_links": [], "published": "2015-08-20T13:18:00.000+03:00", "crawled": "2015-08-20T12:29:39.066+03:00", "highlightTitle": ""}