{"organizations": [], "uuid": "3f82188e036c05195ded57d1eaf24e948697712a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.moneylife.in", "main_image": "http://moneylife.in/site/userimage/image/thumbnail/Sunilsinghania0248.jpg", "site_section": "http://www.moneylife.in/site/rss.php", "section_title": "Moneylife Personal Finance Magazine", "url": "http://www.moneylife.in/article/global-factors-have-become-very-important-interview-with-sunil-singhania/43107.html", "country": "IN", "title": "‘Global Factors Have Become Very Important’: Interview with Sunil Singhania", "performance_score": 0, "site": "moneylife.in", "participants_count": 1, "title_full": "‘Global Factors Have Become Very Important’: Interview with Sunil Singhania", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T09:10:00.000+03:00", "replies_count": 0, "uuid": "3f82188e036c05195ded57d1eaf24e948697712a"}, "author": "Jason Monteiro", "url": "http://www.moneylife.in/article/global-factors-have-become-very-important-interview-with-sunil-singhania/43107.html", "ord_in_thread": 0, "title": "‘Global Factors Have Become Very Important’: Interview with Sunil Singhania", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Moneylife » ‘Global Factors Have Become Very Important’: Interview with Sunil Singhania 43107 ‘Global Factors Have Become Very Important’: Interview with Sunil Singhania 0 Comments, Be the first to comment Jason Monteiro | 17/08/2015 11:40 AM | Sunil Singhania is the chief investment officer for equity investments with Reliance Mutual Fund. With a total experience of 21 years, he is the first Indian to be elected director on the Global Board of Governors of CFA Institute, USA. Excerpts from an interview with Jason Monteiro of Moneylife Moneylife (ML): Reliance MF has about 15 equity diversified schemes (including close-ended schemes). What is the process that goes behind managing these schemes? Sunil Singhania (SS): We have schemes with different mandates—ranging from small-cap schemes to large-cap schemes. Some schemes are multi-cap and then there are the thematic schemes. So, every scheme will have its own philosophy and framework. Different sectors will have different parameters on the basis of which we pick stocks. Some, basically, will fall into deep value category; some would fall into the category of high growth and high return. So, there is a lot of science and art built-in rather than only numbers. Therefore, we have a lot of in-built processes. ML: Can you please describe the process? SS: We have a team of 30 members, including fund managers, fundamental analysts, quantitative analysts, economic analysts, etc. Our attempt is to passively follow any company which has a market-cap of Rs100 crore-Rs125 crore. So, we track almost 1,300 Indian companies, out of which we extensively track 450 companies in-house. In-house tracking is very necessary because, if you look at brokers, they normally track the top 60-70 companies. We get a lot of support from the large brokers for the mega-cap companies; but, when you go down the list, we need to do a lot of work ourselves. We also track 2,600 global companies on a passive basis across 20 markets. The idea is to know what is happening globally in terms of companies, in terms of sectors, and it also gives a lot of insights. The idea is to bet on companies that would sustain for the next 15-20 years. Then there is management quality, opportunity in the sector, the scale which the companies can achieve, the rate of growth, the efficient use of capital, etc. ML: What do you look at in companies? SS: We publish a set of reports every Monday. We have almost 700-800 companies with the latest valuation along with the earnings estimates, the latest earnings figure, the price-to-earning (PE) ratio, etc. We don’t go by a set formula. A company may look expensive because its growth rate may be high or the RoCE (return on capital employed) may be high. When you create a portfolio, you need to take into account several factors. You can’t have all companies with high RoE (return on equity); in which case, it will become a very high PE portfolio. We need to have diversification. For example, in one sector, if five companies are good, you can’t pick all the five. Therefore, picking stocks is based on the portfolio construction and the mandate of the scheme. ML: Is this weekly tracking a reason for high portfolio turnover in certain schemes? SS: In most of our portfolios, there is hardly any churn. But what happens is that you get opportunities in the larger companies. Stocks may move up and down irrationally; so you might use this opportunity to create trades. You have to take a call whether it is beneficial or detrimental. If I’m able to sell something at Rs600 today and buy it again 15 days later at a 10% lower price, I would do it, right? Being in the market every day, you tend to know what is causing the stocks to move up and down and whether a stock is fundamentally good or not. For example, if you look at the price volatility in the last week of May, it was all due to the MSCI Index re-balancing. You take that opportunity. There were so many companies which went up just because someone had to compulsorily buy and some went down because someone had to compulsorily sell. We will not miss such opportunities. ML: Do you have a different method of evaluating small- and mid-cap stocks? SS: When picking mid- and small-caps, obviously, the return expectations are higher. At the same time, the risks are also higher. We are very clear, we will not pick mid-caps, unless we meet the company’s management and we maintain a very detailed in-house database. So, if you input any company, you have everything available at the click of a button. All the research reports, all the annual reports, the interviews and interactions with the management are available to the fund managers. When we pick smaller companies, the understanding of the company needs to be much stronger. You have to put more effort, as these are not extensively researched by brokers. Therefore, our in-house research needs to be very strong. This is where due diligence and experience becomes very important. ML: When the analysts meet the management, what are the areas they probe? SS: It would be different for different companies. It’s all about the future potential. If you look at a capital goods company, you will have to figure out the estimated order book, going forward. Similarly, in some cement companies, the capacity utilisation is only 60%-65%. Now, growth is not picking up in cement. If you believe that India is growing faster, monsoon is good, Andhra is growing faster, there is a big thrust in railways, big thrust towards roads and other infrastructure projects, capacity utilisation in cement industry might go up, then these companies will do well. ML: Apart from analysis of stocks, do you, and your team, invest with a market-timing perspective like varying your cash levels, based on market valuation? SS: Over the past three-four years, we have not felt the need, or reason, to increase our cash levels. So, across our schemes, we have maintained an allocation of 95%-98% towards equity. At a fund house-level, we meet every day; there is a discussion. Whether to increase cash or not is a function of euphoria. So, for the 15-odd schemes—one-year forward—we do not see that the markets have any euphoria built-in. But there are stocks which have this euphoria built-in which we analyse, on a constant basis. There is a lot of data generated. This is why we have built up our in-house infrastructure to identify such stocks. ML: How do you handle stocks that have done really well and stocks that have failed to perform? SS: We have internal risk parameters. In large-cap companies, we go up to 8% as far as one single stock is concerned. In exceptional cases, we may have gone up to 9% but, generally, it is 7%-8%. In a mid-cap stock, we restrict the exposure to 5%-6%. So, the moment the stock does very well, we tend to cut it to these limits as a risk measurement tool. In other cases, when to sell is a reflection of a stock’s fundamentals. The buying price is not important. So, even if the stock has gone up over 150% since we purchased it, and if we feel that is still the best stock given its fundamentals, we will continue with it. If a stock-pick goes wrong, it is a much harder decision. But we will stick to the stock until we feel that the fundamentals may not justify holding on to the stock. So, even if the stock falls 10%-20% below the cost price, we will not be in a hurry to sell. We do make mistakes; everyone makes mistakes; but we try and ensure that the mistakes are not repeated. But some stocks also fall because of the overall market. You can’t do anything about that. ML: Are there any themes or sectors driving different schemes at the moment? SS: As a fund house, we are bullish on private banks and we continue to be quite optimistic about the pharma space. We like capital goods companies with good balance sheets, because we believe that when the country’s economy revives, these will be in a better position. We are avoiding stressed companies which include infrastructure companies. We are bullish on smaller companies in cement. We continue to be equal weight on IT stocks. At the same time, we are avoiding regulated sectors which include oil & gas and, to some extent, metal stocks because it is more of a global play. In India, the cost escalation due to the mines now being auctioned has created a lot of stress. We are underweight on consumer staples across the schemes. Then, again, based on the scheme’s objective, the fund manager will take a call. ML: How important is corporate governance in rating companies? SS: Corporate governance is very important. At the same time, we need to remember that there is no clear definition of what is good corporate governance. Companies go through periods of ups and downs when they might tend to do some things which we might disagree with. Therefore, at different points of time, you will always have a difference of opinion with the management. And our job is to do what we feel is right. There is no doubt that corporate governance is important. But, at the same time, there is no easy formula to judge corporate governance. ML: What, according to you, are the opportunities and threats to the Indian market? SS: The threat is two-fold; and I’m talking about major threats. A major threat would be if big financial catastrophe happens in the global market, like it happened in 2007-08. Some economists say that is a possibility. We do not see that. If it happens, India will definitely be affected because India depends on foreign flows. The second threat is if the government is not able to deliver on its promises—though this is the most promising government we have ever had. But, we are confident that they will deliver. On the opportunities, I’ll give you a big picture. There are 40 economies across the world which have crossed the trillion-dollar mark, in size. Of these, only 16 graduated to two trillion-dollar size, of which India is one. And, out of these 16 only three have been able to graduate to the four trillion-dollar size, namely, Japan, China and the United States. Our belief is that India can be the fourth or fifth country which will reach the four trillion-dollar size. An optimist, like me, will say that it will happen in the next six-seven years; a pessimist will say 10 years. So, the question is when rather than if. The current market-cap is roughly $1.3 trillion, if we take a 1:1 GDP to market-cap, we are looking at a $2.6 trillion wealth creation opportunity over the next 10 years. That is what we should look at. It took us 60 years to reach $1 trillion since independence; the next one trillion happened only in six years. From a broad perspective, that is what we need to look at. Even at a 5% growth rate, we were among the world’s fastest growing economies. Other countries, and other economies, are in a worse situation than India’s. Here, we talk about growth—whether it will be 7% or 9%; we are not talking about whether growth will be 1% or 2% or negative. Our view is that the interest rates are going to fall. I’ll give you a perspective. Interest rates are almost 8% in India as per G-Secs yields. In the US, it is around 2.40%. The long-term average difference of interest rates between the two countries has been 4%, basically, due to the difference in inflation. The current gap is 5.50 percentage points. We believe that, from now to December 2016, there will be at least 100-150 basis points cut in interest rates. We will be the only economy with interest rates cuts. All other economies are under threat of interest rates moving up. We will be in a unique position. ML: As far as the growth prospects of the Indian economy are concerned, where do we stand now? SS: The good thing is that the building blocks are in place. We now need only execution. The second thing we need is to remember that we are a very vibrant economy and, in that scenario, there may be a few things that get delayed. We expected a lot of things to happen very soon; but it takes time. Even in companies, where a new CEO is appointed, nothing is going to happen in just one year. The government is moving in the right direction. The ministries are now getting their act together. So, in the next six to twelve months, you should see execution. ML: Has your fund management style changed, after the financial crisis in 2008? SS: Global factors were always important; but 2007-08 emphasised their significance. You can’t take it for granted that growth will continue forever. You also need to think about ‘what if it does not happen’. So, in 2007-08, no one was thinking about what might go wrong. Similarly, in 2013, no one was thinking about what might go right. We have started to analyse global factors more deeply. Obviously, some factors, such as volatile currency and raw material prices, will have greater impact. The March (2015) quarter earnings were disappointing; some sectors got hit because euro and pound depreciated significantly. Raw materials price swings also impacted several companies. This caused extraordinary losses. This becomes very important. Also, it was a mistake to assume that companies will get capital as and when they want. Many infrastructure and power companies suffered because of lack of capital. The most important factor is the risk the company is taking to create a sustainable business model. We are very clear now what the balance sheet strength is. ML: Reliance Growth invests in a diversified portfolio of mega-caps, mid-cap and small-caps. How do you define the weightage to different cap sizes? SS: The objective is to invest 65%-75% in mid-caps; but, two or three years ago, we felt it would be better to invest in larger companies in banking and IT than in the mid-caps; this has worked out well. That is why there are more large-caps; otherwise, the objective is to have more of mid-caps. ML: Which are the most influential books you have read? SS: Currently, I’m reading the autobiography of Elon Musk. I read a lot of financial books; but of late, I like to read autobiographies. For just Rs500-Rs600, you are able to get 25 years of experience of a super-achiever. I read a collection of articles by Michael Mauboussin recently. All the articles he wrote in 2014 are compiled in a book. That was outstanding. A lot of interesting themes were covered in his articles. I read a book Zebra in a Lion Country; this was very pertinent, from a situational perspective, in 2013. The book talks about how zebras move in herds and everyone wants to be in the centre of the herd, for safety. Equity investing also had become like that; everyone wanted to be at the centre, in 2013. Everyone wanted to be invested in the best companies, irrespective of valuation. ML: Is this one reason why benchmark stocks have a high weightage in certain schemes? SS: When you invest in a company, you become a partner in the business. So, unless you are positive on the business, you will not want to invest in the company. It’s not like you invest in a business and, from tomorrow, you start getting returns. You have to invest with a perspective. And that perspective is based on certain assumptions and a cycle. And that cycle might play out in the next one year or it might play out in the next three-four years. So, as an investor or fund manager, if you are clear about that, you will always make returns. More in Moneylife", "external_links": [], "published": "2015-08-17T09:10:00.000+03:00", "crawled": "2015-08-19T15:06:04.217+03:00", "highlightTitle": ""}