{"organizations": [], "uuid": "4e21838144eacb2831aba015a34bc964268da7cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn2.scmp.com/sites/default/files/styles/620x356/public/2015/08/15/hsbc_1.jpg?itok=220ju_5t", "site_section": "http://scmp.com//rss/11/feed", "section_title": "South China Morning Post - Banking & Finance feed", "url": "http://www.scmp.com/business/banking-finance/article/1849695/hsbc-shares-down-hong-kong-after-nine-banks-agree-us2b", "country": "HK", "title": "HSBC shares down in Hong Kong after nine banks agree US$2b rigging settlement in US", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "HSBC shares down in Hong Kong after nine banks agree US$2b rigging settlement in US", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T19:17:00.000+03:00", "replies_count": 0, "uuid": "4e21838144eacb2831aba015a34bc964268da7cf"}, "author": "yklin", "url": "http://www.scmp.com/business/banking-finance/article/1849695/hsbc-shares-down-hong-kong-after-nine-banks-agree-us2b", "ord_in_thread": 0, "title": "HSBC shares down in Hong Kong after nine banks agree US$2b rigging settlement in US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order your FREE copy of AT YOUR SERVICE 2015 HSBC and eight other global banks were accused of rigging the foreign exchange market. Photo: Felix Wong \nHSBC Holdings shares closed down 0.73 per cent at HK$68 in Hong Kong on Friday after a New York law firm said the bank and eight global peers had agreed to pay a total of US$2 billion in settlements to investors. \nThe payouts for individual banks in the first of what could be several class-action suits against the banks on accusations of foreign exchange rigging was expected to be smaller than fines that regulators in the United States and Europe have dispensed over the past three years. \n\"Some of this has been provisioned for. It will probably be relatively small compared with other fines [HSBC] has seen,\" Shailesh Raikundlia, a banks analyst at Espirito Santo in London, told the South China Morning Post . \"But there are likely to be more coming through.\" \nHSBC booked about US$1.1 billion in legal fees between April and June. Of that, US$794 million was related to the bank's investment banking division and foreign exchange investigation. \nIn late morning trade in London, HSBC shares were slightly down at 559 pence. \nLegal firm Hausfeld said in a statement published after a hearing in New York on Thursday that plaintiffs had \"reached settlements totalling more than US$2 billion with Bank of America, Barclays, BNP Paribas, Citi, Goldman Sachs, HSBC, JP Morgan, RBS and UBS\". \nHausfeld, which represented investors, said the agreements must still be approved by US District Judge Lorna Schofield. \nIn June, sources close to the situation reported that Barclays would pay US$375 million, HSBC US$285 million, BNP Paribas nearly US$100 million and Goldman Sachs about US$130 million. But they also specified that the amounts were subject to change. \nHSBC in Hong Kong did not reply to requests for comment. \nSome of the banks in Thursday's announcement had already agreed to specific sums: JP Morgan Chase agreed to pay US$99.5 million in January; Bank of America US$180 million; Citigroup US$394 million and Switzerland's UBS US$135 million. \n\"These settling banks have agreed to cooperate with investors in their … litigation\" against other institutions, Hausfeld said. \nBarclays, JP Morgan, Citigroup and the Royal Bank of Scotland all pleaded guilty to US Department of Justice charges of conspiring to manipulate the currency market.   HSBC among banks facing US$2b rigging fines Share", "external_links": [], "published": "2015-08-14T19:17:00.000+03:00", "crawled": "2015-08-14T22:32:32.579+03:00", "highlightTitle": ""}