{"organizations": [], "uuid": "b311c3fe80fd45e27e9e0955ae4577173016eea3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/sky-under-investigation-not-letting-153336950.html", "country": "US", "title": "Sky under investigation for not letting customers cancel", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Sky under investigation for not letting customers cancel", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T18:33:00.000+03:00", "replies_count": 0, "uuid": "b311c3fe80fd45e27e9e0955ae4577173016eea3"}, "author": "", "url": "https://uk.finance.yahoo.com/news/sky-under-investigation-not-letting-153336950.html", "ord_in_thread": 0, "title": "Sky under investigation for not letting customers cancel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nThu, Aug 6, 2015, 16:55 BST - UK Markets closed Sky under investigation for not letting customers cancel By Nicole Blackmore | Telegraph – 21 minutes ago -12.00 \nOfcom is considering whether the telecoms provider used inappropriate tactics to prevent customers from leaving \nIn a victory for Telegraph Money , Sky (LSE: BSY.L - news ) is being formally investigated by the communications regulator Ofcom over concerns that it does not allow customers to cancel at the end of their contracts. \nTelegraph Money first exposed the problems people experienced cancelling Sky contracts in January 2014. A subsequent investigation by this newspaper found routinely poor treatment of customers who tried to terminate their Sky packages, even when they were outside of their contract term. \nThe television, phone and internet provider's contracts stated that customers could cancel by letter, email, fax or phone, but a number of readers who wrote to the company found that their subscription remained in force. \nIn fact, Sky routinely refused to accept any cancellation requests that were not \"verified\" by the customer over the telephone. \nOfcom's investigation, which could run into next year, will consider whether Sky breached its obligations to ensure that contract termination procedures do not act as a disincentive for customers to change provider. \nIt said: \"Ofcom's investigation will examine whether there are reasonable grounds for believing that Sky has failed to comply with [its] obligations.\" \nThis is a separate investigation from Ofcom's industry-wide inquiry, launched in June this year, into the \"aggressive tactics\" used by broadband and television companies when customers want to leave. \nIn May 2014, following extensive coverage by this newspaper, Sky (Amsterdam: BK8.AS - news ) agreed to amend its customer agreements to make it clear that subscribers could cancel their contracts by telephone only. \nBut the problems didn't stop there. When customers phoned Sky they were forced to endure calls lasting up to two hours and were still prevented from cancelling. \nSky also left conflicting cancellation guidelines on its website, causing confusion and further frustration for customers. \nIts website stated: \"If you'd like to cancel your Sky subscription, you'll need to ... call us OR start a Live Chat online.\" \nBut further down the page it said: \"Please note, we won't be able to cancel your services unless we verify your request over the phone.\" \nMany customers were left frustrated after long conversations on the Live Chat service that proved fruitless. \nOne reader was made to conduct a 90-minute conversation with a Sky employee via Live Chat when he attempted to cancel his contract. You can read a transcript of the 4,000-word conversation here . At the end of the conversation he was still unable to cancel. \nOthers suffered similar experiences . \nMany customers said they felt so trapped that they simply cancelled their direct debits, only to be faced with threatening letters from Sky's debt collectors. \n• Sky subscriptions: why is it so hard to cancel? \nReaders responded to Telegraph Money 's coverage by offering their own tips on how best to cancel Sky contracts, which included telling the company you are moving abroad. \nOne reader, Pete Swift, eventually won a £1,500 payout from Sky after spending two years and £1,395 trying to cancel his TV and broadband package. \nSky is not alone in attracting criticism for making it hard for customers to stop subscriptions. In June this year Ofcom launched an investigation into poor service standards for customers trying to leave broadband and television companies. \nThe telecoms watchdog said it would look at the rise of \"aggressive tactics\" used by firms when customers want to leave. This investigation will continue to run alongside the new investigation into Sky. \nA Sky spokesman said: \"We're committed to delivering the best service in the country and we believe this is one of the reasons why more customers than ever are choosing Sky. We will work closely with Ofcom to help them with their investigation.\" \n• The best of Telegraph Money: get our weekly newsletter", "external_links": [], "published": "2015-08-06T18:33:00.000+03:00", "crawled": "2015-08-06T18:56:53.109+03:00", "highlightTitle": ""}