{"organizations": [], "uuid": "7a6c13ce8b24cc5a886562021ef7d77455b02555", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/provider-telegraph/?format=rss", "section_title": "Finance News | Telegraph - Yahoo! UK & Ireland Finance", "url": "https://uk.finance.yahoo.com/news/questor-share-tip-shares-uk-091259189.html", "country": "US", "title": "Questor share tip: Shares in UK housebuilders hit eye-watering levels", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Questor share tip: Shares in UK housebuilders hit eye-watering levels", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T12:12:00.000+03:00", "replies_count": 0, "uuid": "7a6c13ce8b24cc5a886562021ef7d77455b02555"}, "author": "", "url": "https://uk.finance.yahoo.com/news/questor-share-tip-shares-uk-091259189.html", "ord_in_thread": 0, "title": "Questor share tip: Shares in UK housebuilders hit eye-watering levels", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "484.43 -1.5700 \nRecord (LSE: REC.L - news ) profits and bumper cash returns to investors have seen housebuilders shares hit record highs but in the long run its totally unsustainable, says Questor \nUK housebuilders Questor saysAVOID \nThe UK housebuilding sector has seen its shares soar to all-time highs on a heady mix of record profits and bumper cash returns to investors. The problem for investors, however, is that the sector is supported by government measures that in the long run are unsustainable, with a distortion of fundamentals that creates a huge amount of risk. \n= House built on sand? = \nShares (Berlin: DI6.BE - news ) in the housing sector are currently based on two things. One is the expectations of future profitability and the second is the cash that will be returned to investors via dividends. \nBut the profit levels have been distorted by a number of factors. Record low interest rates and cheap debt have reduced mortgage costs, making home ownership possible for thousands. \nHouse prices have recovered from the 2008 crash, while the introduction of the Government’s Help to Buy scheme has given banks the confidence to lend even more to homebuyers. \n= Volatile profits = \nBovis Homes [LON:BVS] demonstrated yesterday how this is all impacting on trading . The average selling price of its houses was £264,200, 10pc higher than last year, and pre-tax profits increased to £53.8m, for the first-half of the year. \nBut investors are being lulled into a false sense of security by the profit figure. Market expectations are that, following the usual strong summer of house sales, the full-year pre-tax profits will be about £171m, giving earnings per share of 101p. So, the shares don’t look that expensive trading on a price earnings (P/E Ratio) of 12 times. \nThe problem is instead that housebuilders’ profits are famously cyclical and extremely volatile. \nTo put some perspective on how the extraordinary stimulus has boosted profit performance at Bovis, the company reported pre-tax profits of £15.6m in the first six months of 2012. \nQuestor thinks it is always a good idea to work out the potential downside on an investment. Simply taking the 2012 earnings per share figure of 30p and applying a multiple of 11 times reaches a share price of 330p. That would be a painful fall of 72pc from today’s prices. \nWe are currently experiencing a period of peak profits and the effect on housebuilders’ shares has been emphatic. Bovis shares have more than tripled during the past four years to about £12, the exact same price at which they peaked in 2007 just before the property bubble burst. \n= Bumper cash returns = \nBovis has been returning increasing amounts to shareholders. In the latest interim results the dividend was increased by 14pc to 13.7p, going ex-dividend on September 23 and payable November 20. The full-year dividend is expected to be about 40p more than triple the dividend from just two years ago. \nPersimmon [LON:PSN] has pledged to return £1.9bn in dividends to shareholders during an eight-year period from 2013. The capital return has twice been accelerated and looks like it may now be finished within five years. \nIt (Other OTC: ITGL - news ) works out at 620p a share, and provides healthy income levels for investors. The 620p, averaged over the eight-year period, works out at 77.5p per year, or a 5pc forecast yield. \nInvestors are being drawn to the income provided by these ever-increasing dividend payments. However, dividend payments can only be made out of sustainable profits, and given the volatility in housebuilders’ results then the same should be expected from the dividends. \n= Safety in numbers = \nBovis is not alone in its exceptional profit performance. A similar situation is taking place at Persimmon (Other OTC: PSMMF - news ) , Redrow (LSE: RDW.L - news ) , Galliford Try (LSE: GFRD.L - news ) , and Berkeley. All of the FTSE-listed housebuilders are breaking profit records with every new set of results. \nAt the moment there is no need for panic. \nHouse prices are stable, order books are full, the sun is shining, banks are lending and demand is strong. The risk is that all the factors underpinning the housing market are unsustainable in the long term. At some stage Help to Buy will come to an end, interest rates will eventually begin to rise and buyers will be unprepared to pay such a high multiple of earnings. \n= Greater fool theory = \nWhen share prices depart from the fundamentals, as they have so clearly done in the UK housebuilding sector, then investors become reliant on more ephemeral measures of value. \nOne is simply hoping they can find someone else in the stock market who is willing to pay such a high price for the shares. \nWhile there is no way of knowing exactly when this will end, relying on the greater fool theory has proved disastrous to wealth as a long-term investment startegy. \nFor investors who bought shares before the beginning of this year, then they are worth holding on to for the income. Investors might also want to bank a portion of their profits. \nThat said, we simply cannot recommend buying at these prices as the potential losses far outweigh any future returns. \nThe share prices across the UK housebuilding sector are bearing all the hallmarks of being in the later stages of a bubble. \nThe beauty of investing for the long term is that you don’t have to know when it is going to burst to avoid being in it when it does (Other OTC: UBGXF - news ) .", "external_links": [], "published": "2015-08-18T12:12:00.000+03:00", "crawled": "2015-08-18T12:19:55.663+03:00", "highlightTitle": ""}