{"organizations": ["GM China", "Facebook", "Twitter"], "uuid": "c61683e96d917b7ae1448cd2a18044b3bbf72aad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxbusiness.com", "main_image": "http://a57.foxnews.com/global.fbnstatic.com/static/managed/img/fb2/markets/0/0/buick-envision.jpg", "site_section": "http://finance.yahoo.com/rss/headline?s=GM", "section_title": "Yahoo! Finance: GM News", "url": "http://www.foxbusiness.com/industries/2015/08/19/is-gm-going-to-import-buicks-from-china/", "country": "GB", "title": "Is GM Going to Import Buicks from China?", "performance_score": 0, "site": "foxbusiness.com", "participants_count": 0, "title_full": "Is GM Going to Import Buicks from China?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T20:15:00.000+03:00", "replies_count": 0, "uuid": "c61683e96d917b7ae1448cd2a18044b3bbf72aad"}, "author": "", "url": "http://www.foxbusiness.com/industries/2015/08/19/is-gm-going-to-import-buicks-from-china/", "ord_in_thread": 0, "title": "Is GM Going to Import Buicks from China?", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Facebook 0 Twitter 0 livefyre Email Print (GM China) \nGeneral Motors ( GM ) is reportedly considering plans to build new Buicks in China and ship them to the U.S., adding another wrinkle to ongoing negotiations with the United Auto Workers union. \nEarly this week, industry publication Automotive News speculated that Buick’s Envision would very likely be imported from China when GM brings the compact crossover to North America. The Envision launched in China last year, and the model is said to be bound for the U.S. in late 2016. \nA report from Reuters took things a step further, saying GM is expected to manufacture just two future Buick models in North America: the LaCrosse sedan and Enclave crossover. \nA Buick spokesperson said the luxury brand has not announced the Envision for any markets outside of China, and as a matter of practice, Buick does not comment on future product plans. \nWord of the potential move was met with criticism from the UAW, which recently began talks over new labor contracts with Detroit’s Big Three. \n“The Envision should be made in the U.S. by the workforce that saved GM in its darkest time and UAW members intend to address this issue in contract talks,” Cindy Estrada, vice president of UAW’s GM department, said in a statement. \nEstrada added that GM “should stand by its declaration that it will build where it sells,” calling the Envision speculation “tone-deaf.” \nUAW officials have said they will make production in other countries a top issue. Just as the negotiations were about to begin, Ford Motor Co. ( F ) announced plans to move production of two small cars out of its Michigan Assembly Plant . The reported destination is Mexico, while Ford said it is exploring all options. Buick introduced its Cascada convertible at the 2015 Detroit Auto Show. (Source: GM) \nFor Buick, imports are nothing new. \nThe small Encore crossover, Buick’s most popular U.S. vehicle this year, is shipped from Korea. The Regal, a mid-size sedan, is built in Canada. And the Cascada convertible, which Buick unveiled at the 2015 Detroit Auto Show, will continue to be built in Europe when the luxury brand introduces it to American consumers next year. The Cascada is already sold in Europe by Opel, GM’s European unit. \nChina is Buick’s largest market, so it is no surprise that the country could become a central location for production. \nStill, GM must also consider how the potential move would impact the brand in the U.S., where buyers may be less inclined to purchase Buicks made in China. \n“Considering the recent history of GM, there’s a delicate balance they have to walk,” Edmunds.com senior analyst Jessica Caldwell said. “But Buick is a good example of a global brand. It has the most success in a number of places.” \nCaldwell added that she took note of the large number of Buicks in China while traveling there. “You can see it’s a desired brand,” she explained. \nAnalysts have long expected GM to add another crossover to Buick’s lineup, thereby capitalizing on one of the hottest segments in the auto industry. \nSales of the Enclave are down only slightly through the first seven months of 2015, while the Encore has surged 35%. LaCrosse, Regal and Verano deliveries have all slipped between 17% and 21%. \nThe Envision would fit in the Buick lineup between the Encore and eight-passenger Enclave.", "external_links": [], "published": "2015-08-19T20:15:00.000+03:00", "crawled": "2015-08-19T20:59:50.748+03:00", "highlightTitle": ""}