{"organizations": [], "uuid": "2db6522b93e3a531a655bcd4b9fe51d57342b613", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "au.finance.yahoo.com", "main_image": "https://s.yimg.com/bt/api/res/1.2/6rik6AZwuPGCiADf_9dhPQ--/YXBwaWQ9eW5ld3M7cT03NTt3PTYwMA--/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://au.finance.yahoo.com/news/topic-top-stories/?format=rss", "section_title": "Australian Business & World Finance News - Yahoo!7 Finance", "url": "https://au.finance.yahoo.com/news/group-highlights-indigenous-super-troubles-140208399.html", "country": "GB", "title": "Group highlights indigenous super troubles", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Group highlights indigenous super troubles", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T17:02:00.000+03:00", "replies_count": 0, "uuid": "2db6522b93e3a531a655bcd4b9fe51d57342b613"}, "author": "", "url": "https://au.finance.yahoo.com/news/group-highlights-indigenous-super-troubles-140208399.html", "ord_in_thread": 0, "title": "Group highlights indigenous super troubles", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mon, Aug 17, 2015, 2:38 AM AEST - Australia Markets open in 7 hrs 22 mins Group highlights indigenous super troubles AAP – 2 hours 36 minutes ago Recommend Print \nIndigenous Australians have less retirement savings and greater difficulty in accessing their superannuation funds than the rest of the population. \nThey also have less opportunity to benefit from their compulsory savings because they have lower life expectancies, a group of industry experts say. \nThe Indigenous Superannuation Working Group is calling on the Council of Australian Governments to put the superannuation challenges facing Aboriginal and Torres Strait Islanders on its agenda. \nThe group will lobby for government red tape to be cut to help indigenous people access their superannuation funds, the group's chair Eva Scheerlinck says. \n\"Government agencies have all the information required to make it easier for indigenous Australians to interact with their superannuation fund, but currently, they are unable to help due to excessive red tape,\" she said. \n\"By placing indigenous superannuation outcomes on the COAG agenda these agencies will be encouraged to collaborate to significantly improve retirement outcomes for many.\" \nThe group recently held a summit on the issue and have compiled a report that highlights data which found about 43 per cent of indigenous Aussies don't have a transaction account, general insurance and a moderate amount of credit. \nIndigenous leaders and super industry representatives will deliver the report to Assistant Treasurer Josh Frydenberg and the opposition's Indigenous Affairs spokesman Shayne Neumann on Monday. @y7finance on Twitter, become a fan on Facebook Firms avoided $31b tax in Aust in a year AAP \nMultinationals trading in Australia funnelled more than $30 billion to Singapore in one year to avoid tax, an investigator …", "external_links": [], "published": "2015-08-16T17:02:00.000+03:00", "crawled": "2015-08-16T19:42:25.523+03:00", "highlightTitle": ""}