{"organizations": [], "uuid": "9ff45050ff9fac55a9607a756a92ce8b4601e13f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.reuters.com", "main_image": "", "site_section": "http://www.reuters.com/finance/personal-finance", "section_title": "Wealth, Personal Finance &amp; Money | Reuters.com", "url": "http://www.reuters.com/article/2015/08/10/rcs-capital-stocks-idUSL1N10L1FN20150810", "country": "US", "title": "RCS Capital plummets another 31 pct after reorganization", "performance_score": 0, "site": "reuters.com", "participants_count": 1, "title_full": "RCS Capital plummets another 31 pct after reorganization | Reuters", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T23:15:00.000+03:00", "replies_count": 0, "uuid": "9ff45050ff9fac55a9607a756a92ce8b4601e13f"}, "author": "Jed Horowitz", "url": "http://www.reuters.com/article/2015/08/10/rcs-capital-stocks-idUSL1N10L1FN20150810", "ord_in_thread": 0, "title": "RCS Capital plummets another 31 pct after reorganization", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK Aug 10 Shares of brokerage firm RCS Capital Corp fell 30 percent to an all-time low Monday, exacerbating a 35 percent decline over the previous two trading days after it announced a shakeup of its business and management.\nRCS, which owns 11 brokerage firms with more than 9,000 independent brokers, said on Thursday it will divest a major business, give 5.6 million shares to senior executives and a major outside investor and replace its chief executive and chief financial officer. It also announced a loss of $66.1 million in the second quarter and gave a gloomy outlook for the rest of 2015.\nRCS sells investment products and advice to individual investors through its Cetera Financial Group brokerage unit. The company was put together in the past two years by real estate entrepreneur Nicholas Schorsch. His business empire began to face problems in 2014 after his company American Realty Capital Properties, now known as Vereit, reported a $23 million accounting error.\nCitigroup brokerage firm analyst William Katz on Monday downgraded RCS stock to \"neutral\" from \"buy,\" citing liquidity concerns and the company's need for additional capital. RCS says it has arranged a solid round of recapitalization and renegotiated its loan conditions.\nRCS is selling its \"wholesale\" business, which supplies other retail brokerage firms with \"alternative\" investments, for $25 million to private equity firm Apollo Global Management . An RCS investor, seeking anonymity to comply with his brokerage firm employer's policies, said he scratched his head at the low sales price, thinking the company meant to write $250 million.\nMany brokerage firms suspended their contracts to sell RCS's wholesale products after the Schorsch-related accounting issue.\nRCS stock was down 30 percent to $2.80 in the early afternoon, passing its previous low of $2.92. It first issued shares to the public in June 2013 at $20.\n\"We see three key issues for the stock in the intermediate term, even at these levels,\" Katz wrote in his note to investors, \"liquidity; debt covenant coverage and potentially the need to raise equity.\" Citigroup lowered its price target on the shares to $4 from $18. (Reporting By Jed Horowitz; Editing by Andrew Hay)", "external_links": [], "published": "2015-08-10T23:15:00.000+03:00", "crawled": "2015-08-10T22:23:41.529+03:00", "highlightTitle": ""}