{"organizations": [], "uuid": "37cd0dfc2a99289aacf0cd211c4a1ae2afe5d886", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/26/12926629/Server.png", "site_section": "http://www.prweb.com/rss2/finance.xml", "section_title": "Business: Finance", "url": "http://www.prweb.com/releases/2015/08/prweb12926629.htm", "country": "US", "title": "New Storage Solution Provides Enhanced Security and Automation", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "New Storage Solution Provides Enhanced Security and Automation", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "37cd0dfc2a99289aacf0cd211c4a1ae2afe5d886"}, "author": "Brandy Whalen", "url": "http://www.prweb.com/releases/2015/08/prweb12926629.htm", "ord_in_thread": 0, "title": "New Storage Solution Provides Enhanced Security and Automation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dynamic Solutions International, a leading provider of data storage solutions and comprehensive professional services, today announced the availability of the new DSI400 Series. The DSI400 series consists of five models designed to handle the virtual tape library (VTL) storage needs of companies of all sizes, from small businesses just making the switch to VTL, to enterprise customers needing a customized data storage solution. The complete DSI400 line consists of the following:\nDSI400-NEM is an entry-level storage system with a maximum storage capacity of 2TB, designed specifically for IBM i systems users. The DSI-NEM is ideal for organizations making the transition from physical to virtual tape systems. DSI-NEM is priced comparably to physical tape systems, while offering all the automation, security and ease of use that a VTL storage system has to offer. DSI400-BEM is an entry-level storage system with a maximum storage capacity of 4TB, designed specifically for users of IBM i and Unisys systems.\nDSI400-VEM is an entry-level storage system with a maximum storage capacity of 8TB, designed specifically for IBM i and Unisys systems.\nDSI400-MEM is a mid-range storage system with a maximum storage capacity of 48TB, designed specifically for IBM i and Unisys systems users. The DSI400-MEM includes disk-level encryption and a list of customizable options designed to enhance storage centers.\nDSI400-EV0 is an enterprise storage system with a maximum storage capacity that grows into the petabytes, designed specifically for IBM i and Unisys systems users. The DSI400 includes de-duplication and encryption and is customized to deliver unparalleled performance and reliability for enterprise clients.\n“At DSI, we have the ability to adapt our VTL storage solutions to meet the demands of evolving industries,” said Jim Tarbell, president, Dynamic Solutions International. “Our goal was to create a superior VTL storage system with features designed to improve security, reliability and speed. We listen to our clients to determine what our next move will be; time and time again we heard the request for an entry-level storage system with all the security and automation of an enterprise solution, as well as the need for increased storage capacity for companies managing ever-increasing amounts of data. The DSI400 family of products is the answer to these requests.”\nWith over 2,000 virtual tape library (VTL) customers worldwide, Dynamic Solutions International offers next-generation levels of VTL for IBM i, MCP, OS2200 and distributed platforms. Additionally, Dynamic Solutions International is the managing data storage partner for one of the federal government’s largest agencies and two core-banking application firms. In 2015, Dynamic Solutions International was a finalist for the “Colorado Companies to Watch” list, which honors second-stage companies for the critical role they play in the state’s economy.\nFor more information about Dynamic Solutions International products and services, visit http://www.dynamicsolutions.com .\nAbout Dynamic Solutions International\nDynamic Solutions International has been in the data storage business for 45 years and is one of the leading providers of VTL storage solutions. The company provides customized data storage solutions for financial, government, healthcare and higher education entities. Through its industry partnerships, Dynamic Solutions International provides complete solutions that combine world-class hardware and software with exceptional service and support, so your information is both safer and easier to manage.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5keW5hbWljc29sdXRpb25zLmNvbQ=="], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-27T00:54:39.537+03:00", "highlightTitle": ""}