{"organizations": ["HFM", "MS Office Strong", "Dice ATR International", "Knowledge of Financial Statement Financial Modeling Financial", "PeopleSoft", "Atr International"], "uuid": "28bd845f707e959892e2ee925aac5430f0d2e69e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.simplyhired.com", "main_image": "", "site_section": "http://www.simplyhired.com/a/job-feed/rss/o-13205", "section_title": "Finance jobs | Simply Hired", "url": "http://www.simplyhired.com/job/t5ergnuirs", "country": "US", "title": "Financial Analyst w/ variance & trend analysis experience at Atr International (Irvine, CA)", "performance_score": 0, "site": "simplyhired.com", "participants_count": 0, "title_full": "Financial Analyst w/ variance & trend analysis experience at Atr International (Irvine, CA)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T12:18:00.000+03:00", "replies_count": 0, "uuid": "28bd845f707e959892e2ee925aac5430f0d2e69e"}, "author": "", "url": "http://www.simplyhired.com/job/t5ergnuirs", "ord_in_thread": 0, "title": "Financial Analyst w/ variance & trend analysis experience at Atr International (Irvine, CA)", "locations": ["CA", "Irvine"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kathy Van"], "text": "Source: Dice ATR International has been a leader in the staffing industry since 1988, placing professionals in the industry's most innovative companies. We currently have an exciting opportunity for aFinancial Analyst w variance trend analysis experience with one of our important clients. Position Information Job TitleFinancial Analyst w variance trend analysis experience LocationIrvine, CA Duration 12 Months Compensation DOE Contact Information Kathy Van Kathyvatr1.com Job Description Looking for someone heavy on financial analysis and advance knowledge in excel. Someone with working knowledge of access with the ability to write some macrosVBA in access is a PLUS! Irsquom working with the team to build out the Access DB, so knowledge in this area will prove to be very helpful in assisting with the financial requirements. The individual must be highly motivated, with a proactive \"can do\" attitude and the ability to resolve issues with minimal supervision. This is a fast paced environment and requires a candidate that is detail-oriented and that can produce quality work while meeting tight deliverables and deadlines. Strong communications skills, with ability to present and explain financial data in a clear and concise manner to Executive management team is also key. Requirements Technical Experience Advanced knowledge of Excel (formulasfunctions , pivot tables, macros, charting, modeling) HEAVY Experience creating financial reportsdashboards Intermediate Access database skills (query writing, forms, reports, creatingmaintaining database) Relational Database Principle - In depth knowledge of data analysis and relational database use Ability to reconcile and complete data mapping from multiple systemssources into one centralized repository (i.e. Oracle, HFM, PeopleSoft, AU Miner, Vendor Management VMSOR, etc.) Essbase knowledge with excel add-in experience to create excel reports pulling from essbase Ability to provide recommendationsoversee system automation process improvements Finance background (Finance degree with working knowledge) Knowledge of Financial Statement Financial Modeling Financial reporting, including forecastbudget, variance reporting, resource planning, trending analysis (ability to analyze large amounts of information, identify key trendsvariances and summarize for manager senior management) GAAP Knowledge Experience with Month-End Close process Basic knowledge of cost accounting process Minimum Qualifications Bachelorrsquos Degree, preferably in FinanceDatabase Administration 3-5 years FinanceDatabase experience Intermediate to Advance knowledge of MS Office Strong organization skill and high attention to detail a must Excellent time management skills with a demonstrated ability to multitask, prioritize and meet deadlines Proven high performer who is self-directed Strong communication skills, both oral and written Able to work in a fast pace environment Flexible and able to quickly adapt to change Proven ability to achieve outstanding results and be a team player Fast learner who can ldquo think outside of the boxrdquo Preferred Experience Experience working in an IT Environment Project Management working knowledge (providing project financial reporting to project managers, managing labor forecasting) Management experience a plus Track-record developing strategies for long-term financial planning and growth Ability to work comfortably as the assigned subject-matter expert and work with technical team members, business partners, vendors, and other areas as needed Is this position not a fit for you? Click here httpblog.atrinternational.comresume-submittal to send us your resume and our recruiters will find one that is. To be considered for this position, please click the \"Apply Now\" button. Visit our website at www.atrinternational.com httpwww.atrinternational.com for an up-to-date listing of opportunities. Oracle, HFM, PeopleSoft, AU Miner, Vendor Management VMSOR,", "external_links": [], "published": "2015-08-26T12:18:00.000+03:00", "crawled": "2015-08-26T15:50:16.438+03:00", "highlightTitle": ""}