{"organizations": [], "uuid": "0b7f172289fe34ed181a900b32f4866929a9a92f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bloomberg.com", "main_image": "", "site_section": "http://www.bloomberg.com/personal-finance", "section_title": "Personal-finance - Bloomberg Business", "url": "http://www.bloomberg.com/news/articles/2015-08-06/china-s-stock-buying-spree-seen-at-145-billion-with-more-to-go", "country": "US", "title": "China’s Stock Buying Spree Seen at $145 Billion With More to Go", "performance_score": 0, "site": "bloomberg.com", "participants_count": 1, "title_full": "China’s Stock Buying Spree Seen at $145 Billion With More to Go - Bloomberg Business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T11:15:00.000+03:00", "replies_count": 0, "uuid": "0b7f172289fe34ed181a900b32f4866929a9a92f"}, "author": "Bloomberg.com", "url": "http://www.bloomberg.com/news/articles/2015-08-06/china-s-stock-buying-spree-seen-at-145-billion-with-more-to-go", "ord_in_thread": 0, "title": "China’s Stock Buying Spree Seen at $145 Billion With More to Go", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China’s government has spent as much as 900 billion yuan ($145 billion) in the past two months to prop up the nation’s stock prices, almost half the funds allocated for a market rescue, according to Goldman Sachs Group Inc.\nThe injection amounts to 2.2 percent of the country’s free-float market capitalization, or shares available for trading, Goldman Sachs strategists led by Chenjie Liu wrote in a report dated Aug. 5, citing the firm’s own analysis of stock-market liquidity and fund flows. Speculation that the government will unwind its intervention is probably overdone, with more than 1 trillion yuan still available to support the market, according to Goldman Sachs.\nChinese shares have lost about $3.4 trillion of market value since June 12, with the Shanghai Composite Index dropping 30 percent amid an exodus of leveraged investors and concern that valuations had grown too expensive after a record-long bull market. Policy makers responded by unleashing an unprecedented series of support measures, including direct equity purchases by state agencies and government-owned companies.\n“This implies sufficient market-support funds to continue to provide a downside cushion to the equity market as the later stages of retail deleveraging unfold,” Liu wrote.\nThe Shanghai Composite will probably trade in a range in the “near term,” supported around the mid-3,000 level by government buying and capped at about 4,500 by the prospect of selling by brokerages and others investors who have been “constrained” from offloading shares, Goldman Sachs said. The Shanghai index dropped 0.1 percent to 3,692.27 at 11:14 a.m. local time on Thursday.\nState buying has probably focused on “blue-chip” and defensive companies including banks, insurers, food and health-care companies, the analysts wrote. The government has yet to disclose a complete picture of its share-purchase program.", "external_links": [], "published": "2015-08-06T11:15:00.000+03:00", "crawled": "2015-08-06T09:54:30.589+03:00", "highlightTitle": ""}