{"organizations": [], "uuid": "5130f23d6d3fc91a6a1213cb7baabfa698bcb0d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/08/Yakub-memon-s-pti.jpg", "site_section": "http://www.financialexpress.com/", "section_title": "The Financial Express | India News Today,Latest National News,Stock Market Today,SENSEX NIFTY,NSE BSE India,Finance News,Business News", "url": "http://www.financialexpress.com/article/miscellaneous/sp-leader-sparks-controversy-demands-rajya-sabha-seat-for-yakub-memons-wife/111918", "country": "IE", "title": "SP leader sparks controversy, demands Rajya Sabha seat for Yakub Memon’s wife", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "SP leader sparks controversy, demands Rajya Sabha seat for Yakub Memon’s wife | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T20:31:00.000+03:00", "replies_count": 0, "uuid": "5130f23d6d3fc91a6a1213cb7baabfa698bcb0d7"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/miscellaneous/sp-leader-sparks-controversy-demands-rajya-sabha-seat-for-yakub-memons-wife/111918", "ord_in_thread": 0, "title": "SP leader sparks controversy, demands Rajya Sabha seat for Yakub Memon’s wife", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Osama bin Laden's family members killed in UK plane crash Taliban leader Mullah Omar is dead, confirms White House MH370: Airplane debris arrives in France for Malaysia crash investigation Samajwadi Party leader Mohammed Farooq Ghosi has stirred a controversy by requesting party supremo Mulayam Singh Yadav to nominate 1993 Mumbai serial blasts convict Yakub Memon’s wife as a Rajya Sabha MP.\nTwo days after Memon was hanged in the Nagpur Central Jail, Ghosi, the Maharashtra SP unit vice president, described Memon’s wife Raheen as “helpless”.\n“Raheen was in jail for many years. How much she would have suffered.. Today I find Raheen helpless and there are many such Muslims in the country who find themselves helpless and for whom we have to fight for. We should make Raheen a Rajya Sabha MP and make her the voice of weak and helpless people,” Ghosi said in a letter to the SP chief.\nState party president Abu Asim Azmi, however, distanced himself from the matter, saying that an explanation will be sought from Ghosi on the content of his letter.\n“He (Ghosi) has not consulted the party before making irresponsible comments. He has written the letter in his personal capacity. He will be asked to explain his stand, following which necessary action will be taken against him,” Azmi told PTI.\nCongress said the decision to hang Memon was taken by the Supreme Court and should thus, not be politicised.\n“This is their internal party matter. But it seems more like their tacit agenda to communalise the issue. The decision to hang Memon was taken by the Supreme Court and thus the matter should not be politicised now,” Congress spokesperson Sachin Sawant said.\nBJP leader Madhav Bhandari said Ghosi’s comments prove that SP is only interested in playing vote-bank politics and that the party should come out and clear its stand on the issue.\n“Every person has the right to suggest something to his party. But every leader needs to show some constraint while making suggestions. SP has to clear its stand and if he is acting against party line, then party should take some serious action. This is sheer exploitation of votebank politics,” he said.\nFirst Published on August 01, 2015 12:31 pm", "external_links": [], "published": "2015-08-01T20:31:00.000+03:00", "crawled": "2015-08-01T14:11:53.763+03:00", "highlightTitle": ""}