{"organizations": ["Enhance Monitoring of Cross-border Transactions New Office", "Transactions New Office", "International Surveillance Office"], "uuid": "f9fc5a9c6b5adf267ef79672c9ab4fd970a5a671", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financemagnates.com", "main_image": "http://www.financemagnates.com/institutional-forex/wp-content/uploads/sites/9/2015/08/Globalization.jpg", "site_section": "http://forexmagnates.com/feed/", "section_title": "Latest News from Finance Magnates", "url": "http://www.financemagnates.com/institutional-forex/exchanges/new-office-at-jpx-to-enhance-monitoring-of-cross-border-transactions/", "country": "US", "title": "New Office at JPX to Enhance Monitoring of Cross-border Transactions", "performance_score": 0, "site": "financemagnates.com", "participants_count": 0, "title_full": "New Office at JPX to Enhance Monitoring of Cross-border Transactions", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T16:05:00.000+03:00", "replies_count": 0, "uuid": "f9fc5a9c6b5adf267ef79672c9ab4fd970a5a671"}, "author": "", "url": "http://www.financemagnates.com/institutional-forex/exchanges/new-office-at-jpx-to-enhance-monitoring-of-cross-border-transactions/", "ord_in_thread": 0, "title": "New Office at JPX to Enhance Monitoring of Cross-border Transactions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Office at JPX to Enhance Monitoring of Cross-border Transactions New Office at JPX to Enhance Monitoring of Cross-border Transactions The self-regulatory unit of the Japanese bourse is establishing an International Surveillance Office as international orders and HFT rise. Advertising Print This Post \nJapan’s leading financial trading bourse, the Japan Exchange Group (JPX), has announced that its self-regulatory unit, Japan Exchange Regulation (JPX-R), plans to establish an International Surveillance Office (ISO), which will be operational from September 1, 2015. \nThe regulatory unit, which began conducting self-regulatory operations for the Tokyo Stock Exchange in 2007, broadened its scope to account for the merger of the Tokyo Stock Exchange and the Osaka Securities Exchange to become JPX in 2013. \nIn line with legislation, JPX-R’s self-regulatory operations cover a broad range of investigations and examinations into compliance with laws and regulations, and decisions on disciplinary actions to deter unfair acts. \nThe new ISO will be a specialised unit, which has been created to conduct market surveillance of cross-border transactions. \nThe move comes as the global regulatory environment places greater onus on exchanges, banks and trading firms to monitor and report on orders, trades and e-communications in an effort to snuff out market abuse. \nMoreover, orders originating from outside Japan are on the rise, accounting for the majority on the Tokyo Stock Exchange and Osaka Exchange markets, prompting the needs for greater vigilance. \nThis is arguably accentuated by the recent launch of “JPX-SGX Co-Location Direct” from KVH , which gives traders access to direct, low latency data connections between the Singapore Exchange and the Tokyo Stock Exchange. \nAccordingly, JPX notes that “the new ISO unit will prepare JPX-R for changes in the market environment and market dynamics due to factors including the spread of high frequency trading (HFT).” \nSpecifically, ISO will be engaged in the following activities: Conduct market surveillance of cross-border transactions such as global offerings Exchange information related to market surveillance with foreign SROs Research regulations and trends outside Japan regarding unfair trading Enhance communication with market users outside Japan Advance JPX Asian Strategy  ", "external_links": [], "published": "2015-08-28T16:05:00.000+03:00", "crawled": "2015-08-28T13:15:00.296+03:00", "highlightTitle": ""}