{"organizations": [], "uuid": "cd1bdf8357124fb74bcd628a158ac8ce1177a5d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-55bf9868/turbine/os-norwegian-epic-port-canaveral-20150803", "site_section": "http://www.sun-sentinel.com/travel/rss2.0.xml", "section_title": "Travel - Sun Sentinel", "url": "http://www.sun-sentinel.com/travel/os-norwegian-epic-port-canaveral-20150803-story.html", "country": "US", "title": "Norwegian Epic heading to Port Canaveral", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Norwegian Epic heading to Port Canaveral", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T19:33:00.000+03:00", "replies_count": 0, "uuid": "cd1bdf8357124fb74bcd628a158ac8ce1177a5d2"}, "author": "Richard Tribou", "url": "http://www.sun-sentinel.com/travel/os-norwegian-epic-port-canaveral-20150803-story.html", "ord_in_thread": 0, "title": "Norwegian Epic heading to Port Canaveral", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Norwegian Epic heading to Port Canaveral Caption Norwegian Epic Don Emmert, AFP, Getty Images \nNorwegian Epic sails up the Hudson River on July 1, 2010 in New York on its maiden voyage from Southampton to New York. \nNorwegian Epic sails up the Hudson River on July 1, 2010 in New York on its maiden voyage from Southampton to New York. (Don Emmert, AFP, Getty Images) Caption Norwegian Epic at the Port of Miami LYNNE SLADKY, ASSOCIATED PRESS The Norwegian Epic cruise ship arrives at the Port of Miami in Miami Wednesday, July 7, 2010. The new Norwegian Cruise Line megaliner will call the Port of Miami home. The Norwegian Epic cruise ship arrives at the Port of Miami in Miami Wednesday, July 7, 2010. The new Norwegian Cruise Line megaliner will call the Port of Miami home. (LYNNE SLADKY, ASSOCIATED PRESS) Royal Caribbean International Port Canaveral getting another megaship with Norwegian Epic \nNorwegian Cruise Line will be increasing its Port Canaveral footprint in 2016. This fall will see the line's return to the port after a three-year absence with the arrival of Norwegian Spirit, but in 2016, Spirit will make way for one of Norwegian's biggest ships, Norwegian Epic. \nThe 4,100-passenger vessel began sailing in 2010, and was at the time the world's third-largest cruise ship behind Royal Caribbean's Oasis and Allure of the Seas. At 155,873 gross tons, it's still the largest ship in Norwegian's fleet, but will give away that title to Norwegian Escape, which is set to debut this fall out of PortMiami. Caption The ships of Port Canaveral Port Canaveral Caption Six ships at Port Canaveral Port Canaveral Port Canaveral had a landmark day on Sunday, Feb. 15, 2015 with six cruise ships in port at the same time, four based at the port and two making ports of call stops. The ships pictured are the Royal Caribbean Freedom of the Seas, Grandeur of the Seas and Quantum of the Seas, Disney Magic and Carnival Liberty and Sunshine. Port Canaveral had a landmark day on Sunday, Feb. 15, 2015 with six cruise ships in port at the same time, four based at the port and two making ports of call stops. The ships pictured are the Royal Caribbean Freedom of the Seas, Grandeur of the Seas and Quantum of the Seas, Disney Magic and Carnival Liberty and Sunshine. (Port Canaveral) See more galleries \nEpic's presence at Port Canaveral, though, will more than double the line's capacity there from the 2,018-passenger Spirit. It's also a modern upgrade from Spirit, which was built in 1996. Epic is a unique ship that was the first to offer a significant number of staterooms for solo travelers. The 1,081-foot ship features a multi-slide water park, 20 dining options, spa, bowling alley and will debut a Broadway show production this fall for \"Priscilla Queen of the Desert.\" 8 \n\"Epic's a fabulous ship. I think it's an honor to have that ship,\" said Carolyn Spencer Brown, editor-in-chief of CruiseCritic.com. \"It's got enough space for everyone. It's got a great upbeat vibe to it and people just walk around on it looking happy.\" \nEpic, which sailed its first four years out of Miami, now sails Europe year-round, but will give up those responsibilities to Spirit, which had been slated to return to Port Canaveral for a second winter season. \nEpic will offer three-, four-, six- and seven-night options to both the eastern and western Caribbean and the Bahamas. The eastern Caribbean itinerary will feature tops in Tortola, British Virgin Islands and St. Thomas, U.S. Virgin Islands as well as the line's private island in the Bahamas, Great Stirrup Cay. The western Caribbean itinerary has stops in Cozumel, Mexico, George Town, Grand Cayman, Ocho Rios, Jamaica and Great Stirrup Cay. In January and March 2017, Epic will take on three- and four-night Bahamas cruises with stops in Nassau and Great Stirrup Cay. \nEpic is the latest big ship to call Port Canaveral home, joining 5,400-passenger Oasis of the Seas, which will also debut in November 2016. Those two will be the biggest at the port, but will berth alongside sizable ships like Carnival Cruise Line's Magic and Sunshine and Disney Cruise Line's Dream and Fantasy. 0 \n\"As a regular port of call for NCL ships, we are thrilled to have the opportunity to home port the Norwegian Epic and welcome NCL guests into our community,\" said Port Canaveral CEO John E. Walsh in a press release. \"Our focus is to continue to provide the best customer service and facilities for our business partners and their passengers. Our efforts are being rewarded with the largest ships afloat and more itineraries from Port Canaveral.\" \nThe Epic announcement comes alongside Norwegian Cruise Line's plans to increase their role in Asia and Australia. The line will return to the Far East for the first time since 2002 with Norwegian Star, which will also visit India and the Middle East's Gulf region for the first time. \nAs part of the shuffle, Norwegian Jade will replace Norwegian Star out of the port of Tampa beginning November 2016, sailing seven-night western Caribbean cruises through April 2017 in addition to two eight-night holiday cruises and four 10- or 11-night eastern Caribbean cruises, marking the first time the line has offered cruises of that length from Tampa. \nAlso sailing to and from Florida will be two additional 14-night Panama Canal cruises between Miami and Los Angeles in February 2017 on Norwegian Jewel. \nNorwegian's plans call for the new Escape to sail year-round from Miami along with Getaway, which debuted in 2014 while 2013's Breakaway remains based in New York. Epic's return will have the line's four latest ships dedicated to year-round Caribbean sailings. \n\"I think having Norwegian Epic moving to Port Canaveral is a major win, not just for Port Canaveral, but also for cruise travelers,\" said Spencer Brown. \"It gives people who already like to base their cruises out of the port more variety in terms of cruise experience, but also Port Canaveral is really a great located port...People know Disney, but there's so much more to explore and to do and to encourage cruisers to come in early or stay late. It's a really well designed port in itself.\"", "external_links": [], "published": "2015-08-03T19:33:00.000+03:00", "crawled": "2015-08-03T20:06:17.856+03:00", "highlightTitle": ""}