{"organizations": [], "uuid": "4761ed3c31d2834119c2e8e1feff07d35fb9a511", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/5/k/n/l/image.related.StuffLandscapeSixteenByNine.620x349.165klp.png/1438637588388.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/cruising/70803853/Regal-Princess-A-grand-production-at-sea", "country": "AU", "title": "Regal Princess: A grand production at sea", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Regal Princess: A grand production at sea", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T00:33:00.000+03:00", "replies_count": 0, "uuid": "4761ed3c31d2834119c2e8e1feff07d35fb9a511"}, "author": "Sally Macmillan", "url": "http://www.stuff.co.nz/travel/cruising/70803853/Regal-Princess-A-grand-production-at-sea", "ord_in_thread": 0, "title": "Regal Princess: A grand production at sea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Regal Princess: A grand production at sea SALLY MACMILLAN Last updated 09:33, August 4 2015 \nA scene from Fiera! The show is performed three times in one night. \nThe audience in Regal Princess's elegant theatre is rapt. Fiera! , a high-energy show is in full swing – elaborately costumed performers sing hits by Lady Gaga, Michael Jackson and Guns N Roses and dance their way through a classic love story set in a fairground. There are plenty of laughs when the male dancers appear dressed as competing stage mothers and emotional applause when the female lead sings the power ballad Listen . \nAt the end of the show, when the lovers are whisked into the sky on the ferris wheel (in a clever use of the huge LED-screen backdrop), there's a standing ovation. \nTaking their bows on stage are four elated singers (two men, two women) and 13 dancers (six men, seven women). They perform the 43-minute show three times on one night of each cruise (as well as another musical, Bravo , and mini-shows in the Piazza) – but there's also a dedicated team working behind the scenes like a well-oiled machine to make it all happen. \nOn a recent cruise on Regal Princess, Princess Cruises' glittering new ship, we went backstage to meet the team and the person responsible for bringing us all the onboard entertainment. Kerry Lovegrove, a former dancer from the UK who has worked with Princess for 25 years, is the manager of show productions. She spends about half her life at Princess's LA head office, developing new shows, then travels on the ships to carry out quality checks when a new show is being premiered. \nShe clearly loves her job. While singers and dancers bustled in and out of the surprisingly small backstage area, she revealed some of the amazing logistics involved in creating Fiera! . \n\"All the Princess shows are conceived and created 'in house' at our headquarters in Los Angeles,\" says Kerry. \" Fiera! , which is exclusive to Regal Princess, cost about $1.37 million and was developed during late 2013 and into 2014.\" \nA scene from Fiera! \nTop showbiz experts were hired to produce the show, including American Idol director and choreographer Danny Teeson; Nelson Kole, musical arranger for the Academy Awards, Beyonce and Queen Latifah; and lighting designer Mark Foffano, who works with stars such as Billy Joel, Elton John and Harry Connick Jr. \nRecruiting the cast and crew is the next step – aspiring performers will be happy to hear that cruise lines are always on the lookout for talent. \"We audition all around the world for cast members and once selected, they join LA rehearsals as a team and start and end their contract as a team together,\" Kerry explains. \"The production crew is also selected from around the world via our recruitment manning agencies and are interviewed by our shore-side technical management team. As we have 18 ships that need to be manned 24/7, we recruit constantly.\" Ad Feedback \nAll up, there are 30 men and women in the full team of cast and crew. After eight days of rehearsals in the LA studio, it's time to get the show on the ship. The singers and dancers sign up for a six-month contract while stage crew are generally on board for nine months. It's very different to working in theatres ashore, as Australian dancer Sally Egan explains. \n\"For a start, the stage moves – sometimes you jump and the stage comes up to meet you, so you don't get off the floor and then other times you end up with plenty of hang time! Also, our theatres are completely state of the art and are often more advanced than theatres on land. In a show on, say, Broadway you perform the same show eight times a week. With Princess, we get to do different shows every night and we are featured more in each of them than dancers are typically on land.\" Safety is a major concern and when a new cast arrives they are taken through the show scene by scene so that everyone is fully aware of the automated scenery and props. The production crew checks the rig and technical elements after building the sets and the cast rehearses the entire 43-minute show before performing it three times on one night. It then takes the production crew about half an hour to reset the pyrotechnics between every show. \nThe state of the art Regal Princess theatre. \nBecause they're at sea, the company performance manager can't call on a stand-in to come on at the last minute if a cast member is injured or becomes sick. This means all cast members have to be pretty versatile – designated \"covers\" rehearse different parts and can jump in to ensure the show will always go on. Kerry adds, \"Dancing on stage during heavier weather takes some getting used to, so we may have to adjust complicated partnering sequences. It's actually harder for the dancers to stand still at such times than move around.\" \nOther aspects of staging shows on a cruise ship include being \"100 per cent prepared with every production requirement you can think of. Extra costume material, extra screwdrivers, nuts, bolts, dance shoes, wigs, false eyelashes, hangers, lighting and audio equipment, as it's not possible when things break to go to a store and get a quick replacement\". \nStorage space for costumes and props is at a premium; 840 costumes hang on spiralling railings in the dressing room and scenic pieces can be re-used (once they've been suitably disguised) in different shows. The introduction of LED screens for changing backdrops has revolutionised production shows. \nThe Regal Princess cruise ship. \nWhat's it like living and working on a ship for half a year? \nSally Egan says: \"We live so close to the dressing room that it is possible to nip back to your cabin mid-quick change if we have forgotten something. One time I ran home dressed half as a Greek goddess and half as a Samba dancer and I got some weird looks from people in the corridor.\" \nShe has worked as a dancer with Princess Cruises for four years and says dancing has always been her passion. \"This job allows me to do the thing I love most, every night, while being paid and seeing the world. What more could I want?\" She spends her \"down time\" studying nutritional medicine by distance learning, working part-time in the internet cafe and working out in the gym. \"I'm not very good at just relaxing,\" she laughs. \nFellow Aussie dancer Matthew Pashley-Roland, whose mother and grandmother both ran dancing schools in Perth, has worked on seven Princess ships. He says highlights of his shipboard career include being part of the inaugural cast on both of the line's newest ships, Royal and Regal. \"The best thing for me is travelling the world and making friends and amazing memories.\" \nPrincess recently announced it will be working with Stephen Schwartz, three-time Oscar-winner and composer of Wicked , Pippin and Godspell , to develop four new musicals over the next few years. The first will celebrate Schwartz's lifelong fascination with magic. Called Magic to Do , the show will combine thrilling magic illusions with some of Schwartz's most famous songs and a brand new song written exclusively for Princess. It will debut on board Crown, Ruby and Emerald Princess later this year. \nMeanwhile, Princess Cruises continues to celebrate its 50th anniversary across its 18 ships throughout 2015 with a host of gala events. Next time you're on board, say hello to the hard-working performers when you see them around the ship – they're a sociable bunch who genuinely enjoy entertaining and meeting their audiences. \nFIVE MORE THINGS TO DO ONBOARD \nMOVIES Lie back on a lounger by the Fountain Pool on Deck 16, popcorn at hand, and take in a movie under the stars on the giant screen. Cosy fleece blankies are supplied when the sea breeze has a little chill in it. \nCHOCOLATE-TASTING Take a Chocolate Journey at a wine and chocolate pairing class at Vines wine bar, sample a wicked choccy cocktail at one of Regal Princess' many bars or join a chocolate-themed cooking demonstration hosted by a specialist pastry chef. \nSPA Indulge in a pampering treatment at the elegant Lotus Spa on Deck 5 or spend a relaxing hour or so in The Enclave. The Enclave's thermal suite comprises a hammam​, herbal steam room, sauna and a generously sized hydro-therapy pool. \nLEARN Dance classes, wine-tasting, singing, art history tours and courses about the ancient art of navigation are just a few of the enrichment activities on offer in the Scholarship@Sea program run on all Princess ships. \nKIDS' STUFF Children from three to 17 are entertained in age-appropriate clubs – Princess Pelicans (ages 3-7), Shockwaves (ages 8-12) and Remix (ages 13-17). Activities for teens include sports competitions, late-night movies, hip hop dance classes, \"mocktail\" parties, formal dinners and video game tournaments. \nTRIP NOTES \nMORE INFORMATION princess.com \nGETTING THERE Princess Cruises' 18 ships sail all over the world. Regal Princess is the newest ship in the fleet and cruises in Scandinavia and Northern Europe in the Northern summer and the Caribbean in winter. \nSTAYING THERE Fares for a six-day Western Caribbean round-trip cruise from Fort Lauderdale, Florida, calling at the Island of Roatan (Honduras), Belize City (Belize), and Island of Cozumel (Mexico) start from NZ$807.45, per person twin share, for an inside stateroom. \nDINING THERE Regal Princess has 17 restaurants and cafes, including three main dining rooms, Alfredo's, the Horizon Court buffet, International Cafe, Trident Grill and pub lunch at the Wheelhouse Bar, plus specialty (extra-charge) restaurants Chef's Table Lumiere, Crown Grill, Sabatini's, Vines wine bar and Ocean Terrace. \nThe writer travelled as a guest of Princess Cruises and British Airways", "external_links": [], "published": "2015-08-04T00:33:00.000+03:00", "crawled": "2015-08-04T10:27:59.269+03:00", "highlightTitle": ""}