{"organizations": ["NewsCorp", "News Corp Australia", "Qantas"], "uuid": "4192cc8085122415cc6fe02b73fcb703e4390131", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources2.news.com.au/images/2015/08/04/1227469/385310-476626d4-3a4f-11e5-b6c9-4599ee2e8c2e.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/trav_top_stories_288.xml", "section_title": "NEWS.com.au | Travel | Top Stories", "url": "http://www.news.com.au/travel/travel-updates/qantas-ceo-alan-joyce-tells-aviation-summit-of-his-worst-days-with-the-struggling-airline/story-e6frfq80-1227469385444?from=public_rss", "country": "IL", "title": "Qantas CEO recalls his ‘dog days’", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Qantas CEO recalls his ‘dog days’", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T05:04:00.000+03:00", "replies_count": 0, "uuid": "4192cc8085122415cc6fe02b73fcb703e4390131"}, "author": "", "url": "http://www.news.com.au/travel/travel-updates/qantas-ceo-alan-joyce-tells-aviation-summit-of-his-worst-days-with-the-struggling-airline/story-e6frfq80-1227469385444?from=public_rss", "ord_in_thread": 0, "title": "Qantas CEO recalls his ‘dog days’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alan Joyce"], "text": "Qantas CEO Alan Joyce tells aviation summit of his worst days with the struggling airline by: ROBYN IRONSIDE National Aviation Writer From: What are these? Long climb ... Alan Joyce, CEO of Qantas. Source: NewsCorp Source: News Corp Australia \nGROUNDING the Qantas fleet to break a costly deadlock with unions was not Alan Joyce’s worst moment with the airline. \nThat came more than two years later, when the Flying Kangaroo was struggling financially and calls for his resignation had reached fever pitch. \n“I was doing an interview on (morning television show) Sunrise and they were asking me to react to a poll showing 90 per cent of people wanted me to resign,” he told the CAPA Aviation Summit. \nThen it got worse. \n“Somebody was walking two dogs and let them off the lead. They were two Jack Russells. I hate Jack Russells,” said Mr Joyce. \n“I was a paperboy (growing up in Ireland) and Jack Russells were the worst. Irish wolfhounds, no problem. \n“That was my lowest point.” Flying high ... Qantas CEO Alan Joyce, at right, and Doug Parker (American Airlines chairman and CEO). Picture: Supplied Source: Supplied \nMr Joyce said he never entertained thoughts of leaving of Qantas in the lead up to the airline’s worst result on record — last year’s $2.8 billion loss. \nSince then Qantas has staged a remarkable comeback to be on track for what’s expected to be a $950 million profit for 2014-15. \nHe said chairman Leigh Clifford and the board of directors had supported him throughout, and had complete confidence in the transformation program. \n“I love this job, I love working for Qantas, I think it’s the most amazing brand and airline in the world,” he said. \nMr Joyce said Qantas’s diversification, launching its own advertising agency, Red Planet, and travel card product, would help ensure its future by making it less reliant on the cyclic nature of the aviation industry. Market penetration ... Alan Joyce at the Post Budget address to the National Press Club in Parliament House in Canberra earlier this year. Source: Gary Ramage Source: News Corp Australia \nHe said the group had now amassed 27-years of information about its customers through its Frequent Flyer program. More than 11 million people are now signed up to the program, almost half Australia’s population. \n“That’s a huge penetration in this market, we also have a very trusted brand,” Mr Joyce said. \nHis one concern related to “governments applying the rules differently”, in particular in relation to the Jetstar Hong Kong decision. \nIn that case, the airline was found to now meet the rules of ownership applied by Hong Kong. \n“If those same rules were applied to Cathay Pacific, they wouldn’t be allowed to operate out of Hong Kong,” Mr Joyce said. \n“Nor would Hong Kong Express. If those rules were applied in Australia, Virgin and Tigerair would not be allowed to operate.”", "external_links": [], "published": "2015-08-04T05:04:00.000+03:00", "crawled": "2015-08-04T11:29:50.026+03:00", "highlightTitle": ""}