{"organizations": [], "uuid": "532ba3f8cac59a02f0ea3ebb4da331aa771c45c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29845576/michelin-agriculture-receives-best-supplier-award-from-cnh-industrial", "country": "US", "title": "Michelin Agriculture Receives 'Best Supplier' Award from CNH Industrial", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Michelin Agriculture Receives 'Best Supplier' Award from CNH Industrial - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "532ba3f8cac59a02f0ea3ebb4da331aa771c45c9"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29845576/michelin-agriculture-receives-best-supplier-award-from-cnh-industrial", "ord_in_thread": 0, "title": "Michelin Agriculture Receives 'Best Supplier' Award from CNH Industrial", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Michelin\nGREENVILLE, S.C. , Aug. 20, 2015 /PRNewswire/ -- Michelin Agriculture has earned the 2015 \"Best Supplier Award,\" a prestigious recognition from CNH Industrial, a global leader in the areas of agricultural machinery, construction equipment, commercial vehicles and powertrain technology. Michelin is the first tire manufacturer to receive the award.\nCNH Industrial evaluates its major suppliers through key performance criteria such as relationship, quality, supply chain and reliability. The program promotes continuous and mutual improvement to reinforce sustainable partnership.\n\"Michelin Agriculture teams are proud to receive this recognition. It is the result of a strong collaboration with our partner CNH Industrial,\" said Emmanuel Ladent, group director of Michelin's agriculture division, who accepted the award in a recent ceremony. \"We take care to focus our energy and know-how on our customer. The trust reflected by CNH Industrial through this award is an honor for all of us.\"\nNew Holland Agriculture, a CNH Industrial brand, chose MICHELIN ® tires with Ultraflex technologies, to fit its agricultural machines exhibited at EXPO Milano 2015 as well as at the Energy Independent farm \"La Bellota\" in Italy .\nThe 2015 award was a result of \"active demand management,\" a process launched by Michelin Agriculture, to increase its capacity to integrate the customer needs at the heart of the supply chain process. The award also recognized Michelin's support to grow in new markets, its best-in-class agricultural products like MICHELIN ® Ultraflex tires and a strong and long-term relationship between the two companies to meet the agricultural challenges of farmers.\nFor more information on Michelin Ultraflex tires, visit www.MichelinAg.com or contact your local Michelin Agriculture Tire dealer.\nAbout CNH INDUSTRIAL\nCNH Industrial designs, produces and sells 'machines for work', which cover everything from tractors and combines, excavators, wheel loaders, trucks, buses, firefighting and civil protection vehicles to powertrain solutions for on and off road and marine engines. Across its 12 brands, 64 manufacturing plants, 49 research and development centers and a workforce of more than 69,000 people, CNH Industrial is present in 190 countries giving it a unique competitive position.\nAbout Michelin\nDedicated to the improvement of sustainable mobility, Michelin designs, manufactures and sells tires for every type of vehicle, including airplanes, automobiles, bicycles, earthmovers, farm equipment, heavy-duty trucks and motorcycles. The company also publishes travel guides, hotel and restaurant guides, maps and road atlases. Headquartered in Greenville, S.C. , Michelin North America ( www.michelinman.com ) employs more than 22,750 and operates 20 major manufacturing plants.\nPhoto - http://photos.prnewswire.com/prnh/20150820/260005\nLogo - http://photos.prnewswire.com/prnh/20040818/MICHELIN\n releases/michelin-agriculture-receives-best-supplier-award-from-cnh-industrial-300131494.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20150820/260005", "https://photos.prnewswire.com/prnvar/20150820/260005", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/michelin-agriculture-receives-best-supplier-award-from-cnh-industrial-300131494.html", "http://www.michelinman.com/", "http://photos.prnewswire.com/prnh/20040818/MICHELIN", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL84021&Transmission_Id=201508201630PR_NEWS_USPR_____CL84021&DateId=20150820", "http://www.michelinag.com/", "http://photos.prnewswire.com/prnvar/20040818/MICHELIN"], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-21T05:00:33.686+03:00", "highlightTitle": ""}