{"organizations": [], "uuid": "301a3409a2636c7f79c107cf18eb8d4d8d094cae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62806/bangkok-airways-and-air-astana-announce-codeshare-agreement", "country": "US", "title": "Bangkok Airways and Air Astana announce codeshare agreement", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Bangkok Airways and Air Astana announce codeshare agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T05:14:00.000+03:00", "replies_count": 0, "uuid": "301a3409a2636c7f79c107cf18eb8d4d8d094cae"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62806/bangkok-airways-and-air-astana-announce-codeshare-agreement", "ord_in_thread": 0, "title": "Bangkok Airways and Air Astana announce codeshare agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bangkok Airways and Air Astana announce codeshare agreement   \nAug 20, 2015 eTN   \nBANGKOK, Thailand - Bangkok Airways recently announced a new codeshare agreement with the Republic of Kazakhstan-based Air Astana (KC), increasing its code share partners to 19. The partnership is set to link Air Astana’s passengers with Thailand most renowned beach destinations. \nThe new partnership will seamlessly enable passengers of Air Astana to connect with world-class tourist destinations namely Samui, Phuket and Krabi. \nSince August 17, Air Astana customers are able to book these codeshare services at Air Astana’s ticket office and vice versa. \nBangkok Airways’ Senior Vice President Network Management, Peter Wiesner, said: “This new codeshare agreement with Air Astana is yet another important milestone and an exciting development in the continued growth of Bangkok Airways. It allows us to give Air Astana’s customers convenient, seamless access to Thailand’s popular destinations through this partnership.” \n“Air Astana’s President Peter Foster: “Bangkok Airways has grown to become a highly respected Asian carrier with a comprehensive network throughout the region, and they have deservedly excellent reputation for service. As a similarly high quality airline Air Astana is delighted with a codeshare agreement, which will significantly enhance the links between our two regions.” \nAir Astana customers travelling on Bangkok Airways will enjoy the boutique airline’s unparalleled services including check-through service, lounge access, in-flight meal. All Air Astana’s passengers on Bangkok Airways flights will receive boarding passes on check-in at their first international departure point for connecting international services. \nBangkok Airways serves 11 destinations throughout its Thailand home plus a further 13 destinations in neighbouring countries including Bangladesh, Cambodia, Hong Kong, India, Laos, Malaysia, the Maldives, Myanmar and Singapore. \nCurrently, Bangkok Airways has a total of 29 aircrafts; 10 of turbo-prop ATR72-500/600s, 19 of Airbus A319s/A320s.", "external_links": [], "published": "2015-08-20T05:14:00.000+03:00", "crawled": "2015-08-20T04:48:57.163+03:00", "highlightTitle": ""}