{"organizations": [], "uuid": "5598c32ca59e056c8bde6fbc40a5b87ee972c174", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25621", "country": "", "title": "Red Planet ready for major expansion after rebranding efforts", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "Red Planet ready for major expansion after rebranding efforts", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "5598c32ca59e056c8bde6fbc40a5b87ee972c174"}, "author": "Mimi Hudoyo, Jakarta, August 6, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25621", "ord_in_thread": 0, "title": "Red Planet ready for major expansion after rebranding efforts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Red Planet ready for major expansion after rebranding efforts Mimi Hudoyo, Jakarta, August 6, 2015 \nRED Planet Hotels is planning to expand its portfolio in Jakarta, Bangkok and Tokyo after last month’s rebranding of its 24 properties from Tune Hotels into Red Planet hotels. \n\nIn Indonesia, Red Planet, which now has seven hotels across Pekanbaru, Palembang, Jakarta, Bekasi, Solo, Surabaya, and Makassar, is aiming to add another 20 properties in the capital city, with three expected to begin construction by end-2015. \n\nSuwito Ng, president director of Red Planet Indonesia, said: “Based on our experience, Jakarta and its greater area (Bekasi included) are the top performers, followed by Palembang. \n\n“It shows that economy hotels can grow and be more profitable in big cities, especially the capital city. With our head office located in Jakarta, it is more efficient to operate properties here, than say, having one hotel in Kalimantan.” \n\nEach Red Planet hotel will have 100 to 150 rooms. \n\n“So, 20 hotels will provide some 3,000 rooms and that is equivalent to two or three five-star properties,” Suwito said. \n\nOn the regional front, Mark Reinecke, director of Red Planet Indonesia, said Indonesia, the Philippines, Thailand and Japan \"will be our main focus, with Indonesia and the Philippines having the biggest number (of properties)\". \n\n\"Bangkok is a very competitive market so we will be very careful there. Japan is a great market but it takes a bit of time to find the right opportunity because the price of acquisition is much higher. In Japan we will be doing retrofits, we (will) find old hotels and renovate. That is the best model for Japan,” said Reinecke. \n\nTo penetrate new markets, Red Planet’s strategy is to pick a country where there are opportunities to open between six and 10 hotels. South Korea and Taiwan are on the company's radar, with hotel developments aimed at capital cities.", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T09:11:20.755+03:00", "highlightTitle": ""}