{"organizations": ["Hindustan Times"], "uuid": "2debf4e74452ed920a0921a51218f1ecac25c1c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/09d1edd3-cf8b-49e1-8ae8-cf157ab4b4e5MediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Books\r", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/books/book-review-myth-folk-lore-and-occult-marks-the-devourers/article1-1380366.aspx", "country": "IN", "title": "Book review: Myth, folk lore and occult marks The Devourers", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Book review: Myth, folk lore and occult marks The Devourers", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T10:41:00.000+03:00", "replies_count": 0, "uuid": "2debf4e74452ed920a0921a51218f1ecac25c1c1"}, "author": "", "url": "http://www.hindustantimes.com/books/book-review-myth-folk-lore-and-occult-marks-the-devourers/article1-1380366.aspx", "ord_in_thread": 0, "title": "Book review: Myth, folk lore and occult marks The Devourers", "locations": ["New Delhi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kanika Sharma"], "text": "Kanika Sharma, Hindustan Times , New Delhi | Updated: Aug 15, 2015 14:27 IST Rock trivia: Ozzy Osbourne dressed as a werewolf for the cover of his album ‘Bark at the Moon’ in September 1983 (Gettyimages) \nOn a subcontinent rife with epics and folk tales, it's strange that speculative fiction finds so few takers. The Devourers is a welcome addition, then, to this fledgling genre in India. Bringing mythical creatures and 'ancient' scrolls to life, Indra Das grips you from the start of his debut novel, creating a credible alternative world based loosely on epic and folk tale, one in which werewolves mix with humans on full-moon nights and attend Baul performances in present-day Kolkata. The plot progresses as Alok Mukherjee, a young history professor, helps 'half-werewolf' Izrail transcribe a set of ancient scrolls. Encased in real-world locations such as Kolkata's Oly Pub and Maddox Square, the novel is told in first-person, in the voice of Alok first, then the werewolf Fenrir, who is Izrail's father and the author of the scrolls, and finally in the voice of Izrail's mother, Cyrah, a human prostitute. In this world of the werewolves' and half-werewolves' time operates differently, and humans are fuel. The desires and memories of the prey pulsate within the minds of the predator, creating a beautiful rendering of a macabre and complex relationship. When Izrail says to Alok: \"And here we stand, long before India, before its empires and kingdoms. There were human tribes who identified with dogs and wolves, with wild animals. And there were, and still are, tribes who are not human, who identify with humans in similar ways. Who take the shape of humans, just as humans took the shape of animals by wearing skins\", you believe him. There are times, though, in the initial pages, when the trance doesn't work on the reader. Alok's reactions to Izrail are confusing as he switches, at random, from fear to empathy. Initially, the disbelief of meeting a half-werewolf is laced with trepidation, which is soon unreasonably abandoned. Eschatology and sexuality gain fluidity beyond human dimensions; piss marks terrain and copulation is a play of power and bonding but never procreation. There are still rules that cannot be broken, and Fenrir becomes an exile after breaking a fundamental one: that of having sex with a human. These werewolves are born when a young human's soul is cleaved in two, creating a shapeshifter forever banned from the world of humans. Das's reflection of the predator-prey relationship in his portrayals of violence and sexuality between humans and werewolves is evocative and the frisson is reflected in the narrative of Cyrah, which challenges Fenrir's. There follows an epic quest, set against the backdrop of the Mughal empire building and rebuilding itself through the 17th century, wending its way through capitals, leaving the grand Fatehpur Sikri an abandoned ghost town. Interwoven also is the 'history' of werewolves, with Das drawing on folklore from across Europe, Asia and the Middle-East. Yet, as soon as the onus of taking the story forward falls solely on Izrail and Alok, who embark on a trip to Sunderbans, the book loses steam. The overarching themes of devouring and of a world that throbs with the desire to love need more etching and grounding. Das's imagination is captivating and yields a world that sparkles and surprises. In the end though, it needs greater force to be truly compelling. Tags", "external_links": [], "published": "2015-08-15T10:41:00.000+03:00", "crawled": "2015-08-15T13:58:10.130+03:00", "highlightTitle": ""}