{"organizations": [], "uuid": "a82fbd2832ea25d038c7cd9ce21773065ba8ab84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/unnamed-2.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/rickshaw-run-august-2015-shillong-meghalaya-kochi-keral/", "country": "US", "title": "Rickshaw Run August 2015 Shillong, Meghalaya – Kochi, KeralTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Rickshaw Run August 2015 Shillong, Meghalaya – Kochi, KeralTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "a82fbd2832ea25d038c7cd9ce21773065ba8ab84"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/rickshaw-run-august-2015-shillong-meghalaya-kochi-keral/", "ord_in_thread": 0, "title": "Rickshaw Run August 2015 Shillong, Meghalaya – Kochi, KeralTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rickshaw Run August 2015 Shillong, Meghalaya – Kochi, Keral Published on : Sunday, August 2, 2015\nIt is time yet again for the Rickshaw Run to hit the road. Organised by UK company The League of Adventurists since 2006, the Rickshaw Run is the largest three-wheeler event on the planet.\nThe brave participants from around the world are now gathering in Shillong. They are about to embark on an epic journey to Kochi, in the deep south of the country. The teams have no set route, no back up along the way, and are truly on their own.\nEvent Manager Matthew Dickens, maintains a stiff British upper lip through the frenzy of activity in Shillong where 83 teams are prepping and pimping their rickshaws in anticipation of the grand launch on Wednesday 5th August. The participants representing 23 countries shall be riding, rolling and wiggling their way across the subcontinent in their tinny steeds covering approximately 5000kms on their way to Kochi. What makes this journey even more memorable and noble is the fact that each team raises £1000 for charity – with at least half of this going towards the official rainforest preservation charity – Cool Earth.\nThe League of Adventurists International, based in Bristol, are at the helm of many similar events around the world: “This event certainly has a lighter side, but the important message is clear…We plan to introduce our participants to the real India – this is not a typical package holiday. When the teams are lost, stuck and all hope seems futile, Mother India and the heart-warming generosity of the Indian people shall envelope them in a fondness that many would not have encountered before. We also like to bring attention to the beauty of lesser travelled places such as Shillong and Kochi. Needless to say we’re thrilled to be raising an awfully large amount of money for worthy charities across the nation too. The Rickshaw Run has now raised well over £2,000,000 (around $3.1 million) – which is a huge boost to the good work that these charities and our official charity Cool Earth are doing. In fact, each Rickshaw Run raises enough money for Cool Earth to save 150,000 trees in some of the most endangered rainforest in the world.”\nThe Rickshaw Run has now been coming to Shillong for five years. Mr Dickens goes on to say: “Meghalaya is a real gem in the North East. I hope many of our participants are able to travel to some of the more remote areas of the state, as the scenery is simply out of this world.”\nKochi is the birthplace of the Rickshaw Run and is therefore very dear to the event. With its charming and quaint streets it makes an ideal finish line, where the teams can relax – if they manage to complete the journey it that is.\nFor many of the participants it will be many firsts – whether it’s travelling to India, driving a rickshaw or just experiencing the enthusiasm and love that the people of this country are so famous for.", "external_links": [], "published": "2015-08-02T03:00:00.000+03:00", "crawled": "2015-08-02T07:50:28.678+03:00", "highlightTitle": ""}