{"organizations": [], "uuid": "236822aaae0132afe58412c97966a1fbcbb945dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297739114506_LARGE_BOX.jpg?quality=80&stmp=1440204538134&size=100x", "site_section": "http://www.torontosun.com/travel/archives", "section_title": "Travel | August 2015 | Toronto Sun", "url": "http://www.torontosun.com/2015/08/20/banksys-dismaland-is-escape-from-mindless-escapism", "country": "CA", "title": "Banksy's \"Dismaland\" is \"escape from mindless escapism\" | Europe | Travel | Toro", "performance_score": 0, "site": "torontosun.com", "participants_count": 14, "title_full": "Banksy's \"Dismaland\" is \"escape from mindless escapism\" | Europe | Travel | Toro", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T02:31:00.000+03:00", "replies_count": 13, "uuid": "13c58f3a0fe7f10736ae5018cde75e00d5afb9a2"}, "author": "Paul Sandle, Reuters", "url": "http://www.torontosun.com/2015/08/20/banksys-dismaland-is-escape-from-mindless-escapism#post-0", "ord_in_thread": 0, "title": "Banksy's \"Dismaland\" is \"escape from mindless escapism\" | Europe | Travel | Toro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WESTON-SUPER-MARE - Britain's newest theme park, \"Dismaland\", opens on Friday, with a decrepit castle, a merry-go-round horse set to be cooked and model boats on a pool full of refugees, all courtesy of British street artist Banksy.\nThe \"Bemusement Park\" in Weston-super-Mare, an English seaside town near Banksy's home city of Bristol, is tagged as \"The UK's most disappointing new visitor attraction!\" and features work by other artists including Damien Hirst.\nThe secretive Banksy, famed for his ironic murals in unexpected places, said the show was something different as his street art had become \"just as reassuringly white, middle class and lacking in women as any other art movement\".\nVisitors to the event, put on in a disused swimming pool, can have a souvenir photo taken in Cinderella's Castle against a backdrop of a dead princess in a coach crash, while surly stewards carry bunches of balloons labelled \"I'm an imbecile\".\nBanksy, whose identity has never been revealed, described it as \"a festival of art, amusements and entry-level anarchism\".\n\"It's not a swipe at Disney,\" he said in a press release. \"I banned any imagery of Mickey Mouse from the site. It's a showcase for the best line-up of artists I could imagine, apart from the two who turned me down.\"\nThe site, whose signage bares more than a passing resemblance to Disneyland, is full of the artist's subversive statements and epigrams on Western culture, the media, capitalism and extreme disparities of wealth.\nA model pensioner is engulfed in seagulls, a reference to a media panic about how aggressive birds had become this summer, while the merry-go-round horse, destined to become lasagne, harks back to a food scandal sparked by the presence of horsemeat in supermarket ready meals.\nBanksy's works, which have been stencilled on locations ranging from London and New York to the West Bank and Gaza, have become highly sought after in the art world he satirises.\nCollectors, who include pop star Christina Aguilera and actor Brad Pitt, have paid as much as $500,000 for pieces of his work.\nLocal authorities, which routinely painted over his graffiti a decade ago, also now recognise the value.\nThe local North Somerset Council said it was right behind \"Dismaland\", mindful of a show in nearby Bristol that attracted more than 300,000 fans from around the world in 2009.\n\"We were absolutely delighted to have the biggest drawing name in art here,\" council leader Nigel Ashton told Reuters at a press preview.\nAshton, who is a member of Britain's ruling Conservatives, was not put off by any anti-authority theme. \"There's nothing wrong with asking provocative questions,\" he said.\nBanksy, who reportedly grew up in Bristol and started daubing buildings in the early '90s, could not be obviously spotted at the press launch.\n\"I guess it's a theme park whose big theme is - theme parks should have bigger themes,\" he said in a statement.\nThe stewards, wearing a combination of Mickey Mouse-style ears, high-visibility jackets and bored expressions, were tight lipped about the mystery man.\n\"Welcome to Dismaland\" and \"Enjoy\" was all they would utter, competing with each other in levels of insincerity.\nWhile not quite \"The happiest place on earth\", \"Dismaland\" is generating a buzz in the resort and a lot of excitement from locals and Banksy fans worldwide.\n\"I've been curious all week,\" said Dana Winestone, 21, who works in a cafe on the seafront. \"I'm just excited, it will be the best exhibition out there.\"\n\"Dismaland\" is open to locals on Friday, and the general public from Saturday, until Sept. 27 at the low entry price of 3 pounds ($4.70).\nPoll Interested in visiting? Yes Kind of Not really Nope Vote View Results\n0% Yes 0 votes\n0% Kind of 0 votes\n0% Not really 0 votes\n0% Nope 0 votes", "external_links": [], "published": "2015-08-21T02:31:00.000+03:00", "crawled": "2015-08-22T16:24:17.990+03:00", "highlightTitle": ""}