{"organizations": [], "uuid": "b935746a0641f8ed175548c5947053b89eaf636c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/TOK307-820_2015_114217_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/japan-bids-farewell-to-modernist-design-icon-as-hotel-okura-begins-pre-olympic-renovation-323398001.html", "country": "US", "title": "Japan bids farewell to modernist design icon as Hotel Okura begins pre-Olympic renovation", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Japan bids farewell to modernist design icon as Hotel Okura begins pre-Olympic renovation - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T04:26:00.000+03:00", "replies_count": 0, "uuid": "b935746a0641f8ed175548c5947053b89eaf636c"}, "author": "Elaine Kurtenbach, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/japan-bids-farewell-to-modernist-design-icon-as-hotel-okura-begins-pre-olympic-renovation-323398001.html", "ord_in_thread": 0, "title": "Japan bids farewell to modernist design icon as Hotel Okura begins pre-Olympic renovation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TOKYO - The Hotel Okura, a favoured Tokyo lodging for U.S. presidents, movie stars and other celebrities, is closing the doors of its landmark half-century-old main building on Monday to make way for a pair of glass towers ahead of the 2020 Olympics.\nThe redo raised an outcry from those who love the Okura's unique melange of modernism and traditional Japanese esthetics. But social media campaigns, a petition and other efforts to \"Save the Okura\" just underscored the futility of resisting Tokyo's floodtide of pre-Olympics urban renewal. Other major landmarks, such as the decades-old fish market in Tsukiji and the National Stadium also are being replaced over the protests of many who are sad to see them go.\n\nIn this Thursday, Aug. 20, 2015 photo, a visitor walks through a garden at Hotel Okura in Tokyo. The Hotel Okura, a favored Tokyo lodging for U.S. presidents, movie stars and other celebrities, is closing the doors of its iconic, half-century-old main building on Monday, Aug. 31, 2015, to make way for a pair of glass towers ahead of the 2020 Olympics. (AP Photo/Shizuo Kambayashi) \nAndrew Lindsay, a Deutsche Bank executive who took part in a \"Save the Okura\" Facebook campaign, spent hours exploring the hotel during his first visit to Tokyo in the 1990s. During his last visit, he sat in the lobby, with its round, red and black lacquer tables and chairs arrayed like plum blossoms, soaking it all in one last time.\n\"It had this hushed elegance about it,\" said Lindsay.\n\"The Mandarin Oriental, Peninsula, Raffles, some of the old hotels have been restored, but there's nothing quite like the Okura. It's the blend of Japanese esthetics with mid-century design you just don't find elsewhere,\" he said.\nBut enthusiasm for 1960s era design is less intense in Japan, where \"Mad Men\" doesn't resonate, than in the West.\nAnd in a city where much downtown real estate is still worth over $250,000 per square meter, the commercial imperative is inexorably skyward. The horizontal lines of the 11-story Okura main building, with its \"sea cucumber\" tiles, are dwarfed by nearby residential and office towers.\nDespite the appeal of the building's lavish furnishings and subtle lighting, it does not meet modern earthquake standards and is struggling to compete with newer luxury hotels, such as the recently opened Andaz, just down the street.\nThe Okura's management says a new structure is needed to keep the hotel one of Japan's best, and to retain its status as a mainstay for diplomacy and business dealing since the building opened in 1962, ahead of the 1964 Games.\nThen, it had \"state-of-the-art infrastructure, incorporating the most advanced electrical, communications and building technologies available,\" the company said in a statement.\nTakashi Hattori, executive director of the Okura's planning and promotion department, was born the year the Okura opened.\nSince he started working as a doorman decades ago, the hotel's lobby hasn't changed a bit, and he is glad of that.\n\"I think that's really great,\" Hattori said. Still, \"To be a top hotel and provide our guests the greatest service and safety, we need to rebuild.\"\nThe building is closing after a \"finale concert\" of chamber music that drew hundreds to its lobby, a spacious venue that has been the site of much deal-making over the years. The Okura is just across the street from the U.S. Embassy, and those involved say many high-level meetings were held there to elude the Japanese media.\nIt has been a \"home away from home\" for many American government officials, U.S. Defence Secretary Ash Carter said during a visit earlier this year.\n\"I've spent countless evenings in the Okura,\" he said, \"and will always have fond memories of it.\"\nWhile the vibe of the building to be razed is distinctly 1960s, much of its decor is meant to evoke the Zen-inspired crafts and elegance of ancient Japan, with tortoise-shell patterned lights, ornate latticework, and patterns of diamond, ginko leaf, bamboo, heron, wisteria and fish-scale inlaid in many of its walls and furniture.\nThe new buildings will preserve the traditional design elements and \"tranquility\" of the original and preserve, reinstall or replicate its designs and ornamentation to the extent it's legally and technically feasible, the management says.\n\"We view the lobby as a great asset, and to the extent that we can we hope to have it in our new building,\" said Hattori, the Okura executive.\nThe new structures are being designed by Yoshio Taniguchi, who is best known outside Japan for overseeing the expansion of the Museum of Modern Art in New York.\nHe also is the son of the architect who designed the Okura's main building, Yoshiro Taniguchi. The Harvard-trained younger Taniguchi's style is more minimalist than his father's, yet still distinctively Japanese.\nThe Okura's business has seen ups and downs over the 125 years since its founding in 1873 by Baron Kihachiro Okura, a weapons trader turned industrialist. Like many others, the Okura business empire was broken up by the American Occupation after Japan's defeat in World War II but nonetheless thrived in the postwar years until Okura & Co., its flagship and core business, went bust in 1998 in what was then Japan's third-biggest bankruptcy.\nUnder a 2001 restructuring, Tokyo-based Hotel Okura Co. retained the remaining assets of the group. Its Okura Hotels & Resorts operates 26 hotels in Japan and other parts of Asia as well as Hawaii and Amsterdam.\nDuring the demolition of the main building and construction of the new ones, many of the Okura's most popular restaurants and bars will operate from the hotel's 430-room South Wing, including Sazanka, said to be the grill where teppanyaki originated, its wine and cooking schools and its \"Go Salon.\"\nNot all of the hotel's traditional touches are subtle: Its reincarnation will still feature the hotel's famed ikebana floral display, centred in a hexagonal vase the size of a small car.\n___\nFollow Elaine Kurtenbach on Twitter at twitter.com/ekurtenbach\n ", "external_links": [], "published": "2015-08-31T04:26:00.000+03:00", "crawled": "2015-08-31T23:04:43.360+03:00", "highlightTitle": ""}