{"organizations": [], "uuid": "eb364f7f4f85be7ff12127fdad10d2c359cb01bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/29/17/2AF0452F00000578-0-image-a-190_1438189077204.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3178930/World-s-longest-helter-skelter-built-London-s-giant-Orbit-Tower-soon-Spring-2016.html", "country": "GB", "title": "London's Orbit Tower to get world's longest helter skelter", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 11, "title_full": "London's Orbit Tower to get world's longest helter skelter | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T01:26:00.000+03:00", "replies_count": 12, "uuid": "184d1eb30942af216f9edfa9f2ec8925d5a24249"}, "author": "Becky Pemberton For Mailonline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3178930/World-s-longest-helter-skelter-built-London-s-giant-Orbit-Tower-soon-Spring-2016.html#post-0", "ord_in_thread": 0, "title": "London's Orbit Tower to get world's longest helter skelter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "110 shares 16\nView\ncomments\nLondon's giant Orbit Tower will soon be transformed into the world's longest and tallest tunnel slide.\nPlans for the 584ft slide have been given the go-ahead and will see riders witnessing views across London as they sail down the 40-second ride.\nExpected to be open to the public in Spring 2016, it's hoped the impressive slide will increase visitor numbers to the Queen Elizabeth Olympic Park.\nScroll down for video\nLondon's giant Orbit Tower will soon be transformed into the world's longest dry helter skelter\nPlans for the 584ft slide have been given the go-ahead and will see riders witnessing views across London as they sail down the 40-second ride\nThe slide will be wrapped around the metal frame of the ArcelorMittal Orbit Tower with transparent panels revealing the view.\nRiders will loop around the red observational tower seven times, experiencing 13 twists, before it ends in a 164ft stretch.\nGuests who are afraid of heights may want to sit this one out, as the unique ride begins 249 feet above the ground.\nThose who dare to go down the slide will pay around £5 on top of the £10 entrance fee.\n Next No time to admire the view! Extreme parachute skiers... From THAT inflatable swan to giant floating pretzels and... Would you stay at the Titanic hotel? Now you can check into... Escape from the hungry hippos: Hapless impala nearly becomes... 110 shares Peter Tudor, Director of Visitor Services, Queen Elizabeth Olympic Park, said: 'What more exciting way to descend the ArcelorMittal Orbit than on the world's longest and tallest tunnel slide.\n'We are committed to ensuring our visitors have the best possible day out every time they visit Queen Elizabeth Olympic Park, and as with all our venues, we are constantly exploring ways to ensure we lead the way with the latest visitor experience.\n'This slide really will give a different perspective of Britain's tallest sculpture.'\nExpected to be open to the public in Spring 2016, the impressive slide is hoped to increase visitor numbers to the Queen Elizabeth Olympic Park\nThe Olympic Park has been left empty since 2012 Olympics The Orbit Tower opened on April 5, 2014 and was described by ArcelorMittal as being 'part sculpture, part observation tower, complete triumph.'\nIt was constructed from 2000 tonnes of steel, 35,000 bolts and 19,000 litres of paint, and at 375 feet high, is the tallest sculpture in the UK.\nIts location provides guests with views that look east into London - rather than from the centre outwards, enabling visitors to see landscapes of up to 20 miles in each direction.\nSince the Olympic Games only 300,000 people have paid to ascend the tower and numbers are expected to be boosted with the arrival of the slide, which is estimated to cost just under £1million.", "external_links": ["http://dailym.ai/1fHQVru"], "published": "2015-07-30T01:26:00.000+03:00", "crawled": "2015-08-07T03:02:26.000+03:00", "highlightTitle": ""}