{"organizations": [], "uuid": "80dd1f6b456c0b67ac86540a88ba877948540695", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/image003-2.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tourism-malaysia-hosts-product-update-presentation-in-south-india/", "country": "US", "title": "Tourism Malaysia hosts product update presentation in South India - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Tourism Malaysia hosts product update presentation in South India - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "80dd1f6b456c0b67ac86540a88ba877948540695"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tourism-malaysia-hosts-product-update-presentation-in-south-india/", "ord_in_thread": 0, "title": "Tourism Malaysia hosts product update presentation in South India - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tourism Malaysia hosts product update presentation in South India Published on : Wednesday, August 19, 2015\nMalaysia Tourism Promotion Board, Chennai and Malindo Air invited Travel Agents and Tour Operators from Coimbatore known as Kovai for the product update presentation of Tourism Malaysia in line with the celebration of the Malaysia Year of Festivals 2015 and announcement of new route by Malindo Air from Trivandrum to Kuala Lumpur effective 24 August 2015. Trivandrum is the 6th destination in India and 2nd in Kerala for Malindo Air. Malindo Air being a hybrid carrier offers fares which are inclusive of 30kgs check-in baggage, 7 kgs cabin baggage, onboard refreshments and personalized in-flight entertainment onboard.\nAccording to Noor Azman Samsudin, Director of Tourism Malaysia in Chennai said, “It’s great news that Malindo Air will be starting direct flights from Trivandrum to Kuala Lumpur. Malaysia has a lot to offer as a travel destination with the multi-cultural background, variety of cuisines and year- long shopping. Kuala Lumpur is home to the world-famous Petronas Twin Towers at the city-centre filled with skyscrapers which will leave you in awe. With this added connectivity, we are sure of getting more tourists from this sector to join us in the year-long festivities of MYFest 2015.”\nThe Event was marked with excitement as active interaction took place and prizes given during the Question & Answer Session. The country’s biggest shopping extravaganza –– the annual 1Malaysia Mega Sale Carnival and 1Malaysia Unified Sale was highlighted which offers big bargains, huge discounts and fun-filled promotional activities put together by malls, retail stalls and other participating trades throughout Malaysia. This would go on with the Malaysia Year End sale until January next year.\nMyFest 2015 is expected to help Malaysia achieve the targeted 29.4 million tourist arrivals and RM89 billion in tourist receipts for 2015.", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-19T15:26:55.394+03:00", "highlightTitle": ""}