{"organizations": [], "uuid": "f2b3e56ddedc2396bd648f6801921b600282e39c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/1a2d8355-c179-47c9-89e5-3cfef99f22a0MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Wellness", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/wellness/lower-blood-pressure-naturally-by-watching-aquarium-really/article1-1376054.aspx", "country": "US", "title": "Really? Lower blood pressure naturally by watching aquarium", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Really? Lower blood pressure naturally by watching aquarium", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T17:06:00.000+03:00", "replies_count": 0, "uuid": "f2b3e56ddedc2396bd648f6801921b600282e39c"}, "author": "", "url": "http://www.hindustantimes.com/wellness/lower-blood-pressure-naturally-by-watching-aquarium-really/article1-1376054.aspx", "ord_in_thread": 0, "title": "Really? Lower blood pressure naturally by watching aquarium", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "| Updated: Aug 03, 2015 19:50 IST A new research has found that viewing aquarium displays may not only improve your mood after a hard day at work, the exposure may also lead to reduction in blood pressure and heart rate. (Shutterstock Photo) \nPeople who watch fish tanks, here's some news that'll make you want to do more of that, and without any guilt. \nA new research has found that viewing aquarium displays may not only improve your mood after a hard day at work, the exposure may also lead to reduction in blood pressure and heart rate. \n\"Fish tanks and displays are often associated with attempts at calming patients in doctors' surgeries and dental waiting rooms,\" said lead researcher Deborah Cracknell from National Marine Aquarium in Britain. \nThis study has, for the first time, provided robust evidence that 'doses' of exposure to underwater settings could actually have a positive impact on people's wellbeing,\" Cracknell noted. \nThe researchers assessed the mood, heart rate and blood pressure of study participants in precisely the same setting as fish numbers in an exhibit by National Marine Aquarium gradually increased. \nThe researchers found that higher numbers of fish helped to hold people's attention for longer and improve their moods. \n\"While large public aquariums typically focus on their educational mission, our study suggests they could offer a number of previously undiscovered benefits,\" Sabine Pahl, associate professor in Psychology at Plymouth University in Britain said. \n\"In times of higher work stress and crowded urban living, perhaps aquariums can step in and provide an oasis of calm and relaxation,\" Pahl noted. \nThe study was published in the journal Environment and Behaviour. Tags", "external_links": [], "published": "2015-08-03T17:06:00.000+03:00", "crawled": "2015-08-03T18:09:08.177+03:00", "highlightTitle": ""}