{"organizations": [], "uuid": "4afd810893fa171ab9595763c1228de311e3fbdd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/wow-air-adds-two-a321s-to-power-by-the-hour-contract-with-ajw-aviation/", "country": "US", "title": "WOW air adds two A321s to power-by-the-hour contract with AJW Aviation", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "WOW air adds two A321s to power-by-the-hour contract with AJW Aviation", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T16:36:00.000+03:00", "replies_count": 0, "uuid": "4afd810893fa171ab9595763c1228de311e3fbdd"}, "author": "Alok", "url": "http://www.travelandtourworld.com/news/article/wow-air-adds-two-a321s-to-power-by-the-hour-contract-with-ajw-aviation/", "ord_in_thread": 0, "title": "WOW air adds two A321s to power-by-the-hour contract with AJW Aviation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  WOW air adds two A321s to power-by-the-hour contract with AJW Aviation   \nWOW air, the Icelandic low-cost airline has extended its power-by-the-hour contract with AJW Aviation to include two additional A321s. AJW, the leading independent integrated aircraft support specialist, originally signed a five year power-by-the-hour contract with the European airline in 2014 to provide on-going support for one of the airline’s A320 aircraft. \n\nChristopher Whiteside, President – AJW Group, affirms AJW’s commitment to supporting WOW air as their business evolves and the route network grows. “We have strategically located support hubs across Europe and North America to minimise AOG situations. Now that WOW air has commenced its low-fare service to Boston and Washington DC we are already well placed to expand the range of services that we can provide for their A321 fleet.” \n\nWOW air which is based in Iceland, is the country’s only low-cost carrier since acquiring its predecessor Iceland Express in 2012. It flies to a number of European cities the whole year round and started flying to North America this year from London and Reykjavik. The airline reached an important milestone in December 2014 when it flew its one millionth passenger and it is estimated that 800,000 passengers will fly with WOW Air in 2015. \n\nAJW’s new contract with WOW air further underlines the value for money and excellent customer service that is embodied within a power-by-the-hour agreement. AJW has a global fleet of over 900 aircraft under contract providing wide and flexible component coverage, expert advice and recommendations on minimising home base stock requirements, and world class logistics which includes AJW’s highly regarded 24/7 AOG support. Serving a global base of more than 1,000 airlines in 42 different countries, AJW is the ideal partner for airlines and MRO organisations requiring fully integrated support solutions to help achieve competitive advantage.", "external_links": [], "published": "2015-08-06T16:36:00.000+03:00", "crawled": "2015-08-06T16:43:05.041+03:00", "highlightTitle": ""}