{"organizations": [], "uuid": "3baa309998ecff493f6a2dc37e09c3c16e50aa2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29833793/wyndham-worldwide-presents-check-for-100000-to-birdies-fore-backpacks-at-wyndham-championship", "country": "US", "title": "Wyndham Worldwide Presents Check for $100,000 to \"Birdies Fore Backpacks\" at Wyndham Championship", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Wyndham Worldwide Presents Check for $100,000 to \"Birdies Fore Backpacks\" at Wyndham Championship - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "3baa309998ecff493f6a2dc37e09c3c16e50aa2d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29833793/wyndham-worldwide-presents-check-for-100000-to-birdies-fore-backpacks-at-wyndham-championship", "ord_in_thread": 0, "title": "Wyndham Worldwide Presents Check for $100,000 to \"Birdies Fore Backpacks\" at Wyndham Championship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Wyndham Worldwide\nProgram Returns as the Tournament's Official Charity\nGREENSBORO, N.C. , Aug. 19, Stephen P. Holmes, chairman and chief executive officer, Wyndham Worldwide; and Faith Taylor , senior vice president, corporate social responsibility, Wyndham Worldwide, presented a check for $100,000 to \"Birdies Fore Backpacks\" from the Company's Wishes by Wyndham Foundation. \"Birdies Fore Backpacks\" launched in 2014 to fight childhood food insecurity in the Piedmont Triad and is perhaps the most important charitable initiative in tournament history.\n\"Birdies Fore Backpacks\" is the official charity of the Wyndham Championship, and supports charitable organizations which fill backpacks with nutritionally sound meals for low income kids and families to take home every weekend. During its inaugural run last year, \"Birdies Fore Backpacks\" raised nearly $200,000 to help feed hungry children in the Piedmont Triad region. This year, fans have the opportunity to include a donation to \"Birdies Fore Backpacks\" of $1 or more when purchasing tickets on-line at WyndhamChampionship.com, or merchandise and concessions on course.\nHeld annually at Sedgefield Country Club in Greensboro, N.C. , the Wyndham Championship offers a week full of golf, charitable giving, as well as family-fun activities and prizes. For many fans, the tournament may be their last escape of the summer, and for the players, it's the last PGA TOUR stop before the FedExCup Playoffs and seen as a must-play for those looking to win points to either qualify for or improve their standing entering the Playoffs. Earlier this year, the PGA TOUR and Wyndham Worldwide announced that Wyndham has extended its title sponsorship of the Tournament, one of the TOUR's longest-running tournaments, through 2026.\nAbout Wyndham Worldwide Corporation\nOne of the world's largest hospitality companies, Wyndham Worldwide (NYSE: WYN) provides a wide range of hospitality services and products through its global portfolio of world-renowned brands. The world's largest hotel company based on the number of properties, Wyndham Hotel Group is home to many of the world's best-known hotel brands, with approximately 7,700 franchised hotels and over 668,500 hotel rooms worldwide. Wyndham Exchange & Rentals is the worldwide leader in vacation exchange and the world's largest professionally managed vacation rentals business, providing more than 5 million leisure-bound families annually with access to approximately 110,000 vacation properties in over 100 countries through its prominent exchange and vacation rental brands. The industry and timeshare ownership market leader, Wyndham Vacation Ownership develops, markets, and sells vacation ownership interests and provides consumer financing to owners through its network of over 210 vacation ownership resorts serving approximately 901,000 owners throughout the United States , Canada , Mexico , the Caribbean , and the South Pacific. Based in Parsippany, NJ , Wyndham Worldwide employs over 34,000 associates globally.\nPhoto - http://photos.prnewswire.com/prnh/20150819/259655\nLogo - http://photos.prnewswire.com/prnh/20150203/173173LOGO\n releases/wyndham-worldwide-presents-check-for-1 -to-birdies-fore-backpacks-at-wyndham-championship-300130719.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY82941&Transmission_Id=201508191300PR_NEWS_USPR_____NY82941&DateId=20150819", "http://photos.prnewswire.com/prnh/20150819/259655", "http://photos.prnewswire.com/prnh/20150203/173173LOGO", "https://photos.prnewswire.com/prnvar/20150819/259655", "http://www.prnewswire.com/news-releases/wyndham-worldwide-presents-check-for-100000-to-birdies-fore-backpacks-at-wyndham-championship-300130719.html", "http://photos.prnewswire.com/prnvar/20150203/173173LOGO"], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-19T20:50:55.341+03:00", "highlightTitle": ""}