{"organizations": [], "uuid": "d859e608d71c45451bc094e443cfd776af625f69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03193/BAUSE_3193308k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-03.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/travelaccessories/11401263/British-Airways-cabin-luggage-restrictions.html", "country": "US", "title": "British Airways cabin luggage restrictions", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "British Airways cabin luggage restrictions - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T17:00:00.000+03:00", "replies_count": 0, "uuid": "d859e608d71c45451bc094e443cfd776af625f69"}, "author": "Lizzie Porter", "url": "http://www.telegraph.co.uk/travel/travelaccessories/11401263/British-Airways-cabin-luggage-restrictions.html", "ord_in_thread": 0, "title": "British Airways cabin luggage restrictions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How many pieces of luggage can I bring in the cabin with me? Two. Size: The main piece of cabin luggage must be no larger than 56cm x 45cm x 25cm including handles, wheels and pockets. Each passenger is also allowed a smaller \"personal bag\" measuring up to 45cm x 36cm x 20cm including handles, pockets and wheels. From August 18 of this year, passengers will be limited to personal bags no bigger than 40x30x15cm . On busy flights, cabin baggage may have to go into the hold at the last minute, particularly if all passengers are carrying maximum dimension suitcases. There is no charge for this (unless your bag is over the cabin baggage restrictions) - but you will have to wait at the baggage carousel to retrieve your luggage at the other end. Weight: Each bag must weigh no more than 23kg. Related Articles easyJet hand luggage restrictions 10 Feb 2015 Flybe hand luggage restrictions 10 Feb 2015 Jet2 cabin luggage restrictions 10 Feb 2015 Monarch cabin luggage restrictions 10 Feb 2015 Can I book a hold bag on a single leg only, and travel hand-luggage only on the other? No. Passengers booking a checked bag on the way out do not receive a discount for not bringing a hold bag on the return leg, and vice-versa. Am I allowed any items in addition to my two cabin bags ? Any items purchased at the airport, such as duty-free goods, must fit into the allowed cabin baggage. There may be a charge to check them in if they do not. Anything else? Passengers travelling with an infant (under 2s) are allowed one bag to carry extra belongings, in addition to the cabin baggage allowances as above. See British Airways' guideline page on cabin baggage allowances . Suggested suitcase: BHS World's Lightest Suitcase range Price: £35.99 Size: 55.4cm x 35.5cm x 24.5cm Details: bhs.co.uk Luggage choice by Soo Kim", "external_links": [], "published": "2015-08-03T17:00:00.000+03:00", "crawled": "2015-08-03T11:46:01.957+03:00", "highlightTitle": ""}