{"organizations": [], "uuid": "1369cd45eb1a41ba44a6ff35363c74fd47f06e70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150820France.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/08/20/frances-most-famous-white-supremecist-jean-marie-le-pen-booted-from-his-far-right-party", "country": "US", "title": "France's most famous white supremecist, Jean-Marie Le Pen, booted from his far-right party", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "France's most famous white supremecist, Jean-Marie Le Pen, booted from his far-right party", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T00:38:00.000+03:00", "replies_count": 0, "uuid": "1369cd45eb1a41ba44a6ff35363c74fd47f06e70"}, "author": "Jill Replogle", "url": "http://www.ticotimes.net/2015/08/20/frances-most-famous-white-supremecist-jean-marie-le-pen-booted-from-his-far-right-party", "ord_in_thread": 0, "title": "France's most famous white supremecist, Jean-Marie Le Pen, booted from his far-right party", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nFrench far-right National Front (FN) party founder and honorary President Jean-Marie Le Pen leaves the party’s headquarters in Nanterre, near Paris, on August 20, 2015. Kenzo Tribouillard/AFP \nPARIS, France — Jean-Marie Le Pen, France’s elderly, far-right master provocateur, was booted out of the National Front (FN) he founded on Thursday after a high-profile feud with his daughter and party leader Marine. \nIn a dramatic move, the FN’s executive committee questioned the 87-year-old for three hours and voted to exclude him over inflammatory comments that proved too much for Marine Le Pen, pushing him out of a party he led for close to four decades. \nBut he immediately announced his intention to appeal the decision in court. \n“There is indignation, there is sadness, it’s always trying when one has the feeling of not having made any mistake, of having expressed one’s opinion as a politician,” he told the iTele television network . \n“I’m a father, so when unfair attacks come from my family, from my daughter, I am more affected than if it were an unknown opponent,” he said, adding he felt he was the “victim of an ambush.” \nA gifted orator with a taste for controversy, Le Pen had for years been an irritating thorn in the side of his daughter, who took over the party from him in 2011 and had tried to steer it away from the overt racism and anti-Semitism of its past. \nThe final straw came in April when the elder Le Pen rehashed familiar comments about gas chambers being a “detail” of history and said France should get along with Russia to save the “white world.” \nMarine Le Pen openly split with her father, saying he was committing “political suicide,” and later suspended him from the party. \n‘Multiplying mistakes’ \nBut the octogenarian firebrand showed little interest in going quietly, successfully challenging his suspension in court and barging onto the stage during a major FN rally in May. \nIn a sign of how deep the rift with his daughter had become, he told a local newspaper on Sunday that he would not vote for her in 2017 presidential elections. \nMarine and her deputy, Florian Philippot, stayed away from the meeting of the party’s executive committee to ensure “total impartiality.” \n“Jean-Marie Le Pen kicked off a process of which he knew the outcome by multiplying mistakes over many weeks, which could only lead to this kind of decision,” Marine said in a statement after the decision was announced. \nThe former Foreign Legionnaire’s inflammatory speeches had made him the figurehead of France’s far right since he co-founded the FN in 1972. And even after he handed over the reins to his daughter, he continued to come out with controversial statements, such as asserting that the Ebola virus could “solve” the immigration problem within three months. \nBorn fighter \nThe FN had been on something of a roll, having scored unprecedented election results in the past two years, notably coming first in European polls in 2014. \nA struggling economy and growing distaste for mainstream politics has helped the FN, with Marine Le Pen skillfully repackaging the party’s traditional dislike of outsiders as opposition to the EU and defence of secularism. \nBut Jean-Marie Le Pen has been an awkward reminder of the group’s roots — a “parasite” on the party, in the words of Philippot — when it should be focusing on regional elections in December. \nAlways keen to position himself outside the mainstream, Le Pen’s provocative rhetoric nonetheless brought the party to the forefront of politics after a slow start in the 1970s — even reaching the second round of presidential elections in 2002. \nThat seemed to mark the high-water mark of his chauvinistic appeal, however, as a stunned France responded with days of anti-racism rallies that helped his unloved centre-right rival Jacques Chirac back into office. \nThe older Le Pen can still count on support from a die-hard rump within the party, and the man who became an orphan in his teens and survived the brutal wars of Indochina and Algeria is a born fighter. \nIn a newspaper column this week, the FN patriarch said: “One thing is certain … the political line that I have represented for decades will not disappear from the national scene.”", "external_links": [], "published": "2015-08-21T00:38:00.000+03:00", "crawled": "2015-08-21T00:55:05.382+03:00", "highlightTitle": ""}