{"organizations": [], "uuid": "ddf54657a0cdf43da8ba4271e5a7aedae8416624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62191/myanmarwater-2015-returns-renewable-energy", "country": "US", "title": "MyanmarWater 2015 Returns with Renewable Energy", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "MyanmarWater 2015 Returns with Renewable Energy", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T12:09:00.000+03:00", "replies_count": 0, "uuid": "ddf54657a0cdf43da8ba4271e5a7aedae8416624"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/62191/myanmarwater-2015-returns-renewable-energy", "ord_in_thread": 0, "title": "MyanmarWater 2015 Returns with Renewable Energy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MyanmarWater 2015 Returns with Renewable Energy Adv: \nAug 04, 2015 Adv: \nUBM Asia announced the 3rd edition of MyanmarWater, bringing back Myanmar's most important annual event this year on International Water Supply, Sanitation, Water Resources, Industrial Wastewater Treatment and Purification. For the first time, MyanmarWater will be co-located with two (2) new trade events that are branched out from the successes in other Asia region -- Renewable Energy Myanmar 2015 and REVAC Myanmar 2015. \nRenewable Energy Myanmar 2015 is the most comprehensive renewable energy trade event in Myanmar and is part of the very successful renewable energy series organised by UBM, which includes Renewable Energy Asia in Thailand, Renewable Energy India Expo in India, Solar Asia and Green Energy in Malaysia. \nHaving all these shows under one roof with co-related trade events, it is the one-stop venue to view innovative products and presentations from industries' experts. \"We are pleased to be involved in the third edition of MyanmarWater 2015 co-locating with Renewable Energy Myanmar and REVAC Myanmar that will benefit and contribute towards Myanmar's growth in these industries altogether,\" said Mr. M. Gandhi, UBM Asia's Managing Director of ASEAN Business. \nThese trade events also provide an absolutely perfect platform for B2B business networking opportunities with over 5,500 international industry experts and decision-makers, potential buyers as well as partners. These events will highlight the importance of conference and technology symposium sessions with industry experts speaking on industry water and wastewater treatment, renewable energy policies in Myanmar, future plans of refrigeration and ventilation in the country and assisting participants in finding solutions to multiple business problems. \nRecognising its importance and advantage, UBM Asia receives full support from local organisations including those from the Myanmar Engineering Society (MES). \"The Myanmar Engineering Society (MES) welcomes and supports MyanmarWater, Renewable Energy Myanmar and REVAC Myanmar to benefit our members and local community. We would like to commend UBM for their initiative in organising these major events,\" says U. Win Khaing, President of Myanmar Engineering Society (MES).", "external_links": [], "published": "2015-08-04T12:09:00.000+03:00", "crawled": "2015-08-04T14:28:40.321+03:00", "highlightTitle": ""}