{"organizations": [], "uuid": "d51678fd36dbda9c3d4bf0815fdf61f45d2b8214", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150818Buzzfeed.jpg", "site_section": "http://www.ticotimes.net/categories/topics/global", "section_title": "Global Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/08/18/comcasts-nbcuniversal-invests-200-million-in-buzzfeed", "country": "US", "title": "Comcast's NBCUniversal invests $200 million in BuzzFeed", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Comcast's NBCUniversal invests $200 million in BuzzFeed -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T23:55:00.000+03:00", "replies_count": 0, "uuid": "d51678fd36dbda9c3d4bf0815fdf61f45d2b8214"}, "author": "Cecile Daurat | Bloomberg", "url": "http://www.ticotimes.net/2015/08/18/comcasts-nbcuniversal-invests-200-million-in-buzzfeed", "ord_in_thread": 0, "title": "Comcast's NBCUniversal invests $200 million in BuzzFeed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comcast Corp.’s NBCUniversal agreed to make a $200 million investment in the news website BuzzFeed in its efforts to capture the growth in digital advertising and reach younger consumers.\nAs part of the investment, the companies will explore strategic partnerships across both organizations in the coming months.\nThe funding marks Comcast’s latest attempt to partner with a rapidly growing digital publisher. Last week, NBCUniversal announced a $200 million equity investment in Vox Media, the online publisher of The Verge, Eater and Re/code. Comcast, the largest U.S. cable company, also plans to introduce a video service later this year featuring content from Vox Media and news producer Vice Media, according to a person close to the matter.\nThe investment gives NBCUniversal a chance to learn from a website that is popular among younger audiences who are increasingly forgoing traditional television, causing ratings and advertising revenues to fall. Ratings at NBCU’s cable channels were down 13 percent for the month of July, according to the research firm MoffettNathanson. Other cable networks in the U.S. have also seen steep ratings declines this summer.\nBuzzFeed, which was founded in 2006, has been rapidly growing in popularity, gaining readers with viral listicles and landing an interview with President Barack Obama in February.\nThe site reaches more than 200 million monthly unique visitors and has 1.5 billion monthly video views, according to a statement. BuzzFeed has been expanding its video ambitions, exploring short and long-form videos from its studio in Los Angeles. With its content on NBC’s broadcast and cable TV channels and access to NBC’s Universal film studio, BuzzFeed could reach an even larger audience.\n“We are looking forward to collaborating with them on projects we’d never be able to do on our own,” BuzzFeed Chief Executive Officer Jonah Peretti said in a note to employees.\nBuzzFeed also announced a joint venture this week with Yahoo to introduce a BuzzFeed edition in Japan, and in recent months struck deals with Facebook, Snapchat and Apple to host BuzzFeed content on their news readers and apps.\n“All these deals were structured to assure BuzzFeed’s continued editorial and creative independence,” Peretti told employees. “Equally important, the investment from NBCU and our rapidly growing revenue assures our financial independence, allowing us to grow and invest without pressure to chase short- term revenue or rush an IPO.”\n© 2015 , Bloomberg News", "external_links": ["http://www.buzzfeed.com/buzzfeednews/full-transcript-of-buzzfeed-news-interview-with-president#.boMl4lwkY"], "published": "2015-08-18T23:55:00.000+03:00", "crawled": "2015-08-19T11:08:49.905+03:00", "highlightTitle": ""}