{"organizations": [], "uuid": "b299c260612317494fec692584ed55519c39fd60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62973/hotel-insights-tale-three-chateaux", "country": "US", "title": "Hotel insights: A tale of three chateaux", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Hotel insights: A tale of three chateaux", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T04:02:00.000+03:00", "replies_count": 0, "uuid": "b299c260612317494fec692584ed55519c39fd60"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/62973/hotel-insights-tale-three-chateaux", "ord_in_thread": 0, "title": "Hotel insights: A tale of three chateaux", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hotel insights: A tale of three chateaux   \nBy Ted Macauley, special to eTN | Aug 25, 2015 Top to Bottom: Domaines des Avenieres, La Reserve, Mas de Torrent / All photos © Ted Macauley   \nOnce upon a time there was a castle. Then along came many castles in the middle ages, and suddenly it was the twentieth century, and in 1954 an entrepreneurial gentleman in France, Marcel Tilloy, event organizer and owner of the Hostellerie La Cardinale, had the idea of showcasing eight hostelleries between Paris and Nice, outside the cities, “which offered impeccable hospitality, were elegantly appointed with all modern conveniences, and had a good restaurant.” United under the slogan “La Route du Bonheur,” these eight properties became the foundation for what in 1962 was to become the Relais and Chateaux group. \nThis is a tale of three of those “castles” (although none of them are really castles in the true sense of the word) the first one, Domaine des Avenieres comes closest and its story related by its owner Nicholas Odin is a true fairy tale. Hailing from the Haute Savoie region, Odin had his eyes on this imposing manor house come chateau ever since he was a young toddler. He and his friends would play in and around the house, making up stories of ghosts as only children could do. Later on in life he decided to convince the local council to assist him in refurbishing the property and won his bid to do just that. \nToday, it is a flourishing Domaine only 30 minutes from Geneva airport, on the French side in the town of Cruseilles. \nApart from its idyllic setting, surrounded by pastures on one side and mountains on the other, it offers travelers a respite from the high prices charged just across the border in Switzerland. In fact, during the time I visited the Domaine, there was a major conference going on in Geneva, and the hotel was full of delegates that preferred the peace and quiet of the French Alps. \nDriving on in to central France, I found myself in need of a bed and a meal near the medieval town of Albi. Checking again the reliable Relais Chateaux guide, we came across La Reserve and subsequently found out through its charming owner, Helene Hijosa-Rieux, that the Queen Mother had made it her base when visiting Albi. Not content to just allow us to spend the night, Helene invited us for drinks and introduced us to her convivial husband and ranchero. Plotting a course for us in the morning to walk across the Tarn River to the old town (a UNESCO World Heritage site) and visit the Chateau du Bosc, birthplace of the famous impressionist painter Toulouse Lautrec, over flutes of pink champagne, as only the French could do. La Reserve’s setting is along the banks of the river Tarn. The next morning’s breakfast was a glorious sun-drenched affair overlooking the river and its lush greenery. \nAfter a leisurely lunch in Albi’s main square, we headed south en route to Spain to visit Dali country. Crossing the Pyrenees, one is immediately in another world. Different smells, different colors, different people - the Catalans. Looking for a compromise between the over-crowed Costa Brava, we came across our third “castle,” the “Mas de Torrent,” adjacent to the medieval towns of Begur and Pals. It is an eighteenth Catalan farmhouse magnificently converted into a 5-star hotel. \nThe next morning, meeting up with Xavier Rocas, the long-time general manager, he appraised us of its new consulting chef, coming from her two-star Michelin restaurant, “Les Cols,” in Olot. A new spa had also been added to the estate and was a blessing after our long day’s journey exploring the area which Salvador Dali immortalized in many of his paintings. \nNone of the three hostelries can truly be called “castles,” but the tales they offer and the depth of character as well as history are remarkable and offer discerning travelers a different and perhaps a more unique view of Europe at a time of rampant standardization.", "external_links": [], "published": "2015-08-25T04:02:00.000+03:00", "crawled": "2015-08-25T04:52:52.470+03:00", "highlightTitle": ""}