{"organizations": [], "uuid": "b90420143f6e9d43d7482a87b5b6d2d504428f44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/08/14/102922306-2014-08-13-04.59.43.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000739/device/rss/rss.html", "section_title": "Travel", "url": "http://www.cnbc.com/2015/08/14/iowas-state-fair-mixes-pork-politics.html", "country": "US", "title": "Iowa's State Fair mixes pork, politics", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "Iowa's State Fair mixes pork, politics", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "b90420143f6e9d43d7482a87b5b6d2d504428f44"}, "author": "Morgan Brennan", "url": "http://www.cnbc.com/2015/08/14/iowas-state-fair-mixes-pork-politics.html", "ord_in_thread": 0, "title": "Iowa's State Fair mixes pork, politics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fried food frenzy: A day at the Iowa State Fair\nWhile the Iowa State Fair is the campaign grounds of presidential hopefuls, when it comes to making money, it's all about the food. CNBC's Morgan Brennan eats ... reports.\nFried food, fluffy animals—and politics, of course. Welcome to the Iowa State Fair, which kicked off Thursday in Des Moines.\nLogging one million visitors and $20.2 million in revenue over 11 days last year, the event, which kicked off Thursday in Des Moines, is one of the largest—and most anticipated—state fairs in the country.\n\"Of those million people that come to the Iowa State Fair, many stay in the surrounding area and they over course drive here and utilize our local businesses in addition to the fair,\" says Gary Slater, chief executive and manager of the Iowa State Fair. \"We estimate it's over $100 million worth of economic impact in the eleven days.\"\nState fairs are typically not-for-profit entities, but they are a big business, pulling in tens of millions of dollars in revenue. Iowa's fair is trumped only by larger and longer ones in Minnesota and Texas.\nMinnesota's 12-day event pulled in 1.8 million visitors last year and more than $40 million in revenue, while Texas' 24-day extravaganza also grossed $42 million in coupon sales, with three million people in attendance.\n\"Attendance has steadily increased over the past seven to ten year: 75-82 percent [of state fairs] have reported steady-to-increased attendance, with weather the biggest factor,\" says Jim Tucker, chief executive and president of the International Association of Fairs and Exhibitions.\nTucker says fairs fared well during the economic downturn, as more people cut back on air travel but still wanted entertainment. Now many seem to be honing in on formulas that continue to draw crowds.\n\"We like coming because there are so many people here, and we’re advertising, and hopefully they will be coming to our stores in the future.\" -Melanie Edge, business owner and Iowa State Fair vendor Across the U.S. many fairs have been logging record attendance numbers. Even California's 17-day Sacramento-based fair—which struggled against sagging numbers after hitting a record high in 2001—recently concluded its 2015 season with nearly 788,000 visitors. That was a 5 percent increase over last year, after the event implemented horse and drone racing, the first ever of its kind .\nBig fairs can also help local entrepreneurs, businesses, and statewide associations—like the egg producers and cattle ranchers in Iowa—rack up hundreds of thousands of dollars in sales.\n\"It's a lot of exposure for small businesses. It's also a place for innovation,\" says Jack Mozloom, communications director at the National Federation of Independent Business. \"If you don't think the state fair is a place for innovation, consider that in Iowa there are over 70 different kinds of food on a stick. There's lots of experimenting going on and it's a chance to be recognized by a lot of people.\"\nAmanda Weindel | CNBC That's the case for Melanie Edge, whose Western Edge apparel business has two booths at the Iowa fair. \"We like coming because there are so many people here, and we're advertising, and hopefully they will be coming to our stores in the future,\" she said.\nEdge says when she was first starting out, the fair represented 70 percent of her business. As her brick and mortar presence has grown, it's still about 10 percent.\n\"We have a member that's right across the street that has a diner that says these 11 days make his whole year,\" adds Kristin Failor, NFIB's state director for Iowa. \"The tourism industry is huge for any small business around here.\"\nIt's become such a boon to the local economy, Iowa lawmakers recently agreed to make sure that none of the school districts begin school until after the fair is over.\nWith the 2016 election cycle in full swing, national politicians are a fixture at the fair. Since Iowa holds the first caucus, or major electoral event, in the nominating process for U.S. president, presidential hopefuls flock to the fair.\nMany, like GOP candidates Jeb Bush and Mike Huckabee did this week, take to the hay bale-stacked \"soapbox\" stage to address Iowan constituents, as crowds gather to cheer or heckle. Others prefer to mill around the booths, and pose pictures at the life sized cow sculpture carved of butter.\nVisitors also line up at the \"Cast Your Kernel\" booth to vote on who will be the next commander-in-chief by dropping a corn kernel in a jar.\n\"Fair goers want to meet them and I think it does drive the attendance,\" says the fair's Slater.\nPork with a handle, and beef 'sundaes' Still, when it comes to making money it is all about the food—particularly those deep-fried treats on a stick. There's a waiting list for booth space in Iowa, and food vendors lucky enough to score real estate can pull in hundreds of thousands of dollars in revenue over the 11 days.\nThere are two immensely popular eats: local (and presidential) favorite pork chop on stick, and the hot beef sundae at Cattlemen's. The pork association expects to go through 67,000 pork chops, grilled and served on the bone as a handle, this season.\nCattlemen's, a collection of 70 counties' cattle ranchers' associations, says it will go through 25,000 to 30,000 of its \"sundaes,\" which are actually a bowl layered with mashed potatoes, beef, gravy, cheese and a cherry tomato on top. At $7.50 a pop, that's at least $225,000 in gross sales for one item.\nBut for all of the outrageous concoctions—bacon-wrapped riblets on a stick; fried cheese on a stick, and yes, even salad on a stick—it's the classics that still rank as the top sellers. Last year the best-selling products were Barksdale's bucket of little cookies and corn dogs. Those come in a multitude of variations, which isn't unusual given Iowa is the top corn producing state in the country.", "external_links": ["http://qz.com/456768/the-first-national-drone-racing-championship-is-underway-in-california/"], "published": "2015-08-15T03:00:00.000+03:00", "crawled": "2015-08-15T20:40:43.219+03:00", "highlightTitle": ""}