{"organizations": [], "uuid": "6fc8a0e9a9b71a851b8872df1d9b1b7b4165abfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/Photo1_FP.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/homewood-suites-by-hilton-makes-a-travel-moment-for-u-s-service-members-and-military-families-with-the-uso/", "country": "US", "title": "Homewood Suites by Hilton “Makes a Travel Moment” for U.S. Service Members and Military Families with the USO - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Homewood Suites by Hilton “Makes a Travel Moment” for U.S. Service Members and Military Families with the USO - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "6fc8a0e9a9b71a851b8872df1d9b1b7b4165abfe"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/homewood-suites-by-hilton-makes-a-travel-moment-for-u-s-service-members-and-military-families-with-the-uso/", "ord_in_thread": 0, "title": "Homewood Suites by Hilton “Makes a Travel Moment” for U.S. Service Members and Military Families with the USO - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Homewood Suites by Hilton “Makes a Travel Moment” for U.S. Service Members and Military Families with the USO Published on : Friday, August 7, 2015\nHomewood Suites by Hilton, Hilton Worldwide’s upscale, all-suite, extended-stay hotel brand, distributed 500 travel care packages on July 31 to military members and their families at select USO airport centers across the country, as part of the “Make a Travel Moment” program. The campaign is dedicated to help the brave men and women of the U.S. military and their loved ones find rest and relaxation in airports while traveling.\nThe extended stay hotel created the program as part of their partnership with the United Service Organizations (USO). Troops and their families received the care packages at the USO airport centers in Denver, San Francisco, Phoenix, Nashville and Houston. Each care package included all the essential travel items needed to provide respite and ease the burdens of stressful travel, including eye masks, snacks, personal items and ear buds. The packages also included hand signed notes of encouragement and appreciation from the Homewood Suites by Hilton team.\n“This small act of kindness was reciprocated with so much gratitude from the men and women who serve our country every day and reminded Homewood Suites how a small gesture can mean so much,” said Bill Duncan, global head of brand management, Homewood Suites by Hilton. “We understand how hectic travel can be and welcomed the opportunity to provide these men and women some much needed essentials, along with a message of our gratitude.”\nThe campaign kicked off on July 24 at Homewood Suites by Hilton’s Memphis Shared Services Center where more than 30 Homewood Suites and Hilton Worldwide team members built the “Make a Travel Moment” care packages.\nHomewood Suites’ “Make a Travel Moment” program is a continuation of last year’s “Make a Moment” effort in which the brand helped 10 USO centers across the country recreate moments that were missed by military families. The feature event hosted at the USO’s Warrior and Family Center at Walter Reed National Military Medical Center was a Thanksgiving-themed celebration with more than 100 troops and military families who were treated to holiday cooking demonstrations by celebrity chef Kelsey Nixon. The USO partnership and current program is part of the brand’s ongoing campaign to honor military families, and compliments Homewood Suites’ 15 percent discount off the Best Available Rate to all active and retired military.\nThe brand’s military support campaign is also part of Hilton Worldwide’s wider commitment, Operation: Opportunity , a pledge to hire 10,000 veterans over the next five years and donate millions of Hilton HHonors points to assist job-seeking veterans.\nSource:- Homewood Suites", "external_links": [], "published": "2015-08-07T03:00:00.000+03:00", "crawled": "2015-08-07T16:25:31.324+03:00", "highlightTitle": ""}