{"organizations": [], "uuid": "5a8a3ef2dc99e31bc0ed03591d13530a617e6c8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/000_DV58466-e1440627705918.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/08/27/costa-rica-footballs-top-10-players-time", "country": "US", "title": "Costa Rica football's top 10 players of all time", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rica football's top 10 players of all time", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T12:30:00.000+03:00", "replies_count": 0, "uuid": "5a8a3ef2dc99e31bc0ed03591d13530a617e6c8e"}, "author": "Michael Krumholtz", "url": "http://www.ticotimes.net/2015/08/27/costa-rica-footballs-top-10-players-time", "ord_in_thread": 0, "title": "Costa Rica football's top 10 players of all time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nThough he was recently in the news for all the wrong reasons, Paulo Wanchope remains Costa Rica’s greatest players ever. Oliver Lang/AFP \nAs Óscar Ramírez leads Costa Rica football into a new era, the head coach will announce his roster Thursday for a set of marquee friendlies before the all important 2018 World Cup qualifying matches. The lineup is expected to be similar to the one that “La Sele” trotted out for the recent Gold Cup tournament, featuring national stars like Bryan Ruíz, Joel Campbell, and Celso Borges. \nIn anticipation of the roster announcement, The Tico Times takes a look at the 10 best players to ever don a Costa Rican jersey. The stars on our list span nearly a century, including two current players and a legend from the 1920s. The list also includes the former coach who recently punched and kicked his way out of a job , as well as the country’s all-time leading goal scorer. \nThough a great player in his own right and one who helped Costa Rica reach its first World Cup in 1990, new head coach “Machillo” Ramírez ended up just short of the top 10. Here’s who did make it. \n\n10. Juan Cayasso Gerard Malie/AFP \nThe forward from Limón will forever be remembered as the author of Costa Rica’s first goal in a World Cup game: a beautiful back-footed assist from Claudio Jara in the 1-0 win over Scotland in 1990. Cayasso would finish with 49 caps and nine goals during 10 years with La Sele. \nCayasso’s club career was highlighted by campaigns with the country’s top two teams, Alajuelense and Saprissa. \n\n9. Walter Centeno Stephen Dunn/AFP \nCenteno remains Costa Rica’s all-time leader in number of games played with 137 over the course of a decade and a half. He retired in 2009 after scoring 24 goals, including six in World Cup qualification games. \nThe Palmar Sur native spent most of his professional career playing for Saprissa, notching 65 goals throughout his career with the team. However, he has the distinct honor of scoring on Real Madrid at the Santiago Bernabéu stadium during a Champions League match when he was with Greece’s AEK Athens. \n\n8. Luis Gabelo Conejo Alberto Font/The Tico Times \nThe man who guarded the net for Costa Rica’s first World Cup squad had a short but decorated tenure with La Sele. He is widely regarded as one of the region’s best goalkeepers, thanks in large part to a dominating performance in Italy in 1990. At the World Cup there, Conejo allowed just two goals in three games, including one in the 1-0 loss to football giant Brazil. \nWith a shutout win over Scotland and a 2-1 victory against Sweden, Conejo and the Ticos advanced from the group stages. Currently, the 55-year-old Conejo oversees La Sele’s goalkeepers as an assistant coach for the national team. \n\n7. Rónald Gómez Alfredo Estrella/AFP \nKnown for his powerful leg, Gómez played in Spain with Real Sporting de Gijón and Hércules de Alicante CF before coming back to Central America to play with Guatemala’s Municipal, where he scored 22 goals in one season. \nDuring his 15-year career with La Sele, Gómez scored 26 goals and played on a pair of World Cup teams. The forward from Puntarenas was nicknamed “The Bullet” because of his penchant for scoring on long-distance, high-velocity shots, including this one from his time in Greece with OFI Crete: \n6. Hernán Medford Robyn Beck/AFP \n“Medford. Medford. Medford.” \nThe call from broadcaster Manuel Antonio “Pilo” Obando remains as celebrated and legendary as the player who inspired it. With an incredible run and score during Costa Rica’s win over Sweden in the 1990 World Cup group stages, Medford helped lift the Ticos into the elimination stages in the world’s most important tournament. \nMedford scored 18 times in 15 years with La Sele, but none was more important than his World Cup goal, which was just his second international goal. In club play, Medford found his greatest success domestically with Saprissa before moving on to the Mexican circuit. Nicknamed “The Pelican,” Medford later coached La Sele for three years with current headman Ramírez serving as his assistant. \n\n5. Rolando Fonseca Yuri Cortez/AFP \nLa Sele’s all-time leading goalscorer was a ball of energy on the pitch, playing for two decades before retiring in 2011. As a member of teams that went to two World Cups and one Copa Ámerica, Fonseca scored 47 international goals. \nHis greatest goal , however, came in a qualifying match in Mexico’s vaunted Azteca Stadium, where the Ticos beat El Tricolor for the first time in Mexico. \nAside from tenures with Alajuelense and Saprissa, Fonseca played in Mexico, Guatemala, and Colombia. \n\n4 . Bryan Ruíz Aris Messinis/AFP \nThe current captain has already left his mark in the country’s football history. With two goals in last year’s World Cup, including a brilliant header to beat former world champion Italy, Ruíz led the charge for La Sele during its miraculous rise out of the “Group of Death.” Ever since making his first appearance for Costa Rica in 2005, the 30-year-old forward has found the net 17 times in 72 matches. \nAs he leads Costa Rica towards qualifying for the 2018 World Cup in Russia, the veteran remains the engine in the middle of La Sele’s talented attack that includes Joel Campbell, Celso Borges, and rising star David Ramírez. \nRuíz just made his debut with Sporting Club Portugal in Lisbon, Portugal after scoring 12 goals in four seasons for Fulham. \n\n3. Alejandro Morera Soto (Still from LDACRTV YouTube video) \nThe man for whom national club Alajuelense’s stadium is named is one of the most revered football legends in Costa Rican history. Morera played with the club, averaging nearly a goal a game, until leaving to play in Spain and eventually signing with Barcelona, one of the greatest clubs in football history. Known as “The Magician,” Morera had a successful three-year career with Barcelona, where he scored an amazing 63 goals in just 76 matches. \nIn 1936, Morera came back to Costa Rica and played another 11 years with Alajuelense, scoring over 300 more goals with the team. According to Spanish-language daily “La Nación,” Morera later had a brief stint coaching Costa Rica’s national team, leading it to the Central American championship in 1941. \n\n2. Keylor Navas Gabriel Bouys/AFP \nThe current starting goalie for Real Madrid could be on track to claim the top spot as Costa Rica’s best ever footballer if he continues to lock down the net on the grand stage with the world’s most expensive club. \nReal Madrid signed “San Keylor” after he worked miracles in the 2014 World Cup, where he didn’t allow a single goal that wasn’t a penalty kick or with a man down. Navas was Costa Rica’s most valuable asset during the team’s improbable run to the quarterfinals in Brazil, shining brightest when La Sele was reduced to 10 men against Greece. \nThough rumors persist that Madrid is looking to deal Navas to Manchester United before the player transfer deadline ends this week, the 28-year-old keeper seems to have taken well to his new role as starter following a promising preseason. In the eight matches since preseason began, Navas has only allowed three goals while playing against Europe’s toughest competition. \n\n1. Paulo Wanchope Roberto Schmidt/AFP \nWanchope, Costa Rica’s greatest player ever, made international news recently when he was recorded in an altercation with a security officer at a Panamanian football stadium. His resignation as head coach of La Sele came the next day, ending a disappointing campaign with Wanchope at the helm of the national team. Under his watch, the team’s official record was 0-4-5. \nDespite the ugly incident and his early retirement, Wanchope will be remembered as Costa Rica’s most creative scorer. As the top threat on La Sele’s 2002 and 2006 World Cup teams, the Heredia native scored 48 goals in 73 matches. He remains second on the country’s scoring list behind Fonseca, despite playing in 40 fewer games. \nWanchope also had a successful career abroad while playing in some of the world’s best leagues. From 1997 to 2004, Wanchope played in the English Premier League, including four seasons with respected club Manchester City. During his first season in the Premier League, while playing with Derby County, Wanchope scored just one goal, against Manchester United. But it was a masterpiece.", "external_links": [], "published": "2015-08-27T12:30:00.000+03:00", "crawled": "2015-08-27T12:43:23.563+03:00", "highlightTitle": ""}