{"organizations": [], "uuid": "b0ba08c7f99b9863eec18380a974a9208721a559", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62750/countdown-women-mice", "country": "US", "title": "Countdown to Women in MICE", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Countdown to Women in MICE", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T22:07:00.000+03:00", "replies_count": 0, "uuid": "b0ba08c7f99b9863eec18380a974a9208721a559"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/62750/countdown-women-mice", "ord_in_thread": 0, "title": "Countdown to Women in MICE", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Countdown to Women in MICE   \nAug 18, 2015 eTN   \nThe time has finally arrived for Meetings magazine’s annual Top 40 Women in MICE event set to take place on Thursday, August 20,at Hackle Brooke Conference Centre. \nWomen in MICE is an annual initiative that strives to honor and celebrate the deserving women who have made amazing strides within the Meetings, Incentives, Conferences and Exhibitions (MICE) industry. Originating from the need to recognize the amazing work done by women who perform their daily tasks with diligence and passion, this initiative focuses on the importance of women in the workplace as well as in the MICE industry. \nCommenting on the importance of the second annual Women in MICE event, editor of Meetings magazine Martin Hiller says that “this initiative now plays an important role in providing a platform that motivates, inspires and supports women in the industry to achieve both personal and professional goals. It also aims to connect women in the industry to leverage their reach and resources, creating a global community of economically powered women.” \nThe women who were selected as the Top 40 Women in MICE were nominated by their peers and colleagues and Women in MICE aims to give these women the praise they deserve. \nThis year’s event will see various awards handed out, recognizing rising stars and lifetime achievers as well as acknowledging event planners in Africa and beyond. \nThis event would not be possible without the support of several major partners. The event organizers would like to thank: Joburg Tourism, South African National Convention Bureau, Techrig, Unlimited Events Group, Hackle Brooke Conference Centre, Compex and Barmotion. \n“Supporting this event gives us an opportunity to focus on the importance of the MICE sector and a chance to say thank you to all our stakeholders in the industry, who will be represented by these ladies and their companies. It is only through close working relationships and aligned strategic goals that our industry is able to grow and go from strength to strength. Over the past few years, Joburg as a business events destination has benefited enormously from improved working relationships with our peers and partners and we pay tribute to all the efforts all the players contribute,” adds Laura Vercueil of Joburg Tourism. \nJoin the conversation on Twitter using #40WIM. \nJoburg Tourism is a member of the International Coalition of Tourism Partners (ICTP) .", "external_links": [], "published": "2015-08-18T22:07:00.000+03:00", "crawled": "2015-08-18T22:59:04.825+03:00", "highlightTitle": ""}