{"organizations": [], "uuid": "4c956daafba8df4eec53a7a6ead2cb1aa10df173", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources3.news.com.au/images/2015/08/16/1227485/492235-1e29bc0c-3b3c-11e5-b10e-17cdeb710f39.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-ideas/fast-furious-the-best-of-tokyo-in-24-hours/story-e6frfqdi-1227485493744?from=public_rss", "country": "IL", "title": "Inside the secret Party Room in Tokyo", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Inside the secret Party Room in Tokyo", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T05:02:00.000+03:00", "replies_count": 0, "uuid": "4c956daafba8df4eec53a7a6ead2cb1aa10df173"}, "author": "", "url": "http://www.news.com.au/travel/travel-ideas/fast-furious-the-best-of-tokyo-in-24-hours/story-e6frfqdi-1227485493744?from=public_rss", "ord_in_thread": 0, "title": "Inside the secret Party Room in Tokyo", "locations": ["Tokyo"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What are these? Precision. Cleanliness. Shoe lockers. Sashimi. Ramen. Asahi. Gloves. And that’s just the start in Tokyo. Source: Supplied \nTHE size, the pace, oh, and the price of Tokyo has always been a daunting one. It’s been on the bucket list, so when a 24-hour opportunity came up? Kon’nichiwa. \nWhile that amount of time hardly scratches the surface, you get a feel of the energy that makes it one of the most diverse and riveting cities in the world. \nInvited to fly the first flight from Brisbane to Tokyo, the good news for Queenslanders is they can now get to the buzz of Japan in just over 9 hours. In the mood: ramen noodles on board Source: Supplied Just a casual Sunday out for this trio Source: Supplied Delicate & beautiful girls at Harajuku Source: Supplied The kimono: not just for ‘special’ occasions Source: Supplied \nArriving at Narita airport, everything is precise and poised. But don’t ever think that English is everyone’s second language. Simply, it isn’t. Even heading over to buy a SIM card at the airport — a usually fairly painless exercise — was tough. (And after all that I never did get it to work.) \nAnyhow, the train from Narita airport to Ginza station in central Tokyo was the best and most affordable option but if you had a lot of luggage I wouldn’t suggest it. \nFinding room in the luggage cabins can be hard. Also, it’s important to be on the platform at the exact time of departure. There are NO time delays, ever, on Tokyo trains. \nOnce we got off at the underground it was a short taxi ride to our hotel in Ginza. In Tokyo, Japanese taxi drivers WEAR GLOVES. They are lace (doily) head rests and seat covers and good drivers are charming and poised. Our inn — the affordable Mercure in Ginza — is a perfectly positioned, great service hotel. It’s not high-end but incredibly clean, well-positioned and just plainly, very, very good. (Oh, and you can ‘buy’ a late check out, which was worth every cent considering the humidity of our quick trip.) \nA quick freshen up, and all of a sudden it was 9pm, so we popped around to a quick and easy noodle bar and ate. Lots. After dinner, of COURSE we ventured to Joysound — a karaoke bar which was the starkest, most brightly lit Karoake space ever. But when were placed in the ‘Party Room’ and left to our own karaoke devices, the light show and mad song choices had us at Dancing Queen. Killer karaoke with the travelling posse Source: Supplied One of ‘the best’ in town: Joysound in Tokyo Source: Supplied \nNext day it was up early and for a twirl around the Ginza district — filled with designer labels and the extraordinary Mitsukoshi department store (with the best basement food hall I have ever seen). We then made our way on the metro to Harajuku where dress-ups (usually) rule supreme. \nI get the feeling the oppressive heat may have had something to do with not AS many men and women dressing ‘up’ in a style that has become the area’s signature. Needless to say, there is still this obsession with ‘girlie’ dressing or of wearing clothes fit for 8-years-olds, but on 18 and 28-year-old bodies. \nWe kept going in and out of air-conditioned shops — the heat was THAT intense — and realised it was time to talk food. After another queue (there are queues everywhere) we stumbled across the Ichiran ramen noodle bar, a very cool and affordable Japanese chain, which had eating stations that were similar to voting cubicles. Loved this place: an authentic ramen noodle bar, Ichiran, where you punched and paid for your order into a vending machine Source: Supplied \nJust before you get a seat, you punch in your choices and pay before you head inside to wait by a ‘vacant seat’ allocator. As soon as you got to your ‘cubicle’ there was paperwork to do, filling in a form that had me determine the chilli, garlic, and noodle choice of my already paid-for lunch. I loved it! \nWhen the form was filled in, you pressed a green button and a hand from behind a small bamboo curtain in front of you took my order. Insane! Tokyo goes on and on from the Roppongi Mori Tower Source: Supplied The attention to detail is everywhere: the Mercure hotel even welcomes you with personalised chopsticks! Source: Supplied \nThere are masks on every 5th person and for some reason I noticed that the kimono has gone from being a traditional piece of clothing, usually worn to ceremonies & more formal events, to a piece that has re-emerged as a weekend staple. \nWe were exploring central Tokyo on a Sunday, and there were kimonos everywhere. On women and men. It was brilliant. \nOK, so around 16 hours into my Tokyo sojourn and to walk off our lunch we headed to the mega Roppongi Hills Mori Tower only to be gobsmacked at the extraordinary reach of Tokyo. I’m usually a bit ‘blah’ about observatories, but this was a real must simply bacuase it gave you an idea of the breadth of size of Tokyo. Oh, and I also spotted this guy at the Mori Tower observatory Source: Supplied \nOK, so Tokyo was steamy beyond. By that I mean, stifling hot and humid. So to be honest I would avoid high summer if you wanted to go on a leisurely holiday. Needless to say we loved the bar near our hotel, the Ginza Itamaebar, where we found a mid-arvo icy cold beer and the best tempura. Japan is not, I repeat not, one big Sushi Train. Far from it. Yes. Please. Extra, extra cold ... Source: Supplied A fishy experience We take you behind the scenes to the colourful tuna auctions at Tsukiji Fish Market in Tokyo. Video by: Michelle Loh. \nIn fact, you hard pressed to even encounter the revolving food stations that have become the norm of the Aussie take on Japanese culinary culture. Which leads me to a little treat I gave myself. I always try to go to somewhere vaguely flash when I am somewhere new. So in Tokyo it was the Park Hyatt for drinks and dinner so I could have my Lost in Translation moment . \nI perched myself at the bar (the same one Bill Murray and Scarlet Johansen sat at in the film) then took myself into the hotel’s restaurant where I happily sat by the window and watched all the action go by. This was pure, up-market Tokyo. \nAnd like *that* my time is Tokyo was just about up. Tokyo is HUGE. It was great to get a taste of if & next time I’ll maybe go to Niseko or Hakuba and continue a quest to eventually make my way down a Japanese ski slope. Style: the Tokyo way . . <div class=\"iframe-alt\">(Frame content direct link: <a href=\"https://instagram.com/p/54InVjPdSH/embed\">https://instagram.com/p/54InVjPdSH/embed</a>.)</div> \nJapanese form guide \n• Maybe it was me but you don’t see many/hardly any people eating in public \n• Business cards are presented with two hands \n• A warm towel or hand towell is a staple at most eateries \n• Queuing seems mandatory — and no one complains \n• Trains leave and arrive at a precise time — there is no room for error \n• Shoes are taken off and at some restaurants and left in foot lockers (no wonder there are so many mechanical & battery-operated pedicure appliances around.) \n• Is the only place where you don’t look like a complete hypochondriac wearing a mask \n• It is also totally fine to wear a sock, a half sock and a sandal. \n• Waiters, taxis et al don’t expect tips. Seriously. But we liked doing it anyway ... Lost in Translation: dinner at The Park Hyatt <div class=\"iframe-alt\">(Frame content direct link: <a href=\"https://instagram.com/p/54oYxqPdeI/embed\">https://instagram.com/p/54oYxqPdeI/embed</a>.)</div> \nMelissa Hoyer was a guest of Qantas on board the inaugural flight from Brisbane to Narita airport and on the Haneda airport to Sydney flight coming back to Australia", "external_links": [], "published": "2015-08-16T05:02:00.000+03:00", "crawled": "2015-08-16T06:22:31.456+03:00", "highlightTitle": ""}