{"organizations": [], "uuid": "24ecc531ca3491d184944195ace3b200df653096", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/travel-tips/feed", "section_title": "Travel Tips on Huffington Post", "url": "http://www.huffingtonpost.com/samuel-buchanan/20-helpful-tips-for-prest_b_7999258.html", "country": "US", "title": "Samuel Buchanan: 20 Helpful Tips for Pre-Study Abroad", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Samuel Buchanan: 20 Helpful Tips for Pre-Study Abroad", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T19:07:00.000+03:00", "replies_count": 0, "uuid": "24ecc531ca3491d184944195ace3b200df653096"}, "author": "Samuel Buchanan", "url": "http://www.huffingtonpost.com/samuel-buchanan/20-helpful-tips-for-prest_b_7999258.html", "ord_in_thread": 0, "title": "Samuel Buchanan: 20 Helpful Tips for Pre-Study Abroad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nPreparing for a trip can be a laborious task, especially when you're leaving your country. If you are studying abroad or planning to for the first time, you may have traveling anxiety. What will I do; where will I go; how will I survive? Don't worry! Here are a few tips that will help you before takeoff. \nPacking If you're anything like me, you probably want to pack everything you have in your luggage. Although well-intended (as you can never be too safe), cost and weight won't permit you to do it. Therefore, you must Consolidate and Eliminate . \n1. Do not pack every just-in-case-you-get-bored item. 2. Find 2-3 pairs of comfortable, multi-purpose shoes. 3. Learn how to mix-and-match 4-5 different outfits. 4. Pack lightly 5. Tightly fold clothes and/or buy compression bags. \nDoing the aforementioned, will allow you to save both time and money. If you are still having trouble with deciding what to bring, there are some great YouTube videos for you to watch. See Travel Tips: How You Need to Pack to Study Abroad Planning Your Adventure When packing gets boring and the television is no longer entertaining, you will most likely be daydreaming about your trip. Though daydreaming what you could do can be... dreamy, it does not compare to what you will do. So, Stop Daydreaming and Start Planning your adventure. \n6. Start planning for the things you will do. 7. Look up the activities your program offers. 8. Google things to do in [insert country here] and... 9. Do them! \nIn the words of Shia LaBeouf, \"Just do it!\" For a dream that is not actualized is only a fantasy. \nHaving the Right Attitude For those individuals who like to guard themselves by thinking of the worst case scenario, you may be thinking, \"What if I do not meet anyone new? What if I don't like the country? What if I miss my family?\" The answer is simple: you will never know until you try. Nonetheless, thinking negatively won't help you overcome your anxiety. You must Think Positively . \n10. Don't worry yourself with disastrous, hypothetical outcomes. 11. Be open to new experiences. 12. Do research about the country you're visiting. 13. Hope for the best. \nThe purpose of studying abroad is to get out of your comfort zone, try new things, reflect on life and reinvent yourself. It is about becoming, triumphing and growing. Thus, hope for the best, be your best and the best is sure to come. \nPreparing for Homesickness For those individuals who have never traveled abroad, you may be worried about being far away from your family and friends. You may want to call them in the wee hours of the night. However, worrying about missing your love ones will only make you homesick before you leave home. You should Plan to Combat Homesickness . \n14. Bring souvenirs and photos that remind you of home. 15. Download Apps for international calls (i.e. WhatsApp, Viber or Skype). 16. Spend time with your love ones before you depart. \nBeing long distance for an extended period of time does not have to hinder your relationships. It simply requires your time and effort. Make time for the people you care about and start now! \nLeaving on a Positive Note If you are stressed about school and/or home, studying abroad may be just what the doctor ordered. Still, having the I-can't-wait-to-leave attitude will not help you depart any sooner; it will only heighten your stress. My advice to you is to Make Peace with Where You Are . \n17. Reconcile your differences with others before you leave. 18. Be excited about your trip, not anxious. 19. Understand why you want to travel. 20. Do fun things before you leave. \nYour trip will be too great of its own experience to be muddled with anything else. Go with a clear conscious and no other motives but to learn and enjoy the country. \nMoreover, believe that it will be the time of your life because it will. Get ready, get set, go abroad! \nFollow Samuel Buchanan on Twitter: www.twitter.com/Samuel2Victory More:", "external_links": [], "published": "2015-08-17T19:07:00.000+03:00", "crawled": "2015-08-17T23:58:25.655+03:00", "highlightTitle": ""}