{"organizations": [], "uuid": "129db22638c64b609323a8b3507f3beaedfaff1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/jersey-coastguard-launches-annual-safety-sea-campaign/", "country": "US", "title": "Jersey Coastguard launches Annual ‘Safety @ Sea’ campaign", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Jersey Coastguard launches Annual ‘Safety @ Sea’ campaign | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "129db22638c64b609323a8b3507f3beaedfaff1a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/jersey-coastguard-launches-annual-safety-sea-campaign/", "ord_in_thread": 0, "title": "Jersey Coastguard launches Annual ‘Safety @ Sea’ campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jersey Coastguard launches Annual ‘Safety @ Sea’ campaign Published on : Monday, August 3, 2015\nJersey Coastguard will launch its annual ‘Safety @ Sea’ campaign with the message “Remembering Summer for the Right Reasons” aimed at both residents and visitors.\nSafety messages, which include awareness of fast rising tides and the importance of telling someone your plans will be highlighted through local media, including television, radio and newspaper as well as through its own social media sites. People holidaying in the Island can also view a short safety awareness film being shown at the Visitor Services Centre in Liberation Place as well as at Jersey Airport.\nJersey Coastguard Manager Russell Mathew explains, “There have been a number of inshore incidents already this summer where people have been left stranded because the quickly rising tide has cut them off. Although this does appear to catch out visitors more frequently it is important to remind residents who can easily forget just how quickly tides come in.”\nLocal mariners are also reminded not to be complacent and ensure they carry out safety checks before heading out to sea. This advice is being strengthened by the use of the following ‘MAYDAY’ reminder message:\nMonitor the weather and tides Advise Jersey Coastguard by logging a traffic report Your vessel – have you done your checks? Distress – always have a means of calling for help Are you trained and competent for where you plan to go? Your safety – make sure you’re wearing your lifejacket\nMr Mathew continues, “With warm weather and rising sea temperatures being out on the water is a great way to spend the summer and we certainly don’t want to prevent anyone from doing so. However, this is a timely reminder for people to take the necessary precautions so everyone can enjoy the summer safely.”\nJersey Coastguard is also taking this timely opportunity of reminding the public that for safety reasons, and with the exception of agreed organised events, swimming and diving in and around St Helier Harbour is prohibited and are being warned to keep clear of boat moorings and approach routes in its outlying harbours, including St Aubin, Gorey and Bonne Nuit. Furthermore, the activity of ‘Tombstoning’ from any of its piers around the Island is also prohibited on safety grounds.\nA number of safety reminders and practical information resources are available online, including a tide calculator and advice for anyone participating in water sports.\nThis year’s ‘Safety @ Sea’ awareness campaign is due to run until early September 2015.", "external_links": [], "published": "2015-08-03T03:00:00.000+03:00", "crawled": "2015-08-03T10:28:27.320+03:00", "highlightTitle": ""}