{"organizations": [], "uuid": "cb66aa91083b13acb45fbd967612cc827f8b62be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/Etihad-Airways-300x166.png", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-launches-new-fare-choices/", "country": "US", "title": "Etihad Airways launches new 'fare choices'Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Etihad Airways launches new 'fare choices'Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "cb66aa91083b13acb45fbd967612cc827f8b62be"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-launches-new-fare-choices/", "ord_in_thread": 0, "title": "Etihad Airways launches new 'fare choices'Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Etihad Airways launches new ‘fare choices’\nEtihad Airways, the national airline of the United Arab Emirates, will implement a new fare structure from 14 September 2015 to provide more choice and clarity when booking flights.\nA total of eight new ‘Fare Choices’ will be introduced, allowing travellers to tailor their bookings to their individual needs. The ‘Fare Choices’ are transparent and differ in baggage allowance, flexibility and included benefits that otherwise need to be purchased separately. Additionally, an adapted baggage policy will provide guests with a more standardised baggage allowance structure across the Etihad Airways Partner network, while also reducing the price for excess baggage charges on most routes.\nAll bookings ticketed from 14 September 2015 will be split into distinct fare choices. The structure for Economy Class includes Economy Breaking Deals, Economy Saver, Economy Value and Economy Freedom. Business Class includes Business Breaking Deals, Business Saver and Business Freedom, while in First Class there will only be one fare family – Freedom.\nPeter Baumgartner, Chief Commercial Officer of Etihad Airways, said: “Ultimately, this is about providing choice. In most industries there is a move towards allowing customers to tailor and customise their experience, and ours is no different. When it comes to booking a flight, not everyone’s needs are the same. Some guests want to travel light and on a budget, whilst others want to be able to make last-minute travel decisions, carry extra baggage or earn more miles. For example, if a guest wants more flexibility, more luggage, and priority check in, they can select our Economy Freedom Fare Choice.”\nA new baggage policy has also been announced to more flexibly respond to individual customer needs and to better align Etihad Airways with other Etihad Airways Partner airlines.\nAs part of the policy change, the cost of excess baggage will be dramatically cut on the majority of fares. On some routes the cost of buying an additional 23kg piece of baggage will be reduced by up to 90 per cent, with a further reduction of up to 30 per cent if pre-purchased directly with Etihad Airways up to 24 hours before travel. The new baggage policy will also come into effect for bookings on or after 14 September.\nSource:- Etihad Airways", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-21T01:14:56.806+03:00", "highlightTitle": ""}