{"organizations": [], "uuid": "4cdfd9eaf5d7c2a4185c17c3ee8904a2893d743b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/cruise/28463-silversea-unveils-overland-adventures-for-world-cruise-2016", "country": "US", "title": "Silversea unveils overland adventures for World Cruise 2016", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Silversea unveils overland adventures for World Cruise 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T12:15:00.000+03:00", "replies_count": 0, "uuid": "4cdfd9eaf5d7c2a4185c17c3ee8904a2893d743b"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/cruise/28463-silversea-unveils-overland-adventures-for-world-cruise-2016", "ord_in_thread": 0, "title": "Silversea unveils overland adventures for World Cruise 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Silversea unveils overland adventures for World Cruise 2016 Silversea unveils overland adventures for World Cruise 2016 Details Category: Cruise Created on Wednesday, 26 August 2015 10:15 Ultra-luxury Silversea Cruises has created a diverse array of enriching overland adventures to complement its World Cruise 2016. Twenty carefully orchestrated optional land programmes will allow guests to witness spectacular natural wonders, from Australia's Great Barrier Reef to the magical scenery of Vietnam's Ha Long Bay; spot exotic wildlife, such as tigers and orangutans, in their natural habitats; discover the ancient cultures and inspirational landmarks of India, Arabia, and Israel; and fly to isolated regions to explore such legendary kingdoms as Bhutan and Kandy.. \nDeparting in January, and sailing from Fort Lauderdale to Venice, Silversea's World Cruise 2016 will be hosted aboard the elegant, all-suite Silver Whisper, enabling guests to voyage 115 days in unsurpassed luxury across six continents as they visit 51 ports in 31 countries. \"Our destination experts have specially crafted an inventive selection of overland explorations to enhance our guests' world cruise experience,\" said Lisa McAuley, Commercial Director, UK and Ireland. \"These unique opportunities blend together luxury and comfort with the authenticity of hands-on exciting adventures to reveal the amazing cultures, wildlife, and natural attractions that lie just beyond the ports of call.\" The following is a small sampling of the overland adventures: Cloud Forest at Mashpi Lodge (4 Days / 3 Nights -- Depart: Manta / Rejoin Ship: Callao) Mashpi is a nature sanctuary perched at 3,116 feet (900 meters) above sea level on the western slope of the Andes Mountains, in one of the world's most celebrated bioregions. It will delight the most avid nature lover with picturesque waterfalls, verdant hills, and a staggering 500 species of birds. Guests might spot monkeys and even pumas, which make their home in the reserve. Great Barrier Reef Retreat (1 1/2 Days / 1 Night -- Depart / Rejoin Ship: Cairns) One of the most idyllic places in the southern hemisphere, the luxurious Green Island Resort is located on an ancient coral cay in the heart of the Great Barrier Reef. Its rainforest is home to over 120 species of native plants, colourful bird and marine life, and coral gardens. Guests may snorkel, take a stroll in the rainforest, gaze under the sea by glass-bottom boat, or simply relax. Angkor Wat! (2 1/2 Days / 2 Nights -- Depart: Ho Chi Minh City / Rejoin Ship: Bangkok) Between the 9th and 13th centuries, Angkor was the capital of the Khmer empire, a colossal city renowned for its superb architecture and sculptures, vast lakes and temples. Hidden in the jungles of Cambodia until the late 19th century, it's one of the world's greatest wonders, and a UNESCO World Heritage Site. Legendary Mandalay (1 1/2 Days / 1 Night -- Depart / Rejoin Ship: Yangon ) Situated on the Irrawaddy River is Myanmar's former capital, the legendary city of Mandalay. Now the country's second largest city, Mandalay is a rich cultural centre famous for its monasteries, pagodas, temples, and the remains of its royal palace. The panoramic view from Mandalay Hill at sunset is an unforgettable experience. Kandy by Chartered Seaplane (8 Hours -- Depart / Rejoin Ship: Colombo ) Nestled in a valley surrounded by hills and dense jungle, Kandy is the cultural heartland of Sri Lanka. Guests journey by private air taxi into the centre of the Kandy plateau to explore one of the world's most important Buddhist sites, the Dalada Maligawa, or Temple of the Tooth, where the Buddha's sacred tooth relic is enshrined. In Search of Tigers (5 Days / 4 Nights -- Depart: Mumbai / Rejoin Ship: Dubai) Ranthambore National Park in Rajasthan, India, is a wildlife sanctuary renowned for its royal Bengal tigers. Morning and afternoon game drives offer guests the chance to witness these remarkable animals in their natural habitat, along with jackals, leopards, gazelles, and numerous species of birds. Starting at $999 per person, the optional overland programmes feature deluxe accommodations (if overnight stays are required), all transportation, transfers, guided sightseeing and some meals. Related articles", "external_links": [], "published": "2015-08-26T12:15:00.000+03:00", "crawled": "2015-08-26T12:25:09.420+03:00", "highlightTitle": ""}