{"organizations": [], "uuid": "e9f6e4df61719fd8954d557b0edb4e1a0770131b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62479/qatar-airways-picks-two-awards-flagship-a380-and-a350", "country": "US", "title": "Qatar Airways Picks Up Two Awards For Flagship A380 and A350", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Qatar Airways Picks Up Two Awards For Flagship A380 and A350", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T16:12:00.000+03:00", "replies_count": 0, "uuid": "e9f6e4df61719fd8954d557b0edb4e1a0770131b"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/62479/qatar-airways-picks-two-awards-flagship-a380-and-a350", "ord_in_thread": 0, "title": "Qatar Airways Picks Up Two Awards For Flagship A380 and A350", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Qatar Airways Picks Up Two Awards For Flagship A380 and A350   \nAug 11, 2015 Banners   \nQatar Airways, crowned Airline of the Year at the Skytrax World Airline Awards 2015, won two awards at the recent Australian Business Traveller Awards. The Doha-based carrier’s superjumbo A380 Lounge was named “Best Inflight Lounge” and the airline also picked up the “Best Economy Class” accolade for its A350 Economy Class cabin. \nQatar Airways Group Chief Executive, His Excellency Mr. Akbar Al Baker, said: “We are delighted to have received these two accolades for our flagship A380 and A350 aircraft, particularly so for the A350 which only commenced operations just seven months ago. These awards bear testament to our commitment and dedication to delivering a high quality travel experience for all passengers who fly with Qatar Airways, across all classes of travel. Whether you are travelling with us in the Premium Cabins or in Economy Class, our five-star service offering remains consistent.” \nQatar Airways’ A350 Economy Class cabin was named Best Economy Class as it “cleverly marries the overall sense of space in the Airbus A350 cabin with an economy seat that’s a generous 18 inches wide, with ample room around the knees for even the tallest traveller,” said David Flynn, editor of the Australian Business Traveller. \nIn addition to wider seats in Business and Economy Classes, the state-of-the-art aircraft is also quieter and features advanced air conditioning technology coupled with mood lighting to reduce passenger fatigue after a long flight. \nQatar Airways is the global launch customer for the A350, and currently flies the world’s newest wide-body aircraft on the Frankfurt and Singapore routes. The airline has 76 A350 aircraft on order and future destinations earmarked for the A350 are Munich, Germany, from October 1, 2015, and the United States of America in 2016 (Philadelphia from January 1, New York from March 1 and Boston from March 16). \nBesides “Best Economy Class”, Qatar Airways’ elegantly designed A380 on-board lounge was also named “Best Inflight Lounge” by the Australian Business Traveller Awards. \nThe lounge on board the airline’s bespoke A380 superjumbo was praised for “offering travellers a social space where they can mix and mingle and boasts an undeniably private jet vibe.” \nThe Australian Business Traveller Awards are organised by the Australian Business Traveller, the Asia Pacific region’s leading website for business travellers and frequent flyers. The Awards recognise the trend-setters and game-changers in the highly competitive business travel market across 33 categories including first class suites and business class seats, airport lounges, frequent flyer programmes, inflight food and wine, travel technology and more. \nQatar Airways has seen rapid growth in just 18 years of operations, and is currently flying a modern fleet of 163 aircraft to 151 key business and leisure destinations across Europe, the Middle East, Africa, Asia Pacific and the Americas.", "external_links": [], "published": "2015-08-11T16:12:00.000+03:00", "crawled": "2015-08-11T16:43:57.395+03:00", "highlightTitle": ""}