{"organizations": ["Travel Advice"], "uuid": "1606618842022a9592e73232614231fd3ba0e90a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goamsterdam.about.com", "main_image": "http://f.tqn.com/y/goamsterdam/1/S/O/F/-/-/128400805.jpg", "site_section": "http://z.about.com/6/o/m/goamsterdam_t2.xml", "section_title": "About.com Amsterdam Travel: What's Hot Now", "url": "http://goamsterdam.about.com/od/amsterdammonthlyguides/a/January-In-Amsterdam-Travel-Advice-Weather-And-Events.htm", "country": "US", "title": "January in Amsterdam - Travel Advice, Weather...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "January in Amsterdam - Travel Advice, Weather...", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T14:08:00.000+03:00", "replies_count": 0, "uuid": "1606618842022a9592e73232614231fd3ba0e90a"}, "author": "", "url": "http://goamsterdam.about.com/od/amsterdammonthlyguides/a/January-In-Amsterdam-Travel-Advice-Weather-And-Events.htm", "ord_in_thread": 0, "title": "January in Amsterdam - Travel Advice, Weather...", "locations": ["Amsterdam"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "January in Amsterdam - Travel Advice, Weather & Events What to Expect from Amsterdam in January Sign Up for our Free Newsletters Thanks, You're in! Health Tip of the Day Sign up There was an error. Please try again. Please select a newsletter. Please enter a valid email address. Did you mean ? \nAmsterdam in December | Amsterdam Travel by Month | Amsterdam in February > \nJanuary in Amsterdam is imbued with an unmistakable post-holiday calm. Visitors are free to alternate between the outdoor chill and the cozy, climate-controlled indoors; brisk walks around town are a treat on clear days, and when the wintry climate loses its appeal, travelers can find respite from the cold in museums, cafes, restaurants and more. The city is as tourist-free as ever this month, but even in the off-peak season, Amsterdam still offers a full calendar of fantastic events and activities, from yearly events to memorable once-offs. Seasonal perks, from ice rinks to koek-en-zopie stands - the catch-all term for rink-side refreshments - are also in full supply; don't miss cold-weather staples such as stamppot , oliebollen and more before the warmer months roll around! \nPros Airfares and hotel rates are at their lowest in January, as companies try to attract customers with competitive rates The tourist crowds are also at their yearly low, so January visitors have the run of Amsterdam's popular museums, attractions and more January is a top month for sales in Amsterdam , with discounts of up to 70%; clothes horses will love the combination of the semi-annual sales with another semi-annual phenomenon: Amsterdam Fashion Week (see below) \nCons While winters in Amsterdam are not especially harsh, expect cold temperatures and precipitation (mostly rain; snow is infrequent) - see January Temperatures & Rain below Some attractions are closed on New Year's Day (January 1) \nJanuary Temperatures & Rain Average high: 40°F (4.4°C) Average low: 31°F (-0.5°C) Average precipitation: 2.7 in (69 mm) \nYearly Festivals & Events in January New Year's Day January 1 As in most countries worldwide, January 1 is a national holiday in the Netherlands - and a day to recuperate from the hijinks of New Year's Eve. Note that many tourist attractions and other businesses will be shuttered for the day; see this list of museums and attractions open on New Year's Day , or check with individual attractions for holiday closures or reduced hours. Amsterdam International Fashion Week Amsterdam's semi-annual fashion week is the top event on the capital's fashion calendar, and its \"off-schedule\" events ensure plenty to see and do even beyond the catwalk. While official Fashion Week events are for industry insiders only, Fashion Week DOWNTOWN puts on exhibitions, shows, launches, parties and more for the broader public. Impro Amsterdam The International Improvisational Theater Festival, or Impro Amsterdam for short, ad libs its way into its 17th edition at Amsterdam's Rozentheater. Teams of actors from BeNeLux, Brazil, Germany, Canada, Japan, New Zealand, USA, France and elsewhere come to extemporize in front of live audiences over six days of performances. Jumping Amsterdam This annual Dutch equestrian tournament is sure to please hippophiles with its bevy of handsome horses and skillful riders. Top athletes in a number of horse sports return annually to compete before an enthralled audience in an intimate atmosphere; beside the competitions, horse shows, merchandise, food and drinks, musical entertainment and special children's shows round out the event. Paradiso Korendagen (Choir Days) The 26th edition of Paradiso's Choir Days features 140 different choirs for nearly 24 hours' worth of choral performances. The immense variety of the international choirs treats listeners to pop, jazz, folk, soul, world music and more. Tickets, at just € 2.50, are available at the door. Related Articles", "external_links": [], "published": "2015-08-11T14:08:00.000+03:00", "crawled": "2015-08-11T22:44:46.372+03:00", "highlightTitle": ""}