{"organizations": [], "uuid": "5cc6e41c74a2c90298c0ebe48ccd7de2642c8ac9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww2.hdnux.com/photos/40/25/74/8478465/7/rawImage.jpg", "site_section": "http://www.seattlepi.com/lifestyle/travel/", "section_title": "Travel: Air, Land and Sea Guides and Resources - seattlepi.com", "url": "http://www.seattlepi.com/news/us/article/Dig-at-NY-Colonial-battleground-uncovers-fort-s-6448761.php", "country": "US", "title": "Dig at Colonial battleground uncovers fort's stone walls", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Dig at Colonial battleground uncovers fort's stone walls - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "5cc6e41c74a2c90298c0ebe48ccd7de2642c8ac9"}, "author": "CHRIS CAROLA", "url": "http://www.seattlepi.com/news/us/article/Dig-at-NY-Colonial-battleground-uncovers-fort-s-6448761.php", "ord_in_thread": 0, "title": "Dig at Colonial battleground uncovers fort's stone walls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LAKE GEORGE, N.Y. (AP) — An archaeological dig at an 18th-century military site in the southern Adirondacks has uncovered large sections of stone walls that are believed to have been constructed within a larger British fortification that was never completed more than 250 years ago.\nThe excavations at the state-owned Lake George Battlefield Park wrapped up on Friday, with some work being done this week to protect exposed walls by lining them with sandbags. During the six-week summer field school sponsored by the nearby State University of New York at Adirondack, about four dozen volunteers and students dug numerous pits in an area that was occupied by thousands of British and Colonial American soldiers during the French and Indian War.\nMusket balls, gun flints and pottery pieces were among the artifacts found amid a 35-acre park that gets few visitors despite being located in the middle of a busy summer tourist town.\nDavid Starbuck , the archaeologist who led the dig, said the most significant find was the intact stone walls buried in a bastion of Fort George, which the British never finished building.\nIn 1759, the commander of British forces in North America, Jeffery Amherst , ordered the construction of a large fort on rising ground near the lake's southern end, the site of two previous battles. The British army engineer assigned to the task, James Montresor , would also build the English fort at Crown Point on Lake Champlain.\nWith the British capture of the French fort at Ticonderoga in the summer of 1759, Amherst halted the work on Fort George. Only one corner bastion of the stone and earthen fort was completed, along with an interior stone building. The interior structure may have been part of an underground casemate, a chamber usually constructed underneath a fort's rampart. A casemate could serve as a barracks or a place to store supplies such as gunpowder, and burying it would make it less likely to blow up during a bombardment.\nThe fort fell into disrepair after the war ended in 1763, but the bastion was used by the Americans when the Revolutionary War started. The British captured Fort George in 1777, only to lose it again after their defeat at Saratoga that year. The redcoats recaptured the bastion in 1780. What remains is a U-shaped, 20-foot-high grass-covered ruin of the bastion, with the interior sloping upward from the U's open end.\nExperts from the state historic site at Crown Point, where the ruins of the British fort still stand, viewed the uncovered walls at the Fort George dig and saw comparisons in the way the two fortifications were constructed, Starbuck said. Another recent visitor to the site, former National Park Service archaeologist David Orr , called the Lake George site \"just amazing\" in terms of what's being discovered from an often overlooked period of American history.\nStarbuck usually digs at local sites where wooden forts once stood. Finding a structure with stone walls 6 feet high and up to 5 feet thick is a major highlight after 25 years of digging at military sites in the region.\n\"We're looking at something that was used and rebuilt and improved upon for 20 years or more. I think that prompted them to build it more strongly,\" he said. \"It's not something we expected.\"\nStarbuck said he hopes to return to the Fort George site next year for another summer of digging.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-08-17T03:00:00.000+03:00", "crawled": "2015-08-18T05:59:46.959+03:00", "highlightTitle": ""}