{"organizations": [], "uuid": "1d1c66344724c67dfd94e4cb33d6904266156bd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29854015/spatium-an-exclusive-spa-from-vidanta-resorts-to-be-featured-in-upcoming-episode-of-bachelor-in-paradise", "country": "US", "title": "Spatium, An Exclusive Spa From Vidanta Resorts, To Be Featured In Upcoming Episode Of Bachelor In Paradise", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Spatium, An Exclusive Spa From Vidanta Resorts, To Be Featured In Upcoming Episode Of Bachelor In Paradise - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "1d1c66344724c67dfd94e4cb33d6904266156bd8"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29854015/spatium-an-exclusive-spa-from-vidanta-resorts-to-be-featured-in-upcoming-episode-of-bachelor-in-paradise", "ord_in_thread": 0, "title": "Spatium, An Exclusive Spa From Vidanta Resorts, To Be Featured In Upcoming Episode Of Bachelor In Paradise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Vidanta\nCouple to visit secluded spa only available to Grand Luxxe resort guests for signature tequila massage\nNUEVO VALLARTA, Mexico , Aug. 21, Grand Luxxe, the premier luxury hotel at Vidanta resort in Vallarta Nayarit, will have Spatium – the resort's exclusive spa – featured in an upcoming episode of ABC's summer reality series Bachelor in Paradise. One lucky couple will break away from their fellow contestants for an intimate and relaxing afternoon spent at Spatium, complete with the spa's signature Viva Tequila Relief Massage.\nThe episode featuring a visit to Spatium at the Grand Luxxe in Vallarta Nayarit is scheduled to air Sunday, August 23rd, 2015 , at 8/7c on ABC.\nSpatium rests secluded within the Grand Luxxe resort grounds, a large oasis surrounded by gardens that delivers special design in peace and tranquility. Recently expanded, Spatium at Vidanta resort in Vallarta Nayarit now features an outdoor hydrotherapy area with cold plunge tubs, a steam room and men's, women's and coed Jacuzzis. The Bachelor in Paradise couple will enjoy the privacy of Spatium's outdoor massage palapas for the signature Viva Tequila Relief Massage, a stimulating aromatherapy and massage treatment that uses Mexican tequila to awaken and calm the body's senses. To top off the couple's trip to Spatium, they will enjoy premium tequila margaritas.\nSpatium, which is available exclusively to guests of the AAA Five Diamond Award-winning Grand Luxxe resort, offers a full menu of massages, body wraps and facials inspired by worldly ingredients and cultures from ancient Mexico to the Mediterranean and India . Guests of Spatium can enjoy a Mexican Obsidian Stone Massage, Thai holistic rituals or even Diamond Magnetic Ritual scrubs and wraps. Private indoor massage cabins or secluded outdoor palapas are available exclusively for Spatium visitors staying with the Grand Luxxe resort.\nFrom the creator of The Bachelor franchise, summer series Bachelor in Paradise features some of The Bachelor' s biggest stars and most talked about villains. They all left The Bachelor or The Bachelorette with broken hearts but now they know what it really takes to find love, and on Bachelor in Paradise they'll get a second chance to find their soul mates. For six weeks, the group will live together in Mexico in an isolated romantic paradise and, over the course of six episodes, these former bachelors and bachelorettes will explore new relationships, fall in love or go through renewed heartbreak. The romantic dating series will feature twists, shocking surprises, unexpected guests and some of the most unlikely relationships in Bachelor history, plus all the usual romance, drama and tears of the Bachelor franchise. It all comes together in the romantic television event of the summer, airing Sundays and Mondays at 8/7c.\nTo request to visit Spatium or the Grand Luxxe resort at Vallarta Nayarit, call 1-800-292-9446. For more information, visit Vidanta.com .\nABOUT VIDANTA RESORTS\nVidanta resort at Vallarta Nayarit is a luxury beach destination from Grupo Vidanta, a leading developer of world-class resorts and tourism infrastructure in Mexico and Latin America with practices in architecture, product design, entertainment, construction and operations. The full-service tourism developer counts AAA Five Diamond Award-winning Grand Luxxe Nuevo Vallarta and five AAA Four Diamond Award-winning resorts among its impressive portfolio of more than 25 resorts and hotels.\nGrupo Vidanta's visionary approach brings vacation dreams to life at Vidanta resorts and mega-resorts with brands including Grand Luxxe, The Grand Bliss, The Grand Mayan, The Bliss, Mayan Palace, Ocean Breeze and Sea Garden, and more in development. The company employs more than 15,000 individuals and is consistently recognized as one of the most revered employers in Latin America .\nGrupo Vidanta has partnerships with renowned Nicklaus Designs, Greg Norman Golf Course Design and Cirque du Soleil , with whom Grupo Vidanta debuted JOYÀ , the first resident Cirque du Soleil show in Mexico , in 2014. Daniel Chávez Morán founded the company in 1974.\nFor more information about Grupo Vidanta or to request to visit Vidanta resort at Vallarta Nayarit, visit vidanta.com or call 1-800-292-9446.\nABOUT BACHELOR IN PARADISE\nFrom the creator of the Bachelor franchise, and hosted by Chris Harrison , it's Bachelor in Paradise . Some of The Bachelor' s biggest stars and villains are back. They all left The Bachelor or The Bachelorette with broken hearts but now they know what it really takes to find love, and on Bachelor in Paradise they'll get a second chance to find their soul mates. From Next Entertainment in association with Warner Horizon Television, the series is executive produced by Mike Fleiss , Martin Hilton , Alycia Rossiter , Nicole Woods , Peter J. Scalettar and Elan Gale.\nFor more information on Bachelor in Paradise, visit http://abc.go.com/shows/bachelor-in-paradise .\nPhoto - http://photos.prnewswire.com/prnh/20150821/260302\n releases/spatium-an-exclusive-spa-from-vidanta-resorts-to-be-featured-in-upcoming-episode-of-bachelor-in-paradise-300131967.html\n ", "external_links": ["http://www.vidanta.com/en/destinations/nuevo-vallarta/spatium", "http://abc.go.com/shows/bachelor-in-paradise", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA84817&Transmission_Id=201508211728PR_NEWS_USPR_____DA84817&DateId=20150821", "http://www.prnewswire.com/news-releases/spatium-an-exclusive-spa-from-vidanta-resorts-to-be-featured-in-upcoming-episode-of-bachelor-in-paradise-300131967.html", "https://photos.prnewswire.com/prnvar/20150821/260302", "http://vidanta.com/", "http://photos.prnewswire.com/prnh/20150821/260302"], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-22T02:54:42.421+03:00", "highlightTitle": ""}