{"organizations": [], "uuid": "0d6c2b7808faaf0c4db894fc03830b9d6c3e88f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/travel/", "section_title": "Forbes - Travel Information and Travel News - Forbes.com", "url": "http://www.forbes.com/sites/bazdreisinger/2015/08/31/how-to-visit-rome-and-never-leave-your-resort-behold-the-rome-cavalieri/", "country": "US", "title": "How to Visit Rome and Never Leave Your Resort: Behold The Rome Cavalieri", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "How to Visit Rome and Never Leave Your Resort: Behold The Rome Cavalieri", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T23:02:00.000+03:00", "replies_count": 0, "uuid": "0d6c2b7808faaf0c4db894fc03830b9d6c3e88f3"}, "author": "Baz Dreisinger", "url": "http://www.forbes.com/sites/bazdreisinger/2015/08/31/how-to-visit-rome-and-never-leave-your-resort-behold-the-rome-cavalieri/", "ord_in_thread": 0, "title": "How to Visit Rome and Never Leave Your Resort: Behold The Rome Cavalieri", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Surely that headline is a misnomer. How dare anyone visit the Eternal City and not leave the hotel ?Here’s how: Check into the Rome Cavalieri, Waldorf Astoria Hotels & Resorts. Located on Rome’s highest hilltop, minutes from the city center and the Vatican City, the regal 52-year-old property is a destination in and of itself—capable of serving up everything you came to Rome for, in one fell swoop. Behold its offerings:[caption id=\"attachment_168\" align=\"\" width=\"1940\"] Rome Cavalieri by night[/caption] ART Hotel staff joke that Rome Cavalieri is not a hotel but a museum that rents rooms. Indeed the 10,000 or so pieces making up its exceptional collection of paintings, tapestries, and period furniture adorn every inch of the property, from the 17 th century Giovanni Battista Tiepolo triptych in the lobby—it’s a national treasure—to the magnificent Zais piece hanging over the concierge and the authentic Nureyev costumes on display outside the Imperial Lounge. Tours can be scheduled with in-house art historian Alexandra Massini and there’s also an iPod guide through the collection. But the real beauty lies in living with the art instead of merely ogling it. The hotel even offers a “Tea with Tiepolo” experience, during which masterpieces becomes your own personal backdrop. [caption id=\"attachment_165\" align=\"\" width=\"1940\"] Rome Cavalieri: lobby artwork[/caption][caption id=\"attachment_166\" align=\"\" width=\"1940\"] Rome Cavalieri: lobby artwork[/caption] SIGHTS They’re all at your fingertips--on display from every balcony in the hotel’s 345 rooms and 25 suites. Never mind the hustle and bustle of trekking through crowded streets; spy the Vatican, St. Peter’s Basilica and essentially every other Rome landmark from the comfort of your plush room.[caption id=\"attachment_172\" align=\"\" width=\"1940\"] Deluxe room[/caption] FOOD Pasta, pizza, wine, and so on: Indulge in all the Italian must-eats at six food and beverage outlets at the hotel—but especially at La Pergola, the only three-star Michelin restaurant in Rome, overseen by chef Heinz Beck. The breakfast buffet doesn’t disappoint, either, with a spread featuring all the cured meats, olive-oil selections and homemade cheeses you’d expect from a Roman feast. ROMAN-STYLE R&R Just try to peel yourself away from 15 acres of lush park, four swimming pools, two tennis courts and the Grand Spa, featuring a Turkish Bath decked out in marble platforms and Roman mosaics, not to mention products by La Cremerie (champagne and rose petal scrub, anyone?). I parked myself at the garden pool and was serenaded for hours by a chorus of crickets and chiming church bells. GRATUITOUS OPULENCE If it’s not over-the-top opulent, it wouldn’t be Rome. The hotel knows this well. So there’s a pillow menu—millet stuffing? kapok flakes? spelt chaff?—signature scents for order and special deliveries of wine, cheese and honey served in your room at welcome random hours. If you want to take overindulgence to the next level, book one of the hotel’s “supersuites.” They will, quite literally, take your breath away: The Savonnerie carpet in the majestic Napoleon Suite, the Lagerfeld couches, original Warhols and private rooftop Jacuzzi in the Planetarium Suite.[caption id=\"attachment_167\" align=\"\" width=\"1940\"] Planetarium Suite terrace[/caption] BUT IF YOU MUST LEAVE… Rome Cavalieri offers free shuttle service to the city center. Or sign up for exclusive tours such as one inspired by Paolo Sorrentino’s Oscar-winning Italian film La Grande Bellezza , during which guests explore locations throughout the Eternal City featured in the film and enjoy a private reception at the home of Marchioness Violante Guerrieri Gonzaga, on the rooftop terrace of Palazzo Taverna—where the views are rivaled only by the ones back in your hotel room. waldorfastoria3.hilton.com/en/hotels/italy/rome-cavalieri-waldorf-astoria-hotels-and-resorts-ROMHIWA/index.html", "external_links": [], "published": "2015-08-31T23:02:00.000+03:00", "crawled": "2015-08-31T18:19:56.480+03:00", "highlightTitle": ""}