{"organizations": [], "uuid": "8a964732f1746a1101a5433614ef360f0b9d7781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03424/selfie-stick-japan_3424409k.jpg", "site_section": "http://www.telegraph.co.uk/newsfeed/rss/travel_main.xml", "section_title": "Telegraph Travel", "url": "http://www.telegraph.co.uk/travel/destinations/asia/japan/11835078/Japan-our-tour-guide-disappeared-in-a-forest-of-selfie-sticks.html", "country": "CH", "title": "Japan: our tour guide disappeared in a 'forest of selfie-sticks'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Japan: our tour guide disappeared in a 'forest of selfie-sticks'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T17:05:00.000+03:00", "replies_count": 0, "uuid": "8a964732f1746a1101a5433614ef360f0b9d7781"}, "author": "Stella Beddoe", "url": "http://www.telegraph.co.uk/travel/destinations/asia/japan/11835078/Japan-our-tour-guide-disappeared-in-a-forest-of-selfie-sticks.html", "ord_in_thread": 0, "title": "Japan: our tour guide disappeared in a 'forest of selfie-sticks'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Japan Japan: our tour guide disappeared in a 'forest of selfie-sticks' Stella Beddoe wins £200 for her account of a visit to Japan, where ancient traditions and modern mores meet - in a sea of selfie sticks The selfie stick; the modern counterpart to Japan's thousands of years of history Photo: Getty By Stella Beddoe Comments \nWith relief we boarded the Thunderbird 28 limited-express train, bound for Kyoto. For three days Ms Asakura, a tiny, toothy, ex-headmistress of a guide, had relentlessly shepherded her little flock around picturesque towns in central Honshu. We were three pairs of middle-aged professionals from three continents, but she was unwilling to let anyone out of her sight unescorted, even to the lavatory. At Kanazawa railway station she twitched with anxiety; some of us needed a comfort break, others wanted bento boxes for the journey and she could not accompany us all. Meanwhile the men had legged-it to a distant platform trying to spot a shinkansen bullet train at rest . Having promised to reconvene at the appointed time (or 10 minutes earlier, as she preferred) in order to be led to our train we persuaded her to find herself some lunch. \nAt Kyoto we hit a wall of early summer heat and hundreds of schoolchildren, all taking their annual educational excursions. The following day we joined a three-coach party to view some of the principal sights. Masako, a minute but imperious guide of indeterminate age, took charge of the herd. Shoeless, we padded softly after her along the corridors of Nijo Castle, whose wooden, 'Nightingale’ floors chirrup and squeak, iron nails scraping on iron supports. We nearly lost sight of Masako’s pink pom-pom, attached to a telescopic antenna, when it was briefly hidden, at Kinkaku-ji, the Golden Pavilion, by a sea of girls in sailor suits surging beneath a bristling forest of selfie-sticks. \nAt Nijo Castle, we nearly lost sight of our guide's pom pom in a sea of selfie sticks (AP) \nBack on the coach, stragglers were reprimanded for jeopardising our brief time slot to visit the former Imperial Palace. We had completed official forms, requesting entrance, which were briskly collected before all the visitors were disgorged onto the sandy parade-ground outside the Palace Gates. We were instructed to form neat lines, six abreast. Masako’s upper lip was dewy as she and her fellow guides ran up and down the lines, counting furiously, before sprinting some distance to hand over the sheaf of forms to the officials at the entrance. Checking and confirmation of numbers took time. It was midday and, as the shade temperature soared to 40C we could feel the blood pulse in our ears. \n• 13 strange and beautiful Japanese islands you must visit \nThat afternoon we were put in the eccentric charge of Yoshi, a seasoned 70-year old showman with longish grey hair wearing a battered safari jacket. He revealed knowledge of everyone’s home town, from Brighton to Canberra to Cleveland before deftly folding origami storks for children and attempting to teach adults basic kangi. He introduced us to the sika deer of Nara and the vast, bronze, Virocana Buddha (length of ear 2.54m.) who presides, in dignified silence, over the seething masses visiting the Todaji Temple. He later made a bitter-sweet joke that no modern woman would marry him since he lacked a college degree, owned neither house nor car and, as the eldest son, was obliged to support his widowed mother, now in her 90s. Tradition runs deep in modern Japan. Enter the next round \nEmail your entry, in 500 words (with the text in the body of the email), to justback@telegraph.co.uk by midnight on Tuesday September 1. For terms and conditions, see telegraph.co.uk/justback . The winner will receive £200 in the currency of their choice from the Post Office. \nClick here for more information and full terms and conditions \nThe Post Office is the UK’s largest travel money provider. It offers more than 70 currencies with 0% commission. Customers can buy selected currencies over the counter at 8,000 branches and all currencies can be ordered for next-day delivery at 11,500 branches. Orders can also be placed online at postoffice.co.uk .", "external_links": [], "published": "2015-08-31T17:05:00.000+03:00", "crawled": "2015-08-31T17:44:32.612+03:00", "highlightTitle": ""}