{"organizations": [], "uuid": "b2860955c5392e6cc86bf3676f13d32d4f3fd41e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 8 p.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_BRIEF_UNRULY_FLIGHT_PASSENGER_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "FBI: Drunken man pushed flight attendant, threatened to kill", "performance_score": 0, "site": "ap.org", "participants_count": 1, "title_full": "FBI: Drunken man pushed flight attendant, threatened to kill", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T02:56:00.000+03:00", "replies_count": 0, "uuid": "b2860955c5392e6cc86bf3676f13d32d4f3fd41e"}, "author": "By JENNIFER SINCO KELLEHER", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_BRIEF_UNRULY_FLIGHT_PASSENGER_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "FBI: Drunken man pushed flight attendant, threatened to kill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Links Yesterday's Places HONOLULU (AP) -- A college student traveling to Maui for a vacation instead has spent his time in jail after the FBI accused him of drunkenly threatening to kill passengers, shoving a flight attendant and busting out of plastic handcuffs on a flight from Seattle. A judge on Friday ordered Eric Matthew Schneider, 23, of Northern California, to undergo mental-health and substance-abuse evaluations at a Honolulu halfway house. After that, he will be able to head home after posting a $10,000 bond, returning to Hawaii for court dates. \"He's sorry the whole thing happened,\" Peter Wolff, Schneider's federal public defender, said after the detention hearing in federal court. Schneider, a waiter and student, doesn't remember what happened, Wolff said. Schneider, who wore a prison jumpsuit to the hearing in Honolulu, was traveling with his girlfriend on the Delta Air Lines flight Monday. He had a double tequila cocktail and demanded more alcoholic drinks, according to the FBI's criminal complaint. Two hours into the flight, passengers seated near Schneider started pushing their call lights, complaining that he was making threats and wanting to move seats, the court documents said. When a flight attendant tried to calm Schneider, he became more agitated, swearing at the crew member, advancing on him and then pushing him. Then, \"when a nearby passenger tried to calm Schneider down, Schneider threatened to kill the passenger,\" the complaint says. The flight attendant followed Schneider to the galley area, where there was another physical confrontation, ending with Schneider falling into a passenger's lap. \"Simultaneously, Schneider grabbed the curtain between the galley and the passenger seating area, and ripped it off its rings,\" an FBI agent wrote in the complaint. When he was restrained with plastic handcuffs, he slid one of his hands out, the complaint said. Flight attendants were able to restrain Schneider before the flight landed, Delta said in a statement. Law enforcement officers were waiting when the flight arrived. --- Follow Jennifer Sinco Kelleher at http://www.twitter.com/JenHapa .", "external_links": [], "published": "2015-08-08T02:56:00.000+03:00", "crawled": "2015-08-08T09:25:54.182+03:00", "highlightTitle": ""}