{"organizations": [], "uuid": "a66bc6a6dc6e8daca48614ee60108db3d879ceb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/30/12932711/Fall Special Offers_Boston Hotel.jpg", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/boston_hotel/boston_park_plaza_hotel/prweb12932711.htm", "country": "US", "title": "Boston Park Plaza Hotel, a Boston Hotel, Has Impressive Special Offers to Fall Visitors", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Boston Park Plaza Hotel, a Boston Hotel, Has Impressive Special Offers to Welcome Fall Visitors", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "a66bc6a6dc6e8daca48614ee60108db3d879ceb5"}, "author": "Michael Hibdon", "url": "http://www.prweb.com/releases/boston_hotel/boston_park_plaza_hotel/prweb12932711.htm", "ord_in_thread": 0, "title": "Boston Park Plaza Hotel, a Boston Hotel, Has Impressive Special Offers to Fall Visitors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fall is a great time to visit Boston, and Boston hotels are getting ready to welcome the many visitors who will come to enjoy autumn in the City. Boston Park Plaza Hotel offer to entice visitors. Some of the offers are described below, and all current offers can be seen on the hotel’s website. View offer details > Fall is a busy season for trade shows in Boston, and it’s also the time of year when people come to New England from around the country to see the fall foliage. Boston Park Plaza Hotel has special offers that are appropriate for both business and leisure travelers. The Concierge at the Boston Hotel will be happy to discuss the best places to view the changing leaves, or suggest a nearby Restaurant for a business meeting.\nThose planning a visit can take advantage of these and other special offers at Boston Park Plaza Hotel.\nPark & Play Offer\nThis popular offer includes valet parking, so guests won’t need to worry about finding and paying for parking during their stay. This offer also includes accommodations at the hotel’s lowest rate. Many visitors find that the public transportation and city taxis are so convenient that they leave their vehicles in the hotel’s valet parking lot during their entire stay.\nBoston’s Best Breakfast Package\nWhether one is in town for business or pleasure, enjoying a big breakfast is a great way to start the day. This offer includes a full buffet breakfast from Off the Common Restaurant. Both healthy and indulgent choices can be found on the buffet, so there is something to suit every taste.\nAAA and AARP Offers\nMembers of AAA and AARP can enjoy special rates that are not available to the public. Proof of membership is required upon check in to get these great rates. Special rates are also available for members of the military and for government employees.\nAbout The Boston Park Plaza Hotel - A Boston Hotel:\nThe Boston Park Plaza Hotel is part of the rich history that defines Boston as one of the most beautiful cities in America and a top travel destination. This historic Boston Hotel is located in Back Bay, one of the most beautiful areas of the city – just yards from Boston Common, America’s oldest public park.\nThe Boston Park Plaza Hotel – A Boston Hotel conveys class and elegance throughout its exceptional concierge and guest services, 1,054 finely-appointed guest rooms and guest suites, premier dining with 6 on-site Boston restaurants including STRIP by Strega. Other guest services include a 24-hour fitness center, 24-hour business center, and 50,480 square-feet of exceptional Boston meeting space.\nVisit the Boston Park Plaza Hotel website .\nView current special offers.\nVisiting Boston? Consider The Boston Park Plaza Hotel - Check rates, make reservations or call toll free: 800.225.2008.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5ib3N0b25wYXJrcGxhemEuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5ib3N0b25wYXJrcGxhemEuY29tL29mZmVycw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9ib3N0b25wYXJrcGxhemEucmV6dHJpcC5jb20vIw=="], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T16:23:06.041+03:00", "highlightTitle": ""}