{"organizations": [], "uuid": "775e3ebd13afa8627ffc82178d9d0359fd87464b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/28072-beverly-hills-conference-visitors-bureau-reports-record-growth", "country": "US", "title": "Beverly Hills Conference & Visitors Bureau reports record growth", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Beverly Hills Conference & Visitors Bureau reports record growth", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T13:30:00.000+03:00", "replies_count": 0, "uuid": "775e3ebd13afa8627ffc82178d9d0359fd87464b"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/28072-beverly-hills-conference-visitors-bureau-reports-record-growth", "ord_in_thread": 0, "title": "Beverly Hills Conference & Visitors Bureau reports record growth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Beverly Hills Conference & Visitors Bureau reports record growth Beverly Hills Conference & Visitors Bureau reports record growth Details Category: Agency & Association   11:30 On the heels of its centennial in 2014, the City of Beverly Hills experienced record growth in fiscal year 2014-2015 due to the efforts of Beverly Hills Conference & Visitors Bureau (BHCVB) and its hospitality partners. Transient Occupancy Tax (TOT) grew 10.5%, 6.5% higher than the city’s initial projections for the year. Additionally, domestic travel to Beverly Hills, which represents 37% of the market, grew over 60%, while international travel, representing 63% of the market, grew over 30% from the fiscal year prior. \nThe impressive numbers are attributed to BHCVB’s intensive sales and marketing initiatives throughout the year, ranging from international and domestic travel tradeshows and sales missions, the creation of compelling online content, interactive social media engagement, strategic media relations and PR efforts across the globe, exciting events and much more. “Although we’ve had a tremendous year with increased domestic sales and brand awareness for Beverly Hills in key international feeder markets, we have to continue to be proactive,” said Julie Wagner, Chief Executive Officer, BHCVB. “In an addition to maintaining our momentum for the destination, we’ve also created a three-year strategic plan for our organisation that helps ensure we are constantly bringing fresh and innovative ideas to marketing Beverly Hills, bringing even more tourism and revenue to the city.” A major factor of BHCVB’s success in fiscal year 2014-2015 is attributed to a deeper focus on sales for the destination. In this first year ofthe organisation’s concentrated group sales strategy alone BHCVB established a strong sales engine which booked a total of 2,200 reported room nights, generating more than $1.3 million in estimated revenue to city businesses. BHCVB’s trade team, in conjunction with the city’s hotels, also conducted first-ever sales events in San Francisco and Chicago, as well as participated in the U.S. edition of the IMEX travel tradeshow for the third consecutive year, reaching the most influential meetings, incentive travel and event professionals around the country. Alongside the Beverly Hills Chamber of Commerce and City of Beverly Hills, BHCVB also held a productive joint sales mission in New York City to encourage more travel and business to Beverly Hills. Another revenue generator for the city included the annual Milken Conference, which was held in Beverly Hills for the third consecutive year, with the support of BHCVB. The event drew in more than 3,500 people from 55 countries and 41 states to Beverly Hills over a four-day period. BHCVB also hosted its fourth Chinese New Year event at the Saban Theatre in February 2015, which was sponsored by the Chinese Government and featured acclaimed entertainment from Beijing. The event was sold-out and enjoyed by the nearly 2,000 in attendance, including local Beverly Hills and Los Angeles residents as well as travellers from China and all over the world. To expand its trade and marketing efforts even further across the globe, BHCVB travelled to more than 12 countries in fiscal year 2014-2015 to market the destination and generate leads with top press, travel agents and tour operators worldwide. Efforts included tradeshows, sales missions and press networking events in Australia, Brazil, Canada China, France, India, Japan, Mexico, South Korea, Taiwan, United Arab Emirates and the United Kingdom. BHCVB also acquired new travel trade and public relations representation to produce strategic opportunities for Beverly Hills in key international feeder markets, including Australia, China, Brazil and the United Kingdom & Ireland, driving further awareness, tourism and revenue to Beverly Hills. In the spirit of proactive planning and bold thinking in marketing Beverly Hills, BHCVB also turned its focus onto itself and worked internally as a team as well as with BHCVB Board of Directors to create a three-year strategic plan to maintain momentum and grow the organisation’s successes. Over the next three years, BHCVB will focus on plans to grow demand for the destination, leverage strategic partnerships, enhance the Beverly Hills brand and work to ensure a vital Conference & Visitors Bureau. The organisation has already met one of its goals by being awarded with the Destination Marketing Accreditation Program (DMAP) seal by Destination Marketing Association International (DMAI), the global trade association for DMOs worldwide. BHCVB earned the prestigious accreditation at the 2015 Annual DMAI Conference in Austin, Texas. Related articles", "external_links": [], "published": "2015-08-05T13:30:00.000+03:00", "crawled": "2015-08-05T13:35:40.422+03:00", "highlightTitle": ""}