{"organizations": ["Trans World Corporation Announces 2015 Second Quarter Financial Results Trans World Corporation"], "uuid": "8678481b32c2d0589349b984d0f33364bb220756", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtTWQ==", "section_title": "Business Wire Travel: Lodging News", "url": "http://www.businesswire.com/news/home/20150807005081/en/Trans-World-Corporation-Announces-2015-Quarter-Financial", "country": "US", "title": "Trans World Corporation Announces 2015 Second Quarter Financial Results", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Trans World Corporation Announces 2015 Second Quarter Financial Results", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T15:30:00.000+03:00", "replies_count": 0, "uuid": "8678481b32c2d0589349b984d0f33364bb220756"}, "author": "", "url": "http://www.businesswire.com/news/home/20150807005081/en/Trans-World-Corporation-Announces-2015-Quarter-Financial", "ord_in_thread": 0, "title": "Trans World Corporation Announces 2015 Second Quarter Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trans World Corporation Announces 2015 Second Quarter Financial Results Company to host quarterly conference call today at 2:00 p.m. ET \nHighlights of 2015 Second Quarter (year-over-year comparisons) Net income increased by 9.7% to $710,000; Revenue increased by 3.6% to approximately $9.8 million; Income before foreign income taxes increased 18.0% to approximately $1.1 million; Slot game and live game attendance increased by 20.5% and 28.3%, respectively; EBITDA increased by 17.7% to approximately $1.6 million; and Purchase of Hotel Freizeit Auefeld, a 93-room property with 11 meeting rooms, completed during the period. \nHighlights of 2015 Year-to-Date (year-over-year comparisons) Net income rose by 8.8% to $1.2 million; Total revenue increased by 3.9% to approximately $19.3 million; Income before foreign income taxes increased 15.6% to approximately $1.9 million; Slot game and live game attendance increased by 19.5% and 24.1%, respectively; and EBITDA increased by 14.1% to approximately $2.8 million. August 07, 2015 08:30 AM Eastern Daylight Time \nNEW YORK--( BUSINESS WIRE )--Trans World Corporation (“TWC” or the “Company”) (OTCQB:TWOC), a premier owner and operator of casinos and hotels in Europe, today reported financial results for the quarter and six months ended June 30, 2015. \nMr. Rami Ramadan, Chief Executive Officer, commented, “TWC had another strong quarter with increases in net income, revenue and EBITDA for the three and six month periods of 2015. During the second quarter, our casino operations continued to do well and we saw double-digit increases in consolidated attendance and slot revenue. The promotional events that we hosted during the quarter, in addition to our player loyalty rewards programs and our efforts to provide superior customer service, contributed to the improvements for the quarter and six month periods. Although the Company’s total revenue for the second quarter would have been higher had it not been negatively impacted by the devaluation of the Czech koruna against the US dollar, all of our casinos showed year-over-year earnings improvements.” \n“Further, our hotel segment performed well this quarter, which included one month’s worth of revenue from our newest property, the Hotel Freizeit Auefeld, and have helped to offset the negative impact of weaker euro and Czech koruna currency to the US dollar.” \nHotel Freizeit Auefeld \nIn June 2015, the Company completed the acquisition of the Hotel Freizeit Auefeld, a four-star, 93-rooms, business and leisure hotel property, located in Hann. Münden, Germany, a two-hour drive from Frankfurt. The hotel features a fitness center, a recreation center that includes four tennis courts and two squash courts, two bowling alleys, a meeting hall, a restaurant and two bars. The total acquisition cost for the property was approximately $5.3 million, which included real estate transfer taxes, closing costs and bank fees. The property was acquired with $275,000 in cash, approximately $2.5 million in seller-financing, with terms of 3.0% annual interest and amortization over 10 years, and assumed bank debt, comprised of five loans, totaling approximately $2.2 million, with an average fixed interest rate of 4.94%. The assumed bank debt will convert in November 2015 to a single loan with the same lender, at a bank agreed-upon terms of 2.99% annual interest, fixed for 10 years, and amortization over 15 years. The acquisition was previously announced on June 19, 2015. The Company believes that the future cash flow from this hotel operation can support the hotel debt. \n2015 Second Quarter \nNet income increased by 9.7% to $710,000, or $0.08 per diluted share, from $647,000, or $0.07 per diluted share, for the same prior year quarter. \nTotal revenue increased by 3.6% to approximately $9.8 million, compared with $9.4 million for the same quarter of the prior year, largely from incremental revenue from Trans World’s hotel segment which offset the negative impact of the depreciation of the Czech koruna against the US dollar. \nThe Company reported income before foreign income taxes of approximately $1.1 million, compared with $915,000 reported for the same quarter in 2014. TWC incurred foreign income taxes of $370,000, as compared with a foreign income tax expense of $268,000 for the second quarter of the prior year. \nEBITDA in the second quarter of 2015 rose by 17.7% to approximately $1.6 million, versus $1.3 million in the prior year’s quarter. A table reconciling EBITDA, a non-US GAAP, or non-GAAP (Generally Accepted Accounting Principles) financial measure, to the appropriate GAAP measure is included with the Company’s financial information below. \n2015 Year-to-date \nNet income rose by 8.8% for the six months ended June 30, 2015 to $1.2 million, or $0.13 per diluted share, as compared with approximately $1.1 million, or $0.12 per diluted share, for the first six months of the prior year. All the operating units, despite lower revenues from foreign exchange translation, reported income improvements over the prior year. \nFor the six months ended June 30, 2015, total revenue was approximately $19.3 million, a 3.9% increase from $18.5 million for the same six-month period of the prior year, primarily due to the approximate $1.4 million generated from TWC’s hotel segment. \nThe Company incurred a foreign income tax expense of $652,000 for the first six months of 2015, as compared with $498,000 for the same period of the prior year. As previously mentioned, the additional expense was due to a higher income base. \nEBITDA was approximately $2.8 million, an increase of 14.1% from approximately $2.5 million for the same six-month period in 2014. \nBalance Sheet Highlights \nThe Company had cash and cash equivalents of $6.6 million at June 30, 2015, which was relatively the same as of December 31, 2014. As of June 30, 2015, stockholders’ equity was approximately $38.7 million, compared with approximately $39.6 million at December 31, 2014. The reduction in 2015 was due to the effect of the weaker euro and Czech koruna to the dollar . \nNon-GAAP Financial Measures \nThis press release may utilize a number of financial measures that are not used when preparing our financial statements in accordance with GAAP. Management believes that these non-GAAP financial measures reflect the results of our operations or financial condition in other ways, are common to the casino industry, and are commonly used by lending institutions and investors in evaluating our performance in comparison to our competitors and the market in general. This belief is based on conversations and meetings our management has had with our lenders and investors where the substance of these talks has typically centered on historical and prospective EBITDA measurements. Based on management’s observations, even though the EBITDA and other noted measurements are not GAAP, they do enhance investors’ understanding of the Company’s business. \nIn short, these performance measurements give an analytical view of the Company’s operational earnings and EBITDA, in particular, reflect earnings on a cash-basis, excluding the impact of debt obligations and non-cash depreciation and amortization. \nManagement presents, and uses for its own analysis, EBITDA as a supplemental disclosure because management believes that it is widely used in the casino and hotel industry to measure performance and is one of the basis for the valuation of our Company in the market. EBITDA measures our ability to meet our working capital requirements, make capital expenditures and perform analyses on possible acquisitions that may include the need for debt service requirements. \nThe following defines the non-GAAP financial measures used in TWC’s press releases: “Drop per head” is the per guest average dollar value of gaming chips purchased. “EBITDA” is earnings before interest, taxes, depreciation and amortization. “Live game attendance” is the number of patrons who played at our table games during a particular period. “Live games business” is the total dollar value of revenues generated by our table games. “Slot business” is the total dollar value of revenues generated by our slot machines. “Slot game attendance” is the number of patrons who played our slot machines during a particular period. “Win percentage” is the ratio of net win (the difference between gaming wagers and the amount paid out to patrons) to total drop (the dollar value of gaming chips purchased in a given period). \nThe Company has presented the table below to reconcile EBITDA, a non-GAAP financial measure to its most directly comparable GAAP measure. \nFor further information regarding our results of operations and financial condition for the year ended December 31, 2014, please refer to our Annual Report on Form 10-K as filed with the Securities and Exchange Commission. \nConference Call \nThe Company will discuss these results in a conference call today at 2:00 PM ET. \nThe dial-in numbers are:Live Participant Dial-In (Toll-Free): 877-407-9037Live PARTICIPANT Dial-In (International): 201-493-6738 \nThe conference call will also be webcast live via the Investor Relations section of Trans World’s website at www.transwc.com , or by clicking the following link: http://transwc.equisolvewebcast.com/q2-2015 . \nAbout Trans World Corporation \nTrans World Corporation, founded in 1993, is a publicly-traded, Nevada corporation, headquartered in the U.S., with all of its casino and hotel operations in Europe. Additional information about TWC can be found on the Company’s website at www.transwc.com . \nThe press release herein contains certain forward-looking statements and data regarding operating trends and future results of operations. For this purpose, any statements and data contained herein that are not historical fact may be deemed to be forward-looking data. Without limiting the foregoing, words such as “may,” “will,” “expect,” “believe,” “anticipates,” “estimates,” or “continue” or comparable terminology or the negative thereof are intended to identify certain forward-looking statements. These statements, by their nature, involve substantial risks and uncertainties, both known and unknown, and actual results may differ materially from any future results expressed or implied by such forward-looking statements. Such risks include but are not limited to, our dependence on our current management, the regulatory environment in which our operations reside, uncertainties over the development and success of our current and future casino and hotel operations, general global macroeconomic and local economic conditions, extreme weather, and changes in tax or gaming laws or regulations. Additional information concerning potential factors that could affect the Company’s financial results, including other risks and uncertainties, is disclosed in our periodic reports filed with the U.S. Securities and Exchange Commission, including our Form 10-K for the year ended December 31, 2014. The Company undertakes no obligation (and expressly disclaims any such obligation) to publicly update or revise any forward-looking statements or data whether as a result of new information, future events or otherwise. TRANS WORLD CORPORATION AND SUBSIDIARIES CONDENSED CONSOLIDATED INCOME STATEMENT Six and Three Months Ended June 30, 2015 and 2014 (in thousands, except for share and per share data)", "external_links": [], "published": "2015-08-07T15:30:00.000+03:00", "crawled": "2015-08-07T17:12:06.977+03:00", "highlightTitle": ""}