{"organizations": [], "uuid": "e94330c555438110d1de05fcd8daf628faf62d0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gogirlguides.com", "main_image": "http://gogirlguides.com/wp-content/uploads/2014/01/winter-blues.jpg", "site_section": "http://feeds.feedburner.com/GoGirlGuides", "section_title": "Go! Girl Guides - Helping Women Travel The World", "url": "http://gogirlguides.com/health/beating-the-winter-blues/", "country": "US", "title": "Beating the Winter Blues", "performance_score": 0, "site": "gogirlguides.com", "participants_count": 1, "title_full": "Beating the Winter Blues", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T11:18:00.000+03:00", "replies_count": 0, "uuid": "e94330c555438110d1de05fcd8daf628faf62d0c"}, "author": "Angelica Wilk", "url": "http://gogirlguides.com/health/beating-the-winter-blues/", "ord_in_thread": 0, "title": "Beating the Winter Blues", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Beating the Winter Blues by Angelica Wilk on August 4, 2015 \nDo you get the winter blues? More like winter depression for me! More of us have been questioning if we have the “Seasonal Depressive Disorder”, and I’ve got to say it does truly exist. \nWhen the winter comes, I long for summer and high temperatures. I am less motivated and nothing seems to be that fun. I can not wait for summer to come and constantly immerse myself into searching sales and resorts for my imaginary trips I wish I were on that instant. \nHere again, another winter has arrived and it’s time to deal with the blues. Here are some things to make it easier if you feel the same: Engage in a new activity – This will help you focus and make life more enjoyable. Maybe you pick up a hobby you used to have or begin a new one – reading, photography, the Wii, baking etc. Form a goal – Whether it is a New Years resolution, training for a race, or booking a weekend trip somewhere, take steps to accomplish it. Even checking daily deals on websites will feed your wanderlust and you might find a good sale. Reunite with old friends and family – Is it weird how sometimes the winter can leave you bored and longing to do something exciting? Make it a point to see a different friend/family member every week and catch up on news. Follow and Meet Other Bloggers – Even when following fellow bloggers, notice if they might be coming to your neighborhood. See if they’re asking for tips or got any spare time to meet up with a local or a blogger if you are one yourself. Attend meet-ups – These are being held all over nowadays and you can find all kinds – travel meetups, movie lovers, entrepreneurs, singles, bar crawls, you name it. It’s a great opportunity to get out there if no one else wants to do anything and to make new friends/connections. Take day or weekend tours to sights – If you’re not traveling and staying put for a while, see some attractions you haven’t visited in a while, even if it has only been since last winter. Check out if there are new exhibits or shows. A day trip might still make you feel as if you were taken away. Go to the beach or the lake – In the winter? Sure why not. Seeing any body of water will increase those endorphines you feel when it’s summer. It may be bloody cold but at least you made it there. Try not to think about the winter blues – This is probably the hardest thing to do. If you keep yourself busy and find things you enjoy, those winter blues will become much more tolerable. Article by Angelica Wilk \nAngelica is a Double Psychology Major who loves to travel and influencing others to do the same. While hopping around islands and cities across the globe, she enjoys documenting her journeys. She scuba dives and is the Online Editor for Go! Girl Guides.", "external_links": [], "published": "2015-08-04T11:18:00.000+03:00", "crawled": "2015-08-05T01:27:16.729+03:00", "highlightTitle": ""}