{"organizations": ["Taormina Travel Guide Martin Child/Digital"], "uuid": "f37a3eac435e7767e65130166edbdc16543b46b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goitaly.about.com", "main_image": "http://f.tqn.com/y/goitaly/1/S/F/Z/-/-/200549755-001.jpg", "site_section": "http://z.about.com/6/g/goitaly/b/index.rdf", "section_title": "About Italy Travel", "url": "http://goitaly.about.com/od/taormina/p/taormina_sicily.htm", "country": "US", "title": "Taormina Travel Guide", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Taormina Travel Guide", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T00:28:00.000+03:00", "replies_count": 0, "uuid": "f37a3eac435e7767e65130166edbdc16543b46b6"}, "author": "", "url": "http://goitaly.about.com/od/taormina/p/taormina_sicily.htm", "ord_in_thread": 0, "title": "Taormina Travel Guide", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Martin Child/Digital Vision/Getty Images Why Visit Taormina: \nTaormina has been one of Sicily's top travel destinations since it became part of the European Grand Tour in the 19th century and Sicily's first resort. \nTaormina has remnants of the Greeks and Romans, a fine medieval quarter and castle ruins, and modern shops and restaurants. Perched on the side of Monte Tauro, the town offers fantastic views of the coast and Mount Etna volcano. Below the town are excellent beaches where you can swim in the clear sea water. Although Taormina can be visited all year, spring and fall are the best times. July and August are hot and crowded. Taormina Location: \nTaormina is 200 meters above sea level on Monte Tauro on Sicily's east coast. It's 48km south of Messina, Sicily's closest city to the mainland. Mount Etna volcano is about a 45 minute drive southwest of Taormina and farther south is Catania, one of Sicily's largest cities. Taormina Hotels: \nThe luxury hotel El Jebel is right in the center of town. Also in the center are the 4-star Villa Carlotta in a garden setting overlooking the sea and Hotel Villa Angela in a park setting with views of Mount Etna and the bay. A less expensive option right in the historic center is the 2-star Hotel Victoria . \nBelow town near the sea, my friends recommend Atahotel Capotaormina with a private beach. The 4-star Panoramic Hotel is right on the waterfront near Isola Bella and Taormina Park Hotel is on the road heading down to the sea. \nSee more Taormina hotels on Hipmunk and find the best prices for your dates. Taormina Transportation: \nTaormina is on the rail line between Messina and Catania and can be reached by train directly from Rome. The station, Taormina-Giardini , is 2km below the center served by shuttle buses. Regular buses run from Palermo, Catania, the airport, and Messina arriving in the center of town. The closest airport, Fontanarossa in Catania, is an hour drive and has flights to some Italian and European cities (see Italy Airports Map ). A car ferry runs from the mainland to Messina, then take the A18 along the coast about 30 minutes. Driving in the center is limited. There are two large parking lots on the outskirts. Taormina Restaurants: \nTaormina has many excellent restaurants in all price ranges. It's a great place for seafood and outdoor dining, often with views. Near the duomo, Casa Grugno serves cuisine that's a mix of modern and traditional in a medieval Gothic-Catalan residence. Ristorante da Lorenzo , Via Roma 12, serves seafood on a terrace overlooking the sea. Traditional Sicilian food is served at Ristorante la Griglia , Corso Umberto 54 , on an outside terrace during nice weather. An inexpensive choice is Porta Messina , next to the city walls at Largo Giove Serapide 4. Taormina Shopping: \nCorso Umberto , in the center of town, is a good place for shopping. Many shops sell high quality items, mostly from Sicily, although you'll find designer fashions and jewelry from mainland Italy, too. There are shops for fashion, jewelry, crafts, mosaics ceramics, puppets, porcelain dolls, and other souvenirs. Festivals and Events: \nTaormina Arte festival runs from June through August. Plays, concerts, and a film festival are held outdoors in the Greek Theater during summer. Madonna della Rocca is celebrated the second weekend of September with a religious procession and feast. Taormina has one of the best Carnival celebrations in Sicily. In May there's a traditional costume and Sicilian cart fair. What to See: \nTop attractions include the Greek theater, medieval quarter, shopping and beaches. See Taormina Top Sights and Attractions for details about what to see and do. Related Articles", "external_links": [], "published": "2015-08-19T00:28:00.000+03:00", "crawled": "2015-08-19T08:09:26.101+03:00", "highlightTitle": ""}