{"organizations": ["Kobe Inc.", "Alibaba", "Alibaba Group", "Alibaba Group Announces Wide Ranging Deal With Kobe Inc", "Taobao Marketplace", "Alibaba Pictures"], "uuid": "23c00494bea3610840f9fbfaf976c717d09b6213", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_6_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13240639/1/alibaba-group-announces-wide-ranging-deal-with-kobe-inc.html?cm_ven=RSSFeed", "country": "US", "title": "Alibaba Group Announces Wide Ranging Deal With Kobe Inc.", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Alibaba Group Announces Wide Ranging Deal With Kobe Inc.", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T11:00:00.000+03:00", "replies_count": 0, "uuid": "23c00494bea3610840f9fbfaf976c717d09b6213"}, "author": "", "url": "http://www.thestreet.com/story/13240639/1/alibaba-group-announces-wide-ranging-deal-with-kobe-inc.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Alibaba Group Announces Wide Ranging Deal With Kobe Inc.", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bryant", "Kobe Bryant", "Jack Ma", "Muse", "Kobe"], "text": "Alibaba Group Announces Wide Ranging Deal With Kobe Inc. By Business Wire | 08/03/15 - 04:00 AM EDT Reprint Alibaba Group Holding Limited (NYSE:BABA) today announced an agreement with Kobe Inc., a newly formed company by the renowned basketball superstar Kobe Bryant. The Alibaba Group will release Kobe's recent video narrative, Kobe Bryant's Muse, exclusively through Tmall Magic Box on August 8, 2015. In addition, Alibaba Pictures, an affiliate of Alibaba Group, will work with Kobe Inc. to create a series of Kobe branded products and distribute them through Alibaba Group's popular retail platforms including Taobao Marketplace and Tmall.com, which are accessed by over 350 million active buyers throughout China. This is the latest of international retailers partnering exclusively with Alibaba Group to access Chinese consumers with their content, goods and services. The video narrative, Kobe Bryant's Muse, was produced in its entirety by Kobe himself, where he shares his philosophies of life and reviews the ups and downs of his life on the court. The narrative will be available for viewing at Tmall Magic Box for 8 RMB. \"I believe there is power in understanding the journey of others to help create your own,\" said Bryant. \"This narrative is an intimate look at who I am as a person, not what I am. My dream is that others are inspired by my personal story and create epic life stories of their own.\"\"We are pleased to partner with Kobe to inspire young people all across China and encourage them to dream big and reach for their potential,\" said Jack Ma, Executive Chairman of the Alibaba Group. \"Kobe is an innovative entrepreneur who has established a legacy that extends far beyond the basketball court and is someone who can bring positive impact to the players and fans of basketball in China. As the champion of entrepreneurs, Alibaba is proud to welcome Kobe into our ecosystem to work together on this meaningful project which we hope can have a positive impact on the youth in China.\" 1 of 3", "external_links": [], "published": "2015-08-03T11:00:00.000+03:00", "crawled": "2015-08-03T11:42:47.050+03:00", "highlightTitle": ""}