{"organizations": [], "uuid": "444d06864ae3d13eee5c6dbb031f61e5781d2d11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/08/570cb736-3e16-11e5-a580-5d86ec2e3b6f-1200x630.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/nation-world/hand-wringing-in-gop-after-donald-trumps-crude-remarks-on-megyn-kelly/", "country": "EU", "title": "Hand-wringing in GOP after Donald Trump’s crude remarks on Megyn Kelly", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Hand-wringing in GOP after Donald Trump’s crude remarks on Megyn Kelly | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T01:19:00.000+03:00", "replies_count": 0, "uuid": "444d06864ae3d13eee5c6dbb031f61e5781d2d11"}, "author": "Jonathan Martin", "url": "http://www.seattletimes.com/nation-world/hand-wringing-in-gop-after-donald-trumps-crude-remarks-on-megyn-kelly/", "ord_in_thread": 0, "title": "Hand-wringing in GOP after Donald Trump’s crude remarks on Megyn Kelly", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Donald Trump’s suggestion that a Fox News journalist had questioned him forcefully at the Republican presidential debate because she was menstruating cost him a speaking slot Saturday night at an influential gathering of conservatives in Atlanta. It also raised new questions about how much longer Republican Party leaders would have to contend with Trump’s disruptive presence in the primary field.\nContinuing his complaints about Megyn Kelly, one of the moderators of the debate, in an interview on CNN Friday night, Trump said: “You could see there was blood coming out of her eyes, blood coming out of her wherever.” The remark prompted Erick Erickson, the leader of RedState, the conservative group, to disinvite him.\n“If your standard-bearer has to resort to that,” Erickson told hundreds of conservative activists in a packed Atlanta hotel ballroom Saturday: “We need a new standard-bearer.”\nWith Trump at center stage Thursday in Cleveland, Fox News shattered television viewership records for a primary debate: Nearly 24 million people watched. But any hopes that Trump, the real-estate developer and television celebrity, would try to reinvent himself as a sober-minded statesman or would collapse under scrutiny and tough questions, vaporized in the opening minutes when he refused to rule out running as an independent candidate for president. His remarks Friday only furthered the impression that he had no intention of speaking more carefully.\n Boy hurt in fall at Taylor Swift concert at CenturyLink Trump denied Saturday that he had been implying that Kelly was menstruating. “I think only a degenerate would think that I would have meant that,” he said in an interview, insisting he had been referring to Kelly’s nose and ears.\nBut as his latest eruption rippled through Republican circles, the conversation turned to whether the party, and his rival presidential contenders, should continue to accommodate his candidacy, quietly hoping that this would be the moment he burned out — or whether they should try to run him out on a rail.\nIf party leaders saw danger in provoking a breakup — and the advantage to be seized from the ratings bonanza Trump showed himself capable of delivering — there were signs other influential Republicans would tolerate only so much of Trump’s behavior.\n“Come on,” Jeb Bush, who has campaigned as the adult among the party’s 17 presidential candidates, said at the RedState gathering. “Give me a break. Do we want to win? Do we want to insult 53 percent of all voters?”\nOther candidates also criticized Trump. Carly Fiorina, the former Hewlett-Packard chief executive, who delivered perhaps the most assertive turn in Thursday’s debate among the candidates trailing in the polls, expressed support for Kelly late Friday and posted on Twitter: “Mr. Trump: There. Is. No. Excuse.”\nSen. Lindsey Graham of South Carolina, one of Trump’s harshest critics, went further, saying: “Enough already with Mr. Trump. As a party, we are better to risk losing without Donald Trump than trying to win with him.”\nYet in a sign of the lingering reluctance among some in the field to anger Trump’s supporters, other candidates, including former Gov. Mike Huckabee of Arkansas and Sen. Ted Cruz of Texas, would not condemn Trump’s comments. Sen. Marco Rubio of Florida, in an interview to be broadcast Sunday, praised Kelly but stopped short of calling on Trump to apologize. “I’ve made a decision here with Donald Trump, you know, if I comment on everything he says, my whole campaign will be consumed by it,” he said.\nErickson — an author with his own track record of inflammatory remarks, sometimes about women — said late Friday on the RedState website that he was disinviting Trump. He said he admired Trump for his bluntness and for connecting with “so much of the anger in the Republican base.”\n“But there are even lines blunt talkers and unprofessional politicians should not cross,” he wrote. “Decency is one of those lines.”\nHe added: “I just don’t want someone on stage who gets a hostile question from a lady and his first inclination is to imply it was hormonal.”\nTrump’s campaign shot back at Erickson, calling him a “weak and pathetic leader” and his decision “another example of weakness through being politically correct.”\nBut Saturday, Trump seemed to recognize he needed to create a diversion from the latest controversy and said he had fired Roger Stone, a Republican strategist and mischief-maker who had long been an adviser. But Stone said in an interview that he had resigned because the tenor of the campaign was distracting from Trump’s core message.\nIn an interview with The New York Times on Friday, before he went on CNN, Trump said he was irritated by the debate moderators’ questions about a third-party candidacy, saying he wanted to run as a Republican, but he repeated his threat to mount one if he is unhappy with his treatment by party leaders.\nAn independent candidacy would be complicated and costly, he said, but: “If you’re rich, it’s doable.”\nSome Republicans were trying to determine who was rallying to Trump’s side, and how damaging it would be if his supporters left the party’s fold. “Trump isn’t and wasn’t going to get the conservative vote,” Joseph McQuaid, publisher of the Union Leader newspaper in New Hampshire, said in an email. “Trump’s base is more the people who used to have season tickets to the Roman Colosseum,” McQuaid wrote.\nOthers said the voters rallying to Trump represented a constituency Republicans would be foolish to ignore. “People have to get their minds wrapped around the fact that the seething fury at the leadership of the Republican Party is real, and it’s going to bubble over somehow with somebody, and right now it’s with Trump,” said talk-show host Laura Ingraham.\nEven before Friday night, prominent Republican women said they were worried about how female voters would respond to Trump’s prominence on the debate stage, where he defended imprecations like “fat pigs” and “bimbo” to describe women.\nBut Trump’s comment Friday about Kelly caused consternation among senior Republican leaders, who saw it as the latest distraction from the business of choosing a presidential candidate who can return the White House to the party in 2016.\n“We need to nominate somebody who can win, somebody who is substantive and somebody who knows how to govern,” said former Sen. Judd Gregg of New Hampshire. “But we can’t have that debate … as long as we’re sidetracked off on this Trump exercise.”\nSome in the party have mused about using Trump’s refusal to rule out an independent bid as grounds to bar him from future debates, but there is concern such an effort would only prod him into pursuing such a run.\nIt also appeared unlikely any network could be persuaded to exclude him. As Trump crowed Friday in a telephone interview: “I’m a ratings machine.”\nJonathan Martin : 206-464-2605 or jmartin@seattletimes.com ; on Twitter: @jmartin206 . Jonathan Martin has covered social services, politics, prisons and, most recently, the marijuana beat since joining the Seattle Times in 2002 from the Spokesman-Review in Spokane. He is a University of Washington graduate and was a Knight-Wallace journalism fellow at the University of Michigan. He is co-author of \"The Other Side of Mercy,\" about the 2009 Lakewood police officer shootings. He lives in Wallingford with his wife, Francesca, and their two children, who attend Seattle public schools. Maggie Haberman", "external_links": ["http://twitter.com/jmartin206"], "published": "2015-08-09T01:19:00.000+03:00", "crawled": "2015-08-09T12:22:17.580+03:00", "highlightTitle": ""}