{"organizations": [], "uuid": "966b9dd62b912216c49a44812c6c8face687bbdf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03412/OldMutual-three-go_3412551k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-19.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/sport/golf-challenge/11812365/celtic-manor-fourth-regional-final.html", "country": "US", "title": "It’s Hancock’s halved hour in Celtic Manor countdown", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "It’s Hancock’s halved hour in Celtic Manor countdown - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T23:58:00.000+03:00", "replies_count": 0, "uuid": "966b9dd62b912216c49a44812c6c8face687bbdf"}, "author": "Oliver Pickup", "url": "http://www.telegraph.co.uk/sponsored/sport/golf-challenge/11812365/celtic-manor-fourth-regional-final.html", "ord_in_thread": 0, "title": "It’s Hancock’s halved hour in Celtic Manor countdown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The fourth and last regional final of the inaugural Old Mutual Wealth Golf Challenge was hosted by Celtic Manor in Newport, the venue for the 2010 Ryder Cup. And much like Europe’s thrilling success over the United States on that occasion, there was again drama in south Wales. Ross-on-Wye’s Harvey Hancock and Geoff Lewis, a member at Lilleshall Hall, both had rounds of 77 to finish at the head of the 24-strong men’s amateur field. Only after countback, where the net score is calculated over the last nine holes, was Hancock confirmed the Wales and South West region victor. With both advancing to next month’s Grand Final at the spectacular Old Head Golf Links near Kinsale in Co Cork, Ireland, all that really mattered was that the pair were in the top two berths. The women’s competition brought equal excitement, with Rebecca Tilke, of Woodbury Park, the runaway leader after shooting 82. Behind her Brenda Oxford and Suzanne Brown, respectively of The Kendalshire and Radyr clubs, both shot 85, with Oxford securing second place on countback. Almost 600 golf clubs in England, Scotland and Wales have entered the first Old Mutual Wealth Golf Challenge and the Grand Final, which takes place on 28 and 29 September, will feature eight men and women going for glory in the company of Sam Torrance, the 2002 Ryder Cup-winning captain, 2014 vice-captain and eight times Ryder Cup player. LEADERS Men Harvey Hancock (Ross-on-Wye) 77 Geoff Lewis (Lilleshall Hall) 77 Julian Reynolds (East Devon) 78 Women Rebecca Tilke (Woodbury Park) 82 Brenda Oxford (The Kendalshire) 85 Suzanne Brown (Radyr) 85 • Discover more about the Old Mutual Wealth Golf Challenge »", "external_links": [], "published": "2015-08-19T23:58:00.000+03:00", "crawled": "2015-08-19T19:50:10.619+03:00", "highlightTitle": ""}