{"organizations": [], "uuid": "4e93adcf13d170a9bcd14a379988d4a516048572", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28253-the-north-east-oyster-festival-moves-to-newcastle", "country": "US", "title": "The North East Oyster Festival moves to Newcastle", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "The North East Oyster Festival moves to Newcastle", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T12:00:00.000+03:00", "replies_count": 0, "uuid": "4e93adcf13d170a9bcd14a379988d4a516048572"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28253-the-north-east-oyster-festival-moves-to-newcastle", "ord_in_thread": 0, "title": "The North East Oyster Festival moves to Newcastle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The North East Oyster Festival moves to Newcastle The North East Oyster Festival moves to Newcastle Details Category: Venues & Events Created on Friday, 14 August 2015 10:00 One of the North East's biggest corporate events is offering businesses from across Tyneside the chance to network in style this autumn. The North East Oyster Festival, run by Ramside Estates, annually attracts hundreds of businesses leaders all keen to enjoy an evening of fine dining and entertainment, while making contacts and raising money for charity at the same time. . \nThis year, to coincide with the Rugby World Cup at St James Park, the event is going on tour for the first time in its 12 year history and relocating from Hardwick Hall Hotel, County Durham to the Rugby World Cup Fanzone at Science Central, Newcastle. There, on Friday September 25, the festival will offer a day of live music and entertainment led by The Pub Landlord, Al Murray. The legendary comedian, who has fronted countless TV shows and tours across the UK, will be joined by Motown act Martha Reeves and the Vandellas, whose hits include Heatwave, Jimmy Mack and Dancing in the Street, as well as Celtic party bands Dublin Raiders and the JJ Galway Band. There will also be an appearance by multi-platinum selling bagpipers, Red Hot Chilli Pipers who have appeared at a host of major events, including BBC Proms in the Park, since winning BBC talent show When Will I Be Famous in 2007. In between the live entertainment there will be opportunities to socialise and to network, all while enjoying a champagne reception and oyster stalls, as well as complimentary lager, beer and wine and a three course fruit de mer dinner, prepared by the expert chefs at Ramside Event Catering. Representatives from Marie Curie, which supports people and families coping with a terminal illness, will also be in attendance throughout the afternoon, raising funds through a number of activities. John Adamson, Director of Ramside Estates, said: “The North East Oyster Festival been a popular choice for corporate entertaining, staff rewards and all manner of business benefits since launching 12 years ago. “This year we’re looking forward to moving to Newcastle and opening our doors to the city’s business community.” Related articles", "external_links": [], "published": "2015-08-14T12:00:00.000+03:00", "crawled": "2015-08-14T12:19:38.248+03:00", "highlightTitle": ""}