{"organizations": [], "uuid": "368228f6eaa8d9423d0c2538911ea0a37e9333d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ynetnews.com", "main_image": "http://www.ynetnews.com/PicServer4/2015/08/30/6263872/62638630992399640360no.jpg", "site_section": "http://www.ynetnews.com/home/0,7340,L-3087,00.html", "section_title": "Travel from Israel, Ynetnews", "url": "http://www.ynetnews.com/articles/0,7340,L-4695652,00.html", "country": "IL", "title": "Tel Aviv's top 6 hidden hotels", "performance_score": 0, "site": "ynetnews.com", "participants_count": 1, "title_full": "Tel Aviv's top 6 hidden hotels - Israel Travel, Ynetnews", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T04:16:00.000+03:00", "replies_count": 0, "uuid": "368228f6eaa8d9423d0c2538911ea0a37e9333d2"}, "author": "ynetnews", "url": "http://www.ynetnews.com/articles/0,7340,L-4695652,00.html", "ord_in_thread": 0, "title": "Tel Aviv's top 6 hidden hotels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet\nIn the words of the Beatles – do you want to know a secret? Six, actually, but all variations on the theme of planning a stay in Tel Aviv without depending on the same chain hotels as everyone else.\n In many cities boutique hotels play the funky B-sides to the corporate world’s cookie-cutter hotel hit-list, and in that respect Tel Aviv is no different. And it’s not always about bedding down in über-luxury, as location and atmosphere can count even more than high thread counts.\nSunny Tel Aviv. (Photo: Anthony Grant)\n So do dope roof terraces and/or good sea views. So with that in mind – let's get started.\n 1. Hotel Gilgal\nIn most beachy burgs you pay a premium to be close to the sea, whether that means a sea view from your room, an easy walk to the nearest beach or both. But the bright, airy guestrooms at this hotel (which I found one day quite by accident when looking for a bus in the altogether wrong place) won't break the bank.\nThe Gilgal is owned by Jacob and Elisheva Damkani, but more importantly it's a place where you can enjoy a big Israeli breakfast on the roof, with a view of the Mediterranean. This is almost my favorite seaside hotel in Tel Aviv.\nHotel Gilgal\n2. Hotel Savoy\nThis is my favorite seaside hotel in Tel Aviv, and that has a lot to do with location on Geula Street, which, as Tel Aviv insiders know, is one of the few city streets that slopes down directly to the sea. The Savoy may not be directly on the beach, but for Tel Aviv it's about as close as you can get.\nThe Savoy is about as close as you can get to being directly on the beach. (Photo: Anthony Grant)\n The rooms are mostly mediocre in size but they're thoughtfully configured, with beds that seem like a variation on those thick and comfy Westin Heavenly Beds. Big cushioned headboards with floral motifs are the only splashes of color to offset the otherwise mainly black-and-white decor.\nEven the standard rooms feature sliding glass doors that open onto small balconies, most with at least partial sea views. An unhurried vibe prevails here, absent of loud tour groups, which perhaps was part of the draw for past guests including David LaChapelle and Karim Rasheed.\n 3. The Poli\nSpeaking of Karim Rasheed, the design wunderkind whose technicolor hues jazz up hip hotels from Berlin to Brighton, the countdown has begun to the anticipated fall opening of The Poli. Originally slated to be branded as 'Sir Benjamin' by an Amsterdam-based hotel group, the Poli will eventually open under the stewardship of Leon Avigad, owner and manager of the Brown TLV hotel.\nRelaxing at the Poli (artist's rendering) Word on the street is that guests and locals alike are in for some truly eye-popping design (Rasheed is not bashful about his brights) and even a rooftop pool. And the street's a lively one: Nachalat Binyamin, near the entrance to the Carmel Market.\n 4. The Brown Beach House\nFans of the Brown TLV Hotel with a yen to be just steps from the Tel Aviv seaside will want to check out this smart new addition that's even closer to the beach, on Hayarkon Street.\nThere are 40 stylish rooms and suites, putting the property easily in the boutique category, along with a cafe, Flamingo Bar (think pink) and small spa. Hotelier Leon Avigad knows his stuff.\nBrown Beach House\n5. Townhouse Tel Aviv\nThere are more than a few boutique style hotels that have emerged on and around Rothschild Boulevard in the past few years, but this one remains my favorite.\n It's got chic style with furnishings from Kastiel and just 19 rooms. My favorites are the ones with the views out over Yavne Street.\nTownhouse Tel Aviv\n 6. The Rothschild\nFor those who want to be so close to the tableau vivant of Tel Aviv street life they can almost hear the footsteps (though at a posh remove), there’s The Rothschild, right on the boulevard (number 96).\n Not to forget its bigger sister hotel, the Diaghilev Art Hotel, with really roomy rooms, many with balconies, in a renovated 1934 building that was once a printing house. An off-radar but plugged in kind of place.\nThe Rothschild\n 7. TLV2Go\nThis one really is a secret, though it’s not strictly speaking a hotel. Nomads of any stripe will find reason to put their roaming on hiatus thanks to TLV2Go, which from what I've seen (which is to say, a lot) is the best short-term furnished apartment agency in Tel Aviv, with the most varied inventory.\nThe properties are well-located, come in all styles and sizes and are managed with the professionalism you come to expect from much pricier accommodations.\nTLV2Go\nAnthony Grant can be followed on Twitter @AGi24\n Tweet", "external_links": ["https://www.facebook.com/pages/Ynetnews/129653250402500?fref=ts", "http://images1.ynet.co.il/PicServer4/2015/08/30/6263871/62638620100074490490no.jpg", "http://www.townhousetelaviv.com/", "http://images1.ynet.co.il/PicServer4/2015/08/30/6263870/62638610100693640360no.jpg", "https://apis.google.com/js/plusone.js", "http://www.the-rothschild-hotel.com/", "http://www.hotelgilgal.com/", "http://brownhotels.com/beach/", "http://images1.ynet.co.il/PicServer4/2015/08/30/6263872/62638630992399640360no.jpg", "https://twitter.com/share", "http://twitter.com/#!/ynetnews"], "published": "2015-08-31T04:16:00.000+03:00", "crawled": "2015-08-30T21:32:12.282+03:00", "highlightTitle": ""}