{"organizations": [], "uuid": "9e48a6d1029f9cd173265dabb8dc49ce7986ed70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelboldly.com", "main_image": "", "site_section": "http://www.travelboldly.com/feeds/posts/default", "section_title": "Travel Boldly", "url": "http://www.travelboldly.com/2015/08/Adventure-Travel-in-Galapagos-Islands-of-South-America.html", "country": "US", "title": "Travel Adventures in the Galapagos Islands", "performance_score": 0, "site": "travelboldly.com", "participants_count": 1, "title_full": "Travel Adventures in the Galapagos Islands", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T17:54:00.000+03:00", "replies_count": 0, "uuid": "9e48a6d1029f9cd173265dabb8dc49ce7986ed70"}, "author": "jerome shaw (noreply@blogger.com)", "url": "http://www.travelboldly.com/2015/08/Adventure-Travel-in-Galapagos-Islands-of-South-America.html", "ord_in_thread": 0, "title": "Travel Adventures in the Galapagos Islands", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Loading... Travel Adventures in the Galapagos Islands A female and a male giant tortoise approach one another other.(Are they flirting?) They reside inside an enclosure at Charles Darwin Research Station on Isla Santa Cruz. How Will I Ever Keep Up? by Sally McKinney The sun warms my skin during the half-hour boat ride from San Cristobal. Billy and I are both wearing swim suits, even though we’re older than the others, he’s “not a water person” and I’ve not been snorkeling for years. Soon Darwin’s Scuba Dive boat drops anchor near rocky Isla Lobos. To me, the water looks dark, deep. . .and scary. Timidly, I pause on the deck, planning my moves. After the others jump in or dive, I’ll sit on the top rung of the ladder, reach out, then roll off into a shallow dive. Rudely, someone behind me yells, “Jump!” Then I’m assaulted by a louder voice, “Just jump!” Surprisingly, I plunge into deep water and surface promptly. Through some miracle, my snorkel tube stands above the water and I can breathe air. One of the crew swims up to offer a life ring draped with ropes. I’m glad to hold on. My swim buddy leads me along a cliff wall where we move through a school of mauve, yellow-tail surgeon fish. On my right and above me, there’s a gray shape: a young sea lion. Beyond this one, another one, fully grown. Sea lions are often playful in water, but this pair is not. They move steadily away from us, yet I’m excited. We’re the first snorkelers from the boat to see them. When my energy starts falling, I paddle back to the boat and pull off the swim fins. Now, the problem. With my legs bent, feet on the lowest rung, I can’t pull myself up. “Climb on up” yells a voice from the deck. I pull up again, harder, but still lack the strength. Ready to help, Billy and a boatman both pull my arms from above. Soon I am sprawling across top rung, groping the wet deck, feet in the air. How ridiculous this must look. We’re all laughing. Add caption Billy and I had spent months planning this long trip with two weeks in the Galapagos Islands. Located in the Pacific Ocean about 600 miles (970 kilometers) west of Ecuador, the Galapagos archipelago measures 3,029 square miles (7,844 square kilometers). To stay within budget, we came up with this plan. Fly from Quito to San Cristobal. Stay in town three or four days. Explore on our own, either walking around, with a driver, or on a day tour. Mid-week, travel by ferry from Isla San Cristobal to Isla Santa Cruz. Continue with land-based touring. Meet up with the cruise ship on Isla Baltra. Take a Guantanamera cruise to eight more islands. Then fly from Isla Baltra back to Quito. During that first week in the islands, my biggest challenge: to keep up with Billy! Unlike me, a near-sighted book reader, he’s a sharp-eyed outdoorsman. In fact, he’ll return to Tanzania soon after the Ecuador trip to climb Mt. Kilimanjaro. On Isla San Cristobal, Billy and I enjoy walking from Casa Blanca to the nearby beach. Even during breakfast on the terrace, we watch magnificent frigatebirds, soaring over the harbor on thermals. From the pier, we photograph sea lions resting on the beach, the pups covered with sand. This coating of sand helps protect their skin from sun. During a day trip, I walk on a rickety bridge to reach a tree house high in a ceiba tree. Later, we hike to a crater rim where frigatebirds wash their wings by diving into the freshwater lake. On Santa Cruz, we have an equally good time. From our lodging in Puerto Ayora, we take long walks to the beaches on Tortuga Bay. Along the maze-like paths at Charles Darwin Research Station, we discover giant tortoises behind a fence, napping. Just before we leave, one of the males awakes, lumbers over to a female then climbs on top, attempting to mate. People gather around, murmuring, clicking cameras. After a few minutes, the female moves off, so the male ambles away, soon munches on green grass. From our lodging in Puerto Ayora, a long taxi ride followed by a short ferry crossing puts on on Isla Baltra. We meet guide, Javier Cadena and other passengers at the airport, then board the Guantanamera. We’d found the boat through HappyGringo.com . (I was thrilled the boat has a song!) The first night on the boat, during the long cruise to Isla Genovesa, the rolling, bumping and bouncing of the small boat keep me awake, fighting off nausea. The first full day of the cruise, a light rain is falling. After breakfast, I ride with others—people from six different countries—in a panga (inflatable boat) to Isla Genovesa. Somehow, I’ve lost sight of Billy (who probably climbed into the other boat). Unable to find a hand-hold on the panga, I’m afraid I’ll slip off the unstable, rubbery edge. After we land on the beach, I wait while the others go snorkeling, then set off on a so-called “easy hike.” The trail, marketed with white stakes, crosses rough, cracked dark lava field. After walking a while, awkward and unbalanced, I need to rest. After the others hike on ahead, I huddle on a rock like a black lump, wrapped in my poncho. During two weeks in these islands, I often pull a fleece over my swim suit, wrap a sarong around my legs (or shoulders), block wind or rain with my poncho, often wipe rain drops off my sunglasses! When Javier and the others come back over the lava, three of the young people, wearing only brief swim suits and flip-flops, look chilled and miserable—yet do not complain. Lunch on the boat becomes a welcome break. Afterward, instead of a nap (there’s no time for a nap?), I stumble back into the panga. We approach a rickety platform built into the face of a cliff. From water level, I notice a series of large boulder blocks above us, worn smooth. Are these supposed to be steps? Beside these blocks, there’s a rough, wooden railing. . .with gaps between the rails. “I don’t think I can do this,” I tell Javier. Since we met only yesterday, he may not realize I’m eighty years old. “Oh, yes you can” he replies, while pulling me from the rocking boat. Along with unstable balance, I’m seriously afraid of heights. I land on my feet, upright, but teetering, too close to the edge. Regular dancing twice a week back home should have improved my balance, but—clearly--it has not. So I warn myself, “Do not look down” The next so-called “step” is too high for me, even with my long legs. From behind, someone shoves me. From above, someone else yanks me up. On my left, I hold on to the railing, whenever I can—and keep climbing up. When I reach the trailhead, the rain has stopped. People from the panga hand me my daypack and a monopod that doubles as a hiking stick. Without help from the others, I would not have made it up those steps. The filtered, overcast light transforms the landscape into a dream world. Near the trail, exotic birds, warming their nests, look back at me. Beyond the booby nests, several male great frigate birds, their red gular sacs inflated, are spreading their wings, trying to impress females. During the coming week, I’ll marvel at sea turtles in a mangrove estuary and stroll among red-orange crabs on dark lava rocks. Yet, this scene on Genovesa remains my favorite, worth all the effort. After surviving that amazing first day, I stretch out—tired and shaken—on the bunk in Cabin Five. Without help from sure-handed strangers, I could have slipped off those boulders and plunged into the water. Amazing that I made it to the trailhead! So I rest there, thankful for everyone’s help and grateful to be alive. Of course, I love walking among unique creatures on these islands. Yet the schedule is “go, go, go” Breakfast at 7:00 am! Climb in and out of the panga. Take a two-hour hike. Then go snorkeling. Pause for lunch, do more hiking, more snorkeling. What am I doing in this watery boot camp? When can we all relax? How can I ever keep up? It does help that Cabin Five is on a level with the dining room, a small bar, and a library/lounge. However, to reach Upper Deck, I climb up step-ladder stairs. Once I climb up, I enjoy seawater views and get to sit in a chair! If I plan ahead, I can enjoy a sunset gin-and-tonic in the chair. After ordering the drink from Senor Kleber, I climb up the ladder. The bartender mixes my G & T, and finds an agile crewman who carries my drink up the ladder. Cabin Five, with its carpeted floor and ensuite bath, is the size of a walk-in closet in my former home. Billy and I fill the shelves with stuff, then stash duffels and daypacks in odd corners. Some floor space remains, so Billy and I politely take turns standing in this space. Now and then, if he’s left something behind, Billy stands on the deck and calls through the window. “Hey, Sally. Can you reach my sunscreen?” From lower bunk, I find whatever he wants, then hand it to him. He smiles through the window, “Thank you!” then closes the curtain. As we adjust to daily life on the boat, I realize we’re getting great value from this Tourist Superior Class cruise. Our travel companions come from England, Germany, Switzerland, Australia, Chile and the United States. The meals are tasty, nutritious, filling. The bunks are comfy, the linen changed daily. Most important to us, the experience: walking among wondrous creatures on volcanic islands. Yet, during the long, dark bouncy cruises from one island to the next, I have problems with sea sickness. Billy, who wears medicated patches prescribed by his doctor, copes very well. Even though I’ve cruised on various small boats, I have trouble on this boat at night with the roll, pitch and yaw. After that first long, rough night (I’ll spare you the details), I start getting anti-motion sickness pills from the crew. Add caption During the morning panga ride to Isla Bartolome, the air is fresh, the sunlight cheery. On the way over, I photograph Pinnacle Rock and the great scenery. Yet, when I start walking with the others up the trail, I begin to feel weak, sweaty and aching. Falling behind, I start chiding myself. Why have I not trained for this? During my late sixties, I hiked almost every day to research and write a hiking guide book. Here on Bartolome, the highest point is only 114 meters (374 feet)! The others have all gone ahead, walking steadily, chatting and laughing. Could I be dehydrated? Sitting on a step, I gulp all my water and munch stale, salty chips. When I recall that Billy will climb Mt. Kilimanjaro after the Ecuador trip, I feel challenged to start walking again! Surely I can make it to the summit of Bartolome! Eventually, I do join the others, happily smiling in the Guantanamera group picture. On Itinerary One, the Guantanamera calls at Western Islands, including Isla Isabela. When the boat reaches Urbina Bay, the others jump into pangas to snorkel from the black sand beach. (Even though it’s raining?) Lagging behind on the deck of this floating home, I tell Javier I’ll stay on the boat. Javier’s nature walks and talks are excellent, and I hate to miss any of them. When I cancel, I’m afraid he’ll be upset. Instead, he says “I’ll send a panga for you at 3:30.” By 3:00 o’clock the rain has stopped and my water taxi has arrived. The bouncy little panga rides up over swells and down into troughs. What a thrill. “Sit on the rim” the boatman says. Poised on the rounded edge, I pivot, plunge my legs into shallow water, walk onto shore over packed sand. During the hike above Urbina Bay, we find bits of coral and sea shells, remnants from an earlier, uplifted marine reef. To the east, the conical peak of Volcan Alcedo pierces the clouds. Along the trail, a land iguana with rough, textured skin stands in a clearing, as if posing. All sixteen of us pile into two pangas to explore a mangrove estuary. Javier points to three species of mangrove: red, black and white. When the boatmen cut the motors, a few Pacific green sea turtles swim past us. Near Isla Marielas, I watch a flightless cormorant, young and inexperienced. I can relate to this, as he struggles in the water, crying “Ah, ah, ah” “He’s been separated from his group,” Javier explains. The stray bird splashes weakly, swims toward a rocky islet, clambers onto shore. Standing upright, he shakes water from his frayed wings. After I adjust to the routine, daily walks among rare, wild creatures feel normal. At Punta Espinoza on Fernandina, I teeter across the raised surface of lava rocks. Reaching out with both arms helps me stay balanced. Masses of marine iguanas thrive here, more than we’ve ever seen. Sally Lightfoot crabs scoot about, then slip into crevices. On this remote island, where no human has ever lived, I feel fully alive, That night, Javier announces a party! The sun has set, the stars sparkle and frothy waves splash on the sides. White tables have been pushed back from the center of Upper Deck. Yet, this is not the usual party scene. Wet clothes dangle from lines above the railing. Our new friends occupy a circle of chairs, reluctant to move. Drawing on experience, Senor Kleber sends up pitchers of caipirinhas throughout the evening. Lead by the captain and crew, Javier dances early on, flapping his arms like a great frigatebird. Inspired by the recorded Latin dance rhythms, I can not sit still! By the end of this party, nearly everyone dances. Since I’ve known him, Billy has been caring, supportive. Over time, this shy guy has gradually revealed a heroic side. Now he’s facing me on the dance floor. Pumping our arms. Kicking our feet. Tonight, I feel young. We are dancing! When it’s time to go “home,” Billy and I mock-dance across the floor. From the top step of the ladder, we wave good night to our dancing amigos. Aware of the cachaca still sloshing through my body, I climb down backwards and move very slowly. That night, the boat rocks gently on the starlit bay. During the stroll to Cabin Five, we pause to inhale the sea air. After my favorite day, we can relax, pull up the quilts, and sleep, sleep, sleep. Sally McKinney has been a travel writer and photographer for 4 decades and has hundreds of travels stories in magazines and newspapers. She has also written several guide books. You can read another of Sally's travel adventures here on Travel Boldly about her learning how to travel in her 80s in Peru and Tanzania . Here are some of Sally's recommendations for travel in the Galapagos Islands. \"We really liked the www.HappyGringo.com tour company. They helped us find an affordable cruise on a clean, small, safe boat. After booking the Guantanamera through Happy Gringo, we met Javier and our new amigos at Baltra airport. This plan let us combine land-based touring with cruising (which is the only way to reach most of the islands). Our enthusiastic companions were a variety of ages and nationalities. Javier Cadena was an outstanding bilingual guide whose skills ranged from first-aid to dancing!\" \"We found most of our lodging (in Galapagos and on the mainland) through www.booking.com . We’ve also used and liked www.hostelworld.com .\"", "external_links": [], "published": "2015-08-04T17:54:00.000+03:00", "crawled": "2015-08-05T07:39:04.394+03:00", "highlightTitle": ""}