{"organizations": [], "uuid": "3f8315431ce59dbf32d31abd7952234da376b395", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29843693/arnold-itkin-maritime-attorneys-named-to-2016-best-lawyers-in-america", "country": "US", "title": "Arnold & Itkin Maritime Attorneys Named to 2016 Best Lawyers in America", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Arnold & Itkin Maritime Attorneys Named to 2016 Best Lawyers in America - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "3f8315431ce59dbf32d31abd7952234da376b395"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29843693/arnold-itkin-maritime-attorneys-named-to-2016-best-lawyers-in-america", "ord_in_thread": 0, "title": "Arnold & Itkin Maritime Attorneys Named to 2016 Best Lawyers in America", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Arnold & Itkin LLP\nHOUSTON , Aug. 20, 2015 /PRNewswire/ -- Noted trial lawyers Kurt Arnold and Cory Itkin of the Houston civil litigation firm Arnold & Itkin LLP have earned a spot among the nation's top lawyers with their selection to the 2016 edition of The Best Lawyers in America , the widely respected and oldest peer-review listing within the legal profession.\nBoth Mr. Arnold and Mr. Itkin were selected for their outstanding work in admiralty and maritime litigation by the highly selective publication.\nArnold & Itkin, founded by Mr. Arnold and Jason Itkin in 2004, has a national reputation for achieving justice on behalf of injured offshore workers and victims of catastrophic industrial accidents, particularly along the Texas and Louisiana Gulf Coast. The firm is widely known for its record-setting courtroom victories, including winning more than $1 billion in verdicts and settlements on behalf of workers and their families in just the past five years.\n\"We work extremely hard on behalf of our clients. Often, they are workers injured in the offshore oil industry. We do everything we can to win on their behalf,\" says Mr. Arnold. \"The Best Lawyers honor is especially meaningful because it is based on the judgment of our peers in the same area of law.\"\nIn addition to maritime work, the firm also maintains an enviable track record for its representation of victims of industrial disasters, major vehicle crashes, workplace accidents, and dangerous pharmaceutical drugs.\nMr. Arnold has been honored by Texas Super Lawyers and Texas Rising Stars for nearly 10 years. Cory Itkin also has been honored multiple times by Texas Rising Stars, which recognizes the state's top attorneys who are 40 years old or younger.\nSelection to Best Lawyers is based on nominations by other lawyers, peer review by those in the same practice area, and an analysis and review by the publication's editors.\nArnold & Itkin LLP represents clients in high-stakes cases involving serious claims for personal injury, maritime accidents, defective pharmaceutical drugs, and business disputes. To learn more, visit the firm's website at http://www.arnolditkin.com .\nFor more information on the Best Lawyers honors for Arnold & Itkin, please contact Kit Frieden at 800-559-4534 or kit@androvett.com .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/arnold--itkin-maritime-attorneys-named-to-2016-best-lawyers-in-america-300131387.html\n ", "external_links": ["http://www.arnolditkin.com/Meet-Our-Attorneys/Jason-Itkin.aspx", "http://www.arnolditkin.com/", "http://www.xmlnews.org/ns/", "http://www.arnolditkin.com/Meet-Our-Attorneys/Kurt-Arnold.aspx", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA83908&Transmission_Id=201508201315PR_NEWS_USPR_____DA83908&DateId=20150820", "http://www.arnolditkin.com/Meet-Our-Attorneys/Cory-Itkin.aspx", "http://www.prnewswire.com/news-releases/arnold--itkin-maritime-attorneys-named-to-2016-best-lawyers-in-america-300131387.html"], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T22:10:19.567+03:00", "highlightTitle": ""}