{"organizations": [], "uuid": "d518855601761d71f60534a2a701357cb820cb19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/08/cd2bfd2bc5894f8abe43c645d56a94da-474x711.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/nation-world/ny-man-convicted-in-plot-to-target-muslims-with-x-ray-weapon/", "country": "EU", "title": "NY man convicted in plot to target Muslims with X-ray weapon", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "NY man convicted in plot to target Muslims with X-ray weapon | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T22:10:00.000+03:00", "replies_count": 0, "uuid": "d518855601761d71f60534a2a701357cb820cb19"}, "author": "MICHAEL VIRTANEN", "url": "http://www.seattletimes.com/nation-world/ny-man-convicted-in-plot-to-target-muslims-with-x-ray-weapon/", "ord_in_thread": 0, "title": "NY man convicted in plot to target Muslims with X-ray weapon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ALBANY, N.Y. (AP) — An upstate New York man was convicted Friday of plotting to kill Muslims with a mobile X-ray device by a jury that rejected his lawyer’s argument that he was entrapped by the FBI.\nJurors deliberated for two hours before finding Glendon Scott Crawford guilty of attempting to produce a deadly radiological device, conspiring to use a weapon of mass destruction and distributing information about weapons of mass destruction.\nCrawford, an industrial mechanic at General Electric in Schenectady, could face 25 years to life in prison. Sentencing is set for Dec. 15 at the federal court in Albany.\nDefense attorney Kevin Luibrand said they’ll file a notice of appeal after the sentencing.\nMost Read Stories Interactive map of wildfires in the U.S. Thousands in state wrestle to tame relentless infernos Washington wildfires rage; Obama declares state of emergency Firefighters killed near Twisp: ‘three big heroes protecting small towns’ How to help — and 9 other things to know about the wildfires “They had 60 hours of undercover materials, which made it very difficult to mount an effective defense,” he said.\nThe 51-year-old Crawford has been jailed since his arrest two years ago.\nAssistant U.S. Attorney Richard Belliss said investigators began tracking Crawford in 2012 after he approached two local Jewish groups with his technological idea for how they could defeat their enemies. They also learned Crawford sought support for the device in 2013 from a Ku Klux Klan grand wizard in North Carolina, who was an FBI informant. That was something the agents and undercover investigators didn’t initially know about, he said.\n“Mr. Crawford hated Muslims and other politically liberal people,” Belliss told the jurors. He replayed earlier Friday the first secretly taped conversation of Crawford with another FBI informant in which Crawford said, “I think Islam is an opportunist infection of DNA” and “Radiation poisoning is a beautiful thing.”\nAccording to the prosecutor, Crawford’s tireless pursuit of the plan drove the investigation. The evidence showed he was “cold, calculated” and “committed.” He was not “cartoonish” or “a goofy simpleton,” as the defense suggested, the prosecutor said.\nIn one videotape, when asked about the best viable local targets, Crawford mentioned an Albany storefront mosque and the New York governor’s mansion.\nLuibrand said federal agents and their informants kept making contact with Crawford over the 13-month investigation and they eventually provided an X-ray device that never worked. His client, a Navy veteran and family man, had no criminal history, he said.\n“A government agent got the radiological device,” Luibrand said. “The government produced it, ordered it, paid for it.”\nCrawford’s co-defendant, Eric Feight, has pleaded guilty to supporting terrorists by building a remote control for the machine. But Crawford’s attorney said they didn’t conspire to obtain the actual device.\nU.S. Attorney Richard Hartunian said afterward that Crawford was a terrorist intending to kill innocent Muslims. He declined to say whether the investigation turned up similar suspicions about other politically conservative individuals or groups or how much was spent on the investigation.\n“We don’t limit the amount of work we do because it’s going to cost a certain amount of money,” he said.\nAndrew Vale, special agent in charge of the FBI’s Albany Division, said, “No matter how extraordinary the plot seemed, the threat was real.”\nMICHAEL VIRTANEN", "external_links": [], "published": "2015-08-21T22:10:00.000+03:00", "crawled": "2015-08-22T11:29:12.185+03:00", "highlightTitle": ""}