{"organizations": ["Konotta Maldives Resort"], "uuid": "3b61e2e64897f2f125cb412fa61d01ddafdc57f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/08/03/travel/images/30265787-01_big.jpg", "site_section": "http://www.nationmultimedia.com/home/rss/travel.rss", "section_title": "NationMultimedia.com - Travel", "url": "http://www.nationmultimedia.com/travel/Outrigger-Konotta-Maldives-Resort-welcomes-the-ver-30265787.html", "country": "TH", "title": "Outrigger Konotta Maldives Resort welcomes the very first guests", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "Outrigger Konotta Maldives Resort welcomes the very first guests", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T06:18:00.000+03:00", "replies_count": 0, "uuid": "3b61e2e64897f2f125cb412fa61d01ddafdc57f1"}, "author": "", "url": "http://www.nationmultimedia.com/travel/Outrigger-Konotta-Maldives-Resort-welcomes-the-ver-30265787.html", "ord_in_thread": 0, "title": "Outrigger Konotta Maldives Resort welcomes the very first guests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » travel » Outrigger Konotta Maldives Resort welcomes the very first guests HOTELS & RESORTS Outrigger Konotta Maldives Resort welcomes the very first guests THE NATION August 3, 2015 10:18 am \nFirst guests arrive and cut the ribbon to the sound of Maldivian drums. The turquoise waters off the Outrigger Konotta Maldives Resort feature a well-formed reef with abundant coral diversity and a great variety of marine life including turtles and eagle rays and regular sightings of dolphins. The spectacularly spacious Outrigger Konotta Maldives Resort opened its doors and welcomed its first guests August 1. The first guests, a family from Dubai, arrived after a 30-minute luxury speed boat transfer from Kaadedhdhoo Airport in the Gaafu Dhaalu Atoll in the south of the Maldives. The guests were welcomed ashore at the resort’s jetty by Darren Edmonstone the Outrigger Managing Director for Asia Pacific and the resort’s General Manager, Pascal Billon. After a traditional Maldivian welcome ceremony with drums and dancing, the father of the family cut the ribbon to open a new chapter in Outrigger Resorts’ expansion, which has seen the company open premier-class beachfront properties in Mauritius, Phuket and Fiji, as well as the Maldives, in the last three years. \"Outrigger hosts and supporting contractors in the Maldives have done a terrific job in the run up to our opening today,\" said Mr Edmonstone. \"I’m confident our large and wonderfully well appointed Beach and Ocean Pool Villas will become a major talking point in the Maldivian tourism scene.\" The 53 key all-villa property comprises 24 Beach Pool Villas (211 sqm), seven Two-Bedroom Pool Villas (282 sqm), 21 Ocean Pool Villas (225 sqm), and the Presidential Villa (600 sqm). The turquoise waters off the Outrigger Konotta Maldives Resort feature a well-formed reef with abundant coral diversity and a great variety of marine life including turtles and eagle rays and regular sightings of dolphins. On day two of opening, the Outrigger welcomed guests from China, Korea and the USA. \"We have very special dining, water sports and excursion options ready for all our guests, no matter where they come from,\" said Mr Billon. \"The Outrigger on Konotta Island is shaping up to be a perfect holiday destination for a wide variety of international guests who are seeking an iconic Maldives holiday.\" Special limited period opening rates for the Outrigger Konotta Maldives Resort are available on outriggermaldives.com for stays up to October 31, 2015. Or Email: reservation.konotta@outrigger.mv. Tel: +960 684 7771. 479 Viewed", "external_links": [], "published": "2015-08-03T06:18:00.000+03:00", "crawled": "2015-08-03T13:36:57.584+03:00", "highlightTitle": ""}