{"organizations": [], "uuid": "059e909ae1e8eabfee9e4ef35c44ba58d39b4b26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62871/green-traveler-collection-hertz-adds-new-hyundai-sonata-hybrids-", "country": "US", "title": "Green Traveler Collection: Hertz adds new Hyundai Sonata Hybrids to fleet", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Green Traveler Collection: Hertz adds new Hyundai Sonata Hybrids to fleet", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T22:10:00.000+03:00", "replies_count": 0, "uuid": "059e909ae1e8eabfee9e4ef35c44ba58d39b4b26"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62871/green-traveler-collection-hertz-adds-new-hyundai-sonata-hybrids-", "ord_in_thread": 0, "title": "Green Traveler Collection: Hertz adds new Hyundai Sonata Hybrids to fleet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Green Traveler Collection: Hertz adds new Hyundai Sonata Hybrids to fleet   \nAug 21, 2015 eTN   \nESTERO, FL - The Hertz Corporation, which includes the Hertz, Dollar and Thrifty brands, has announced the expansion of its Green Traveler Collection fleet to include the 2016 Hyundai Sonata Hybrid in select cities across the U.S. \n\"Hertz is always looking for opportunities to improve and grow our sustainability efforts, as well as provide customers vehicle rental options that are fuel efficient, so we're excited to add the newly redesigned Hyundai Sonata Hybrid to our green fleet,\" said Tom Frese, Senior Vice President, Fleet and Procurement. \nThe new Sonata Hybrid, rated at 40 mpg city and 44 mpg highway, switches seamlessly between a gasoline engine and an electric motor to deliver efficient power. The gasoline engine delivers the primary charge energy for the lithium polymer batteries, while the regenerative braking system captures the energy created during braking and converts it into electricity to help recharge the hybrid's lithium polymer batteries. For flexible loading, the Sonata Hybrid features a 60/40 split fold-down rear seatback. The vehicle's battery pack has been designed to fit below the trunk floor, giving drivers a flat, unobstructed space for loading. \nThe Sonata Hybrid is available to rent at airports including Los Angeles, Orange County, San Francisco, Atlanta, Dulles International and Chicago, as well as cities such as San Jose, San Diego and Long Beach in California; Portland, Oregon; and Denver. The new Sonata Hybrid is just one of Hertz's smart mobility rental choices available in the Company's Green Traveler Collection, a line of hybrid, electric and clean diesel vehicles that offer high-fuel efficiency while being easy on the wallet. All of the Green Traveler cars have fuel efficiency ratings starting at 33+ highway mpg. \nAs part of Hertz's commitment to sustainability, the company believes it has one of the most fuel-efficient rental fleets in the industry. More than 80 percent of Hertz's vehicles have a minimum fuel-efficiency rating of 28 highway mpg. Environmental efficiency programs' efforts resulted in recycling over 2 million gallons of used oil and auto waste in 2014, and more than 80 percent of the company's car washes use reclaimed water. The Hertz sustainability program also includes mixed recycling at Hertz rental locations, which saw a 42 percent increase in tons of waste recycled in 2014; and tire recycling, which resulted in 414,000 tires diverted from landfills in 2014. Additionally, the company currently has 15 solar locations, with projected growth to 20 by 2016.", "external_links": [], "published": "2015-08-21T22:10:00.000+03:00", "crawled": "2015-08-21T22:27:00.575+03:00", "highlightTitle": ""}