{"organizations": [], "uuid": "7fde9834d4fc92b3272dd678cf9c89270264db83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28480-butlins-to-launch-new-seaside-apartments-in-skegness", "country": "US", "title": "Butlins to launch new seaside apartments in Skegness", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Butlins to launch new seaside apartments in Skegness", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T17:15:00.000+03:00", "replies_count": 0, "uuid": "7fde9834d4fc92b3272dd678cf9c89270264db83"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28480-butlins-to-launch-new-seaside-apartments-in-skegness", "ord_in_thread": 0, "title": "Butlins to launch new seaside apartments in Skegness", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Butlins to launch new seaside apartments in Skegness Butlins to launch new seaside apartments in Skegness Details Category: Hotel   15:15 Butlins continue to strengthen their conference and events offering with the launch of their latest accommodation, the Seaside Apartments, located at their Skegness resort, which are now open for bookings. These new developments showcase Butlins’ commitment to developing accommodation and experiences that are truly unique, full of personality and charmingly out-of-the-ordinary for the conference and events sphere. \nThe initiative, which is part of a major £25 million investment in accommodation across Butlins’ three seaside resorts this year, has transformed the existing Lagoon Bay development to form the foundations of a new Seaside Gardens themed experience, complete with lush landscaping and flower-filled grounds. These will provide a relaxing environment for delegates to unwind in following a productive conference. Designed to celebrate the warmth and nostalgia of the British seaside, the first phase has seen the full refurbishment of 60 apartments, (with a further 100 planned for this winter,) each with either a new balcony or patio to ensure all delegates have access to the rejuvenating fresh sea air, aiding concentration and relaxation in the seaside setting. Embracing the resort’s coastal surroundings, a new blue and white colour scheme adorns the exterior walls, whilst inside the seaside theme continues with a light, bright interior design, providing the perfect setting for a revitalising stay and ensuring delegates are rested and ready for their conference, meeting or event. In typical Butlins fashion, there are a number of quirky details to be found, including ice cream cushions, candy floss cloud lights and grass-green rugs, designed to bring back childhood memories of holidays by the sea. There is even a multi-media hub for device connectivity in each apartment, so delegates don’t have to leave the office behind completely. Maximising the amount of lounge and dining space available, the redesign has seen a full transformation of the living areas, to open plan spaces. The apartments also feature refurbished master and twin bedrooms as well as new shower rooms, alongside daily housekeeping and early check in; perfect for delegates looking to get settled before their conference kicks off. Located near the Skyline Pavilion, Royal Arthur Conference Suite and the brand new Firehouse and Ludo’s restaurants, the Seaside Apartments will provide a fantastic central location allowing delegates to move between meetings, events and their accommodation with ease. Guests will also find themselves just a short stroll from the British beach, enabling them to immerse in the relaxing and nostalgic setting in a heartbeat. The transformation of Lagoon Bay represents the first stage of a three-year project to transform the apartments at Skegness. The significant investment on the refurbishment of the accommodation offering at the Skegness resort demonstrates Butlins Conference & Events’ dedication to providing the best experience possible for their delegates. Embodying the term, ‘corporate playground’, Butlins Conference & Events offer a refreshing alternative to traditional event locations, providing the perfect back drop for team-building, away days and conference and events of all sizes. With a range of flexible event spaces, ranging from 10-seat board rooms to exclusive hire of the entire resort, the Butlins team are able to ensure event organisers bring out the best in their delegates. Related articles", "external_links": [], "published": "2015-08-26T17:15:00.000+03:00", "crawled": "2015-08-26T17:19:37.508+03:00", "highlightTitle": ""}