{"organizations": [], "uuid": "9acc964d3ded9cdf7e5f9af7e36a689af5c0390f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63026/traffic-gridlock-sets-new-records-traveler-misery", "country": "US", "title": "Traffic gridlock sets new records for traveler misery", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Traffic gridlock sets new records for traveler misery", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T19:10:00.000+03:00", "replies_count": 0, "uuid": "9acc964d3ded9cdf7e5f9af7e36a689af5c0390f"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63026/traffic-gridlock-sets-new-records-traveler-misery", "ord_in_thread": 0, "title": "Traffic gridlock sets new records for traveler misery", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Traffic gridlock sets new records for traveler misery   \nAug 26, 2015 eTN   \nKIRKLAND, WA and COLLEGE STATION, TX - America's traffic congestion recession is over. Just as the US economy has regained nearly all of the 9 million jobs lost during the downturn, a new report produced by INRIX and the Texas A&M Transportation Institute (TTI) shows that traffic congestion has returned to pre-recession levels. \nAccording to the 2015 Urban Mobility Scorecard, travel delays due to traffic congestion caused drivers to waste more than 3 billion gallons of fuel and kept travelers stuck in their cars for nearly 7 billion extra hours – 42 hours per rush-hour commuter. The total nationwide price tag: $160 billion, or $960 per commuter. \nWashington, D.C. tops the list of gridlock-plagued cities, with 82 hours of delay per commuter, followed by Los Angeles (80 hours), San Francisco (78 hours), New York (74 hours), and San Jose (67 hours). \nThe problem has become so bad in major urban areas that drivers have to plan more than twice as much travel time as they would need to arrive on time in light traffic just to account for the effects of irregular delays such as bad weather, collisions, and construction zones. For example, drivers on America's Top 10 worst roads waste on average 84 hours or 3.5 days a year on average in gridlock – twice the national average. Of these roads, six are in Los Angeles, two are in New York and the remaining two are in Chicago. Nine other cities have roads ranked among the 50 worst. \nScorecard findings also illustrate how traffic congestion isn't just a big-city issue. Cities of all sizes are experiencing the challenges seen before the start of the recession – increased traffic congestion resulting from growing urban populations and lower fuel prices are outpacing the nation's ability to build infrastructure. Of America's Top 10 Worst Traffic cities, 7 of them experienced population growth outpacing the national average of 0.7 percent last year, including Los Angeles, San Francisco, San Jose, Seattle, Houston and Riverside, CA. Additionally, some of the worst traffic cities also experienced some of the largest decreases in fuel prices (-4.1 percent nationally) including Riverside, Houston, Los Angeles, San Jose, Boston and Chicago. The result, the average travel delay per commuter nationwide is more than twice what it was in 1982. For cities of less than 500,000 people, the problem is four times worse than in 1982. \n\"Our growing traffic problem is too massive for any one entity to handle – state and local agencies can't do it alone,\" says Tim Lomax, a report co-author and Regents Fellow at TTI. \"Businesses can give their employees more flexibility in where, when and how they work, individual workers can adjust their commuting patterns, and we can have better thinking when it comes to long-term land use planning. This problem calls for a classic 'all-hands-on-deck' approach.\" \nRecent data from the U.S. Department of Transportation shows that Americans have driven more than 3 trillion miles in the last 12 months. That's a new record, surpassing the 2007 peak just before the global financial crisis. Report authors say the U.S. needs more roadway and transit investment to meet the demands of population growth and economic expansion, but added capacity alone can't solve congestion problems. Solutions must involve a mix of strategies, combining new construction, better operations, and more transportation options as well as flexible work schedules. \n\"Connectedness, big data and automation will have an immense impact over the next decade on how we travel and how governments efficiently manage the flow of people and commerce across our transportation networks,\" says Jim Bak, one of the report's authors and a director at INRIX. \"This report is a great example of how data and analytics are evolving to provide transportation agencies with the insight needed to not only make our existing transportation systems work smarter but more quickly pinpoint where investment can have a lasting impact.\" \nThe report predicts urban roadway congestion will continue to get worse without more assertive approaches on the project, program, and policy fronts. By 2020, with a continued good economy: \n• Annual delay per commuter will grow from 42 hours to 47 hours. \n• Total delay nationwide will grow from 6.9 billion hours to 8.3 billion hours. \n• The total cost of congestion will jump from $160 billion to $192 billion. \nFindings in the Urban Mobility Scorecard are drawn from traffic speed data collected by INRIX on 1.3 million miles of urban streets and highways, along with highway performance data from the Federal Highway Administration. The vast amount of information, INRIX and TTI say, makes it possible to examine problems in greater detail than before, and to identify the effect of solutions at specific locations.", "external_links": [], "published": "2015-08-26T19:10:00.000+03:00", "crawled": "2015-08-26T19:46:45.077+03:00", "highlightTitle": ""}