{"organizations": [], "uuid": "de36e9ac8b60203bcc6265ba0757d6587a08b369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/FTA-logo.png", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS Archives - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/fta-announces-expanded-schedule-for-networking-and-professional-development-seminars/", "country": "US", "title": "FTA announces expanded schedule for networking and professional development seminars - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "FTA announces expanded schedule for networking and professional development seminars - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "de36e9ac8b60203bcc6265ba0757d6587a08b369"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/fta-announces-expanded-schedule-for-networking-and-professional-development-seminars/", "ord_in_thread": 0, "title": "FTA announces expanded schedule for networking and professional development seminars - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FTA announces expanded schedule for networking and professional development seminars Published on : Monday, August 17, 2015\nFollowing a successful first conference this past January, the Faith Travel Association(FTA) will expand the event to two days next year. It will be held February 1-2, 2016 during the National Tour Association’s annual convention at Travel Exchange held at the Georgia World Congress Center in Atlanta, Georgia.\n“The global faith-based travel market is already estimated to be between $50 and $100 billion, and it is continuing to grow and evolve,” explained Julie Hoover-Ernst, FTA executive director. “The opportunities for tour operators, travel agents and suppliers to grow their business in this market are tremendous, and the expanded format of our conference will give them more time to explore that potential.”\n“The conference was completely revamped in response to our attendees,” Hoover-Ernst continued. “They asked for more networking, more education, and more fun, and we are delivering on every front.”\nThe two day event brings tour operators, travel agents, tour suppliers and destinations together with faith leaders to make new connections to help them learn about and tap into the exciting faith-based travel market. Attendees will come away with new ideas to help them plan exciting trips for their groups, from pilgrimages and leisure tours to mission trips and youth adventures. There will be numerous networking opportunities in the FTA Pavilion, plus dedicated appointments for the travel trade, and four unique educational sessions to help attendees develop and strengthen their faith-based travel programs. New this year will be an Official FTA Passport designed to incentivize faith leaders and travel trade buyers to visit each FTA exhibit booth to have their passport stamped for a chance to win valuable prizes.\nFTA’s keynote speaker will be Joe Castillo, who is best known for his sand-story illustrations featured on such shows as “America’s Got Talent” and “The Today Show.” Through mesmerizing sand-story illustrations on a lightboard, and his energizing speaking style, Joe will deliver an inspiring message on the power of travel as a bridge to peace.\n“We are so excited to have Joe Castillo kick-off our conference,” said Hoover-Ernst. “Faith-based travel is so much more than a vacation. It’s life-changing, and we believe his unique manner of story-telling will captivate attendees and bring form to that message in a compelling way.”\nRegistration for the conference is now open. Tour operators, travel agencies and independent travel advisors who register before August 31, 2015 will pay just $39 to attend as a buyer and they are eligible for a rebate when they meet certain attendance requirements. Tour suppliers and others who wish to sell at the conference may register for $395 and they must be an FTA member.\nRegistration includes one set of appointments, access to all FTA informal networking events throughout the day on both Monday and Tuesday, the keynote address plus four educational sessions, Monday’s lunch featuring musical selections from popular Broadway musicals, as well as lunch on Tuesday, and the evening networking events with the National Tour Association delegates on both days.", "external_links": [], "published": "2015-08-17T03:00:00.000+03:00", "crawled": "2015-08-18T03:33:43.089+03:00", "highlightTitle": ""}