{"organizations": [], "uuid": "feafec73776a7e40b1a97794a1b5f0ac7ff275a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/07/malaysia-airlines.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/malaysia-airlines-berhad-receives-aoc/", "country": "US", "title": "Malaysia Airlines Berhad receives AOCTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Malaysia Airlines Berhad receives AOCTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "feafec73776a7e40b1a97794a1b5f0ac7ff275a2"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/malaysia-airlines-berhad-receives-aoc/", "ord_in_thread": 0, "title": "Malaysia Airlines Berhad receives AOCTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malaysia Airlines Berhad receives AOC Published on : Friday, August 28, 2015\nMalaysia Airlines Berhad (MAB) today received its Air Operator Certificate (AOC) from the Department of Civil Aviation (DCA) at Malaysia’s Ministry of Transport in Putrajaya. The AOC will allow Malaysia Airlines to take flight as MAB come 1 September 2015.\nMAB’s CEO Designate Christoph Mueller said, “We would like to thank the Director General of DCA, Dato’ Sri Azharuddin Abdul Rahman for this very important milestone. The AOC is a testament to all our staff at Malaysia Airlines who have been working hard to fulfill all the necessary requirements and specifications by DCA. We are very excited and focused on MAB’s take-off in September.”\nAlso in attendance was Malaysia’s Ministry of Transport, Datuk Seri Liow Tiong Lai, Malaysia Airlines’ Chairman, Tan Sri Md Nor Yusof, and senior management from both DCA and Malaysia Airlines.\nYB Datuk Seri Liow Tiong Lai, Minister of Transport, said, “This is an important milestone in the evolution of Malaysia’s national airline. The government of Malaysia is committed to ensure that the rejuvenated Malaysia Airlines will take off on a strong note. We hope to see more progress driven by the new entity especially in terms of service levels.”\nMeanwhile, Director General of DCA, Dato’ Sri Azharuddin Abdul Rahman congratulated MAB for fulfilling the stringent requirements and specifications set out for the AOC. He added, “It is important for MAB to successfully carry out its mandate of improving the prospects of the national carrier. We wish MAB all the best.”\nTo qualify for the AOC, MAB was required to undergo months of audit activities, which included air-worthiness of the airline’s operations, aircraft maintenance, as well as regulatory conformity. With the AOC, MAS will now be able to focus on transitioning to MAB, the new national carrier.\nMAS’ Chairman Tan Sri Md Nor Yusof also said, “This is a start of a new beginning. MAB will endeavour to ensure our passengers are given the best of our services and we will persevere to build a sustainable national icon”", "external_links": [], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-30T06:12:27.460+03:00", "highlightTitle": ""}