{"organizations": [], "uuid": "a58ed76c2163dbefe9a371f9f1c4d0d479d9a221", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/08/30/magazine/30talk/30mag-30talk-t_CA0-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT &gt; Travel", "url": "http://www.nytimes.com/2015/08/30/magazine/bill-bryson-fears-humans-more-than-bears.html", "country": "US", "title": "Bill Bryson Fears Humans More Than Bears", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "Bill Bryson Fears Humans More Than Bears - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T15:00:00.000+03:00", "replies_count": 0, "uuid": "a58ed76c2163dbefe9a371f9f1c4d0d479d9a221"}, "author": "Ana Marie Cox", "url": "http://www.nytimes.com/2015/08/30/magazine/bill-bryson-fears-humans-more-than-bears.html", "ord_in_thread": 0, "title": "Bill Bryson Fears Humans More Than Bears", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Park rangers along the Appalachian Trail are preparing for a huge influx of visitors, thanks to the release of ‘‘A Walk in the Woods,’’ the movie based on your book about trying to hike the whole thing. What type of person do you think would see that movie and think, I want to do that, too? Well, that’s a good question, because I’ve had at least as many people tell me that my book has put them off the idea of walking the Appalachian Trail.\nApparently, less-experienced backpackers tend to draw more bears to the trail, because they leave more litter. Most bears between Georgia and Maine are timid around humans, partly because a lot of them know that humans often carry rifles. But in certain places, where the bears don’t have any history of being shot at, they tend to be much more assertive and come up and, in a sense, mug people and very occasionally kill them.\nWere those near encounters with black bears on the Appalachian Trail the only time your life has been in danger while on assignment as a travel writer? The scariest thing I’ve ever had happen was when I was mugged at knifepoint in Johannesburg. Somebody put a knife right up to my nose.\nI suppose humans are generally more dangerous to other humans than bears are. Including on the Appalachian Trail, it must be said.\nOne critic of the book said that you seemed happiest when you ‘‘unexpectedly stumbled across processed food or paved roads.’’ And you’ve said that as a travel writer, you absolutely don’t want to get malaria, be uncomfortable, sleep on anything hard or worry that an alligator is going to come up and take your leg off. Yes. Isn’t that a fairly rational position to take?\nAbsolutely. I was going to say that my idea of adventure travel is Airbnb. But to go back to that point, the person who wrote that was slightly wrong, because strangely — and I’m sure anybody who’s walked the trail would confirm this — you discover that you don’t want processed food and junk. What you actually want is vegetables.\nYou’ve become an accidental ambassador of science. You said that your book ‘‘A Short History of Nearly Everything’’ was supposed to be a one-off exercise from someone who always failed at science in school. Did you actually fail science? No, but I got pretty close. I always scraped by, but I never came away with any kind of an appreciation for the wonders of science. In that sense, I failed spectacularly.\nYou’ve also said that creationism is less magical than science, less awe-­inspiring. How so? If you’re a spiritual person, I think the scientific explanation for the universe, and how it got the way it is — the fact that it’s so vast and so ancient, and in all of this amazing void of space, as far as we know, the only living things are us on this little planet — actually makes God seem more majestic.\nTalk Interviews with newsmakers from entertainment, politics and business. Bernie Sanders Has Heard About That Hashtag AUG 17 Tyra Banks Isn’t Running a Democracy Here AUG 13 Ice Cube Might Have Dinner With the President AUG 6 Jermaine Affonso Can’t Escape the Garbage, Either JUL 30 Ted Cruz Is More of a Spider-Man Guy JUL 23", "external_links": [], "published": "2015-08-28T15:00:00.000+03:00", "crawled": "2015-08-28T16:05:53.354+03:00", "highlightTitle": ""}