{"organizations": [], "uuid": "a6d3bb5ad442f92b9f9487b50c342ac4875b64cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "airtravel.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/133921082.jpg", "site_section": "http://airtravel.about.com/od/travelindustrynews", "section_title": "Air Travel Tips and Advice", "url": "http://airtravel.about.com/od/travelindustrynews/a/aaflyertips.htm", "country": "US", "title": "Tips for Earning Frequent Flyer Miles", "performance_score": 0, "site": "about.com", "participants_count": 1, "title_full": "Tips for Earning Frequent Flyer Miles", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "a6d3bb5ad442f92b9f9487b50c342ac4875b64cb"}, "author": "By Arlene Fleming", "url": "http://airtravel.about.com/od/travelindustrynews/a/aaflyertips.htm", "ord_in_thread": 0, "title": "Tips for Earning Frequent Flyer Miles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "So you want to travel for free? One of the only real, tried and true ways to do so is through accumulating and then redeeming your frequent flyer miles for flights. American Airlines is the airline that first introduced the frequent flyer program, and they have some tips for earning and redeeming miles for travel.\nIt's been 25 years since American introduced frequent flyer programs to the air travel world.\nThese tips are geared towards the American Airlines' AAdvantage program, but a few of the tips may be useful for many of the frequent flyer programs out there.\nAmerican Airlines top 10 for earning miles so you can travel free faster...\n1. Book online at AA.com - earn AAdvantage miles each time you do. 2. Sign up for promotions - some promotions have bonus miles offered just for signing up, making a purchase, or at times you may be eligible for double or triple the usual miles for flying a certain route. 3. Get a credit card to earn miles - if you get one of the Citi / AAdvantage cards, you can earn up to 15,000 bonus miles after your first purchase is made with the card. 4. Stay at a hotel - American Airlines has 35 worldwide hotel partners representing nearly 75 hotel brands. And the miles add up quite quickly...five miles for every dollar spent at more than 10,000 hotels in the U.S. and Canada. 5. Rent a car - AAdvantage miles can be earned with eight major car rental agencies so you can drive and earn. 6. Dine Out - you can earn up to 10 miles for every dollar spent while dining out. More than 10,000 restaurants across the United States and Canada participate, and give you miles to eat. 7. Take a vacation - AAdvantage members earn 1,000 AAdvantage bonus miles when booking via American Airlines Vacations . 8. Financing - partnerships with financial services, such as banks, financial service firms, real estate companies, and home financing services, mean several ways to earn miles. Members can earn miles for banking, investing, or selling a home. 9. Go shopping - you can earn miles at more than 90 brand-name retailers. 10. Donate - Earn miles for making donations to non-profit organizations through the AAdvantage Fund Raising program from American Airlines.", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T00:26:14.877+03:00", "highlightTitle": ""}