{"organizations": [], "uuid": "15bca35fec5c1322328e9691f28ec7220021e9d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/j/4/2/z/image.related.StuffLandscapeSixteenByNine.620x349.16j3m8.png/1440475209443.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/asia/71435024/Kinabatangan-River-safari-Sabah-In-search-of-Borneos-smallest-creatures", "country": "AU", "title": "Kinabatangan River safari, Sabah: In search of Borneo's smallest creatures", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Kinabatangan River safari, Sabah: In search of Borneo's smallest creatures", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T07:00:00.000+03:00", "replies_count": 0, "uuid": "15bca35fec5c1322328e9691f28ec7220021e9d5"}, "author": "Anthony Dennis", "url": "http://www.stuff.co.nz/travel/destinations/asia/71435024/Kinabatangan-River-safari-Sabah-In-search-of-Borneos-smallest-creatures", "ord_in_thread": 0, "title": "Kinabatangan River safari, Sabah: In search of Borneo's smallest creatures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kinabatangan River safari, Sabah: In search of Borneo's smallest creatures ANTHONY DENNIS Last updated 05:00, August 26 2015 \nTravellers spot pygmy elephants by a river in Sabah, Malaysia. \nAboard an open boat on the khaki-coloured Kinabatangan River, deep in Borneo, I can't establish whether I'm experiencing a Sir David Attenborough or Sir Les Patterson moment. Through a pair of binoculars trained on a tree high in the jungle I've focused on a proboscis monkey with a remarkably bulbous nose and a conspicuously round belly. Its brow is furrowed and its mouth is agape, scowling like a rabid footy fan at another alpha male on the opposite bank. While it's easy to make fun of this cosmetic surgeon's dream, the reality is that the survival of the proboscis monkey, just like the more instantly recognisable orangutan and other Bornean animals, is under grave threat. \nI'm in Sukau, a village on the Kinabatangan; running 560 kilometres, it's Borneo's longest river. It's a few hours or so away, via a thrilling, high-speed boat ride, from Sandakan, the scruffy, second largest city of the Malaysian state of Sabah. I'm here for a river safari with the Sukau Rainforest Lodge and its affiliate, Borneo Ecotours. Earlier this year, the lodge became the first member of the prestigious National Geographic Unique Lodges of the World collection, but more about that later. \nThe majority of foreign visitors to Sabah, and for that matter domestic ones, experience the native wildlife, chiefly orangutans and sun bears, at sanctuaries closer to Sandakan. While these facilities serve a vital role, nothing can replace the wonder of encountering endangered animals in the wild, such as here on the Kinabatangan River. \nAn orangutan in the jungle of Borneo. Photo: ISTOCK \nAnd, in terms of animals, \"orangutans\" is the first word uttered when you mention to anyone that you're visiting Borneo. The focus on the \"person of the forest\", the translation for the Malay term, tends to overshadow the plight of other threatened animals. This includes the proboscis monkey, which equally deserves the world's attention and concern. It's a situation that reminds me of India, where the Bengal tiger tends to dominate attention at the expense of other animals. \nBorneo is extraordinary. It's the world's third largest island behind Papua New Guinea and Greenland (Australia is an island continent), and while it accounts for just 1 per cent of the world's land mass, it accounts for 6 per cent of the globe's biodiversity. And as Africa has its so-called big five, Sabah has its small five. Many of the world's most diminutive creatures – from the pygmy elephant to the sun bear and the mouse deer to the black-thighed falconet (the planet's small raptor) – reside here. \"Even the humans here are small!\" declares a grinning Jamaidi, my jovial tour guide for the next three days. \nA tiny Lesser Mouse Deer. Photo: 123RF \nBorneo's diversity, as the World Wildlife Fund points out, is under serious threat. The island has shed more than half its forest, a third of that within the last three decades. It's one of the reasons why the Kinabatangan River is so abundant in fauna. It is nature's answer to a Hollywood film set – the wildlife forced here by the march of palm oil plantations in search of the native habitat on which it critically depends. Ad Feedback \nCertainly, the river is a perfect habitat for remaining wildlife, since seasonal monsoons and ocean tides routinely flood it, creating the location for some of the highest concentrations of animals in Borneo. Eco-lodges, too, have flourished along the waterway. When it became clear that palm oil planters were clear-felling many of the most biodiverse forests on earth to make way for yet more plantations, Borneans Albert Teo Chin Kion and Baton Bijamin​ were inspired to create the region's first ecotourism and eco-lodge operation at Sukau. \nNational Geographic this year commended the lodge for its \"sustainability initiatives\", designed to preserve the forest and provide meaningful employment to local villages. Built by local artisans, Sukau Rainforest Lodge strives to maintain a degree of harmony with the forest by limiting artificial light and noise. It must be working, as during my visit I spot orangutans in trees near to the lodge as well as evidence of pygmy elephant droppings, the size of slightly deflated soccer balls, around the boardwalk beyond the guestrooms. \nREAD MORE \n* 7 places to see big game, outside of Africa \nAlthough it has perhaps, inevitably, succumbed to the expectations of the modern traveller, and is building more luxurious accommodation with air-conditioning, Sukau Rainforest Lodge is comfortable. The emphasis is rightly on the eco-tours on the river, so remote in parts that some of the villages along it don't enjoy road access. \nMy newly refurbished room, darkened by the surrounding jungle vegetation, is named in honour of Sir David Attenborough, who has shot documentaries for the BBC here. It's sans air-con, cooled only by ceiling fans and the more forgiving jungle night air. However I can't confirm whether I slept in Sir David's bed since the room consists of two singles. \nAlthough the lodge boasts a long, environmentally friendly raised boardwalk extending into the forest, ideal for nature walks, the days and nights at Sukau are dominated by guided forays out onto the river and its tributaries aboard small, open boats. Each of the boats can be switched from outboard motors to electric power so as not to disturb the wildlife. And, tellingly, we never really have to travel too far beyond the main river to gain a sense of the encroaching palm oil plantations. \nEverywhere, exotic snakes wrap themselves around tree trunks and branches jutting out on the river; crocodiles lurk visibly on the riverbanks, waiting to snatch a Bornean gibbon taking a drink; and there's the unmistakable silhouettes of distant orangutans, with their enormous arms suspending them effortlessly between one towering tree and another. \nA male proboscis monkey. Photo: Getty Images \nBut it's those proboscis monkeys that command my attention. One late afternoon, out on a double-shot latte coloured tributary of the Kinabatangan, we encounter a troop of them, scattered throughout a massive tree, with the suffused light of the setting sun brightening their distinctive rust-coloured coats, rendering them almost, well, attractive. The Borneans still refer to these creatures as \"Dutchmen\", a derisive allusion to their less-than-lovely looks and long nose to those of the island's erstwhile colonisers. Female proboscis monkeys are at least spared the bulbous nose that distinguishes the male, with their snouts smaller and upturned. The former should be grateful, since the pendulous nose of the latter is so large that it has to move it in order to eat. \nHere, with so many of the proboscis monkeys surrounding us, you might imagine their numbers to be great. But in Sabah, the proboscis monkey population is estimated by the WWF to be as low as 1000. Listed as endangered, the WWF says that because the species feeds and lives in mangrove and riverine forests, its greatest threats are the draining of wetlands and development along riverbanks for agricultural purposes, as well as human settlement resulting in habitat loss. It's not all monkey business, though, on the busy banks of the Kinabatangan. Bird species along this part of the river total more than 200, including all of the eight species of hornbill to be found on Borneo. \nOne night, with Jamaidi determined to tick off my list of the small five – though, tragically, no one has sighted the likely extinct Borneo rhinoceros (the world's most diminutive) in the wild for years – we head out onto the river in search of a mouse deer, the world's tiniest hoofed mammal. The occasional flickering lights of houses on the shoreline and the high-powered boat's searchlight are the only illumination in the jet black. For an hour or so we spotlight kingfishers, so technicoloured they look like they've accidentally flown through an Inkjet printer, as well as haunting, solitary owls perched in trees, spookily unfazed by the beam of light. \nA Blue-eared Kingfisher, on the Kinabatangan River. Photo: Fairfax NZ \nTowards the end of our excursion the spotlight, darting every which way like the headlight of an out-of-control motorcycle, detects an animal the size of a domestic cat, with a fawn coat, white spots and tell-tale spindly legs: it's a mouse deer. My list is nearly complete, save for a pygmy elephant sighting (pachyderm poo doesn't count). \nThe next morning of the last day of my brief though richly rewarding stay at Sukau sees it time to return by river to Sandakan, scheduled at 9am. I'm more resigned to the fact that I will not spot one pygmy elephant. But, an hour or so into our return journey, as we power along the river, the ever sharp-eyed Jamaidi shouts, \"Elephants!\" \nThe young skipper cuts the engine, bringing the boat to an immediate, silent halt in the middle of the river. Sure enough, on the river bank, keeping our distance, is a herd of elephants, their wet hides glistening marvellously in the sunshine from bathing and watering in the river. Either the boat has disturbed the members of the herd or they have completed their ablutions, as we watch them make their way up a steep bank, then swallowed up by the precious jungle. \nJust as the skipper restarts the engine, one of the elephants, concealed within the thick vegetation, sounds a booming trumpet call, either to alert the herd to secrete themselves in the jungle or to warn us off; perhaps both. Yet as exhilarating as it is to witness such a sight, I can't help but fear for the future of these elephants. \nIt's tempting to treat a safari as some kind of private audit, crossing off all of the creatures you have sought to see in the wild and being disappointed at not having encountered others. But, after three days or so in this remarkable threatened wilderness, I'm humbled, awed and, yes, troubled, by the unforgettable roll-call of wildlife that has paraded before us. Even Sir Les himself would have to be impressed and moved. \nA pygmy elephant in Borneo. Photo: 123RF \nTRIP NOTES \nMORE INFORMATION tourism.gov.my ; sabahtourism.com ; wwf.org.au \nGETTING THERE The Malaysian low-fare carrier AirAsia X fliesto Kuala Lumpur, with daily domestic connections with AirAsia from KL to Kota Kinabalu and Sandakan, the two main cities in Sabah. AirAsia passengers now fly into the new klia2 terminal in KL, the carrier's main hub. See airasia.com . \nSTAYING THERE A stay at the 20-room Sukau Rainforest Lodge costs from $551 per person for three days and two nights. The rate includes tours and transfers, accommodation and meals as specified, entrance fees and an English-speaking guide. The nightly rate is based on a minimum of two persons. See sukau.com; nationalgeographiclodges.com. The best place to stay in Sandakan – and the best base to and from Sukau – is the Four Points By Sheraton Hotel. Doubles cost from $72 See fourpointssandakan.com . \nThe writer travelled as a guest of Tourism Malaysia, Sukau Rainforest Lodge and AirAsia. \nFAB FIVE: SABAH'S SMALL WONDERS \nPYGMY ELEPHANT The world's smallest pachyderm, the Bornean elephant, or more commonly known \"pygmy elephant\", is widely considered to be a distinct sub-species. The elephants can be best viewed by boat on a guided eco-tour along the Kinabatangan River. \nSUN BEAR The most diminutive of the world's bears, the sun bear is dark brown to black in colour. Its distinctive features, aside from its small size, is a v-shaped gold or white marking on its chest. Its tongue can extend up to 25 centimetres for extracting honey and insects. \nA sunbear lies on a branch. Photo: 123RF \nLESSER MOUSE DEER The tiniest ungulate, or hoofed-mammals, on earth, the lesser mouse deer is also known as the lesser oriental chevrotain. The diet of the lesser mouse deer, distinguished by its slender legs, comprises leaves, shoots, fungi and fruit. \nBLACK-THIGHED FALCONET The most minute bird of prey on the planet, the black-thighed falconet has a wing span roughly the equivalent of a sparrow. Unlike other species in Sabah, it's not considered to be vulnerable, with the population of the raptor believed to number in the tens of thousands. \nBORNEO RHINOCEROS The smallest rhinoceros on earth, the Borneo rhinoceros is also the most endangered. It is described by the World Wildlife Fund as \"possibly extinct\" throughout the island, with authorities conceding that the only remaining rhinoceros in Borneo are less than a handful in captivity. \nFIVE MORE THINGS TO SEE IN SABAH \nSEPILOK ORANGUTAN REHABILITATION CENTRE An essential stop for most visitors to this part of Sabah, the respected, government-run Sepilok Orangutan Rehabilitation Centre near Sandakan is worth a visit, particularly if you're not heading up river to see the primates in the wild. See sabahtourism.com . \nBORNEAN SUN BEAR CONSERVATION CENTRE The Bornean Sun Bear Conservation Centre, next door to Orangutan Centre, was only recently opened to the public. The centre's mission is to rescue the animals threatened by deforestation, commercial hunting and the pet trade. See bsbcc.org.my . \nDANUM VALLEY CONSERVATION AREA One of the world's most complex ecosystems, this remote forest in south-eastern Sabah is home to a host of endangered wildlife including pygmy elephants, clouded leopards, orangutans and proboscis monkeys. See sabahtourism.com . \nTURTLE ISLAND PARK Located 40 kilometres north of Sandakan in the Sulu Sea, Turtle Island Park is a haven for the endangered green and hawksbill turtles. Visitors have the opportunity to observe their landings and there is a turtle hatchery as well as accommodation with basic facilities. See turtleislandborneo.com . \nMOUNT KINABALU Sabah's most sacred, prominent and popular attraction, the 4095 metres high Mount Kinabalu is popular with walkers and climbers. However, at the time of writing, activities were temporarily suspended due to an earthquake earlier this year. See sabahtourism.com .", "external_links": [], "published": "2015-08-25T07:00:00.000+03:00", "crawled": "2015-08-26T23:15:54.665+03:00", "highlightTitle": ""}