{"organizations": [], "uuid": "dca0dd45d99ff5593419d1388e3940cc979571cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03413/airbnb_3413201k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-20.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/travelnews/11809547/New-Airbnb-scam-dupes-several-Telegraph-readers.html", "country": "US", "title": "New Airbnb scam dupes several Telegraph readers", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "New Airbnb scam dupes several Telegraph readers - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T18:00:00.000+03:00", "replies_count": 0, "uuid": "dca0dd45d99ff5593419d1388e3940cc979571cb"}, "author": "Gill Charlton", "url": "http://www.telegraph.co.uk/travel/travelnews/11809547/New-Airbnb-scam-dupes-several-Telegraph-readers.html", "ord_in_thread": 0, "title": "New Airbnb scam dupes several Telegraph readers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ross Crombie writes A few weeks ago I booked an apartment for a long weekend on Ibiza for myself and some friends through Airbnb ’s website. I had heard about people being scammed by paying direct so I only communicated with the host through Airbnb’s email service. I also paid by credit card through the website payment portal. The rental of £900 was charged to my Visa card at the end of April. Shortly afterwards I received an email from Airbnb saying that the card payment had been declined and I needed to arrange an international bank transfer within the next 24 hours to secure the apartment. Stupidly, I did as asked. I transferred the money straight away to someone I assumed was the host as they had all the details of my reservation. When I did get a chance to check my Visa account, I saw the first payment had gone through successfully. This was confirmed by Airbnb when I contacted them myself. At this stage I realised I had been scammed by a fraudster. But how had he got hold of my email address and all the details of my reservation? I have reported the fraud to my bank and to Action Fraud which has given me a crime reference number. As I believe Airbnb’s email database must have been compromised, I have requested a refund. However, its Trust and Safety team says that as the payment was made outside the website it is not liable. Can you help me secure a refund? • 'Half a pasty behind the sofa, but I couldn't leave a negative Airbnb review' • 'Airbnb scam cost me £920' A reader was conned after booking a stay in Ibiza Photo: AP/FOTOLIA Gill Charlton, consumer expert, replies These fraudulent demands sent to Airbnb customers are very convincing. Over the past month several readers have been scammed in a similar way after paying through Airbnb. I suggested that you wrote back to Airbnb pointing out this security breach. The company asked for documentation to support your claim and has now offered a voucher for £425 which can be used against a future booking. However, this is a goodwill gesture as it says own database was not hacked and so it is not legally liable for the security breaches caused by the actions of either hosts or guests. Airbnb recently introduced 'anonymised’ email addresses for all guest communications with hosts but this has not stopped the fraudsters. Instead it appears that they are going on phishing expeditions - and this may be what has happened in Mr Crombie’s case. The fraud works by sending an email to a host that appears to come from Airbnb asking them to verify their account details. The host foolishly responds thus giving the fraudster access to their account and all the bookings correspondence. Even though the addresses are anonymised the fraudster can still send emails to the customers via Airbnb to try to extract a second payment by bank transfer. To reinforce the danger Airbnb has introduced a clear warning next to every message thread between guests and hosts which says: 'Never pay for your reservations outside the Airbnb website. If you don’t pay through Airbnb you lose access to... the Host Guarantee and Host Protection Insurance Platform...’ Now that Airbnb has made it so clear there really is no excuse for customers being being duped in this way and the company will no longer be offering goodwill gestures. • Airbnb fraudster tricks another Telegraph reader • Holiday complaints: what to do when travel goes wrong Ask the experts Our Q&A service allows you can pick the brains of our experts at home and abroad. Email your query to asktheexperts@telegraph.co.uk . We won’t be able to answer them all, but we will do our best. About Gill Charlton Gill is the author of our beginner's guides to India and Burma . She is also an expert on Cornwall and consumer issues, especially legal disputes. Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-08-20T18:00:00.000+03:00", "crawled": "2015-08-20T12:50:42.520+03:00", "highlightTitle": ""}