{"organizations": [], "uuid": "343a033226c8ca27afc708394ef1ec2f3ef45603", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62801/flexjet-pilots-win-jobs-back", "country": "US", "title": "Flexjet pilots win jobs back", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Flexjet pilots win jobs back", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T04:08:00.000+03:00", "replies_count": 0, "uuid": "343a033226c8ca27afc708394ef1ec2f3ef45603"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62801/flexjet-pilots-win-jobs-back", "ord_in_thread": 0, "title": "Flexjet pilots win jobs back", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Flexjet pilots win jobs back   \nAug 20, 2015 eTN   \nRICHMOND HEIGHTS, OH - In a decision by distinguished arbitrator Joshua Javits, three pilots with Flexjet, LLC, have been reinstated to their positions with the carrier and made whole for their terminations. The arbitrator found the terminations were without cause and that the pilots' terminations resulted from retaliation for protected union activity in violation of federal labor law. \nThe plaintiffs, pilots who are members of the Flexjet Pilots Organizing Committee and working to form a union with Teamsters Local 1108 in Richmond Heights, Ohio, will return to work after winning back their jobs and will be made whole for losses sustained as a result of management's actions. Two of the pilots have been out of work since February, and one pilot since April. \nFollowing the pilots' terminations, the International Brotherhood of Teamsters Airline Division filed suit in federal court alleging that the terminations and harassment of other members of the Flexjet Pilots Organizing Committee violated the pilots' rights to organize and bargain collectively free from interference, influence or coercion under the Railway Labor Act. Pursuant to a confidential settlement, the parties agreed that the matter would be arbitrated before Arbitrator Javits. \nIn his decision, Arbitrator Javits, who is the former chairman of the federal National Mediation Board, stated he believed upon review of the evidence that, \"management's actions were designed to send a chilling message to pilots who were strongly supportive of the IBT's organizing drive.\" \nThe decision finds that Flexjet management violated the protections of the Railway Labor Act by discharging three strongly pro-union pilots in the middle of a union organizing drive and that there was no cause for the carrier's actions. It was also found that the carrier's discharges of the employees were unlawful because they were based on retaliation for what was a protected activity. \nCapt. David Bourne, Director of the Teamsters Airline Division, applauded the arbitration award as a vindication of the rights of Flexjet pilots to organize with the Teamsters. \n\"Flexjet fired these pilots to send a message that if the pilots organized, they would be punished. But the strong message from this arbitration award is that this company cannot break the law and get away with it,\" Bourne said. \"The Teamsters will hold Flexjet accountable now and in the future when we inevitably win our election and secure a strong and enforceable contract for the Flexjet pilots.\" \n\"We were confident that justice would be served and management's vindictive, illegal actions against these fine pilots would be exposed and reversed,\" said Capt. Efrem Vojta, President of Local 1108. \"We are extremely pleased with the arbitrator's decision and look forward to having all the Flexjet pilots join forces with us as members of our union.\" \nDirectional Aviation Capital, led by aviation entrepreneur Kenn Ricci, owns Flexjet, Flight Options and other aviation enterprises which cater to wealthy clients seeking luxury services. There are more than 350 pilots who are members of Teamsters Local 1108 who work at Flight Options, and nearly 200 more who work at Travel Management Company (TMC), another charter jet provider.", "external_links": [], "published": "2015-08-20T04:08:00.000+03:00", "crawled": "2015-08-20T04:08:59.431+03:00", "highlightTitle": ""}