{"organizations": [], "uuid": "332ffbea17ec1db9aab5eccca7df64e515b48eba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62117/deadly-stunt-russian-air-show-pilot-killed-helicopter-crash", "country": "US", "title": "Deadly stunt at Russian air show: Pilot killed in helicopter crash", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Deadly stunt at Russian air show: Pilot killed in helicopter crash", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T18:45:00.000+03:00", "replies_count": 0, "uuid": "332ffbea17ec1db9aab5eccca7df64e515b48eba"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62117/deadly-stunt-russian-air-show-pilot-killed-helicopter-crash", "ord_in_thread": 0, "title": "Deadly stunt at Russian air show: Pilot killed in helicopter crash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deadly stunt at Russian air show: Pilot killed in helicopter crash Adv: Helicopter burst into flames after crash Adv: \nMOSCOW, Russia - A Mi-28N military helicopter has crashed near Russia’s Ryazan during an aerobatics display. One of the two pilots has died according to Russia’s Defense Ministry. \nA pilot managed to get out of the burning aircraft, as can be seen on a video by Ruptly video agency. His health is in satisfactory condition. \nWhile performing a stunt at the Aviamix air show on Sunday, a helicopter belonging to the Berkuty (Golden Eagles) aerobatic team suddenly banked on one side and started to lose height. \n“The helicopter went into flat-attitude spin and crash-landed,” Russia’s Defense Ministry said in a statement. \n\"According to preliminary report of the hospitalized pilot of Mi-28N, when performing an aerobatic stunt, the emergency alert system of the helicopter reported the failure of the hydraulic boost system,” the Defense Ministry’s press service said in a statement. \nThe helicopter crashed in a forest near the airfield and burst into flames on impact with the ground. Firefighters arrived at the crash site and extinguished the fire within minutes. \nThe helicopter is damaged beyond repair, RIA Novosti reports. \nRussia's Air Force Commander-in-Chief Viktor Bondarev has ordered the grounding of all Mi-28 assault helicopters following the catastrophe in central Russia, the Defense Minister reported. \n“The crew fought to save the helicopter to the end. Unfortunately, the chief pilot died on impact - the co-pilot survived. According to the second pilot, the accident occurred due to technical failure. I have suspended all Mi-28 flights. The commission under my leadership is working to clarify the causes of the disaster,” Bondarev said.", "external_links": [], "published": "2015-08-02T18:45:00.000+03:00", "crawled": "2015-08-02T22:34:43.757+03:00", "highlightTitle": ""}