{"organizations": [], "uuid": "692412b13c1fd63b798836d7b5154c18379a9500", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03421/Constantine_Bay_3421291a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/caravan-holidays-uk/11497090/campervan-camping-cornwall.html", "country": "US", "title": "Campervanning in Cornwall", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Campervanning in Cornwall - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T22:21:00.000+03:00", "replies_count": 0, "uuid": "692412b13c1fd63b798836d7b5154c18379a9500"}, "author": "Gary King", "url": "http://www.telegraph.co.uk/sponsored/travel/caravan-holidays-uk/11497090/campervan-camping-cornwall.html", "ord_in_thread": 0, "title": "Campervanning in Cornwall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more camping and caravanning stories at Freedom to Go Tristram Campsite in Polzeath must have one of the most idyllic locations in all of Cornwall. Two minutes from the beach, it’s just a short jaunt to get the sand between your toes and watch the waves as they come crashing in from the Atlantic. There aren’t many places on the planet that I’d rather be on a warm summer’s evening with a cold beer in my hand prodding a sausage on the barbecue. It’s what makes having a campervan such a joy, which has without doubt been one of the best purchases I’ve ever made. Susie Surf Seeker (christened by the kids) is a 1992 Ford Transit with more than 100,000 miles on the clock and a diesel engine that you can hear coming from quite some distance away. Once, when pulling on to the ferry in Cowes, Isle of Wight, the smiling ticket man said to me as I wound down the window: “Sir, your van sounds like a canal boat!” Campervan: Gary's 1992 Ford Transit is equipped with a sink and cooking facilities She may well sound like she’s ready to chug down the Norfolk Broads but she has taken me, my wife and our two children on some cracking holidays over the years. The ease of chucking everything in the back and being completely self-sufficient is truly one of life’s great pleasures. That trip to Cornwall a few years ago was no exception – a combination of great weather and good company all set against the stunning backdrop that is the north Cornish coast. Susie may not be in the first flush of youth but she’s fully equipped with a fridge, sink and cooking facilities – and when the awning is up she’ll happily sleep six. My campervan is without doubt one of the best purchases I’ve ever made I also love the camaraderie that comes with owning a campervan. Fellow campers love nothing more than coming for a chat to expound the merits and discuss the minutiae of life on the road. I’ve lost count of the number of times I’ve been invited to “take a look under the hood” while being offered a drink or a bite to eat. For a week we swam, surfed and generally larked about on the beach. Then we moved on. Another wonderful thing about being mobile is the ease with which it’s possible to just get up and go. Paddling fun: The north Cornish coast is one of the UK's most beautiful locations Next stop was the fabulous Treyarnon Bay, situated a few miles outside of Padstow. I always get a great sense of joyful anticipation whenever we wind down the country lanes from the main road in St Merryn. The campsite there isn’t quite as serene as Tristram, but that’s what makes things interesting. The kids love diving into the natural rock pool on the beach and a walk along the cliffs is rewarded with stunning views of Constantine Bay and Trevose Head. We spent our second week dining on fish and chips, munching on barbecued burgers, supping cold wine and generally enjoying our home from home. To top it all, the entire fortnight’s holiday cost about as much as it would to have put us all up in a hotel for a few nights. And anyway, where’s the fun in that? Susie Surf Seeker continues to motor on and long may she last. I reckon there’s another 100,000 miles under that hood. Sign up at Freedom to Go for information and advice on planning a trip and buying or renting a leisure vehicle", "external_links": [], "published": "2015-08-28T22:21:00.000+03:00", "crawled": "2015-08-28T17:13:19.277+03:00", "highlightTitle": ""}