{"organizations": [], "uuid": "fec55ebc91eb6fd875d8f1c32cb2184579b73b8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/080915-dulce-de-leche-600.jpg", "site_section": "http://www.philly.com/philly/travel/", "section_title": "Philadelphia Travel Deals and Tourism - Philly.com", "url": "http://www.philly.com/philly/living/travel/20150809_It_s_always_fun_to_check_out_what_the_locals_go_shopping_for.html", "country": "US", "title": "It's always fun to check out what the locals go shopping for", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "It's always fun to check out what the locals go shopping for", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "fec55ebc91eb6fd875d8f1c32cb2184579b73b8d"}, "author": "", "url": "http://www.philly.com/philly/living/travel/20150809_It_s_always_fun_to_check_out_what_the_locals_go_shopping_for.html", "ord_in_thread": 0, "title": "It's always fun to check out what the locals go shopping for", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of the first things we do at a new destination is head to a local supermarket. There are several reasons for this seemingly odd behavior. The first is practical: We usually rent self-catered apartments, so we need to load up on necessities. The other reason is more about curiosity.\nA supermarket is one of the best places to learn about the local culture by seeing what types of foods are popular there. When traveling someplace new, we'll pick up something we can't find at home just to give it a try. This was how we sampled Vegemite, the national food of Australia, a brown spread made of used yeast products. (Don't bother - it's awful.) We fared much better in Buenos Aires with dulce de leche, a creamy caramel that has to be one of the best flavors on earth. Markets in Argentina usually dedicate more shelf space to this gustatory treasure than American stores devote to chips and cookies, and that's saying something.\nSupermarkets are also great places to buy souvenirs of your trip. Instead of buying a trinket that will become a dust collector at home, why not pick up something you'll actually consume and enjoy? Savoring the flavor of your journey will keep the memories of it alive.\nJust make sure your purchases are in sealed packages and easily accessible in luggage; always declare them. In Bogota, Colombia, we discovered chocolate that forms the base of unbelievably rich hot chocolate when melted. The foil-wrapped packages stacked on the supermarket shelves were perfect for travel, so we stocked up for the trip home.\nMore coverage In Las Vegas, mafia museum to display FIFA's 'rampant corruption' In Hiroshima, 70 years after atomic bomb Personal Journey: Dropping in on the Andes in Ecuador Upon arriving back in the United States, we noticed the contents of our suitcases were disheveled. A friendly note from the Transportation Security Administration apologized for the disarray, noting that our bags had been singled out for extra scrutiny.\nApparently, flying from Colombia with foil-wrapped packages burrowed deep in the recesses of your luggage is not a good idea. Lesson learned, we treasured the chocolate for months.", "external_links": [], "published": "2015-08-09T03:00:00.000+03:00", "crawled": "2015-08-10T10:48:20.592+03:00", "highlightTitle": ""}