{"organizations": [], "uuid": "5cb4217c92a4ca7c281e40eb19680972e0af8acb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28193-beaumont-estate-receives-green-tourism-silver-award", "country": "US", "title": "Beaumont Estate receives Green Tourism silver award", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Beaumont Estate receives Green Tourism silver award", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T18:45:00.000+03:00", "replies_count": 0, "uuid": "5cb4217c92a4ca7c281e40eb19680972e0af8acb"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28193-beaumont-estate-receives-green-tourism-silver-award", "ord_in_thread": 0, "title": "Beaumont Estate receives Green Tourism silver award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Beaumont Estate receives Green Tourism silver award Beaumont Estate receives Green Tourism silver award Details Category: Hotel   16:45 Beaumont Estate, part of the PH Hotels Collection, in Old Windsor has received the Green Tourism silver award following a recent independent sustainability assessment. To gain the certification the hotel was graded against a rigorous set of criteria spanning a range of areas including energy and water efficiency, waste management and biodiversity. \nBusinesses that meet the required Green Tourism criteria are awarded gold, silver or bronze. The silver certification held by Beaumont Estate is credited as ‘progressive/ excellent’. Beaumont Estate has shown that it shares its values in going green with both employees and customers, with significant use of recycled products, use of local ethical suppliers and efficient monitoring of energy and water usage. Steve Jones, general manager, Beaumont Estate said: “We are delighted to be acknowledged for our commitment to sustainability at Beaumont Estate. The silver award recognises our approach to recycling, minimising energy and water waste and supporting local suppliers where possible. We will continue to uphold our green procedures, whilst finding other ways to improve sustainability. Our aim is to achieve the gold certification in the next few years.” Beaumont Estate will be visited every two years and assessed by a qualified professional to ensure standards are maintained. With over 2,000 members in the UK, Ireland and Canada, Green Tourism is the largest and most established sustainable certification programme in the world. Related articles", "external_links": [], "published": "2015-08-11T18:45:00.000+03:00", "crawled": "2015-08-11T18:56:40.961+03:00", "highlightTitle": ""}