{"organizations": [], "uuid": "1c31c8c58b7a87c7ad8f5be04822c32ca030fc3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/travel/", "section_title": "Forbes - Travel Information and Travel News - Forbes.com", "url": "http://www.forbes.com/sites/andrewbender/2015/08/27/10-years-after-katrina-empowering-new-orleans-youth/", "country": "US", "title": "10 Years After Katrina: Empowering New Orleans' Youth", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "10 Years After Katrina: Empowering New Orleans' Youth", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T23:13:00.000+03:00", "replies_count": 0, "uuid": "1c31c8c58b7a87c7ad8f5be04822c32ca030fc3d"}, "author": "Andrew Bender", "url": "http://www.forbes.com/sites/andrewbender/2015/08/27/10-years-after-katrina-empowering-new-orleans-youth/", "ord_in_thread": 0, "title": "10 Years After Katrina: Empowering New Orleans' Youth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It’s one of America’s great paradoxes: when Hurricane Katrina struck New Orleans on August 29, 2005, it left behind a level of destruction that still brings pangs of shock and sadness. Yet no other American city I’ve visited continues to inspire more passion – even, yes, love – from its citizens.On Katrina’s 10th anniversary, I did a series of interviews of New Orleanians who returned after the mandatory evacuation, picked themselves up, dusted themselves off and turned their passion into action, not just to rebuild the city, but to use their diverse talents to make it even better than it was. Here’s one of those stories.Visit my site for more 10 Years After Katrina stories .——— Name: Curry W. Smith Age: 30 Hometown: Lafayette, La. Occupation: Executive Director, Young Leadership Council My Katrina Story: I was about to begin my junior year at Tulane University and had just finished leading a pre-orientation program for new students. The very next day, the university encouraged all students and their families to evacuate the city.I ended up transferring to Washington & Lee University in Lexington, Va. for the semester. There were 26 students from New Orleans-area colleges and universities at W&L. We upperclassmen made it our unofficial mission to get the freshmen - who hadn’t actually spent a day on campus - to move back to New Orleans for the next semester.[caption id=\"attachment_10290\" align=\"\" width=\"734\"] Curry W. Smith, Executive Director of the Young Leadership Council. (Image: David Ettinger Photography)[/caption] What I’m Doing Now: Young Leadership Council is a leadership development and community service organization for young professionals ages 21-42, founded in 1986.I’m really proud of the mix we have of native New Orleanians and newcomers to the city, in professions including legal, accounting and banking to non-profits, education and the public sector, and the technology and entrepreneurial sectors that have popped up here since Katrina.One post-Katrina program I’m particularly proud of is the College Admissions Project. Our volunteers go into three high schools and serve as guides, paired one-on-one with students to help them fill out financial aid forms and such and make sure they have what they need to apply to school.Year-to-year, we’ve seen about 80 percent of these students accepted into at least one four-year college. About 90 percent of them are the first ones in their families to go to college. During the 2014-15 academic year, we worked with 79 students.Another post-Katrina program is Where Ya’ Rack? , our bicycle program. New Orleans is very compact and our geography is very flat, so it’s a really bikeable place, although historically you didn’t have the bicycle population that you have in an Amsterdam or a Portland, Ore. That’s really changed in the last decade, particularly among millennials and low-income residents.But while the number of bicyclists is increasing, the number of places where they could actually park their bikes was stagnant. A stop sign, street sign or chain-link fence is certainly not ideal, especially when you have property owners who don’t want a bike locked to their property.So we started putting in bike racks around town, about 340 in Orleans Parish and nearby suburban parishes [Louisiana has parishes instead of counties]. Now we’re working with the Louisiana Department of Transportation and Development and installing bike racks in all schools in Orleans Parish.———Visit my site for more 10 Years After Katrina stories .", "external_links": ["http://ylcnola.org/", "http://www.whereyarack.org/"], "published": "2015-08-27T23:13:00.000+03:00", "crawled": "2015-08-27T18:39:57.351+03:00", "highlightTitle": ""}