{"organizations": [], "uuid": "421094c8e33f43296417d25b1acf04a740a44d91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/08/23/travel/23HEADSUP1/23HEADSUP1-facebookJumbo-v2.jpg", "site_section": "http://graphics8.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT > Travel", "url": "http://www.nytimes.com/2015/08/23/travel/pristina-kosovo-beer.html?partner=rss&emc=rss", "country": "IL", "title": "Heads Up: In Kosovo, a Thirst for Progress, and Beer, Too", "performance_score": 2, "site": "nytimes.com", "participants_count": 1, "title_full": "Heads Up: In Kosovo, a Thirst for Progress, and Beer, Too", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T12:00:00.000+03:00", "replies_count": 0, "uuid": "421094c8e33f43296417d25b1acf04a740a44d91"}, "author": "ADAM H. GRAHAM", "url": "http://www.nytimes.com/2015/08/23/travel/pristina-kosovo-beer.html?partner=rss&emc=rss", "ord_in_thread": 0, "title": "Heads Up: In Kosovo, a Thirst for Progress, and Beer, Too", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In Kosovo, a Thirst for Progress, and Beer, Too AUG. 20, 2015 Supported by Photo Kosovo’s capital, Pristina, has a lively night life and a young population eager to try international styles of beer. Credit Benny Islami for The New York Times \nAdvertisement Continue reading the main story On weekends, Kosovo’s millennials dance to Smiths and New Order songs from the 1980s as if they were hearing them for the first time at the new Irish pub Miqt ( facebook.com/MIQT.NET ) in Pristina. The bar is by turns trendy and louche and hidden down one of the many bumpy, half-paved roads in Kosovo’s capital. One night last fall, three men in fluorescent-piped Nikes and expensive Japanese jeans gyrated around a table. A woman wearing a trench coat and choppy blond bangs slithered through the room like a Fritz Lang femme fatale. Outside, a painfully cool clique smoked American Spirit cigarettes and exchanged jokes about Serbian soldiers, injecting some dark humor about the war that ripped apart this small country. This pocket of the Balkans where Muslims are in the majority has long been defined by war and by a heritage of hardship that stretches back to Illyria in ancient times. But instead of being mired by the tragic past, Pristina’s new generation seems to look to the future. They are also drinking beer. Though Islam prohibits the drinking of alcohol, a beer culture is emerging in the city. Photo Birra Prishtina, ready to quaff. Credit Benny Islami for The New York Times “Beer consumption does clash with our Muslim history,” said Bekim Shala, the manager of Birra Prishtina, a brewery that opened last year. “But we are a secular society and alcohol has always been consumed here.” The Kosovo War of 1998 and 1999 left this region, once part of Yugoslavia, divided between Christian Serbs and Muslim Albanians. As the war ended, NATO intervention forced Serbian troops out and Kosovo became a protectorate of the United Nations; that ended in 2012. The international presence gave Kosovo its first taste of global consumerism, including new restaurants, indie music, a soccer team and its first microbrewery, which opened in late 2013. Since then, interest in beer has grown steadily. Ramshackle Pristina (the name is sometimes rendered Prishtina) was one stop in my six-country Balkans tour last September, but it easily was the most exciting city on the two-week trip. Pristina teems with abandoned buildings, construction sites and streets that go from paved to rubble-strewn at the turn of a corner. But its free-spirited night life recalls 1990s Berlin, Belfast and Prague, and its new restaurants, stretching from Boulevard Bill Clinton to the 15th-century Carshi Mosque, serve everything from coconut curry to Kosovo locavore fare. Locals claim Pristina makes Europe’s best macchiatos, but its beer impressed me most. Its first microbrewery, Sabaja ( birrasabaja.com ) — named after the Illyrian word for beer — opened Sabaja Dr’s Beer House, an American-style restaurant, in 2013. There, in an alley behind the Brutalist Gradski Stadium and the “Newborn” monument (a typographical sculpture of the word that captures the country’s scrappy spirit), the beer house serves rich smoked porters, zesty summer wheats and Belgian ales alongside American mainstays like wings and Caesar salads. A sign inside reads, “Beer will change the world.” \nAdvertisement", "external_links": [], "published": "2015-08-20T12:00:00.000+03:00", "crawled": "2015-08-21T02:23:57.993+03:00", "highlightTitle": ""}