{"organizations": [], "uuid": "e89327dac46f5e6433233c93718bc03849b5bc8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "alittleadrift.com", "main_image": "http://alittleadrift.com/wp-content/uploads/2013/06/hammock-beach-mexico.jpg", "site_section": "http://alittleadrift.disqus.com/latest.rss", "section_title": "A Little Adrift  Around the World Travel Blog - Latest Comments", "url": "http://alittleadrift.com/2013/06/cost-of-living-mexico/", "country": "US", "title": "Re: A Little Expat Living… Cost of Living in a Mexican Beach Town", "performance_score": 0, "site": "alittleadrift.com", "participants_count": 1, "title_full": "Re: A Little Expat Living… Cost of Living in a Mexican Beach Town", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T20:33:00.000+03:00", "replies_count": 0, "uuid": "e89327dac46f5e6433233c93718bc03849b5bc8b"}, "author": "Greg Noesen", "url": "http://alittleadrift.com/2013/06/cost-of-living-mexico/", "ord_in_thread": 0, "title": "Re: A Little Expat Living… Cost of Living in a Mexican Beach Town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Return to Content A Little Expat Living… Cost of Living in a Mexican Beach Town \nTwo years ago, I lived in Chiang Mai, Thailand for five months after having traveled steadily for two years. It was the first time I stayed put in one spot and became a semi-expat. As the months passed, I was so surprised by how affordable living there was that I shared a cost of living post … mostly for the readers in the A Little Adrift community who had written me over the years wondering how they could afford to also live abroad. Long story short, that post went viral and has had nearly 100,000 visitors. Clearly the financials are interesting. So, with that in mind, I thought I’d share a similar post outlining my recent semi-expat stint in a tiny beach town in Mexico earlier this year … this time with a bonus five-minute video, which covers everything the post below does if you’re keen on video rather than text! \nThis video shares the costs, style of living, quality of life, and other details about living as an expat in Mexico: \nIf you’re a reading person instead, below are the details covered in the video. Total Cost of a Month of Living in San Pancho, Mexico \nThis entire post outlines the baseline costs—my fixed monthly expenses for one person. \nThe chart to the left shows all the basics; not included in this is medical/health insurance, my plane flight to Mexico, or any expenses I incur outside of living (running this site, insurance, work, etc). But all the baseline costs are covered, and really unlike the Thailand post, this total includes toiletries and any expenses inside Mexico that cropped up—I literally never withdrew more than $750 from the ATM each month. And this budget is on the high-end for one person; if I had looked around for an apartment or shared a house with friends my costs would have lowered to $600 (and my friend Earl says that’s about the cost of living in Playa del Carmen on the east coast beaches as well … I’ll share more Mexico resources at the end). \nOne of the high points of Mexico, a clear advantage over living in Asia, is the visa situation. As a US citizen I receive a six months visa on arrival automatically, and this can be reset simply by crossing a border and coming back … indefinitely. The visa situation in Southeast Asia is a lot trickier, and though I didn’t include the visa runs into my baseline costs in SEA, it was a part of living there for six months that could add up a lot if you were there years on end. Right now the peso is roughly 12 pesos to 1 US dollar as a guide to the food and transport costs I mention. What Does That Look Like in Terms of Living Life? \nThe various facets of living abroad are part of what makes one place appeal to some expats while others prefer something vastly different. I’m on the fence between Asia and Latin America, I love them both for different reasons, so rather than compare these aspects of life to each other, below is the food, life, and culture you get for that budget living in a beach town on Mexico’s Pacific coast. Sunset is a nightly ritual and a great way to meet the other expats and locals in town as everyone takes to the shores every single night for what have to be some of the prettiest sunsets I’ve ever seen. A Light, Airy Studio Apartment \nI didn’t look very hard for my apartment; in fact, it’s the first one I came across. I loved the family compound I lived within (they had a separate house with three rental apartments within their lot) and it’s one of the things I value living solo … I like having other people nearby who have my well-being in mind in case something happens. So, the apartment was 4,500 pesos per month ( $375) which is on the high-end for a studio in my town but the price included all utilities and really strong internet, which is essential for my online work . \nA high point of living in Mexico is the fact that apartments and houses come with full kitchens (though mine was minus an oven), this is really great if you’re a keen cook—anything you rent here will likely come with a stove and pots and pans if it’s a furnished apartment. Other than the kitchen it had everything else you would expect in a studio—full size bed, counter with stools (where I worked from), closet, and a bathroom (a tour is shown in the video above). \nOther places in town rent out as vacation rentals or rooms for anywhere from USD $200 per month on the low-end (likely no wi-fi) to $500 or more for 1 and 2 bedrooms. And one town over, in Sayulita (which is bigger and more touristy has a great beach, a lot more food, bars, etc), the prices are actually pretty comparable if you like the idea of Mexico but think my town was a bit too small! :) Delicious Vegetarian Eats \nIt’s no secret I’m a vegetarian, so for me, a country gets bonus points for not only the accessibility of vegetarian food, but the understanding of the concept of vegetarianism. Mexico’s good on both fronts, though not always great. During high season my little town had just enough options to keep it interesting, and as the seasons shifted I cooked in my apartment a lot more using fresh veggies from the markets, which was fun and gave me a kick toward my goal of becoming a better cook (Asia spoiled me because the lack of kitchens and cheap street food meant I never had to learn to cook these past years). \nFor costs, a cheap quesadilla runs 15 pesos (just over $1) at one of the stands, a nicer taco is about 40 pesos (about $3.25), and a veggie meal at one of the handful of restaurants in town runs up to $10 or $15 USD. I was luck to have friends in town so I could split one of the big pizzas for our weekly Friday-night gatherings, and my friends Victoria and Steve often hosted potlucks. I drink coffee a lot, so though I made my own pot each day, the food budget included several expressos each week. My food budget was pretty generous so if you cooked at home, even cooking meat I think you could get by on 1000 pesos each week. I often bought organic veggies at the Friday market in Sayulita, so the food budget really is generous. Getting From Here to There \nOne of the perks of living in a one-street town is that you don’t need a whole lot of transportation! That being said, I chose to live on the far end of the main street very close the community center where I volunteered (and about a 10 minute walk from the beach). 10 minutes doesn’t seem like much, but in the scorching heat I was happy to have use of a bicycle from the family compound. \nAnd for leaving San Pancho, Puerto Vallarta is about 45 minutes away and costs just a few dollars each way on the bus—this is the closest big city. Sayulita is a perfectly lovely small town (much bigger than mine though) and it was merely 20 minutes up the road. This ride costs $1 each way on the bus or a quick (and easy) hitchhike ride. Sayulita was perfect to have nearby if I needed to vary up my food, explore a bit, or just get out of town for a few hours. There are many other beaches drive-able, some ruins, old stuff to look at, etc if you’re keen to explore. I worked a lot so my bike took me most anywhere I wanted to go. Night Life in San Pancho Dos Bertos y Las Musas play every Friday at Darjeeling during the high season in San Pancho, Mexico. \nI am not a partier. Whew, glad we got that out of the way. Now, when I say that I have a low-budget for alcohol and partying you can adjust it up accordingly for yourself. San Pancho is a great town for nightlife if you like a bit of variety but nothing too crazy—no dance clubs but we did have two great bars and a lot of live music throughout the week. In fact, during high season there was live music at one of the bars or restaurants nearly every night. \nOne of the things I loved best about the town was that the pace of partying was a lot closer to what I prefer—everyone chilling, talking, listening to music, and enjoying company. Add to that some game nights at Victoria and Steve’s for Jungle Speed (had never heard of this game but it was fun and hilarious to play in a group), beach bonfires, and conversation …I felt like Goldilocks, San Pancho was just right. Quality of Life in Mexico \nThis bit surprised me some, I knew that many Americans headed south of our border to live but I never really understood why until I stopped and spent four months on the Pacific coast taking in the truly stunning sunsets, the relaxed atmosphere and the affordable lifestyle. The only thing I expected but never found was the fear and danger. \nI talked about danger last week and how our perceptions and reality are often skewed, and I think that is true of Mexico. While there are certainly dangerous places in Mexico, the country is huge, the people and cultures shift and change with the terrain and there are some surprisingly safe cities throughout the country if you know where to look (look to the blogosphere!). \nI really loved the access to affordable healthcare (a bonus Thailand had as well), like-minded expats who I now call close friends, and a pace of life that encouraged me to slow down and enjoy the little moments. On the healthcare front, and safety and all that, expat friends even had a baby in Puerto Vallarta … showing even me that the perceptions and reality are just so different on the ground. \nThe short of it all is that Mexico proved more expensive than Thailand, but still at least half the rent I paid living in Los Angeles in my pre-travel days. And though it wasn’t as cheap, it’s a place I’m considering making a more regular stop on my travels; I really love that the plane flights are cheaper and I speak the language … it helps. \nIt’s the sum total of it all that I love—by living outside the US I am able to scale back the hours I have to work each week to survive, and instead focus that attention on doing things I love: volunteering in the nearby community center, taking photographs, and having the time to enjoy the friendships I make. No place is perfect, but for $750 a month, nightly sunsets, lots of friends, and tasty tacos… I’ll may return again this fall. :) \nRelevant Links and Resources for Moving to Mexico Consider a good travel insurance policy like World Nomads to cover you while you’re either in transit visiting your future homes, or their insurance policies (coupled with Clements for personal belongings) work really well as long-term expat insurance too. I have used them both in tandem since 2008. Read The People’s Guide to Mexico : Even if you’re a veteran Mexico traveler, this is hands-down the best guidebook you should use to understand the various regions, the cultural quirks, and all the reasons Mexico is a fantastic place to travel and live. It comes highly recommended by me, and by heaps of Amazon reviewers too. A Better Life for Half the Price : A Mexican expat breaks down all the major expat spots in the world with costs, quality of living, and resources. I learned heaps and found a couple countries I hadn’t previously considered. It’s worth buying if you’re still searching out which country is best for the life you want to live. Check out a Facebook group called “ On the Road in Mexico ” is a good place to ask questions of other expats. And dig through the two solid Mexico expat forums here and here . \nOther Mexico Cost of Living Posts Couples apartment in San Pancho : A look at some of the other rental properties in town. Couples full budget in San Pancho : My friends break down their joint expenses renting a small house in town. Two solo budgets in Playa del Carmen: Nomadic Notes and Wandering Earl break down costs on an east coast beach. Couples budget for Play del Carmen : Simon and Erin live a bit more mid-range budget. Family budget in Lake Chapala : Renee shares a family of three’s budget in the interior. Thailand cost of living post : I reference this throughout and thought I’d provide a handy link if you’re keen to compare living costs. \nDeciding Where to Live \nIn response to numerous emails asking about the differences between the handful of towns north of Puerto Vallarta, here’s a Cliff’s Notes summary of the differences in case you’re sussing out which is better for you. All three would have similar costs of living. And then I include a couple other towns and thoughts in case you’re looking at other Mexican towns: Bucerias : Sprawling, no defined downtown area, neighborhoods stacked behind a big road and a beach. Very close to the PV, several big resorts. Less heavy with expats than any other surrounding town. No defined personality. Sayulita : Very small, beach is very crowded with surfers because the water is good for swimming, entirely walk-able within the town. Lots of restaurants, shops, a language school, etc. Touristy but a very clear personality with organic markets, yoga shops, surfers, etc. More of a nightlife than San Pancho (a later nightlife I should say). San Pancho : Tiny, one main road, a handful of options for restaurants. One, sometimes two, coffee shops. Beach is gorgeous but not very safe for kids swimming (though some do) because of strong waves/undertow. Tight-knit group of expats, can’t leave home without seeing someone you know. Local kids have free reign of the whole town. Lots of musicians and something going on each night of the week in high season at one of the pubs/bars. Guanajuato/San Miguel : In the interior, these two towns just exude pretty colonial charm. San Miguel del Allende is smaller and more popular with expats, while Guanajuato is a decent sized city with a great vibe, an affordable cost of living, and a decent-but-not-overwhelming expat community. Yucatan : Hugely popular with expats (and spring breakers), a bit pricier than the west coast, gorgeous beaches and diving. Very touristy region in general but convenient and safe. \nSafe travels!", "external_links": [], "published": "2015-08-02T20:33:00.000+03:00", "crawled": "2015-08-03T00:51:56.598+03:00", "highlightTitle": ""}