{"organizations": [], "uuid": "4a46d973cb26fd90c9c9559eed9933a2229df487", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29849839/eagle-rock-school-and-professional-development-center-launches-new-efforts-to-advance-commitment-to-youth-and-education", "country": "US", "title": "Eagle Rock School and Professional Development Center Launches New Efforts to Advance Commitment to Youth and Education", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Eagle Rock School and Professional Development Center Launches New Efforts to Advance Commitment to Youth and Education - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a46d973cb26fd90c9c9559eed9933a2229df487"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29849839/eagle-rock-school-and-professional-development-center-launches-new-efforts-to-advance-commitment-to-youth-and-education", "ord_in_thread": 0, "title": "Eagle Rock School and Professional Development Center Launches New Efforts to Advance Commitment to Youth and Education", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " American Honda Motor Co., Inc.\nNew website and video series give unique insights into extraordinary school, 22 years after its founding\nESTES PARK, Colo. , Aug. 21, Eagle Rock School and Professional Development Center has launched a new website (eaglerockschool.org) and video series highlighting its commitment to meaningfully re-engaging youth in their own education. Established in 1991 as part of Honda's commitment to corporate social responsibility, Eagle Rock is a year-round, residential and full-scholarship high school located on a 640-acre mountainside campus Estes Park, Colorado , for students who have not experienced success in traditional academic settings. The companion Eagle Rock Professional Development Center works with high school educators and administrators around the country to help them create engaging educational experiences in their own schools.\nIn 1989, Honda sought to find opportunities to further its long-term commitment to youth and education. Through careful research, a vision was formed for a school that would support the lives of young people by promoting community, integrity and citizenship. With the creation of the American Honda Education Corporation in February 1991 , Eagle Rock School was born. The first group of students arrived in September, 1993.\nEngaging Youth on Campus\nWith a current enrollment of 72 students, Eagle Rock School serves adolescents who are not thriving in their current situations, for whom few positive options exist, but who are interested in taking control of their lives and learning. Coursework at Eagle Rock is experiential, project-based, and involves substantial amounts of group work and interaction. Students demonstrate proficiency through various projects, performances, papers and presentations. On average, Eagle Rock School has 10 students and two instructors per class.\n\"Through the strength of our on-campus community, we're able to connect with each of our students in unique and meaningful ways - and help students re-engage in their own education,\" said Jeff Liddle , head of school, Eagle Rock School & Professional Development Center. \"Our sole purpose for existing - re-engaging youth in their own education - drives us toward a new vision for schooling where all students are productively engaged in their own education while simultaneously making a positive difference in the world.\"\nEagle Rock School also is intended for youth, aged 15 to 17, with limited financial means. To be accepted, an applicant must demonstrate a willingness to actively pursue intellectual and personal growth, and attain personal achievement outside the classroom in a range of pursuits, including community, academic and residential life activities. Prospective students are invited to visit the Admissions section of the Eagle Rock website to learn more.\nPDC Making High School Impactful Nationally\nThe Eagle Rock Professional Development Center (PDC) works with educators from around the country to make their high schools centers of engagement and learning. Through various activities, the PDC works with schools, districts and youth service organizations across the U.S. to implement school reform initiatives and create healthy, highly-functioning educational environments. These PDC activities include a teaching fellowship program, hosting visiting educators on the Eagle Rock campus, providing teacher licensure services, graduate practicum opportunities, as well as research opportunities. Visit the Services section of the Eagle Rock website to learn how to work with the PDC.\n\"We want to be a resource to every high school and every educator trying to figure out how to connect with students and encourage them to want to make a difference in the world,\" said Michael Soguero , director, professional development, Eagle Rock School & Professional Development Center. \"We do not explicitly export practices from Eagle Rock School or any school, because every school has unique assets and unique challenges. But we do work collaboratively to build solutions around progressive education concepts that deal with how students actually learn.\"\nAbout Honda\nThrough its business activities and interaction with the communities where the company does business, Honda seeks to be a company that society wants to exist. This includes creating products and technologies that improve the lives of people while minimizing the environmental impact of its products and business operations to ensure a sustainable future. Honda also is committed to socially responsible business practices and to the promotion of workforce diversity. From its involvement in STEM education and Historically Black Colleges and Universities (HBCUs), to its long term support of pediatric brain tumor research and the volunteer efforts by Honda associates, Honda believes in supporting the communities where our associates live and work. Eagle Rock School and Professional Development Center is a wholly funded initiative of the American Honda Education Corporation. Find out more at csr.honda.com.\nPhoto - http://photos.prnewswire.com/prnh/20150820/260095\nLogo - http://photos.prnewswire.com/prnh/20100923/HONDALOGO\n releases/eagle-rock-school-and-professional-development-center-launches-new-efforts-to-advance-commitment-to-youth-and-education-300131667.html\n ", "external_links": ["http://www.youtube.com/watch?v=HMdb1cObFsk", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/eagle-rock-school-and-professional-development-center-launches-new-efforts-to-advance-commitment-to-youth-and-education-300131667.html", "http://www.youtube.com/watch?v=4Rycy6kfZ_o", "http://eaglerockschool.org/professional-development-center/inquire-about-our-professional-development-services/", "http://eaglerockschool.org/about-eagle-rock-school/admissions/", "http://photos.prnewswire.com/prnh/20100923/HONDALOGO", "https://photos.prnewswire.com/prnvar/20150820/260095", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA84303&Transmission_Id=201508210800PR_NEWS_USPR_____LA84303&DateId=20150821", "http://photos.prnewswire.com/prnvar/20100923/HONDALOGO", "http://photos.prnewswire.com/prnh/20150820/260095"], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T17:21:00.849+03:00", "highlightTitle": ""}