{"organizations": [], "uuid": "f3c91b07c77001bde652bba4301767e1f8b4ed8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.haaretz.com", "main_image": "http://www.haaretz.com/polopoly_fs/1.667820!/image/930542160.jpg_gen/derivatives/landscape_474/930542160.jpg", "site_section": "http://www.haaretz.com/travel-in-israel/jewish-world-travel", "section_title": "Jewish World Travel-Israel News - Haaretz Israeli News source", "url": "http://www.haaretz.com/news/israel/.premium-1.667819", "country": "IL", "title": "Improvised stalls in city’s center have been largely rep", "performance_score": 0, "site": "haaretz.com", "participants_count": 1, "title_full": "Improvised stalls in the city’s center have been largely rep", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T20:33:00.000+03:00", "replies_count": 0, "uuid": "f3c91b07c77001bde652bba4301767e1f8b4ed8f"}, "author": "Noa Shpigel", "url": "http://www.haaretz.com/news/israel/.premium-1.667819", "ord_in_thread": 0, "title": "Improvised stalls in city’s center have been largely rep", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Improvised stalls in the city’s center have been largely replaced by air-conditioned shops; small business customers have moved to the mall and everyone is waiting for tourists: the face of Tiberias is changing\nOn a hot Monday midday recently, a crane mounted on a truck deposited new covered bus stops along Hagalil Street, which just two weeks ago held the last of the city’s famed market stalls to remain in the center of Tiberias. The ramshackle huts along the shore of Lake Kinneret in town were replaced long ago by spiffy, uniform stalls, while the tin shacks on Hayarden Street made way for air-conditioned stores. The produce market moved to a pretty stone building; now it was the turn of Hagalil Street, the main street straddling Route 90.\nThe disappearance of the stalls is but one example of the changes undergone by Tiberias in recent years, which the city hopes will put it on a new path.\n“We’ve finally become a city, not just a filthy village,” says Shalom Kacho of Orit’s Falafel on Hayarden Street. The eatery moved to a proper building four years ago, after 35 years in a stall.\n“It looked like a marketplace, not a central, dignified main street,” adds Tomer Murad, who runs the family business, Oakland, on Hagalil Street, across from where the tin shacks once stood. He recites a litany of dirt and traffic disruptions caused by the old arrangement. Dudu Amar, who owns a store for travel gear and equipment, also welcomes the changes: “Gaza and Rafah have finally left Tiberias.” Eli Abergil, from an adjacent clothing store, summarizes: “We’re in the 21st century. That’s it — even the stalls in Eilat were taken down.” Only 72-year old A., a third-generation Tiberias resident eating a falafel at a new store, confesses that he misses the colorful stalls. “They weren’t all aesthetic but it was an attraction.”\nMalls came quite late to Tiberias: Six years ago a modern shopping center opened, and two years ago the Big Fashion mall opened near the city center. Progress, as usual, comes with a price. Avi Shmuel, whose optician business has stood on Hagalil Street for decades, admits that a mall was necessary, but adds that it split the city in two: The big chains opened stores there and parking is free, while smaller businesses remained in the city center.\n“Traffic here is down to 60% of what it used to be” he says.\nMayor Yossi Ben-David promises not to allow any more malls to open and to assist smaller businesses that have trouble contending with the changes. “In the past we had clients from towns all around the north, but now they don’t come,” says Murad. “Consumer habits have changed” adds Amar: “The big shopping centers divert customers from our stores.”\nAmar points to another problem: “Tourists used to stop on their way to vacationing on the lake, but they no longer do so.” He used to have piles of gas cookers for campers, but he hasn’t sold equipment such as coolers for years. The municipality is trying to advance tourist initiatives together with the government, and they expect a 95 percent hotel occupancy rate in August. The Tourism Ministry regards Tiberias as having great potential due to Lake Kinneret and the proximity of Christian holy sites. Ministry sources say that “despite investments of almost half a billion shekels (over $100 million) initiatives faltered, partly due to poor maintenance and a lack of continuity between successive mayors. The city’s dependence on tourism renders it sensitive to geopolitical upheavals.”\nAnother headache accompanied the removal of the stalls. In 2005 the municipality decided to replace them with a tidier shopping center, and stalls were moved across the street. Their owners were promised stores in the new building within 18 months. A huge hole was dug behind them, replacing a park, for the purpose of building an underground parkade. This made the stalls difficult to access, with muddy approaches in the winter. Ten years later the stalls are gone and the hole is still there after work was stopped. The new building is almost deserted due to a dispute between the developer and stall owners, who claim that high management fees were [unexpectedly] tacked on to their contracts.\n“We were told to wait a year and a half, nine years ago,” says Yossi Elmaliach who ran his family’s toy and candy stall. The new store they bought is not ready and they sit at home waiting. Other stall owners are also waiting for resolution of the dispute, but some have rented space nearby.\nAvraham Hajaj, a lawyer who represents the developers, criticizes stall owners, saying that a court ruled that the building is ready. “Management fees are similar to those across the country. The intent is to open soon with a ceremonious opening attended by the mayor and city notables, artists and other public officials.”\nBen-David, in office since 2013, inherited this dispute. He looks forward, disregarding the past. “I wanted to clear the tin shacks from the sidewalks. They have been suffocating Hagalil Street for nine years. It now looks much better. If the open hole issue isn’t resolved in the courts the park will be restored. In the meantime the municipality has rented alternative parking space.”\nIn 2018-2020 the city intends to celebrate the 2,000th anniversary of its founding. With no stalls or traffic congestion, with abundant parking and beautiful stone-arched houses and with cultural events. As far as the authorities are concerned, there are grounds for optimism.\nNoa Shpigel\nHaaretz Correspondent\n ", "external_links": ["https://www.facebook.com/noa.shpigel?fref=ts", "https://twitter.com/NoaShpigel", "http://widgets.outbrain.com/outbrain.js"], "published": "2015-07-26T20:33:00.000+03:00", "crawled": "2015-08-16T15:04:39.589+03:00", "highlightTitle": ""}