{"organizations": [], "uuid": "0095521889d447e90e0704f755744ad7e85dc96c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegsun.com", "main_image": "http://storage.winnipegsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297671666280_LARGE_BOX.jpg?quality=80&stmp=1438575215814&size=100x", "site_section": "http://www.winnipegsun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.winnipegsun.com/2015/07/31/strategies-for-dining-alone-on-a-business-trip", "country": "CA", "title": "Strategies for dining alone on a business trip", "performance_score": 0, "site": "winnipegsun.com", "participants_count": 0, "title_full": "Strategies for dining alone on a business trip", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T07:00:00.000+03:00", "replies_count": 0, "uuid": "0095521889d447e90e0704f755744ad7e85dc96c"}, "author": "", "url": "http://www.winnipegsun.com/2015/07/31/strategies-for-dining-alone-on-a-business-trip", "ord_in_thread": 0, "title": "Strategies for dining alone on a business trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Tips \nNEW YORK -- A business trip might leave you too tired to venture out for dinner. But if you're up for something beyond room service or hotel restaurants, a good meal out is one way to brighten up long days spent in meetings. Here are some strategies for dining out while travelling for work. \nTABLE FOR ONE? \nElizabeth McCourt, a headhunter and executive coach with her own company, McCourt Leadership Group, is a foodie who loves trying great restaurants when she travels, from Alice Waters' Chez Panisse in Berkeley, California, to Paul Prudhomme's K-Paul's Louisiana Kitchen in New Orleans. She's even asked if an entree could be downsized to appetizer portion so she could sample more than one main course. \nAnd McCourt has no problem dining alone: \"I really enjoy that time by myself.\" But \"sitting at a table alone, sometimes people feel bad for you,\" she says. So if she can get food at the bar, she picks that over a table for one. That also ups the social aspect: \"Sometimes you can have a nice chat with the bartender or someone next to you.\" \nAshley Rodriguez, an account director at Fish Consulting in Washington, D.C., also eats at the bar when possible. \"Bartenders are really personable and talkative, so it makes for a much more enjoyable meal,\" she said. \"And I'm talkative, too, so I usually end up having a long conversation with the person sitting next me -- and I've met some cool people.\" \nAshby Brame, who does marketing for the Johnson County Visitors Bureau in Smithfield, North Carolina, describes herself as an extrovert who usually finds someone to talk to over dinner, whether it's inviting another conference attendee to join her or chatting with folks sitting nearby. Every once in a while, she'll even say to another solo diner, \"'I'm eating alone, and if you're eating alone -- I'm not trying to be weird -- but maybe we can share a table.' I'm just really upfront about it.\" \nDOING THE RESEARCH \nTripAdvisor, Yelp, Chowhound, Facebook and other social media sites are all go-tos when it comes to identifying good restaurants. Brame also likes to get recommendations from locals -- and not just the hotel concierge. She might pick a place near the hotel the first night, then ask the waiter or bartender there, \"'Where's a good local place to eat around here where you or your friends go?' I get each person to introduce me to another location, dinner to breakfast to lunch to dinner.\" \nRodriguez is gluten-intolerant, so researching menus is critical. \"I'll read recommendations from local reporters and bloggers, ask people on Twitter and use an app -- my saving grace -- called Find Me Gluten Free,\" she said. Often hotel concierges don't have gluten-free recommendations, but one concierge in Las Vegas memorably handed her a list of options near the hotel. \"I still have the list,\" she said. \nDINE-AROUNDS AND GROUP OUTINGS \nSome conferences organize dine-around nights, where the destination or host group invites attendees to sign up in advance for one of several preselected restaurants with different price ranges and cuisines. If there's no dine-around planned, Brame will sometimes \"just ask people at the conference, 'What are you doing for dinner?'\" and create an impromptu group outing. \nRodriguez has also \"made spontaneous dinner plans\" with other solo business travellers. But sometimes, she says, \"after a long day of talking to other people,\" she actually prefers eating alone: \"It's nice to get some 'me' time.\" \nEXPENSE ACCOUNTS \nFor dine-arounds, participating restaurants know they'll be expected to provide separate checks so each participant can expense the meal. \nBut what if you splurge on a celebrity chef? How do you explain the receipt to the office bean-counters? \nRodriguez says her rule of thumb is \"to spend responsibly.\" While her company doesn't have a strict cap on meal expenses, \"we kind of joke that we never want to get a phone call from the CFO asking about a dinner bill. So that keeps us responsible. But if I do want to go somewhere more expensive, I'll expense part of the meal and pay for the rest myself. It's only fair.\" Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions . Sponsored Links", "external_links": [], "published": "2015-08-03T07:00:00.000+03:00", "crawled": "2015-08-03T07:47:27.560+03:00", "highlightTitle": ""}