{"organizations": [], "uuid": "ab06ff8e372970c2d6a9056eef66af6e61ab50cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03404/yayabrom1_3404142k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-11.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sport/football/competitions/premier-league/11795442/Yaya-Toure-hits-back-at-critics-Im-not-back-I-was-always-there-says-Manchester-City-midfielder.html", "country": "US", "title": "Yaya Toure hits back at critics: I'm not back, I was always there, says Manchester City midfielder", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Yaya Toure hits back at critics: I'm not back, I was always there, says Manchester City midfielder - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T08:22:00.000+03:00", "replies_count": 1, "uuid": "42537aa21659063c6db58fb741133c81e5ed6f2d"}, "author": "Jason Burt , John Percy", "url": "http://www.telegraph.co.uk/sport/football/competitions/premier-league/11795442/Yaya-Toure-hits-back-at-critics-Im-not-back-I-was-always-there-says-Manchester-City-midfielder.html#post-0", "ord_in_thread": 0, "title": "Yaya Toure hits back at critics: I'm not back, I was always there, says Manchester City midfielder", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Yaya Touré last night hit back at the criticism he has faced after a lacklustre campaign last season claiming he does not “care what people say” about him. • West Brom 0 Man City 3: as it happened Even though Manchester City manager Manuel Pellegrini declared that “Touré was the Yaya of two seasons ago” – after a “strange season” last season – following his impressive display in the 3-0 demolition of West Bromwich Albion , the player refuted suggestions he has struggled for form. “I know what I have to do and I don’t care what people say about me. I’m not back – I’m always there,” Touré said. Yaya Touré scores his second goal at the Etihad “It’s about the team. We did a massive job today. West Brom have a good manager and players. Full credit to all our team. We made it easy because we played our own football, we played with belief and intensity.” Nevertheless Pellegrini admitted that Touré had “problems” last season – following the death of his brother Ibrahim in June 2014 – and it had appeared that he had wanted to leave City following claims made by his agent . • West Brom 0 Manchester City 3: Five things we learned “I am sure we are going to see the same Yaya as we saw the season before,” Pellegrini said although he added that he did not think the player “deserved the amount of criticism he had last season”. City now face Chelsea at home on Sunday with Pellegrini declaring it was “important to beat the champions” and win “all the games we play at home”. Touré's copybook is blotted by a yellow card from Mike Dean Pellegrini confirmed that he was still looking to strengthen his squad with City having submitted a bid of £46 million for Wolfsburg’s Kevin De Bruyne to add to their attacking options. Albion have done that after completing the record £12 million purchase of striker Salomón Rondón from Zenit St Petersburg – with manager Tony Pulis admitting the signing of the 25-year-old will probably hasten the departure of attackers Brown Ideye and Victor Anichebe. “They want more regular first-team football,” Pulis said. “The fact that bringing in Salomón in does it hasten their move from the football club? We will have to wait and see.” Salomon Rondon arrives from Zenit St Petersburg Pulis consulted Pellegrini – who coached Rondón at Málaga – and also followed a recommendation of Zenit coach Andre Villas-Boas who had to sell the Venezuelan to reduce his quota of foreign players following changes in the rules in the Russian league. Pulis’s capture of Rondón is further proof that he is now in full control of the club’s transfer policy, with Albion’s spending already approaching the £25 million. He is determined to add a winger, with QPR’s Matt Phillips and Nottingham Forest’s Michail Antonio both under consideration, while he is also pondering a bid for Tottenham Hotspur centre-half Federico Fazio while Cardiff City goalkeeper David Marshall should sign next week. TelegraphSportPage Follow @telefootball Telegraph Fantasy Football 2015/16 Get your first team free. £100,000 to be won Pick your free team »", "external_links": [], "published": "2015-08-11T08:22:00.000+03:00", "crawled": "2015-08-11T04:47:50.586+03:00", "highlightTitle": ""}