{"organizations": [], "uuid": "412019817fc31b648006f95762c7d14973365a5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gohawaii.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/175075612.jpg", "site_section": "http://z.about.com/6/o/m/gohawaii_t2.xml", "section_title": "About.com Hawaii Travel: What's Hot Now", "url": "http://gohawaii.about.com/od/hawaiivacationplanner/a/traveling_with_pets.htm", "country": "US", "title": "Can You Bring Pets to Hawaii?", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Can You Bring Pets to Hawaii?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T14:08:00.000+03:00", "replies_count": 0, "uuid": "412019817fc31b648006f95762c7d14973365a5e"}, "author": "", "url": "http://gohawaii.about.com/od/hawaiivacationplanner/a/traveling_with_pets.htm", "ord_in_thread": 0, "title": "Can You Bring Pets to Hawaii?", "locations": ["Hawaii"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expert Videos \nTraveling with a pet to Hawaii may seem like a fun thought, but chances are you have no idea of what you're getting into. If you're talking about a cat or dog, it's possible, but not at all easy. If you're talking about some other type of animal, stop right here. You can't. \nWhat's the problem? Well, let's join the following conversation and take a look. \nI'm traveling to Hawaii and thinking about bringing my cat or dog. \nMy advice is, in most cases, don't. \nWhy not? \nHawaii has a special quarantine law that is designed to protect residents and pets from potentially serious health problems associated with the introduction and spread of rabies. \nWhy is Hawaii different from any other state? \nHawaii is unique in that it has always been free of rabies, and is the only state in the United States to be rabies-free. It wants to remain that way. \nHave there been close calls? \nThere have been scares and in 1991 a bat found in a shipping container from California was determined to be rabid, but it was captured and destroyed without incident. \nBut my pet has had his or her shots and I really want to bring it? \nThe requirements of the quarantine law are very complex and potentially expensive. I'll talk more about that in a minute, but forgetting the quarantine issue, why would you subject your pet to at least a five hour flight in the cold luggage compartment of a plane? If you're coming from the east coast, you're talking 10-12 hours. Add to that there are very, very few pet friendly hotels in Hawaii and my advice, once again, is to leave your pet at home with a pet sitter. \nOK, that makes sense for someone who's taking a vacation to Hawaii for a week or two, but what if I'm going to Hawaii for an extended stay or being transferred by the military or my company with my family? \nThen you'll need to comply with the quarantine procedure and to do so you'll need to start well before your move - at least four months. \nFour months! That's crazy! \nKeep in mind Hawaii's quarantine law is not for your convenience. It's for the safety of Hawaii's people and animal population. \nSo, tell me about this law and what I'll have to do. \nIt's rather complex, so at the end of this article I've included links to the State of Hawaii's Department of Agriculture's website where you can get all of the details and necessary forms. \nBasically, however, depending on when or if you complete the required steps of the 5-Day-Or-Less program requirements prior to your arrival in Hawaii, your pet may be directly released to you at the airport or held for up to 120 days at your cost. \nIf you seek direct release of the pet at the airport, you must submit the required original documents so that the State receives the paperwork at least 10 days prior to your pet's arrival. I told you it was complex. Even if you complete all of the paperwork, but it is not received at least 10 days prior to your pet's arrival, your pet will be quarantined for up to 5 days. \nPets that are not directly released under the 5-day-or-less program will be taken to the main Animal Quarantine Station in Halawa Valley on Oahu. If a pet stays between 0 and 5 days, the cost will be $224. Fees for any additional days will be charged at $18.70 per day. \nMy head is spinning! What types of things to I have to do at home first? \nYour pet will have needed at least two rabies vaccinations and be current on them. The second vaccination must be done at least 90 days before arrival in Hawaii. \nYour cat or dog must have an electronic microchip implanted. \nYour pet will need to have had an OIE-FAVN Rabies Blood Test not more than 36 months and not less than 120 days before the date of arrival in Hawaii. \nNumerous documents must be completed by you and your veterinarian and submitted to the State. \nCan it get even harder? \nWell, all of what I have said assumes you're flying into Honolulu and staying on Oahu. If you're flying to the Kona on the Big Island , Lihue on Kauai or Kahului on Maui, things are a bit more complicated. \nCheck out the links at the end of this article. There are also special rules for guide dogs used by the blind. \nWell, I think you've convinced me to find a good pet sitter and leave my pet at home. \nA wise decision. Unless you're moving to Hawaii or coming for an extended stay, it's really the best thing to do for your pet. For More Information \nFor more information check out these links, all of which are to the State of Hawaii Department of Agriculture Animal Quarantine Branch website. You can also email them at rabiesfree@hawaii.gov .", "external_links": [], "published": "2015-08-27T14:08:00.000+03:00", "crawled": "2015-08-28T01:32:10.424+03:00", "highlightTitle": ""}