{"organizations": [], "uuid": "2aead7081735c7a4e933b3461b88f46521a159de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62199/american-tourists-contribute-impressive-rise-london-museum-atten", "country": "US", "title": "American tourists contribute to impressive rise in London museum attendance", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "American tourists contribute to impressive rise in London museum attendance", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T20:32:00.000+03:00", "replies_count": 0, "uuid": "2aead7081735c7a4e933b3461b88f46521a159de"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62199/american-tourists-contribute-impressive-rise-london-museum-atten", "ord_in_thread": 0, "title": "American tourists contribute to impressive rise in London museum attendance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "American tourists contribute to impressive rise in London museum attendance Adv: \nAug 04, 2015 Adv: \nLONDON, England - London’s museums and galleries are welcoming increasing numbers of visits driven by rising numbers of American tourists, according to figures released by London & Partners, the official promotional company for the capital, and MHM Insight to mark the launch of London’s blockbuster Autumn Season of Culture. \nIn the last year alone there were 2.4 million American visits to London’s leading museums and galleries, up by 9 per cent on the previous year, tying the USA with France as the top market by volume, followed by Italy, Spain and Germany. \nSeparate search insights from Google reveal that London is the most Googled city in the world for art galleries, performing arts and innovative art and design, \nSearch insights from Google show that London’s theatres generate more searches than those in any other city, while international searches for globally renowned museums rank the Science Museum in London as the most Googled museum in the world*. \nThe Natural History Museum and the British Museum rank second and third according to Google, followed by The New York Metropolitan Museum of Art and the Smithsonian Museum in Washington, D.C. \nThe data from Google also shows that London is the most searched for city in the world to visit. Separate research published by London & Partners and MHM Insight reveal that in 2014/15 London’s museums and galleries received 17.9 million overseas visits, accounting for 57% of the total 31.5 million visits. \nToday VisitLondon.com, in partnership with the GREAT Britain Campaign, launches London’s Fall Season of Culture which will showcase the blockbuster exhibitions and events coming to the capital. At an evening event hosted at The Victoria and Albert Museum, leading figures from the capital’s major institutions will celebrate the launch of their key fall exhibitions. A new film previewing the coming Fall Season, narrated by Downton Abbey star Jim Carter – the popular Mr Carson – and featuring a cameo appearance by Mayor of London, Boris Johnson will be premiered at the event. \nMayor of London, Boris Johnson said: \"London is without a doubt the cultural capital of the world. Tourists are flocking to our great city in ever-increasing numbers, drawn by our exceptional cultural attractions and landmarks. Our world-famous museums, galleries, theatres and performance venues have done a terrific job creating and attracting the blockbuster exhibitions and events that form this spectacular Fall Season of Culture in London. If you are planning to travel in the months ahead, London is a city not to be missed.\" \nCommenting on being named the most Googled museum in the world, Ian Blatchford, Director of the Science Museum, says: \"It’s fantastic that so many people across world are seeking out the Science Museum, and this new data provides yet more evidence of the world class status of British museums. Our most audacious exhibition ever, Cosmonauts: Birth of the Space Age, opens this September and I hope all those googling the Science Museum get the chance to visit.\" \nThe film of London’s Autumn Season of Culture goes behind-the-scenes at the city’s leading museums and attractions as they prepare to launch their stellar line-up of blockbuster events and exhibitions. The film includes exclusive footage of a Russian lunar lander space capsule being lifted into the Science Museum for Cosmonauts: Birth of the Space Age, special previews of The World Goes Pop at Tate Modern and Cycle Revolution at the Design Museum, and original evidence from London’s criminal past, which has never been seen before by the general public, being prepared for The Crime Museum Uncovered exhibition at the Museum of London. \n“London truly offers the best cultural experiences in the world, whether visitors come to enjoy our world-famous West End theatre, visit our incredible museums and galleries, or they simply come to take in the city’s unrivalled history and heritage”, said Jim Carter. “The Fall Season of Culture features something for everyone, from Russian spacecraft, to incredible images of nature in action, as well some of the greatest artists that have ever lived. When I walk through London, from Buckingham Palace to the Tate Modern, I’m always taken aback by the spectacle of this awe-inspiring city.” \nGordon Innes, Chief Executive of London & Partners, the Mayor’s official promotional company for the capital which has led the Fall Season initiative, said: “We launched the Fall Season of Culture to underline the outstanding exhibitions and events taking place across London in the months ahead. Culture is the leading reason why visitors come to London and it is vital to the city's economy, contributing an estimated £7.3bn per year. By bringing together these events, we can attract new international audiences to experience the best of London’s blockbuster cultural offerings, while underlining the city’s status as a global cultural powerhouse.” \nThe number of international visitors coming to London continues to rise. Last year 17.4 million overseas tourists visited the capital. The rise in international visitors is helping to drive record audiences at the city’s museums and galleries. Research released by London & Partners and MHM Insights shows that London’s museums and galleries are attracting record numbers of visits overall and seeing a sharp rise in overseas visits. \nThe number of international visits at London’s museums and galleries has risen by more than 19 per cent over the last four years. The top overseas markets visiting London museums and galleries in 2014/15 show French and American visitors tied in first place, followed by Italy, Spain and Germany. Collectively these top five markets accounted for 9.7 million of the total of 17.9 million overseas visits recorded. \nLaurian Clemence of Google UK, added: \"It's no surprise that London's museums, historical landmarks, performing arts scene and theatres are some of the most searched places in the world, by people interested in learning more about these places and those planning a visit. Throughout the year there is strong interest in London's cultural landscape just via the searches we see.\"", "external_links": [], "published": "2015-08-04T20:32:00.000+03:00", "crawled": "2015-08-04T22:36:44.884+03:00", "highlightTitle": ""}