{"organizations": [], "uuid": "698ad7c5c6ef1779653e6f39d91d7e752bb9cfd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wickedgoodtraveltips.com", "main_image": "", "site_section": "http://www.wickedgoodtraveltips.com/feed/", "section_title": "Wicked Good Travel Tips", "url": "http://www.wickedgoodtraveltips.com/2015/08/bolongo-bay-resorts-adults-stay-free-promotion-is-perfect-for-friends-getaways-this-fall/", "country": "US", "title": "Bolongo Bay Resort’s Adults-Stay-Free Promotion Is Perfect For Friends Getaways This Fall", "performance_score": 0, "site": "wickedgoodtraveltips.com", "participants_count": 1, "title_full": "Bolongo Bay Resort’s Adults-Stay-Free Promotion Is Perfect For Friends Getaways This Fall", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T15:41:00.000+03:00", "replies_count": 0, "uuid": "698ad7c5c6ef1779653e6f39d91d7e752bb9cfd4"}, "author": "Susan Kohlback", "url": "http://www.wickedgoodtraveltips.com/2015/08/bolongo-bay-resorts-adults-stay-free-promotion-is-perfect-for-friends-getaways-this-fall/", "ord_in_thread": 0, "title": "Bolongo Bay Resort’s Adults-Stay-Free Promotion Is Perfect For Friends Getaways This Fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 17, 2015 | By Susan Kohlback More \nBolongo Bay Beach Resort , on the island of St. Thomas, has a September-to-Remember promotion that is perhaps the best friends’ getaway idea that we’ve every heard of – 3 adults stay free with every paying adult! St. Thomas has never been more inviting for an adult getaway than it is with Bolongo Bay Beach Resort’s amazing deal. I think it’s time to text the girlfriends and get a group together!!! \nJust when the kids are packing up their backpacks and heading off to school, it might just be the ideal time to pack up your suitcase and take a quick trip to St. Thomas for some Caribbean beach R&R. For the full month of September, Bolongo Bay Beach Resort makes it easy for friends to group up and vacation together with their promotion: For one paying adult (18 and over) the second, third and fourth adult stays free in the same room. Girlfriend pajama party bash, here we come!!! \nBolongo Bay is offering discounted room rates starting at $253 per night including taxes and service charges for the month of September. If there are four of you sharing a room, that’s just $63.25 per person per night – WOW. St. Thomas is easy to reach with many east coast cities offering nonstop flights and there are NO PASSPORTS REQUIRED for US Citizens since St. Thomas is part of the US Virgin Islands. (And you’ll most likely have cell phone service as well) A four night stay is required for the promotion, and reservations must be booked by September 15, 2015. \nGuests at the resort will find two seaside restaurants overlooking Bolongo Bay beach, and nightly entertainment at Iggies Beach Bar, named one of the best beach bars in the world. In addition to a lovely stretch of golden sand beach, there are complimentary Hobie Cats, stand-up paddle boards, windsurfers, kayaks and snorkel gear. For adults visiting over a Thursday, don’t miss the resort’s famous Snorkel Booze Hunt where swimmers play “finders-keepers”, diving for free bottles of Caribbean rum. \nFor reservations visit BolongoBay.com or call 800-524-4746 and use the booking code “AdultsFree”.", "external_links": [], "published": "2015-08-17T15:41:00.000+03:00", "crawled": "2015-08-17T17:51:46.637+03:00", "highlightTitle": ""}