{"organizations": [], "uuid": "d1cbaaa0f7ff755a897bf2984f8a11edc05e6640", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2015/7/28/1438096950116/61f4b4ef-cfda-428f-92d4-938cec813970-2060x1236.jpeg", "site_section": "http://feeds.guardian.co.uk/theguardian/travel/rss", "section_title": "Travel | The Guardian", "url": "http://www.theguardian.com/travel/2015/aug/01/10-best-pubs-for-summer-lunch-england-wales", "country": "US", "title": "10 of the best pubs for a summer lunch", "performance_score": 1, "site": "theguardian.com", "participants_count": 1, "title_full": "10 of the best pubs for a summer lunch | Travel | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "d1cbaaa0f7ff755a897bf2984f8a11edc05e6640"}, "author": "Alastair Sawday", "url": "http://www.theguardian.com/travel/2015/aug/01/10-best-pubs-for-summer-lunch-england-wales", "ord_in_thread": 0, "title": "10 of the best pubs for a summer lunch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Bridge Inn, Michaelchurch Escley, Herefordshire In a pretty spot down by the river, beneath the Black Hill of Bruce Chatwin fame, the 16th-century Bridge started life as a house. Walkers descend on the pub via a footbridge lined with willows weeping, so do dogs, and families and shooting parties. Inside, hops hang from dark beams, there are solid wooden pews and scrubbed pine tables. It’s properly pubby. Pints of Butty Bach slip down nicely with seafood stew, barbecue brisket or Escley-side pie. Four super country bedrooms lie in the farmhouse a minute away. \n• Lunch £8-£22, dinner £12-£22, rooms from £95 per night, 01981 510 646, thebridgeinnmichaelchurch.co.uk \nThe Feathered Nest Country Inn, Nether Westcote, Chipping Norton, Oxfordshire Facebook Twitter Pinterest This 300-year-old malthouse sits in 55 acres of green and pleasant land and is utterly gorgeous inside and out. The view from the garden is among the best in the Cotswolds – a five-mile sweep across quilted fields to a distant ridge. Interiors are just as good; a warm rustic style mixes beautifully with original timbers and old stone walls. Cask ales await in the lovely bar, doors in the restaurant open on to the terrace, the garden room has the white wine cellar on display. There are beds of lavender, swathes of lawn, a vegetable garden that serves the kitchen, and sublime food: Old Spot terrine, Fairford chicken, rhubarb and champagne jelly. \n• Lunch and dinner £6.50-£30, doubles from £180 B&B, 01993 833 030, thefeatherednestinn.co.uk \nJacobs Inn, Wolvercote, Oxford \nFacebook Twitter Pinterest From the Oxford sausages at breakfast to the home-cured meats, this is the place for nose-to-tail dining. It’s an old Cotswolds inn in a suburb of Oxford on the footpath to Port Meadow, and inside all is airy, rustic and beautiful. Even if you just fancy a pint and a pot of chipolatas, you’re still in for a treat: the ales change daily and the chipolatas are from the garden (they keep pigs and hens). In summer punters spill into the grounds, with picnic tables, deckchairs and a great big terrace. \n• Lunch from £3.50, dinner from £7, 01865 514 333, jacobs-inn.com \nThe Canbury Arms, Kingston upon Thames, London Facebook Twitter Pinterest Visitors can enjoy real ales, good wines and delicious treats in this handsome corner pub. Built in the late 1800s to feed and water white-collar workers, it’s remained popular with locals who pop in for pints of Twickenham’s Naked Ladies and bar snacks such as ox cheek croquettes with horseradish aioli in the main bar or garden room. And there’s a pretty terrace in the summer for hog roasts and pints. Breakfasts are popular too. \n• Bar meals £5, set menu £9.50-£17.50, 0208 255 9129, thecanburyarms.com \nThe Black Lion Inn, Llanfaethlu, Holyhead, Anglesey \nFacebook Twitter Pinterest The lion roars again thanks to a renovation that has turned this once derelict late 18th-century country inn into an award-winning local champion. Contemporary slate tiles wrap round a modern bar, lime rendered walls host modern pictures – one a fabulous collage of the menu’s provenance. French windows open to a paved patio with views to fields, one of which will soon grow vegetables and herbs for the kitchen. Ales from local Welsh breweries and interesting wines set you up for modern British dishes made with locally grown, foraged and reared produce. Try fresh-as-can-be seared scallops with black pudding, pancetta and pea puree, or braised shoulder of local lamb with a root vegetable rosti. Stay the night in one of two hugely comfortable rooms. \n• Lunch and dinner £6-£19, doubles from £115 B&B, 01407 730 718, blacklionanglesey.com \nThe Three Tuns, Great Bedwyn, Marlborough, Wiltshire \nFacebook Twitter Pinterest Drive through woodland from Marlborough to arrive at a pretty village and this late 18th-century pub with a homemade emphasis on modern and classic pub dishes. Begin with seared scallops, deep fried ham hock ballotine and cauliflower purée before a wild venison burger with bacon and onion jam and chips, then perhaps toffee-apple crème brûlée and cinnamon shortbread. The bar has a glorious brick fireplace, old floorboards and panelling, beams and rustic signage. It’s a lovely place to raise a pint of Butcombe or Ramsbury ale, plus a lovely little garden with boules pitch and Savernake Forest nearby. \n• Lunch and dinner £12-£22, 01672 870 280, threetunsbedwyn.co.uk \nThe Duncombe Arms, Ellastone, Ashbourne, Derbyshire \nFacebook Twitter Pinterest The bar is sleek and stylishly laid out, with rustic nooks to settle into, and the food is absolutely beautiful: braised pig’s head terrine or sea bass with crushed new potatoes and slow-cooked cherry tomatoes delivered to inviting tables in dining areas cosy, lofty, private, airy or alfresco – take your pick. There are wines from Bibendum, 13 top malts, Duncombe Ale on tap, and in summer diners spill into a huge garden with views across the Dove Valley. \n• Lunch and dinner £5-£19. 01335 324 275, duncombearms.co.uk \nThe George, Eartham, Chichester, Sussex Facebook Twitter Pinterest Vintage cars at The George This very English cosy pub is tucked away in the glorious South Downs. It’s not just the Cath Kidston country kitchen bar and the Saint George references that wave the British flag; behind the bar are artisan beers, stouts, meads, cordials, and a few British wines. Well-kept beers such as Goodwood Organic Sussex Ale make a fine accompaniment to the locally sourced dishes – Sussex rarebit on artisan bread, pork chops with butternut squash mash, leeks and apple and ale gravy, seasonal fruit crumbles. In summer there’s a pretty garden for barbecues and an annual beer festival. \n• Lunch and dinner £9.50-£17.95. 01243 814 340, thegeorgeeartham.com \nThe Yew Tree, Spurstow, Bunbury, Cheshire Facebook Twitter Pinterest This pub in a pretty corner of Cheshire has several areas for eating and drinking, including handsome snugs. Very well-kept ales (Merlin’s Gold, Stone House Station Bitter) and 10 wines accompany some skilled cooking – the smoked haddock and salmon pie is delicious. The children’s menu is typical of the level of care: not just sausages and mash but roasted vegetable pasta, too – and Eton mess for pud. \n• Lunch and bar meals from £5.95, dinner from £9.50, 01829 260 274, theyewtreebunbury.com \nThe Punch Bowl Inn, Low Row, Richmond, North Yorkshire \nFacebook Twitter Pinterest The hamlet of Low Row clings to the hillside high above the Swale. The parasol’d front is a sun-trap, the views to the moors are superb and Gunnerside, Muker and Keld are a walk away. Inside, there’s a unique bar crafted by “Mouseman” Thompson (spot the mouse carving) and real ales and good wines flow – but the food is the draw. Try Asian spiced beef with couscous and sweet chilli sauce, braised pork belly with mash, crackling and cider jus, braised beef casserole and Cogden Hall Farm steaks. \n• Lunch and bar meals from £8.95, dinner from £13.95, 01748 886233, pbinn.co.uk \nAll pubs are taking part in the Sawday’s 2-for-1 lunches promotion with the Guardian and also feature in a new edition of Sawday’s new Special Places: Pubs & Inns of England & Wales guide, out 1 August, £15.99; or the app is available from the App Store, £4.99 . For more information visit sawdays.co.uk/pubs", "external_links": [], "published": "2015-08-01T03:00:00.000+03:00", "crawled": "2015-08-01T09:30:22.335+03:00", "highlightTitle": ""}