{"organizations": [], "uuid": "e6959eb08f74dff81d8742d2f892c5ce9857101b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/08/20/travel/20intransitphoto-catch/20intransitphoto-catch-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT > Travel", "url": "http://www.nytimes.com/2015/08/20/travel/food-and-wine-news-vineyard-walks-an-ex-gangster-talks.html?partner=rss&emc=rss", "country": "US", "title": "In Transit: Food and Wine News: Vineyard Walks, an Ex-Gangster Talks", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "In Transit: Food and Wine News: Vineyard Walks, an Ex-Gangster Talks", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T12:45:00.000+03:00", "replies_count": 0, "uuid": "e6959eb08f74dff81d8742d2f892c5ce9857101b"}, "author": "SHIVANI VORA", "url": "http://www.nytimes.com/2015/08/20/travel/food-and-wine-news-vineyard-walks-an-ex-gangster-talks.html?partner=rss&emc=rss", "ord_in_thread": 0, "title": "In Transit: Food and Wine News: Vineyard Walks, an Ex-Gangster Talks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "See More » The New York City restaurateur Danny Meyer, whose résumé ranges from the Gramercy Tavern to Shake Shack, has decided that Chicago is also his kind of town. His Union Square Events company has teamed with the Best Bar in the World Hospitality Consulting , based in New York City and known for its cocktail bar the Dead Rabbit, to open an Irish-American restaurant and bar in the city in mid-September. Called GreenRiver, the space will celebrate the history of Irish-American culture in the city with its décor and cocktails; the food will focus on seasonally driven plates. It will be located in Chicago’s Streeterville neighborhood. SEAFOOD IN NEW PLACES Catch , the popular seafood restaurant in the meatpacking district in New York City, is expanding with locations in Dubai, Los Angeles and Playa del Carmen, Mexico. Catch opened in April at the Fairmont Dubai in the center of town. The 200-seat space mimics the décor in New York of plush burgundy leather booths and copper and brick accents. The menu is also similar and includes items offered in New York like tuna tartare and wasabi on a crisp rice cake and scallop gnocchi with black truffle. A handful of dishes like the chile-rubbed whole roasted sea bass and kingfish tacos are unique to Dubai. The other two locations — in the West Hollywood area of Los Angeles and at the Thompson hotel in Playa del Carmen — are scheduled to open within the next six months. THE EX-BANK ROBBER WHO’LL COME TO DINNER The latest offering from Trip4Real, a Barcelona-based travel company specializing in locally led activities, gives travelers a chance to dine with the infamous Spanish gangster known as Dani the Red. They can hear how he robbed 150 banks (without hurting anyone) and spent more than a decade in a maximum security prison. Since his release in 1989, he has been a bodyguard for famous figures like the soccer star Lionel Messi, published three memoirs and played the gangster role in a handful of Spanish movies. The meal, either lunch or dinner, takes place at the beachfront El Escribà restaurant, and because Dani speaks only Spanish, the company provides a translator if needed for no additional cost. The price begins at 120 euros (about $130) for up to six people. Loading...", "external_links": [], "published": "2015-08-20T12:45:00.000+03:00", "crawled": "2015-08-20T13:25:51.436+03:00", "highlightTitle": ""}