{"organizations": [], "uuid": "6a194e5b7517f0c0d1d37c16ce1b0733610bdb32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/12/IBTM.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/ibtm-china-delivers-quality-business-appointments/", "country": "US", "title": "ibtm china Delivers Quality Business AppointmentsTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "ibtm china Delivers Quality Business AppointmentsTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "6a194e5b7517f0c0d1d37c16ce1b0733610bdb32"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/ibtm-china-delivers-quality-business-appointments/", "ord_in_thread": 0, "title": "ibtm china Delivers Quality Business AppointmentsTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ibtm China delivers quality business appointments Published on : Wednesday, August 12, 2015\nibtm china , China’s leading Incentive, Business Travel & Meetings exhibition has reported strong levels of exhibitor and buyer satisfaction following the show which took place at the China National Convention Centre (CNCC) Beijing last week.\nThe event which saw a combination of Chinese, Asian and international MICE suppliers and buyers attend confirmed standing room only at all education sessions, a well attended Community Hub and two successful networking functions hosted by NUO Hotel and Marriot Northwest.\nHyejung Yang, Incentive and Exhibitions Team, Korea Tourism Organisation commented on her experience at the show; “We have had a lot of business from Trade Buyers and Hosted Buyers attending the show. We have attended ibtm china for the last 5 years and it is an important part of our marketing strategy. Following last years CIBTM we secured an incentive tour for 15,000 corporates. This year we have confirmed an incentive group of 8,000 international delegates with a U.S. corporate company.”\nHelen Zhang, Business Events Manager Greater China, New Zealand Tourism said, “This is our third year at ibtm china and yesterday we received around 15 business leads, which was very productive. It is important that we continue to exhibit here as it allows us to educate people about New Zealand’s potential in this sector and now buyers are coming to our stand asking about particular cities for hosting meetings, which is a great trend that started here.”\nGrace Crispus-Shanmugam, Executive Assistant to Group CEO, Clarius Group (Australia) who attended as an international Hosted Buyer commented, “This has been a great show for me and has definitely been worthwhile. I have found some suppliers here that I am definitely interested in using going forward. The show helps me learn more about the industry and has given me some great new ideas. It has been a good use of my time out of the office and I have found it the most productive show to date.”\nSupporting this, Ms. Wang Yue, Vice Chairman of Beijing Municipal Commission of Tourism Developments commented during the official ibtm china press conference, “ibtm china has grown into Asia’s largest and most mature international exhibition dedicated to the convention, exhibition and incentive industries over the past decade, offering a solid platform for Beijing’s and even China’s tourism to expand external communication, intensify collaboration, promote development and achieve a win-win result.”\nSource:- ibtm", "external_links": [], "published": "2015-08-12T03:00:00.000+03:00", "crawled": "2015-08-12T14:39:44.618+03:00", "highlightTitle": ""}