{"organizations": [], "uuid": "5fa1695ef1c2ce034cb31b8660acd09721310034", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sooperarticles.com", "main_image": "", "site_section": "http://www.sooperarticles.com/rss/category/travel-21.xml", "section_title": "Travel Articles - Sooper Articles", "url": "http://www.sooperarticles.com/travel-articles/meandering-through-moscow-1437838.html", "country": "US", "title": "Meandering through Moscow", "performance_score": 0, "site": "sooperarticles.com", "participants_count": 0, "title_full": "Meandering through Moscow", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T21:31:00.000+03:00", "replies_count": 0, "uuid": "5fa1695ef1c2ce034cb31b8660acd09721310034"}, "author": "", "url": "http://www.sooperarticles.com/travel-articles/meandering-through-moscow-1437838.html", "ord_in_thread": 0, "title": "Meandering through Moscow", "locations": ["Moscow"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 \nSteeped in deep and rich history, Moscow is one of Russia's premier cities. Dotted with awe-inspiring historical sites, ruins of the monarchy and a vibrant culture, Moscow plays host to thousands of visitors each year. \nLocated along the Moskva River in western Russia, Moscow is home to more than 11.92 million people. The city has grown tremendously since its establishment in the 14th century - the city has transformed over the years, from the rule of the Tsars to the governance of the pseudo-communist government that we know today. Despite political controversy, Moscow is a well-loved tourist destination that offers up something for everyone. If you've booked yourself an exciting holiday special, the chances are high that you've already received a jam-packed itinerary of things to do and places to see. However, if you're wondering about the three greatest attractions in Moscow, take a look at what you will find when you're meandering through Moscow: \nThe Kremlin \nOriginally the centre from which the city of Moscow grew, the Kremlin is the city's fortified complex that overlooks the Moskva River. The complex serves as the residence for the Russian president and the country's federation. Within the walls of the Kremlin lie five palaces, four cathedrals and the Kremlin Tours - all of which were once home to the royal Tsar family. The site, which has been home to royalty and rulers since the Finno-Ugric tribes of the second century BC, sees thousands of visitors pass by its walls every year. If you find yourself in Moscow with nothing to do, a trip to the Kremlin is sure to keep you busy! \nRed Square \nMoscow's Red Square is considered to be the central plaza or square in the city as all of the central streets lead off of the square. The square is home to St. Basil's Cathedral, the Spassky Tower of the Kremlin, the Lobnoe Mesto and Vladimir Lenin's mausoleum. Initially, the square was created to host royal soirees and balls; however, the square was predominately used for public ceremonies, rallies, and coronations. If you pay a visit to the square, you will be able to find the following attractions: Lenin's Mausoleum, The Kremlin's Cathedrals and Palaces, The Kazan Cathedral, The Iberian Gate and Chapel. \nSaint Basil's Cathedral \nAlthough the cathedral can be found in Red Square, it deserves a separate mention. The Cathedral of Vasily the Blessed; or more commonly known as Saint Basil's Cathedral, is a colourful candy-striped work of art and is one of Russia's most notable churches. Built between 1555 and 1561, the cathedral was commissioned by Ivan the Terrible to commemorate the capture of Kazan and Astrakhan. Originally named the 'Trinity Church', the design consisted of only one steeple - today, the church boasts five colourful steeples. Awe-inspiring in its own right, the cathedral is one of Moscow's most beautiful attractions. \nMeandering through Moscow is sure to be busy and filled with interesting facts about the city's history. Just remember to take the time to enjoy the vibrancy and romance of the city, too! South African Airways is a Star Alliance member that offers flights to 38 destinations worldwide . Domestically, SAA operates 544 flights a week between Johannesburg - Cape Town, Durban, East London and Port Elizabeth. Regionally SAA offers 24 destinations across the African continent and its international network creates links to all major continents from South Africa through 10 direct routes. In the regional category, SAA has received the Skytrax 'Best Airline in Africa' Award for 11 consecutive years. Rate this Article", "external_links": [], "published": "2015-08-18T21:31:00.000+03:00", "crawled": "2015-08-19T06:17:06.998+03:00", "highlightTitle": ""}