{"organizations": [], "uuid": "dbe394d318b8f9d8427f9296862646a62328c2f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources1.news.com.au/images/2015/08/19/1227489/565861-af9d1df6-454a-11e5-bc34-34ddf35a38db.jpg", "site_section": "http://www.adelaidenow.com.au/travel/world", "section_title": "World Travel | Overseas and International World Travel | The Advertiser", "url": "http://www.adelaidenow.com.au/business/companies/why-your-first-year-of-university-could-be-a-rip-off/story-fni0d54v-1227489565921", "country": "US", "title": "University fees in Australia: How first-year students could be getting ripped off", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "University fees in Australia: How first-year students could be getting ripped off | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T19:24:00.000+03:00", "replies_count": 0, "uuid": "dbe394d318b8f9d8427f9296862646a62328c2f6"}, "author": "CHARIS CHANG", "url": "http://www.adelaidenow.com.au/business/companies/why-your-first-year-of-university-could-be-a-rip-off/story-fni0d54v-1227489565921", "ord_in_thread": 0, "title": "University fees in Australia: How first-year students could be getting ripped off", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GETTING into university may feel like a dream come true but some students will never graduate — and that’s exactly what some institutions want.\nIt might seem far-fetched but there is already a financial incentive for Australian universities to accept more students and the US is grappling with how to deal with colleges that seem aimed purely at making a profit.\n“The US obviously has some of the greatest research universities in the world ... but we also have an entire sector of schools that thrive on the financial model,” Professor Susan Dynarski of the University of Michigan told a forum into university financing at the Australian National University last week.\n“We have schools with graduation rates of 5 per cent, 10 per cent ... schools that take the subsidy for the first year and the student drops out, so this can happen.”\nIncoming ANU vice-chancellor Brian Schmidt told the forum that there had already been changes made to the Australian system that created an incentive for institutions to go after the student dollar.\n“I’m not saying that everyone’s doing this but the reality is that if you teach lots of students poorly, you’re going to make lots of money,” Prof Schmidt said.\nIf the ANU was more interested in making money than teaching students, it could simply focus on getting more students through the doors, he said.\n“Students are much cheaper to teach in year one, than in years two and three. So why not do what is completely reasonable in a crisis, and just open it up to anyone who wants to come to ANU for example; that’s very equitable.”\nHe said the university could then fail the 85 per cent of the people who probably wouldn’t make it through the first year courses, take their HECS/HELP and then do it all again next year.\n“That’s a way to make a lot of money ... it seems to be incentivised in the current system, and I don’t think that anyone thinks it’s a great deal for the students or the nation.”\nHe said there had already been some “incentivised financially bad behaviour” after the removal of a cap limiting the number of students allowed to attend university, combined with the fact that every institution received the same funding per student regardless of how well they taught.\n“Is that efficient? Well, it’s efficient to make money, but it’s maybe not efficient for the country,” he said.\nProf Schmidt said this was not a good way of funding higher education in Australia and alternatives should be found.\n“It should be good value for the government, it needs to be good value for the student and it needs to serve universities,” he said.\nThe forum was aimed at finding the best way of funding universities after a controversial proposal from the Abbott Government to deregulate fees in the 2014 Budget was rejected by the Senate.\nOverseas experts warned of the dangers of tinkering too much with the Australian HECS/HELP loan system, which has been admired around the world.\nProf Dynarski said the US was already struggling to deal with the practices of private for-profit institutions which had prioritised making money from students.\nStudents had been pushed into enrolling in private institutions during the recession when the US government provided extra subsidises, as an alternative to the unemployment queue.\nBut it did not open up more spots in public universities so students took out loans to attend private institutions instead.\nAs a consequence, the for-profit sector grew from making up 2 per cent of graduates as recently as 10 years ago, to representing about 10 per cent of the higher education market. Many of these institutions charged huge students fees.\nThis had huge implications for those students who took on loans to pay for their education, which they still have to pay off within 10 years, even if they don’t graduate.\nUS students have to pay their debt back within 10 years, and at the same flat rate, regardless of how much they earn.\nIf they don’t, they can go into default, even if their loans are relatively small, with damaging consequences for their ability to get future loans or access rental properties. It’s not surprising that Prof Dynarski is now pushing for the US to adopt some aspects of the Australian HECS system instead.\n Why university could be a rip-off", "external_links": ["http://www.news.com.au/finance/work/australia-cautioned-against-breaking-its-university-funding-system/story-fnkgbb3b-1227488715926", "http://www.news.com.au/finance/business/why-your-first-year-of-university-could-be-a-rip-off/story-fnda1bsz-1227489565921"], "published": "2015-08-19T19:24:00.000+03:00", "crawled": "2015-08-19T07:55:09.056+03:00", "highlightTitle": ""}