{"organizations": [], "uuid": "391908812429f375e5c67c1423c0fbf2e365b9c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/278882/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29871412/attend-chick-fil-a-kickoff-game-and-stay-at-sheraton-atlanta-perimeter-north", "country": "US", "title": "Attend Chick-fil-A Kickoff Game and Stay at Sheraton Atlanta Perimeter North", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Attend Chick-fil-A Kickoff Game and Stay at Sheraton Atlanta Perimeter North - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T11:50:00.000+03:00", "replies_count": 0, "uuid": "391908812429f375e5c67c1423c0fbf2e365b9c5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29871412/attend-chick-fil-a-kickoff-game-and-stay-at-sheraton-atlanta-perimeter-north", "ord_in_thread": 0, "title": "Attend Chick-fil-A Kickoff Game and Stay at Sheraton Atlanta Perimeter North", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sheraton Atlanta Perimeter North offers deluxe accommodations to fans attending the Chick-fil-A Kickoff Game in Atlanta on September 5, 2015.\n ATLANTA, GA, August 25, Fans attending the Chick-fil-A Kickoff Game in Atlanta on September 5 will find deluxe accommodations at the Sheraton Atlanta Perimeter North near Dunwoody, Georgia. Louisville will play Auburn in the Georgia Dome in downtown Atlanta. Kickoff time is 3:30pm. Before the game, fans can visit the FanZone at the Georgia World Congress Center. FanZone will feature food, giveaways, interactive games, and the official team pep rallies.\n\"We look forward to welcoming Louisville and Auburn fans for the Chick-fil-A Kickoff Game,\" comments Alex Morales, Director of Sales and Marketing at the Sheraton Atlanta Perimeter hotel . \"Our guests can easily ride a MARTA train to the Georgia Dome and avoid downtown traffic,\" explains Morales.\nThe Sheraton Atlanta Perimeter North received the 2015 TripAdvisor Certificate of Excellence Award. Contemporary guest rooms and suites feature Sheraton Sweet Sleeper Beds. Club level guests may visit the private Club Lounge for continental breakfast and evening hors d'oeuvres. Sheraton's full service restaurant, Parkside Grille and Lounge, is a convenient choice for breakfast, lunch, and dinner. Room service is available. Hotel amenities include a business center, fitness center, and outdoor pool and patio. As a guest convenience, this Atlanta Perimeter Center hotel provides complimentary weekday shuttle transportation within a 3-mile radius including Perimeter Mall and the Dunwoody MARTA Station. Downtown Atlanta and the airport are a short ride away on MARTA trains. Nearby points of interest include Chastain Park, Sandy Springs Tennis Center, and the Chattahoochee National Recreation Area.\nSheraton Atlanta Perimeter North is located near the junction of I-285 and GA 400. Guests can save 20% on a two night weekend stay when booking with a MasterCard. Starwood Preferred Guests will earn points toward free hotel nights.\nFor information about the Chick-fil-A Kickoff Game, visit www.chick-fil-akickoffgame.com . To book your stay at the Sheraton Atlanta Perimeter hotel North , call 404-564-3000 or visit online at www.ATLANTAPERIMETERHOTEL.com .\nAbout Sheraton Atlanta Perimeter North\nFrom the moment you enter this Perimeter hotel's warm and stylish lobby until you rest your head on The Sheraton Sweet Sleeper Bed, you'll feel at ease and at home. Enjoy breakfast in the Parkside Grille before heading out for the day's activities. The Georgia Aquarium, New World of Coca-Cola, CNN Center, and Six Flags Over Georgia are all a short distance away. This Perimeter hotel's complimentary courtesy shuttle will take you to the nearby Perimeter Mall featuring Nordstrom, Macy's, Von Maur, and Dillard's. Experience all that Atlanta has to offer while escaping the rush of the city at the new Sheraton Atlanta Perimeter North.\nFor more information visit: http://www.ATLANTAPERIMETERHOTEL.COM\nFor all media inquiries, please contact:\nAllison Reinert\nCardinal Web Solutions\nhttp://www.CardinalWebSolutions.com\n release/attend-chickfila-kickoff-game-and-stay-at-sheraton-atlanta-perimeter-north-411715.php", "external_links": ["http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/attend-chickfila-kickoff-game-and-stay-at-sheraton-atlanta-perimeter-north-411715.php"], "published": "2015-08-25T11:50:00.000+03:00", "crawled": "2015-08-25T11:49:12.089+03:00", "highlightTitle": ""}