{"organizations": [], "uuid": "7512bd8bcbd714120bc865625c8dfd6015dd73a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-55ccb9db/turbine/ct-pilot-drone-sightings-20150813", "site_section": "http://www.baltimoresun.com/travel/rss2.0.xml", "section_title": "Travel - Baltimore Sun", "url": "http://www.baltimoresun.com/travel/ct-pilot-drone-sightings-20150813-story.html", "country": "US", "title": "FAA: Pilot reports of drone sightings more than double", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "FAA: Pilot reports of drone sightings more than double", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T18:32:00.000+03:00", "replies_count": 0, "uuid": "7512bd8bcbd714120bc865625c8dfd6015dd73a1"}, "author": "Tribune wire reports", "url": "http://www.baltimoresun.com/travel/ct-pilot-drone-sightings-20150813-story.html", "ord_in_thread": 0, "title": "FAA: Pilot reports of drone sightings more than double", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 \nFlying a drone \"anywhere near\" an airplane can bring criminal charges and fines up to $25,000, according to the FAA. \nFirefighters battling wildfires in the West have been forced to ground their operations on several occasions after drones were spotted. \nSuspected drones interfered with aircraft fighting at least 13 wildfires so far this year, up from four fires last year and only scattered incidents before, according to the U.S. Forest Service. Last month, crews were grounded for 20 minutes as flames spread in a wildfire that closed Interstate 15 in Southern California and destroyed numerous vehicles after five drones were sighted. \nFirefighting agencies have introduced public service announcements to warn drone hobbyists, while lawmakers are seeking stiffer penalties for interfering. \nThe FAA said it is working closely with law enforcement to identify and investigate unauthorized drone operations. The agency has levied civil penalties for several unauthorized flights around the country, and has dozens of open enforcement cases. \n\"The FAA encourages the public to report unauthorized drone operations to local law enforcement and to help discourage this dangerous, illegal activity,\" the statement said. \nHobbyists are allowed to fly small drones, which are hardly different from model aircraft, for non-commercial purposes as long as they abide by a few rules, including keeping the aircraft within the line of sight of the operator at all times. \nThe FAA and the Academy of Model Aeronautics, an association for hobbyists, also have a publicity campaign to educate drone operators on the rules. \nThe FAA recently passed a milestone of 1,000 permits granted to businesses to fly drones for aerial photography, to monitor pipelines and electrical transmission towers, and to inspect smokestacks, crops and the undersides of bridges, among other uses. \nAssociated Press", "external_links": [], "published": "2015-08-13T18:32:00.000+03:00", "crawled": "2015-08-13T21:13:48.575+03:00", "highlightTitle": ""}