{"organizations": [], "uuid": "d20c738869566a6517758808caa6135e08d9f770", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/04/ahla-logo-1.gif", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/rep-paulsen-applauds-job-growth-in-hotel-industry-partnership-to-combat-human-trafficking/", "country": "US", "title": "Rep. Paulsen Applauds Job Groeth in Hotel Industry; Partnership To Combat Human TraffickingTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Rep. Paulsen Applauds Job Groeth in Hotel Industry; Partnership To Combat Human TraffickingTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "d20c738869566a6517758808caa6135e08d9f770"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/rep-paulsen-applauds-job-growth-in-hotel-industry-partnership-to-combat-human-trafficking/", "ord_in_thread": 0, "title": "Rep. Paulsen Applauds Job Groeth in Hotel Industry; Partnership To Combat Human TraffickingTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rep. Paulsen Applauds Job Growth in Hotel Industry; Partnership To Combat Human Trafficking Published\nCongressman Erik Paulsen (MN-03) praised the great impact the hotel industry has had in Minnesota today as he conducted a “Heart of the House” hotel tour of the Radisson Blu Mall of America, which is co-owned and operated by Minnesota-based Carlson Rezidor Hotel Group. The tour of the 500-room property focused on the thousands of jobs generated by the hotel industry in Minnesota, educational and workforce development opportunities that move employees up the career ladder, and the partnership to combat human trafficking in Minnesota and across the country.\nThe property tour was led by Carlson Rezidor Hotel Group Chief Operating Officer Javier Rosenberg and Radisson Blu Mall of America General Manager Harry Gorstayn. Minnesota’s hotels are an important segment of the state’s economy. With 6.1 percent of all jobs directly or indirectly related to the lodging industry, Minnesota generates $1.3 billion in tax revenue for state and local governments. Many of the properties are small business, a segment of the economy responsible for 49 percent of jobs in the state.\nThe “Heart of the House” hotel tour provided Congressman Paulsen and his staff the opportunity to walk through the property, meet with employees – including the Radisson Blu employee of the year for the Americas, Maria Stickney – and get a deeper understanding of the impact the hotel industry has on the local community and economy.\n“It is eye opening to see the significant benefits the hotel industry brings to our local communities,” said Congressman Paulsen. “Not only does the Radisson Blu Mall of America and Carlson Rezidor create good jobs for its employees, boost our economy and drive tourism, but they are also leaders on key policies that directly impact Minnesotans. For instance, their efforts combating human trafficking have been a tremendous help in finding and rescuing victims and helping law enforcement bring perpetrators to justice.”\nCarlson Rezidor Hotel Group representatives shared ways the company has committed to raising awareness about human trafficking, an issue which Congressman Paulsen has undertaken on a national level. Congressman Paulsen had the opportunity to help unveil the first-ever plaque for Carlson Rezidor to be displayed at front desks or lobbies identifying the company’s partnership with ECPAT-USA to promote human trafficking awareness and providing the National Human Trafficking Hotline and BEFREE short code to report suspected cases of human trafficking or for victims to reach out for services. The company was the first major North American hospitality company to partner with ECPAT-USA, the leading anti-trafficking policy organization in the U.S. As an industry, AH&LA recognizes that hotels can play an important role in fighting trafficking networks which often rely on legitimate businesses, like hotels, to sustain their illegal operations and infrastructure.\n“These signs will now be available to all of our U.S. hotels, including Radisson Blu, Radisson, Country Inns & Suites By Carlson, Park Inn by Radisson, and Park Plaza,” said Javier Rosenberg. “Our goal is to raise awareness about the issue of human trafficking; and to provide contact information for anyone who might suspect a case of human trafficking and for victims to reach out for life-saving services. Our hope is that the entire hospitality industry will follow our lead and join in this fight.”\nAH&LA and ECPAT-USA are working together through jointly created training programs for hotel employees who may come into contact with traffickers and their victims on hotel properties. Earlier this year, AH&LA released Hotel Industry Principles on human trafficking to provide hotel operators tools and resources to educate employees on identifying and reporting these crimes Congressman Paulsen also learned about the three-year pilot hospitality training program at Normandale Community college, funded by the Carlson Family Foundation. The program will introduce participants to the diverse range of careers available in the industry and to equip graduates with the critical industry-specific skills required by the region’s hospitality employers.\n“Congressman Paulsen understands how essential the hotel industry is to communities across Minnesota,” said General Manager Harry Gorstayn. “We applaud his dedication to combatting human trafficking in addition to ensuring that businesses like ours continue to succeed in order for us to continue to create jobs and boost the economy.”\nThe American Hotel & Lodging Association (AH&LA), the sole national association representing all segments of the 1.8 million-employee lodging industry, works with state associations to engage with members of Congress on the “Heart of the House” hotel tours, which provide an in-depth look at the career opportunities available as well as the economic impact the lodging industry has on the local, state and national economies.\nSource:- AHLA", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T11:21:35.213+03:00", "highlightTitle": ""}