{"organizations": [], "uuid": "ba16e545e8d14cb67c50a65e0d1c21d87889be91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03245/green-field_3245511k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-03.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/earth/greenpolitics/planning/11779456/The-Government-must-protect-our-Green-Belts.html", "country": "US", "title": "The Government must protect our Green Belts", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 6, "title_full": "The Government must protect our Green Belts - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T08:01:00.000+03:00", "replies_count": 5, "uuid": "96bf95a9582917667faa01201365a9deeafb5a26"}, "author": "Andrew Motion", "url": "http://www.telegraph.co.uk/news/earth/greenpolitics/planning/11779456/The-Government-must-protect-our-Green-Belts.html#post-0", "ord_in_thread": 0, "title": "The Government must protect our Green Belts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sixty years ago on Monday, Duncan Sandys’ Green Belt Circular marked the state’s first acknowledgement of the need to restrict the sprawl of urban areas, and the importance of ‘safeguarding the surrounding countryside against further encroachment’. Thanks to England’s 14 Green Belts – all drawn up within 14 years of the Circular - urban sprawl has largely given way to urban regeneration. Millions of people in our cities have been able to develop personal connections with nearby countryside. Our Green Belts are the envy of the world. From my new base in Baltimore, where I am teaching at Johns Hopkins, I can see at first-hand how difficult it is to reverse the social and environmental impact of sprawl. Although Maryland adopted a programme in 1997 to restrict sprawl, the overall trend of outward growth has remained the same. Without Green Belts, it is hard for the US to put the sprawl-genie back in its bottle. England could so easily have gone the same way. Some of England's green belts (Photo: TMG) We should feel forever indebted to the wisdom and foresight of the campaigners who forged a consensus against urban sprawl and behind the benefits for health and wellbeing that Green Belt brings. We must also be thankful for politicians brave enough to put principles before profit. David Cameron certainly seems to understand the importance of the Green Belt, insisting in March that \"the line remains scored in the sand – that land is precious\". And yet much Green Belt land continues to be allocated for development: a staggering 226,000 homes are set to be built on Green Belt sites over the next few years. How does this square with the promises of protection? The Prime Minister’s passion is being undermined by planning guidelines that, with their emphasis on meeting unrealistic housing numbers and supporting economic growth, have inadvertently declared \"open season\" on the Green Belt. The Government must make better use of its powers to direct local authorities to refuse applications Despite the rhetoric that the Green Belt is safe, local authorities find themselves squeezed between planning inspectors demanding that housing targets are met, and powerful developers pushing speculative developments. If councils stand up for Green Belts they face expensive planning appeals, or central Government intervention. Yet if councils then allocate Green Belt land for development, they face few reprisals because we’re told that Green Belt boundaries are a matter for local government. Whitehall is able to overrule localism to speed up economic growth, but less willing to intervene in the face of the destruction of our Green Belt. The Government must make better use of its powers to direct local authorities to refuse applications for Green Belt development, and intervene when authorities attempt to justify the relaxing of Green Belt boundaries as necessary for economic growth. Where confusion reigns today, these simple changes could bring certainty - both for local communities living with the constant threat to their green spaces, and for the developers who could deliver at least 1 million new homes in England on brownfield sites. With the Government introducing policies to develop these brownfield sites more quickly and easily, there has never been a better time for developers to overcome their obsession with the Green Belt. And a prescribed focus on \"brownfield first\" would allow us to rethink how we approach the small proportion of the Green Belt that is neglected, but which often includes the most strategically important parts of the urban fringe. The solution to enhancing Green Belts is not to pour concrete over them, but to plough public funding into them. Greening the Green Belt on the edge of cities would bring huge social, environmental and economic benefits, and allow people to tap into the natural capital on their doorsteps. By turning neglected sites into community parks, allotments or nature reserves, and creating new footpaths to improve access, we can further enhance the public’s strong support for Green Belt and secure its vital protection for the next 60 years and beyond. Sir Andrew Motion is the President of the Campaign to Protect Rural England @telegraphnews", "external_links": [], "published": "2015-08-03T08:01:00.000+03:00", "crawled": "2015-08-03T04:51:21.951+03:00", "highlightTitle": ""}