{"organizations": [], "uuid": "d49bc6c69eff8336351739f62b3a0998364e2c8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/03/bangkok-airways-logo.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/bangkok-airways-announces-operating-results-for-the-second-quarter-of-2015/", "country": "US", "title": "Bangkok Airways announces operating results for the second quarter of 2015Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Bangkok Airways announces operating results for the second quarter of 2015Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "d49bc6c69eff8336351739f62b3a0998364e2c8d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/bangkok-airways-announces-operating-results-for-the-second-quarter-of-2015/", "ord_in_thread": 0, "title": "Bangkok Airways announces operating results for the second quarter of 2015Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bangkok Airways announces operating results for the second quarter of 2015\nBangkok Airways Public Company Limited announced its operating results for the second quarter of 2015 which has amounted to a net profit of 102.2 million baht; up by 131.8 percent from the same period of the previous year.\nMr. Puttipong Prasarttong-Osoth, President of Bangkok Airways PCL commented that, “In the second quarter, total revenue of the company was 5,563.4 million baht, increased by 12.9 percent from the same period in the previous year. Net profit was reported at the amount of 102.2 million baht, mainly based on higher average fare and higher number of passengers. Available Seat Kilometers (ASK) ascended by 4.3 percent; our load factor was at 59.9 percent for this quarter. For the first six-month period, the company received total revenue of 12,297.3 million baht in which net profit was reported at 1,188.9 million baht.”\nMr. Puttipong continues, “The number of passengers of Bangkok Airways increased by 5.6 percent for the second quarter of 2015 in which our main market, Asia, particularly East Asia, has the highest growth. Despite the slow growth of Europeans traveling to Thailand, excluding the Russian, the company was able to maintain the sale growth from this market comparing to last year. The top 3 countries that the number of passenger has still been growing are Germany, United Kingdom and France.”\n“In addition to that, Bangkok Airways has increased flight frequencies on Samui-Singapore route to 10 flights per week, and Samui-Kuala Lumpur route to 11 flights per week starting from 29 March 2015. The additional frequencies adhere with our business strategy are to establish Samui airport as our second hub, followed by Suvarnnabhumi airport and to expand our route network in order to serve our codeshare partners from Australia and Southwest Pacific. During the second quarter, the company has entered into a codeshare agreement with Jet Airways which added our frequencies on Bangkok-Mumbai route from 1 flight to 3 flights per day. This certainly has provided more choices to the passengers as well as to increase the efficiency of our routes.” Mr. Puttipong added.\nRecently, BA stocks has been added to numerous indexes which are MSCI Global Small Cap Indexes (effective since 29 May 2015.), FTSE SET Mid Cap index (effective since 22 June 2015), SET50 and SET100 indexes for the second half of 2015 (1 July – 31 December.) This helps make BA more known amongst investors around the world.\nCurrently, Bangkok Airways has a total of 29 aircrafts; 10 of turbo-prop ATR72-500/600s, 19 of Airbus A319s/A320s. The company will take delivery of another 2 to 3 aircrafts by the end of 2015 to serve high travel demands in the up-coming high season.", "external_links": [], "published": "2015-08-17T03:00:00.000+03:00", "crawled": "2015-08-18T03:27:03.554+03:00", "highlightTitle": ""}