{"organizations": [], "uuid": "b61e23c15cc03832c8165f0fa399c6aa18c7ba22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03400/blackpool-pleasure_3400099k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-07.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/11784910/Blackpool-Pleasure-Beach-everything-you-need-to-know-about-visiting-this-summer.html", "country": "US", "title": "Blackpool Pleasure Beach: everything you need to know about visiting this summer", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Blackpool Pleasure Beach: everything you need to know about visiting this summer - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T20:12:00.000+03:00", "replies_count": 0, "uuid": "b61e23c15cc03832c8165f0fa399c6aa18c7ba22"}, "author": "Anthony Peregrine", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/11784910/Blackpool-Pleasure-Beach-everything-you-need-to-know-about-visiting-this-summer.html", "ord_in_thread": 0, "title": "Blackpool Pleasure Beach: everything you need to know about visiting this summer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Blackpool Pleasure Beach resembles Phil Spector’s Wall of Sound: roller coasters shooting off, screams, music and the fizzing of drinks – but it all coalesces into an intoxicating mix of unashamed joy. The park has been on Blackpool’s south shore since the 1890s and now has 125 rides and attractions, a dozen coasters (six of them wooden, topping anywhere else in Britain). What’s new The charge that PB is not renewing as fast as some rivals scarcely stands up. The world’s only Wallace & Gromit ride – Thrill-o-Matic – opened in 2013. And this year, £2 million and an agreement with the RAF has brought forth Red Arrows Skyforce – a rolling, barrelling, white-knuckle jaunt of great invention. • The ultimate guide to the UK's theme parks Thumbs up At 235ft, The Big One is still Britain’s tallest, fastest, steepest and longest roller coaster. It’s flanked by other coasters, new (Infusion tips you through 360-degrees, over water) and old (the Big Dipper, dipping since 1921). At Nickelodeon Land, full of high-coloured tot ‘n’ young teen rides, attractions recall Sponge Bob, Dora the Explorer and the Ninja Turtles. And around the park, there are more eating options than you can shake a fork at. As well as fast food, there’s a Champagne and coffee lounge (think Spanish or Italian sparkling wine), an oyster bar, a wok outlet and a Thai restaurant. Thumbs down Expensive car parking – up to £10 a day in peak season, with discount vouchers (they don’t cover rides). The main entrance and its approaches are looking tatty and need freshening up. The high‑season price of the All You Can Eat wristband which allows access to six on-park eateries for £20 (£15 for juniors). Unless you’re on a scoff-a-thon – granted, always a possibility in Blackpool – you might struggle to justify the cost. • 50 great days out in the UK Top tips At peak times, consider a Speedy Pass (costing £15, £25 or a hefty £45) to save headbanging queues on the popular rides. You tap into the Speedy Pass machine the name of the ride you want; it rings you back with a time. You show up then and get straight on. The more you pay, the shorter the wait. • Blackpool hotel fines guest for leaving bad TripAdvisor review Order an access-all-rides wristband at least 10 days in advance for the best rates. • The best family days out from Manchester Prices Ordered 10 days in advance, wristbands giving access to all rides cost £20 adult, £18 juniors in peak season. At the gate prices are £30/£27. You can also buy £6 park entry and pay for rides individually (£8 for the Big One). Opening times vary, mostly 10am-8pm in August (0871 222 1234; blackpoolpleasurebeach.com ). Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-08-07T20:12:00.000+03:00", "crawled": "2015-08-07T14:39:24.875+03:00", "highlightTitle": ""}