{"organizations": [], "uuid": "ce804e9e24e452c0da68f2d0ee32cf2dca05e3e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/02/DELTALOGO-300x51.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-routes-more-choice-across-the-atlantic-with-delta-and-virgin-atlantic/", "country": "US", "title": "New Routes, More Choice Across the Atlantic with Delta and Virgin AtlanticTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "New Routes, More Choice Across the Atlantic with Delta and Virgin AtlanticTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "ce804e9e24e452c0da68f2d0ee32cf2dca05e3e2"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-routes-more-choice-across-the-atlantic-with-delta-and-virgin-atlantic/", "ord_in_thread": 0, "title": "New Routes, More Choice Across the Atlantic with Delta and Virgin AtlanticTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Routes, More Choice Across the Atlantic with Delta and Virgin Atlantic\nDelta Air Lines and Virgin Atlantic Airways will offer customers two new routes across the pond with the introduction of Delta’s nonstop service from Salt Lake City to London Heathrow and New York-JFK to Edinburgh, Scotland, beginning in May 2016.\nThe routes add to the value that the Delta-Virgin Atlantic joint venture provides customers through an aligned route network offering more frequencies, competitive fares and harmonized service. The Department of Transportation’s 2013 grant of anti-trust immunity to the Delta-Virginjoint venture makes this new service possible.\n“For the second summer in a row, Delta will be launching new routes that give customers more options when flying between the United Statesand the U.K.,” said Nat Pieper, Delta’s Senior Vice President – Europe, Middle East and Africa. “Delta and Virgin Atlantic are committed to offering an extensive network on the trans-Atlantic, and our new flights from London and Edinburgh will offer more connections to destinations throughout the U.S. and beyond.”\nDelta’s seasonal Salt Lake City to London Heathrow flights will operate as follows:\nFlight Departs Arrives DL50 / VS4020 Salt Lake City at 8:10 p.m. Heathrow at 1:10 p.m. (+1 day) DL51 / VS4019 Heathrow at 2:15 p.m. Salt Lake City at 6:07 p.m.\nDelta’s New York-JFK to Edinburgh flights will operate as follows:\nFlight Departs Arrives DL488 / VS4026 New York-JFK at 8:15 p.m. Edinburgh at 8:40 a.m. (+1 day) DL489 / VS4027 Edinburgh at 10:30 a.m. New York-JFK at 1:01 p.m.\nStarting May 1, 2016 , Salt Lake City will be Delta’s eighth U.S. destination from Heathrow and the only nonstop service between London and the Mountain West. As the largest airline operating in Salt Lake City, Delta offers connections to more than 50 destinations throughout the Western U.S. and into Canada.\nDaily nonstop service between New York-JFK and Edinburgh will begin on May 26, 2016 , offering customers in the U.K. up to 60 convenient onward connections from JFK. Delta’s new service from Scotland’s capital city joins Virgin Atlantic’s three times weekly summer seasonal service from Glasgow to Orlando.\nPassengers travelling in the Delta One cabin on both the Salt Lake City to Heathrow and New York-JFK to Edinburgh flights will enjoy full flat-bed seats and a range of personalized dining options. Additionally, all passengers will have access to on-demand in-flight entertainment and Wi-Fi connectivity throughout the aircraft.\nLaunched on January 1, 2014, the Delta and Virgin Atlantic partnership creates an expanded trans-Atlantic route network, enhancing competition between the UK and North America. The joint venture offers customers connecting in the United States seamless access to more than 200 destinations across almost 600 routes, as well as frequent flyer reciprocity and global lounge access.", "external_links": [], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T20:24:20.577+03:00", "highlightTitle": ""}