{"organizations": [], "uuid": "0c2a176081df77f67cbd5eb3787c75f6fc22848e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/talent_assessment_launch_2015.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/america-travel-news/", "section_title": "AMERICA TRAVEL NEWS - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/al-hassan-group-launches-new-talent-assessment-system/", "country": "US", "title": "Al Hassan Group launches new Talent Assessment SystemTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Al Hassan Group launches new Talent Assessment SystemTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "0c2a176081df77f67cbd5eb3787c75f6fc22848e"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/al-hassan-group-launches-new-talent-assessment-system/", "ord_in_thread": 0, "title": "Al Hassan Group launches new Talent Assessment SystemTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Al Hassan Group launches new Talent Assessment System Published on : Tuesday, August 25, 2015\nAs a step towards integrating competencies with the talent management function and to create a more robust function, the Al Hassan Group recently launched the Talent Assessment System. The online assessment system will strengthen the organization’s HR function further. To mark the event and to formally introduce the Assessment system, a ceremony was organized in Muscat recently.\nThe event started with an Introduction of the Al Hassan Talent Assessment System by Mr. Shahzad, General Manager – Organizational Development. He explained the concept and benefits of the system, and how it can help the organization build a merit based and performance driven culture. Mr. Hassan Ali Salman, Chairman, Al Hassan Group inaugurated the Online System by logging into the portal. During his address, he stressed on the importance of best talent management practices to attract and retain talent. The inauguration was followed by a demonstration of the Online Assessment System by Mr. Abdullah Nasser Al Mahdouri, Administrator of the Talent Assessment System.\nIn the recent past the Organizational Development (OD) division of Al Hassan facilitated the mapping of organizational competencies and conducted competency assessment programs for the management team. The objective of the system is to identify competencies specific to Al Hassan Group’s business needs and subsequently apply them to various talent management functions such as Selection, Talent Development, Career and Succession Planning, Promotions and Training.\nWhat makes Al Hassan Talent Assessment System an effective tool is that it is based on Al Hassan specific competencies and it is customized to the organization’s business requirements. Additionally, it offers different kinds of assessment for different levels of the organization and for each company within the Group. We believe that this enhanced system will further enable the Group to acquire, develop and retain talent.\nSource:- Al Hassan Group", "external_links": [], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T11:56:36.468+03:00", "highlightTitle": ""}