{"organizations": [], "uuid": "9adf9d9cd7e0065e98032c34b33915bb5fbee585", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/download-38.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/novotel-barossa-valley-resort-unveils-upgraded-studio-apartments-and-suites/", "country": "US", "title": "Novotel Barossa Valley Resort unveils upgraded studio apartments and suitesTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Novotel Barossa Valley Resort unveils upgraded studio apartments and suitesTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "9adf9d9cd7e0065e98032c34b33915bb5fbee585"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/novotel-barossa-valley-resort-unveils-upgraded-studio-apartments-and-suites/", "ord_in_thread": 0, "title": "Novotel Barossa Valley Resort unveils upgraded studio apartments and suitesTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Novotel Barossa Valley Resort unveils upgraded studio apartments and suites\nNovotel Barossa Valley Resort, the only internationally‐branded 4‐star hotel in South Australia’s Barossa Valley, has unveiled 24 newly refurbished Studio Apartments and 10 Spa Suites in response to the demand for premium quality accommodation in the heart of world‐famous winery region.\nThe Studio Apartments all feature new bathrooms with large walk‐in rain showers, kitchens and laundry facilities complete with trendy, state‐of the‐art appliances, providing long‐stay guests with the convenience and comforts of apartment‐style living. Private outdoor balconies have new furniture for day lounging or enjoying a bottle of wine\noverlooking the rolling landscape.\nFor a luxurious stay with private balcony vineyard views over Jacobs Creek, the 10 Spa Suites have, sleek new bathrooms with spacious spa baths, separate walk‐in shower and eco‐friendly amenities. The Spa Suites feature King‐size beds with feather topper, crisp linen and white fluffy robes and slippers for relaxing in. The Spa Suites also come with complimentary water, newspapers, in‐house movies, wifi internet access as well as a Nespresso coffee machine and a selection of Dilmah teas.\nThe makeover of the Studio Apartments and Spa Suites complement the Resort’s impressive conference centre upgrade in February 2015 as well as the resorts other 106 spacious accommodation rooms which also had a soft refurbishment in 2014.\nGeneral Manager Novotel Barossa Valley Resort, Sarah Henderson, said “As a first‐class food and wine destination,visitors to the Barossa Valley expect a high level of accommodation and service when they get here, which is why we’ve continue to invest in the hotel to meet these expectations. It was important for us to uplift the spas and\napartments as they are our most popular room types and within three short months we’ve added a fresh level of comfort and indulgence for travellers.\nPopular with families, honeymooners, couples and conference goers, Novotel Barossa Valley Resort is situated in the natural amphitheatre of South Australian wine country and boasts panoramic views of its world‐famous neighbour, the Jacobs Creek vineyards.\nSource:-Novotel Barossa Valley Resort", "external_links": [], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-13T11:14:01.638+03:00", "highlightTitle": ""}