{"organizations": [], "uuid": "24ab067aeb5722ec8012c2002193ab373aa6ddef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/inghams-lapland-programme-banks-on-snow-adventures-beyond-skiing/4698072.article", "country": "GB", "title": "Inghams’ Lapland programme banks on ‘snow adventures’ beyond skiing", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Inghams’ Lapland programme banks on ‘snow adventures’ beyond skiing", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T13:05:00.000+03:00", "replies_count": 0, "uuid": "24ab067aeb5722ec8012c2002193ab373aa6ddef"}, "author": "", "url": "http://www.ttgdigital.com/news/inghams-lapland-programme-banks-on-snow-adventures-beyond-skiing/4698072.article", "ord_in_thread": 0, "title": "Inghams’ Lapland programme banks on ‘snow adventures’ beyond skiing", "locations": ["Lapland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Edward Robertson"], "text": "Inghams’ Lapland programme banks on ‘snow adventures’ beyond skiing 5 August 2015 | By Edward Robertson Save \n﻿Inghams is releasing its first programme dedicated to Lapland winter product for non-skiers. \nAndy Perrin, the chief executive of Hotelplan, which owns Inghams, said the operator first featured the destination in 1997 for its ski opportunities. \nHowever, having seen its popularity grow with the non-skiing market, the decision has been made to release the first brochure dedicated to the destination and the other attractions it offers, as well as northern Norway. \nPerrin added that he was confident the chance to book trips which include huskie sledging, cross-country skiing and the chance to view the Northern Lights during an overnight stay in a private glass igloo will prove popular. \nPerrin said: “We introduced Lapland as a ski destination purely and simply and we’ve been doing it as ski ever since. \n“Over that time the resorts have developed quite a bit and the ski areas have developed quite a bit. \n“We’ve always done the other stuff but tended to do it as excursions on top of a ski holiday. Lapland has got so much to offer.” \nHe added that the brochure, which goes on sale this week, also focuses far more on the 80-plus properties available, which is all part of the experience of staying in the destination. \n“This is for different people,” Perrin said. “We focus on the log cabins, it is part and parcel of the Lapland experience. You rest your [cross-country] skis against the wall when you come in, and in the morning step outside and get straight out there.” \nHe added the programme would be served by flights from Manchester, Bristol and Gatwick airports, with all three commencing in early December. \nManchester and Gatwick will run through until Easter, while the new route out of Bristol will finish at the end of February. \nThe programme also includes a section on holidays in northern Norway complete with direct flights from Gatwick into Evenes with up to six departures in March next year. \nPrices lead in at £549pp departing in December and includes flights, transfers and seven nights’ self-catering at the Immelmokit Cabins.", "external_links": [], "published": "2015-08-05T13:05:00.000+03:00", "crawled": "2015-08-05T12:47:12.788+03:00", "highlightTitle": ""}