{"organizations": [], "uuid": "711f8a9b781c298735cc1eef041326c8e19f3af7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/3688471/09-12-train*1200xx3888-2187-0-203.jpg", "site_section": "http://austin.bizjournals.com/rss/feed/vertical_subtopic/64", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/pittsburgh/print-edition/2015/08/21/wolf-hails-study-to-curb-derailments.html", "country": "US", "title": "Wolf hails study to curb derailments", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "Wolf hails study to curb derailments", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T13:00:00.000+03:00", "replies_count": 0, "uuid": "711f8a9b781c298735cc1eef041326c8e19f3af7"}, "author": "Paul J. Gough", "url": "http://www.bizjournals.com/pittsburgh/print-edition/2015/08/21/wolf-hails-study-to-curb-derailments.html", "ord_in_thread": 0, "title": "Wolf hails study to curb derailments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Already a subscriber? Sign In Here A new report commissioned by Gov. Tom Wolf is calling on state and railroad officials to act on 27 separate recommendations to improve safety for trains carrying Bakken crude oil from North Dakota through Pennsylvania. “Assessment of Crude by Rail Safety Issues in Commonwealth of Pennsylvania,” by Allan Zarembski , a professor of railroad engineering and safety at the University of Delaware , was released Aug. 17 by the Wolf administration. It recommends, among other things, a reduction in speed limits for trains running through highly populated areas of Pennsylvania, including Pittsburgh; adding more inspections; and investing in positive train control systems on freight trains. There were 14 mainline derailments by freight trains in Pennsylvania between 2012 and 2014, causing more than $100,000 in damage, according to the report. Five were caused by human factors, four by track issues and three were related to equipment. “The idea is to develop and improve inspection and/or operating practices that will reduce the risks of this type of undesired event,” Zarembski said in a conference call with reporters. There have been no major accidents with loss of life in Pennsylvania on the scale of the July 6, 2013, railroad disaster in the town of Lac-Megantic, Quebec, that killed 47 people. But officials said they wanted to make sure Pennsylvania is safe. “I have expressed grave concern regarding the transportation of this oil and have taken several steps to prevent potential oil train derailments,” Wolf said in a statement. “Protecting Pennsylvanians is my top priority, and Dr. Zarembski’s report is important in helping my administration take the necessary steps.” They include lowering the speed limit to 35 mph for crude oil trains that run through cities with more than 100,000 people. The railroad industry already has agreed to a 50-mph voluntary speed limit for trains that have more than 20 loads of hazardous material and a 40-mph speed limit for those carrying crude oil. Department of Planning and Policy Secretary John Hanger said responses from CSX Corp. and Norfolk Southern Corp. , the two railroad companies that are shipping crude oil through Pennsylvania, have been disappointing. “We will continue to communicate with both railroads, and we will communicate with the federal government (about the speed limit),” Hanger said. But other responses from CSX and Norfolk Southern were praised by state officials, including Wolf. He said he would continue to work with railroads to enact the recommendations, adding that they both have “demonstrated concern for rail safety and an interest in working with my administration.” “CSX appreciates Gov. Wolf’s continued attention on these important issues, and we look forward to reviewing this study in detail. In the past two years, CSX has made significant investments in the routes we use to transport crude oil, we have advocated for stronger tank-car designs and we have increased the amount of information and training that we provide to the first responders who will protect the public in the event of a rail incident,” said CSX spokesman Rob Doolittle. A Norfolk Southern spokesman said safety was its priority, and it’s spent $2.4 billion in improvements in 2015 alone. It was working to increase safety standards for tank cars, upping inspection of tracks on crude-oil routes and reducing speed limits for trains carrying flammable liquids. Zarembski’s report also recommends including more inspections of rail and bridges plus working with Norfolk Southern and CSX to adopt positive train control technology, which would add more safety margins to help prevent derailments. But such technology won’t prevent all accidents, and Zarembeski said adding it would “be a very large cost to the railroads,” which he said has been estimated at $10 billion nationwide. Recommendations Here are some of the recommendations in a new report on crude-by-rail safety in Pennsylvania: Test the rails on the routes at least three times a year Run a Track Geometry Car, a track inspection vehicle owned by the railroads, at least four times a year on the routes used by crude-by-rail trains Adopt a voluntary speed limit of 35 mph while the trains are going through highly populated areas like Pittsburgh and Philadelphia Monitor for hot bearings on the train cars no more than 25 miles apart throughout the entire route CSX and Norfolk Southern should finish initial route analysis to potentially reroute trains away from populated areas Direct Pennsylvania Public Utility Commission inspectors to focus on checks of the track, equipment, hazardous material and operation of routes used by crude-by-rail trucks Make sure that every community along the routes has emergency plans Coordinate emergency response exercises along the routes “Assessment of Crude By Rail Safety Issues in Commonwealth of Pennsylvania” \nGet Pittsburgh Newsletters and Alerts Morning Edition >> Afternoon Edition >> Breaking News \nThank you for signing up To serve you better, please select your industry and job title Industry", "external_links": [], "published": "2015-08-21T13:00:00.000+03:00", "crawled": "2015-08-21T15:46:20.466+03:00", "highlightTitle": ""}