{"organizations": [], "uuid": "58f992ce7ddd8dce48d63c269ae5b57cf64b0526", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62514/south-pacific-islands-roadshow-new-zealand", "country": "US", "title": "South Pacific Islands on roadshow in New Zealand", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "South Pacific Islands on roadshow in New Zealand", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T07:37:00.000+03:00", "replies_count": 0, "uuid": "58f992ce7ddd8dce48d63c269ae5b57cf64b0526"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/62514/south-pacific-islands-roadshow-new-zealand", "ord_in_thread": 0, "title": "South Pacific Islands on roadshow in New Zealand", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Pacific Islands on roadshow in New Zealand   \nAug 12, 2015 Banners   \nThe National Tourism Offices (NTOs) of eight Pacific Island states (PICs) are working to increase their presence in the New Zealand market which continues to show growth in visitor arrivals to the region. \nThe South Pacific Tourism Organisation (SPTO) will team up with the South Pacific Association of National Tourism Offices (SPANTO) on a regional roadshow in Napier,New Zealand at the end of August. \nSPANTO which is based in New Zealand includes the National Tourism Offices (NTO) of the Cook Islands, Fiji, French Polynesia, Samoa, New Caledonia, Niue, Tonga and Vanuatu. \nThe roadshow kicked off in Nelson in July and will move to Napier, Tauranga and Rotorua and Auckland from August through to October where they will meet wholesale and retail South Pacific partners. \nSPTO Chief Executive Ilisoni Vuidreketi stated New Zealand continues to be a strong source market for tourists to the Pacific region and the road show will explore avenues to lure more tourists to our shores. “We are pleased to be able to work with our NTO’s and support their association as they continue to seek innovative ways to market tourism in the Pacific region”, he added. “It is also encouraging to see that NTOs are driving this initiative independent of the private sector which shows the strong support of governments in the marketing and promotion of Pacific destinations”. “SPTO has found that our past roadshows have been very effective in engaging the travel industry in New Zealand and we are pleased to be able to join the roadshow on the Napier leg. We are confident of good results”, he stated.", "external_links": [], "published": "2015-08-12T07:37:00.000+03:00", "crawled": "2015-08-12T12:38:53.881+03:00", "highlightTitle": ""}