{"organizations": [], "uuid": "92e711abb4d28366075e1c854949a1ab69dd1824", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/travel/regional/20150801-tra_horses_45141939.ece/BINARY/original/TRA_HORSES_45141939", "site_section": "http://www.dallasnews.com/lifestyles/travel/", "section_title": "Dallas-Fort Worth Travel News and Destinations - News for Dallas, Texas ", "url": "http://www.dallasnews.com/lifestyles/travel/regional/20150801-texas-neighbors-midsummer-offerings-include-ranch-getaway-and-music-fest.ece", "country": "US", "title": "Texas & Neighbors: Midsummer offerings include ranch getaway and music fest", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Texas & Neighbors: Midsummer offerings include ranch getaway and music fest | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T17:10:00.000+03:00", "replies_count": 0, "uuid": "92e711abb4d28366075e1c854949a1ab69dd1824"}, "author": "dallasnews", "url": "http://www.dallasnews.com/lifestyles/travel/regional/20150801-texas-neighbors-midsummer-offerings-include-ranch-getaway-and-music-fest.ece", "ord_in_thread": 0, "title": "Texas & Neighbors: Midsummer offerings include ranch getaway and music fest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OKLAHOMA CITY Storytelling festival draws literary lovers The Oklahoma City Storytelling Festival will feature performances by some of the nation’s best tale tellers.\nFor more than 30 years, Arts Council Oklahoma City has produced this event that celebrates the art of storytelling. It’s Aug. 27-20 and features nationally acclaimed presenters, workshops and special performances.\nThis year’s lineup includes Charlotte Blake-Alston, who shares traditional and contemporary stories from African and African-American oral and cultural traditions. Also featured are Emmy-winning storyteller Jim Mays and Megan Wells, the artistic director of the Ray Bradbury Storytelling Festival in Waukegan, Ill.\nContact: Oklahoma History Center, 800 Nazih Zuhdi Drive. artscouncilokc.com/storytelling . 405-270-4848\nKERRVILLE Celebrate live music Labor Day weekend in the Hill Country Music lovers should plan a visit to the Kerrville Fall Music Festival (formerly the Wine & Music Festival) over Labor Day weekend. The event, which has been held annually since 1972, features multiple concerts by two dozen singer-songwriters in the Texas Hill Country’s Quiet Valley Ranch.\nVisitors are encouraged to camp nearby and take advantage of the weekend’s events, which include crafts booths, a 26-mile bike ride, pancake breakfast and teen music-camp concert. A beer and wine seminar on Saturday celebrates the state’s wines and craft beers.\nFood and drink booths, which are in the Kennedy Outdoor Theater, will open at 6 p.m. Sept. 4-6, with main-stage music starting at 7 p.m.\nContact: kerrville-music.com\nSANTA FE\nAmerican Indian exhibits include weavings, bridles Shiprock Santa Fe Gallery, which features historic and contemporary American Indian art, will celebrate its 10th anniversary with multiple events and two new exhibits this summer. “Navajo Bridles: The Foutz Collection of Headstalls” includes three pieces originally from the William Randolph Hearst Collection. “Sand Painting Weavings: Masterworks of the Legendary Weavers” is an exhibit of Navajo pieces from the Bolton estate. A free reception for the collections is 5-7 p.m. Aug. 15. The exhibits continue through Sept. 30. Hours are 10 a.m.-5 p.m. Monday-Friday, noon-5 p.m Saturday.\nOther events include:\nA free reception for Lakota artist Dyani White Hawk and Hopi fine jeweler Verma “Sonwai” Nequatewa from 2 to 4 p.m. Aug. 20.\nLectures on Aug. 21 include White Hawk, who will discuss her paintings and her multicultural background at 11 a.m. Yasutomo Kodera of Skystone Trading in Japan, will identify and discuss turquoise at 1 p.m. Make reservations for the lectures at jamie@shiprocksantafe.com.\nContact: shiprocksantafe.com ; 505-982-8478\nWASHINGTON County, TEXAS\nResort puts a luxurious spin on ranch life The Inn at Dos Brisas is offering summer packages to entice those eager to enjoy the scenic landscape of Washington County, which is between Houston and Austin.\nThe 313-acre resort blends popular amenities and world-class culinary experiences with rustic charm. Offerings include carriage and trail rides, horseback-riding lessons, fishing, cooking classes, wine tastings and massages. Dos Brisas has Texas’ only Forbes five-star restaurant, with a 7,000-bottle wine cellar and a menu that features produce from the property’s organic gardens and greenhouse.\nHere are three current packages. All deals are limited, check with the resort for more information.\nBed and breakfast: This deal is perfect for those wanting a quick escape. Enjoy a night at the resort with full breakfast for two the next morning. Valid for stays through Sept. 30. Rates start at $389, based on double occupancy.\nDinner and a pillow: This special includes a dinner from executive chef Cory Untch, who will prepare a gourmet meal with ingredients from the daily harvest on Dos Brisas’ 42 acres of USDA-certified farms. Valid for Sunday-Thursday stays through Sept. 30. Rates start at $649, based on double occupancy.\nTuesdays are free: Receive a Tuesday night free when your stay is three nights. Rates start at $799, based on double occupancy. Valid for arrival on Sunday, Monday or Tuesday until Sept. 24.\nContact: dosbrisas.com ; 979-277-7750", "external_links": ["http://artscouncilokc.com/storytelling"], "published": "2015-08-01T17:10:00.000+03:00", "crawled": "2015-08-16T01:32:46.768+03:00", "highlightTitle": ""}