{"organizations": [], "uuid": "b6a471e969e1cae2f8aa43f05a93fcf196c04a7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.airwise.com", "main_image": "", "site_section": "http://www.airwise.com/", "section_title": "Airwise - The Airport and Air Travel Guide", "url": "http://news.airwise.com/story/skymark-creditors-pick-ana-to-lead-turnaround", "country": "AU", "title": "Skymark Creditors Pick ANA To Lead Turnaround", "performance_score": 0, "site": "airwise.com", "participants_count": 1, "title_full": "Skymark Creditors Pick ANA To Lead Turnaround | Airwise News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "b6a471e969e1cae2f8aa43f05a93fcf196c04a7e"}, "author": "Reuters", "url": "http://news.airwise.com/story/skymark-creditors-pick-ana-to-lead-turnaround", "ord_in_thread": 0, "title": "Skymark Creditors Pick ANA To Lead Turnaround", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ANA has won creditor backing to lead a turnaround of bankrupt Japanese discount carrier Skymark Airlines, defeating a plan that proposed Delta Air Lines as its sponsor. The victory gives ANA access to Skymark's 36 slots at Tokyo's Haneda airport, helping it cement its domestic dominance over Japan Airlines.\nMore than 170 creditors voted on the proposals in two rounds - the first weighted by amount owed, while the second gave each creditor an equal vote. ANA, which has offered to buy 16.5 percent of Skymark, won 60.5 percent of the first round and more than three quarters of the second.\n\"Delta is a mega carrier and therefore a daunting opponent, but it had a number of hurdles to overcome,\" Toyuki Nagamine, a director at ANA said at a press briefing with representatives from Skymark and its financial backer private equity firm, Integral, which supported ANA.\nFor Delta, the decision is a lost opportunity to gain a bigger presence in Japan where it does not have an alliance partner.\nBarring any upheld objections from creditors, Integral's ANA-sponsored revival plan will be implemented after 30 days.\n\"While this is not the result we had hoped for, as Skymark's single largest creditor, Intrepid will continue to focus on working constructively with key stakeholders,\" Franklin Pray, chief executive of Intrepid Aviation said in a statement.\nIntrepid had proposed Delta as a sponsor after it fell out with ANA over a failed deal to lease planes to the airline.\nSkymark's failure came after its finances were stretched by plans to fly Airbus A380s on overseas routes. Airbus demanded a USD$710 million cancellation fee after the airline was unable to keep up with payments.\nAirbus, Skymark's second-biggest creditor, sided with ANA.\n(Reuters)", "external_links": [], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-06T00:24:13.919+03:00", "highlightTitle": ""}