{"organizations": [], "uuid": "2abe2cdf3ec37f18ca7a08990d403618de572c3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/exploring-the-royal-mews-of-london.html", "country": "US", "title": "Exploring the Royal Mews of London", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Exploring the Royal Mews of London", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T09:43:00.000+03:00", "replies_count": 0, "uuid": "2abe2cdf3ec37f18ca7a08990d403618de572c3e"}, "author": "Lisa Jeeves-2015-08-18T07:43:42-0400", "url": "http://www.articlesfactory.com/articles/travel/exploring-the-royal-mews-of-london.html", "ord_in_thread": 0, "title": "Exploring the Royal Mews of London", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  18, 2015 \nEasily walkable from any of the great Kensington hotels, the Royal Mews in Belgravia make for a very interesting excursion. \nIf you're visiting London and searching for an interesting excursion, the historic Royal Mews are a fairly manageable stroll from most of the excellent Kensington hotels.It’s worth making the effort to visit, as the Mews offer a genuine insight into royal practices and also the Queen’s enduring passion for horses. \nWhat are the Royal Mews? \nIt’s probably stating the obvious to point out that monarchy in the UK has always been associated directly or indirectly with horses. Even the aetheling (the heir to the Anglo-Saxon throne of England) Aethelstan’s will of 1014 left a string of horses to his inheritors. In fact, so important was the horse to English and royal life, that Henry VIII passed several laws aimed at trying to improve the quality of horses through what was, in effect, selective breeding. \nThat association has continued to the present day and today’s Queen is perhaps closer than most of her predecessors to that equestrian history. When you see those magnificent horses whose job it is to pull the state coaches on big public occasions, you might wonder just where they come from. The answer to that is The Royal Mews. \nHorses and coachesThe Royal Mews is a magnificent set of buildings used by the Kings and Queens of Britain since 1760 as the home for their coaches and horses and, to this day, it still serves that purpose. The Mews are a relatively modest walk from most Kensington hotels and inside there is an array of things to see. These include the Golden State Coach, which has been used for coronations since 1821, and the almost brand-new Diamond Jubilee State Coach, only the second state coach to be built in over a century.You are also privileged to be able to see some of the horses (the numbers will vary at any given time) and the tack that pulls these amazing coaches. It's an interesting fact that every single horse is personally named by Her Majesty the Queen. \nAs an institution, the Royal Mews goes back to King Richard II in the 14th century, and originally stood where today’s National Gallery is. To begin with, the location was where the royal hawks were kept, which explains the name - the ancient word for the birds’ moult was 'Mew'. But by the Tudor period the original buildings had been destroyed by fire and were replaced by ones intended for horses. \nAs the Georgian monarchs purchased and began to live more regularly in what would become known as Buckingham Palace, new and more convenient stables were required. So, today’s Royal Mews were re-born in their current location. \nWhat you can see \nIf you like horses, carriages and tack, then you’ll love a visit to this institution. That’ll also hold true if you simply love the high pomp and ceremony associated with ‘The State’.It’s not all just about static displays though; there are also displays of skills, guided tours and special sessions where you’ll be able to handle some of the day-to-day items used to make the Royal Mews a working stables rather than a museum. The staff at any if the good Kensington hotels will be able to offer help and advice on what days these special events are being held. \nGetting there \nIf you're not staying within walking distance, the nearest Tube stations to the Mews are Hyde Park Corner and St James’ Park. Numerous bus services also pass close-by.Victoria mainline station/Underground isn’t that far either. On foot, it’s roughly 2.5 miles so say about a gentle 45-50 minute stroll on flat easy-walking land from any of the Kensington hotels, and your concierge will typically be only too happy to advise you on the best route. \nVisit the Royal Mews and get an insight into the workings of this fascinating aspect of royal life. Source: Free Articles from ArticlesFactory.com ABOUT THE AUTHOR \nMatthew Zelinski works for the London Regency Hotel, one of the top Kensington hotels . This wonderful hotel embodies the true flavour of Kensington, with its traditional regency-style façade and superb facilities. Whether you're looking for accommodation in London for business or leisure, the Regency offers an effortlessly elegant experience.", "external_links": [], "published": "2015-08-18T09:43:00.000+03:00", "crawled": "2015-08-18T15:40:18.034+03:00", "highlightTitle": ""}