{"organizations": [], "uuid": "5efde390541eff1e89a039faba2d865e9ee4ba42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03399/Melbourne-Food-win_3399980a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-07.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/australian-food-wine/11776239/food-festivals-australia.html", "country": "US", "title": "Food festivals for all in Australia", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Food festivals for all in Australia - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T20:57:00.000+03:00", "replies_count": 0, "uuid": "5efde390541eff1e89a039faba2d865e9ee4ba42"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/australian-food-wine/11776239/food-festivals-australia.html", "ord_in_thread": 0, "title": "Food festivals for all in Australia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia’s abundant produce , its rich variety of seafood, livestock and vegetables, an eclectic culinary tradition and continued strong interest in home cuisine makes it the perfect host for food festivals, with some strong contenders the length and breadth of the country. Good Food Month Sydney New South Wales – October Every October is Good Food Month in Sydney, four weeks of the year when food and wine top the city’s events calendar with local establishments and producers putting on a show to present the very best the region has to offer. Last year, Sydney Good Food Month had more than 450 individual event listings and more than a million attendees. One of the highlights is the Night Noodle Market, which sees the city’s Hyde Park host a giant Asian-style hawker market. Another popular event is Breakfast on Bondi, where thousands of festival-goers watch the sunrise on the famous beach while eating a hearty breakfast and listening to an orchestra. Further Good Food Months are held across most of the country’s major cities. • goodfoodmonth.com » Orange Food Festival New South Wales –April Situated about 150 miles west of Sydney, the city of Orange and its surrounding shires are known as the “food basket of New South Wales”. It underlines its status with an annual festival (the title is an acronym of Food Of Orange District) held between April 8-17. Over 10 days local producers, chefs and restaurants get the opportunity to show why the region has such a strong reputation for fine food and wine. • orangefoodweek.com.au » High Country Harvest Victoria – May There’s no better time to be in Victoria’s abundant High Country than during harvest, when the days are warm and the nights are crisp. In May each year, wineries, eateries and farmers’ markets put together special events that tempt foodies to indulge in the freshest of local produce. Expect themed degustations, brewers’ breakfasts and guided food tastings of locally foraged fare across the region, while those keen to enjoy a hands-on experience can try bread-making, cheese-making classes and even beekeeping. As well as grown-up tastings, there are also plenty of family-friendly activities such as farm visits on offer. • highcountryharvest.com.au » Margaret River Gourmet Escape Western Australia – October Although a relative newcomer, this is now one of Australia’s best-known food fests. Margaret River Gourmet Escape is a four-day celebration of great food held in this fabulous coastal town on the tip of Western Australia between November 20-22. Its great reputation sees it attract both top home-grown talent and major international names. This year is no exception, with the likes of Rick Stein, Sat Bains, Tetsuya Wakuda and Richard Turner on the bill. The evening beach barbecues are the must-do events, with fine cuisine served up on the sands at Castle Bay. • gourmetescape.com.au » Indulgent: take part in classes and tastings at Melbourne's popular food festival Melbourne Food & Wine Festival Victoria – February/March Melbourne vies with Sydney to be Australia’s undisputed foodie champion. Its popular annual food and wine festival has been running for more than 20 years and takes place from end-February to mid-March. This year, a quarter-of-a-million visitors filled the city’s laneways, farms and wineries to savour the best local fare. The busy programme includes all the usual demos and tastings, plus classes and lectures. One regular highlight is the World’s Longest Lunch, seating 1,500 hungry revellers. • melbournefoodandwine.com.au » Tasting Australia South Australia – May The city of Adelaide’s biennial food festival celebrates 18 years by turning into an annual event from next year onwards. The week-long festival, held at the beginning of May, includes cooking classes and demonstrations with guest chefs and cooks, tastings, picnics, bloggers conferences and a gala dinner. Each year features a new theme with events running across the city, all showcasing the gastronomic delights of South Australia. • tastingaustralia.com.au » The Taste of Tasmania Tasmania – December/January Tasmania is a small island, but it punches well above its weight when it comes to food and wine. The island’s annual food festival begins on Hobart’s waterfront just after Christmas and spans the New Year, with thousands assembling to gorge on everything and anything – even slow-cooked wallaby burritos and Bruny Island possum. All the eating and drinking is augmented by bands and performers. • thetasteoftasmania.com.au » Kangaroo Island Feastival South Australia – May Situated just off the mainland from Adelaide, Kangaroo Island is famous for its diverse wildlife and, increasingly, a charming boutique food festival which runs annually for eight days at the beginning of May. Visitors can share a meal in a private home cooked by a passionate foodie, discover pop-up and wilderness events, join in festivities at the coastal Hothouse and enjoy a special day of local produce in the Enchanted Garden. • tourkangarooisland.com.au/kifeastival » You may also be interested in: • Where to eat in Australia • A Taste of Australia with Donna Hay • Embark on a fine food and wine tour – Australian style • Hungry for more? Tantalise your taste buds with fantastic recipes by Aussie cook Donna Hay at telegraph.co.uk/tasteofaustralia", "external_links": [], "published": "2015-08-07T20:57:00.000+03:00", "crawled": "2015-08-07T16:48:33.155+03:00", "highlightTitle": ""}