{"organizations": [], "uuid": "0b1c00afcb390325f0b3afa1c17f7ed698dce2bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/c/8/l/q/image.related.StuffLandscapeSixteenByNine.620x349.16c8k9.png/1439499720253.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/usa/71114841/Grand-Canyon-s-North-Rim-is-more-than-remotely-satisfying", "country": "AU", "title": "Grand Canyon’s North Rim is more than remotely satisfying", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Grand Canyon’s North Rim is more than remotely satisfying", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T00:02:00.000+03:00", "replies_count": 0, "uuid": "0b1c00afcb390325f0b3afa1c17f7ed698dce2bb"}, "author": "Sam McManis", "url": "http://www.stuff.co.nz/travel/destinations/usa/71114841/Grand-Canyon-s-North-Rim-is-more-than-remotely-satisfying", "ord_in_thread": 0, "title": "Grand Canyon’s North Rim is more than remotely satisfying", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Grand Canyon’s North Rim is more than remotely satisfying SAM MCMANIS Last updated 09:02, August 14 2015 Sam McManis/TNS \nTourist Conny Olsson of Malmo, Sweden, enjoys the solitude on the back porch of the Grand Canyon Lodge, built in 1928. \nSunrise broke gradually, then almost all at once, as I descended alone, blissfully alone, on the North Kaibab Trail, and I was surprised at that moment to find that a new hue had emerged, yet another shade of red. \nThis hardly seemed possible. After a week at the Grand Canyon — the West, South and, now, the North Rim — I thought I'd viewed the entire Sherwin-Williams palette of reds. \nI had seen the rust of serrated sandstone, the burnt sienna of distant plateaus. I had trod upon the fine coppery dust that adheres like a second layer of skin, run my hand along the rough, jagged fired-brick boulders resting precariously on cliff's edge. I had climbed the Desert View Watchtower at sunset and watched as a blazing crimson turned, with lengthening shadows, into a brooding maroon. I had ogled, too, the garish Kardashian-lipstick-red of a tourist's Bermuda shorts, matching his rubefacient cheeks, and sought to avoid the deep burgundy of a child's bloody nose, dripping on the shuttle-bus seat next to me. \nTrust me, I knew my reds by week's end. \nYet here came another gradation, an altogether new intensity, to expand my Crayola box of mental images. \nI was loping down the switchbacks heading for the bridge at Redwall, a looming strata of limestone rock forged roughly 340 million years ago when this arid gorge was merely sea. Maybe it was a trick of light, the sun's first penetrating rays contracting my pupils, but I could've sworn that the rock face had morphed into nothing short of a wall of fire, blazing with brilliance of a deeper red, verging on purple, but at the same time seeming to send off sparks. \nIt was ridiculously gorgeous, teeming with almost an unnatural radiance, as if Photoshop-enhanced. I stopped in my tracks and just gawked. \nWhen people ask what the appeal of spending quality time (and quantity time, too, for it's quite a haul to visit) at the Grand Canyon, there is your answer. These are sights you do not forget, no need for a smartphone or GoPro. I figured that after a few days here I'd become inured to the landscape — OK, fine, nice view of another cliff, when's lunch? — but the Grand Canyon constantly surprises and delights. \nA tourist poses for a photograph at Mather Point, a popular viewpoint on Grand Canyon's South Rim. (Sam McManis/TNS) Ad Feedback \nAnd it is at the North Rim, the less-visited but no less sublime national park outpost, where you can experience the Grand Canyon in its purest form — unless, of course, you have the temerity and back-country skills to camp out for days on the canyon floor. \nIts remoteness is its appeal. Though the touristic hordes that gather each day at Mather Point on the South Rim can actually see the North Rim in the distance — it is, after all, only a 16-km flight away for a red-tailed hawk — it's a mind-numbing, often winding, 346-km trip via automobile. But, once you get here, there is little to distract you from an immersion in nature. Unlike the South Rim, there are no shuttle buses to ferry you to observation points, no swooping West Rim helicopter rides into the canyon, no railroad depot or a town with fast-food options just outside the park entrance. \nHere, it's just you and the elements. Sure, there is a lodge, literally at the end of the road, where you can spend the night and dine in a restaurant whose floor-to-ceiling windows afford canyon views even from the centre of the dining room. A deli, bar and gift shop are attached, and a small general store resides a quarter-mile away at the modest 78-site campground, which fills up fast in the height of summer. \nBut that's it, pretty much. The rest is up to you, entertainment-wise. Except for a three-hour mule-riding service that skirts the rim and dips just a mile or two into the canyon, no organised excursions beyond a few ranger-led education jaunts are available. You are free, as the ubiquitous airline commercial goes, to move about the country. \nAnd what splendid country it is. \nThere is the aforementioned red, of course. But it's refreshing, at the North Rim, to see dabs of green, in the form of fragrant ponderosa pines and the lighter-shaded offerings such as aspen and white fir — a nice contrast to the rutilant geologic features. Visitors can set off on several trails starting at the lodge and, in less than two kilometres, go from heavily foliaged forest to stark sandstone cliffs, with a wind-swept meadow or two thrown in. \nA mule deer cut in line of a bunch of thirsty tourists at the South Kaibab Trailhead at the Grand Canyon's South Rim. (Sam McManis/TNS) \nGoing on the North Kaibab Trail, which starts 2.4km from the lodge and is the only access down 22.5 kilometres into the gorge, is like taking a semester's worth of physical science courses in a single hike, the various rock formations explicated on unobtrusive signs along the trail. (Most day hikers turn back at Roaring Springs, 8 kilometres down.) Less arduous is driving the 37-km side trip to Cape Royal, the southernmost tip of the North Rim. You hardly need to leave the car to enjoy the view. \nAsk North Rim regulars, and they will allude to a more serious, respectful-of-nature vibe that exists here. \n\"I don't want to come across in a negative way whatsoever, but you get a different type of visitor, because you've got to put in a lot of work to get here,\" ranger John Boitnott said. \"I've noticed that people who come here are really educated about nature, compared to other places I've worked. I think to appreciate nature, you've got to have a higher level of intelligence, and you need to be patient and pleasant. People are like that here.\" \nIndeed, there seemed a certain self-satisfied air — not smugness, just supreme contentment — among North Rim habitues. As several people pointed out, the North Rim looks down upon the South Rim in more ways than just the fact it's nearly 205 metres higher in elevation, at 2500 metres. There's a clubby, aren't-we-smart-to-get-away-from-the-crowds feel. Dave Stegman, a host at the campground and frequent visitor to the North Rim, has noticed it and, actually, feels that way himself. \n\"It's a secret almost — well, as secret as the Grand Canyon can be,\" Stegman said. \"It's a higher altitude than the South, and some people can't handle it. It's also far away from any towns and hotels and grocery stores, so that discourages some people. \n\"Look around here. The campground at the South Rim is in a big commercial area. Here, you can walk straight out a few hundred feet and camp right on the rim, look right down into it. You get a fire going in the evening, sit back. It's real nice. Can't be beat.\" \nThe impressive reds of the Grand Canyon. PhotoL 123rf \nShaun and Priscilla Rost snagged one of the choicest sites in the campground, lot No. 18, only1.5 metres away from the trailhead to the Transept Trail and less than 30 metres from the rim. They had to book it six months in advance. Though they live only an hour from the South Rim, the Rosts, who have two kids ages 8 and 5, say they prefer to haul their camper four hours on winding roads for the North Rim experience. \n\"It's calmer, less busy and cooler, too,\" Priscilla said, referring to the temperatures, which run about 10 degrees cooler than at the South Rim. \"And the lodge is more ... hey, Shaun, how would you describe the lodge?\" \n\"Rustic,\" Shaun said. \"Rustic in a good way.\" \nThe Grand Canyon Lodge, built in 1928, is the logical destination point, considering it's where the road ends. It boasts a handsome limestone facade with towering ponderosa pine beams arcing overhead. Down a few stairs, you reach an expansive indoor veranda, ringed by a curved wall of glass that must be a pain to squeegee clean. Flanking it on each side are open-air porches with rows of wooden recliners lined up inside a 3-foot stone retaining wall leading to the canyon below. \nRarely does a jockeying for position ensue. There almost always are more chairs than people, even at happy hour when waiters from the adjoining restaurant wander by to take cocktail orders. At high noon one recent Thursday, only a single lonesome figure, bedecked in cutoff jeans, a red polo shirt, flip-flops and a ratty old bucket hat, sat contemplating the universe. \nSo, of course, I had to approach and break his reverie. But Conny Olsson, from Malmo, Sweden, took the interruption with calm acceptance, like most tourists on this side of the canyon. \n\"This is my fifth time at the Grand Canyon, fourth on the North,\" he said. \"Why do I like it? I don't know. I'm not so much into hiking or crowds. I just like to relax, enjoy the view. I take stock. Something just draws me here.\" \nA rare total cloud inversion is pictured at Mather Point on the South Rim of the Grand Canyon National Park in Grand Canyon, Arizona. \nStock-taking seems a common pastime here, given the immensity of the canyon and one's sense of smallness amid such grandeur. I suppose you could entertain deep thoughts at, say, Mather Point, on the South Rim, too, but the mind might get distracted by the prattling of fellow tourists wielding selfie sticks and arguing over whether or not to spend five bucks for a Popsicle. \nAt Bright Angel Point, the North Rim's version of a camera-ready vista, you can take your time and get as deep in thought as you dare. On that same Thursday afternoon, I made the quarter-mile trek from the lodge to the rocky outcropping of Bright Angel. When I reached the railing, only one person was there. Haley Longstregth, a high schooler from Seattle, was just finishing up a panorama shot on her iPhone. Once she left, I had the place to myself for maybe five minutes. \nBut don't think the North Rim is bereft of social life. Late afternoon on the veranda, visitors congregated for a series of TED-talk-like discussions — one dealing with condors, another about the geologic makeup of the canyon, yet another an \"artist-in-residence\" chat about night photography. Waiters bearing drinks lent a festive mood but, by sundown, tranquility was restored. \nThe next morning, well beyond sunrise now, on my way back up the North Kaibab Trail, still glowing from my encounter with the otherworldly red wall, I encountered a half-dozen hikers chatting on their way down. I ducked off the trail, my back to a stone wall, to let them pass. \nMy annoyance eroded as everyone chirped \"thank you\" or \"sorry\" or both, on their way by. I smiled, too, suffused with a warm glow, fiery red, of fellow-feeling. \nTNS", "external_links": [], "published": "2015-08-14T00:02:00.000+03:00", "crawled": "2015-08-14T12:54:57.944+03:00", "highlightTitle": ""}