{"organizations": [], "uuid": "f04d74b4e5c1c4b0fe07b9a759d86dc4af0ca76c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62494/holiday-inn-manaus-green-globe-sustainability-brazil", "country": "US", "title": "Holiday Inn Manaus: Green Globe sustainability in Brazil", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Holiday Inn Manaus: Green Globe sustainability in Brazil", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T21:22:00.000+03:00", "replies_count": 0, "uuid": "f04d74b4e5c1c4b0fe07b9a759d86dc4af0ca76c"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/62494/holiday-inn-manaus-green-globe-sustainability-brazil", "ord_in_thread": 0, "title": "Holiday Inn Manaus: Green Globe sustainability in Brazil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Holiday Inn Manaus: Green Globe sustainability in Brazil   \nAug 11, 2015 Banners   \nLOS ANGELES, California - The Holiday Inn Manaus is located in the capital city of the state of Amazonas in northern Brazil. The hotel is strategically located at the entrance of the Industrial Pole of Manaus which is the main commercial center in the region. Shopping destinations and the Studio 5 Convention Center are also in close proximity. While numerous tourist and cultural attractions are situated close by as Manaus is the main entrance to the Amazon jungle, home to a diverse variety of plants, birds, insects and fish. \nGreen Globe congratulates Holiday Inn Manaus on its second certification in recognition of its commitment to sustainable best practices. The hotel achieved an outstanding compliance score of 87% against accredited criteria. \nPatricia Perrone, General Manager at Holiday Inn Manaus said, \"We are proud to be recertified by Green Globe! This recognition is very important to us. We understand that to be a great hotel guests love, we have to be environmentally friendly, economically viable, socially fair and culturally diverse.” \nHoliday Inn Manaus is part of the IHG Green Engage program and has implemented sustainable strategies to reduce resource usage. The hotel is located in the Industrial Pool of Manaus area with many companies focused on sustainability. For this reason, the hotel is also committed to comply with all steps necessary for certification. \nAs part of their sustainable operations, environmental training is provided to all new employees. And, all staff are informed of ways to reduce energy and water usage in regular bi-monthly meetings. Furthermore, the property has an independent artesian well and sewage system treatment plant onsite that reduces the property’s impact on surrounding water supplies. \nThe hotel’s organizational structure is dedicated to environmentally and socially responsible outcomes. In addition, to its sustainable best practices and professional services, the property strives to serve guests who are seeking personalized service, comfort and convenience. While the hotel’s products and services have been enhanced to meet and exceed the expectations of its guests. The Holiday Inn Manaus prioritizes the purchasing of products according to a stringent cost benefit analysis that incorporates transportation distances and environmental certifications. \nAll hotel and guest rooms provide and follow the highest international safety standards. Each room is fully equipped to ensure every guest’s expectation of comfort and quality are met. This is accompanied by caring customer service that focuses on attention to every detail and the wellbeing of all visitors. \nFor further information, please click here . \nAbout Green Globe Certification \nGreen Globe is the worldwide sustainability system based on internationally-accepted criteria for sustainable operation and management of travel and tourism businesses. Operating under a worldwide license, Green Globe is based in California, USA, and is represented in over 83 countries. Green Globe is an Affiliate Member of the United Nations World Tourism Organization (UNWTO).", "external_links": [], "published": "2015-08-11T21:22:00.000+03:00", "crawled": "2015-08-11T21:49:42.183+03:00", "highlightTitle": ""}