{"organizations": [], "uuid": "ec66331a9e68024f0f48ccaa3b93bc4f35c17be5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources3.news.com.au/images/2015/08/06/1227472/304715-52d455bc-3bd6-11e5-8ba6-37d94aa5cd16.jpg", "site_section": "http://www.adelaidenow.com.au/travel", "section_title": "Travel | Travel News and Holiday Deals | The Advertiser", "url": "http://www.adelaidenow.com.au/news/south-australia/copper-coast-council-rescinds-motion-to-fly-rainbow-flag-but-chief-executives-job-to-be-reviewed/story-fni6uo1m-1227472304743", "country": "US", "title": "Copper Coast Council rescinds motion to fly rainbow flag, but chief executive’s job to be reviewed |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Copper Coast Council rescinds motion to fly rainbow flag, but chief executive’s job to be reviewed | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T19:56:00.000+03:00", "replies_count": 0, "uuid": "ec66331a9e68024f0f48ccaa3b93bc4f35c17be5"}, "author": "JADE GAILBERGER BRYAN LITTLELY", "url": "http://www.adelaidenow.com.au/news/south-australia/copper-coast-council-rescinds-motion-to-fly-rainbow-flag-but-chief-executives-job-to-be-reviewed/story-fni6uo1m-1227472304743", "ord_in_thread": 0, "title": "Copper Coast Council rescinds motion to fly rainbow flag, but chief executive’s job to be reviewed |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "COPPER Coast Council has overturned its decision to fly the gay pride flag but the employment of an appeased chief executive, Peter Harder will be reviewed.\nResidents packed the council’s Kadina chambers last night for a meeting, where the main interest was in a motion to rescind last month’s decision to fly the rainbow gay pride flag during November’s Feast Festival.\nThat had led to the chief executive announcing he would quit the role in protest , because he had been dragged into the debate and would have to decide on the flag’s location - a decision he “couldn’t support”, he said.\nThe motion was rescinded, and replaced by a new motion to develop a policy that demonstrates the council’s commitment to support social inclusion and diversity within the community.\nIt is unclear how long it will take for the policy to be adopted, but no new flags, including the rainbow flag will be flown by the council.\nMayor Paul Thomas said the issue had divided the community, but hoped this new policy would reflect their views.\nChief executive Peter Harder is yet to formally resign from the council, but said the council’s change of heart had taken the urgency out of his departure.\nHowever, Mr Thomas said Mr Harder was due for a performance appraisal this month.\n“He indicated an intent to resign, and we will deal with that as part of his appraisal,” he said.\nResidents’ groups yesterday suggested letters supporting the move to fly the rainbow flag and accept Mr Harder’s verbal resignation had not been included in last night’s agenda and only letters supporting Mr Harder were included.\nMr Thomas said all letters where a request was made for them to go to council were included in the agenda and all elected members received all letters on the issue in private correspondence.\nResident and former councillor Beverley Schultz said she was aware of letters and emails being sent to council on the issue where there had been no response or acknowledgment.\n“I believe that council made the decision at the last council meeting to fly the flag and if they now want to go against that, it shows a bit of indecisiveness and a lack of courage,’’ Mrs Schultz told The Advertiser yesterday.", "external_links": [], "published": "2015-08-06T19:56:00.000+03:00", "crawled": "2015-08-06T05:51:45.911+03:00", "highlightTitle": ""}