{"organizations": [], "uuid": "8a6dd01704b3ae96c57d4a1f246b07cc1b9f2c84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/12/British-Airways-Short-Haul-Fleet.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/british-airways-announces-new-route-to-salzburg-from-glasgow-airport/", "country": "US", "title": "British Airways announces new route to Salzburg from Glasgow AirportTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "British Airways announces new route to Salzburg from Glasgow AirportTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "8a6dd01704b3ae96c57d4a1f246b07cc1b9f2c84"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/british-airways-announces-new-route-to-salzburg-from-glasgow-airport/", "ord_in_thread": 0, "title": "British Airways announces new route to Salzburg from Glasgow AirportTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "British Airways announces new route to Salzburg from Glasgow Airport Published on : Thursday, August 20, 2015\nScots seeking somewhere to slope off for a skiing holiday or to enjoy the sound of music will hit the right note when British Airways launches a new direct winter service to Salzburg from Glasgow.\nTickets for the weekly service linking Scotland with Austria went on sale from August 12, with the first flight taking off in the winter season on December 12, 2015.\nIt’s the first time that British Airways has offered Scots a direct route to historic Salzburg, with its world-famous Alpine setting and historic baroque buildings and architecture.\nIt also served as the backdrop to the multiple award-winning Julie Andrews musical, The Sound of Music, as well as being the birthplace of classical composer Mozart.\nPhyllis Stuart, British Airways’ manager at Glasgow Airport said: “Salzburg is one of Europe’s great tourist destinations and offers something for everyone, from those wanting to explore the rich musical and cultural heritage of the city, with its links to Mozart and Rogers and Hammerstein, to those whose focus is on the hundreds of ski resorts that lie within a short distance.”\n“We’re sure the new direct service will prove popular with our customers and those who want a quick and easy direct route to Salzburg from Glasgow to experience the slopes – and the après-ski!”\nFrancois Bourienne, Glasgow Airport’s commercial director, said: “This is exciting and welcome news from British Airways. As well as demonstrating the airline’s on-going commitment to Glasgow and to our passengers, including many of British Airways frequent flyers, it also shows the strong demand that exists for services to European ski destinations.\n“The new route to Salzburg is sure to be popular with those looking to hit the slopes this winter, offering ideal access to some of the top resorts, including Zell am See, Saalbach and Obertauern .\n“These resorts are renowned for being family friendly, offering fantastic food and drink, and most importantly, guaranteed snow throughout the winter months. We look forward to working in partnership with British Airways to ensure the success of this excellent new route.”\nFlights start from £98 return, including all taxes and charges, free online check-in and seat allocation, complimentary drinks and snacks during the flight, generous cabin baggage allowance and one checked bag.\nBritish Airways offers great connections for Scots to skip to the sun or the slopes for a much-needed break with flights from Glasgow to the rest of the world via its extensive international network.\nThe airline has 61 flights a week between Glasgow and Heathrow and 25 a week between Glasgow and Gatwick, with return hand baggage only fares starting from just £86 between Glasgow and Heathrow and £87 between Glasgow and Gatwick, including all taxes and charges.\nSource:- Glasglow Airport", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T03:16:28.754+03:00", "highlightTitle": ""}