{"organizations": [], "uuid": "4c1f2e008db11aef8a0d2153a83894c8ac8c8dd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63132/russia-looking-middle-east-earn-tourism-ruble", "country": "US", "title": "Russia is looking to the Middle East to earn a tourism Ruble", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Russia is looking to the Middle East to earn a tourism Ruble", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T23:39:00.000+03:00", "replies_count": 0, "uuid": "4c1f2e008db11aef8a0d2153a83894c8ac8c8dd8"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/63132/russia-looking-middle-east-earn-tourism-ruble", "ord_in_thread": 0, "title": "Russia is looking to the Middle East to earn a tourism Ruble", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Russia is looking to the Middle East to earn a tourism Ruble   \nAug 29, 2015 eTN   \nTourism officials will continue to promote Russia as a tourist destination for travellers from countries of the Middle East, the Asia-Pacific region and Africa, the deputy head of the national tourism agency said on Friday. \nRostourism deputy director Sergey Korneev was speaking after signing an agreement with the national marketing agency Visit Russia and the Russian Business Council (RBC) for the Middle East and Africa. \n\"The Russian Business Council is a very active player in the Middle East and African market. The organization carries out a large number of activities in the region and helps us find new partners,\" said Marina Morozova, head of the Visit Russia office in Dubai to Russian newswire TASS. \nIgor Egorov, who runs the Dubai-based council, said the business community in the United Arab Emirates (UAE) wanted to raise awareness among people living in the Middle East about opportunities in Russia, including the country’s tourism potential. \nThe Visit Russia office in the Middle East and the RBC are planning to hold joint marketing events to promote Russia as a tourist destination, Egorov said, adding that they hoped to attract not only UAE citizens but also tourists from India and African countries who use Dubai as a transit point. \nThe Russian Business Council (RBC) is a non-profit association of companies and entrepreneurs, operating under the umbrella of the Dubai Chamber and representing interests of the Russian business community. The organization’s goal is to create a favorable climate for Russian companies and entrepreneurs that want to develop their business in the Middle Eastern market and to realise investment projects in the region. It serves as a bridge between Russia and the Middle East, and is the only Russian business association in the Middle East.", "external_links": [], "published": "2015-08-29T23:39:00.000+03:00", "crawled": "2015-08-30T01:30:39.176+03:00", "highlightTitle": ""}