{"organizations": [], "uuid": "fc8e5e5174c9af5c6277c98da01490138bcb500c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63045/how-airlines-should-react-bare-reference-bomb", "country": "US", "title": "How airlines should react to “a bare reference to a bomb”", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "How airlines should react to “a bare reference to a bomb”", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:05:00.000+03:00", "replies_count": 0, "uuid": "fc8e5e5174c9af5c6277c98da01490138bcb500c"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63045/how-airlines-should-react-bare-reference-bomb", "ord_in_thread": 0, "title": "How airlines should react to “a bare reference to a bomb”", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How airlines should react to “a bare reference to a bomb”   \nBy Hon. Thomas A. Dickerson | Aug 27, 2015 Hon. Thomas A. Dickerson   \nIn our earlier article [Don’t ever use the words “bomb” or “gun” on or near commercial aircraft (ENT (7/31/2014)] we discussed a case involving the inappropriate and ill-conceived use of the word “bomb” by a passenger who was denied boarding because she was late to the gate although her baggage had been boarded. As noted in Hamblett, Circuit Upholds Dismissal of Suit Against Airline Agent, newyorklawjournal.com (7/17/2015) “An irate traveler who was arrested and lost her job after commenting about a bomb to a JetBlue Airways gate agent at John J. Kennedy International Airport...Baez ultimately pleaded guilty to misdemeanor drug charges and was sentenced to three years’ probation. She was also ordered to repay the airline $13,500 for the cost of rerouting the flight. But she violated her probation by failing a drug test and refusing to attend drug treatment. She was sent to jail for 30 days and lost her $190,000 a year job as senior vice president for Schematics, an Internet services company”. In this article we review the recent Second Circuit Court of Appeals decision in Baez v. JetBlue Airways Corporation, 2015 WL 4281498 (2d Cir. 2015) affirming the dismissal of Ms. Baez’s claims against JetBlue and others. \nTravel Law Update \nPainted Ladies Of Times Square \nIn McGeehan, Times Square’s Topless Women Should Be Regulated, Mayor Says, nytimes.com (8/18/2015) it was noted that “Mayor Bill de Blasio said on Tuesday that he sees the women parading around Times Square covered in little but body paint not as creative artists, but as pushy panhandlers whose efforts to separate tourists from their money should be regulated. The topless women, known as denudes, have attracted more scrutiny than usual this summer amid complaints about their aggressive solicitation of payment to pose for pictures. Mr. De Blasio placed them in the same category as the gaggle of costumed characters that have become nearly synonymous with predatory panhandling in and around Times Square. ‘It’s wrong’. Mr. De Blasio said of the topless women’s tactics, during a news conference. ‘We are going to look for every appropriate way to regulate all activity that involves either begging or asking people for a contribution based on, you know, the opportunity to take a picture, for example’”. \nIn Bellafante, The Painted Ladies of Times Square Are Part of an Old New York Tradition, nytimes.com (8/20/2015) it was noted that “It is hard to conceive of the literature of New York City...without the central presence of a hustler: the hungry immigrant, the gold digger, the charlatan, the bootlegger, the fame seeker, the huckster...If drive, desperation and deranged ambition don’t interest you, you will be much happier in Sante Fe. Last week, out of a perceived need to respond to concerns that quality of life is deteriorating in the city, Mayor Bill de Blasio went after the semi-naked women of Times Square known as desnudas, the latest incarnation of subversive go-getter”. \nIn Grynbaum & Flegenheimer, Mayor de Blasio Raises Prospect of Removing Times Square Pedestrian Plazas, nytimes.com (8/20/2015) it was noted that “When New York City installed pedestrian plazas in Times Square six years ago, replacing traffic-choked streets with beach chairs and picnic tables, the move prompted civic controversy...and, eventually, widespread praise as an influential innovation in urban design. But as the city grapples with an influx of topless-tip-seekers, the de Blasio administration has suggested an unexpected remedy: Remove the islands altogether”. \nAnd in McKinley, Topless in Times Square: A Legal View, nytimes.com (8/20/2015) it was noted that “Whatever action the city takes to control (the desnudas) it will face legal challenges at every turn. Civil rights lawyers argue the women are bare-breasted panhandlers, and so they are protected, first by two state high-court rulings that made it legal to go topless and to panhandle, and then by the free-speech clauses in the state and federal constitutions...City officials, however, say arresting the women for indecency is not an option. That is because they can make a strong argument that they are street performers, exempted by the state law and protected by the First Amendment, the officials said”. \nHotel “Hot Spot” \nIn Hu & Remnick, Hotel That Enlivened the Bronx Is Now a ‘Hot Spot’ for Legionnaires’, nytimes.com (8/10/2015) it was noted that “The arrival of the Opera House Hotel in the South Bronx two years ago was a turning point for a poor corner of New York City...But now the Opera House, on East 149th Street, is at the center of the worst outbreak of Legionnaires’ disease in the city’s history, with investigators identifying a cluster of three patients who had direct contact with the hotel and a second cluster of three who live in an apartment building on the street behind the hotel. The airborne disease has killed 12 people and infected at least 113 since early July, overshadowing an economic success story and highlighting the public health risks that have long plagued the city’s poorest borough”. \nLove That Airstream \nIn Suddath, How America learned to love the Airstream again, msn.com (8/18/2015) it was noted that “So many people are buying Airstreams that the company says it’s selling five times as many as it did in 2009...Airstream makes about 60 towable trailers a week in models ranging from the 16-foot Bambi ($44,000) to the 28-foot Land Yacht ($146,000) to a touring coach built on a Mercedes-Benz chassis ($155,000) which the rich use when they want to ride in style. Everything is handmade-the rivets fastened, the aluminum cut, the furniture sanded-by the company’s 560 employees”. \nThe Unfriendly Skies \nIn Senate Report is in: The Unfriendly Skies and Consumer Confusion Over Airline Fees, eturbonews.com (8/6/2015) it was noted that “A new congressional report published today took aim at the airline industry for failing to adequately disclose extra fees and add-on costs charged to the flying public. The reports...found that ancillary fees, such as change and cancellation penalties and preferred seating, are increasingly keeping consumers in the dark about the true cost of air travel...In the case of preferred seating charges, the report found that consumers who purchase tickets through airline websites are sometimes only presented seats which require an additional fee. In such instances, many travelers often pay the fee, unaware that the airlines will randomly assign them an available free seat at a later date...the review found that consumers generally did not receive prominent or clear flight change and cancellation fee disclosures when they purchased tickets from airline websites”. \nRailroad Safety Controls \nIn Nixon, Most Railroads Won’t Meet Deadline for Safety Controls, Report Says, nytimes.com (8/7/2015) it was noted that “A majority of freight railroads and passenger trains will not be able to meet a year-end deadline to install technology that prevents trains from exceeding speed limits and helps avoid collisions, the Federal Railroad Administration said Friday in a report to Congress. Congress set a deadline of Dec. 31 for freight and commuter rail companies to install the technology, which is known as positive train control, after a California passenger train derailed in 2008, killing 25 people”. \nFive Travel Tips From The EU \nIn Five things who should know when travelling abroad, europarl.europa.eu/news/ (7/20/2015) it is noted that “We all love to travel, but do you know what to do if things go wrong? When there is an emergency, your flight gets cancelled or you lose your passport? There are EU rules in place to make travelers’ lives easier”. Discussion of “free European health insurance card (which) entitled foreign travelers to urgent medical aid in all 28 EU member states plus in Iceland, Liechtenstein, Norway and Switzerland”, EU transportation delay reimbursement and assistance programs and low cell phone and internet charges throughout the EU. Bravo. \nNoisy Aircraft In The Hamptons \nMany New Yorkers spend all or part of the summer vacationing in the Town of East Hampton (the Town) which is the “easternmost town on Long Island, New York, situated approximately 100 miles east of New York City, It is a popular seaside resort community during the summer. The Town owns and operates...public-use airport located near the Town. Some of these vacationers arrive by helicopter and other ‘Noisy Aircraft’ defined as any airplane or rotorcraft for which there is a published Effective Perceived Noise Decibels (EPNdb) approach (AP) level of 91.0 or greater”. To alleviate a perceived noise problem the Town on April 16, 2015 adopted local laws imposing access restrictions to the Airport including “(1) a mandatory curfew prohibiting all aircraft from using the Airport between 11:00 p.m. and 7:00 a.m. (the Mandatory Curfew); (2) an extended curfew prohibiting ‘Noisy Aircraft’ from using the Airport from 8:00 p.m. to 9:00 a.m. (the Extended Curfew); and (3) a weekly limit prohibiting ‘Noisy Aircraft’ from using the Airport more than two times per week during the ‘Season”-i.e., the months of May, June, July, August and September (the One Trip Limit)...Violations of the Town Laws are deemed criminal offenses punishable by a sliding scale of monetary fines for the first three violations-$1,000; $4,000 and $10,000 respectively and prohibition from the Airport for a period of up to two years for a fourth violation”. \nNoise Ordinances Challenged \nThese noise ordinances were challenged in court [Friends of the East Hampton Airport, Inc. v. The Town of East Hampton, 2015 WL 3936346 (EDNY 2015)] by a “wide spectrum of airport users and aviation companies that frequently use the East Hampton Airport” as, inter alia, preempted by “federal statutes governing aviation” and “constitute an unlawful restraint on interstate commerce” and sought a preliminary injunction enjoining the enforcement of the subject Town Laws. In addressing the instant relief sought the Court stated “The balance of hardships inquiry asks which of the two parties would suffer most grievously if the preliminary injunction motion were wrongly decided”...Here, the balance of hardships tips in the Town’s favor with respect to the Mandatory Curfew and Extended Curfew, as the Town’s desire to protect its residents during sleeping hours clearly outweighs the inconvenience Plaintiffs may experience by having to minimize their flight schedules. However, with respect to the One-Trip Limit, the balance tips in Plaintiffs’ favor in light of the fact that the One-Trip Limit will have a drastic impact on their businesses and there is no indication in the Town’s papers that a less restrictive measure would not also satisfactorily alleviate the Town’s noise problem”. \nSky Diver’s Release Unenforceable \nOne of the traditional Adventure Travel sports is sky diving and on occasion there may be an accident. Sky divers are more often than not required to sign a release before they are allowed to participate in the sport. In Tiede v. Frontier Skydivers, Inc., 105 A.D. 3d 1357 (N.Y.A.D. 2013)(See also: 2015 WL 3797160 (N.Y.A.D. 2015)(lawsuit against skydiving instructor dismissed) it was noted that “Plaintiff commenced this negligence action seeking damages for injuries she sustained when a plane in which she was a passenger crashed shortly after takeoff...A week before the accident, plaintiff had enrolled in a one-hour course on skydiving provided by Frontier (Skydivers, Inc.) and signed a release of liability and assumption of risk agreement (the release which provided that) plaintiff assumed the risk of any injuries resulting from her participation in ‘parachuting activities’ and agreed to release the ‘Released Parties’ from liability ‘for injuries or damages arising out of [her] participation in ‘parachuting activities’; even if caused by ‘negligence’...or other fault of ‘Released Parties’”. \nIn finding that the release was barred by New York State General Obligations Law (GOL) 5-326 which applies to recreational activities but not instructional facilities the Court held that “Frontier’s facility is not used purely for instructional purposes”. However, the Court dismissed the cause of action based upon gross negligence since plaintiff “has not alleged conduct on the part of defendants that ‘evinces a reckless disregard for the rights of others or smacks of intentional wrongdoing’”). \nTravel Law Article: Don’t Use The Word “Bomb” \nIn Baez v. JetBlue Airways Corporation, 2015 WL 4281498 (2d Cir. 2015) the Court noted that “Baez arrived at JFK Airport at about 6:20 in the morning and checked in at the JetBlue counter for her 8:05 flight to Austin...She did not, however, appear at her gate until minutes prior to the flight’s scheduled departure. As Baez approached the gate, Malabet (former JetBlue employee) told her that she had just closed the plane’s door and that Baez would not be permitted to board. Baez, upset by this turn of events, asked Malabet about her checked luggage. According to Baez, Malabet informed her that her luggage would remain on the plane and she would be able to retrieve it in Austin when she got there on a later flight”. \nThe “Bomb” Word Used \n“By Baez’s own account, Baez then made cryptic reference to the possibility of a bomb in her luggage: ‘Isn’t it a security risk to let a bag go on a plane without a passenger, what if there was a bomb in the bag?’ Baez alleged that Malabet responded: ‘TSA agents would know if there was a bomb in the bag’ and Baez retorted ‘TSA-my ass’ and walked away. Malabet relayed her conversation with Baez to her supervisor. According to Baez, Malabet purposely misrepresented the relevant conversation in making her internal report and conveyed that ‘Baez had stated that [she had] a bomb in [her] bag’ and asked ‘[S]o are you guys going to turn the plane around ‘cause I need my bag?’...According to Malabet, she did not personally regard Baez as a security risk, and reported only that Baez implied that she had a bomb in her bag by posing the question, what if there was a bomb in my bag?” \nDetained, Questioned & Plane Diverted \n“JetBlue security personnel located and detained Baez (who) was questioned at length by law enforcement agents. A criminal complaint, later filed by an FBI agent reported that Baez asked Malabet, ‘What if I had a bomb in my bag?’... As a security measure, JetBlue personnel and law enforcement officials decided to reroute the plane carrying Baez’s luggage. When the plane landed and its passengers were removed, security officers searched all the checked luggage and found no bomb; they did find marijuana residue in Baez’s bag”. \nThe Charges & The Lawsuit \n“Baez was charged with making a false bomb threat...the government (later) dropped the bomb threat charge and Baez pleaded guilty to misdemeanor drug charges based on the marijuana found in her luggage. Baez was sentenced to three years’ probation and ordered to pay restitution to JetBlue for the cost of rerouting the plane...Baez’s arrest garnered some media attention. When she lost job, she ‘suspected this was a result of the JetBlue matter’...Baez (sued JetBlue and Malabet alleging, inter alia) negligent supervision, retention, training and hiring; defamation; false arrest and intentional infliction of emotional distress”. \nATSA Reporting Immunity \n“In enacting the ATSA (Aviation and Transportation Security Act), Congress sought ‘to ensure that air carriers and their employees would not hesitate to provide the TSA (Transportation Security Administration) with the information it needed’ to respond to potential threats...Accordingly, the statute provides: \n‘Any air carrier or...employee of an air carrier...who makes a voluntary disclosure of any suspicious transaction relevant to a possible violation of law or regulation, relating to air piracy, a threat to aircraft or passenger safety, or terrorism...shall not be civilly liable to any person under any law or regulation of the United States...or regulation of any State...for such disclosure’...” \nException To The Immunity Rule \n“The ATSA excepts from the broad grant of immunity disclosures made ‘with actual knowledge’ that the statement were ‘false, inaccurate or misleading’ or ‘with reckless disregard as to the[ir] truth or falsity’”...The Supreme Court has held that an air carrier (such as JetBlue) and an airline employee (such as Malabet) are immune from liability for the type of report made here unless the report was materially false.” \nDifferences Not Material \n“There are differences between the statements Baez concedes she made and the statements she alleges Malabet reported to law enforcement officials. However, the differences are ‘immaterial’ for purposes of ATSA immunity...Baez claims she raised only a hypothetical question about the security risk posed by a checked bag unaccompanied by its owner, which might contain a bomb. But since Baez’s luggage was indisputably a checked bag unaccompanied by its owner, ‘a reasonable [law enforcement] officer...would have wanted to investigate...’” \nA Bare Reference To A Bomb Requires Action \n“[T]o accept [Baez’s] demand’ that an airline employee relay the ‘precise wording’ of a potential security threat ‘would vitiate the purpose of ATSA immunity’...At an airport a bare reference to a bomb may be enough to set off the chain of events that resulted in Baez’s detention, interrogation and arrest by the FBI...A gate agent or airline manager may not confidently distinguish between a veiled threat and a comment expressing genuine concerns about security. That is why, once a report is made, it is for the TSA and other law enforcement officers ‘to determine and execute a response’...Had JetBlue reacted otherwise, it might have been in violation of its obligation to report potential threats, and could have been subject to civil penalties”. \nThe author, Justice Dickerson, has been writing about Travel Law for 39 years including his annually updated law books, Travel Law, Law Journal Press (2015) and Litigating International Torts in U.S. Courts, Thomson Reuters WestLaw (2015), and over 350 legal articles. For additional travel law news and developments, especially in the member states of the EU, see IFTTA.org. \nThis article may not be reproduced without the permission of Thomas A. Dickerson.", "external_links": [], "published": "2015-08-27T03:05:00.000+03:00", "crawled": "2015-08-27T03:26:05.236+03:00", "highlightTitle": ""}