{"organizations": [], "uuid": "da278d2f216b24ec1eb6c8549ec5544879b7f327", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sooperarticles.com", "main_image": "", "site_section": "http://www.sooperarticles.com/rss/category/travel-21.xml", "section_title": "Travel Articles - Sooper Articles", "url": "http://www.sooperarticles.com/travel-articles/afghanistan-emerging-tourists-new-hot-spot-destination-1437377.html", "country": "US", "title": "Afghanistan is Emerging as a Tourist's New Hot Spot Destination", "performance_score": 0, "site": "sooperarticles.com", "participants_count": 0, "title_full": "Afghanistan is Emerging as a Tourist's New Hot Spot Destination", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T01:41:00.000+03:00", "replies_count": 0, "uuid": "da278d2f216b24ec1eb6c8549ec5544879b7f327"}, "author": "", "url": "http://www.sooperarticles.com/travel-articles/afghanistan-emerging-tourists-new-hot-spot-destination-1437377.html", "ord_in_thread": 0, "title": "Afghanistan is Emerging as a Tourist's New Hot Spot Destination", "locations": ["New Hot Spot Destination Afghanistan", "Afghanistan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Afghanistan is Emerging as a Tourist's New Hot Spot Destination Afghanistan is Emerging as a Tourist's New Hot Spot Destination 0 \nAfghanistan is a popular country which is situated inside South and Central Asia. It is amongst 32nd most populous nation of the world. It shares its borders with Pakistan, Iran, Turkmenistan, Uzbekistan and Tajikistan. The land has been home to many peoples and many spectators have watched many military campaigns of Alexander the Great. Afghan tour includes visits to numerous places. \nAs it is an ancient place needless to say it holds many remarkable and magnificent places in its vicinity which provides complete information about the past history. A person who loves History and want to live with crave of history, and then Afghanistan is a must-visit place for that inspiring traveler. There are numerous lakes, Museums, Shrines and Mosques which revels the authenticity of the place and are included in tour Afghanistan. \nCultural landscape and archaeological remains of the Bamiyan valley is one of the most popular places of Afghanistan. You can enter this place from the west of Kabul. Attractive and beautiful landscapes will leave the tourist flabbergasted. You will not like to take off your eyes away from these mesmerizing landscapes. Uniqueness and beauty of Bamiyan is something which should not be missed out while planning an Afghan tour. \nAnother very enticing tourist place is the Blue Mosque. People love to spend their vacations praising the beauty of blue tiles and white marbles. The place is very relaxing and attractive as described by the frequent visitors. \nAnother must visit place which can be included in afghan tour is Band-e-Amir. It is a combination of five lakes and needless to say that the water of these lakes is deep blue in color attracting visitors to its natural beauty. Usually people call it as a lake of jewels. \nAfghanistan Kabul Museum is another centre of attraction enticing people across the globe because of its collection of finest and past miniatures, manuscripts and weapons. The authenticity of past valuable resources is well procured at the named place. It is tailor made to meet the requirements of the tourists who wish to learn more about the history and the happenings of the past. \nTour Afghanistan is incomplete if not accompanied by the visit to Babur tomb. Id Gah Mosque is a place which tourist likes to walk down and explore the beauty minutely. Darul Aman Palace is another centre of attraction for a globe trotter who wishes to travel across the world. \nAfghan tours are arranged within reasonable prices thus giving choice to numerous people to select Afghanistan as one of their choice amongst many other tourist places. It calls for one time visit for all those travel motivated people who wish to learn and know more about the history of the past. Herta Citadel steals much heart because of its originality. Tour Afghanistan will include visit to many mausoleum, tombs and castles. The beauty of these must-visit places is well maintained by the government and all necessary steps are taken to procure the remains of the past. for know more visit Afghan Tour Rate this Article", "external_links": [], "published": "2015-08-16T01:41:00.000+03:00", "crawled": "2015-08-16T07:47:16.031+03:00", "highlightTitle": ""}