{"organizations": [], "uuid": "43974243643c3234fcecff01415d8029d8d27ea5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62672/rwandair-stepping-sports-sponsorships-uganda", "country": "US", "title": "RwandAir - stepping up sports sponsorships in Uganda", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "RwandAir - stepping up sports sponsorships in Uganda", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T06:45:00.000+03:00", "replies_count": 0, "uuid": "43974243643c3234fcecff01415d8029d8d27ea5"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/62672/rwandair-stepping-sports-sponsorships-uganda", "ord_in_thread": 0, "title": "RwandAir - stepping up sports sponsorships in Uganda", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RwandAir - stepping up sports sponsorships in Uganda   \nBy Prof. Wolfgang H. Thome, eTN Africa Correspondent | Aug 17, 2015 eTN   \nRwanda’s Senior Regional Manager Alice Katiti and Country Manager Ada Magezi were at hand to award the prizes to the winning golfers over the weekend, when RwandAir, Uganda’s adopted airline – now flying double daily from Entebbe to Nairobi and back and daily from Entebbe to Juba and back – sponsored a unique golf tournament format. \nGiven before the first tee a specific number of strokes does the player emerge winner who gets furthest on the course within that set limit, of course taking into account handicaps of the competitors. \nThe two winners in the ladies – Doreen Kirabu – and men – Ji Song Linch – categories won tickets from Entebbe to Kigali and a place in the Rwanda Open Championship next month at the Kigali Golf Club. \nRwandAir, which stepped into the void created by the exit of Air Uganda under fifth freedom right, plans to add a third frequency to Nairobi later in the year and going by grapevine talk may a second daily flight to Juba also be on the cards. Subsequently has the airline also stepped into the void vis a vis sports sponsorships and other Community Social Responsibility activities and it is understood that this unique golfing tournament will be an annual event from here on. \nUgandan golfers flying with RwandAir from Entebbe to Nairobi or via Kigali to Mombasa can also have their golfbag uplifted for free over and above their regular baggage allowance and are thus able to play some of Kenya’s fancied courses in the capital or at the Kenya coast.", "external_links": [], "published": "2015-08-17T06:45:00.000+03:00", "crawled": "2015-08-17T15:52:59.371+03:00", "highlightTitle": ""}