{"organizations": [], "uuid": "4b2749f9cbf682eda5a941ecc8e6d110f8e79588", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/running-wild-4", "country": "US", "title": "Running in the Wild", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "Running in the Wild", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T09:21:00.000+03:00", "replies_count": 0, "uuid": "4b2749f9cbf682eda5a941ecc8e6d110f8e79588"}, "author": "senh", "url": "http://www.wopular.com/running-wild-4", "ord_in_thread": 0, "title": "Running in the Wild", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Hogan wants to be Donald Trump’s running mate Former wrestling star Hulk Hogan wants to join Republican presidential hopeful Donald Trump on the campaign trail. Business tycoon Trump is in the running for the nomination to be the U.S. Republican party's 2016 presidential candidate, and Hogan has now ... 08/29/2015 - 8:54 pm | View Link World Athletics Championships: Mo Farah creates distance running history with 5000m gold Beijing: Mo Farah became the first man to win back-to-back world distance doubles when he stormed to 5,000 metres victory at Beijing's Bird's Nest stadium on Saturday. The Briton, rocked this season by doping allegations against his coach, put the row ... 08/29/2015 - 8:50 pm | View Link Kalu's career off to a running start He's a jokester. That's one of the things defensive coordinator Mark Banker will tell you about Joshua Kalu. That's fine. The coach just wants Kalu to be all business when he's on the field. Because when the sophomore cornerback is locked in, he's pretty ... 08/29/2015 - 8:28 pm | View Link Vice President Hulk Hogan? Disgraced wrestler wants to be Donald Trump’s running mate It’s the most politically incorrect political pairing ever: A tag team of Donald Trump and Hulk Hogan. Wrestler Hogan — his career in the tank after recordings emerged of him going on a racist rant — told TMZ Sports he’d love to join the bombastic ... 08/29/2015 - 8:00 pm | View Link Darren McFadden outshines Joseph Randle in running game vs. Vikings Darren McFadden did a better job backing up Joseph Randle’s “meat on the bone” comment than Randle himself on Saturday against the Vikings. McFadden rushed for 37 yards on four carries against the Vikings, averaging 9.3 yards. His highlight play was ...", "external_links": [], "published": "2015-08-31T09:21:00.000+03:00", "crawled": "2015-08-31T15:12:37.781+03:00", "highlightTitle": ""}