{"organizations": [], "uuid": "6149ffdd8878f1da1e4032da78c6d63b8d1294cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03419/p7-4-web_3419018k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-25.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/china-watch/technology/11817116/silicon-valley-mayors-visit-chengdu-china.html", "country": "US", "title": "City taps Silicon Valley mayors for advice on innovation", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "City taps Silicon Valley mayors for advice on innovation - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T06:56:00.000+03:00", "replies_count": 0, "uuid": "6149ffdd8878f1da1e4032da78c6d63b8d1294cd"}, "author": "Li Yang", "url": "http://www.telegraph.co.uk/sponsored/china-watch/technology/11817116/silicon-valley-mayors-visit-chengdu-china.html", "ord_in_thread": 0, "title": "City taps Silicon Valley mayors for advice on innovation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More news, analysis and features at China Watch Nine city mayors from the United States’ Silicon Valley region arrived in Chengdu on July 12 to speak with local officials keen to learn from their experiences in promoting innovation. Catherine Carlton, mayor of Menlo Park in California, said innovation and start-up businesses in the Silicon Valley region were supported by the government, enterprises and universities, and that the interaction of this triangle generated a joint driving force. This group also communicated with hi-tech enterprises in the European Union every three months to keep abreast of cutting-edge developments in science and technology, she said. Jeff Gee, mayor of Redwood City, added that he was impressed during the visit and hoped Chengdu can strengthen education exchanges with his city. Hi-tech, low-carbon technology and tourism help to support major industries in California... Raymond Greene, the United States consul-general in Chengdu, said the United States had paid special attention to the investment opportunities in Chengdu and is working to strengthen co-operation in education and research and development enterprises. The Silicon Valley mayors and Chengdu leaders signed an international incubator agreement aimed at transforming the will to strengthen co-operation in areas of hi-tech and innovation into concrete projects in the next five years. Hi-tech, low-carbon technology and tourism help to support major industries in California and in Chengdu, said Brian Peck, head of the delegation. He said he hoped the new agreement, which will intensify communication between governments, universities and enterprises, would help the two sides. David Haubert, mayor of the California city of Dublin, said innovation had no borders, and he called for more co-operation with Chengdu in terms of technology transformation. [Chengdu's] private business boom highlights the vitality of the city’s economy According to the city government, Chengdu saw 116,312 new businesses register in the first half of this year, up 34 per cent year-on-year and 19.3 percentage points higher than the national average. The start-ups brought with them 360 billion yuan (£3.6 billion) in registered capital, 1.42 times the same period last year and nearly twice the national average. By the end of June, there were 1.14 million registered market entities in Chengdu, meaning one in 10 Chengdu residents owned their business. According to the local government, this private business boom highlighted the vitality of the city’s economy. Chinese media reported that experts listed Chengdu as the city with the most favourable business environment in the country last year. The experts agreed that Chengdu was more than just giant pandas, spicy food and a leisurely lifestyle, but also a place nurtured by historic culture and rich in business opportunities. The city has plentiful talent resources, strong research abilities and broad market prospects According to the city’s business and trade promotion department, in the first four months of this year, Chengdu attracted 144.9 billion yuan in investment in 136 projects, making it one of the most popular investment destinations in China during that period. By late July, 265 of the world’s top 500 enterprises had set up branches in Chengdu, making it the third-largest destination in China for big global companies after Beijing and Shanghai. Attracted by Chengdu’s rich business opportunities and development potential, Dalian Wanda Group, China’s largest private property developer and the world’s largest cinema chain operator, announced in April that it would invest 102 billion yuan in Chengdu over the next five years. The investment will cover tourism, healthcare, e-commerce and modern city complexes. It would be the largest single investment to be made by a private company in a Chinese city. “The city has plentiful talent resources, strong research abilities and broad market prospects,” said Huang Zheng, a nucleic acid research expert in Chengdu. “The city is an ideal combination of industry, studies and research.” In the first quarter of this year, the city attracted 12 projects from the world’s top 500 corporations, including one from German chemical industry leader BASF. This article was originally produced and published by China Daily . • Read more about Chinese current affairs at China Watch", "external_links": [], "published": "2015-08-26T06:56:00.000+03:00", "crawled": "2015-08-26T02:24:25.211+03:00", "highlightTitle": ""}