{"organizations": [], "uuid": "d09256e4faea81b16a92c9b343c2d45a997270f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://www.seattlepi.com/lifestyle/travel/", "section_title": "Travel: Air, Land and Sea Guides and Resources - seattlepi.com", "url": "http://www.seattlepi.com/news/article/Las-Vegas-developer-proposes-casino-by-6437379.php", "country": "US", "title": "Las Vegas developer proposes casino by Indianapolis airport", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Las Vegas developer proposes casino by Indianapolis airport - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "d09256e4faea81b16a92c9b343c2d45a997270f7"}, "author": "seattlepi", "url": "http://www.seattlepi.com/news/article/Las-Vegas-developer-proposes-casino-by-6437379.php", "ord_in_thread": 0, "title": "Las Vegas developer proposes casino by Indianapolis airport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "INDIANAPOLIS (AP) — A Las Vegas-based casino developer has proposed a deal to Indiana and Indianapolis officials if they let Rising Sun Casino Resort move half of its 1,400 gambling tables to Marion County.\nIn exchange, Full House Resorts would build a $650 million upscale retail center anchored by a casino on a surplus parking lot near the old Indianapolis International Airport terminal. Full House Resorts announced the proposal on Monday. The company estimates that the facility would generate $85 million each year in state and local revenues, create 4,000 permanent jobs and attract at least 10 million visitors annually.\n\"We can build something here, at the Crossroads of America, that doesn't exist anywhere else. We can build a place that will add to the appeal of Indianapolis, make the city proud, and attract both Indiana residents and visitors,\" said Daniel R. Lee , CEO of Full House Resorts. \"Given the adjacency of the airport, we expect the center to attract people from throughout the country to an experience that is part Indianapolis, part Las Vegas, and 100 percent unique.\"\nThe company said state legislators would have to approve the move of its gambling tables to another county. But lawmakers have previously been apprehensive to expand casino gambling in Indianapolis.\n\"It is ludicrous to believe the legislature would permit the holder of a gaming license to 'divide up' its license and operate from different locations, when a proposal to move one of the Gary riverboats was specifically rejected by the legislative study committee just last summer,\" Centaur Gaming said in a statement in response to the proposal.\nRepublican state Rep. Bob Behning of Indianapolis, whose district includes the airport, said he doesn't think the General Assembly would be willing to accept the deal with Full House. This year, the two existing horse racing tracks with live betting and in-house casinos in the Indianapolis area lobbied for adding live dealers at their gambling tables, but lawmakers won't allow the change to happen until 2021.\n\"I think they have problems before it even gets started,\" Behning said of the airport casino proposal.\nFull House's proposal is the first serious attempt in several years to bring a new gambling operation to Indiana's largest city. The last proposal was made about a decade ago under then-Mayor Bart Peterson .\nGov. Mike Pence has repeatedly said he opposes the expansion of gambling in Indiana, but it's unclear whether the airport casino proposal would qualify as an expansion.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-12T08:33:16.322+03:00", "highlightTitle": ""}