{"organizations": ["Postmedia News"], "uuid": "c6d0c02659bab4e779fb4063430f7797a3feec87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestarphoenix.com", "main_image": "http://www.thestarphoenix.com/cms/binary/11273402.jpg", "site_section": "http://rss.canada.com/get/?F7888", "section_title": "The StarPhoenix - Travel", "url": "http://www.thestarphoenix.com/travel/Solo+trip+personal+test/11273388/story.html", "country": "CA", "title": "Solo trip on a forty-day European tour a personal test", "performance_score": 0, "site": "thestarphoenix.com", "participants_count": 0, "title_full": "Solo trip on a forty-day European tour a personal test", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T17:19:00.000+03:00", "replies_count": 0, "uuid": "c6d0c02659bab4e779fb4063430f7797a3feec87"}, "author": "", "url": "http://www.thestarphoenix.com/travel/Solo+trip+personal+test/11273388/story.html", "ord_in_thread": 0, "title": "Solo trip on a forty-day European tour a personal test", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Carissa Greenlees"], "text": "By Carissa Greenlees, Postmedia News \nIt’s been said that travelling alone is something you should do at least once in your lifetime. It tests you, pushes you past your comfort zone and in doing so helps you become more well-rounded and worldly. \nI recently returned from a 40-day solo trip, which included stops in Iceland , Scotland and Ireland . This trip presented many ‘firsts’ for me: first cross-Atlantic flight, first time travelling alone, first time staying in hostels and first time being away from family and friends for more than a week. It was after much planning and second guessing that with a travel agent’s assistance, I booked my flights, hostels and day tours in preparation for a trip that would celebrate my graduation from six years of university and the start of my life in the work world. \nI departed from Vancouver airport afraid of the unknown, getting lost, and being alone for such a long time. A couple of flights later, I made it swiftly and safely to my first destination: Reykjavik . To say the island of Iceland is breathtaking is an understatement. I haven’t travelled far in my short lifetime but I’ve been to enough places to know that Iceland is special. Growing up I always had a passion for rocks, volcanoes and geology, so I jumped at the chance to take advantage of the “My Stopover” campaign that Icelandair is using to promote tourism. I stopped in Iceland twice during my trip. Once on my way to the UK and once coming home, equating to a total of seven days on the island. These days were spent taking in the scenery on day tours to the South Coast, around the Golden Circle , riding Icelandic horses through the fields and the highlight of the trip: going “ Inside the Volcano ” at Thrihnukagigur Volcano . No words can express how beautiful and untouched Iceland truly is. \nMy time in the UK and Ireland took up most of my trip and was filled with many exciting experiences including spending four and a half hours exploring the inner workings of Edinburgh Castle . Many jam-packed days were spent touring the Highlands, stopping in Oban, Inverary, Inverness, St. Andrew’s and jumping into Loch Ness with my Contiki tour . Believe me, it was cold.", "external_links": [], "published": "2015-08-07T17:19:00.000+03:00", "crawled": "2015-08-07T18:30:19.025+03:00", "highlightTitle": ""}