{"organizations": [], "uuid": "247b6a6222ea0a3b350e03997388b4dfa37a2e27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02674/students-in-room_2674470k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-06.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/education/universityeducation/clearing/11741945/Clearing-2015-guide-to-last-minute-accommodation.html", "country": "US", "title": "Clearing 2015: guide to last minute accommodation", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Clearing 2015: guide to last minute accommodation - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T15:00:00.000+03:00", "replies_count": 1, "uuid": "14cab67a761a26f0cd907c7ff4712f33009922ea"}, "author": "James Connington", "url": "http://www.telegraph.co.uk/education/universityeducation/clearing/11741945/Clearing-2015-guide-to-last-minute-accommodation.html#post-0", "ord_in_thread": 0, "title": "Clearing 2015: guide to last minute accommodation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After the initial flurry of research, phone calls and deliberating involved in obtaining a university place through Ucas Clearing , it might be tempting to sit back and relax. However, there’s still one more hurdle to cross before you can completely chill out: securing somewhere to live. Luckily for you, there are a myriad of ways in which you can solve the accommodation problem, none of which involve entering crisis mode. From useful websites and potential living options, to what your new found university can do to help, we talk you through how to go about finding last minute accommodation. • Download the Telegraph's Clearing app for iPhone and Android 1. I’ve got a Clearing place, I have nowhere to live, I’m panicking, what should I do first? First of all (and I realise it’s a cliché), stay calm. A few hours ago you didn’t even know if you would be going to university this year, if your biggest worry now is finding a place to live for first year, you’re doing just fine. Next, get yourself organised, draw up a list of basic (and reasonable requirements), set yourself a budget and try to discuss it with your parents before launching headlong into a search, or committing to that luxury studio flat you really can’t afford. Reasonable expectations are key; every student makes compromises with accommodation, and you might have to be that bit more flexible when looking at the last minute. Doors, smoke alarms, a functioning shower: all reasonable expectations. A wet room, tumble drier, and 100m walk to university, not so much. Above all else, never hand over any money before you have seen a property – unless it’s a university run hall – and always ensure you read every word of a contract before signing (no matter how tedious that may be). 2. Will my newly adopted university be able to help me out? All universities should be able to help you out in some way or form, but the degree of assistance will vary massively by institution. Get in touch with your university’s housing service, who should be able to help you with anything ranging from finding accommodation to helping make sense of a contract. You don’t have to struggle through the process by yourself, these services exist to help and you should be taking full advantage of them, especially as you’re about to become a fully paid up student. Some universities do guarantee a spot for Clearing students in university owned accommodation, or accommodation with a partner/nominated supplier, so have a check. The University of Sheffield and University of Aberystwyth guarantee you a roof over your head as long as you accept a place and apply for accommodation by August 31. The University of Surrey offer a similar guarantee, except the deadline is August 25, and a variety of other universities offer similar options, or will help you find somewhere to live if they can’t directly provide you with accommodation. 3. Will my life be over if I don’t get a place in halls? Before going to university, it might seem like your social life will be all but over if you don’t get a place in halls, which is not the case in any way, shape or form. You have your course, sports teams and any other societies you might care to join to make friends, and you can avoid the drama, sticky carpets and passive aggressive post-it notes that living in halls entails. University accommodation at the University of East Anglia (UEA) You have a number of options to explore beyond the realms of the university hall: • Flat/house share: You’re not the only one who has got in through Clearing, so take to social media and forum websites like the Student Room and track down anyone out there in a similar position who might be willing to team up. Alternatively, you might find an existing group of non-fresher’s who need to fill a spot. You were prepared to live with strangers in halls, so it’s not too big a step, and you’ll actually be able to meet people before deciding to live with them for a year. • Become a lodger: Choosing to take up a spare room in someone’s house as a lodger has some major benefits. You’re likely to get better value for money, a sense of normality to come home to and somewhere peaceful when you want it. You will need to bear in mind that you’re living in someone’s house, so you wont be hosting any parties (you wont be cleaning up after them either), and if you crave the halls experience then this may not be for you. • Private halls: Private halls are usually very expensive but offer many of the advantages of university run halls, but with nicer surroundings and less craziness. If money is not a problem then these should probably be your first port of call, but for those on a tighter budget they may be a last resort. 4. Where are the best places to research online? Of course you should get in touch with your university's housing service to start with, but here are some other websites and links to help you out if they can't get things sorted. Lettings websites: • SpareRoom : A website dedicated to matching people in need of a place to live with those in need of someone to fill a room. • StuRents : Lets you browse thousands of student houses and halls, house hunt as a group and even manage bills/expenses with housemates, perfect if you’ve just teamed up with an unknown group. • Rightmove Students : The student dedicated branch of the property search website Rightmove. Useful for finding student housing close to campus, with the pricing all listed as per person, per week. • Zoopla : A website listing properties for rent, one of the places to turn to if you manage to get a group of people together to rent somewhere. • Gumtree : Classified ads site Gumtree lists many rental options, but as with all websites where anyone can post an advert, it’s best to be cautious. • Accommodation for students : A student dedicated site listing available accommodation with prices per person, per week. Private halls: • The Student Housing Company • CRM Students • Unite Students • iQ Student Accommodation • My Student Halls For those in London there are a number of other private companies such as Urbanest and Pure . 5. What if I don’t like any of the choices available to me? To be brutally honest, you’re going to have to get over it. Unless you have a practically unlimited budget, student living is always an exercise in compromise. You have to balance practicality, quality and the potential to have fun, all whilst staying within your financial means. You’re not going to have it all, but as long as you tick a couple of your most important boxes, you will still have an amazing time. Remember that it’s only your first year, you’re not going to be there forever and you will regret getting hung up on accommodation far more than just getting on with it and enjoying your university experience in whatever form it comes. telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-08-06T15:00:00.000+03:00", "crawled": "2015-08-06T15:48:46.966+03:00", "highlightTitle": ""}