{"organizations": ["Sydney Opera House", "Daily Telegraph"], "uuid": "f33521dc35afd16ef5deed7ab139d94b257d96ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/1yOGY2djohBxdQDN484A8vPIdE145Axq/3Gduepif0T1UGY8H4xMDoxOjBtO_wVGe&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://feeds.news.com.au/public/rss/2.0/trav_top_stories_288.xml", "section_title": "NEWS.com.au | Travel | Top Stories", "url": "http://www.news.com.au/travel/travel-updates/federal-government-criticised-as-it-risks-falling-behind-other-countries-wooing-chinese-visitors/story-e6frfq80-1227468432151?from=public_rss", "country": "IL", "title": "More needed to woo Chinese visitors", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "More needed to woo Chinese visitors", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T15:00:00.000+03:00", "replies_count": 0, "uuid": "f33521dc35afd16ef5deed7ab139d94b257d96ec"}, "author": "", "url": "http://www.news.com.au/travel/travel-updates/federal-government-criticised-as-it-risks-falling-behind-other-countries-wooing-chinese-visitors/story-e6frfq80-1227468432151?from=public_rss", "ord_in_thread": 0, "title": "More needed to woo Chinese visitors", "locations": ["Sydney Harbour Bridge", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A new film by Tourism Australia is set to show people the diversity of Aboriginal experiences in this country. Daily Telegraph 13 Jul 2015 News Chinese tourists take pictures with the backdrop of the Sydney Opera House and Sydney Harbour Bridge and a huge Great White Shark replica shark at Mrs Macquarie’s Chair. Picture: Bradley Hunter Source: News Limited \nAUSTRALIA risks being left behind in the “arm’s race” for Chinese visitors who are being wooed with wok burners at campsites in New Zealand and free entry into Indonesia \nThe US has installed a high-level committee to look at ways to improve the “entry experience” for Chinese travellers, which are tipped to number more than 200 million by 2020. \nIn contrast, Australia is charging $1000 for a 10-year multi-trip visa and demanding prospective visitors fill out 15-page questionnaires in English. \nCHINESE BUSINESMAN ‘BUYS’ $5M VISA TO LIVE IN VICTORIA Chinese tourists are becoming big business for caravan parks in Australia. Picture: BIG4 / Kit Haselden Photography Source: Supplied \nTourism and Transport Forum CEO Margy Osmond told the CAPA Aviation Summit in Sydney on Monday, the government was only thinking of short term financial gain rather than the long term economic benefit of the Chinese visitor market . \n“We need to say ‘welcome’ in a much more significant way,” said Ms Osmond. \nAnother area where improvement was needed were national park and campsite facilities, where many Chinese visitors were headed. \nLast year, Chinese tourists represented the second biggest market for Big4 which operates 180 caravan parks across Australia. \nIn response, car rental companies Britz and Maui are providing DVDs in Mandarin to help Chinese tourists drive large vehicles down under. \nBut Ms Osmond said governments were letting down the team — with the exception of Tasmania. \n“Governments across mainland Australia can and should be doing a lot more to enhance the visitor experience in our natural areas and national parks,” said Ms Osmond. \n“Tasmania has recently taken the lead in this field by encouraging the development of sustainable eco-tourism infrastructure in its national parks and world heritage areas. \n“By investing in tourism infrastructure we can attract more visitors to our natural areas, particularly Chinese tourists who are looking for more unique, authentic Australian experiences.” Chinese tourists enjoy holding a koala at Dreamworld on Queensland’s Gold Coast. Picture: Luke Marsden. Source: News Limited \nShe said even facilities as basic as toilets and showers were lacking at some camping grounds. \n“In New Zealand they determined to deliver visitors the best and most comfortable experience possible, going as far as rolling out wok burners in their caravan parks,” she said. \nAustralia ranked 15th on the list of most visited countries by Chinese travellers last year, behind the US, Indonesia, Thailand and South Korea. \nSydney Airport CEO Kerrie Mather confirmed the strong competition for Chinese visitors particularly from the US. \n“It’s an arms race for tourism,” Ms Mather said.", "external_links": [], "published": "2015-08-03T15:00:00.000+03:00", "crawled": "2015-08-04T05:24:45.817+03:00", "highlightTitle": ""}