{"organizations": [], "uuid": "0cd4be0d1528447f1922602fae184487b82388d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/Kigali.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS Archives - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/car-free-zone-implemented-in-kigali/", "country": "US", "title": "‘Car Free Zone’ Implemented in KigaliTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "‘Car Free Zone’ Implemented in KigaliTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "0cd4be0d1528447f1922602fae184487b82388d1"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/car-free-zone-implemented-in-kigali/", "ord_in_thread": 0, "title": "‘Car Free Zone’ Implemented in KigaliTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "‘Car Free Zone’ Implemented in Kigali Published on : Thursday, August 27, 2015\nEffective August 24, no vehicles will be allowed in the heart of Rwanda’s capital Kigali, widely regarded as the cleanest city in Africa.All vehicles, other than special services vehicles such as ambulances, are prohibited in the streets of the declared ‘Car-Free Zone.’\n“Normally, a city is for people, not vehicles,” said Luben Ahimbissibwe, director of infrastructure in the city. “We want to turn Kigali into a pedestrian-friendly city.” The decision affecting some streets in the rapidly-growing city of 1.1 million residents has been gazetted. However, the implementation will be carried out progressively, street by street , eventually covering several areas of the city. Over the past years, all buildings have been required to to prepare for the ‘Car-Free Zone.’ By providing underground packing facilities.\nAhimbisibwe told KT Press that the decision to do away with city traffic “is to promote green transport and sustainability in the city.”Rest posts with free WiFi Internet services for pedestrians will be provided within the zones, so that people will not be walking for more than 500 meters.\nMobility in Kigali has been a priority in the last 15 years. The city set out to connect all suburbs with tarmac roads and drainages. Old-fashioned mini-buses were eliminated and three local bus companies were awarded 5-year contracts to transport more than 500,000 commuters every day.\nThe companies have the obligation to ensure that city commuters do not spend more than 10 minutes at bus stage during rush hours. “We want all passengers to make use of public transport, instead of spending heavily on cabs,” explained City Mayor, Fidele Ndayisaba.\nEventually, the central government intends to roll out the public transport model across the nation. Asian automobile companies Hyundai Youtong have supplied 800 new buses.\nSource:-APTA", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-27T16:21:24.588+03:00", "highlightTitle": ""}