{"organizations": [], "uuid": "31055eab088a69f64775ad9e430f68d2250107b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29899995/jin-jiang-international-hotels-to-hold-roadshow-in-japan-in-october", "country": "US", "title": "Jin Jiang International Hotels to hold roadshow in Japan in October", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Jin Jiang International Hotels to hold roadshow in Japan in October - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "31055eab088a69f64775ad9e430f68d2250107b5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29899995/jin-jiang-international-hotels-to-hold-roadshow-in-japan-in-october", "ord_in_thread": 0, "title": "Jin Jiang International Hotels to hold roadshow in Japan in October", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Jin Jiang International Hotel Management Co. Ltd.\nSHANGHAI , Aug. 28, 2015 /PRNewswire/ -- Jin Jiang International Hotels plans to hold the 2015 roadshow in Japan between October 15th and 17th , in a move to enhance the visibility of the brands owned by Jin Jiang International Hotels and Prince Hotels, Inc., and mutually leverage the platform and the many advantages that each party has in their respective local markets. The move represents material progress in establishing a marketing alliance between the two parties.\nJin Jiang International Hotels and Prince Hotels signed a memorandum of understanding in June, under which, the two hotel groups will form a marketing alliance to collaborate on joint promotions and undertake other business exchanges, as well as improve brand awareness and market share by leveraging each other's reputation, expertise and marketing network in the key customer markets identified by both groups. Mr. Simon Zhang , Chief Executive Officer at Jin Jiang International Hotels, said that the mutual benefits derived from forming an alliance and establishing a partnership with Prince Hotels will allow Jin Jiang International Hotels to further expand its international marketing network and to provide customers with more options and convenience, addressing the growing demand for casual and business travel in the Asian market.\nPrince Hotels, Inc. with its three main brands, The Prince, Grand Prince Hotel and Prince Hotel, is one of Japan's leading hotel and leisure companies and operates 41 hotel facilities in Japan's largest cities and leading holiday resorts, including Tokyo , Kyoto , Hiroshima , Hakone, Karuizawa, Sapporo and Furano. The hotel group holds the largest market share in the Japanese hospitality sector.\nJin Jiang International Hotels expects to capitalize on the extensive visibility of Prince Hotel in the Japanese local market through the roadshow, and, by doing so, win more face to face negotiation opportunities and enhance cooperation with Japanese firms through promotional events and onsite visits with potential business partners. This event is expected to further expand the brand awareness and visibility of Jin Jiang International Hotels in the Japanese market.\nIn recent years, the increasing number of exchanges between Chinese and Japanese firms serving the business and leisure travel segments has created more opportunities for Jin Jiang International Hotels as the hotel group expands in the Japanese market. Mr. William Cai , Director Marketing & Sales at Jin Jiang International Hotels said that member hotels including Jin Jiang Hotel, Jin Jiang Tower , Hua Ting Hotel & Towers, Jian Guo Hotel, Rainbow Hotel, Park Hotel, Shanghai Hotel and Haiyun Jin Jiang International Hotel swill participate in the event.\nAbout Jin Jiang International Hotel Management Company Ltd.\nJin Jiang International Hotel Management Company Ltd. (Jin Jiang International Hotels) has a portfolio of over 120 distinctive star rated hotels with a room inventory of over 35, 000 hotel rooms spread across 76 cities in China . Under the Jin Jiang branding concept, the company has a new premium \"J\" hotel brand, five star luxury properties and four star business properties.\nJin Jiang International Holdings Company Ltd. (\"Jin Jiang\" or the \"Group\"), is China's premier hospitality conglomerate, owner, developer and operator of hotels across all market segments. The Group manages, through its wholly owned subsidiary Jin Jiang International Hotel Management Company Ltd., the entire portfolio of owned and/or operated four and five-star hotels and its sister company Jin Jiang Inn which focuses on budget hotels. Jin Jiang International Hotels (Group) Company Ltd. is the leading operator and manager of hotels in China . Overall, the Group owns and operates a collection of over 1,767 hotels globally, and has a total room inventory in excess of 258, 000. Amongst them, 1,339 distinctive hotels and inns are located in more than 310 cities and towns within 31 provinces, autonomous regions and municipalities across China .\nEvery Jin Jiang hotel is a memorable reflection of its destination's unique style and culture. Jin Jiang International Hotels, with its qualified hotel management background and passion for excellence, dedicates itself to offering reputable hospitality services to its valued customers. With experience originating from the 1920s, its core competitiveness has accelerated in recent years. Together, the professional corporate and hotel management teams have extensive international hospitality experiences and backgrounds. This renowned company is rapidly growing and continues to strengthen and build its brand presence in China in addition to building into a strong internationally known brand.\nFor more information or reservations, please visit: www.jinjianghotels.com\nPhoto: http://photos.prnasia.com/prnh/20150828/0861508052-b\n releases/jin-jiang-international-hotels-to-hold-roadshow-in-japan-in-october-300134584.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.jinjianghotels.com/", "http://www.prnewswire.com/news-releases/jin-jiang-international-hotels-to-hold-roadshow-in-japan-in-october-300134584.html", "http://photos.prnasia.com/prnh/20150828/0861508052-b", "http://rt.prnewswire.com/rt.gif?NewsItemId=CN88854&Transmission_Id=201508280407PR_NEWS_USPR_____CN88854&DateId=20150828"], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-28T13:56:25.100+03:00", "highlightTitle": ""}