{"organizations": ["Fallingwater", "Fallingwater Travel AP"], "uuid": "8d0023232f62f0e6af0338d615d9b97ac2a65fdc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/08/07/fallingwater-art-got12rn8f-1falling-fallingwater-3-jpg.jpg", "site_section": "http://www.dispatch.com/content/syndication/lae_travel.xml", "section_title": "The Columbus Dispatch Travel Feed", "url": "http://www.dispatch.com/content/stories/travel/2015/08/09/1-secret-garden-has-been-restored-to-former-splendor-at-fallingwater.html", "country": "US", "title": "‘Secret garden’ has been restored to former splendor at Fallingwater", "performance_score": 0, "site": "dispatch.com", "participants_count": 0, "title_full": "‘Secret garden’ has been restored to former splendor at Fallingwater", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T12:00:00.000+03:00", "replies_count": 0, "uuid": "8d0023232f62f0e6af0338d615d9b97ac2a65fdc"}, "author": "", "url": "http://www.dispatch.com/content/stories/travel/2015/08/09/1-secret-garden-has-been-restored-to-former-splendor-at-fallingwater.html", "ord_in_thread": 0, "title": "‘Secret garden’ has been restored to former splendor at Fallingwater", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Doug Oster"], "text": "‘Secret garden’ has been restored to former splendor at Fallingwater Travel AP file photo Fallingwater visitors can see the Pottery Terrace planter as it used to look but only by request. By Doug Oster PITTSBURGH POST-GAZETTE • Sunday August 9, 2015 5:00 AM \nMILL RUN, Pa. — Eric Kobal stretches across a lush planter to examine a brown leaf on a rhododendron he planted in this garden on the Pottery Terrace at Fallingwater. The sound of running water is never far away. \nFor three years, Kobal has been leading tours of the 79-year-old house designed by Frank Lloyd Wright for the Kaufmann department store family. In October, he began a special project as a landscape volunteer. \nThe 5-square-foot Pottery Terrace planter is in an area that isn’t on the tour but can be seen by request. \nIt’s where the Kaufmanns stored their pots for the winter. \nThis “secret garden” was in bad shape after a recent construction project at the house. Workers had trampled some of the few plants that had limped along through the past several years. \nNothing grew well, and when Kobal took a close look at the planter, all he saw was water, mud, soil and a lot of large rocks. His goal was to bring the space back to its former glory. \nWith the help of horticulture specialist Ann Talarek, the two combed the archives for pictures of the garden. \n“We knew there were rhododendron, moss and boulders,” she said, “but all the old photos were grainy and hard to see. It wasn’t a very prominent garden in any of the historic photos.” \nKobal created a plan that included the two plants known to have been in the garden plus native varieties. \nWhile excavating the planter, he was surprised by the large rocks found under the soil. \n“It was like a jigsaw puzzle,” he said. “Dozens of these boulders were up here, and we don’t even know why.” \nAnother unexpected find was the depth of the planter. \nThe Fallingwater staff thought it was only a couple of inches, but after taking everything out of the garden, Kobal discovered it was 7 to 8 inches deep, with a deeper trench in the middle. \nThe trench was filled with aggregate for drainage, and good soil was brought in from nearby Lower Bear Run. \nThen came the fun part. Kobal was able to realize his plan by finding the native plants on the Fallingwater property. \nThe small planter was packed with trilliums, may apples, rhododendrons, sedums, mosses, three species of violets, black cohosh, marginal wood ferns, partridgeberry and Virginia creeper. The latter will hang over the edges when mature, greeting visitors who look up at the planter as they enter the house. In fall, the vines turn brilliant red, which will make the garden a focal point. \nKobal kept some of the rocks in the design to add texture. Green moss, harvested from the woodlands, is already growing on them. \n“Not many people make it to the Pottery Terrace,” Kobal said. “They don’t even know they can come here. \n“I think it just speaks to the site,” he said. “Seeing this, they understand Fallingwater, they understand the grounds. It’s a microcosm of the site.” \nThe experience as a volunteer at Fallingwater has inspired Kobal to become a landscape architect. He will head to Washington University in St. Louis for his master’s degree on a scholarship, partly because of his work at Fallingwater.", "external_links": [], "published": "2015-08-09T12:00:00.000+03:00", "crawled": "2015-08-09T13:55:36.697+03:00", "highlightTitle": ""}