{"organizations": [], "uuid": "a7abdc0d1f8b4743062acd5f45c29cee485d1a87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/063_479984100-e1440454705148.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/08/24/la-sele-fills-coaching-staff-alejandro-larrea", "country": "US", "title": "La Sele fills out coaching staff with Uruguayan Alejandro Larrea", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "La Sele fills out coaching staff with Uruguayan Alejandro Larrea -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T06:56:00.000+03:00", "replies_count": 0, "uuid": "a7abdc0d1f8b4743062acd5f45c29cee485d1a87"}, "author": "Michael Krumholtz", "url": "http://www.ticotimes.net/2015/08/24/la-sele-fills-coaching-staff-alejandro-larrea", "ord_in_thread": 0, "title": "La Sele fills out coaching staff with Uruguayan Alejandro Larrea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With some final hires, the revolving door at the Costa Rican Football Federation (FEDEFUTBOL) may have finally come to a close for the time being. Federation officials announced the hiring of Alejandro Larrea as the third assistant on Oscar Ramírez’s coaching staff Monday afternoon.\nThe Uruguayan played alongside Ramírez at the national club Saprissa before later joining his coaching staff at Santos de Guápiles. When welcomed in as Ramírez’s right-hand man, Larrea was complimentary of his new boss, who was officially named “La Sele’s” head coach on Tuesday .\n“It’s a pleasure to work with Oscar again,” Larrea said in a FEDEFUTBOL news release. “I know all about his ability and professionalism, we always had a great relationship when we were teammates and then later when we worked together. To me, he’s one of the best coaches that Costa Rica has.”\nThe new assistant’s contract runs until the 2018 World Cup in Russia, new FEDEFUTBOL president Rodolfo Villalobos said. Villalobos was appointed to his position at the head of Costa Rican football on Thursday.\nLarrea will join bench alongside fellow assistant Luis Marín and goalkeeping coach Luis Gabelo Conejo, two former national team players who played for and alongside Ramírez before. The new-look staff has just two weeks to prepare for its first test, a Sept. 5 friendly against Brazil in New Jersey. Three days later, they’ll be back home to take on another world power, Uruguay, at the National Stadium in San José.\n“We’re always going to have a winner’s mentality but in these friendlies we have to focus more on the technical aspects,” he said. “The players have to be in good position, be coordinated and in good shape and be applying the things they’ve worked on.”\nThe federation also announced the hiring of new video coordinator Keylor Reyes, who was handpicked by Ramírez to prepare and edit game tape for the coaching staff.\nFollowing the indictment and arrest of former FEDEFUTBOL president Eduardo Li in Switzerland in late May and the recent resignation of Paulo Wanchope , the federation finally appears to have reached stable footing with the new hires.\nRamírez and the staff are expected to announce their first lineup for the Brazil and Uruguay friendlies this Thursday.", "external_links": [], "published": "2015-08-25T06:56:00.000+03:00", "crawled": "2015-08-25T03:04:48.415+03:00", "highlightTitle": ""}