{"organizations": [], "uuid": "2e278ec51b0bfd64d5b8e86a24cb2deb5fabc07c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/download18-300x100.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mobile-airport-authority-announces-dedication-of-matthew-s-metcalfe-concourse/", "country": "US", "title": "Mobile Airport Authority Announces Dedication of Matthew S. Metcalfe ConcourseTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Mobile Airport Authority Announces Dedication of Matthew S. Metcalfe ConcourseTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "2e278ec51b0bfd64d5b8e86a24cb2deb5fabc07c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mobile-airport-authority-announces-dedication-of-matthew-s-metcalfe-concourse/", "ord_in_thread": 0, "title": "Mobile Airport Authority Announces Dedication of Matthew S. Metcalfe ConcourseTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mobile Airport Authority Announces Dedication of Matthew S. Metcalfe Concourse\nMobile Airport Authority dedicated it’s concourse in honor of retired board member, now director emeritus, Matthew S. Metcalfe. Mr. Metcalfe’s 35 years of service to the Airport Authority began at its inception in the late 1970’s and continued until his retirement in 2014. He began his tenure as a committee member and was vital in the formation of the Mobile Airport Authority when it separated from the City of Mobile. Mr. Metcalfe was elected to the Board at its inception in 1972 and served as Chairman from 1992 until 1999.\nDuring his time with the Airport Authority, he played an instrumental part in construction of the current terminal at Mobile Regional along with M. C. Farmer, the first chair of the Mobile Airport Authority Board of Directors, after whom the terminal building is named. For nearly 10 years, the two sought funding, negotiated with airlines and secured government support to make the vision for modern terminal a reality for the City of Mobile.\nMr. Metcalfe also played a major role in the re-development of the former U.S. Air Force Base at Brookley Field in downtown Mobile into a general aviation facility and industrial park. During his years on the Board he worked diligently in pursuit of economic development projects that would leverage the Aeroplex’s assets to the benefit of the community. He is very proud of tireless work to recruit and establish Airbus at the facility.\nRoger Wehner, Executive Director of Mobile Airport Authority stated, “Mr. Metcalfe’s leadership spans decades, there is not a part of the organization that he has not helped shape. His vision for the Airport was a byproduct of global perspective fostered by his endless wanderlust which drives him to every corner of the world still today. His commitment and tenacity for only the best for the Mobile Airport Authority was fueled by his love for his community and his desire to enable everyone to experience the hope, promise, and wonder of our diverse world he has been so blessed to experience.”\nSource:- Mobile Airport Authority", "external_links": [], "published": "2015-08-22T03:00:00.000+03:00", "crawled": "2015-08-23T05:00:31.628+03:00", "highlightTitle": ""}