{"organizations": [], "uuid": "4ca461374d6a4986e4ce53054084b78136c32961", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62596/air-new-zealand-and-all-blacks-make-out-world-men-black-safety-v", "country": "US", "title": "Air New Zealand and All Blacks make out of this world Men in Black safety video", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Air New Zealand and All Blacks make out of this world Men in Black safety video", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T05:45:00.000+03:00", "replies_count": 0, "uuid": "4ca461374d6a4986e4ce53054084b78136c32961"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62596/air-new-zealand-and-all-blacks-make-out-world-men-black-safety-v", "ord_in_thread": 0, "title": "Air New Zealand and All Blacks make out of this world Men in Black safety video", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Air New Zealand and All Blacks make out of this world Men in Black safety video   \nAug 14, 2015 Banners   \nLOS ANGELES, CA - Air New Zealand has teamed up with the All Blacks and an all-star line-up of international rugby greats to tackle the airline's latest on board safety video, Men in Black Safety Defenders. \nInspired by the Columbia Pictures global film franchise Men in Black, Air New Zealand's latest safety installment features All Black's Captain Richie McCaw and Dan Carter as Men in Black agents. Starring alongside the two long-serving All Blacks is Coach Steve Hansen, teammates Kieran Read, Keven Mealamu, Sam Whitelock and Israel Dagg who gets to test his vocals alongside Kiwi musician Stan Walker. \nAmerican actor Rip Torn reprises his role as Chief of the Men in Black with Wallabies great David Campese, former England Captain Martin Johnson and former Argentinean Captain Agustin Pichot making cameo appearances. \nThe video was created in collaboration with Sony Pictures Entertainment's Content Licensing group, with additional support from Sony Pictures Imageworks and Sony Pictures Entertainment's Archives & Collections. \n\"The creative concept and the parallels drawn between the All Blacks and the Men in Black are really clever. It's been exciting to help Air New Zealand bring the Men in Black universe to life in this unique way,\" says Emmanuelle Borde, Executive Vice President, Sony Pictures Entertainment. \nAir New Zealand Head of Global Brand Development Jodi Williams says the airline is Crazy About Rugby making the All Blacks the perfect partner for its latest safety offering. \n\"We recently extended our sponsorship of the All Blacks and New Zealand Rugby through until 2020 and thought what better way to celebrate than with a safety video.\" \n\"We've worked with the All Blacks on previous safety videos and thought it would be fun this time around to have them step into the shoes of the other highly trained Men in Black. The result is not only entertaining but makes people sit up and take notice of the key safety messages.\" \nAll Blacks Captain Richie McCaw says the players had a great time making the video. \n\"We had a lot of laughs on set and were blown away by Israel's hidden singing talent. If rugby doesn't work out for him he clearly has a promising career as a back-up singer.\" \nIsrael Dagg says growing up he was a huge fan of the Men in Black films. \n\"I grew up listening to the iconic Men in Black movie soundtrack song. Hopefully I've done it some justice.\" \nAustralian Wallabies great David Campese admitted his appearance in Men in Black Safety Defenders is likely to come at a cost. \n\"I'm expecting to get a right ribbing from my mates for appearing in a video promoting the All Blacks, Australia's key opponents. They'll never let me live it down.\" \nFormer Argentina Captain Agustin Pichot and Martin Johnson, former England Captain shared his sentiment. \n\"The All Blacks are staunch rivals of the Pumas making it especially fun to play the role of their nemesis in Air New Zealand's new safety video,\" says Mr. Pichot. \n\"I'm a big fan of Air New Zealand so was excited to get the call up to appear in the airline's latest inflight video. I'm sure English rugby fans will have a few words to say about my appearance alongside the All Blacks too,\" says Mr. Johnson. \nNew Zealand Rugby Chief Executive Officer Steve Tew says it's a big year for the All Blacks and with plenty of travel on the cards the team was keen to be involved in delivering the airline's safety briefing to fellow customers. \n\"Air New Zealand's been a long-time supporter of the All Blacks and New Zealand Rugby and has played a crucial role in connecting the team to fans across the globe through inventive and colorful marketing efforts such as Men in Black Safety Defenders.\" \nMen in Black Safety Defenders will be progressively rolled out across Air New Zealand's fleet from today.", "external_links": [], "published": "2015-08-14T05:45:00.000+03:00", "crawled": "2015-08-14T08:53:14.365+03:00", "highlightTitle": ""}