{"organizations": [], "uuid": "6dfd9c345a49fd8b529cabad813cb483bcdca028", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28213-jumeirah-group-appoints-ton-van-vilsteren-as-group-cfo", "country": "US", "title": "Jumeirah Group appoints Ton van Vilsteren as Group CFO", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Jumeirah Group appoints Ton van Vilsteren as Group CFO", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T16:45:00.000+03:00", "replies_count": 0, "uuid": "6dfd9c345a49fd8b529cabad813cb483bcdca028"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28213-jumeirah-group-appoints-ton-van-vilsteren-as-group-cfo", "ord_in_thread": 0, "title": "Jumeirah Group appoints Ton van Vilsteren as Group CFO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jumeirah Group appoints Ton van Vilsteren as Group CFO Jumeirah Group appoints Ton van Vilsteren as Group CFO Details Category: Appointments   14:45 Jumeirah Group, the Dubai-based luxury hotel company and a member of Dubai Holding, has appointed Ton van Vilsteren as its new Group Chief Financial Officer (CFO). He joins the company on 16 August 2015. Since graduating from Hotel School, The Hague, in the Netherlands in 1995, Ton van Vilsteren has worked his way up through the Hilton Group, starting as a Management Accountant with Ladbrokes PLC, which later became Hilton, and being promoted to international and global finance positions within the Hilton Group. \nSince 2007 Ton van Vilsteren has been Head of Finance, Asia Pacific, Hilton Worldwide, with overall responsibility for the accounting function and financial operations across all regional offices in Asia Pacific covering 158 trading hotels owned, managed and franchised by Hilton Worldwide, and a pipeline of hotels exceeding the number currently in operation. As well as sitting on the Boards of all Hilton companies and joint ventures across Asia Pacific, Ton van Vilsteren was a member of the Executive Committee with overall responsibility for the region’s financial delivery across 20 countries, driving performance analysis, financial reporting, budget formulation and trading forecasts. In his new role as Group CFO of Jumeirah Group, he will assume responsibility for the financial direction, control and management of the company, sit on the Executive Committee and report to President and Group CEO Gerald Lawless. Gerald Lawless said: “Jumeirah is entering another exciting point in its history. Not only do we have 23 hotels operating internationally today, but we have a robust pipeline of upcoming properties to open, especially in Asia, the Middle East and Europe. We welcome Ton warmly to Jumeirah and are delighted that he will help steer the company towards even greater financial success.” Related articles Chris Bailey promoted to Chief Operating Officer for Centara Hotels & Resorts Centara Hotels & Resorts, Thailand’s leading hotel group, has announced the promotion of Chris Bailey to Chief Operating Officer from Senior...", "external_links": [], "published": "2015-08-12T16:45:00.000+03:00", "crawled": "2015-08-12T16:55:26.704+03:00", "highlightTitle": ""}