{"organizations": [], "uuid": "be00a6c0f0d2cc28733de1722008a394f0ec2d32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn2.scmp.com/sites/default/files/styles/620x356/public/2015/08/17/b7333f83f9e25b1704e5ab04e184ed30.jpg?itok=vglVeoWr", "site_section": "http://www.scmp.com/rss/37/feed", "section_title": "South China Morning Post - Travel & Leisure feed", "url": "http://www.scmp.com/news/world/article/1850075/berlin-builds-new-cultural-centre-bid-set-new-parameters-21st-century", "country": "HK", "title": "Berlin builds new cultural centre in bid to set new parameters for the 21st century", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "Berlin builds new cultural centre in bid to set new parameters for the 21st century", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T21:45:00.000+03:00", "replies_count": 0, "uuid": "be00a6c0f0d2cc28733de1722008a394f0ec2d32"}, "author": "laura.ma@scmp.com", "url": "http://www.scmp.com/news/world/article/1850075/berlin-builds-new-cultural-centre-bid-set-new-parameters-21st-century", "ord_in_thread": 0, "title": "Berlin builds new cultural centre in bid to set new parameters for the 21st century", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order your FREE copy of AT YOUR SERVICE 2015 \nAdjacent to cultural landmarks on the world famous Museum Island in the heart of Berlin lies a massive white building under construction. An iconic dome atop a rectangular structure that evokes the aesthetics of the Prussian era can be seen from afar. The so-called castle in the making has been drawing many curious eyes. Lovers of culture from all over the world are expected to visit once it opens in 2019. \nWelcome to the Berliner Schloss, home of the Humboldt-Forum, a €600 million (HK$5.2 billion) project that is one of the biggest cultural endeavours currently under way in Europe. \nWith 160,000 square metres of gross floor space, the structure is set to become the centre of world culture and raise the international profile of Berlin. It will house more than half a million artefacts from outside Europe. Its proponents also hope it will bring the world together on a single stage for contemporary art and cultural activities. \n\"The Humboldt-Forum will not, however, be just a museum. It's not just an expansion of the Museum Island either. It is a museum space plus a place where other activities are held ... be they music, film, public debates and performances,\" says Professor Hermann Parzinger, president of Stiftung Preussischer Kulturbesitz (The Prussian Cultural Heritage Foundation) and Humboldt-Forum Management Committee chairman. \n\"We don't see the HumboldtForum as an isolated district. It's closely connected with the Museum Island,\" says Parzinger, who spearheads the project that is close to many existing cultural landmarks, such as the National Library, the German Historical Museum, the Alte Nationalgalerie, the Bode Museum and the Komische Oper Berlin. \n\"The whole centre of Berlin will become a cultural district ... It will also bring economic value to Berlin,\" he said. \nJust when many people in Hong Kong are questioning the spending of billions of dollars on the West Kowloon Cultural District, some of the world's first-tier cities are forging ahead in the culture game. They are racing against time to build the biggest possible cultural infrastructure to seal their status as a world cultural leader in the 21st century. \nAn expensive cultural project is also under way in Oslo, Norway. The Norwegian government is building a new national museum on the waterfront. It too is set to open in 2019. \nThe 5.3 billion kroner (HK$5 billion) museum will have a gross floor area of 54,000 square metres. Located next to the Nobel Peace Prize Centre, the museum will be linked to the iconic Opera House and the new Munch Museum in a traffic-free zone which will also feature new residential and office buildings. It is all part of an urban renewal project for the city that was home to modern art master Edvard Munch. \nGail Lord, co-president of Canada-based cultural consultancy Lord Cultural Resources, says building cultural districts is a global trend. She says the idea arose more than 30 years ago, but in the past it was only about consciously planning to gather institutions like museums and universities in the same area. \nBut as the world migrates to the knowledge economy, Lord says, cultural districts today play an increasingly important role in driving cities to move forward in the 21st century, both culturally and economically. \n\"Knowledge is a major source of wealth today, as opposed to industrial resources in the past,\" Lord says. \n\"Now the fundamentals of the economy have changed. Software, the intellectual component of the knowledge economy, requires face-to-face encounters, allowing all sectors to trade on knowledge. Today an institution such as M+ [the visual culture museum to open in West Kowloon in 2019] is an anchor, but it has to be planned with individuals in mind.\" \nShe says while cultural districts are a meeting place for education, recreation and communication, creating an environment that fosters the creation of new inventions, whether in arts, cultural creative works or even technology, is the key to success in the 21st century. \nIn the case of Berlin, Lord says the German capital, which was reunited only 25 years ago after the Berlin Wall came down, has the right ingredients. She says this is not just because the city already has a rich history and strong institutions. It is also, she says, because of its affordability, which makes it an attractive place for creative young minds. \nThe success of the future Humboldt-Forum will ride on the rich cultural soil of Berlin. \nParzinger says the vibrant contemporary art scene heralded by a young generation of artists living in Berlin gives the city great potential for further cultural development. \"But we also have this outstanding collection from the 18th and 19th centuries,\" Parzinger says. \nThe Berlin Schloss has a complicated history. The former royal palace during the Prussian empire was severely damaged during the second world war. It was demolished in 1950 to make way for the Palace of the Republic, which became the central state forum of pre-reunification East Germany. \nA decision was made in 2002 - 12 years after reunification - to resurrect the Berlin palace and turn it into the Humboldt-Forum, named after the brothers Wilhelm and Alexander von Humboldt, the 18th century intellectuals who left a major legacy in fields from geography to philosophy and linguistics. \nThe largest space in the new building will be devoted to some 500,000 pieces of non-European art currently housed in the Ethnological Museum and the Asian Art Museum in Berlin. The Chinese collection will take up a significant proportion of this space. It ranges from bronze works going back to the Shang dynasty to contemporary works by Ai Weiwei . \n\"On the one hand, there's a classical collection, modernisation and building of infrastructure. On the other there's young people's contemporary art. We try to connect them together, not just within the HumboldtForum, but throughout Germany as a whole,\" says Parzinger. \nIt all looks wonderful from the outside, but the project is not free from controversy. Beside the ongoing debate about whether the architecture and the collections revive colonialism, critics point out that the costly construction of the Humboldt-Forum is a manifestation of a cultural policy that favours institutions rather than individual activities. \nProfessor Wolfgang Schneider, who leads cultural policy studies at the University of Hildesheim in Germany, says Germany in theory has no national cultural policy. \nCultural matters are decided individually by each of the 16 states in Germany to avoid repeating the mistakes of the Nazi era, which was dominated by a centralised cultural policy. \nBut in recent years, says Schneider, a new kind of national cultural policy has emerged supported by a host state. \nSchneider says 90 per cent of the country's cultural budget goes to institutions. However, research shows that \"50 per cent of the population never goes to museums, theatres or any of these institutions which are labelled 'high culture',\" he says, adding that only 10 per cent of them are frequent visitors. \nSchneider says the country is becoming more multicultural, but such demographic changes are not being reflected in such institutions. \nAlthough there are lots of projects organised by civil society in an attempt to engage audiences, these programmes are not implemented within the framework of these institutions. \n\"So the critical debate about the Humboldt-Forum is why do we need another big institution? There are thousands of big institutions but the audience is insufficient. What is it for?\" asks Schneider. \n\"Of course it is a demonstration of the state, a demonstration of high culture and of how we would like to [be seen] again in the world.\" \nProfessor Helmut Anheier, president and dean at the Hertie School of Governance in Berlin, also questions the vision of the Humboldt-Forum. \n\"If it's a centre of world culture, it needs to be the world culture of today, not of the artefacts and ethnological museums of the 19th century,\" he says. \n\"A forum should be where people come for activities … If it's a forum, there is no such thing as a celebration of world culture. It needs to make the forum a local square dealing with diverse and conflicting issues.\" \nAnheier doubts if the addition of the Humboldt-Forum will successfully transform the centre of Berlin into a cultural district for the 21st century. \n\"What's missing in many cultural districts is how to invent a way to incorporate culture within the value chain, rather than just having museums and restaurants, which are at the end of the value chain,\" Anheier says. \nBut Parzinger is hopeful about the future success of the Humboldt-Forum. \"The exchange of objects and art [with international partners] will create a shared heritage. We want to fill the empty space of the dialogue.\" This article appeared in the South China Morning Post print edition as Cultural blooming Share", "external_links": [], "published": "2015-08-16T21:45:00.000+03:00", "crawled": "2015-08-16T21:53:29.281+03:00", "highlightTitle": ""}