{"organizations": [], "uuid": "12eb2f8bf5ffefe98c855b4f3d3ea77817b9b68c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canada.com", "main_image": "http://www.canada.com/cms/binary/11324125.jpg", "site_section": "http://rss.canada.com/get/?F178", "section_title": "canada.com Travel Picks", "url": "http://www.canada.com/travel/Exploring+Japanese+mangrove+forest+canoe/11324124/story.html", "country": "CA", "title": "Exploring a Japanese mangrove forest by canoe", "performance_score": 0, "site": "canada.com", "participants_count": 0, "title_full": "Exploring a Japanese mangrove forest by canoe", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T17:52:00.000+03:00", "replies_count": 0, "uuid": "12eb2f8bf5ffefe98c855b4f3d3ea77817b9b68c"}, "author": "", "url": "http://www.canada.com/travel/Exploring+Japanese+mangrove+forest+canoe/11324124/story.html", "ord_in_thread": 0, "title": "Exploring a Japanese mangrove forest by canoe", "locations": ["Washington", "Amami", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Exploring a Japanese mangrove forest by canoe By The Japan News/Yomiuri, Washington Post August 28, 2015 10:52 AM Canoeists paddle through a mangrove forest in Amami, Japan. \nAMAMI, Japan — On the east coast of Amami-Oshima island in Kagoshima Prefecture, I took an about 90-minute canoe tour to explore a mangrove forest in the Sumiyocho district of Amami. \n“This is a good tide,” said guide Kazuhisa Saijo, 53, pointing upstream as I boarded a canoe from a dock at the river mouth. My hobby is canoeing and luckily Saijo said we could go to a waterway that is passable only at full tide. \nSeven tour participants started paddling their one-person canoes. We moved ahead while looking at a mangrove forest on the banks of the river. One of the attractions of canoeing is that the paddler’s eye level is closer to the surface of the water than on a ship, making you feel like a part of nature. \nEvery tree in the mangrove forest grows in marshes, so these trees take firm root in the soil, with their roots spreading like an octopus’ legs. Even during stormy seas, it’s quiet in the forest, according to Saijo. \n“There is no tree named mangrove,” Saijo explained. Mangrove actually refers to trees growing in brackish-water regions, where fresh and salt water are mixed. Around the mouths of the Sumiyogawa and Yakugachigawa rivers, trees grow in clusters on about 71 hectares (175 acres) of land. \nThis is Japan’s second largest mangrove forest, following that on Iriomote Island in Okinawa Prefecture. \nWe came to the waterway we’d been headed for. It was just one meter wide and I was almost sent back by the reverse flow. It was a challenging but exciting spot. \nA native of Amami, Saijo went to college in Fukuoka Prefecture, when he again felt attached to the environment of the island. After working for a tourist association in the city, he established a tour company with a friend in 1998. \nThe Amami region was once ruled by the Ryukyu Kingdom, and later became a directly controlled territory of the Satsuma domain. Shimauta – the traditional folk music of the region and Okinawa featuring tremolo and falsetto – is said to have emerged from the wails of the people at a time when heavy taxation was implemented in the region. The taxation was called “kokuto jigoku (hell of kokuto brown sugar),” reflecting the fact that annual taxes in the region were then paid in kokuto brown sugar. \nWith such a history behind it, the Amami region has been attracting attention recently as a unique area distinguished from other parts of the nation, including Okinawa. Last year, Japan’s budget airline Vanilla Air launched a service between Narita Airport and Amami-Oshima island, invigorating the island. \nA Kandelia obovate seed that looked like a fishing float was bobbing on the water’s surface. The seed drifts with the tide to enter the nesting hole of a crab and then come into bud. “That’s the curious wisdom of plants,” Saijo said. From the forest I could hear songs of a ryukyu ruddy kingfisher, a migratory bird spending the summer in the region. \nCanoe tours of the Kanko Network Amami depart from and arrive at the company’s office in the central part of Amami, and participants are asked to call (0997) 54-4991 to make reservations in Japanese by the day before their excursion. \nThe tour costs 5,700 yen (USD$47) for an adult and 4,600 yen for a primary school student. Depending on the tide, the tour will start in the morning or in the afternoon. \nCanoe tours also are offered by the Mangrove Park at (0997) 56-3355 and Mangrove Tea Room at (0997) 69-2189. © Copyright (c)", "external_links": [], "published": "2015-08-28T17:52:00.000+03:00", "crawled": "2015-08-28T18:48:30.326+03:00", "highlightTitle": ""}