{"organizations": [], "uuid": "89014491bfc5a12b1e32d106c98f8e489c6b0c7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29835856/pa-fish-boat-commission-announces-special-mentored-youth-opportunities-on-21-waters-this-labor-day", "country": "US", "title": "PA Fish & Boat Commission Announces Special Mentored Youth Opportunities on 21 Waters this Labor Day", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "PA Fish & Boat Commission Announces Special Mentored Youth Opportunities on 21 Waters this Labor Day - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "89014491bfc5a12b1e32d106c98f8e489c6b0c7b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29835856/pa-fish-boat-commission-announces-special-mentored-youth-opportunities-on-21-waters-this-labor-day", "ord_in_thread": 0, "title": "PA Fish & Boat Commission Announces Special Mentored Youth Opportunities on 21 Waters this Labor Day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Pennsylvania Fish & Boat Commission\nHARRISBURG, Pa. , Aug. 19, 2015 /PRNewswire-USNewswire/ -- Summer may be winding down, but fishing opportunities for families and kids are increasing, thanks to today's announcement by the Pennsylvania Fish and Boat Commission (PFBC) that it will be stocking trout in four waters for a special mentored youth event on Labor Day .\nThe four waters are in addition to 17 Panfish Enhancement lakes which will be used to offer kids and their mentors a special fishing experience on the holiday, which falls on Monday, Sept. 7 . To encourage participants to share their experiences, the PFBC will hold a special photo contest through its Facebook page ( www.facebook.com/PaFishandBoat ) beginning on Labor Day .\n\"For many people, Labor Day offers the last long weekend to be on the water before getting back to the routine of school,\" said PFBC Executive Director John Arway . \"But we want to remind anglers that fishing is a year-round sport and doesn't end after the traditional trout or bass seasons or when kids return to the classroom. We introduced the panfish opportunity last fall, and decided to expand the idea this year by giving trout anglers something to look forward to.\"\nIn addition, the PFBC is offering a 1-day adult resident or non-resident Labor Day license for just $1 , providing an easy and affordable way for individuals to take young anglers fishing, to introduce friends to fishing for the first time, or to just enjoy a relaxing day on the water by themselves. This is the second year the PFBC has offered a 1-day Labor Day license.\nThe waters which will be stocked with trout include:\nCentre County – Poe Lake, Poe Valley State Park; Fulton County - Cowans Gap Lake, Cowans Gap State Park; Huntingdon County – Greenwood Lake, Greenwood Furnace State Park; and Wayne County - Upper Woods Pond. Each water will receive its fall or winter allotment of stocked trout early this year. Adults and children can fish for trout, but only kids with a voluntary youth fishing license or free mentored youth permit may keep up to two trout of 7\" or greater. Adults must have a fishing license, but a trout stamp is not required.\nOn this day no trout may be kept from these four waters by anyone other than a participating youth. This is a change from the way the mentored youth trout program has been administered previously. The PFBC modified the program in response to numerous positive comments about the youth harvest portion of the program and related comments suggesting that only children, and not adults, should be allowed to keep what they catch during the mentored youth trout days.\nThe Panfish Enhancement lakes were chosen as mentored youth fishing opportunities because the waters are managed to increase the number and size of fish. Panfish include bluegill, pumpkinseed, and redear sunfish, which are collectively called sunfish; black and white crappies; and yellow perch.\n\"Kids should catch a lot of sunfish, crappies and perch, which makes the day fun,\" Arway said. \"As an added incentive, we're also removing the minimum size limits, which are either seven or nine inches, depending on the species, for kids and their mentors on this day.\"\nThe 17 lakes will be open to all anglers but only mentored youth participants (adults and kids) may keep fish under the minimum size. The lakes included in the program are, by county:\nBerks - Blue Marsh Reservoir Cambria - Beaverdam Run Reservoir, Hinkston Run Reservoir, Wilmore Dam Centre - Foster Joseph Sayers Lake Chester - Chambers Lake Montour - Lake Chillisquaque Monroe - Bradys Lake , Gouldsboro Lake Pike - Lower and Upper Promised Land Lakes Somerset - High Point Lake, Quemahoning Reservoir Washington - Cross Creek Lake Westmoreland - Lower Twin Lake, Northmoreland Lake, Upper Twin Lake \"We have a rich history of trout and bass fishing in the Commonwealth and the opening days are truly traditional events enjoyed by families,\" Arway added. \"But we also have many other outstanding fishing opportunities, including panfish. Fishing doesn't end when school starts. We want to show families where they can go and how easy it can be to fit fall fishing into their schedules.\"\n\"The PFBC also reminds anglers that if they are holding a gift voucher for a voluntary youth fishing license, this is a great time to redeem it and participate in the Labor Day special opportunities,\" he added.\nTo participate in the mentored youth program, adult anglers (16 years or older) must have a valid fishing license and be accompanied by a youth. Youth anglers must obtain a free PFBC-issued permit or a voluntary youth fishing license. So far this year, more than 18,700 kids have obtained a free permit and another 9,200 have purchased a voluntary youth fishing license.\nThe photo contest will run from Labor Day through Sunday, Sept. 13 . Participants must be at least 18-years-old. Prizes includes $100 , $50 and $25 gift cards to Bass Pro Shops.\nFor more information, please visit www.GoneFishingPA.com .\nMedia Contact :\nEric Levis , Press Secretary\n717.705.7806 or elevis@pa.gov\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/pa-fish--boat-commission-announces-special-mentored-youth-opportunities-on-21-waters-this-labor-day-300130932.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.facebook.com/PaFishandBoat", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/pa-fish--boat-commission-announces-special-mentored-youth-opportunities-on-21-waters-this-labor-day-300130932.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC83187&Transmission_Id=201508191556PR_NEWS_USPR_____DC83187&DateId=20150819", "http://www.gonefishingpa.com/", "http://fishandboat.com/fishpub/summary/panfish.html"], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-20T03:37:41.489+03:00", "highlightTitle": ""}