{"organizations": [], "uuid": "67522b8b6f044f57031bc825e34306817aa49ee3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gogirlguides.com", "main_image": "http://gogirlguides.com/wp-content/uploads/2014/11/3153605134_34740afc8f.jpg", "site_section": "http://feeds.feedburner.com/GoGirlGuides", "section_title": "Go! Girl Guides - Helping Women Travel The World", "url": "http://gogirlguides.com/north-america/a-girls-guide-to-american-air-travel/", "country": "US", "title": "A Girl’s Guide to American Air Travel", "performance_score": 0, "site": "gogirlguides.com", "participants_count": 1, "title_full": "A Girl’s Guide to American Air Travel", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T22:05:00.000+03:00", "replies_count": 0, "uuid": "67522b8b6f044f57031bc825e34306817aa49ee3"}, "author": "Sarah Enelow", "url": "http://gogirlguides.com/north-america/a-girls-guide-to-american-air-travel/", "ord_in_thread": 0, "title": "A Girl’s Guide to American Air Travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "North America \nNow that you’ve paid an exorbitant price for your holiday plane ticket , it’s time to actually travel. These days I don’t know which is worse, the price of air travel or the frustrating circus of the airport. So, in the interest of saving your patience for the holiday itself, here are some tips for getting around America. Other countries may have similar laws but these are universal to American airlines and airports: \nFor your own sanity, arrive 2 hours early. Going through security in American airports has been a lengthy process since 9/11 (and the shoe bomber, and the underwear bomber). The line’s long and slow-moving because you have to take off your shoes and coat, and remove your laptop and toiletries from your carry-on, then repack them on the other side of security, then lace those boots up again. Sometimes the TSA (Transportation Security Administration) will usher people on the next departing flight to the front of the line, which really saved me once, but sometimes they don’t. And speaking of needing more time, isn’t it always at the airport that your period strikes? I nearly missed a flight once because of that early visitor. \nThe TSA is serious about taking away your hair product. If you packed any liquid over 3.4 ounces in your carry-on—and some of us cannot travel without conditioner and hair cream!—you can bet your ass the TSA will toss it into the garbage. It doesn’t matter if it’s a brand-new bottle of shampoo, or if there’s only three ounces of cocoa butter left; if the vessel holds more than 3.4 ounces of liquid, gel, aerosol, deodorant, makeup, perfume, etc., it gets trashed. Use three-ounce, see-through containers and put them in one (yes, only one per person) see-through toiletry bag. Breast milk, baby formula, and prescription medications are exempt from this rule. Also, contrary to what you might assume, knitting needles are permitted in your carry-on. \nKeep it simple with sex toys. Women should be allowed to travel hassle-free with erotic accessories, but in reality, it doesn’t always work that way. Smaller toys attract less attention; not every TSA agent knows an oscillating double-header when they accidentally grab one. Consider taking non-mechanical toys only, but if you really want that Love Rider, remove the batteries. If your carry-on or checked bag starts vibrating, the TSA will assume it’s explosive and they can potentially prevent you from flying. If there’s any liquid involved in your toy, it’s subject to the 3.4-ounce rule above. If a TSA agent is digging through your bag and they find your sex toy, then give you a reprimanding look or comment, refuse to let them shame you! Check out more tips for traveling with sex toys here . \nFull body scanner vs. pat-down. You can choose between two screening methods: the full body scanner or the pat-down, each presenting certain issues for women’s bodies. The full body scanner is a giant machine that visually searches you for prohibited items (clothes on, shoes off). These machines formerly used backscatter technology, which was criticized for harmful radiation and capturing explicit images of passengers. A woman in Dallas was harassed by male TSA agents who were gawking at her naked body through the scanner, and she wasn’t the only target. The good news is that backscatter has been eliminated in U.S. airports, but you may simply wish to avoid the scanner anyway. There is still minimal radiation and the TSA is still capturing an image of your body, but there’s no physical contact involved. The scanner is faster than the pat-down, so if you’re running late, this might be your only option. The pat-down is a clothes-on, shoes-off, head-to-toe check that includes the back of a TSA agent’s hand along your breasts and inner thighs, fingers inside your waistband, and hands in your hair. There’s no radiation or image-capturing involved. Whether this is better or worse than the scanner is a matter of opinion. I’ve had dozens of pat-downs, all very respectful, and they always pair female travelers with female TSA agents. Some agents have even acknowledged the awkwardness of their hands in my expansive curly hair, and tried not to muss my ‘fro. Then again, I once had a female agent detain me because of my bra’s underwire. TSA agents are supposed to be respectful of transgender travelers, breast cancer survivors, and religious head-coverings, and you can choose to receive your pat-down in private, accompanied by a friend or family member. You might encounter a third option: the old-fashioned metal detector. This just requires the removal of anything metallic like a belt or jewelry. \nRock that aisle seat. Do yourself a favor and pick an aisle seat if your period’s coming on. You’ll have easy access to the bathroom and space to stretch your legs, which can help alleviate lower body pain (keep a scarf handy, which doubles as a pillow or back support). Try stretching in the aisle: roll your head around slowly in both directions, shrug your shoulders forward and backward, reach up to the ceiling, then point and flex your feet. You’d be surprised by how those little movements keep your muscles limber. \nStay hydrated and eat well on the plane. Bring an empty water bottle and fill it after exiting security; hydration wards off cramps and headaches, and keeps your skin in decent shape while you breathe that dry, recycled cabin air. Eye drops and lip balm help too, and you can save space (and keep that carry-on petite) by replacing your various moisturizers with a tiny tub of Vaseline. Yogurt with live active cultures helps maintain your immune system and digestion, and of course, eating fresh fruits and vegetables is always a solid plan. \nHow do you deal with American air travel?", "external_links": [], "published": "2015-08-30T22:05:00.000+03:00", "crawled": "2015-08-31T15:40:43.141+03:00", "highlightTitle": ""}