{"organizations": [], "uuid": "ca19e5b88d3fed50d4501ecd29b333f8b1c77544", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62386/kampala-city-festival-2015", "country": "US", "title": "Kampala City Festival 2015", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Kampala City Festival 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T09:35:00.000+03:00", "replies_count": 0, "uuid": "ca19e5b88d3fed50d4501ecd29b333f8b1c77544"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/62386/kampala-city-festival-2015", "ord_in_thread": 0, "title": "Kampala City Festival 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Prof. Dr. Wolfgang H. Thome, eTN Africa Correspondent | Aug 08, 2015 Adv: \nPreparations are now in full swing for this year’s Kampala City Festival with fundraising starting in earnest and working groups going into overdrive. \nUganda Breweries once again came on board with a 150 million Uganda Shilling contribution while Total Uganda and Airtel Uganda respectively handed over cheques earlier in the week of 100 million Uganda Shillings each to the Executive Director of the Kampala Capital City Authority Jennifer Musisi. Other major sponsors were named as Uganda’s leading daily newspaper, the New Vision, City Tyres and the Mukwano Group, Coca Cola, Crane Bank and Bank of Africa among many others. \nThe festival will take place on the 04th October, as previously scheduled for the first Sunday of that month and KCCA has already put an estimated two million spectator figure into the public domain, of people they expect to come to line the streets for the parade, flock to the entertainment centres and crowd the food stalls, from Kampala, the greater metropolitan area, upcountry and from the entire region. While this may be overly optimistic, going by the figures of the past years, is the million mark nevertheless within reach. \nThe theme of 2015 was given as ‘Colour and Climate Change’ – a maybe politically correct but nevertheless strange combination of direction the festival is going to take – and this will in coming weeks be displayed on posters and banners across the city in preparation of the event. \nMusisi at the launch did give a budget for this year’s preparations of Uganda Shillings 875 million which KCCA is proposing to finance in equal party from the city’s coffers and through sponsorship deals, plus the surplus of over 220 million Uganda Shillings kept on account from last year. \nMotorists are already now advised that the entire city centre will be sealed off for traffic of any kind, allowing only pedestrians to walk the streets and those wanting to come to the festival area should make early arrangements for either parking their cars or else being dropped off at the Central Business District boundaries. Long haul through traffic must on that day use the Northern Bypass around the city and cargo traffic destined for the industrial area or for deliveries to the city must reschedule accordingly. People walking to the venue are also reminded that the entry points will are secured and visitors must be ready to undergo security checks to ensure that revelers are safe. Several hundred uniformed and plain clothes security personnel will be deployed into the city for the purpose. \nThis is the fourth year of the festival which has become East Africa’s largest street festival with bands and cultural troupes performing throughout the day to entertain the large crowds. The inaugural festival was held at the eve of Uganda’s 50th independence anniversary in 2012 and has since then become a regular event feature promoted by the city and the Uganda Tourism Board.", "external_links": [], "published": "2015-08-08T09:35:00.000+03:00", "crawled": "2015-08-08T11:32:06.667+03:00", "highlightTitle": ""}