{"organizations": [], "uuid": "aed93e57fd2ddbfb66bea1e90d6e22a66c76beb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://www.marketwire.com/library/MwGo/2015/8/31/11G052326/8e322683499a3cd9_org-1503047099.jpg", "site_section": "http://www.marketwire.com/rss/mwTravelandHospitality.xml", "section_title": "Marketwired - Travel and Hospitality", "url": "http://www.marketwired.com/press-release/jetblue-to-take-off-for-sunny-and-stylish-palm-springs-california-nasdaq-jblu-2051442.htm", "country": "CA", "title": "JetBlue to Take Off for Sunny and Stylish Palm Springs, California", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "JetBlue to Take Off for Sunny and Stylish Palm Springs, California", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T16:58:00.000+03:00", "replies_count": 0, "uuid": "aed93e57fd2ddbfb66bea1e90d6e22a66c76beb9"}, "author": "", "url": "http://www.marketwired.com/press-release/jetblue-to-take-off-for-sunny-and-stylish-palm-springs-california-nasdaq-jblu-2051442.htm", "ord_in_thread": 0, "title": "JetBlue to Take Off for Sunny and Stylish Palm Springs, California", "locations": ["California", "Stylish Palm Springs"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 31, 2015 09:58 ET JetBlue to Take Off for Sunny and Stylish Palm Springs, California \nNewest Transcontinental Route Offers Seasonal Escape From New York Winters \nNEW YORK, NY --(Marketwired - August 31, 2015) - JetBlue Airways ( NASDAQ : JBLU ) today announced it will begin seasonal non-stop service between New York's John F. Kennedy International Airport (JFK) and Palm Springs International Airport (PSP) in Southern California this winter, subject to government approval. Palm Springs will be JetBlue's ninth destination in the Golden State. \nThe new flights will operate five times per week, Thursday through Monday, between January 14, 2016 and May 1, 2016. Seats are on sale beginning today with introductory fares starting at $99 one way between New York and Palm Springs (a). \nThe desert oasis has recently experienced a comeback by blending its nostalgic past as a playground for Hollywood with hip new development attracting a new generation of trendy travelers. Palm Springs was a favorite venue for The Rat Pack, and stars such as Frank Sinatra, Bob Hope and Lucille Ball all built homes in Palm Springs. Today, Palm Springs has become a gathering spot for architecture aficionados, musicians, artists, and trendy weekenders seeking a warm, retro-chic getaway with great hotels, restaurants and outdoor activities. \n\"With direct service to Palm Springs five days a week, winter-weary East Coasters can escape to this desert getaway with 350 days of sunshine easier than ever before,\" said Dave Clark, vice president of network planning at JetBlue. \"Palm Springs' re-emergence as a destination and the area's nationally recognized events like Coachella make it the perfect addition to our transcontinental route map.\" \nThe Greater Palm Springs area's abundant outdoor adventure offerings including the Joshua Tree National Park and the San Jacinto Mountains, as well as world-class events and festivals, including Coachella, Stagecoach and BNP Paribas Open in Indian Wells. \n\"The City of Palm Springs continues to experience a tremendous renaissance and we are delighted to welcome JetBlue to Palm Springs International Airport,\" said Mayor Steve Pougnet. \"Their arrival is just more proof that Palm Springs is the premiere resort destination in Southern California and beyond.\" \nPalm Springs International Airport, located less than two miles from downtown, welcomes more than 1.5 million passengers annually from the U.S. and Canada. The airport is known for its shorter lines, friendly staff, stunning desert vistas and airport amenities including an outdoor courtyard, dining and retail. The airport services Greater Palm Springs, which includes the resort cities of Palm Springs, Desert Hot Springs, Cathedral City, Rancho Mirage, Palm Desert, Indian Wells, La Quinta, Indio and Coachella. \n\"We are excited about being a JetBlue destination,\" said Scott White, CEO & President of the Greater Palm Springs Convention & Visitors Bureau. \"JetBlue's arrival means easy, nonstop access for our East Coast travelers. The personalized amenities that define the airline complement the lifestyle and visitor experience in Greater Palm Springs perfectly, promising to deliver travelers to our oasis feeling relaxed and ready to experience all we have to offer.\" \nFlight Schedule", "external_links": [], "published": "2015-08-31T16:58:00.000+03:00", "crawled": "2015-08-31T17:29:57.286+03:00", "highlightTitle": ""}