{"organizations": [], "uuid": "e14d813326700265bea9c76ea1c475bb4e7a1166", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29842058/southfield-capital-invests-in-vanguard-dealer-services-in-partnership-with-management", "country": "US", "title": "Southfield Capital Invests in Vanguard Dealer Services in Partnership with Management", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Southfield Capital Invests in Vanguard Dealer Services in Partnership with Management - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "e14d813326700265bea9c76ea1c475bb4e7a1166"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29842058/southfield-capital-invests-in-vanguard-dealer-services-in-partnership-with-management", "ord_in_thread": 0, "title": "Southfield Capital Invests in Vanguard Dealer Services in Partnership with Management", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Southfield Capital\nGREENWICH, Conn. , Aug. 20, 2015 /PRNewswire/ -- Southfield Capital, a leading lower middle market private equity firm, announced today that it has partnered with management, led by CEO Jim Polley , along with Ed Reitz and Mike Seergy , to invest in Vanguard Dealer Services (\"Vanguard\"). Vanguard is a premier agent and administrator of finance and insurance (\"F&I\") products and services to franchised automobile dealers nationwide. Vanguard's senior management will continue in their current operating roles and will maintain a shareholding in the company. Additional terms of the transaction were not disclosed.\nHeadquartered in Fairfield, N.J. , Vanguard offers a full suite of proprietary and third party auto extended warranty (vehicle service contracts) and ancillary products such as tire protection, key replacement, dent repair and pre-paid maintenance. The Company also offers F&I consulting and reinsurance services focused on enhancing dealership profitability. At the core of Vanguard's value proposition is its ability to increase dealer profitability and customer retention. The Company achieves this by leveraging its broad product offering and establishing best practice systems and processes, including F&I training, automotive management training, compensation plan development, dealer owned reinsurance, dealer incentive management, sales strategy and proficiency analysis, compliance review, and F&I specialists staffing.\n\"The Vanguard team is very excited to announce our partnership with Southfield Capital,\" said Jim Polley , co-founder and CEO of Vanguard. \"We have ambitious plans to grow Vanguard into the nation's preeminent provider of F&I products and services through a combination of acquisitions and the introduction of new products and services. We needed a partner that has experience executing roll-up strategies and the operational expertise to ensure that we scale the business appropriately as we grow. Southfield's excellent track record with companies similar to Vanguard gave us confidence that they are the right partner for us. We are excited to implement our growth plans and develop a truly great company.\"\nSouthfield Partner, Andy Cook , commented, \"We are thrilled to announce our investment in Vanguard and look forward to our partnership with the Vanguard team. Jim Polley and his management team have developed a fantastic business which is now positioned for accelerated growth. Vanguard is a mission critical vendor to automotive dealers that increasingly rely on Vanguard's products and services to drive profitability. Vanguard represents a compelling platform investment in a large and highly fragmented market.\"\nEast West Bank provided the senior debt financing, and Fidus Investment Corporation provided the subordinated debt financing. Finn Dixon & Herling provided legal counsel to Southfield Capital. Woodbridge International acted as financial advisor to Vanguard and its shareholders.\nAbout Southfield Capital\nSouthfield Capital is a private equity firm that invests in growth oriented, lower middle market companies in the following industry sectors: outsourced business services, specialty finance, and value added distribution. The firm targets companies with $4 - 12 million in EBITDA and partners with management to scale the business through a combination of organic and acquisition growth strategies. For more information, please visit www.southfieldcapital.com .\n releases/southfield-capital-invests-in-vanguard-dealer-services-in-partnership-with-management-300131195.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY83269&Transmission_Id=201508201030PR_NEWS_USPR_____NY83269&DateId=20150820", "http://www.southfieldcapital.com/", "http://www.prnewswire.com/news-releases/southfield-capital-invests-in-vanguard-dealer-services-in-partnership-with-management-300131195.html"], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T18:13:57.653+03:00", "highlightTitle": ""}