{"organizations": [], "uuid": "70954283b6430a1ddbb0bfb0939032482c8a61e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mercurynews.com", "main_image": "http://extras.mnginteractive.com/live/media/site568/2015/0727/20150727__CCT-ANGELA-0809-01~1.JPG", "site_section": "http://feeds.mercurynews.com/mngi/rss/CustomRssServlet/568/200953.xml", "section_title": "Travel", "url": "http://www.mercurynews.com/eat-drink-play/ci_28556635/beyond-muir-woods-bay-areas-treasure-troves-redwood?source=rss", "country": "IL", "title": "Beyond Muir Woods -- the Bay Area's treasure troves of redwood groves", "performance_score": 0, "site": "mercurynews.com", "participants_count": 1, "title_full": "Beyond Muir Woods -- the Bay Area's treasure troves of redwood groves", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T20:15:00.000+03:00", "replies_count": 0, "uuid": "70954283b6430a1ddbb0bfb0939032482c8a61e7"}, "author": "By Angela Hill\n\nahill@bayareanewsgroup.com", "url": "http://www.mercurynews.com/eat-drink-play/ci_28556635/beyond-muir-woods-bay-areas-treasure-troves-redwood?source=rss", "ord_in_thread": 0, "title": "Beyond Muir Woods -- the Bay Area's treasure troves of redwood groves", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Beyond Muir Woods -- the Bay Area's treasure troves of redwood groves By Angela Hill ahill@bayareanewsgroup.com Posted: 08/03/2015 12:00:00 PM PDT Members of a wedding party do a late-morning rehearsal at the University of California Botanical Gardens Stephen J. Mather Redwood Grove in Berkeley on July 24, 2015. (Laura A. Oda/Bay Area News Group) Early afternoon on a recent Thursday, I visited the Mather Redwood Grove at the UC Botanical Garden in the hills above campus. It was cool, lush, restful. Nature's stoic skyscrapers blocked the sounds of civilization. Worries of the day were absorbed in the forest floor, padded with needles and sorrel. \nAnd the best part: I was alone! Just me, myself and the elusive gnome I swear I saw peeking around the leg of a lichen-clad bench. Really. He was there. Maybe. The redwood trees stand straight and tall at the University of California Botanical Gardens Stephen J. Mather Redwood Grove in Berkeley on July 24, 2015. (Laura A. Oda/Bay Area News Group) \nGnome or no gnome, this glorious solitude was particularly poignant after -- just two weeks before -- making the foolish and futile attempt to come within Hubble Space Telescope range of Muir Woods. While the venerable vegetation in Marin County's national monument is a treasure beyond compare, it has become more popular (read \"mobbed\") than ever in our more populated (read \"crazy mobbed\") Bay Area. And now its beauty comes at a price -- you pay in frustration, jockeying for parking with the other 1 million visitors each year. Advertisement \nThe spouse and I had heard the stories of people parking on the shoulder along the narrow, winding road to the park. So we knew it was a long shot but still thought we'd give it a try. No dice, baby. Cars filled both parking lots and clung to the edge of the roadway at every nook and cranny for nearly a mile. Word is, at least two cars per day slide down into roadside ditches and have to be towed out. There's a shuttle that runs from Mill Valley, and the park will start requiring reservations in about two years, according to a new congestion-reduction plan. \nBut wait, oh lovers of really tall trees -- there are alternatives. There's the lovely Mather Grove, plus several other spots around the region. They may not be the size of Muir, in acreage or height of trees. But you can still get a dose of the freshness, the contemplative tranquillity of redwood groves without the crushing crowds. \nHere are just a few: Mather Redwood Grove: A delightful respite above UC Berkeley with trees planted in the 1930s, quiet paths, benches and a small amphitheater for weddings and musical events. Entry is included in the $10 fee for the UC Botanical Garden; 200 Centennial Drive, Berkeley, 510-643-2755, botanicalgarden.berkeley.edu/ . \nRedwood Regional Park: The largest stand of redwoods in the East Bay can be found here, plus hiking trails through other evergreens, chaparral and grasslands; 7867 Redwood Road, Oakland; www.ebparks.org/parks/redwood . \nRedwood Grove Nature Preserve: This gem just off busy streets in Los Altos offers picnic tables and a boardwalk along Adobe Creek (which flows in winter) and a hillside trail; 482 University Ave., Los Altos, www.losaltosca.gov/recreation/page/redwood-grove-nature-preserve . A small sign identifying the type of redwood tree is nestled in the clover ground covering at the University of California Botanical Gardens Stephen J. Mather Redwood Grove in Berkeley on July 24, 2015. (Laura A. Oda/Bay Area News Group) \nHenry Cowell Redwoods State Park: While the park's northern Fall Creek region has about 20 miles of hiking trails through various vegetation, the main park area contains large, old-growth redwoods where the biggest tree is about 285 feet tall and 16 feet wide. Enter on Highway 9 near Felton; bit.ly/HenryCowell . \nArmstrong Redwoods State Natural Reserve: Probably the closest things to the Muir Woods experience, the reserve, just north of Guerneville in Sonoma County, includes a visitor center, large outdoor amphitheater, self-guided nature trails and picnic facilities; 17000 Armstrong Woods Road, Guerneville; bit.ly/ArmstrongRedwoods . \nOakland Museum of California: If you prefer your redwoods man-made and indoors, check out the redwood habitat section in the museum's Natural Science Gallery; 1000 Oak St., Oakland; www.museumca.org . Contact Angela Hill at ahill@bayareanewsgroup.com , or follow her on Twitter @GiveEmHill. \nArrive as close to the 8 a.m. daily opening time as possible. Or come late, an hour or so before closing time (the park closes at the end of daylight). Consider visiting on a weekday. \nIf you try to park along the road leading to the park, be careful about the crumbling edges. Cars frequently get stuck, or slide right off the road and have to be towed. \nBear in mind, there's little to no cellphone service near the grove. So if you do need a tow, you'll have to hike back to the park. \nTake the shuttle. The Muir Woods Shuttle picks up at Pohono Street in Mill Valley and drops riders off within steps of the park entrance. Be advised, it's unlikely you'll make it onto the first or even the second bus, so expect to wait. The shuttle operates Saturdays and Sundays through Oct. 25. Fare is $5, plus $7 park entry fee. Check out Route 66 or 66F at www.marintransit.org .", "external_links": [], "published": "2015-08-03T20:15:00.000+03:00", "crawled": "2015-08-03T22:45:13.124+03:00", "highlightTitle": ""}