{"organizations": [], "uuid": "067eab0cce0d7ab64175e5011dec833da8678b63", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources0.news.com.au/images/2015/08/27/1227501/741496-bfdb2066-4c5f-11e5-b250-71d2033ae921.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-ideas/the-hilarious-diary-of-a-mum-on-a-health-retreat/story-e6frfqe0-1227501741618?from=public_rss", "country": "IL", "title": "Hilarious diary of a health retreat", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Hilarious diary of a health retreat", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T02:11:00.000+03:00", "replies_count": 0, "uuid": "067eab0cce0d7ab64175e5011dec833da8678b63"}, "author": "", "url": "http://www.news.com.au/travel/travel-ideas/the-hilarious-diary-of-a-mum-on-a-health-retreat/story-e6frfqe0-1227501741618?from=public_rss", "ord_in_thread": 0, "title": "Hilarious diary of a health retreat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What are these? Families are lovely, but sometimes you just need a week off. Source: Supplied \nMY THREE small children keep me pretty busy. What with cleaning the blood off the trampoline, running a short order kitchen, and negotiating, every night, whose turn it is for the ‘Cuddle Me’ hot-water bottle, it’s non-stop action around here. I also work part-time and juggle that most boring and common of all ailments: the bad back. \nRecently I was given an incredibly generous gift: a week-long stay at a health retreat to keep my darling friend D company. She’s a Mum too, and going through serious health problems. For both of us, this week was an utter 360 degree about-face exit from real life. Here’s my diary. \nSunday \nDriving up to the imposing gates on the property, D and I are anxious. We feel like we are self-surrendering to some kind of minimum-security prison farm. \nIn the dining room we are served our first ‘clean’ meal. No sugar, no caffeine, no gluten, no preservatives, no alcohol, no salt. I make a masturbation joke that I regret slightly. It’s the nerves. \nWhen we see our villa, I die: the bathroom! At home, a little sustainable shack, we have one bathroom with a composting dunny. While I bathe, children deliver long monologues about Harry Potter and complain about who ‘smelt it’ and who ‘dealt it’. Here, I have my own bath, my own shower, my own toilet, and a TV that swings around to be watched from any or all of these perches. It’s paradise. Rachel and D decided to get away from it all. Source: Supplied \nMonday \nThe day starts with tai chi at sunrise, and rolls on into yoga, massage and a non-stop laughing with D. It feels wonderful, but all I can think about is coffee. Coffee coffee coffee. Coffee. \nAt dinner, our whole table has the headache: a deep, pounding mother of a thing. The staff tell us it’s sugar withdrawal. ‘I keep thinking about this amazing cheesecake I had once,’ says R, wistfully. She describes the cake in loving detail while the rest of us listen avidly and load up our gluten-free, caffeine-free, preservative-free, sugar-free and taste-free meals with chilli and pepper. We drink herbal tea by the bucketload. \nI dream I am trapped in a Scientology compound. \nTuesday \nMy head is still pounding, and now my sinuses are joining the party. I decide to check out the steam room. Once inside, I spend fifteen minutes breathing vigorously though my nose before I notice the ‘on’ switch beside the door. Winning at life, again! \nIn the afternoon I have a one-on-one session with a specialist practitioner who helps me think through ways I could better organise, hold and move my body. I’m nervous going to his villa for my session. \n“What if he Bill Cosby’s me?” I ask D as I leave. \n“Don’t drink the tea!” she shouts after me. \nWednesday \nA thrilled whisper travels around the dining room. \n“There’s dessert tonight!” \nYep, we have been successfully institutionalised. We all dig in, but then: a tinkling crash. Across the table from me, a woman looks up, horrified. So enthusiastic was she in her pursuit of the rhubarb crumble that she broke the glass. \nMy headache is gone and I realise what a profound rest my brain is having. In everyday life, running the small company of a family, my mind hums with to-do lists and menus and carpool arrangements. This week, I’ve closed down all those tabs, and my body and mind are resting deeply. I feel myself slipping into a state of unfamiliar calm. \nSerenity now! This is what people think happens on a yoga retreat. Picture: Supplied Source: Supplied \nThursday \nI float into the dining room at breakfast time on a cloud of mellow. I’ve practised tai chi, taken a cardio class in the swimming pool, sucked back a litre of water and filled my lungs with crisp morning air. \n“How are you feeling?” asks my table mate C. \n“Great!” I say. “I’ve got no pain anywhere in my body.” \nAnd then, I erupt into a flood of tears. I shock myself. I shock C. She gets up and gives me a hug. (One, two, three, now it’s awkward.) All this peace seems to have freed up a lot of feelings. My face leaks at frequent intervals. Perhaps it’s the tea? \nFriday \nNew people arrive and we give them the run of the joint like creepy prefects. One woman seems totally freaked out, so I smile beatifically and speak to her in a calming voice like a cult member. \n“You’ll be fine. Everyone is beautiful.” \nAt lunch, we discuss poo at length. I’ve got a lot going on downstairs, and I’m not alone. Either my body is expelling toxins and adjusting to a life in which I don’t feed it chocolate every three hours, or something has crawled up there and died. \nSaturday \nToday I hike seven kilometres, feeling fit and vital. It is a profound moment for me, as I realise just how anxious and protective I am in real life of my bad back, and how much that anxiety keeps me from strength. \nIt’s our final night. D and I fear that reintegrating into mum life is going to be brutal. At this place we are coddled like overgrown babies, an intoxicating sensation. We even walk around the place sucking on giant bottles. And every night, a housekeeper turns down our bedcovers and lights essential oils in the bathroom. \nSunday \nLast day! It’s strange to be back in the car. D and I decide to stop at a picturesque little winery nearby for a coffee. Our eyes meet as a waiter passes us with a bowl of crisp, salty fries. We order a bowl, which we inhale in record time. They are glorious. \n“I might pick up a bottle of wine for home”, says D. \n“It’s a five-wine tasting,” says the lady behind the counter, as she pours us a shiraz or three, a sparkling rose and a cheeky dessert wine. At some point D and I realise we are only five minutes down the road from the health farm. Oops! \nFinally home, I am thrilled to see my beautiful husband and gorgeous kids. But my welcome-back dinner, delightful as it is, gives me minor emotional whiplash. The comedy, nudity and ear-bleeding noise level takes getting used to, after a week of meals spent in quiet conversation, with companions that did not get up and dance, nude, mid-meal. While my children are my absolute favourite comedians, ‘peaceful’ is not an adjective that describes our dinner table. Getting back in the routine of family after a break is actually quite challenging. Source: Supplied \nMonday \nMy residual calm gets me through the first school run, but by six, everything is falling apart. I’m standing at the stove, cooking dinner, and all three children are asking me questions at once. It’s all too much — I’ve lost my multi-tasking mojo. \nSoon I realise what the biggest break has been from: the bloody housework. I have barely lifted a finger for a week. What a fall: from Cleopatra to Cleopatra’s housekeeper. \nAlso, my back hurts all the time again, an unavoidable byproduct of the busy physicality of family life. But my attachment to it has shifted in some profound way. And that glorious week-long rest was so, so nourishing. Now, to insert some Zen into the reality of Mount Washmore and lost hats and Mum’s Taxi. I think I’d better start by teaching the children how to turn down my bedcovers every night.", "external_links": [], "published": "2015-08-28T02:11:00.000+03:00", "crawled": "2015-08-28T02:30:14.348+03:00", "highlightTitle": ""}