{"organizations": [], "uuid": "dd0eeac09f51a1549b44f603162c47bd9f5c4e78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/cd/resizer/2.0/FIT_TO_WIDTH-w512/bb0882702010517857580ba993971f19dc20efec.jpg", "site_section": "https://www.yahoo.com/travel/rss", "section_title": "Yahoo Travel", "url": "https://www.yahoo.com/travel/warning-killer-heat-wave-hitting-popular-vacation-126619008762.html?src=rss", "country": "US", "title": "Warning: Killer Heat Wave Hitting Popular Vacation Spots", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Warning: Killer Heat Wave Hitting Popular Vacation Spots", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T02:20:00.000+03:00", "replies_count": 0, "uuid": "dd0eeac09f51a1549b44f603162c47bd9f5c4e78"}, "author": "", "url": "https://www.yahoo.com/travel/warning-killer-heat-wave-hitting-popular-vacation-126619008762.html?src=rss", "ord_in_thread": 0, "title": "Warning: Killer Heat Wave Hitting Popular Vacation Spots", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Warning: Killer Heat Wave Hitting Popular Vacation Spots Sophie Forbes August 13, 2015 \nA man cools off on a fountain in downtown Milan, Italy, on Aug. 6, 2015. The temperatures in Italy are reaching record highs in the latest heat wave. (Photo: AP/Antonio Calanni) \nRight now, in many places around the globe, it feels like the world is melting. \nAn intense and unrelenting heat wave sweeping across large parts of Europe and the Middle East has caused dozens of deaths, hundreds of hospitalizations, widespread power outages, and raging wildfires. \nClimate experts agree that this devastating extreme weather is here to stay, and will have a major impact on how and when we travel in the future. \n“It is pretty clear scientifically what is going on,” climatologist Andrew Weaver explained to Yahoo Travel. “The warming climate is being caused by increased greenhouse gases in the atmosphere. We have known that for decades. The question is: How does that warming trend in the atmosphere manifest itself in terms of weather? What it does is increase the likelihood of extreme weather happening.” \nUnfortunately, there is no way of predicting where or when the next heat wave might strike, potentially wreaking havoc with travelers’ plans in the future — and there is no way of telling whether the warm and sunny holiday destination you booked will actually be a sweltering danger zone once you get there. \n“Right now, [the extreme heat is in] the Middle East. Last year, it was here in the United States. In 2010, it was Russia’s turn. Next year, it will be somewhere else. And these warm events are increasing with time, while the frequency of cool events is decreasing with time,” Weaver explains. “The rate at which global temperature records, on the warm side, are being broken is at least two or three times that of which the temperature records on the cool side are being broken.” \nRelated: 7 Cool Small Towns Perfect for Escaping the Summer Heat \nHuge swaths of Europe and the Middle East are now bearing the brunt of the extreme weather, and astonishing temperatures have been breaking records since last month. \nContinental, central, and Eastern Europe are clocking record-smashing temperatures that are 15 to 20 degrees Fahrenheit above normal. \nPeople cast shadows on the Zalew Zegrzynski lake near Warsaw, Poland, on Aug. 8, 2015, as the temperature reaches 96.8°F. (Photo: AP/Alik Keplicz) \nIn Carole, Italy, shocked tourists watched as a car parked in a beach parking lot began to melt before their eyes. Lights, doors, window seams, wing mirrors, and even part of the bumper began to drip onto the ground as the heat rocketed to 99 degrees Fahrenheit. \nBear cools off in a pool in the bear sanctuary near the Badovac lake. Kosovo was hit by a heat wave, and daily temperatures reached up to 103°F. (Photo: AP /Visar Kryeziu) \nMeanwhile, in Northern Portugal, hundreds of firefighters are battling wildfires that have been roaring through a forested area close to the Spanish border since last Saturday. Weather experts predict that due to the stationary nature of the high-pressure weather system, the heat wave across Europe is likely to last at least another seven to ten days. \nRelated: Hot Child in the City — The 10 Best Urban Pools \nFor the U.S., recent weather forecasts have predicted ongoing extreme temperatures across much of the Central and Southern states until at least August 15. In Northern California , firefighters have been battling two huge forest fires that have ravaged the area north of wine country — one has destroyed 70,000 acres and at least 100 buildings while the other has burned through 16,500 acres. These are believed to be just two of more than 24 wildfires now scorching western parts of the U.S. \nIn the Middle East in particular, this is no ordinary heat wave. In the Iranian city of Bandar Mahshahr , unprecedented temperatures sent the heat index — how hot is actually feels outside — soaring to 165 degrees Fahrenheit. It’s the second-hottest heat index recorded in history. The highest was recorded in Dhahran, Saudi Arabia, on July 8, 2003, when the heat index reached 178 degrees. In Egypt, temperatures reaching 115 degrees, and 61 people died from heatstroke in just three days. Another 581 people were admitted to the hospital for heat exhaustion. The sizzling heat caused widespread power outages across Cairo, even bringing the metro system to a halt. \nEgyptian children swim in the Nile river in Cairo, Egypt on Aug. 13, 2015. A blistering heat wave that has smothered large swaths of Egypt in recent weeks killed more than 60 people, its state news agency said Wednesday. (AP Photo/Amr Nabil) \nThis extreme weather can cause dangerous health effects to animals and humans. For tourists traveling to any of these destinations, it is important to be aware of the risks associated with overexposure to these record-breaking temperatures. The weather they are now experiencing across parts of the Middle East — heat indexes upwards of 150 degrees Fahrenheit in some places — are similar to temperatures used in cooking. And according to Dr. Mark Morocco, M.D., professor of emergency medicine at the Ronald Reagan UCLA Medical Center, the effects on your body can be disastrous. \nRelated: Where in the World is it Safe to Drink Tap Water \nIn an interview with Yahoo Health , Morocco explains that a heat wave can make a body too hot or too dry. Being too hot makes your body sweat as a mechanism to self-cool and bring your body temperature down. However, sweating too much without replacing the lost fluids can lead to heat exhaustion. \nSymptoms for this include dizziness, sweating, and nausea. “That’s a warning that you’re in the danger zone,” Morocco says. “We’re just not designed to live in these temperatures.” \nIf the person does not replace the fluids or seek medical attention, he or she can lose the ability to sweat, causing an elevation in body temperature that can lead to heat stroke,” Morocco explains. “You begin to sort of cook.” Read More", "external_links": [], "published": "2015-08-14T02:20:00.000+03:00", "crawled": "2015-08-14T05:45:05.283+03:00", "highlightTitle": ""}