{"organizations": [], "uuid": "1b28b8661f0459e6484584cc870b75934c160290", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/05/ca/23/b1054e02af4245f4b71c40ebd9dc8211-e7ce822144684e4f95f0163f8ac9fd7d-0.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/top-news/sandra-lee-hospitalized-for-cancer-surgery-complic/nnDH7/", "country": "US", "title": "Sandra Lee hospitalized for cancer surgery complications", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Sandra Lee hospitalized for cancer surgery complications | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T20:52:00.000+03:00", "replies_count": 0, "uuid": "1b28b8661f0459e6484584cc870b75934c160290"}, "author": "DAVID KLEPPER", "url": "http://www.ajc.com/ap/ap/top-news/sandra-lee-hospitalized-for-cancer-surgery-complic/nnDH7/", "ord_in_thread": 0, "title": "Sandra Lee hospitalized for cancer surgery complications", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Food Network star Sandra Lee has been hospitalized for complications from a recent double mastectomy.\nLee was rushed to the hospital Tuesday night to deal with a buildup of fluids and is expected to be monitored for a couple of days.\nThe 49-year-old \"Semi-Homemade Cooking\" star had surgery in May after receiving a breast cancer diagnosis.\nFILE - In this Feb. 11, 2015 file photo, Food Network personality Sandra Lee attends amfAR's Annual New York Honors Gala in New York. Lee has been hospitalized for complications from a recent double mastectomy. Lee was rushed to the hospital Tuesday, Aug. 4, to deal with a buildup of fluids and is expected to be monitored for a couple of days. The 48-year-old \"Semi-Homemade Cooking\" star had surgery in May after receiving a breast cancer diagnosis. (Photo by Andy Kropa/Invision/AP, File) Her live-in boyfriend, New York Gov. Andrew Cuomo , left a Billy Joel concert at Nassau Coliseum early to be with Lee when he learned of her hospitalization. Cuomo, who is friends with Joel, introduced the musician at the concert.\nThe hospitalization was confirmed to The Associated Press by a person close to the family who wasn't authorized to speak about Lee's medical condition and spoke on condition of anonymity.\nA spokesman for Cuomo deferred questions about Lee to her representatives, who didn't immediately return messages Wednesday morning.\nFILE - In this Oct. 28, 2014 file photo, New York Gov. Andrew Cuomo, left, and Sandra Lee attend the Elton John AIDS Foundation’s 13th Annual \"An Enduring Vision\" benefit in New York. Lee has been hospitalized for complications from a recent double mastectomy. Lee was rushed to the hospital Tuesday, Aug. 4, to deal with a buildup of fluids and is expected to be monitored for a couple of days. The 48-year-old \"Semi-Homemade Cooking\" star had surgery in May after receiving a breast cancer diagnosis. (Photo by Charles Sykes/Invision/AP, File) Lee revealed her breast cancer diagnosis in May on ABC's \"Good Morning America.\" The cancer was found after a routine mammogram.\nLee is a cookbook author, magazine publisher and television chef. Lee and Cuomo, a Democrat, have dated for several years and share a home in Westchester County.\n___\nThis story has been corrected to show that Lee is 49, not 48.", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/ca/23/b1054e02af4245f4b71c40ebd9dc8211-e7ce822144684e4f95f0163f8ac9fd7d-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/e6/8f/b1054e02af4245f4b71c40ebd9dc8211-f4670b03235e46be9a1279dc833c02e4-0.jpg"], "published": "2015-08-05T20:52:00.000+03:00", "crawled": "2015-08-05T20:06:02.105+03:00", "highlightTitle": ""}