{"organizations": [], "uuid": "feff164f8e187fef0ec8ca5a65c1ed3b70eb1c89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelpulse.com", "main_image": "http://cdn.travelpulse.com/images/99999999-9999-9999-9999-999999999999/0e6ac24d-c737-e511-8b9f-0050568e420d/600x400.jpg", "site_section": "http://www.travelpulse.com/rss/news.rss?category=5125", "section_title": "TravelPulse.com Travel Technology Headlines", "url": "http://www.travelpulse.com/news/travel-technology/company-uses-technology-to-reduce-hotel-noise.html", "country": "US", "title": "Company Uses Technology to Reduce Hotel Noise", "performance_score": 0, "site": "travelpulse.com", "participants_count": 0, "title_full": "Company Uses Technology to Reduce Hotel Noise", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T14:00:00.000+03:00", "replies_count": 0, "uuid": "feff164f8e187fef0ec8ca5a65c1ed3b70eb1c89"}, "author": "", "url": "http://www.travelpulse.com/news/travel-technology/company-uses-technology-to-reduce-hotel-noise.html", "ord_in_thread": 0, "title": "Company Uses Technology to Reduce Hotel Noise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Last updated: 11:00 AM ET, Mon August 03 2015 Company Uses Technology to Reduce Hotel Noise \nPHOTO: Boutique property HotelRed is using Quietyme's technology to improve guest experience. (courtesy of HotelRed) YOU MAY ALSO LIKE Rosalind Cummings-Yeates \nIn a busy, bustling world, noise can be a problem for both hotel guests and hoteliers. \nOne company, Quietyme , has set out to reduce noise and cut down disturbances with the help of advanced technology. \nQuietyme — founded in 2012 in Madison , Wisconsin — uses sensors to pick up the decibel levels of locations. Sensors can be placed in individual rooms and are connected via an electronic network. The sensors not only pick up the origin of high noise levels, but also indicate which particular rooms within a property are affected, based on each room’s decibel level. Reports are then sent to hotel staff either via mobile device or through the main hotel system. \nHuey Zoroufy, COO of Quietyme, said the technology was originally designed for apartment managers, who used it to both monitor noise levels and curb property damage associated with high noise levels. \nSince then, the technology has been installed by more than 30 hospitals across the United States, on the back of a mandate by the federal government that dictated that hospitals must provide a quiet, calm environment for patients or it would start reducing payments for Medicare and Medicaid. It has also attracted insurance companies for its ability to potentially limit property damage. \nBut the hospitality sector has now jumped on board, becoming much more invested in the Internet of Things (IoT) , Zoroufy said. Boutique property HotelRed and Radisson Hotel Madison have already partnered with Quietyme to use the technology, with more hotels showing interest. \n“We’re seeing people in hospitality are much more receptive to what we’re doing, and they’re much more interested,” Zoroufy said. “At the same time, we’re watching the whole industry become much more profitable. It just has to go hand in hand.” \n“Noise is a big problem for hotels (No. 2 behind Internet connectivity), but only 43 percent of guests with noise complaints actually tell the front desk staff (according to the J.D. Power 2015 North America Hotel Guest Satisfaction Index Study ),” Zoroufy added. “Instead, they’re going online and leaving hotel reviews.” \nGiven that studies have shown an increase in a hotel rating can correlate to an increase in the all-important average daily rate for a property, it’s no wonder why the hotel industry is trying to find ways to anticipate guests’ needs before they have time to bring it to the attention of hotel staff. \nAccording to the same J.D. Power study, guests rated a hotel 310 points higher on a scale to 1,000 if they “strongly agreed” staff anticipated their needs instead of “strongly disagreed.” \n“I think hotels, general managers, just get that to the core,” Zoroufy said. “They have to be attentive to customer needs, but also they need to be attentive to how the customer wants to be interacted with. \n“That’s what we’re about: proactively improving the guest experience.” \nZoroufy said Quietyme generally considers a decibel level in the mid-80s to be a high level of noise (but this can be pre-set by hoteliers if desired). If a loud noise continues for 30 seconds, that’s when the sensor alerts hotel staff. \nVia independent studies, Quietyme found that its technology could reduce noise by more than 65 percent (by monitoring sensors, establishing an average baseline, and then comparing that baseline to a property’s noise level once it starts using the technology). \nQuietyme sensors pick up noise once per second and stream live. In that sense, hotel staff can map noise throughout the property at a high rate, and even deal with a noise disturbance before being alerted by the sensors. \nFor major brands like Radisson that generally see high volumes of guests walk through their properties, and for boutique properties like HotelRed that pride themselves in delivering an intimate experience, Quietyme’s technology can be of great use, Zoroufy said. \n“A major brand hotel (has) a variety of guests: the business traveler, the family guest, the 20-somethings, and even the wedding party,” Zoroufy said. “That’s always been difficult to manage. Noise issues have always been a challenge for (the wedding parties). This has been a breath of fresh air for them.” \nSpeaking of HotelRed, Zoroufy added, “They’ve built it with quiet in mind, and it’s extremely quiet.” \nQuietyme offers a monthly subscription of $3 per room for hotels. Sensors can also monitor room temperature, humidity and light levels. \nFor more information, visit quietyme.com .", "external_links": [], "published": "2015-08-03T14:00:00.000+03:00", "crawled": "2015-08-03T18:21:02.198+03:00", "highlightTitle": ""}