{"organizations": [], "uuid": "101a4dbd9e1c4b982ffe32da3cf7fa0d245da25a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/03/Bristol-Airport-logo.png", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/bristol-airport-adds-another-wizz-route/", "country": "US", "title": "Bristol Airport adds another Wizz routeTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Bristol Airport adds another Wizz routeTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "101a4dbd9e1c4b982ffe32da3cf7fa0d245da25a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/bristol-airport-adds-another-wizz-route/", "ord_in_thread": 0, "title": "Bristol Airport adds another Wizz routeTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bristol Airport adds another Wizz route Published on : Tuesday, August 18, 2015\nWizz Air announced Thursday (13 August) it will add another new route from Bristol Airport to Kosice, Slovakia. The route will commence on 10 October and will be operated with two weekly flights on Tuesdays and Saturdays.\nThis announcement closely follows Sofia, Bulgaria being added to Wizz Air’s routes from Bristol. The addition of the Kosice flight brings the total number of Wizz Air destinations to three from Bristol namely Katowice, Sofia and Kosice.\nKosice is situated on the river Hornad and offers a well preserved historical centre with many historical buildings, palaces and churches. The city is near the border with Hungary and close to the eastern reaches of the Slovak Ore Mountains, Kosice is the second largest city in Slovakia after the capital Bratislava.\nTamara Mshvenieradze, Corporate Communications Manager at Wizz Air said:\n“We are thrilled to announce the excellent news for customers in the South West of the UK. From 10 October we will fly from Bristol to Kosice every Tuesday and Saturday, making our newest Slovakian destination famous for beautiful architecture and rich cultural heritage ideal for short city breaks. WIZZ now offers 3 routes to 3 countries from Bristol. With fares from only GBP 15.49 we urge our customers to book the lowest fares today on wizzair.com”\nPeter Downes, Head of Aviation Development at Bristol Airport, said:\n“This is exciting news and we are delighted to welcome another new destination to the Wizz Air route network from Bristol Airport.\n“Wizz Air is opening up new, previously unserved markets for passengers in the South West and Wales, and these destinations offer customers more choice than ever before when planning a city break getaway.As a previous holder of European Capital of Culture, and serving as a gateway to six UNESCO world heritage sites including the world-famous Tokaj wine region, Kosice is one of the hidden gems of Eastern Europe.”", "external_links": [], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-18T03:26:14.694+03:00", "highlightTitle": ""}