{"organizations": [], "uuid": "5923b01e7b4e072836b77e18db7c17fb90ffc06a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeurope.about.com", "main_image": "http://f.tqn.com/y/goeurope/1/S/B/X/2/484355207.jpg", "site_section": "http://z.about.com/6/o/m/goeurope_t2.xml", "section_title": "About.com Europe Travel: What's Hot Now", "url": "http://goeurope.about.com/od/europeantripplanning/a/travel_budget.htm", "country": "US", "title": "Frugal, Not Cheap: How to Budget for Your...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Frugal, Not Cheap: How to Budget for Your...", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T14:12:00.000+03:00", "replies_count": 0, "uuid": "5923b01e7b4e072836b77e18db7c17fb90ffc06a"}, "author": "", "url": "http://goeurope.about.com/od/europeantripplanning/a/travel_budget.htm", "ord_in_thread": 0, "title": "Frugal, Not Cheap: How to Budget for Your...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expert Videos Tom Merton/OJO Images/Getty Images \nEveryone loves a bargain. A bargain is getting something that pleases you but at a cost lower than you would expect to pay. Your pleasure is one key, cost is the other. The trick isn't to have the cheapest vacation, it's to see your budget as a way to get the most pleasure at the lowest possible cost.To achieve this goal we're going to break your vacation budget into two major components--the fixed cost and the daily cost. The fixed cost is the total amount of money you spend just to go on vacation. It consists of the big ticket items of your travel: plane tickets and other transportation. We're going to budget a three week vacation. That's 21 days, but for food and hotels it's really only 20, because we're going to miss a day by flying and eating airplane food. Yuck, I know. Fixed Costs of a three week overseas vacation - US to Europe \nPlane tickets from the US are expensive these days. My summer economy fare is $1500, flying from San Francisco to Frankfurt non stop. I prefer non-stop flights even if they cost more, because a flight that stops in, say New York will require that I lug my bags through all sorts of controls and clear customs there and then try to hoof it back to make my connecting flight --and this is an enormous hassle I will pay not to deal with. \nI will lease a car. You probably won't be renting or leasing for as long a period as I am, so I will add a lease period of three weeks. Since we are being frugal and I don't have fear of small cars, I will add the lease cost of the smallest economy vehicle for three weeks. At the time of writing, Auto Europe has a Peugeot diesel available for around $995 for three weeks. Since I am leasing rather than renting, all insurance is included, and I get a brand new car. Also, I'll get exactly the car I specify, a diesel, which offers better mileage and often cheaper fuel. \nThe total fixed cost of a vacation for two people based on this criteria is $3,995. \nFixed Cost is the cost of the vacation even if you didn't do a single thing on your vacation. You're averaging $190 a day and you don't even have a hotel yet. Sad, isn't it? Budgeting Your Daily Travel Cost \nSome parts of the daily costs we can accept or reject. For example, we know that we can save money by not driving, but that would be stupid because we've paid for the car. So let's say we plan to drive around 1000 miles. My Gas Prices in Europe page tells us we'll spend about $5.50 for a gallon of diesel. The car I've chosen will get at least 50 miles to the gallon, so we'll budget for 20 gallons, or $110. \nWe could also save money by not going into any attractions that have entrance fees, but that's nuts, too. We're going to have to suffer some entrance fees and maybe even a parking bill or two. Let's just say that those things are covered by $20 a day per person--a generous amount. That's $800 for 20 days. \nOn my first trip to Europe, I saved money (and a belt loop or two) by eating the breakfast served free at the hotel, and one other meal. I know I can get a worker's lunch at a restaurant for between 8 and 12 Euros, at least for the Mediterranean countries. That's a two or three course meal with beverage averaging about $13 a day. We could stop here, but really, we want to eat in the evening, don't we? Let's add a decent restaurant dinner every night of the week. If you eat in the moderate kind of restaurant where locals eat, you might pay $30 for a reasonable amount of food and wine. So for two of us for 20 days, that comes to $1720 in total food costs. \nHotels are difficult. I'm 55. I don't have the stomach (or the bladder) for those bath-way-down-the-hall cheapo joints I used to seek out when I was 19. So hotels are going to cost me at least $100 a night. This will get me into the three star range and occasionally to a four star in rural Europe. I need 20 days, so that's around $2000. \nSo, our total costs (and I'm not including discretionary spending like shopping) come to $4,630, or about $220 a day for two people. \nDaily cost is working out to be just a bit more than the fixed cost of our vacation. Total Cost of a Three Week Vacation \nThe total cost of our comfortable European vacation tops out at $8,625, or almost $411 per day. \nHow do you reduce this cost? The variable costs are only $220 a day, so really, the best way to reduce the cost per day is to take a longer vacation . That's because the fixed costs stay the same and only the daily costs increase over time (although your car cost will increase somewhat for extra days, they won't increase as much as the initial rate). So while you're paying $411 a day, adding a day only costs $220. Almost half price. A bargain! The Philosophy of the Spectacular Splurge \nOk, so let's say you check into your hotel room in Venice, and you're told that the restaurant next door is having a special truffle dinner and you just love truffles. Not only that, but your favorite television star is also slated to be there. Hotel guests get priority, so the only thing you have to do is pony up the money, which is $250 a person, a total of $500. You'll eat well and you'll get a chance to rub elbows with your all-time hero. \nNow, I've never spent that much money in my life on dinner--but if you're thinking it's too expensive, let's review things here. This special night that you'll be talking about forever would cost just over 5% of your total vacation cost (remember that you're spending $440 more than you would have ordinarily, not $500). To make up that $440, all you need to stay is two extra days and you'll be paying the same per day costs as your original vacation! Yes, there's a whole lot of number juggling in this--but you have to admit, one long vacation is way more frugal than two short ones. \nAnd remember, frugal doesn't mean cheap. It means getting the most out of your money. If you don't do the things you've always wanted to do because you saved a few bucks, you're not frugal, you're just cheap. There's a world of difference. Other Ideas on Saving Money The other thing I'd do is rent a vacation house for the middle week, and cook at home some days. See Self-Catering: What You Need To Know .", "external_links": [], "published": "2015-08-03T14:12:00.000+03:00", "crawled": "2015-08-04T02:52:19.595+03:00", "highlightTitle": ""}