{"organizations": [], "uuid": "4882ec95569120d7519dd644a05ec939821d6f4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "budgettravel.about.com", "main_image": "http://f.tqn.com/y/budgettravel/1/S/D/K/couponalbum.JPG", "site_section": "http://z.about.com/6/o/m/budgettravel_t2.xml", "section_title": "About.com Budget Travel: What's Hot Now", "url": "http://budgettravel.about.com/od/traveldeals/tp/Travel-Coupons.htm", "country": "US", "title": "10 Great Places to Get Online Travel Coupons", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "10 Great Places to Get Online Travel Coupons", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T14:04:00.000+03:00", "replies_count": 0, "uuid": "4882ec95569120d7519dd644a05ec939821d6f4b"}, "author": "", "url": "http://budgettravel.about.com/od/traveldeals/tp/Travel-Coupons.htm", "ord_in_thread": 0, "title": "10 Great Places to Get Online Travel Coupons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expert Videos \nCopying and pasting a promotional code from a separate web site before an online purchase might seem a bit awkward at first, but once you develop the habit, you'll be hooked on the significant savings that result. \nThe sites linked below (listed alphabetically) are helpful for budget travel shopping online. Simply survey the site, copy and paste the promotional code (often a series of letters and numbers that may or may not make much sense) and then enter it in the appropriate promo box as you reach checkout. \nNote that none of these linked sites requires you to pay for a subscription. Courtesy CouponAlbum.com CouponAlbum.com \nCouponAlbum displays expiration dates clearly next to the promo codes -- a helpful touch when you're shopping for deals. They have codes for most hotel chains. Some of the coupon codes copy automatically, then open the page to which they apply. You can hit paste (Control+V) to complete the discount. The site also offers free subscriptions to a weekly newsletter that delivers updates to your email box. More » Courtesy CouponCraze.com CouponCraze.com \nA number of major airlines are included here, as well as CityPass, Choice Hotels and Club Med. You'll notice a little yellow box labeled \"soon\" on some of the pages. This is a direct link to some offer that is about to expire. It can be distracting when that offer is not travel-related. When there isn't an active deal working, they simply link you to the company's web site. The best results come from clicking the \"redeem coupon\" links. More » Courtesy CouponWinner.com CouponWinner.com \nThis is not the place to find a lot of airfare coupons. Most of the offerings appear to be land-based travel coupons. A quick glance reveals Good Sam Club memberships, Grayline discounts and offers from Rail Europe and Viator. On some entries, they supply a promotional code, while others invite you to click a \"use coupon\" link that takes you to the page offering the discount. More » Courtesy CurrentCodes.com CurrentCodes.com \nThere's no dedicated travel page here, so you'll need to have some vendors in mind and then search the huge database to see if there are postings that you can use. However, a quick glance at the many companies posted here includes many major travel companies, such as Air France, Embassy Suites Hotels, Thrifty Car Rental and Wyndham Hotels. They claim to have codes for more than 2,200 stores and companies and the stated mission here is to \"have absolutely the best coupon code database on the Internet.\" More » Courtesy Dailyedeals.com Dailyedeals.com \nHere you'll find a lengthy list of discounts and links to the pages where they are offered. Although space is provided for expiration dates, many of the fields are filled with question marks. In many cases, this might mean the deal is ongoing, with no posted end date. The primary focus is hotel reservations, car rentals, airline tickets and luggage. You'll also find a separate list of coupon deals for the United Kingdom. On that list, travel deals are not separated from the other offers. More » Courtesy Dealhunting.com DealHunting.com \nDealHunting.com has a travel section where you can click on the vendor name or promotional code and go directly to the point of sale. Many vendors are listed here despite an absence of any current coupon codes. For these, they provide links and ask that you submit anything you might find. Most of the do not point to coupon codes. They are direct links to special offer pages. More » About.com New England Hotel Coupons from About.com \nBefore you travel to New England, check out this page from Kim Knox Beckius, About.com's Guide to New England Travel. She'll link you to hotel coupons (via Roomsaver.com) from all the New England states (Connecticut, Maine, Massachusetts, New Hampshire, Rhode Island and Vermont) as well as New York state. By U.S. standards, this is one of the more expensive parts of the country in which to travel, so take advantage of Kim's assistance and snag a great hotel deal. More » Courtesy RetailMeNot.com RetailMeNot.com \nThis is a popular couponing site that claims to have offers from 65,000 stores. The linked page includes a \"top 100\" list of travel products, including offers from Enterprise, Hotels.com, Expedia, Hilton, Orbitz and Greyhound. On some entries, when you move your cursor over the coupon, a message appears asking you to copy the promotional code and move to the page where it can be used with one simple click. Others are simple links to vendor pages. More » Courtesy Roomsaver.Com Roomsaver.com \nThis is a handy search engine for budget travel. Simply enter a city and state for a full display of available hotel coupons. This started as a printed guide back in 1982 -- you might have seen it while traveling the U.S. interstate system. In the years since then, it's taken on an Internet presence, as well as an iPhone app and Android mobile site. More » Courtesy Savings.com Savings.com \nFeatured brands here include Orbitz, OneTravel and Booking Buddy. \"Deal Pros\" here will post current coupon links and helpful suggestions for saving money not only on travel but also gear and many purchase categories. You can sign up for the Savings.com newsletter to stay abreast of all the updates they offer to their deal pages. It's also possible to flag good deals with a \"thumbs up\" and write comments about how your purchases take shape. More » Related Articles", "external_links": [], "published": "2015-08-19T14:04:00.000+03:00", "crawled": "2015-08-19T17:39:17.620+03:00", "highlightTitle": ""}