{"organizations": [], "uuid": "d0a61a1ff2f6c935b5ca6b11464ad0a91f9aeb78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28242-alton-towers-resort-swaps-the-boardroom-for-the-treetops", "country": "US", "title": "Alton Towers Resort swaps the boardroom for the treetops", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Alton Towers Resort swaps the boardroom for the treetops", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T17:00:00.000+03:00", "replies_count": 0, "uuid": "d0a61a1ff2f6c935b5ca6b11464ad0a91f9aeb78"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28242-alton-towers-resort-swaps-the-boardroom-for-the-treetops", "ord_in_thread": 0, "title": "Alton Towers Resort swaps the boardroom for the treetops", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alton Towers Resort swaps the boardroom for the treetops Alton Towers Resort swaps the boardroom for the treetops Details Category: Venues & Events   15:00 Based on recent research demonstrating the benefits of nature and the outdoors on energy and proactiveness, Alton Towers Resort is encouraging their delegates to get out of the boardroom and into the trees as they take teambuilding to the treetops… Numerous experimental psychology studies have linked exposure to nature with increased energy and a heightened sense of well-being. \nStudies published in the Journal of Environmental Psychology suggest that the very presence of nature helps to ward off feelings of exhaustion and that 90% of people report increased energy when placed in outdoor activities. \"Nature is fuel for the soul,\" says Richard Ryan, researcher and professor of psychology at the University of Rochester. \"Often when we feel depleted we reach for a cup of coffee, but research suggests a better way to get energised is to connect with nature.” The findings, adds Ryan, are important for both mental and physical health. \"Nature is something within which we flourish, so having it be more a part of our lives is critical, especially when we live and work in built environments.\" Adding to the existing portfolio of teambuilding activities, the Alton Towers Resort took the research on-board and unveiled their latest teambuilding option – The Enchanted Forest Tree Top Quest, a high ropes course set amongst the trees. Delegates can now pass on that 4 o’clock coffee and get their kick a natural way with an invigorating break from the boardroom. Set amongst the trees and the perfect opportunity to bond with fellow team members from new heights, the course features a series of obstacles and 19 challenging elements including transverse nets, swing tyres, stepping stones, zip wire and tunnel. Related articles", "external_links": [], "published": "2015-08-13T17:00:00.000+03:00", "crawled": "2015-08-13T17:23:12.012+03:00", "highlightTitle": ""}