{"organizations": [], "uuid": "8e3f891180eab1266e224f9795658873409fc780", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbc.ca", "main_image": "http://i.cbc.ca/1.3187219.1439312711!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_460/taxi-coventry-connections-strike-aug-12-2015.jpg", "site_section": "http://www.breakingnews.com/feeds/rss/air-travel", "section_title": "Breaking news on air travel - breakingnews.com", "url": "http://www.cbc.ca/news/canada/ottawa/ottawa-airport-taxi-fleet-in-labour-dispute-over-pick-up-fees-1.3186944", "country": "US", "title": "Travel disruptions at Ottawa airport as cab drivers protest access fee hike - @CBCAlerts", "performance_score": 0, "site": "cbc.ca", "participants_count": 1, "title_full": "Travel disruptions at Ottawa airport as cab drivers protest access fee hike - @CBCAlerts", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T19:01:00.000+03:00", "replies_count": 0, "uuid": "8e3f891180eab1266e224f9795658873409fc780"}, "author": "Rebecca Bratek", "url": "http://www.cbc.ca/news/canada/ottawa/ottawa-airport-taxi-fleet-in-labour-dispute-over-pick-up-fees-1.3186944", "ord_in_thread": 0, "title": "Travel disruptions at Ottawa airport as cab drivers protest access fee hike - @CBCAlerts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ottawa airport taxi fleet in labour dispute over pick-up fees CBC News Posted: Aug 11, 2015 11:13 AM ET Last Updated: Aug 11, 2015 4:03 PM ET \nTaxi drivers who service the Ottawa airport were driving in circles around the property Tuesday, congesting the pick-up area and honking their horns in a labour dispute over an increase in pick-up fees. \nCoventry Connections, Ottawa's largest taxi company, runs a fleet of about 150 taxis that pick people up from the airport and has a long-term contract with the airport to do so. \nHanif Patni, the company's CEO, said the airport had been charging Coventry an \"unsustainable\" low monthly fee of $345 (amounting to about $1.50 to $2 per trip) per driver for exclusive pick-up rights. \nThe airport is now charging Coventry about $5 per pick-up. \n\"The taxi industry at the airport here in Ottawa has, historically, for many, many years, paid absolutely the lowest amount of funding compared to taxis working anywhere else in North America, by a very large [amount],\" Patni told CBC News on Tuesday. \n\"... The company has tried to explain to this to the driver's union for close to a year, we have attempted to bargain in good faith, and we've just not been able to come to a resolution on this point. And as a result we are now implementing this set fee that is required, and I'm afraid it's as simple as that.\" \nPatni said Coventry has authorized Blueline and Capital Taxi drivers to make pick-ups at the airport to make up for the striking drivers. \nBut the president of the taxi drivers' union, Amrik Singh, told reporters Tuesday that other taxi drivers are standing in solidarity with their colleagues by refusing service. \n\"Nobody is going to come here to do their job. I have a message for Mr. Patni: taxi drivers are united, they will fight back, they will not agree to ... whatever he wants to impose on us,\" Singh said. \nThe Ottawa International Airport Authority issued a media release Tuesday asking the public to make alternate pick-up arrangements. \n\"We encourage passengers to arrange pick-up and drop-off by family, friends or colleagues whenever possible until the labour dispute is resolved, and we expect that traffic and congestion on the arrivals curb will increase as a result,\" the authority said. \nShuttles, bus services, sedans, and limousines are available for arriving passengers, the airport authority added, along with a free grace period of one hour in the parkade for the course of the labour dispute. \nTaxi drivers moving slowly, honking through the pick up area #ottnews pic.twitter.com/kHkAUUXTSn", "external_links": [], "published": "2015-08-11T19:01:00.000+03:00", "crawled": "2015-08-12T00:31:40.431+03:00", "highlightTitle": ""}