{"organizations": [], "uuid": "722e6c4335e139210145de7613076dcc896676a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theplanetd.com", "main_image": "http://theplanetd.com/images/facts-about-elephants-e1439299860932.jpg", "site_section": "http://theplanetd.com/feed/", "section_title": "The Planet D: Adventure Travel Blog", "url": "http://theplanetd.com/addo-elephant-national-park-south-africa/", "country": "US", "title": "It’s an Elephant’s life – A Walk on the Wild Side in Addo", "performance_score": 0, "site": "theplanetd.com", "participants_count": 1, "title_full": "It’s an Elephant’s life – A Walk on the Wild Side in Addo", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T14:00:00.000+03:00", "replies_count": 0, "uuid": "722e6c4335e139210145de7613076dcc896676a9"}, "author": "Dave and Deb", "url": "http://theplanetd.com/addo-elephant-national-park-south-africa/", "ord_in_thread": 0, "title": "It’s an Elephant’s life – A Walk on the Wild Side in Addo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted By Dave and Deb • No Comments » • Guest Posts , South Africa Ask most visitors what national parks in South Africa they want to go on safari to and the response is almost always, “Kruger!” It’s no surprise as Kruger is one of Africa’s best known parks. But South Africa boasts more wonders than its infamous Kruger including 0ur favorite, Addo Elephant National Park. I spent a month driving across the country in a car rental with my husband Chris. Without question, that trip was one of the best adventures we have ever gone on. Aside from Cape Town and the night before we flew out of Johannesburg , we only camped in South African National Parks including our Addo Elephant National Park. About Addo Elephant National Park With each park I visited, certain animals were more prominent and the ecosystems changed within even just a few hundred kilometers of each other. As the name implies, Addo Elephant National Park was one of my favorite for viewing this massive mammal. Here is a closer look at understanding this vulnerable creature and why you should make sure Addo is on your next must visit safari adventure. Forget the Big 5, Here You’ll Find the Big 7 One of the reasons Addo is such a great park for viewing elephants was because they always seemed to be on the move throughout the park. South Africa’s third largest national park, Addo Elephant National Park is the only national park in the world to be able to say it is home to the “Big 7.” The Big 5 consists of the lion, elephant, rhino, leopard and buffalo. Off the coast of the Agoa Bay, Addo Elephant National Park also has the great white shark and the southern right whale giving its fame to say the park is home to the Big 7. See: 28 Reasons why South Africa Should be on your Bucket List Large Herds of Elephants What I liked about Addo was it provided the chance to easily see large herds of elephants. I can count at least 19 elephants (and a couple of wart hogs in the foreground) in this shot, not to mention the other elephants that did not fit into this frame. Also take note of how much bigger the bull elephant of this herd is towards the left of the photo above. We watched him walk by cars and a short time later we drove by him on the side of the road and wow, he was a big bull. Facts about Elephants Elephant life is a matriarchal society where females live in herds with their successive offspring. The oldest cow, known as the matriarch leads the herd. Elephants are long lived with a lifespan between 55-60 years. Knowledge and migratory routes are passed on from generation to generation. Females practice allo-mothering where they ‘nanny’ and watch over young calves teaching them what to eat and protect them just as their mother would. Support World Elephant Day Elephants are highly social animals and follow a strict social order. They are also the largest and heaviest terrestrial mammal in the world . Extremely intelligent and powerful, they are very adaptable creatures. They can vary their diet based on what is available and overcome adverse conditions by moving to new food areas, even if they have to cover long distances. Get your Lonely Planet Guide to South Africa Gestation period for a cow is twenty-two months and the full raising of a calf takes about four years. Calves and family members are big investments and not easily replaced. For the first two years a calf is mothered intensely. This guy was the alpha male for this herd we were observing. Bulls leave the herd once they reach puberty which happens around age 12-14. Young males will form bachelor groups and live together. They practice tussling amongst each other and establish dominance without the need to fight and risk injury. Older bulls may even be accompanied by a few younger bulls known as askaris. These younger individuals may learn social skills from the older bull and offer him a form of protection in return. Read: The Importance of Responsible Tourism Both male and females have tusks and they are modified upper incisor teeth that grow continuously throughout their life. Unlike a rhinos horn, which will grow back if cut off, an elephant’s tusk will not grow back. They keep their tusks sharp as they may be used as weapons against other elephants, animals and are also used as tools when foraging to clean off vegetation. Our time in Addo Elephant National Park left such an impression on me. I will not forget our first day in the park and as we were finishing up our evening game drive we got caught up in an elephant traffic jam. We were on a small road with a handful of cars around us as we were all making our way back to camp. Out of the bushes elephants started crossing the road all around us. Fortunately there was a guide in another vehicle who signaled to us in this particular situation to shut our car off and just sit where we were. Adrenaline pumping, we sat in our car with butterflies in our stomach as elephants crossed around us. I will always remember looking out the window and thinking, “Oh my gosh, that is an elephant knee passing right by my window.” Prior to going to Africa, traveling independently in South Africa and visiting Addo Elephant National Park, I knew very little about the continent nor elephants. It was through the act of traveling and putting myself out there, I was so fortunate to learn about these animals and experience their awesome presence. Travel allows for so many types of growth and experiences. Having a four ton animal by my side is one cool way to learn about the world and animals we share it with. For more information on South Africa, check out our South Africa Travel Guide About Author: Tiffany Soukup is an adventurer, writer and photographer. In the spur of the moment she moved out to Wyoming to live on the floor next to a washer and dryer and has never looked back since. Her and her husband Chris have been moving around the world since 2004. You can follow their stories at www.vagabondway.net , facebook , twitter , instagram and pinterest * * * Check out Addo Elephant National Park page for more info. South Africa national parks have outstanding accommodation options for visitors. The camp ground in Addo was not that big, unless you are traveling in low season, it would be a good idea to book ahead. We only camped in the national parks, but there is a range of other accommodation as well, be sure to book ahead. If you are an international visitor and going to be visiting national parks for about five days or more, make sure you get the WILD card. All visitors pay a day use fee to visit South Africa National Parks, even if you are also paying for camping or accommodation. At the time of writing, the WILD card cost ~$230 USD for two people and is excellent value. We met multiple travelers who originally thought they would not spend as much time in the national parks only to regret later not buying the pass. It is a good deal. Buy it. There is a decent restaurant in the park. After a long, hot afternoon of game driving the milk shake we got from there hit the spot. There is also a small store with basic food goods and souvenirs.", "external_links": [], "published": "2015-08-12T14:00:00.000+03:00", "crawled": "2015-08-12T15:17:57.969+03:00", "highlightTitle": ""}