{"organizations": [], "uuid": "c256079e0cc1564ad6eb0607684a55624b5095ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25694", "country": "", "title": "Adelaide targets SE Asia for major campaign push", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "Adelaide targets SE Asia for major campaign push", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "c256079e0cc1564ad6eb0607684a55624b5095ab"}, "author": "Paige Lee Peiqi, Singapore, August 19, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25694", "ord_in_thread": 0, "title": "Adelaide targets SE Asia for major campaign push", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Adelaide targets SE Asia for major campaign push Paige Lee Peiqi, Singapore, August 19, 2015 \nADELAIDE is gearing up to launch an extensive campaign in South-east Asia early next year to spotlight the city as an appealing destination that is on par with other major cities in Australia. \n\nSpeaking to TTG Asia e-Daily , Rodney Harrex, South Australia Tourism Commission’s chief executive, said: “There is a need for us to raise awareness about our destination because there is so much we can offer but no one knows about it.” \n\nHighlighting Adelaide as Australia’s wine capital, where 74 per cent of the country’s wine exports originate, Harrex said: “This is where all the premium wine come from and we have a lot of experiential offerings to provide with that.” \n\n“There has also been a lot of changes in the city over the past few years like new hotels, restaurants and bars that inject a lot of energy into the city,” he added. \n\nAs the “gateway to the Outback”, Harrex pointed out that Kangaroo Island, which is a 30-minute flight from Adelaide, is the best place in Australia to see native animals in a wild coastal setting. \n\nWhile acknowledging that first-time visitors to Australia are typically lured to main cities like Sydney and Melbourne, Harrex commented that Adelaide will offer \"new things\" for repeat visitors. \n\nDana Urmonas, regional director, South-east Asia and India at South Australia Tourism Commission, declined to provide further details about the campaign as it is still in its planning stages, but revealed that the overall budget allocated for Malaysia and Singapore this financial year is approximately A$1 million (US$0.7 million). \n\nAccording to Urmonas, Adelaide’s top visitor arrivals from the Asian markets are China, India, Malaysia and Singapore. \n\nCome December this year, Adelaide will also play host to Australia's largest business events showcase – Dreamtime 2015 .", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-20T08:42:49.539+03:00", "highlightTitle": ""}