{"organizations": [], "uuid": "eb7a141c35483eceae5c8d04adabf37bf41125b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/08/05/travel/images/30265942-01_big.jpg", "site_section": "http://www.nationmultimedia.com/home/rss/travel.rss", "section_title": "NationMultimedia.com - Travel", "url": "http://www.nationmultimedia.com/travel/Spa-sensations-for-mum-30265942.html", "country": "TH", "title": "Spa sensations for mum", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "Spa sensations for mum", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T21:00:00.000+03:00", "replies_count": 0, "uuid": "eb7a141c35483eceae5c8d04adabf37bf41125b6"}, "author": "", "url": "http://www.nationmultimedia.com/travel/Spa-sensations-for-mum-30265942.html", "ord_in_thread": 0, "title": "Spa sensations for mum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » travel » Spa sensations for mum GETAWAYS THE NATION August 5, 2015 1:00 am \nAnantara Bangkok Riverside Resort & Spa Mothers are invited to choose a 90-minute massage or treatment from a menu that includes Royal Thai Massage, De Stress Massage, ... BANGKOK Spa sensations for mum Anantara Bangkok Riverside Resort & Spa celebrates Mother's Day with a luxurious experience at its spa. Mothers are invited to choose a 90-minute massage or treatment from a menu that includes Royal Thai Massage, De Stress Massage, Body Scrubs or Elemis Skin Specific Facials. The price Bt5,000 for two people with a gift voucher for a complimentary seafood and BBQ buffet dinner at Riverside Terrace or an exclusive Anantara Spa homecare gift. Call (02) 476 0022 Extension 1563 or email: ariv_spa@anantara.com. PHUKET A fine romance Indigo Pearl, a boutique resort in Phuket, invites lovers of any age to rekindle their passion with its special \"Carpe Noctem: Seize the Night\" package designed to spice up any relationship. Priced at Bt14,000, the package covers one night in a Premium Pearl Suite, airport transfers, three-course dinner, 60-minute spa treatment and breakfast. The deal is good from now until September 30 with the exception of the period from September 6 to 10. Call (076) 327 006 or visit Indigo-Pearl.com. And mother came too Regent Phuket Cape Panwa is offering an extra special Mother's Day promotion throughout this month with a single night going for Bt7,500 in a Sea View Cape Suite and Bt12,500 in a Sea View Pool Villa. Breakfast for two is included as is a 90-minute massage for mum with the purchase of another 90-minute massage. Guests may be asked to certify their mother-child relationship. Call (076) 318 888 or email: reservations. phuket @regenthotels.com. Visit www.RegentHotels.com/ phuket . LAOS Travel night out Hotel de la Paix Luang Prabang, along with its sister property, the 3 Nagas Luang Prabang, introduces a special promotion for those working in the tourism industry, such as hoteliers, airline staff and tourist guides. The package covers one night in 3 Nagas for US$63 or Hotel de la Paix for $100 including suite accommodation, a la carte breakfast, 50-per-cent discount on single spa treatment and cooking class and savings of 20 per cent on food and drink. The Luang Prabang Travel Industry Offer is valid through October 31. Call (+856 81) 260 777 or email: rsm@hoteldelapaixlp.com or sm@hoteldelapaixlp.com. SAMUI Island in the sun U Koh Madsum Samui , a single resort on a private island 40 minutes away from the hustle and bustle of Koh Samui , is currently offering an All-Inclusive Vacation Package starting at Bt7,059 per person. Available from now until October 31, the offer includes two nights in a Tented Villa (twin sharing), daily breakfast and dinner set, roundtrip transportation from Samui airport to hotel by car and boat, minibar and Wi-Fi. Reservation at least 7 days in advance is required. Call (077) 953 009 or e-mail: reserve@ukohmadsumsamui.com. Visit www.UKohMadsum Samui .com. SINGAPORE Cooking up a storm From now to October 31, three Hotel Clover properties in Singapore (Hotel Clover Hong Kong Street, Hotel Clover The Arts and Hotel Clover Jalan Sultan) are offering guests a room-stay package that comprises a hands-on cooking class in the home kitchen of one of Singapore's most experienced tutors, Ruqxana Vasanwala of Cookery Magic. A two-night stay for two starts from S$540 depending on room type and selected hotel. |E-mail enquiries@hotelclover.com and quote Clover Wok Star. Visit www.HotelClover.com 273 Viewed", "external_links": [], "published": "2015-08-04T21:00:00.000+03:00", "crawled": "2015-08-05T02:28:03.324+03:00", "highlightTitle": ""}