{"organizations": [], "uuid": "2f218f6a42ed323dac21c886635bad631aadfa02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297731575128_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/travel/archives", "section_title": "Travel | August 2015 | Toronto Sun", "url": "http://www.torontosun.com/2015/07/31/summer-on-the-slopes-party-never-ends-at-vail-resorts", "country": "CA", "title": "Summer on the slopes: Party never ends at Vail Resorts | USA", "performance_score": 0, "site": "torontosun.com", "participants_count": 3, "title_full": "Summer on the slopes: Party never ends at Vail Resorts | USA | Travel | Toronto", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T18:00:00.000+03:00", "replies_count": 2, "uuid": "8ff5e35c5fd6180c8e18a451fb50253609823854"}, "author": "Keaton Robbins, Postmedia Network", "url": "http://www.torontosun.com/2015/07/31/summer-on-the-slopes-party-never-ends-at-vail-resorts#post-0", "ord_in_thread": 0, "title": "Summer on the slopes: Party never ends at Vail Resorts | USA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sometimes the less information you about a place, the better.\nI arrived in Colorado for a ski trip shortly after Easter, only to have my preconceived notions of Vail, the mother of ski mountains, ripped to shreds.\nI started the trip imagining Vail as a prissy secluded ski town stuck in the '90s. You know, full of wealthy couples in neon-coloured jackets, and grinning ear-to-ear.\nI pictured it as something similar to Lloyd Christmas's day dreams of Aspen -- another upscale Colorado ski resort -- as he trekked across America to find the dishy Mary Swanson.\n\"Someplace warm. A place where the beer flows like wine. Where beautiful women instinctively flock like the salmon of Capistrano,\" Christmas -- a goofy slacker played by Jim Carrey, said of the luxurious ski village in the first Dumb and Dumber film.\nIt turns out those notions would be only partially true of Vail.\nWarm? Kind of.\nWine flowing? Certainly.\nWomen flocking? Maybe with their kids.\nI showed up at the Osprey at Beaver Creek, part of Vail Resorts, on the last week of ski season in absolute awe and wonderment at the towering mountains surrounding me.\nMuch to my surprise, the mountains were still bustling with skiers trying to squeeze in their last few sessions. Shops, pubs and restaurants were just as jammed, proving to me -- a new skier -- that maybe the fun resided at the bottom of the hills.\nApres ski with free champagne toasts every afternoon at 3, outdoor skating rinks, elaborate outdoor swimming pools -- even a few nightclubs -- meant I had some work to do.\nAnd once the snow melts, the fun doesn't end, it just shifts focus.\n\"There's lots to do in the summer here, too -- mountain biking, kayaking, white-water rafting, rock climbing,\" said Taylor Prather, who works for the town of Vail.\nNo kidding.\nGore Creek, which runs through the village, is used for white water rafting or \"river tubing,\" Prather said.\nAnd there are music, art and culinary festivals going on almost every week throughout the summer.\nAs I ventured through the never-ending ski villages, the Christmas theme continued to follow me.\nEvergreen trees, decked out with lights and situated in the middle of roundabouts, are lit up every night. And visitors don't have to look hard to find a few Christmas-themed stores in the Vail village.\nYou know, just in case you want a wreath and some silver bells in August.\nThe village does have much more to offer though -- most notably quality food.\nQuaint restaurants include Tavern on the Square, which serves tons of craft beers (be sure to try the Milk Stout from Left Hand Brewing Co.).\nMatsuhisa Vail -- where legendary chef Nobu Matsuhisa blends traditional Japanese cuisine with South American flavours -- is also a must visit. Think sushi and sashimi with jalapenos. (Tip: Ask for any off-the-menu item).\nA quick lift trip up Vail mountain on Gondola One brought me to The 10th, an upscale chalet with picture-perfect views of the Gore Range and killer french fries.\nYes, it's worth the trip up the mountain for the french fries. But we're not just talking any old fry. I'm talking golden fries from the high heavenly realms: Hand cut with black-truffle-salt and parmesan.\nIn Vail, every ordinary food item has been hijacked and transformed into a dish likeyou've never had before.\nThe dining highlight was Flame, a top-notch steakhouse in the gorgeous Four Seasons Resort.\nExecutive Chef Kevin Erving and his staff offer up world-class steak and tremendous insight on each dish. (Make sure to order a medium rare Wagyu New York steak from 7X farms.)\nIf you're lucky, you may be invited to check out the private burger bar in the kitchen or have dessert phenom Cassie make you one of her \"adult milkshakes,\" in flavours such as maple-bourbon.\nErving and his crew were nice enough to invite me to one of Vail's favourite spring events, the Taste of Vail American Lamb Cook-off.\nHeld annually near the end of ski season, the Taste of Vail is a showcase for the village's finest chefs, restaurant owners and winemakers from almost 50 of the top wineries around the U.S.\nThe Lamb Cook-off featured many rich dishes that stuck to my gut. It was lamb anyway you can imagine. Lamb fajitas, lamb sausages, lamb salamis, you name it.\nThere was no shortage of wine either. I bumbled my way into the Debut of 2014 Roses event and sampled copious amounts of rose. Let's just say I was looking a little pink after the second annual event.\nIt wasn't all rosy though. I set down my Taste of Vail tickets on a table and within minutes someone had snagged the folder. Even in this posh crowd, tickets were hard to come by.\nThere was a happy ending to the afternoon.\nAndre Swanson (a distant relative to Mary perhaps?) from the Harvest Wine Co. was the life of the party and the Le Vigne di Alice Ose Prosecco distributed by his company wasn't shabby either.\n\"The wines are flowing like beer here,\" Swanson said as he poured me a glass.\nAfter the rose ran dry, I made a quick stop at the Tenth Mountain Whiskey and Spirit Company tasting room for some of their moonshine, vodka and well known whiskey.\nThank goodness for the free bus service in the village.\nAfter a few days of nonstop eating and drinking, it was time to recover and \"sweat it out.\" The Lodge at Vail spa was exactly what I needed.\nA sauna room, steam room, hot tub, an endless supply of free skin lotions, combined with a little Enya playing in the background made for the perfect peace palace.\nAfter an hour or so of \"zenning out,\" I was captivated by the showers that shot water from four different angles.\nSometimes the little things are the most intriguing.\nBoth Beaver Creek and Vail are extremely family friendly resorts but also have a great scene for twenty-somethings looking to party. The greatest example of this was the boarders in bras and short-shorts that were partying hard at 11 a.m. on a Tuesday.\nThere's Apres ski and then there's whatever this was: A whole crew of hooligans whooping it up on a deck in the middle of the mountain.\nBeing the last week of the season, things were getting a little nutty.\nBut, more importantly, it did prove to everyone on the mountain that the party never stops in the Rockies.\nResorts not going to pot\nUnlike Lloyd Christmas and his wild goose chase after Mary Swanson, I was on the lookout for another kind of Mary -- Mary Jane.\nBut I learned that the legalization of small amounts of marijuana in Colorado really hasn't affected Beaver Creek and Vail much, if at all.\nNo head shops in resorts. No sign of weed anywhere. It's like Amendment 64 never happened.\nVail Resorts spokeswoman Rosalie Waxman said there hasn't been an increase of pot tourists to their Vail and Beaver Creek resorts because weed isn't actually legal on the mountains.\nAlthough marijuana is legal in the state, both mountains are on U.S. Forest Service land, meaning they fall under federal law. Any skier or snowboarder found smoking weed anywhere on the resorts faces a fine of up to $1,000 US, according to the Colorado Ski Safety Act.\nFor those looking for the stinky stuff, there are some shops in the small towns around the resorts.\n\"We're not going to promote pot tourism,\" Waxman said. \"The people who are going to come for that don't need to be marketed to.\"\nNEED TO KNOW\n-- For information on Beaver Creek and Vail, check out beavercreek.com and vail.com . For trip planning,see beavercreek.com/planyourtrip/plan-your-trip-summer.aspx .", "external_links": ["http://beavercreek.com/planyourtrip/plan-your-trip-summer.aspx"], "published": "2015-08-02T18:00:00.000+03:00", "crawled": "2015-08-03T08:41:40.529+03:00", "highlightTitle": ""}