{"organizations": [], "uuid": "6053c79cccdcd336a94fdac03420a24589d85330", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/discover-the-backstreets-of-kensington.html", "country": "US", "title": "Discover the Backstreets of Kensington", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Discover the Backstreets of Kensington", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T09:43:00.000+03:00", "replies_count": 0, "uuid": "6053c79cccdcd336a94fdac03420a24589d85330"}, "author": "Lisa Jeeves-2015-08-18T07:43:42-0400", "url": "http://www.articlesfactory.com/articles/travel/discover-the-backstreets-of-kensington.html", "ord_in_thread": 0, "title": "Discover the Backstreets of Kensington", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  18, 2015 \nThe network of backstreets around the Kensington hotels can make for a wonderful journey of discovery. Take a walk and enjoy the history of the area. \nIf you’re staying on one of the many excellent Kensington hotels, take the time to enjoy a stroll around the Royal Borough of Kensington and Chelsea’s interesting backstreets. \nLondon’s backstreets – avoid or explore? \nWhen you visit some capital cities of the world, it’s probably wise to take local advice before venturing off of the main thoroughfares and into the backstreets. In fact, the word ‘backstreet’ for many has negative connotations, of the ‘avoid at all costs’ sort. \nYet London, at least in many of its inner city areas such as Kensington and Chelsea, isn’t so much like that. By some international standards it is still a relatively safe city to explore, and that offers a great opportunity to get off the beaten track. \nSo what's to see? If you're staying in one of the Kensington hotels close to the main tourist sites like Buckingham Palace and the Science Museum, some of the backstreets of Kensington and Chelsea are definitely worth a look in their own right. Sadly, tourists often bypass them, and some really interesting things are missed as a result. \nSt Mary Abbot's \nSt Mary Abbot’s Charity School isn’t typically on many tourists’ 'must see' list but it’s actually a charming old building. In 1712, blue-coated boy and girl statues were erected on the building with an ostensibly religious message in the boy’s hand, quoting words to the effect of 'I was naked and you clothed me'. However, it might not be quite so simple as that. If you look at the expression on the young woman’s face it’s difficult to conclude that she’s taking the young man’s sentiment as an expression of purely religious fervour. Is it innuendo or religion? It’s your call! \nFamous residents \nAnother very interesting pastime, if you’re into such things, is to walk around ‘Blue Plaque’ spotting. These are the plaques inset into the walls of sometimes uninspiring buildings telling you that famous events took place there or they were once home to famous people. For example, Kensington Court Gardens is a slightly intimidating and architecturally uninteresting (if up-market) Victorian tenement block, but it was once the home of T.S. Elliot. Another good example is 58 Sheffield Terrace, which is where you’ll find the blue plaque to signify that this was Agatha Christie’s home. There are plenty more, you just need to wander around and keep an eye out. \n’ll come across numerous small courtyards and tiny back-alleys where time has stood still. Gone are the 21st century glass and double-glazed façades, and here you’ll see areas that are not public-facing where some original 18th or earlier 19th century architecture has been preserved. It’s a chance to sense that bygone world of J.M. Barrie that was an inspiration in his creation of Peter Pan. \n‘off the beaten track’ walking routes and itineraries so you can discover the best of this wonderful, historic area. Free Articles from ArticlesFactory.com \nKensington hotels . This wonderful hotel embodies the true flavour of Kensington, with its traditional regency-style façade and superb facilities. Whether you're looking for accommodation in London for business or leisure, the Regency offers an effortlessly elegant experience.", "external_links": [], "published": "2015-08-18T09:43:00.000+03:00", "crawled": "2015-08-18T15:40:14.462+03:00", "highlightTitle": ""}