{"organizations": [], "uuid": "7b7bcf4f09c10f74e9174c3262d735b74f5d80ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.phoenixnewtimes.com", "main_image": "http://images1.phoenixnewtimes.com/imager/u/original/7528552/utah-umoca-mallno2.jpg", "site_section": "http://www.phoenixnewtimes.com/topic/travel-6498463", "section_title": "Travel | Phoenix News and Events | Phoenix New Times", "url": "http://www.phoenixnewtimes.com/arts/7-things-to-do-in-utah-this-summer-7527740", "country": "US", "title": "7 Things To Do in Utah This Summer", "performance_score": 0, "site": "phoenixnewtimes.com", "participants_count": 1, "title_full": "7 Things To Do in Utah This Summer | Phoenix New Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T16:00:00.000+03:00", "replies_count": 0, "uuid": "7b7bcf4f09c10f74e9174c3262d735b74f5d80ac"}, "author": "Lynn Trimble", "url": "http://www.phoenixnewtimes.com/arts/7-things-to-do-in-utah-this-summer-7527740", "ord_in_thread": 0, "title": "7 Things To Do in Utah This Summer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tony Feher, detail of the site-specific installation They arrived yesterday, dusty and weary from the journey, but in good spirits , Utah Museum of Fine Arts, October 3, 2014–December 31, 2015. Courtesy of Utah Museum of Fine Arts For some, the word Utah conjures only images of Mormon temples and the Great Salt Lake. But there’s far more to see in our neighboring state to the north, as it's also home to a cool assortment of arts and culture offerings. We’ve found seven worth checking out if you’re in the mood for some summertime travel not too far from home.\nEXPAND Work featured in the 2014 \"Mall no. 1\" exhibition at Utah Museum of Contemporary Art. Courtesy of 7D8 and C. Project Utah Museum of Contemporary Art\nThis contemporary art museum, located in Salt Lake City, is opening several new exhibitions in August. Starting Friday, August 14, you can see “Mall no. 2,” an exhibition exploring “innovative models of consumerism in the digital age.” It’s an especially relevant topic for art aficionados keen on pondering ways society’s shift from occupying physical to online spaces is impacting the creation, exhibition, and acquisition of art. It’s also opening day for the multisensory exhibition “Stock Images of War” featuring works by Amalia Ulman meant to “deconstruct connotations of war in western pop culture.” Exhibitions opening in late August include “Grandma’s Cupboard,” which “traces the social, political, and aesthetic threads” in the practice of renowned conceptual artists Kate Ericson and Mel Ziegler. Find more information on the UMOCA website .\nMelinda Pfundstein as Katherine and Brian Vaughn as Petrucio in the Utah Shakespeare Festival's 2015 production of The Taming of the Shrew . Karl Hugh, Copyright Utah Shakespeare Festival Utah Shakespeare Festival\nEven as most Arizona theater companies lay low between seasons, Utah Shakespeare Festival is kicking it into high gear – presenting six diverse theater works in a lovely little town called Cedar City. Shakespeare offerings include King Lear , The Taming of the Shrew , and Henry IV Part Two . Others include the musical South Pacific , and the plays Amadeus and Charley’s Aunt . Hit King Lear to get your tragedy fix and The Taming of the Shrew for a good dose of comedy delivered by actors wed in real life. If you’ve got time for just one more, make it South Pacific . The vocal performances are spectacular. While you’re there, check out the Southern Utah Art Invitational, and do the sculpture walk, at Southern Utah University. There’s more sculpture in the neighboring town of St. George, which brings in new pieces each year. Find more information on the Utah Shakespeare Festival website .\nRelated Stories 10 Things to Do in New York City This Summer 13 Best Metro Phoenix Tourist Attractions That Are Fun for Locals, Too 9 Best Things We've Seen in Metro Phoenix in 2015 — So Far Exterior of City Public Library in Salt Lake designed by architect Moshe Safdie. BellaOra Studios/Courtesy of Salt Lake City Public Library The City Library\nArchitecture buffs will delight in seeing the main library in Salt Lake City, which was designed by Moshe Safdie, an Israeli-Canadian architect whose projects have included the Habitat 67 apartment complex created for the 1967 Montreal Expo — which looks like a maze of today’s trendy stacked shipping container units. Safdie went on to design the National Gallery of Canada in Ottawa and the Yad Vashem Holocaust History Museum in Jerusalem. The library has an art gallery and several distinct features from rooftop garden to spiraling fireplaces. It’s also home to impressive public art offerings — including Psyche , a suspended head comprising more than 1,500 small book and butterfly sculptures created by Boston artists Ralph Helmick and Stu Schecter. Find more information on the Salt Lake City Public Library website .\nImages from October 20, 2012, Sun Tunnels viewing with Nancy Holt, organized by the Utah Museum of Fine Arts (UMFA) as part of \"Nancy Holt Sightlines,\" a traveling exhibition organized by the Miriam and Ira D. Wallach Art Gallery, Columbia University, on view October 19, 2012-January 20, 2013 at the UMFA. Courtesy Utah Museum of Fine Arts. Courtesy Utah Museum of Fine Arts Land Art\nThe Utah Museum of Fine Arts located on the campus of The University of Utah in Salt Lake City advocates for some pretty spectacular works of land art — including Robert Smithson’s Spiral Jetty and Nancy Holt’s Sun Tunnels . Smithson’s piece is a coil measuring 1,500 feet long and about 15 feet wide, which he created with black basalt rock, salt crystals, earth, and water at the Great Salt Lake’s Rozel Point. Holt’s Sun Tunnels located at the Great Basin Desert in northwestern Utah is a large-scale installation comprising four concrete cylinders arranged in a cruciform pattern. Museum materials offer tips for visiting these sites, but those who prefer the comfort of a museum environment can simply head to the museum — which opens “Brian Bess: Make Your Own Friends,” featuring video, sculpture, and works on paper created by the Los Angeles artist during the last decade, on Friday, September 18, just as summer is drawing to a close. While you're there, look for New York artist Tony Feher's installation created entirely with fluorescent pink flagging tape and blue painter's tape. Find more information on the Utah Museum of Fine Arts website .\nEXPAND Exterior of artist Maynard Dixon's home in Mt. Carmel, Utah. Thunderbird Foundation Maynard Dixon Country\nFamed artist Maynard Dixon, whose work you know well if you’ve visited Western Spirit: Scottsdale’s Museum of the West , moved from San Francisco to a small Utah town called Mt. Carmel in 1939. Folks can tour his restored, log-cabin style home — and those who head to Mt. Carmel from August 21 to 23 can attend an art invitational called Maynard Dixon Country, which features Western art by nearly three dozen artists. The invitational raises money for The Thunderbird Foundation of the Arts and the Maynard Dixon Living History Museum. Located in Southern Utah, it’s close to both Zion National Park and Coral Pink Sand Dunes State Park – so you can spend some time enjoying the great outdoors while you’re there. Find more information on the Thunderbird Foundation for the Arts website .\n2014 Craft Lake City DIY Festival in Salt Lake City, Utah. Martin Rivero, Courtesy of Craft Lake City Craft Lake City DIY Festival\nThis year's festival, taking place Friday, August 7, and Saturday, August 8, at the Gallivan Center in Salt Lake City, features all sorts of arts and crafts with a localist vibe. Festival offerings include works by more than 200 local artists, dance and music performance, a kid's area complete with collaborative mosaic mural project, STEM (science, technology, engineering, and math) displays and demonstrations, food trucks, and more. Find more information on the Craft Lake City website .\nGallery MAR, which participates in the Park City Gallery Stroll. Courtesy of Gallery MAR Park City Gallery Stroll\nThe Park City Gallery Association holds a Gallery Stroll the last Friday of every month – making August 28 your next chance to give it a try. It looks like several of their galleries are presenting cool exhibitions in August — showing Works Progress Administration (WPA)-era serigraphs used to advertise the country’s national parks, felted wool objects serving as artifacts from a former frontier, a multidisciplinary collaboration by an Icelandic artist and Utah-based composers, and more. Find more information on the Park City Gallery Association website .\nIf you’re doing the arts and culture thing in Salt Lake City, make sure you spend some time enjoying public art along the light rail – which includes some impressive fare.\nFollow Lynn Trimble Use Current Location Related Location miles Scottsdale Museum of the West More Info More Info 3830 Marshall Way\nScottsdale, AZ 85250\n480-686-9539\nwww.scottsdalemuseumofthewest.com\n ", "external_links": ["http://www.slcpl.org/branches/view/Main+Library", "http://www.parkcitygalleryassociation.com/", "http://craftlakecity.com/", "http://www.thunderbirdfoundation.com/maynard-dixon-country/maynard-dixon-country/", "https://twitter.com/phxculture", "http://www.utahmoca.org/", "http://www.twitter.com/phxculture", "http://umfa.utah.edu/", "https://maps.google.com/maps?q=Scottsdale+Museum+of+the+West,3830+Marshall+Way,Scottsdale,AZ,85250&z=12&ll=33.49244,-111.92856&iwloc=near&output=embed", "http://pinterest.com/jackaloperanch/", "https://www.facebook.com/phxculture", "http://saltlakepublicart.org/art-in-transit/"], "published": "2015-07-31T16:00:00.000+03:00", "crawled": "2015-08-01T12:57:45.363+03:00", "highlightTitle": ""}