{"organizations": [], "uuid": "e1ddc966dc2560dd21de3013b02ca4f4aff9a3d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28314-pphe-hotel-group-strengthens-uk-management-team-with-multiple-promotions", "country": "US", "title": "PPHE Hotel Group strengthens UK management team with multiple promotions", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "PPHE Hotel Group strengthens UK management team with multiple promotions", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T14:15:00.000+03:00", "replies_count": 0, "uuid": "e1ddc966dc2560dd21de3013b02ca4f4aff9a3d4"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28314-pphe-hotel-group-strengthens-uk-management-team-with-multiple-promotions", "ord_in_thread": 0, "title": "PPHE Hotel Group strengthens UK management team with multiple promotions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PPHE Hotel Group strengthens UK management team with multiple promotions PPHE Hotel Group strengthens UK management team with multiple promotions Details Category: Appointments   12:15 PPHE Hotel Group Limited, owner and operator of primarily full service upscale and lifestyle hotels including Park Plaza® Hotels & Resorts in Europe, art’otel and Arenaturist has announced the appointments of several key senior positions within the UK management team, commencing with immediate effect. “I am extremely pleased to welcome Axel, Dror, James and Jo to their new positions, which comes at such an exciting time for the development and expansion of the UK portfolio.” commented Greg Hegarty, Regional General Manager UK, PPHE Hotel Group. \n“We are delighted that so many of our senior appointments have developed their extensive hospitality and management experience within our hotels and join at such an important time for PPHE Hotel Group’s London openings across Waterloo, Park Royal and the South Bank vicinities. I’m confident that we have a strong team to support the operational and general management of the hotels to ensure the guest journey and satisfaction is still at the heart of everything we do.” Axel Krueger, formerly Operations Manager at Park Plaza Riverbank London and Plaza on the River has been promoted to the role of Hotel Manager following a successful two years at the hotel, which has continued to see an increase in levels of overall guest satisfaction. Krueger first joined PPHE Hotel Group as Food and Beverage Director at London flagship hotel, Park Plaza Westminster Bridge London, having gained extensive international management experience with Starwood Hotels & Resorts. As Hotel Manager, Krueger will take a leading role in the operational management and delivery of the hotel during its important refurbishment phase, and the addition of the hotel extension. Joining Krueger at Park Plaza Riverbank London and Plaza on the River as new Operations Manager is Dror Danino-Forsyth, who joins PPHE Hotel Group with over a decade of hotel management experience. Positions have included roles at the Hyatt Regency Jerusalem, and the world famous King David Hotel, where he oversaw operations as it achieved its highest ever recorded levels in occupancy and RevPar, as well as regularly hosting VIP guests and ambassadors. Danino-Forsyth will bring his dedication, experience and management expertise to the hotel as it enters its next phase of operation. Park Plaza County Hall London welcomes the appointment of James Doherty as Operations Manager. Doherty first joined PPHE Hotel Group five years ago as Reception Manager for the landmark opening of Park Plaza Westminster Bridge London, before being promoted to Assistant Front Office Manager within six months, a role which saw him lead the front office team in improving operational processes during the hotel’s opening phase, through to full business maturity. As Operations Manager at Park Plaza County Hall London, Doherty will use his proven track record of successful people management and excellent customer service provision to direct day-to-day operations at the major South Bank hotel. Doherty takes over the role from Jo Alder who, amongst other roles at PPHE Hotel Group has completed a successful three years at Park Plaza County Hall London and now moves to sister hotel Park Plaza Sherlock Holmes as the new General Manager. Alder’s time at County Hall saw her play a vital role in team development, enhancing operational procedures across front office, housekeeping, kitchen, meetings and events operations, as well as and the delivery of excellent customer service. As the new General Manager, Alder’s responsibilities at the 119 bedroom Baker Street hotel will include management of revenue generation, and operational workings across all departments. Related articles", "external_links": [], "published": "2015-08-18T14:15:00.000+03:00", "crawled": "2015-08-18T14:17:29.626+03:00", "highlightTitle": ""}