{"organizations": ["Hindustan Times"], "uuid": "4376090e11d65fe2a7fc0e391e3b1dbf2dc4b41b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/41374dc2-00cb-44b3-94eb-3d91e039c4dbMediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Travel\r", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/travel/right-click-using-technology-to-boost-tourism/article1-1383072.aspx", "country": "IN", "title": "Right click: Using technology to boost tourism", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Right click: Using technology to boost tourism", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T17:07:00.000+03:00", "replies_count": 0, "uuid": "4376090e11d65fe2a7fc0e391e3b1dbf2dc4b41b"}, "author": "", "url": "http://www.hindustantimes.com/travel/right-click-using-technology-to-boost-tourism/article1-1383072.aspx", "ord_in_thread": 0, "title": "Right click: Using technology to boost tourism", "locations": ["Mumbai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sneha Mahale, Hindustan Times , Mumbai | Updated: Aug 23, 2015 16:31 IST \nLast week, Agra's Taj Mahal got its own Twitter account. And if the Uttar Pradesh Tourism Department is to be believed, it is \"the first historical monument in the world\" to have one. \nThe handle, @TajMahal, already has over 16,000 followers, and is part of a unique project that aims to boost footfalls to the famous structure. But, it isn't the first initiative to use technology to draw in the crowds. A number of online projects around the world, and in India, have or are in the process of being set up to create awareness about art and culture, help conservation efforts, and even boost tourism. \nThe Taj Mahal made its debut on Twitter this month. \n\"Virtual reality has been around for some time now. However, online initiatives, like the Google Art Project, are now providing realistic 3D navigation of the world,\" says Amit Madhan, chief operating officer - IT & E Services, Thomas Cook. \nCulture calling This year, Mumbai's Dr Bhau Daji Lad Museum is collaborating with Google for its Art Project. Set to go 'live' soon, users will be treated to panoramic images of selected galleries and exterior depictions of the museum. The same initiative also helps people explore thousands of Indian and international artwork in stunning quality, as well as digital exhibitions that tell the stories behind these treasures. \n\"By creating these images, we hope to form new ways of telling the stories of India's rich cultural history and sharing more of our heritage with people right here in the country and around the world,\" says Amit Sood, director, Cultural Institute, Google. Furthermore, such projects give everybody a chance to visit places they can't easily travel to. And it clearly has many takers. From August 1, 2014, to July 31, 2015, it has had 240 million page views by 41 million users across the globe. \nGoogle Glass being used to bring art to life. (Photo courtesy: creativear.org) \nThen, last year, a research project was launched to bring art to life. It was trialled at the Manchester Art Gallery in the UK with the aim to explore how the Google Glass could be used in tourism. A prototype app was created that allowed visitors to find out more about a painting by taking a photo on the device's camera. \nBut it isn't just art galleries. Virtual reality has been increasingly making its way into the museum experience. Starting June, visitors to London's National History Museum could take in a 15-minute VR experience using Samsung Gear VR headsets, in which British presenter David Attenborough narrated a 3D journey depicting sea creatures from 500 million years ago. Similarly, Europeana has enlisted the Dutch design agency ArchiVision to create a virtual tour of masterpieces from the Dutch Rijksmuseum, viewable with the Oculus Rift. \nKaran Anand, head, relationship, Cox & Kings agrees, \"Such initiatives can provide art and travel enthusiasts a flavour of what's in store for them even before visiting a museum or an art gallery. This makes potential travellers extremely curious to see the real thing up close.\" \nSight seeing These projects also push people to explore lesser-known destinations or even places that they may feel are not all that accessible. In May, Son Doong's \"infinite cave\" went online. Visitors can now check out 360-degree panoramic views of key sections of the cave that is located in central Vietnam's Phong Nha-Ke Bàng National Park on a smartphone, tablet or desktop. Photojournalist Martin Edström, who clicked the images, hopes they will bring more people to this less-visited spot, which was discovered by explorers only in 2009. \n3D exhibit at the British Museum. \nGoogle's Street View, on the other hand, lets you check out the whole globe, from the summit of Mt Everest to the Great Barrier Reef, Australia. Launched in 2007, it quickly spread across the globe, now covering more than 50 countries. And the technology has several fans. \"When I wanted to sell a trip to Cambodia to my wife, I showed her the Angkor Wat via Street View. She was convinced. We made the trip in February,\" says Taran Singh, 32, a media professional. \nInto the wild Then, recently, to mark World Elephant Day (August 12), Vecotourism organised an online guided tour of Kitum Cave in Mt Elgon National Park, Kenya. The expedition covered five locations - from the park's front gates to the depths of Kitum Cave, where elephants have been mining salt with their tusks for generations. Similarly, on June 19, conservation organisations from around the world came together on social media to let virtual visitors experience the amazing diversity of life found in tropical rainforests. Sightings of species, from the orangutan to the hornbill, were shared with followers. \nThe aim of such tours is to boost conservation efforts offline, even as they create awareness about endangered species from around the world, and even underwater. The Catlin Seaview Survey on the Great Barrier Reef, for example, aims \"to scientifically record the world's coral reefs and reveal them all in high-resolution, 360-degree panoramic vision\". \nThe data collected will be monitored over time, to understand what's happening to the reefs. When it was launched in 2012, the survey included 32 reefs. Over 1,05,000 geo-tagged panoramic images covering 150km were captured. \nBrown bears in Alaska, USA. (Photo courtesy: Explore.org) \nAnd tourists are lapping it up. When Explore.org, a philanthropic multimedia organisation, set up nine cameras in 2013 that would live shoot brown bears as they converged near Brooks Falls at Alaska's Katmai National Park to catch salmon, the videos went viral. Anvesha Jha, 22, marketing executive, travelled to Alaska this year after watching them. She says, \"I felt a bond with some of the bears. They had distinct personalities. So, I made the trip to see a few up close and personal.\" \nTime travel With new technology coming in almost every year, usage of these tools gets increasingly innovative. Travel companies are already experimenting with live streaming. In June, Georama offered a four-hour real-time tour around Michigan's Mackinac Island in the US. It was billed as the first live-streamed tour of its kind in North America - and only the second in the world. \nAccording to state tourism board, it was watched by 3,000 viewers from every continent (but Antarctica), and got about 845 interactions. Earlier this month, the British Museum allowed its visitors to explore a 3D Bronze Age site. The exhibit was based on a Bronze Age roundhouse within a settlement, showing how objects might have been used in the past. And with augmented reality labs being set up around the world to study how wearable technology benefits tourism, a lot more can be expected on this front in the coming years. Tags", "external_links": [], "published": "2015-08-22T17:07:00.000+03:00", "crawled": "2015-08-23T16:24:22.918+03:00", "highlightTitle": ""}