{"organizations": [], "uuid": "33aeebce3a6763d6ad31dd9962120d2fabf6a472", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn2.scmp.com/sites/default/files/styles/620x356/public/2015/08/19/84dc4d4d25aabea12f4e28e9551efdb9.jpg?itok=uKmBKby4", "site_section": "http://www.scmp.com/rss/37/feed", "section_title": "South China Morning Post - Travel &amp; Leisure feed", "url": "http://www.scmp.com/magazines/post-magazine/article/1850851/big-blue-backyard-super-romantic-getaway-near-melbourne", "country": "HK", "title": "The Big Blue Backyard - a super romantic getaway near Melbourne", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "The Big Blue Backyard - a super romantic getaway near Melbourne | South China Morning Post", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "33aeebce3a6763d6ad31dd9962120d2fabf6a472"}, "author": "KATE SPRINGER", "url": "http://www.scmp.com/magazines/post-magazine/article/1850851/big-blue-backyard-super-romantic-getaway-near-melbourne", "ord_in_thread": 0, "title": "The Big Blue Backyard - a super romantic getaway near Melbourne", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Where is it? About an hour's drive south of Melbourne, the Big Blue Backyard sprawls across a private plot of lush land near the Mornington Peninsula's St Andrews back beach. Surrounded by woods, blossoming bushes and the vast ocean, the bed and breakfast feels like it's on the edge of the world.\nWho is it for? It's the \"perfect accommodation for romancing\", claims the website, and the three Bs is certainly unforgettable - thanks in large part to the welcoming husband-and-wife duo who own the place: Lisa and Paul Dempsey.\nWhat's the place like? One of the more mesmerising aspects of the three Bs has to be the stretch of forested land it calls its own. The check-in and dining area are located in the Dempseys' solar-panelled home (top), which is entered through a matrix of arched tea-tree branches that guests pass under, having correctly chosen one of a number of fantastical windy trails - another of which leads to cliffs and the windswept dunes that overlook the ocean.\nWhat are the rooms like? The three small cottages, dubbed \"hideaways\", were designed and decorated by the Dempseys. \"Beach\" (above) is decked out in fresh shades and handmade driftwood furniture; \"African\" (below) features brightly coloured cushions, hand-stained wood floors and crafts and curios collected on the Dempseys' many trips to the continent; and \"Bush\" comes complete with urban-chic details such as car tyres repurposed into a nightstand and paint-splattered floors à la Jackson Pollock. The cottages do have a few things in common, however: plush king beds, home-made cookies and a mini bar packed with local treats.\nHow's the food? Paul brings his training as a chef to the table, using locally sourced ingredients from Transition Farm, a biodynamic community sharing operation. For breakfast, expect just-baked bread, champagne-poached pears, cured meats, home-made guacamole, expertly prepared eggs and an entire tray of fresh fruit. Breakfast is included, but a splurge on a private dinner in your hideaway is highly recommended. Choose from a decadent, three-course, seasonally dependent menu - think chilli-lime prawns, Madagascar peppercorn steak and a crispy, airy pavlova with mixed berries.\nWhat's there to do? \"Do whatever you like or nothing at all!\" is the BBB motto. For the doing kind, there is a plethora of outdoorsy activities, romantic vineyards and sprawling beaches on the Mornington Peninsula. Look out for charming local operations such as Mornington Peninsula Chocolates, run by a couple who switched careers after seeing the film Chocolat ; Main Ridge Dairy, which offers cheese-making workshops and tours of the goat dairy; and Red Hill Cheesery, every product of which is specifically crafted to accompany a wine from the region. If you're after a romantic escape, be sure to take a tour through one of the myriad vineyards, which include the sophisticated Port Phillip Estate; the more casual Montalto Vineyard; and the much-adored Ten Minutes by Tractor. Top that off with a sunset dip in a private rock pool at the Peninsula Hot Springs.\nWhat's the damage? Hideaways start at A$695 (HK$4,000) a night and drop to A$595 if you book two consecutive nights. For details, visit www.bigbluebackyard.com.au .", "external_links": [], "published": "2015-08-22T03:00:00.000+03:00", "crawled": "2015-08-22T20:44:04.112+03:00", "highlightTitle": ""}