{"organizations": [], "uuid": "32c89e5e54e77402ffa321360483b5b8c92b17e1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/08/13/19/2B5720E000000578-0-image-a-9_1439490017244.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3196753/Emirates-announces-world-s-longest-non-stop-flight-Dubai-Panama-City-8-700-mile-journey-lasting-17-hours-35-minutes-bear-economy.html", "country": "GB", "title": "Emirates announces world's longest non-stop flight from Dubai to Panama City", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 9, "title_full": "Emirates announces world's longest non-stop flight from Dubai to Panama City | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T00:53:00.000+03:00", "replies_count": 8, "uuid": "4fc7c1b34e1648c926bb7f12bfc9faf4fe099098"}, "author": "Katie Amey for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3196753/Emirates-announces-world-s-longest-non-stop-flight-Dubai-Panama-City-8-700-mile-journey-lasting-17-hours-35-minutes-bear-economy.html#post-0", "ord_in_thread": 0, "title": "Emirates announces world's longest non-stop flight from Dubai to Panama City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "15 shares 9\nView\ncomments\nEmirates has announced the launch of the world's longest non-stop flight - an 8,700mile journey lasting an incredible 17 hours 35 minutes.\nStarting on February 1, 2016, the service from Dubai to Panama City is exciting news for those who love Central America, but it will be a stern endurance test for anyone in economy class.\nPanama City is Emirates' first gateway destination in Central America.\nScroll down for video\nBeginning on February 1, Emirates will begin a daily service between Dubai and Panama City\nIt's a mammoth journey, but Emirates insists that those flying economy will be well looked after\nPanama's largest city is an important economic and financial centre, as well as a gateway to Central and South America\nThe daily service will be operated by a Boeing 777-200LF aircraft.\nThree classes of seating will be available to book, including eight seats in first, 42 in business and 216 in economy.\n Next Forget glamping, try CRAMPING: The world's smallest caravan... Man, 20, is escorted off plane by police after 'sexually... Maybe Peter Jackson will chip in? Lord of the Rings fans... One in two parents are happy to take their children out of... 15 shares Flights will operate through Tocumen International Airport, which is located in the heart of the city.\nEmirates flight EK251 will depart Dubai at 08:05 and arrive in Panama City at 16:40 daily, and the return flight EK252 will leave Panama City at 22:10, arriving in Dubai at 22:55 the next day.\nOn the new route, all three classes - first, business and economy - will be available to book\nHow to paint an airplane in two minutes Panama City is not only just a gateway to further tropical destinations, it's also an important economic and financial centre.\nIt's also home to two of the busiest ports in Latin America, including the world's second largest free trade zone.\nCombine that with the ongoing expansion of the Panama Canal, and it's clear the the country's economic growth will only continue.\nFirst class passengers will enjoy gourmet food and top-notch wine on the long journey\n'Panama City will be our first destination gateway in Central America, providing a convenient option for our passengers travelling from or through our global hub in Dubai and onward to destinations throughout Central America, the Caribbean and the northern part of South America,' said His Highness Sheikh Ahmed bin Saeed Al Maktoum, Chairman and Chief Executive of Emirates Airline & Group.\n'We're also pleased to be the only commercial airline to offer a daily, first class service to travellers on what will be the world's longest non-stop flight.'\n'It is gratifying to see how diplomatic efforts focused on generating development and prosperity for Panama materialise,' said Isabel Saint Malo de Alvarado, Vice President of the Republic of Panama.\n'New doors to the country will open with a direct connection to the Middle East - a strong and thriving region with great synergies to both Panama and Latin America.'\nThose sitting in first class will also have access to an onboard bar and lounge - which you will undoubtedly need for a nearly 18-hour flight\n'This new direct flight between Dubai and Panama City will connect Latin America with the Middle East, Asia and Africa,' explained Eduardo Fonseca Ward, Consul General of the Republic of Panama, in Dubai.\n'This link will generate a broader global network with countless commercial and cultural opportunities for the two regions.\n'It has been a pleasure to work with the Emirates team, who have shared the vision of Panama and Dubai as hubs of trade, prosperity and hope.'\nEmirates insists that those flying economy class on the mammoth journey will be comfortable and well looked after.\nA spokesperson for the airline told MailOnline: 'As with all Emirates flights, passengers flying Emirates economy class to Panama will be able to sit back and relax in spacious seats with plenty of leg room, whilst enjoying our award-winning entertainment system and gourmet meals crafted by our master chefs.\n'Our contoured seats recline with adjustable headrests for extra comfort, with blankets and pillows available.\n'Passengers throughout all classes can access over 2,000 channels of films, TV shows, music and games through ice, our award-winning inflight entertainment system, ensuring there is plenty of choice for everyone.\n'Children can enjoy TV, games and music selected especially for them, plus there are special magazines and toys on every flight, along with baby kits and a selection of prepared baby food.'\nLater this year, Emirates will be adding four additional routes to its global network including Mashhad, Iran and Orlando in September; Bamako, Mali in October; and Bologna in November.", "external_links": ["http://dailym.ai/1J6jEBU"], "published": "2015-08-14T00:53:00.000+03:00", "crawled": "2015-08-13T22:24:52.861+03:00", "highlightTitle": ""}