{"organizations": [], "uuid": "1ab8ebaf95e9f3e8c8226e44da275d3fb6e432e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.airwise.com", "main_image": "", "site_section": "http://news.airwise.com/travel-news.html", "section_title": "Travel News | Airwise ", "url": "http://news.airwise.com/story/canada-exempts-small-airlines-from-fatigue-rules", "country": "AU", "title": "Canada Exempts Small Airlines From Pilot Fatigue Rules", "performance_score": 0, "site": "airwise.com", "participants_count": 1, "title_full": "Canada Exempts Small Airlines From Pilot Fatigue Rules | Airwise News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "1ab8ebaf95e9f3e8c8226e44da275d3fb6e432e8"}, "author": "Reuters", "url": "http://news.airwise.com/story/canada-exempts-small-airlines-from-fatigue-rules", "ord_in_thread": 0, "title": "Canada Exempts Small Airlines From Pilot Fatigue Rules", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Canada's transport regulator has made smaller carriers exempt for now from long-delayed rules on pilot fatigue, handing a partial victory to the airline industry after intense lobbying. In a filing with the federal register, Canada Gazette, on Saturday, Transport Canada said it plans to cap duty time at nine to 13 hours depending on when shifts start, down from 14 hours, among other scheduling limits.\nBut it restricted the changes to bigger airlines, in contrast with a September draft that would have applied to the whole industry. It pledged to issue rules for the smaller carriers soon, but gave no further details.\nWith a federal election scheduled for October, it is not clear what will happen to the plan, in the works since 2010, which was meant to bring Canada in line with international safety standards.\n\"We should be talking about implementation right now,\" said Dan Adamus, president of the Air Line Pilots Association's Canadian board. \"We are extremely, extremely disappointed.\"\nTransport Canada said it determined that the new rules would have more of an impact on smaller operators: \"The introduction of the proposed changes in two phases would give smaller carriers more time to make the operational changes needed to meet the requirements.\"\nJohn McKenna, president of the Air Transport Association of Canada, was pleased with what he sees as a change of course from Transport Canada. He said the draft proposal had been too heavily influenced by pilots' unions.\nMcKenna, whose members include most Canadian airlines, but not Air Canada or WestJet, said his group lobbied Transport Minister Lisa Raitt after the draft was published, saying new rules could raise operating costs by up to 30 percent.\n\"They were kind of surprised to hear that and backed off a little bit, but the minister wanted to do something so she came up with a revised (proposal),\" he said.\nPilots in Canada can be scheduled to work for 14 hours, which is longer than in other jurisdictions such as the United States, Australia, the European Union and India. There, limits range from 9 to 13 hours depending on when a shift starts.\nMajor airlines typically have stricter limits on flight time than what Transport Canada requires. Air Canada said its practices \"far exceed\" the rules. But many smaller operators serving remote communities as well as mines and other industrial sites do not.\nDocuments obtained by Reuters news agency under Canada's freedom of information law show staff asked late last year for more time to look at alternative schemes proposed by the industry.\nA briefing note circulated internally in November and December said those proposals were \"not supported by fatigue science or necessarily aligned with international standards\", but still requested more time to \"work with industry\" and potentially tweak the rules.\nThe Gazette said commuter airlines, air taxis and operators that use aircraft to do aerial work like mapping and sightseeing would get their own rules \"as soon as possible as part of a future regulatory proposal.\"\nMcKenna said he expects those rules will be \"more realistic\" than those in the draft.\n(Reuters)", "external_links": [], "published": "2015-08-10T03:00:00.000+03:00", "crawled": "2015-08-11T08:24:12.041+03:00", "highlightTitle": ""}