{"organizations": [], "uuid": "3c5fa1b6b9d21a113932c0745f9fa05a0dd6e26e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/fitbit-5_600x400.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13243705/1/fitbit-fox-ralph-lauren-earnings-mortgage-report-what-to-watch-on-wednesday.html?cm_ven=RSSFeed", "country": "US", "title": "Fitbit, Fox, Ralph Lauren Earnings, Mortgage Report: What to Watch on Wednesday", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Fitbit, Fox, Ralph Lauren Earnings, Mortgage Report: What to Watch on Wednesday", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:15:00.000+03:00", "replies_count": 0, "uuid": "3c5fa1b6b9d21a113932c0745f9fa05a0dd6e26e"}, "author": "", "url": "http://www.thestreet.com/story/13243705/1/fitbit-fox-ralph-lauren-earnings-mortgage-report-what-to-watch-on-wednesday.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Fitbit, Fox, Ralph Lauren Earnings, Mortgage Report: What to Watch on Wednesday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ralph Lauren Earnings", "Fox"], "text": "Reprint \nNEW YORK ( TheStreet ) -- For Wednesday August 4, TheStreet highlights a handful of major companies ranging from media to technology that are posting their latest quarterly results. \nIt's a busy morning as multinational media corporation Time Warner ( TWX - Get Report ) , online travel booking company The Priceline Group ( PCLN - Get Report ) , and satellite service provider DISH Network ( DISH - Get Report ) are scheduled to report their earnings before the market opens. \nIn addition, luxury brands Ralph Lauren ( RL - Get Report ) and Kate Spade ( KATE - Get Report ) are also releasing their latest numbers. In the afternoon, mass media corporation Twenty-First Century Fox ( FOX - Get Report ) , along with tech giants Tesla ( TSLA - Get Report ) and Fitbit ( FIT ) are expected to release their earnings after the market close. The main focus though, will be on wearable fitness tracking company Fitbit. Investors have been closely tracking the pulse of the wristband maker. \nIt'll be its first quarterly report since the company went public in June. Analysts are expecting the company to earn $0.08 a share on revenue of $319.45 million. The quarterly report is expected to include figures on how many wearable units Fitbit sold along with the number of paid active users. Investors have been closely tracking the pulse of the wristband maker. It'll be its first quarterly report since the company went public in June. Analysts are expecting the company to earn $0.08 a share on revenue of $319.45 million. The quarterly report is expected to include figures on how many wearable units Fitbit sold and the number of paid active users. Overall, Wall Street firms have a healthy outlook on the stock. A large part of its sales will likely be made up of Fitbit's Charge HR device . According to analysts, the company is leading the fitness and wearable sector. Currently, shares are trading around $50, more than double its IPO price of $20. Meanwhile, on the U.S. economic calendar, the MBA Weekly Survey for the week ended in July 31, will be released at 7 a.m. Then at 10 a.m., the ADP Employment Report will be released, followed by the Energy Information Administration's weekly oil inventory data at 10:30 a.m. Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-08-05T03:15:00.000+03:00", "crawled": "2015-08-05T06:37:55.600+03:00", "highlightTitle": ""}