{"organizations": [], "uuid": "e83fcd77c51acd63bd71ae30b2a1ffe8f3b51443", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150809Vindassurf.jpg", "site_section": "http://www.ticotimes.net/categories/topics/sports", "section_title": "Sports Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/08/10/jaco-gold-chatting-with-costa-rican-surf-champion-lisbeth-vindas", "country": "US", "title": "Jacó gold: Chatting with Costa Rican surf champion Lisbeth Vindas", "performance_score": 0, "site": "ticotimes.net", "participants_count": 2, "title_full": "Jacó gold: Chatting with Costa Rican surf champion Lisbeth Vindas -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T16:07:00.000+03:00", "replies_count": 1, "uuid": "e83fcd77c51acd63bd71ae30b2a1ffe8f3b51443"}, "author": "Kate Hanley Heinemann", "url": "http://www.ticotimes.net/2015/08/10/jaco-gold-chatting-with-costa-rican-surf-champion-lisbeth-vindas", "ord_in_thread": 0, "title": "Jacó gold: Chatting with Costa Rican surf champion Lisbeth Vindas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "See also: Costa Rica crowned 2015 world surfing champion\nIt has already been an incredible year for Lisbeth Vindas. In July, the 11-time Costa Rican women’s champion surfer from the Central Pacific beach town of Jacó turned 35; she already has another National Title under her belt from the Women’s Open and a gold medal as part of Costa Rica’s National Team at the International Surf Association (ISA) World Surf Games in Nicaragua.\nI met Lisbeth approximately 18 years ago. She had already been surfing for two years, often with my younger sister Colleen Hanley Prior, who lived in Jacó at the time. I have long been impressed by her surfing style, especially in the big waves, and it’s great to see how far she has come in her surfing career.\nShe recently took some time to talk about her passion, life growing up in Jacó, and how it feels to be one of Costa Rica’s first pioneers of women’s surfing. Excerpts:\nTT: Tell us about growing up in Jacó and when you started to surf. There weren’t many other girls surfing or competing in Costa Rica at that time. What motivated you?\nLV: My grandpa was the first member of our family to live here in Jacó, and he surfed! I started on a boogie board twenty years ago; this is my twenty-year anniversary. Your sister actually told me, “What are you doing? Why don’t you get a surfboard?” and a couple days later I borrowed one of those big, classic, thick boards. I caught my first few waves and fell in love with it. I thought, “This is what I want to do. I want to be a professional and surf all over the world.”\nThere were only a few girl surfers back then. We had to look for girls just to make the finals in the beginning, but after a few years there were more of us. I went to high school, studied and surfed.\nPlaya Jacó is your “home break.” What do you want to say about this break?\nI surfed my first waves in Jacó, then right away started catching rides to Hermosa every time I could. I love Jacó: it’s a beach break and very easy for people to learn. You can find a lot of different waves around here. I surf all the breaks here. I like to try all the different types of waves.\nWhat are some other breaks you like to surf in Costa Rica?\nPlaya Escondida, La Isla, Damas, Quepos, Pavones for sure. Playa Negra, the Caribbean side… oh, there are so many places.\nWhat about breaks outside of Costa Rica?\nIt depends on whether we arrive there in swells. Fiji for sure has some of the most amazing, perfect waves. Mentawai Islands, Hawaii, Panama, El Salvador – so many good places. One of my favorites was the Mentawaiis and some good barrels in Fiji.\nTesting the medal.\nCourtesy of Lisbeth Vindas\nHow does it feel to have played a huge role in Costa Rica’s growth in women’s surfing and to be a part of the country’s international success in the sport?\nI’m very proud to be one of the first surfers in Jacó. I am seeing the results of everything I’ve worked for. It’s not something I deserve; it’s something I’ve earned. I worked for it, and I’m still here working hard and still have a lot of passion. I want to do really good things for the sport. I hope this sport keeps growing and we get more world champions.\nExplain how you have been able to balance being a wife and mom with your surfing lifestyle.\nI work really hard to strike a balance between everything. None of this would be possible without Donald Vega of balancenatural.com . He put me through a rigorous physical program and managed my lifestyle, including nutrition, mental and emotional health. I learned so much from him; he succeeded in helping me stay active and in a state of constant improvement at an age when most people [pro surfers] think of retiring.\nHe helped me so I can share my passion with my family. We all work together. Diego is an amazing dad. Julian is a very good kid and we try to enjoy everything we do as a family. Julian is already riding waves, so hopefully we can continue to enjoy that together, catching waves as a family.\nI believe I’m very blessed and am very thankful for this huge opportunity. Diego and I want to do a lot for the younger kids so they can improve and be professional and go around the world, enjoying this sport.\nTwo surfing friends of yours are [fellow Costa Rican stars] Leilani McGonagle and Paola Rodriguez. Describe what these friendships mean to you.\nWell, I’m so happy I can be an example for Paola and Leilani – well, Leilani is sometimes more of an example for me!\nIt’s funny because we are always working hard to beat each other [in competition], but in the end we are friends. It makes me work and train harder. I really enjoy competing against them. They work really hard, and I wish and pray for them that they can achieve their goals and dreams. I hope I can be part of that and even help them if I can.\nWhat is a challenge or personal goal that you have for the coming year?\nCosta Rica is starting to get scholarships from the government [for surfing]. I think I’m going to try to do some QS [Qualifying Series] events next year internationally. Ever since the World Games, we are getting more opportunities for our careers, so I will take advantage of that and keep working hard. Next year I hope we’ll see some World Surf League competitions in Costa Rica, and big stars can come and do the QS here. I’d like to work on finding more potential with some of the new kids. I’m not worried about competing and winning next year. I’m going to keep competing, but it won’t be my main thing.\nRead more “Surf’s Up” stories here .\nKate Hanley Heinemann fell in love with Costa Rica, its people, culture and waves, over twenty years ago on a surf trip with some family and friends. She has surfed a number of breaks up and down the Pacific coast, has taught in several of the private schools in the Jacó area, and continues to surf every chance she gets; her company Pura Vida Board Gear offers unique and fun board socks. A version of this interview originally appeared on the Pura Vida Board Gear blog . For more information, contact Kate through the company’s Facebook page .", "external_links": ["http://www.puravidaboardgear.com/blogs/news/52909059-lisbeth-vindas-diaz-national-champion-and-jacobena-celebrates-20-years-of-surfing-part-1", "http://balancenatural.com/", "https://www.facebook.com/PuraVidaBoardGear", "http://www.puravidaboardgear.com/"], "published": "2015-08-10T16:07:00.000+03:00", "crawled": "2015-08-12T07:01:07.637+03:00", "highlightTitle": ""}