{"organizations": [], "uuid": "b462433e0f0cdb4e0de4e2c0947511bca251f417", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/03/16/wall-street-xxx/ALTERNATES/crop_100x100/Wall+Street++XXX", "site_section": "http://www.bdlive.co.za/life/travel", "section_title": "Travel &amp; Food | BDlive ", "url": "http://www.bdlive.co.za/markets/2015/08/18/wall-street-europe-dip-after-chinese-stocks-tumble", "country": "ZA", "title": "Wall Street, Europe dip after Chinese stocks tumble | Markets", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "Wall Street, Europe dip after Chinese stocks tumble | Markets | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T01:34:00.000+03:00", "replies_count": 0, "uuid": "b462433e0f0cdb4e0de4e2c0947511bca251f417"}, "author": "Chuck Mikolajczak", "url": "http://www.bdlive.co.za/markets/2015/08/18/wall-street-europe-dip-after-chinese-stocks-tumble", "ord_in_thread": 0, "title": "Wall Street, Europe dip after Chinese stocks tumble | Markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Picture: THINKSTOCK NEW YORK — A 6% tumble in Chinese shares on Tuesday hit Asian stocks and dented US equities while copper and oil prices touched multi-year lows.\nA broad measure of Asian stocks fell to its lowest in two years and Wall Street traded lower as the Chinese yuan weakened against the dollar, once again triggering fears that Beijing may be intent on a deeper devaluation of the currency despite the central bank’s comment that it sees no reason for a further slide.\nA 3% fall in shares of Wal-Mart Stores Inc to $69.73 also weighed on US equities after the major retailer reported weaker-than-expected quarterly earnings and lowered its full-year forecast.\n\"The problem in China is that the markets haven’t been released for free and open trading and until that happens there is going to continue to be downside pressure,\" said Randy Frederick, managing director of trading and derivatives for Charles Schwab in Austin, Texas.\nThe Dow Jones industrial average rose 3.01 points, or 0.02%, to 17,548.19, the S&P 500 lost 1.12 points, or 0.05%, to 2,101.32 and the Nasdaq Composite dropped 12.48 points, or 0.25%, to 5,079.22.\nEarlier, China’s main Shanghai Composite and Shenzhen 300 indexes both lost more than 6% as investors bet demand in China will cool further.\nMSCI’s broadest index of Asia-Pacific shares outside Japan fell 1.1% to its lowest since August 2013. Japan’s Nikkei dipped 0.3%. MSCI’s all-country world stock index lost 0.25%. Britain’s FTSE 100 fell 0.3%. The pan-European FTSEurofirst index of 300 leading shares managed a gain of 0.3%, having been in negative territory much of the morning. Germany’s and France’s CAC 40 fell nearly 0.2%. The worries over China came on a day when trade in the yuan was relatively calm after Beijing fixed the currency’s exchange rate marginally higher for the third successive session.\nChina’s central bank on Tuesday set the yuan’s midpoint near Monday’s closing price at 6.3966 per U.S dollar. In the spot market, the yuan closed flat at 6.3938.\nConcerns about slowing growth in China also hit commodities, as benchmark copper prices slid to a six-year low of $4,989, below the psychological $5,000 a tonne level, and was last down 2.3% at $4,999 a tonne.\nBrent oil futures were down 0.6% to $48.46 per barrel, edging closer to a six-month intraday low of $48.24 touched last week. US crude futures rebounded to trade up 0.4 percent to $42.05, after hitting an intraday low of $41.43, close to their lowest since early 2009.\nInvestors will look to US inflation data and minutes of the latest Federal Reserve monetary policy meeting, both being issued on Wednesday, as they ponder when the Fed will begin raising interest rates.\nMarkets are still not fully convinced the Fed will raise rates in September, but most investors are betting a rate hike will occur by the end of year. Benchmark 10-year Treasury notes were last down 10/32 in price to yield 2.1854%.\nReuters", "external_links": [], "published": "2015-08-19T01:34:00.000+03:00", "crawled": "2015-08-19T01:19:28.544+03:00", "highlightTitle": ""}