{"organizations": [], "uuid": "e9d75e64411c1572d13061f8defe7c485faf7d8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/03/ASTA.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS Archives - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/asta-global-convention-attendees-get-first-peak-at-new-2016-event-the-asta-maui-showcase/", "country": "US", "title": "ASTA Global Convention Attendees Get First Peak at New 2016 Event—The ASTA Maui ShowcaseTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "ASTA Global Convention Attendees Get First Peak at New 2016 Event—The ASTA Maui ShowcaseTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "e9d75e64411c1572d13061f8defe7c485faf7d8f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/asta-global-convention-attendees-get-first-peak-at-new-2016-event-the-asta-maui-showcase/", "ord_in_thread": 0, "title": "ASTA Global Convention Attendees Get First Peak at New 2016 Event—The ASTA Maui ShowcaseTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ASTA Global Convention Attendees Get First Peak at New 2016 Event—The ASTA Maui Showcase Published on : Thursday, August 20, 2015\nThe American Society of Travel Agents (ASTA) is partnering with the Hawai`i Visitors and Convention Bureau and Starwood Hotels to bring travel consultants a new show in 2016—The ASTA Maui Showcase. The event will be held May 11-15, 2016, at the Westin Maui Resort & Spa on Ka’anapali Beach.\nSeparate from the ASTA Destination Expo, which is being held in Seville, Spain June 2-5, The Showcase will focus on Maui and the other two islands that make up the Maui Nui— Moloka`i and Lana`i. ASTA and NACTA members, as well as non-member travel professionals, will be invited to register for The Showcase for the first time during the ASTA Global Convention, which starts next week at the Omni Shoreham Hotel in Washington, D.C.\n“Travelers use agents most often to see exotic places,” said ASTA President and CEO Zane Kerby. Maui ranks consistently as one of the great aspirational places to visit. ASTA is providing the agency community with another opportunity in 2016 to learn a new destination and be able to advise their clients based on that personal experience.”\nAs an AGC attendee, agents will receive an on-site, one-time registration rate of $199. After AGC, an early bird rate of $249 will be available until Jan. 19. Attendees who register while at AGC also will receive a $150 credit per person toward airfare. And one travel consultant who completes a registration during AGC could win one roundtrip air ticket within North America, a three-night stay at the Westin and a complimentary registration to the show. The Hawai`i Visitors and Convention Bureau’s Senior Director of Travel Industry Partnerships, Robyn Basso, will conduct the drawing on the AGC trade show floor.\n“On behalf of the Hawai`i Visitors and Convention Bureau, our six extraordinary islands, and our Hawai`i hospitality partners, we are thrilled to host the 2016 ASTA Maui Showcase,” said Basso. “We look forward to welcoming ASTA?s travel professionals and providing the opportunity to further their destination education and product knowledge through seminars, networking, and destination experiences showcasing our beautiful and unique Hawaiian Islands.”\nIn addition, Chris Austin, vice president of sales for Starwood, said, “Starwood is thrilled to be the host for not only the ASTA Showcase at The Westin Maui, but also for the NACTA annual Conference at The Sheraton Kona in November 2015. Starwood remains steadfast in our support of the travel professional and the work that both ASTA and NACTA do on a daily basis to give a voice to the travel professional community.”\nSource:- ASTA", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T03:29:11.422+03:00", "highlightTitle": ""}