{"organizations": [], "uuid": "01e4545a8dc0e2d46275485b3226142b32696c41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55dc719b1400002e002e3e79.png", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/news.xml", "section_title": "Travel News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/kid-trips-kid-uses-million-dollar-painting-to-break-fall_55dc6b18e4b0a40aa3ac1342", "country": "US", "title": "Kid Trips, Uses $1.5 Million Painting To Break Fall", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Kid Trips, Uses $1.5 Million Painting To Break Fall", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T17:11:00.000+03:00", "replies_count": 0, "uuid": "01e4545a8dc0e2d46275485b3226142b32696c41"}, "author": "Katherine Brooks", "url": "http://www.huffingtonpost.com/entry/kid-trips-kid-uses-million-dollar-painting-to-break-fall_55dc6b18e4b0a40aa3ac1342", "ord_in_thread": 0, "title": "Kid Trips, Uses $1.5 Million Painting To Break Fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kid Trips, Uses $1.5 Million Painting To Break Fall This is why we can't have nice things. Katherine Brooks Senior Arts & Culture Editor, The Huffington Post. Posted: 08/25/2015 10:11 AM EDT YouTube \nAnother day, another museum fail. \nAccording to several reports , a 12-year-old gallery-goer in Taiwan was going about his business this week when he tripped in front of a million-dollar painting and used said million-dollar painting to break his fall. Cue so many shaking heads. \nYes, the young patron of the arts was caught on CCTV casually perusing a Leonardo da Vinci exhibition at Huashan Creative Park in Taipei when he stumbled, braced himself against some expensive art, and subsequently punched a hole in a 17th century Paolo Porpora oil painting titled \"Flowers.\" The footage shows that he was drinking a can of soda, before the soda became briefly lodged in \"Flowers.\" \nSome outlets initially reported that the rare 350-year-old piece, belonging to a private collector, would be shipped to Italy for restoration this week . \nHowever, an Information Center representative at Huashan Creative Park told The Huffington Post over the phone on Tuesday that the painting has already been repaired. \"We asked someone to help us who is handling the painting all the time,\" Julia Liao, another representative who sells tickets for the exposition, reiterated. \"It’s OK today.\" \nShe confirmed that the painting is back on display for now. \nThe 12-year-old's family will not be held financially responsible for the damage to the painting, thanks to good ol' insurance. But the kid with the can has become somewhat of an accidental YouTube star, and we're not sure State Farm covers that. \nAt the end of the day, the nameless art lover will probably fare better than that child who used a Donald Judd sculpture as his playground . Or how about that woman who peed on a Clyfford Still painting? \nIf you need a refresher course on museum etiquette, check our handy guide to not being the worst person in a gallery . Until then, we've said it before and we'll say it again: this is why we can't have nice things. \nAdditional reporting by Suzy Strutner.  20 Most Confusing Performance Art Pieces Of All Time of", "external_links": [], "published": "2015-08-25T17:11:00.000+03:00", "crawled": "2015-08-25T17:45:36.017+03:00", "highlightTitle": ""}