{"organizations": [], "uuid": "a1a6d03ccc6016676bfbb70340dbdfb857fabc3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62749/survey-results-uncover-new-traveler-segment", "country": "US", "title": "Survey results uncover new traveler segment", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Survey results uncover new traveler segment", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T22:32:00.000+03:00", "replies_count": 0, "uuid": "a1a6d03ccc6016676bfbb70340dbdfb857fabc3a"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62749/survey-results-uncover-new-traveler-segment", "ord_in_thread": 0, "title": "Survey results uncover new traveler segment", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Survey results uncover new traveler segment   \nAug 18, 2015 eTN   \nMCLEAN, VA - A recent survey on behalf of Hilton Worldwide’s global brand Hampton by Hilton uncovered a new type of traveler that has been defined as the “Seekender.” This new group regularly takes advantage of weekends to spontaneously enjoy new experiences, with travel being at the top of the list. The study, conducted by Wakefield Research*, also revealed that Seekenders base their travel around four main types of activities/passions: food, sports, music or the great outdoors. Respondents across different generations also agreed that hitting the road for adventure and having experiences in life ranks higher than money. \n“With more than 2,000 properties globally, Hampton by Hilton makes it easier for passionate Seekenders to fulfill their dreams” \n“Knowing that 68 percent of Americans would rather embark on a bucket list trip than get a big promotion gives a new meaning to Hampton by Hilton’s We Go Together™ campaign,” said Judy Christa-Cathey, vice president, focused service brand marketing and Hampton by Hilton. “We are on a mission to encourage people to go out, play and seek unique weekend experiences and life ‘firsts’ through new travel adventures.” \nOther noteworthy survey result findings include: \n• 82 percent of working Americans would travel for a year without pay if money weren’t a concern \n• 49 percent of Americans rank “traveling to other countries” above buying their dream car \n• 51 percent would prefer a trip that takes them out of their comfort zone \n• Nearly one half of respondents agreed that the best thing about experiencing something new is making a lifelong memory, followed by sharing it with family and friends, (28 percent) and discovering something new (22 percent) \nAs part of Hampton by Hilton’s efforts to inspire Americans to seize the weekend, the brand is enlisting the Ultimate Seekender Team. The group of travel savvy influencers will celebrate the weekend and boldly explore their global neighborhood. Their adventures, and other surprises, will be captured and shared at www.HamptonSeekender.com throughout the year beginning Aug. 10. \nLaunched earlier this year with a series of ads, the We Go Together campaign blends music and emotion to go beyond the functional benefits of the hotel experience. \n* Wakefield surveyed 1,504 adults nationally between July 15 and July 24, 2015, using an email invitation and online survey, with an overall margin of error of three percent.", "external_links": [], "published": "2015-08-18T22:32:00.000+03:00", "crawled": "2015-08-18T22:59:03.437+03:00", "highlightTitle": ""}