{"organizations": ["Vogue"], "uuid": "8cfde9195e78b26cc4a08e3562b40c34aa10fe91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/254cba2c-fa4e-4f33-9f04-62f60f85d7bdMediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Travel", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/travel/get-more-than-you-expect-at-madrid-spainish-art-s-heart/article1-1378924.aspx", "country": "US", "title": "Get more than you expect at Madrid, Spainish art's heart", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Get more than you expect at Madrid, Spainish art's heart", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T14:45:00.000+03:00", "replies_count": 0, "uuid": "8cfde9195e78b26cc4a08e3562b40c34aa10fe91"}, "author": "", "url": "http://www.hindustantimes.com/travel/get-more-than-you-expect-at-madrid-spainish-art-s-heart/article1-1378924.aspx", "ord_in_thread": 0, "title": "Get more than you expect at Madrid, Spainish art's heart", "locations": ["Paris", "Madrid"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paolo Roversi", "Museo Thyssen-Bornemisza", "Stella"], "text": "| Updated: Aug 11, 2015 17:24 IST Paolo Roversi, \"Stella, Paris,\" 1999 to be shown at Vogue like a painting, an exhibition at the Museo Thyssen-Bornemisza, in Madrid, through October 12 features 60 fashion photographs from the Vogue Archive, all inspired by painting. (AFP) \nAs summer winds down and crowds disperse, against-the-grain travelers may find it the perfect moment to plan a weekend getaway. For art-lovers with only a few days to spare, we recommend a few events and venues to see in Madrid. \nPicasso at the Prado Madrid's rich artistic offerings are just a little richer this year thanks to the Kunstmuseum Basel, which has sent parts of its collection to the Spanish city as it undergoes an expansion. At the Prado through September 14, ten paintings by Pablo Picasso reflect decisive moments in his career and cover his involvement with the Prado, which he directed during the Spanish Civil War. Reina Sofia Also through September 14, find additional works from Basel at the Reina Sofia museum, where the exhibition \"White Fire\" is showing more than 100 works from the 19th century to the present day. Apertura From September 10 to 12, 45 galleries will participate in the Apertura Madrid Gallery Weekend , with extended hours and free programs on offer. The event is an opportunity to explore contemporary Spanish art, and the parallel ARCO Gallery Walk will offer free, expert guided tours of the participating galleries. Vogue like a painting An exhibition at the Museo Thyssen-Bornemisza through October 12 features 60 fashion photographs from the Vogue Archive, all inspired by painting. Both classic and new-generation photographers such as Annie Leibovitz, Mario Testino, Steven Klein and Paolo Roversi take inspiration from paintings of the Spanish Golden Age, Dutch portraiture, the Victorian period and the Pre-Raphaelites. An early peek at Madrid's newest museum You'll be too early to view its collections, but you'll be able to see the building that will house the Museum of the Royal Collections, opening in 2016 near the city's Royal Palace. It will feature more than 150,000 works documenting the patronage and collections of Spanish monarchs. Tags", "external_links": [], "published": "2015-08-11T14:45:00.000+03:00", "crawled": "2015-08-12T09:47:50.650+03:00", "highlightTitle": ""}