{"organizations": [], "uuid": "61411f0096f0e0734288ba952acd89c23292dbb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/02/flybe400-new-logo_0-1.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/flybe-extend-newcastle-to-london-stansted-service/", "country": "US", "title": "Flybe Extend Newcastle To London Stansted ServiceTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Flybe Extend Newcastle To London Stansted ServiceTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "61411f0096f0e0734288ba952acd89c23292dbb5"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/flybe-extend-newcastle-to-london-stansted-service/", "ord_in_thread": 0, "title": "Flybe Extend Newcastle To London Stansted ServiceTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Flybe Extend Newcastle To London Stansted Service\nFlybe has extended its Newcastle – Stansted route, with tickets now available to book for the Winter schedule which begins in late October.\nThe airline started the route in March of this year and it has proven to be extremely popular with passengers.\nServices will now be operated by Flybe’s franchise partner Loganair, which has just announced its winter schedule to begin on Monday, 26 October.\nThe airline will provide a daily weekday service departing Newcastle at 11:00 and arriving in the capital 75 minutes later at 12:15.\nA return service departs London Stansted at 12:45 touching down in Newcastle at 14:00, with the centre of London only a short train journey away via the Stansted Express.\nA 49-seat Embraer 145 Jet will operate the air-link with fares starting at £44.99. This will also include a free 20kg baggage allowance.\nRoy Bogle, Loganair’s Director of Revenue and Scheduling, said: “We have a great partnership with Flybe, and we’re pleased to continue the Newcastle to London Stansted air-link.\n“The short journey-time to Stansted combined with the added convenience of the Stansted Express rail service, will be extremely attractive to business travellers and customers considering a city break to the nation’s capital.\n“We are pleased to launch services from Newcastle Airport and build on our relationship with London Stansted, after commencing operations from Dundee last year.”\nSpeaking about the service, Leon McQuaid, Aviation Development Manager at Newcastle International Airport said: “We are pleased that the Flybe service from Newcastle to London Stansted is now on sale for this winter and look forward to developing this service with Loganair.\n“This is an important route for the region providing easy and quick access to Greater London, via excellent rail and coach links, and also to the area around Stansted which includes parts of Norfolk and Hertfordshire as well as all of Suffolk, Essex and Cambridgeshire.”\nSource:- NewCastle Airport", "external_links": [], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T17:06:03.063+03:00", "highlightTitle": ""}