{"organizations": [], "uuid": "aab98f18b6a6a10d9146c886962a0f6b1a3b36d4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailytelegraph.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/7298422ff9eca9d35b7e821dbeb8d80d", "site_section": "http://www.dailytelegraph.com.au/travel/travel-advice", "section_title": "Travel Advice | Holiday and Travel Advice | dailytelegraph.com.au", "url": "http://www.dailytelegraph.com.au/travel/travel-advice/wotifcom-reveals-that-more-aussies-are-travelling-solo-than-ever-before/story-fnjjv72m-1227499541560", "country": "US", "title": "Solo travel: More Aussies travelling solo than ever before", "performance_score": 0, "site": "dailytelegraph.com.au", "participants_count": 1, "title_full": "Solo travel: More Aussies travelling solo than ever before | DailyTelegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T14:30:00.000+03:00", "replies_count": 0, "uuid": "aab98f18b6a6a10d9146c886962a0f6b1a3b36d4"}, "author": "Rowena Ryan", "url": "http://www.dailytelegraph.com.au/travel/travel-advice/wotifcom-reveals-that-more-aussies-are-travelling-solo-than-ever-before/story-fnjjv72m-1227499541560", "ord_in_thread": 0, "title": "Solo travel: More Aussies travelling solo than ever before", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DINING solo, sharing rooms with strangers and suffering bouts of loneliness ... would you travel alone? According to a recent survey by holiday website, wotif.com , more people than ever are travelling solo with 45 per cent of Aussie travellers going it alone.\nRebecca Carter, 27, has twice travelled solo on six month trips around Europe. The guest relations manager from North Queensland has visited Italy, Turkey, Spain and England and says it’s now a different world for female travellers.\nOther Stories ‘Something was terribly wrong’ News 0 comments Farah reveals reserve grade bombshell Nrl 0 comments ‘If it’s not OK, go f … ing eat somewhere else’ Nsw 0 comments Hopoate in limbo, Test star re-signs Nrl 0 comments The poorest man in the richest suburb City East 0 comments Did Kerr’s near-nude stunt go too far? Celebrity 0 comments “100 years ago women running around the world without a chaperone would have been unheard of, whereas today I’ve met countless women on solo trips,” she says.\nThe survey found the top reason for going it alone was to go exploring (47 per cent), followed by wanting to live the motto that “life was too short” (29 per cent), and another 27 per cent saying they had no one else to go with.\n“Travelling solo allows you to have the freedom to plan your trip exactly as you like, allowing you to avoid destinations or activities you have no interest in,” says Wotif.com Travel Specialist Kirsty La Bruniy.\nLearning to enjoy a wine alone in Italy. For Rebecca, it was this freedom that was most appealing.\n“The freedom to sit in a town square for an hour just because you feel like it, you don’t have anywhere to be or a schedule to adhere to.\n“The great thing about travelling solo for me was that I met like-minded people. I made friends with a Canadian on a trip, and we ended up going on a hike in Spain together the following year. You can feel like a speck in the ocean and completely unstoppable at the same time because you realise the endless possibilities in life,” says Rebecca who also notes the boost to her confidence.\n“I have a very average sense of direction but during my trips I noticed my navigating skills improving with practice — I wouldn’t pay me to teach orienteering in the Amazon but my confidence has grown.”\nRebecca worked on a farm-stay in Calabria, Italy in exchange for food and board , taught English and nannied in London to fund her trips.\nWorking in the agriturisma in Italy was an insight into a world that was a far cry from her home in Australia. “The family made everything from scratch. The pasta we devoured every night was all made from fresh produce and when I brought some biscuits for the family the kids proclaimed “oh look mummy, shop biscuits” like they were a foreign object,” says Rebecca.\nRebecca, right, hiking with a friend she met on her solo travels. Picture: Vanessa Sperduti She also recounts one instance when working at a hostel in Pisa where she was put in charge of the office for the day.\n“The hostel was run by a Sardinian man and his Thai wife. One day he told me ‘You are in charge of the office today’, I had been there three days and didn’t really know how to run the hostel and look after his pet ferret so I asked where they were off to and he replied, ‘to court — in Italy everyone goes to court,’”.\nBut what about the dreaded meal times when you find yourself at a table for one?\n“Dining alone is challenging at the best of times, to avoid the sympathetic looks from fellow diners I try to buy street food and enjoy the atmosphere in the town square.\n“If you do find yourself at a table for one, take along a book, kindle or device to pass the time. If you’re feeling brave and notice that another person is dining alone ask to join them. It might seem crazy at first but what have you got to lose?” she says.\nThen there’s the issue of taking photos. How many selfies can one solo traveller take before the same pose gets old? Rebecca says be confident and ask around.\n“Try to assess the other tourists or locals for someone who is going to know how to use the camera and is not going to run off with your device like that guy did to Chevy Chase in Lampoon’s European Vacation .\n“Senior citizens are not always proficient with new technology so I generally ask kind-looking, tech savvy people to take my photos and then offer to take one for them.”\nMaking new people is considered one of the best parts of solo travel. Picture: Vanessa Sperduti. Ten per cent of Aussies surveyed said the worst thing about travelling solo was feeling lonely. Rebecca’s tips for overcoming bouts of loneliness is to take advantage of modern-day communication.\n“Skype, FaceTime, Viber, Whatsapp the list goes on! There are so many ways to stay connected to family and friends at home when you’re overseas, but that’s no help when you’re craving real life human interaction.\n“In the past I’ve taken to the internet to meet people when I’ve known no one in a big foreign city or stayed in a hostel. Meet-up is a great app to have if you want to take a yoga class or meet-up with fellow English speakers or travellers.\n“Also, talk to strangers. I know this may seem weird but I like to think that most people are generally good. Be discerning about it and be open to local people who want to practice their English, this always distracts me when I’m feeling homesick.”\nAnother seven per cent of Aussies said feeling unsafe was a downfall of travelling solo and Rebecca recounts some hairy experiences.\n“I was and can still be a bit naive and trusting. Once on a train in northern Italy two gypsy beggar boys grabbed my phone right out of my hands. I was mad at the time but I was silly for having it out and for sitting in a carriage on my own.\n“Now I always try to sit with families or older people who are usually curious and love to have a chinwag. It’s also helpful when you are trying to pick up a language,” she says.\nSo why should anyone travel solo?\n“My advice is if there’s a trip you’re dying to take but no one wants to join — just go. Inevitably there’ll be times when you feel lonely and question why you’re doing it but then you’ll meet a bunch of like-minded people who you can hang with for a while.\n“You’ll learn a lot more about yourself and develop skills you never thought you’d have. It’s all quite empowering really, and if I can do it anyone can,” says Rebecca.\nRebecca picking apricots on the farm in Italy. Tips for travelling solo from Wotif.com:\n• Make sure you can lift and carry your suitcase because you are often the only one who will be carrying it.\n• Eat in places with shared tables — it’s a great way to meet others!\n• Find a happy half way point between spontaneous and planned.\n• Do whatever you want, when you want, that’s the best part about travelling solo, you have all the freedom to select whatever it is that interests you.\nReasons for travelling solo:\nTo go exploring — 47 per cent\nLife’s too short #yolo (you only live once) — 29 per cent\nI had no one to go with — 27 per cent\nTo meet up with friends/family around the world — 20 per cent\nI wanted to meet new people — 16 per cent\nTo get away after a life changing event — 11 per cent\nTo get away after a separation — 9 per cent\nI fell out with my travel buddy — 2 per cent\nThe best thing about travelling solo:\nGetting to do whatever I want to do (no need for compromising) — 48 per cent\nMeeting new people -23 per cent\nBuilding my confidence — 11 per cent\nGetting to go on holiday when I want (rather than waiting for someone else)- 9 per cent\nI was able to find myself — 5 per cent\nI didn’t get stuck with an annoying travel buddy- 1 per cent\nThe worst thing about travelling solo:\nNot having anyone to share the memories with — 38.5 per cent\nIt was more expensive than travelling with people — 18.3 per cent\nHaving no one to help look after my things — 10.6 per cent\nFeeling lonely — 10.1 per cent\nFeeling unsafe — 7 per cent\nHaving to take selfies — 3.9 per cent\nHaving to do all the trip organising myself — 1.8 per cent", "external_links": ["http://cdn.newsapi.com.au/image/v1/3c3695ed2d9868b8012ede6d01251049", "http://pixel.tcog.cp1.news.com.au/track/news/content/v1/?category=/section/dailytelegraph.com.au/collection/popular-content/all/24hours/&t_product=most-popular-mobile&td_standfirst=false&td_kicker=false&td_byline=false&maxRelated=6&display:footer=true&origin=omniture&domain=dailytelegraph.com.au", "http://cdn.newsapi.com.au/image/v1/43eb9ccae78e4e5df39827a62ec48f93?width=650", "http://cdn.newsapi.com.au/image/v1/42b1f0141fdf7bfe6e1c76d147cdb20b", "http://cdn.newsapi.com.au/image/v1/686d3794029f13885d3a0d2df28306d7", "http://cdn.newsapi.com.au/image/v1/2765a2e0e64039d170af8446c17b4137", "https://www.wotif.com/?brandcid=wotif-au.escape.trip-.generic", "http://cdn.newsapi.com.au/image/v1/03dac52a0993ea5756e9e9acedfa931f?width=650", "http://cdn.newsapi.com.au/image/v1/fc7029816dc95af13408fe583a3a358b", "http://cdn.newsapi.com.au/image/v1/f8da46dd730fc74be8366ab93d4e2f7e", "http://cdn.newsapi.com.au/image/v1/214154671971bb23bbb73c150669f9d9?width=650", "http://cdn.newsapi.com.au/image/v1/621f0eabc55cecebf267c56ea76a2048?width=650"], "published": "2015-08-26T14:30:00.000+03:00", "crawled": "2015-08-26T15:00:53.162+03:00", "highlightTitle": ""}