{"organizations": [], "uuid": "4278129841a3a081759846dae53cc14cce44b363", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/08/8685e3c64ed745db9dd9307a38a78248-1200x630.jpg", "site_section": "http://seattletimes.com/rss/ricksteveseurope.xml", "section_title": "The Seattle Times » Sections » Travel", "url": "http://www.seattletimes.com/nation-world/nation-politics/aides-to-ron-pauls-2012-presidential-campaign-indicted/", "country": "CH", "title": "Aides to Ron Paul’s 2012 presidential campaign indicted", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Aides to Ron Paul’s 2012 presidential campaign indicted", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T22:10:00.000+03:00", "replies_count": 0, "uuid": "4278129841a3a081759846dae53cc14cce44b363"}, "author": "CATHERINE LUCEY and Julie Bykowicz", "url": "http://www.seattletimes.com/nation-world/nation-politics/aides-to-ron-pauls-2012-presidential-campaign-indicted/", "ord_in_thread": 0, "title": "Aides to Ron Paul’s 2012 presidential campaign indicted", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aides to Ron Paul’s 2012 presidential campaign indicted Originally published August 6, 2015 at 12:10 pm In this photo taken June 30, 2015, Republican presidential candidate, Sen. Rand Paul speaks in Denver. Paul’s recent poll results earned him a place in the first prime time Republican presidential debate, Thursday. (AP Photo/David Zalubowski) Julie Bykowicz The Associated Press \nDES MOINES, Iowa (AP) — Prosecutors have charged several top aides to Ron Paul’s 2012 presidential campaign, now working to help his son Rand Paul win the Republican nomination, with conspiring to buy the support of an up-and-coming state senator in the days just before that year’s Iowa caucuses. \nJesse Benton, John Tate and Dimitrios Kesari face charges of conspiracy, falsifying documents and several other related crimes in a federal indictment unsealed Wednesday, the day before Kentucky Sen. Rand Paul is to appear onstage during the first debate of the 2016 campaign. \nBenton and Tate are leading America’s Liberty, a super PAC supporting Rand Paul’s presidential run, and Benton is married to Rand Paul’s niece. \nThe indictment says that while they and Kesari were working for Ron Paul during the last campaign, they negotiated with then-Iowa State Sen. Kent Sorenson to switch his support from Minnesota Rep. Michele Bachmann to Ron Paul in exchange for money. Most Read Stories Seahawks safety Kam Chancellor still holding out with no end in sight \nRand Paul’s 2016 campaign would not comment on the record about the indictment, but Ed Crane, the president of a separate pro-Rand Paul group said, “If I’ve ever had any concern about Rand, it’s with the people he has working with him.” \nRand Paul canceled a radio call-in appearance scheduled for Wednesday afternoon, SiriusXM radio said, citing votes in the Senate — which didn’t take any Wednesday. \nSorenson last year pleaded guilty to charges stemming from his switch of support from one Republican candidate for president to another; he is yet to be sentenced. He admitted to receiving thousands of dollars in “under the table payments” from a 2012 campaign and lying about the money, the Justice Department said at the time. \nIowa state Senate rules forbid any sitting lawmaker from being paid by a campaign while in office. \nSorenson was state chairman for Bachmann’s campaign beginning in June 2011, a position he held until six days before the January 2012 Iowa caucuses, when he declared his support for Paul, then a congressman from Texas. \nThe indictment says the Paul trio negotiated a payment of $73,000 to Sorenson, using false invoices to hide the money in campaign records and filings. The indictment also says the arrangement was concealed from Ron Paul and says Benton, who did not immediately respond to a request for comment Wednesday, initiated the deal. \nThe indictment quotes emails about the payments, with one from Kesari to Tate stating: “This is the last payment for kent Sorenson (sic). The deal jesse agreed to with kent.” It also says that Benton and Tate “falsely stated” to the FBI that they weren’t aware of the payments. \n“Federal campaign finance laws are intended to ensure the integrity and transparency of the federal election process,” said Assistant Attorney General Caldwell in a statement. “When political operatives make under-the-table payments to buy an elected official’s political support, it undermines public confidence in our entire political system.” \nBenton went on to serve as campaign manager for Kentucky Sen. Mitch McConnell’s 2014 re-election, until resigning that summer as the Iowa investigation heated up. \nBenton and Tate now run America’s Liberty, the best-funded of three super PACs supporting Rand Paul. It reported raising more than $3 million in the first six months of the year. That is almost a quarter of the money raised by Rand Paul’s campaign and outside groups backing his White House bid. \nFrom January to June 30, Benton’s consulting group was paid $63,000, an amount that included media buys, and Tate collected about $35,000 in salary, according to documents filed with the Federal Election Commission. \nCrane, who also backed Ron Paul and said he does not know Benton and Tate well, said he hoped the indictments prompt Rand Paul to reevaluate his campaign leadership and key outside strategists. “Maybe he can clean house and get a sharper team,” Crane said. \nHe also said the timing of the indictments is terrible. Rand Paul is one of 10 candidates on stage Thursday for the first GOP debate, nationally televised by Fox News. \n“You just have to ask yourself why, after all of these months,” Crane said, “did this have to happen the day before the debates?” \n___ \nAssociated Press writer Steve Peoples contributed to this reporter from Cleveland. \n___ \nFollow Catherine Lucey and Julie Bykowicz on Twitter at: http://twitter.com/catherine_lucey and http://twitter.com/bykowicz CATHERINE LUCEY", "external_links": [], "published": "2015-08-06T22:10:00.000+03:00", "crawled": "2015-08-06T22:44:06.890+03:00", "highlightTitle": ""}