{"organizations": [], "uuid": "d122e1678071e328d557f9b752115cd776739841", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/260591.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/dallasfort-worth-international-airport-celebrates-a-decade-of-international-terminal-d-skylink-and-the-grand-hyatt-dfw/", "country": "US", "title": "Dallas/Fort Worth International Airport Celebrates A Decade of International Terminal D, Skylink and the Grand Hyatt DFWTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Dallas/Fort Worth International Airport Celebrates A Decade of International Terminal D, Skylink and the Grand Hyatt DFWTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "d122e1678071e328d557f9b752115cd776739841"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/dallasfort-worth-international-airport-celebrates-a-decade-of-international-terminal-d-skylink-and-the-grand-hyatt-dfw/", "ord_in_thread": 0, "title": "Dallas/Fort Worth International Airport Celebrates A Decade of International Terminal D, Skylink and the Grand Hyatt DFWTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dallas/Fort Worth International Airport Celebrates A Decade of International Terminal D, Skylink and the Grand Hyatt DFW\nDallas/Fort Worth International ( DFW) Airport today observed 10 years of successful operation for International Terminal D, the Grand Hyatt DFW and the Skylink people mover system. Since opening in 2005, the three projects have transformed DFW into one of the world’s favorite connecting hubs for travelers and have elevated DFW’s global reputation for excellence.\n“When Terminal D, the Grand Hyatt and Skylink opened a decade ago, DFW Airport had a vision to become a world-renowned super-hub,” said Sean Donohue , DFW Airport’s chief executive officer. “While we are pleased with the progress made to expand international service and offer new terminal amenities and conveniences not experienced anywhere else, we’re not resting there. We pledge to continue working to elevate the customer experience and seek future opportunities to serve all of our Airport customers and the Dallas/Fort Worth community.”\nThe near future for DFW involves major enhancements to the Terminal D experience, specifically plans for new premium retail, spa and food & beverage locations in the first major update to the terminal’s concessions program since it opened. Highlighting those plans is a new duty-free shopping program featuring a two-level, 13,000 square foot primary store that will transform the central area of the terminal and bring in renowned global brands such as Ferragamo, Gucci, Dior, Chanel, Lancôme and Burberry.\nIn addition to duty-free, DFW also plans to open more new retail and restaurant options in Terminal D including Hugo Boss , TUMI, Michael Kors, Coach, Mont Blanc, Longchamp, M·A·C, Jo Malone , Aveda, The Italian Kitchen by Wolfgang Puck and Café Izmir Mediterranean Tapas of Dallas . The transformation should be complete by the end of 2016.\n“We know travelers have many options, and we compete by attracting passengers with customer-focused offerings that cater to our growing global customer base,” said Ken Buchanan , DFW’s executive vice president of revenue management. “The Airport is working daily to enhance options with world-class retailers, restaurants and convenience and relaxation amenities for an unmatched travel experience.”\nIn the ten years since its opening, Terminal D has elevated DFW’s international stature for air service by helping the Airport attract nine new international carriers and 20 new international destinations, and grow DFW’s annual international business by over 2 million passengers, an increase of 38%.\nIn its decade of service, Skylink has significantly transformed the DFW connecting experience into one of the world’s most efficient, with trains running every two minutes between terminals and briskly connecting passengers to their flights. Skylink train cars have transported over 141 million people, or nearly the population of Russia , and they have accumulated over 32.4 million fleet miles, roughly equivalent to 68 round trips to the moon.\nThe Grand Hyatt DFW has consistently ranked among the world’s finest airport hotels, offering customers award-winning accommodations and a peaceful oasis with modern sophistication that is perfectly integrated into Terminal D. The Grand Hyatt DFW features outstanding amenities and culinary offerings that range from contemporary American dining to the innovative, globally inspired menu at the hotel’s Grand Met restaurant.\n“DFW’s expansion into new international markets, made possible by Terminal D’s amenities and exceptional operations, has been vital to growing opportunities for the Airport and for Dallas/Fort Worth as a whole, positioning the region as an influential international player,” Donohue said.\nToday, the Airport hosts routes to 149 domestic and 56 international destinations for 63.5 million annual passengers, including over 7 million international passengers. In the past 15 months, Terminal D has welcomed new direct flights to Beijing , Shanghai , Hong Kong , Abu Dhabi and Doha .\nTerminal D, the Grand Hyatt DFW and Skylink were built as the major portion of DFW’s Capital Development Program launched in 1999, and collectively cost about $2 billion to design and complete.", "external_links": [], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T20:30:03.164+03:00", "highlightTitle": ""}