{"organizations": [], "uuid": "886152b5b23c51252ffb70822adeb9b79cfb11f9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2015/7/30/1438255464751/bb5ea0af-a884-4d94-a8c5-7d7d3f2477b8-1020x612.jpeg", "site_section": "http://www.theguardian.com/travel", "section_title": "Travel news, travel guides and reviews | The Guardian", "url": "http://www.theguardian.com/travel/2015/aug/02/party-train-melt-electronic-music-festival-germany", "country": "GB", "title": "Train wrecked: take the (non) sleeper to Germany’s Melt! festival", "performance_score": 0, "site": "theguardian.com", "participants_count": 2, "title_full": "Train wrecked: take the (non) sleeper to Germany’s Melt! festival | Travel | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T15:00:00.000+03:00", "replies_count": 1, "uuid": "c151b4df47023986e023e4675fe9e0f2dff2c171"}, "author": "Will Coldwell", "url": "http://www.theguardian.com/travel/2015/aug/02/party-train-melt-electronic-music-festival-germany#post-0", "ord_in_thread": 0, "title": "Train wrecked: take the (non) sleeper to Germany’s Melt! festival", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "T he daylight is fading through the vast glass ceiling of Cologne station, and as the 9.39pm departure time for the Melt! train approaches, the platform fills with camping gear, crates of Club Mate and young Germans clinking beer bottles. Right on time, a burgundy sleeper train rolls in to cheers and a burst of confetti: it’s taking us to the electronic music festival held at Ferropolis, an open air museum of industry – complete with dramatic, 30-metre-high pieces of machinery – between Leipzig and Berlin .\nI use the word “sleeper” in the loosest sense of the word. With decks set up in the club carriage, and DJs including Dekmantel Soundsystem on board to run them, this is not rail travel for those who like to doze off while reading a book.\nSomewhere between Düsseldorf and Dortmund – air buffeting through the open windows as we stream through the night – a beep sounds through the tannoy in our six-bunk cabin, then drops into a thumping house track. Up in the club carriage, past cabin after cabin of micro-parties, a throng of passengers are drinking, smoking and trying to dance (as best they can) while being slammed from wall to wall every time the train takes a bend.\nFacebook Twitter Pinterest On a roll … the club coach inside the Melt! train. Photograph: Philipp Böll Related: 10 of the best festivals in Europe ... that you’ve probably never heard of\nSomeone shouts something that sounds a lot like “All aboard the fucked train”, while in the far corner of the carriage a guy in a yellow T-shirt has managed to wedge himself up on to a shelf, from which he proceeds to fist pump for the entire journey, goading the sweaty, crammed-in ravers beneath him to dance harder.\nIt’s chaos. But the old-school mix of overstretched speakers, spilt drinks and cigarette burns fuels an overwhelmingly positive atmosphere. Faces are locked in expressions of startled joy and confusion.\nNow in its fifth year, the MiXery Melt! train, co-run by a specialist festival travel company, carries around 600 passengers to the festival site and remains there as accommodation for the weekend. It was first conceived to support the environmental initiatives of the festival.\nFacebook Twitter Pinterest Cabin fever … passengers get to stay on the train throughout the festival. Photograph: Stephan Flad Related: Top 10 music festivals for winter breaks\n“Back then bus trips weren’t as cheap and popular in Germany as they are now,” says Katja Dreyhaupt from the Melt! team. “There were these old tracks right next to the campsite and we always wanted to revive them. We needed more camping space, and the train is not only an eco-friendly way to travel, but also offers sleeping facilities, so no tents are left behind.”\nInspiration also came from the Sziget Express, a party train, launched in 2009, that takes 3,000 people from the Netherlands to Sziget festival in Budapest each August. And these are not alone in offering revellers a raucous journey. In the UK, this weekend will see the maiden journey of the Kendalino Express from Manchester to Penrith for the Lake District’s Kendal Calling festival. Among other performers, beatboxer Beardyman will be on board as conductor.\nFacebook Twitter Pinterest The Melt! train parks right in the festival campsite. Photograph: Stephan Flad Croatia’s Hideout festival runs a “party bus” that picks up people at several UK cities, then stops off for a night out in Munich en route; while Soundwave (also in Croatia) has recently launched Run to the Sun , a three-day road trip following three routes across Europe from London, with partygoers driving in convoy and meeting up at co-ordinated stop-offs along the way.\nIf the Melt! train is anything to go by, none of these journeys involve much shut-eye. By the time the train reaches Ferropolis at 5am, I can’t have managed much more than an hour’s sleep (but no regrets there), before I’m woken by people clattering down the corridor. The campsite manager later describes the memorable moment when hundreds of bleary-eyed kids trip and stumble out of the carriages like zombies, cans of beer and cigarettes in hands.\nFacebook Twitter Pinterest Melt! takes place at Ferropolis, an open air museum of industrial machinery. Photograph: Robert Winterpress As the festival proper warms up, the train adopts a more domestic role; parked at the top of the campsite, it becomes a place of (relative) sanctuary for its passengers. Our surroundings take on a shanty town vibe as some people hang tarpaulins to make shelters from the sun, groups cook on barbecues between the tracks, and others lay their sleeping bags directly below the train and stretch out for a nap on the sleepers.\nThe old tracks fit nicely with the industrial chic of Melt!, with its looming steel cranes, gigantic mining diggers, fire displays and techno.\nI ask my neighbours, a group from Düsseldorf, how they found the journey. Nico, who found out about the train after some “post break-up party research”, admits he was “completely freaked out”. “But it was pretty funny,” he says. “And there were a lot of international people. We met people from America, Mexico, Ireland. I have some pics on my mobile but I don’t know anything else about last night ...”\nFacebook Twitter Pinterest Off the rails … a festivalgoer gets some rest on the side of the tracks. Photograph: Will Coldwell for the Guardian A couple of carriages down, Linda and Lisa, both from Cologne, are sitting on the step getting ready to head to the festival site. “I’d heard a lot about it,” says Linda, dressed in white with heavily tattooed arms and legs on show (barely a few hours into Melt! I’m already feeling self-conscious about my lack of body art). “Last night was great. The mood was so positive. Nothing mattered, everybody was smiling, dancing, drinking, bottles all over the floor. Nobody cared about anything. Plus I don’t like camping so much so it’s great to have a bed at the end of the night.”\nAnd did the train ever get a bit too crazy? “N !” says Antje, who has just joined us, shaking her head adamantly as she takes a bite from an apple. “We love the train!”\n• The trip was provided by Melt! festival ( meltfestival.de ). Tickets for the Mixery Melt! train from Cologne to Ferropolis, cost €139 return including on-board accommodation for the four nights of the festival. Festival ticket (€136) not included. Melt! 2016 runs from 15-17 July", "external_links": ["https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fsfb%23img-3&ref=responsive", "http://www.pinterest.com/pin/create/button/?description=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Faug%2F02%2Fparty-train-melt-electronic-music-festival-germany&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F30%2F1438256628013%2F4cbbc1ab-d46c-4019-98a4-53c4cbb37bff-1020x765.jpeg", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fsfb%23img-2&ref=responsive", "http://www.pinterest.com/pin/create/button/?description=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Faug%2F02%2Fparty-train-melt-electronic-music-festival-germany&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F30%2F1438255790792%2Fdc898a70-1121-4920-ad9a-991019d6f90a-2060x1236.jpeg", "http://www.meltfestival.de/en/news/article/mixery-melt-train.html", "http://www.pinterest.com/pin/create/button/?description=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Faug%2F02%2Fparty-train-melt-electronic-music-festival-germany&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F30%2F1438256183037%2F14e8c743-9ee6-4c7c-8f3a-84f53b53ada1-2060x1236.jpeg", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fsfb%23img-4&ref=responsive", "http://szigetfestival.com/", "http://www.soundwavecroatia.com/holiday/the-run-to-the-sun/", "http://www.kendalcalling.co.uk/news/the-kendalino-start-the-festival-at-piccadilly-station/", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fsfb%23img-5&ref=responsive", "https://twitter.com/intent/tweet?text=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fstw%23img-3", "https://twitter.com/intent/tweet?text=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fstw%23img-2", "https://twitter.com/intent/tweet?text=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fstw%23img-5", "https://twitter.com/intent/tweet?text=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fstw%23img-4", "https://twitter.com/intent/tweet?text=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fstw%23img-6", "http://www.pinterest.com/pin/create/button/?description=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Faug%2F02%2Fparty-train-melt-electronic-music-festival-germany&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F30%2F1438256502382%2Facafe57c-61fd-4cbd-aeb2-a6f460bf0c3a-1020x612.jpeg", "http://www.meltfestival.de/en.html", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4b3hq%2Fsfb%23img-6&ref=responsive", "http://www.hideoutfestival.com/", "http://www.pinterest.com/pin/create/button/?description=Train+wrecked%3A+take+the+%28non%29+sleeper+to+Germany%E2%80%99s+Melt%21+festival&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Faug%2F02%2Fparty-train-melt-electronic-music-festival-germany&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F30%2F1438256354010%2F3799df15-f2e6-4ec2-aa37-4a21d4428508-2060x1236.jpeg"], "published": "2015-08-02T15:00:00.000+03:00", "crawled": "2015-08-02T13:46:27.291+03:00", "highlightTitle": ""}