{"organizations": [], "uuid": "c2a9a3b3c6ac227c9604b39a35f7a0dd54cee6c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mediapost.com", "main_image": "http://s3.amazonaws.com/static.mediapost.com/publications/images/mp-logo-fb.jpg", "site_section": "http://feeds.mediapost.com/marketing-travel#", "section_title": "MediaPost | Marketing: Travel", "url": "http://www.mediapost.com/publications/article/257334/3-marketing-lessons-from-the-top-travel-brand-vide.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+marketing-travel+%28MediaPost+%7C+Marketing%3A+Travel%29", "country": "US", "title": "3 Marketing Lessons From The Top Travel Brand Videos On Social 08/31/2015", "performance_score": 0, "site": "mediapost.com", "participants_count": 1, "title_full": "3 Marketing Lessons From The Top Travel Brand Videos On Social 08/31/2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T17:43:00.000+03:00", "replies_count": 0, "uuid": "c2a9a3b3c6ac227c9604b39a35f7a0dd54cee6c3"}, "author": "Jan Rezab", "url": "http://www.mediapost.com/publications/article/257334/3-marketing-lessons-from-the-top-travel-brand-vide.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+marketing-travel+%28MediaPost+%7C+Marketing%3A+Travel%29", "ord_in_thread": 0, "title": "3 Marketing Lessons From The Top Travel Brand Videos On Social 08/31/2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Digital video is taking off as a marketing tool, and brands are using it in more and more creative ways on social media. For travel brands — which can benefit from showcasing the visual elements of the experiences they offer — it’s especially important to have a strong video strategy.\nWe researched the videos travel brands posted to Facebook that received the most likes, comments, and shares so far in 2015. A few clear themes emerged over and over again, giving us some insight into what makes an engaging travel video. Here are the creative marketing lessons we learned from the most engaging videos. \nTap into experiences everyone values \nIn the beginning of the year, Singapore Airlines created a video around something everyone can relate to: New Year’s resolutions. The footage takes a look at different groups of people and their resolutions that relate to travel. (For example, one man wants to take his family on their first family vacation ever, one woman wanted to take a solo trip, and so on). Singapore Airlines paid for their trips and documented their experiences. Much of the footage was filmed using GoPro-type devices, which gives the video a more personal vibe. \nThe video works especially well because it’s about something that’s consistent with an airlines brand. New Year’s resolutions are a common experience for people and travel is often a part of them. Singapore Airlines was clear about their involvement in each group’s trip, which works well because people value transparency. The video received roughly 105,000 interactions and 218,000 views. (That’s nearly one interaction for every two views.) It’s the fourth most-engaging video from a travel brand so far this year.\nGive your audience an inside scoop \nIn February, KLM released a video demonstrating how autopilot on planes works. It gives viewers an inside look into the cockpit and the procedure of flying from the pilot’s perspective — all the way from takeoff to landing. The video got shared on Facebook nearly 30,000 times and was viewed over 2.2 million times. It’s the eighth most-engaging travel video this year.\nThe reason this video works so well is that it taps into an area of people’s imagination. Fans love to get the inside scoop into what’s going on, and they appreciate feeling like they get to access something that had been inaccessible before. That’s one of the reasons why, for example, the McDonald’s video earlier this year showing how their fries are made got a lot of attention.\nOverproduction isn’t always necessary \nNot every video needs the planning and precision of a full-length feature film. Social is a great place to share real things that are happening. When overproduction happens, brands can often appear ingenuine and out of touch. Sometimes, the best videos can come out of filming real people experiencing real things.\nIn June, Virgin Atlantic uploaded a video of a surprise they gave passengers on a Detroit flight: Richard Branson and the Virgin Atlantic team arranged for the cast of Motown the Musical to perform in the aisles in celebration of the airline’s new Detroit service. The light-hearted video gives us a glimpse into the performance and the reactions of the passengers.\nIt’s clear this surprise was enjoyed by more than just the passengers on the flight; it received over 86,000 interactions and was viewed almost four million times. It ranks seventh on the list of top engaging travel videos on Facebook this year. \nPerhaps the best feature of a strong video strategy is being dynamic. Travel brands can approach online video in many different ways. They have a huge opportunity to showcase visual content since it’s so closely tied to their industry. It’s important for travel brands to keep exploring to figure out which ideas are a hit and which are a miss, and they should continue to test out videos on social in new ways to continue connecting with their audiences. In order to succeed in the eyes of consumers, they must be willing to explore meaningful experiences and share openly with their audiences.", "external_links": [], "published": "2015-08-28T17:43:00.000+03:00", "crawled": "2015-08-31T23:41:26.923+03:00", "highlightTitle": ""}