{"organizations": [], "uuid": "4a7430ccbbef80f85b511bb27b9921c382ea13a5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mcall.com", "main_image": "http://www.trbimg.com/img-55e10800/turbine/mc-penn-museum-pope-sacred-texts-20150828", "site_section": "http://www.mcall.com/travel/rss2.0.xml", "section_title": "Travel - The Morning Call", "url": "http://www.mcall.com/features/religion/mc-penn-museum-pope-sacred-texts-20150828-story.html", "country": "US", "title": "Sacred writings: Penn Museum displays 'extraordinary texts of the Biblical world'", "performance_score": 0, "site": "mcall.com", "participants_count": 1, "title_full": "Sacred writings: Penn Museum displays 'extraordinary texts of the Biblical world'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T04:15:00.000+03:00", "replies_count": 0, "uuid": "4a7430ccbbef80f85b511bb27b9921c382ea13a5"}, "author": "Kathy Lauer-Williams", "url": "http://www.mcall.com/features/religion/mc-penn-museum-pope-sacred-texts-20150828-story.html", "ord_in_thread": 0, "title": "Sacred writings: Penn Museum displays 'extraordinary texts of the Biblical world'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "0 \nThe oldest artifact is a clay tablet that recounts a historical flood. It's written in Sumerian cuneiform that dates from 1650 BCE. \n\"There is a thrill in seeing this flood tablet and thinking about how it came to be,\" says Steve Tinney of the Penn Museum. \"Nearly 4,000 years ago, a highly trained scholar sat in a sunny courtyard, rolled out a piece of clay and let it dry. He sharpened the point on his stylus and wrote a story that was deeply meaningful to him about a flood.\" \nThe tablet, found at the site of Nippur in Mesopotamia (in modern-day Iraq), contains the earliest version of the Mesopotamian flood story. A version of this tale becomes incorporated into the \"Epic of Gilgamesh,\" an ancient epic poem, and tells of a flood that destroyed humankind, paralleling the biblical story of Noah. \nThe tablet is grouped with other variations of the flood story from other cultures and religions and shows how the flood story has resonated through time. \nJulian Siggers, director of the Penn Museum, says, \"The upcoming visit by Pope Francis provided a great opportunity to put together a small but important exhibition. These are spectacular texts of enormous significance.\" \nMost of the artifacts are from the museum collection and from the Penn Libraries collection of rare books and manuscripts. \nThe exhibit includes the first complete Bible printed in the New World in a Native American language, says Mitch Fraas, a curator at Penn Libraries. \nThe Eliot Indian Bible, printed in 1663 by Puritan missionary John Eliot, was written in the Algonquin language. It was the largest and longest book to be published in North America for the next 100 years, Fraas says. \nAnother highlight is the first authorized Roman Catholic translation of the New Testament, which was written by Catholic exiles in northern France escaping persecution in England in 1582. \nTwo folios from an illuminated Quran from Iran, copied and signed by its scribe in Hamadan in 1164, show a connection between major religions. The pages in the exhibit feature Surah Nuh (Noah), with a mention of the Flood and Noah's role as admonisher. The copy is written with black ink in cursive Naskh Arabic script, and features the complete text of the Quran, with commentary in red script. \nYou can also see an illuminated Latin Bible produced in Arras, France, in the late 13th century. The hand-decorated Bible shows vividly colored illustrations of Jesse with King David, Solomon, Mary and Jesus. \"This is a beautiful illustrated Bible,\" Fraas says. \nThen there's a 15 t h century Medieval History of the World that starts from the Creation to the election of Pope Sixtus IV in 1471. It shows an enlarged diagram of the ark associated with the biblical story of Noah. \n\"It shows the importance of the flood story in the world's history,\" Fraas says. \"We wanted to take the stories told forward in time through the texts.\" \nA display also compares side-by-side the flood stories from the Quran, Genesis, Epic of Gligamesh and the Sumerian flood tablet. \nThe newest text is from 1999 and is \"as much a piece of artwork as it is a text,\" says Fraas. The Moser Bible, which took three years to produce, is filled with original engravings by artist Barry Moser. \nSiggers says the staff hopes the exhibit will serve as a gateway into the museum's other exhibits, which focus on the ancient Near East, Egypt, Canaan and Ancient Israel and provide visitors a look into ancient cultures and biblical-era art and artifacts. \nH. Carton Rogers, director of libraries at the University of Pennsylvania, says the exhibition, which includes texts from Christianity, Judaism and Islam, follows the goal of the World Meeting of Families in Philadelphia, which Pope Francis will attend. \n\"We hope this exhibit helps to overcome differences so we can work together toward the mission and vision of peace,\" Rogers says.", "external_links": [], "published": "2015-08-29T04:15:00.000+03:00", "crawled": "2015-08-29T05:14:35.933+03:00", "highlightTitle": ""}