{"organizations": [], "uuid": "4baa41fe8060d0f3f660fc3d502aac38d28bbcb3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/shahar-azani/israels-desert-rose_b_7906390.html", "country": "US", "title": "Israel's Desert Rose", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Israel's Desert Rose", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T22:20:00.000+03:00", "replies_count": 0, "uuid": "4baa41fe8060d0f3f660fc3d502aac38d28bbcb3"}, "author": "Shahar Azani", "url": "http://www.huffingtonpost.com/shahar-azani/israels-desert-rose_b_7906390.html", "ord_in_thread": 0, "title": "Israel's Desert Rose", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nMitzpe Ramon is a small town in the southern part of Israel, about 2 hours from Tel Aviv and on the way to Eilat, Israel's southernmost tourist gem. On a recent visit to Israel, I had the pleasure of arriving there to stay at the gorgeous Beresheet (meaning \"Genesis\" in Hebrew) Hotel, overlooking the Ramon Crater (\"Makhtesh Ramon\"), a unique geological feature of Israel's Negev desert. Much has been said and written about this prestigious and luxurious resort, sporting infinity pools (some in your private room), stupendous culinary magic and renowned spa treatments. This truly is a place to refresh both one's body and one's soul. Standing on the porch of one of Beresheet's restaurants at night, peering over the breathtaking edge of the Ramon Crater, one gazes into an almost absolute darkness, tainted but with a few dots of distant lights, utterly engulfed in unprecedented silence, unfamiliar to most of us living in the hustle and bustle of the modern world. \nGenesis indeed. \nHowever, the real surprise was yet to come. This area sits on what is called \"The Spice Route\", an ancient trade route running through the town of Mitzpe Ramon, Jordan's city of Petra, and onto the Sinai Peninsula. The Spice Quarter of Mitzpe Ramon is named after this historic route, and it was there that I found the gem within a gem. \nDark as the street was, with no one in sight, and bakeries' and galleries' doors closed shut, a pale light was shining out of a small place. With very little expectations and not without hesitation did I step inside, only to find an amalgam of furniture spread around me, chairs and tables which seemed like refugees finding asylum in this desert haven and a small kitchen standing in the middle beckoning with joy and seething with activity. This was HadaSaar Natural Living, self-described as a community-gathering place for local tapas-bar, specialty gifts, ecological workshops, and area information. \nAs we were sitting there for dinner, observing the ladder-turned-bookshelf and the impromptu-winery by the wall, we were immediately taken by the laid back atmosphere and sense of relaxation that took over us. Seated on a small bench, by a wooden recycled table, we relished the local food: cheese pies, salads, locally baked goods and more, enjoying what was not only good food, but also nourishing and healthy. Yet, this place was much more than just a restaurant. \nHadas and Saar Badash, a young urban couple, moved from northern Israel to Mitzpe Ramon in 2011. Both therapists in their professional training, they decided to change direction when arriving in the desert and let their inside passions bloom. Entrepreneurship, a key word in understanding Israel, led them to open a small store at first, which later grew and became HadaSaar. \nLooking beyond their small plot, they realized the greater challenge they were facing in the context of their new home, what Saar described to me as the \"windshield challenge\": \"As people drive through Mitzpe Ramon, en route to Eilat or elsewhere, what could we do to make them lower down their windows and leave their air-conditioned cars to explore what we have to offer?\". In order to achieve that, Saar concluded, we need to integrate what we have to offer with all that the environment around us has to offer, and this create what they refer to as \"sustainable living\". \nAs a result, aside from being a deli, offering vegan/vegetarian tapas-bar & coffee shop (all originate from local Negev delicacies), they use their space to showcase wines from the Negev's Boutique Wineries, local Judaica and jewelry, arts and crafts, natural & organic food products and even desert herbs and remedies. \nThe bigger lesson here is this: HadaSaar connects the Negev and its residents and creating unparalleled synergy between the different components, the sum much bigger than its parts. This sense of local partnership allows each entity to exist on its own in the sphere: bakeries, galleries, workshops and restaurants, and yet at the same time realize the potential of partnership with their surroundings in achieving the greater good and settling the vast desert area, so trying in its nature and so compelling in its charm. \nThis is the true spirit of Israel, which is always a pleasure to encounter: pioneers, even today, with a deep sense of community and a desire to create a better place around them. Socially committed, kind and generous, it struck me how Saar makes a point of greeting each and every person making their way into their space. \"Welcome\", you seem to hear, even when no one is around. \n\"Inside HadaSaar\"", "external_links": [], "published": "2015-08-06T22:20:00.000+03:00", "crawled": "2015-08-06T22:44:44.904+03:00", "highlightTitle": ""}