{"organizations": [], "uuid": "b8659bf245041f0ce93527b552e8db67648e760b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/11/destination-NSW-300x102.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/spring-has-sprung-in-nsw-these-school-holidays/", "country": "US", "title": "Spring Has Sprung In NSW These School HolidaysTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Spring Has Sprung In NSW These School HolidaysTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "b8659bf245041f0ce93527b552e8db67648e760b"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/spring-has-sprung-in-nsw-these-school-holidays/", "ord_in_thread": 0, "title": "Spring Has Sprung In NSW These School HolidaysTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spring Has Sprung In NSW These School Holidays\nWith the Spring School Holidays just weeks away, from 19 September till 5 October, NSW offers families plenty of exciting short breaks and fun-filled getaways that the whole family will love.\nAccording to Destination NSW CEO Sandra Chipchase, “Taking a holiday in NSW these School holidays is a sure fire way to excite any child no matter their age or interest. From an adrenalin-filled adventure in Western Sydney, to star gazing at Darby Falls in Central NSW, to snorkeling with sea life off the Solitary Islands near Coffs Harbour or digging for opals in Lightning Ridge, NSW has it all”.\nDestination NSW offers these School Holiday suggestions for a fun-filled family getaway in NSW this Spring School Holidays:\nSYDNEY SHORT BREAKS\nGet Wet and Wild – Beat the summer crowds, don your swimmers to slip, slide and float your way down Wet’n’Wild Sydney’s waterslides. Make a real break of it, spend the night at Atura Blacktown and take the family along to the Skyline Drive In whilst in the area. Wet’n’Wild’s summer season kicks off in time for the Spring School Holidays, opening on the 19 September.\nFor more water based adventures, visit the nearby Sydney Olympic Park Aquatic Centre where the water is a lovely 26 degrees all year round. Little kids will love the Splasher’s Playground. Kids in the Park , also at Sydney Olympic Park, offers the largest range of School Holidays activities in NSW in one precinct. Kids can take part in creative workshops, sports clinic and adventure activities. With so much to do at Sydney Olympic Park this spring you might want to book in at the family friendly Novotel Sydney Olympic Park where kids stay and eat breakfast for free.\nVenture Indoors for Adventure –Wild Planet is opening in August at The Australian Museum, as part of its ongoing $5.5 million transformation. Showcasing a rich array of biodiversity featuring more than 400 animal specimens, Wild Planet is the first permanent gallery to be added to the Museum in over 50 years. Even better – kids under 16 years old now gain free entry to The Australian Museum.\nIf it is more adrenalin the kids want, then book them into indoor skydiving at iFly, Australia’s newest indoor skydiving facility, in Penrith. iFly gives kids, teens and adults the chance to feel the exhilaration of flight in a high-tech wind tunnel. Also in Penrith, Jet Pack has just launched the new super fun Flyboard Adventures, where adults and kids can fly super-hero style above the water.\nNocturnal Adventures – Grab your torch and join the Spotlight Prowl at Centennial Parklands, on after-dark adventure to meet the park’s nocturnal creatures – brushtail possums, microbats, tawny fogmouths and flying foxes. For a complete nighttime experience in the park, book the family into one of the historic Centennial Parklands Residences.\nREGIONAL NSW GETAWAYS\nMini MasterChefs in the Kitchen – Teach the kids all about Indian cuisine and culture at the Woolgoolga CurryFest on the 26 September. Families can enjoy cooking classes, farm tours, as well as Bollywood dance classes and movies at ‘Bollywood on the Beach’. Kids will love camping in style in the Lagoon Safari Tents at the nearby Darlington Beach Holiday Park.\nUpskill your Mini-MasterChefs with a hands-on cooking class at Julie’s Place on the Central Coast, run by MasterChef contestant Julie Goodwin, or at one of special School Holiday Cooking Classes at Bent on Food in Wingham on the Mid-North Coast or Food I Am in Wagga Wagga in the Riverina. Book the family into one the regions top-notch holiday parks that offer quality cabin accommodation, and cycling tracks and playgrounds for the kids.\nOut and About After Dark – For novice astronomers, Darby Falls Observatory near Cowra offers an amazing star gazing opportunity. Open every night, but bookings essential, see comets, constellations and galaxies. Kids will love staying at Oakleigh Farmstay where they can collect eggs, go cray fishing and feed animals.\nFossick for Your Fortune – Take the kids on a hunt for gold and gemstones, they might even strike it rich. Pan for gold in Hill End in Central NSW and Nundle near Tamworth, fossick for opals in Lightning Ridge and White Cliffs in Outback NSW, and pan for sapphires and gemstones in the creeks around Glenn Innes and Inverell in the New England.\nIn the New England book a farmstay at Oakhurst Cottage where the kids can get their hands on feeding with animals or if it a true fossicking holiday you want them stay in one of the cabins or campsites at Three Waters High Country Holidays where you can fossick for gems onsite.\nTake Advantage of the Weather –Warm sunny days and cool nights make Spring a perfect time to explore NSW. Take the family snorkeling off the Solitary Islands near Coffs Harbour, where the East Australian Currents warm and cool waters meet and are teeming with sea-life. Keep with the island theme and book a beachfront villa at Nautilus Resort with views of the Solitary Islands.\nOutback NSW is perfectly temperate in Spring. Kids will love seeing wild flowers in bloom, flocks of wild budges and magical sunsets over the vast Mundi Mundi Plains, and visiting the quirky Mad Max Museum in Silverton. For a true outback experience, sleep in the shearers’ quarters at Mount Gipps Station or hire a swag and sleep under the stars at Eldee Station.\nAs the whale season nears its end for the year visit Twofold Bay in Eden on the far South Coast and see whales and their calves resting in its calm waters. Spot whales from lookout points around the bay, such as Rotary Park and Boyds Tower, or from the verandah of Green Cape Lightstation Keepers’ Cottage, which has three self-contained cottages available. Take a closer look by joining one of the daily cruises with Cat Balou Cruises or visit the Eden Killer Whale Museum to round out the salty experience.\nIn the Snowy Mountains there will still be a dusting of Snow in the National Park. Don your hiking boots or join a horse riding trail ride and enjoy hiking amongst wild flowers, through sections of snow (the last of the season), and if you are lucky you might even glimpse a herd of wild brumbies with young fowls in tow. Stay in the National Park in the luxurious Creel Lodge or the more intimate Lyrebird Cottage.\nShare your favourite fun family experience with Destination NSW #ILoveSydney and #NewSouthWales.\nSource:- Destination NSW", "external_links": [], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-26T06:24:18.830+03:00", "highlightTitle": ""}