{"organizations": [], "uuid": "2b8751c0f8bf6496b9f841b8edb22d69fb460860", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62521/air-canada-reports-record-second-quarter-2015-results", "country": "US", "title": "Air Canada reports record second quarter 2015 results", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Air Canada reports record second quarter 2015 results", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T14:15:00.000+03:00", "replies_count": 0, "uuid": "2b8751c0f8bf6496b9f841b8edb22d69fb460860"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/62521/air-canada-reports-record-second-quarter-2015-results", "ord_in_thread": 0, "title": "Air Canada reports record second quarter 2015 results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Air Canada reports record second quarter 2015 results   \nAug 12, 2015 Banners   \nAir Canada today reported record second quarter adjusted net income of $250 million or $0.85 per diluted share compared to adjusted net income of $139 million or $0.47 per diluted share in the second quarter of 2014, an improvement of $111 million or approximately 80 per cent. EBITDAR (earnings before interest, taxes, depreciation, amortization and aircraft rent) amounted to $591 million compared to EBITDAR of $456 million in the same quarter in 2014, an increase of $135 million or approximately 30 per cent year-over-year. The airline recorded an EBITDAR margin of 17.3 percent compared to an EBITDAR margin of 13.8 percent in the second quarter of 2014, an improvement of 3.5 percentage points. On a GAAP basis, Air Canada reported record second quarter operating income of $323 million compared to operating income of $245 million, an improvement of $78 million or approximately 32 percent from the second quarter of 2014. An operating margin of 9.5 percent in the second quarter of 2015 reflected an improvement of 2.1 percentage points from the same quarter in 2014. \n\"I am very pleased to report that Air Canada achieved record EBITDAR results for a fifth consecutive quarter in addition to record operating income and adjusted net income results and significant year-over-year improvements to operating margin and EBITDAR margin,\" said Calin Rovinescu, President and Chief Executive Officer of Air Canada. \"I would like to thank and acknowledge the efforts of our 28,000 employees who worked together to deliver yet another outstanding operational and financial performance in the quarter. \n\"Our record results this quarter reflect a focused execution of our business plan, which we outlined in detail at our June 2015 Investor Day. With our growth this quarter, we have successfully increased passenger revenue by 3.9 per cent, expanded margins, significantly increased our adjusted net income and EBITDAR and continued to improve our return on invested capital. We have delivered on planned cost transformation initiatives and eliminated our significant pension solvency deficit. We have strengthened our balance sheet with increased liquidity levels, improved net cash flows, reduced adjusted net debt, and expect further benefits from our recent credit rating upgrade. \n\"We again expect to deliver record results in the third quarter, with EBITDAR margin expansion versus prior year higher than the 350 basis point expansion recorded in the second quarter. Demand continues to be robust moving into, historically, our most important quarter given the travel demands and patterns of our North American customers. Our capacity additions for the year, which are largely in our international markets, are important contributors to our increased profits and remain consistent with our plan established in a higher fuel price environment. Our plan is not dependant or conditional on fuel prices staying at the current levels; and the transformative changes we have made over the last several years provide us with the cost structure, fleet and flexibility to respond not only to increased competition in any of our key markets, but also to weaknesses in the Canadian dollar or a downturn in the economy. If we see demand weakening, we can adjust quickly. We are building a resilient airline for the long-term, a sustainably profitable company and global industry leader,\" said Mr. Rovinescu.", "external_links": [], "published": "2015-08-12T14:15:00.000+03:00", "crawled": "2015-08-12T22:45:53.058+03:00", "highlightTitle": ""}