{"organizations": [], "uuid": "23ea37ecb8374619bf524642a6f38a34b57756ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29874961/sygic-combines-four-app-cases-into-one-to-create-universal-travel-solution", "country": "US", "title": "Sygic Combines Four App Cases into One to Create Universal Travel Solution", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Sygic Combines Four App Cases into One to Create Universal Travel Solution - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "23ea37ecb8374619bf524642a6f38a34b57756ab"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29874961/sygic-combines-four-app-cases-into-one-to-create-universal-travel-solution", "ord_in_thread": 0, "title": "Sygic Combines Four App Cases into One to Create Universal Travel Solution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Sygic\nBRATISLAVA, Slovakia , Aug. 25, Navigation trailblazer Sygic has revolutionized the navigation industry yet again with a new \"map for everything,\" an inclusive solution for every traveler . Starting today, users of Sygic GPS Navigation can use just one application for all of their driving, walking, booking and traveling needs. The summation of many exciting months of development, this comprehensive application is anticipated to set the pace for the navigation industry for years to come.\nThe average smartphone user today relies on a cluster of 4 isolated applications for vehicular, offline, pedestrian navigation, traffic radar or traveling essentials. Sygic GPS Navigation's inspiring new update delivers a single core application incorporating the following solutions.\nTravel. Thanks to an improved stunning map aesthetic, rich map content, Wikipedia information, travel POIs, and integration of Yelp, Foursquare and attractions via Viator, traveling has never been easier. Road trip with the family? Bucket list adventure with your BFF? No problem. You'll be able to find countless great points of interest, vetted restaurants, breathtaking views and cool landmarks just by searching or browsing along your route. Commuting and Navigation. By incorporating live services such as traffic and speed cameras, highlighting parking opportunities and locating petrol stations for your convenience, your navigation experience has never been more peaceful or worry-free. Pedestrian Navigation. Users can access Sygic GPS Navigation on their smartphone or directly on their smart watch thanks to premier hybrid technology with flawless look and feel. Book and Explore. Discover and book trending events in your area, the restaurant for date night or even the perfect hotel, all directly through the application. Sygic's integration of TripAdvisor, Yelp, Viator, and Foursquare will have you covered. \"We at Sygic are excited to announce our Sygic GPS Navigation overhaul, and we eagerly look forward to feedback from our customers. In transforming our leading software into a comprehensive travel application, we are proudly delivering innovative traveling solutions and advanced technology never before seen on the market. This software update is the summation of immense effort and an unshakable confidence in Sygic's vision, and I could not be happier with the finished product,\" said Michal Stencl, Sygic CEO.\nSygic is thrilled to reveal that it has reached its goal of a record-breaking 100 million users and counting.\nRelated Links\nSygic GPS Navigation Video Sygic Website Sygic GPS Navigation - Google Play Contact Information:\nDaniela Zelinova\nCommunication Specialist\nSygic\n918581136\ndzelinova@sygic.com\nThis release was issued through WebWire(R). For more information, visit http://www.webwire.com .\n releases/sygic-combines-four-app-cases-into-one-to-create-universal-travel-solution-300132891.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CL86323&Transmission_Id=201508251056PR_NEWS_USPR_____CL86323&DateId=20150825", "http://www.xmlnews.org/ns/", "https://play.google.com/store/apps/details?id=com.sygic.aura", "http://www.webwire.com/", "http://www.prnewswire.com/news-releases/sygic-combines-four-app-cases-into-one-to-create-universal-travel-solution-300132891.html", "https://youtu.be/TiR4xjrisG8", "http://www.sygic.com/"], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T19:47:07.184+03:00", "highlightTitle": ""}