{"organizations": [], "uuid": "70120daa024df79a746c2fb8d1833788ca48c087", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww4.hdnux.com/photos/40/42/24/8529163/9/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/life/travel/collectionRss/Life-Travel-Heds-7477.php", "section_title": "Life Travel Heds", "url": "http://www.beaumontenterprise.com/travel/article/Can-travelers-rest-easy-about-home-sharing-6470454.php", "country": "US", "title": "Can travelers rest easy about home sharing?", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Can travelers rest easy about home sharing?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T05:58:00.000+03:00", "replies_count": 0, "uuid": "70120daa024df79a746c2fb8d1833788ca48c087"}, "author": "Miriam B. Weiner", "url": "http://www.beaumontenterprise.com/travel/article/Can-travelers-rest-easy-about-home-sharing-6470454.php", "ord_in_thread": 0, "title": "Can travelers rest easy about home sharing?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Can travelers rest easy about home sharing? Miriam B. Weine , San Francisco Chronicle By Miriam B. Weiner Updated 10:00 pm, Thursday, August 27, 2015 \nPage 1 of 1 \n“You should try it — it’s a great way to meet new people.” \nThat’s what a friend told me about CouchSurfing in 2008 as I was planning a weekend trip to Barcelona. But the thought of sleeping on a stranger’s couch in an unfamiliar city was an unsettling one. “I’m sure it is,” I responded, thinking to myself, “This CouchSurfing thing is never going to last.” \nTurns out I was wrong. \nAs I was opting for a bed in a hostel over a couch in a stranger’s living room (though I’m not sure why that made me feel safer), Nathan Blecharczyk, Brian Chesky and Joe Gebbia were preparing to launch Airbnb, a website that would connect travelers with residents to provide a local lodging experience. \nThe reaction of some in the hotel industry would make you think home sharing is a relatively new practice, but peer-to-peer lodging has been around for quite a while. For hundreds of years, family-owned boardinghouses were the lodging alternative for frugal travelers; homeowners listed their spare rooms in newspapers and waited for reservation requests to arrive in the mail or for a weary visitor to knock on the door. And after World War II, European families often purchased second homes together, taking turns vacationing and then renting out the property when it was vacant. \nToday, the Internet allows homeowners to instantly connect with travelers in search of a place to stay, and the number of people joining the peer-to-peer lodging community has skyrocketed as a result. Since starting in August 2008, Airbnb’s listings have grown to more than 1 million rooms in over 34,000 cities around the world. \nThere are more than 5,400 Airbnb listings in San Francisco alone. \n“We didn’t think it would get this big,” said Lynn Mohrfeld , president and CEO of the California Hotel & Lodging Association. \nDisrupting? \nBut Mohrfeld doesn’t think the rapid growth of services like Airbnb, HomeAway and Roomorama poses much threat to traditional hotel companies. “It keeps the hotels on their toes. It adds diversity to the lodging industry,” he said, mentioning that he’s stayed in Airbnb properties on occasion. \nBut during his stays, Mohrfeld said, he felt concerned about the neighbors and how his family’s presence was perceived by the surrounding community. \nPeer-to-peer lodging websites like Airbnb have not been embraced as warmly by the neighborhoods in which they operate as they have by the broader travel community. The startup has faced legal obstacles across the globe, including in San Francisco. In May, the San Francisco Board of Supervisors found that 11 to 23 percent of vacant housing units were being used as short-term rentals, and that less than 2 percent of these units are consistently occupied. \nSan Francisco isn’t the only city pushing back against peer-to-peer lodging. Santa Monica passed a law banning the rental of full units for less than 30 days. The ruling affected 1,400 of 1,700 listings across three home-stay websites. \nOn one hand, preventing landlords from designating full units — or entire blocks of units — as short-term rentals helps ease the housing crunch in cities all across the United States. It will also allow residential communities to flourish, with locals having neighbors they can actually get to know. \n“As a resident, I would want someone living there full time. I would want their kids to be in Little League with mine,” Mohrfeld said. \nOn the other hand, stricter ordinances may prove detrimental to individuals who use home-stay services to feel more at home while traveling, save on lodging costs or supplement their income. \n“Not only do you get to meet new people, but you also earn some extra money when you know you aren’t going to be home,” said Kiara Kyung Han , who in June started renting out her one-bedroom apartment in Brigantine, N.J., a quiet community near Atlantic City. \nBe a good neighbor \n“Neighbors are more likely to induce change (by limiting home-stay situations) than competition from the hotels,” Mohrfeld said. “Just paying taxes doesn’t cut it. They need to be part of the community.” \nAs the online peer-to-peer communities grow, home-stay guests and hosts can do their part to not upset their neighbors. \nHan hasn’t told her neighbors that she lists her home on Airbnb. \n“None so far have said they’ve had any problems,” she said. “Usually, the guests who rent my place are at the beach or in Atlantic City all day and only use my place to sleep. And since it only accommodates two, there’s not much partying.” \nBut she does have her neighbors in mind when reviewing booking requests. When screening potential guests, Han scours reviews left by previous hosts. \n“I pay attention to the guests’ reviews, especially the ones left by other hosts about them,” she said. “If they haven’t been a good guest in the past, I’m reluctant to confirm their reservation.” \nMany peer-to-peer service sites — including Airbnb — provide review services to help build trust between hosts and guests. Many websites also encourage users to fill out detailed profiles and provide authorized identification. Airbnb recommends that guests and hosts use this information to vet one another before engaging in a booking transaction. \nHan uses this information to determine whether she feels the potential guest will treat her home respectfully. Although she has not met all of her guests in person, Han says she communicates with them before and after the stay. \n“I usually send them a text asking if they’re free for a call the day before they’re set to arrive,” she said. “I go through a checklist: pool passes, bus into Atlantic City, beach’s location, Internet password. If they have any questions, I address them, and if not, then communication usually ends until the day they arrive. I tell them I’m available via cell all weekend and usually speak to them on Sunday morning regarding checkout.” \nThis communication helps Han set expectations for her guests, and vice versa. During these conversations, Han looks for “someone who uses and takes care of the apartment as if it were their own.” If there is any part of the communication that makes the guest or host feel uneasy, Airbnb recommends trusting intuition and reporting any issues to the site. \nHan admits she was nervous at first about listing her apartment for short-term rental, but careful screening of reviews and clear communication set her at ease. \n“As difficult as it may be to make that first leap to allow strangers to stay at your home, the experience so far has been nothing but positive for me,” she said. “Every guest has his or her own unique story. It’s been a pleasure meeting them all.” \nMiriam B. Weiner is a freelance writer in Washington, D.C. E-mail: travel@sfchronicle.com \nPeer-to-peer lodging services \nWebsite: www.airbnb.com \nMethod: Travelers request lodging from hosts, who provide verified listings complete with photos. Hosts can accept or reject requests at their discretion and are not required to interact with guests in person, though Airbnb encourages communication using the platform’s messaging service. \nType of lodging: The types of accommodations available range from single rooms to apartments to entire homes. \nSafety precautions: Hosts and guests verify their identities by connecting to social networks and scanning their official IDs. Hosts are protected by the Airbnb Host Guarantee, which offers up to $1 million to cover any property damage. \nCost: Rates vary depending on how much the host wishes to charge. Hosts can request a security deposit, and Airbnb charges a 6 to 12 percent guest service fee for every reservation made. There is no cost to post a listing, though Airbnb does collect a 3 percent host service fee per confirmed booking. \nHomeAway \nWebsite: www.homeaway.com \nMethod: HomeAway allows people to rent their vacation properties when they’re not in use. Guests can contact homeowners directly about availability. \nType of lodging: On average, HomeAway rental homes, condos and apartments clock in at 1,850 square feet. \nSafety precautions: Booking a property using HomeAway’s service guarantees payments up to $1,000. The website’s secure message center connects homeowners to potential renters without releasing personal email addresses. However, HomeAway recommends communicating over the phone to avoid phishing scams. \nCost: HomeAway does not charge renters a booking fee. The cost of rental properties is determined by the homeowner. Homeowners can list their properties on their own for a $349 annual fee or a 10 percent fee per booking; professionals are available to assist in creating listings for a 13 percent fee per booking. \nRoomorama \nWebsite: www.roomorama.com \nMethod: Similar to Airbnb, Roomorama is a platform where hosts list their homes for rent to travelers. Potential guests send booking requests, and hosts have 48 hours to accept. \nType of lodging: Roomorama is a short-term rental site. Listings are most often apartments in cities. \nSafety precautions: Roomorama holds a guest’s payment until the host has accepted the booking request and the guest presents the six-digit payment code upon check-in. \nCost: Rates are determined by the homeowners, and Roomorama charges a facilitation fee that is determined by the total cost of the accommodations (including taxes, guest surcharges and processing fees). Hosts do not have to pay to post a listing. \nCouchSurfing \nWebsite: www.couchsurfing.com \nMethod: CouchSurfing encourages personal connections between travelers and hosts. While some hosts may have places to stay, CouchSurfing hosts can also offer local insight into a destination or make time to meet up with travelers to show them their favorite coffee shop. \nType of lodging: Couches and spare bedrooms. \nSafety precautions: The service offers a secure messaging platform for potential guests to communicate with hosts until both parties feel comfortable enough to share personal contact information. \nCost: Free, although guests should repay their hosts for their hospitality by offering to cook a meal or bringing a small gift. \nHomestay.com \nWebsite: www.homestay.com \nMethod: Homestay.com connects travelers with hosts in more than 140 countries. Guests can connect with hosts via Homestay.com’s messaging service and book rooms directly on the site. Hosts must be living in their home while their guest is staying and be available to spend time with their guest. \nType of lodging: Guest rooms. A light breakfast is included in the nightly room rate. \nSafety precautions: Hosts are asked to fill out a “house rules” section on their profile. Guests should send hosts a photo before arriving and bring a photo ID — and a copy of the booking confirmation — to show the host. \nCost: Hosts can list their rooms on Homestay.com for free. Guests are required to pay a 15 percent nonrefundable deposit upon booking and the remainder directly to the host.", "external_links": [], "published": "2015-08-28T05:58:00.000+03:00", "crawled": "2015-08-28T06:36:56.344+03:00", "highlightTitle": ""}