{"organizations": [], "uuid": "63a907f3001cf2978fb3cde0840af62b9f204e5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/OrizonteLisbonGolf-18aug15.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/major-investment-moves-aroeira-into-position-to-rejoin-europes-golfing-elite-2/", "country": "US", "title": "Major Investment Moves Aroeira Into Position To Rejoin Europe's Golfing EliteTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Major Investment Moves Aroeira Into Position To Rejoin Europe's Golfing EliteTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "63a907f3001cf2978fb3cde0840af62b9f204e5e"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/major-investment-moves-aroeira-into-position-to-rejoin-europes-golfing-elite-2/", "ord_in_thread": 0, "title": "Major Investment Moves Aroeira Into Position To Rejoin Europe's Golfing EliteTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Major Investment Moves Aroeira Into Position To Rejoin Europe’s Golfing Elite\nAroeira, one of Portugal’s most iconic golfing venues, is on target to regain its place at Europe’s top table as it puts the finishing touches to a significant six-figure upgrade of its golf courses.\nUnder the guidance of the forward-thinking management group ORIZONTE – Lisbon Golf, the 36-hole complex, host of the Portuguese Open in 1996 and 1997 and situated a short drive from Portugal’s capital, has undergone an extensive programme to improve its playing facilities.\nThe renovation plan at Aroeira, nicknamed the ‘Wentworth of Lisbon’ by the UK press in the 1970s and 80s, began last summer and further work has continued since the spring on enhancing the visitor golf experience.\nHaving already improved the fairway and putting surfaces, renovated the cart paths and reconditioned the irrigation and pumping systems across its two 18-hole layouts, head greenkeeper Dirk Hoeven has supervised a further refurbishment schedule over the last three months including rebuilding the majority of the tees boxes.\nAroeira I and II, created by Frank Pennick and Donald Steel, meander through impressive stands of tall pine trees, reminiscent of some of Surrey and Berkshire’s finest old clubs. As well as hosting two Portuguese Opens, the courses have, between them, staged many other high-profile tournaments including several Ladies’ European Tour events and, in 2013, the prestigious European Men’s Club Trophy.\nJosé Maria Cazal Ribeiro, from ORIZONTE – Lisbon Golf, said: “Aroeira is an established name in Portuguese golf and it has been a pleasure for us to have been given the opportunity to restore a venue with such a rich golfing history.\n“Both layouts offer a high-quality test of golf and the investment programme that we’ve undertaken over the last 18 months will lead to Aroeira becoming one of Portugal’s favourite destinations in the future, both for locals and travelling golfers.”\nAroeira is part of the ORIZONTE – Lisbon Golf management group, which offers the chance to play some of the leading courses in close proximity to Portugal’s capital together with exceptional value for money on a wide range of accommodation options across the region.\nIn addition to Aroeira’s two courses, Quinta do Peru Golf & Country Club has hosted several European Challenge Tour events while Ribagolfe has hosted the European Tour Qualifying School since 2009 and provides two more challenging courses, both set within ancient cork oak forest.\nGolfers can also enjoy the 7,000-plus yards challenge at Santo Estevão and the 9-hole course in Oeiras, which is located just 15 minutes from Lisbon’s centre, while the extensive practice facilities available across the venues help make ORIZONTE the ideal option for individuals and groups looking to book a stay, play and learn package.\nSource:- IAGTO", "external_links": [], "published": "2015-08-19T03:00:00.000+03:00", "crawled": "2015-08-19T15:32:29.478+03:00", "highlightTitle": ""}