{"organizations": [], "uuid": "ba317b1a6c58d34191d981841685e030d07c7eda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1576537/1576537.jpg", "site_section": "http://www.deseretnews.com/family/travel/index.rss", "section_title": "Deseret News - Daily travel articles, news and headlines for Salt Lake City and Utah | deseretnews.com", "url": "http://www.deseretnews.com/article/765678733/Rebooting-Greece-how-to-get-its-economy-going-again.html", "country": "US", "title": "Rebooting Greece: how to get its economy going again", "performance_score": 0, "site": "deseretnews.com", "participants_count": 6, "title_full": "Rebooting Greece: how to get its economy going again | Deseret News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 7, "uuid": "3c6e53903693a0d2c5d054e95bd42183f5971ded"}, "author": "", "url": "http://www.deseretnews.com/article/765678733/Rebooting-Greece-how-to-get-its-economy-going-again.html#post-0", "ord_in_thread": 0, "title": "Rebooting Greece: how to get its economy going again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "After so much pain, Greece must now figure out how to get its economy back on its feet.\nATHENS, Greece — After so much pain, Greece must now figure out how to get its economy back on its feet.\nThe scale of the country's financial problems is mind boggling — a full quarter of the economy evaporated in the past six years and business activity is now plummeting further. Government cuts needed to qualify for a new bailout will hurt incomes for years to come.\nThe advice to Greece from economists is simple: focus on the basics.\nHave a steady government, simplify the rules of doing business, and rather than try to reinvent the economy, zoom in on sectors that can benefit from small investments: tourism and agriculture, for example.\nIn many cases, that's easier said than done.\nPolitical instability, a hallmark of Greece's crisis, is highly toxic for investors, who need to know that the rules for business won't change unexpectedly.\nGreece's current government offers a stark example of the risks. The country had just emerged from recession when the new government, led by the radical left leader Alexis Tsipras, came to power in January with plans to undo a series of reforms and challenge creditors.\nTsipras' intentions were good: to ease the economic burden on the Greek people. But the uncertainty proved immensely painful.\nFears that the political clash with creditors could push the country out of the euro caused investors and Greeks to pull tens of billions of euros out of the country. The economy plunged back into recession. To avoid a bank run, the government was forced to close banks and the stock market for about a month and impose limits on cash withdrawals. The limits are costing Greece an estimated 1.75 billion euros to 2.8 billion euros ($1.9 billion to $3.1 billion) weekly.\nRather than grow this year, the Greek economy is now expected to contract by between 2 and 4 percent this year.\nThe outlook for government stability is not particularly good, either, as high unemployment of 25 percent and popular resentment against economic reforms are expected to last. Political parties, including Tsipras' Syriza, are in turmoil and there is speculation Greece will head into another general election in November.\nThat comes on top of years of political infighting in the country, both during the past six years of crisis and before, when officials hid the scale of the government's debts.\n\"Irresponsibility destroyed this country,\" said Nicolaos Eriotis, a professor who heads the department of business and finance at the National & Kapodestrian University of Athens.\nWith so much uncertainty hanging over it, Greece is struggling to attract major foreign investment. Investment last year equaled just 12 percent of economic output — only three of 124 countries ranked by the World Bank invested a lower share.\nSo, experts say, Greece's best option in the short-term is to target what little money it can get into industries it already has a presence in.\nAgriculture last year contributed almost 6 billion euros to the country's 179 billion euro economy but could yield more with some basic modernization and better marketing.\nTake olive oil. Although Greece is the third largest olive oil producer in the world, it exported 60 percent of its output to Italy in bulk, giving its neighbor the opportunity to earn 50 percent more on the price of the final packaged product, according to a 2012 report by consulting firm McKinsey & Company.\nThe fishing industry is another sector that Greece could develop quickly and enjoys a strong competitive advantage in, given its huge shorelines.\n\"You have the groundwork already laid out and there's no need for large investment,\" said Panayotis Alexakis, professor of economics at the National & Kapodestrian University of Athens.", "external_links": [], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-05T03:14:15.367+03:00", "highlightTitle": ""}