{"organizations": [], "uuid": "5afacff0760c821b2f161ea0dd7f12e8f1ef59d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03400/nagasaki_3400989k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/asia/japan/11789992/Nagasakis-new-dawn.html", "country": "US", "title": "Nagasaki's new dawn", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Nagasaki's new dawn - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T16:00:00.000+03:00", "replies_count": 0, "uuid": "5afacff0760c821b2f161ea0dd7f12e8f1ef59d7"}, "author": "Chris Leadbeater", "url": "http://www.telegraph.co.uk/travel/destinations/asia/japan/11789992/Nagasakis-new-dawn.html", "ord_in_thread": 0, "title": "Nagasaki's new dawn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As the Shinkansen starts to decelerate, silently shedding all that purposeful velocity as it glides towards the buffers in Nagasaki terminus, I momentarily lose track of my location. For the previous hour and a half, the view through the window has been utterly Japanese – the bullet train flashing south west across the agricultural torso of Kyushu, the urban crush and neon billboards of the capital Fukuoka receding behind, rice fields a gentle blur of white on each side of the rails, the soft blues of the Ariake Sea and Omura Bay hinting that we are nearing the island’s edge. But here amid the mundanity of platform numbers, timetable boards and the visible end of the line, an unremarkable shopping mall filling out the station concourse, I am briefly deceived that I am back in Britain. Perhaps it is the hint of salt on the air, the hum of buses awaiting passengers beyond the ticket barriers, but I can almost believe I am in Brighton. And I am shocked. Because I had expected more: skyscrapers, a fuming mass of traffic, the flustered motion of busy people, or any of the other indicators of a major metropolis; symbols of the type of giant dot on the map whose swollen size would make it an obvious, unmissable bullseye for one of the most devastating attacks ever witnessed. Nagasaki, I quickly realise, has none of these characteristics. It stuns in its smallness. It is Japan’s westernmost city, pinned to the far edge of Kyushu – the third largest of the four main isles that shape this archipelago nation. But it is by no definition a vast conurbation. It is 30 times more diminutive than Tokyo in headcount, three times less populated than neighbourly Fukuoka, only the sixth biggest city on an outcrop of farms and volcanoes. “Fat Man” was unleashed by the American B-29 aircraft Bockscar Photo: GETTY And yet, on August 9 1945, at 11.02am – 70 years ago today – it was the victim of only the second atom bomb ever dropped in anger. “Fat Man”, unleashed by the American B-29 aircraft Bockscar, effectively ended the Second World War, but has often been consigned to the supporting cast in the telling of the conflict’s tale. Three days earlier on August 6, Hiroshima had suffered the same fate – but had done so as the first cadaver at the feet of this grimmest of reapers, with twice the loss of life. Even though its semi-destruction prompted Japan’s surrender less than a week later (on August 15), history has come to regard provincial Nagasaki – where an upper estimate of “just” 70,000 perished (to Hiroshima’s 140,000) – as “merely” a repeat of the main event. \"I feel a duty to bear witness on behalf of those who died\" However, Hiroshima had the distinction of being the primary target on its date of despair. Nagasaki had the misfortune of circumstance. The X marked as the spot on August 9 was Kokura. But when bad weather shrouded what is now Kitakyushu, at Kyushu’s northern tip, Bockscar found itself flying west with its package undelivered. The haze cleared as it was about to leave Japanese air space – and there was Nagasaki, waiting in the crosshairs. The city in ruins after the bombing Photo: GETTY This ad hoc nature of the city’s fate is discernible when I seek its scars. The explosion occurred not above the dockside (where the Mitsubishi shipyards, churning out warships, had come to American attention), but in the residential pocket of Hirano-machi, two miles north. Tram 25 carries me there from the station, clanking uphill into what, seven decades on, is still an unassuming nest of homes – even if the hole in its heart gapes widely. Hypocentre Park does its job without hyperbole. A plain column of black basalt marks the exact site of annihilation. A statue of a mother cradling her limp child, her face expressionless, lingers alongside, “1945 8.9 11:02” etched, with no further comment, on the plinth. • Nuclear tourism: travels in the shadow of the atomic bomb • Cities destroyed by war, then and now Standing here makes me uncomfortable, and I cannot help but stare at the firmament. The sky is an unblemished turquoise, awash with sunshine – and it seems impossible to recognise it as a place where, 1,540ft (503m) overhead, a mushroom cloud boiled in rage. This troubled feeling dogs me as I make the short walk west to where the city inspects its wounds. The Nagasaki Atomic Bomb Museum keeps its counsel underground, a circular pathway unwinding to the exhibition floors – and a realm of darkness. Here, the reality of a nuclear firestorm and its aftermath is laid bare – the lunch box of Satoko Tsutsumi, a 14-year-old schoolgirl from the adjacent Iwakawa-machi district, the rice inside fused to the blackened metal; 11 plates from a house in Shiroyama-machi, melded together as one in a warped ceramic lump; the robes of a Buddhist priest who was waiting for a train two miles north at Michinoo station – charred holes in the back where the material absorbed the heat; a wall clock from a Sakamoto-machi home, forever frozen at two minutes after 11. There are questions too. The museum raises an eyebrow at the traditional justification for the nuclear strikes of 1945 – that these hammer blows circumvented the need for a bloody land invasion of Japan that would have caused far more fatalities – by pointing out that the eviscerations of Hiroshima and Nagasaki demonstrated “the success of the Manhattan Project, into which $2 billion had been invested”. Equally, it offers almost no detail on the Japanese aggression that had placed the country in harm’s way. Only one panel refers to the Korean prisoners who worked as slave labourers in Nagasaki’s factories, their bodies left to rot outside in the days that followed. The city today Photo: AP/FOTOLIA But then I turn a corner, and thoughts of context fade. Near the exit, one photograph has been hung in isolation. Part of a sequence shot by American lensman Joe O’Donnell, who documented Japan in the immediate wake of the war, it shows a 10-year-old boy, upright and barefooted next to a firepit. As numbly blank of face as the statue in Hypocentre Park, he is waiting to hand over his dead brother – a child of less than two, pinned to his back in a sling, head lolled, eyelids shut – at one of the mass cremation “ceremonies” to which Nagasaki devoted itself in that stained summer. Peering at the image, I can hear Robert Oppenheimer in my mind, voice heavy with the responsibility of his actions at the 1945 press conference where he Quote: d from the Hindu text Bhagavad Gita: “Now I am become Death, the destroyer of worlds.” I am not sure I have ever seen a bleaker picture. Cause and consequence are put aside next door at the Nagasaki National Peace Memorial Hall. Here, tranquillity reigns in a reflecting pool where 70,000 lights – one for each of 1945’s estimated dead – sparkle below the surface. Another walkway cascades into cool subterranean chambers, all walls of green glass and the sound of trickling water. The emphasis here is on remembrance. A library of thick tomes contains testimonies collected from survivors, some of which are reprinted in a viewing gallery. “There was a roar in the distance, and in the next instant, an incredible blast threw my body through the air,” reads one account. “I pray that black rain will never fall again on this earth,” says another. It is unsurprisingly sombre stuff, the indiscriminate force of the bomb’s touch underlined by a computer archive where you can look up those who died. There, in the crowd, is Ronald Shaw – a captured British RAF corporal who was toiling in the shipyards in August 1945. I stumble out, and on to the Peace Park – an expanse of statues which tries to bring sense to a senseless scene. But if there is an element of political posturing to this pretty enclave of tinkling fountains and leafy quiet – there are installations donated by Czechoslovakia in 1980, and the German Democratic Republic in 1981, America’s Cold War enemies making capital from chaos – then there is no denying the majesty of the central piece. Kyushu-born sculptor Seibo Kitamura’s Peace Statue is an olive branch in bronze – a seated man, over 30ft tall, eyes closed in prayer, his right arm lifted towards the heavens. Seibo Kitamura’s Peace Statue Photo: AP/FOTOLIA To the statue’s left, a squat building blends into the background – the headquarters of the Nagasaki Atomic Bomb Survivors Association. Inside, I find a little shop selling trinkets – jewellery, good-luck totems – as a fundraising measure. And a familiar figure. I have seen Sumiteru Taniguchi before – on another photo in the museum, 16 years old, the skin stripped from his back, a mess of raw flesh. Now 86, he is the Association’s head and spokesman. And while his voice is frail, his message is unflinching. “I am one of the few left who can testify to what they experienced in 1945,” he tells me, talking slowly. “I feel a responsibility to bear witness on behalf of those who died.” Does he think the world has learnt its lesson, drawn back from apocalypse in the past 70 years? He frowns, confers with my translator. The word he is chasing is “Iran”. “There is work to be done,” he says. There are many traces of the bomb in this portion of Nagasaki – the rebuilt Shiroyama Primary School, 1,400 of whose pupils were killed, part of it now kept as a museum; a fractured torii gate in Hamaguchi-machi which once formed the entrance to a Shinto shrine; the striking Urakami Cathedral – a wonder in red brick, completed in 1959, whose 19th-century predecessor was obliterated. August 1945 is recalled here. The shattered belfry of the first church is left where it fell; a side chapel hosts a statue of the Virgin Mary, scorched on one cheek where the fire took her right eye. But visiting the latter, I am reminded of a pertinent fact. That – thanks to its mountainous setting, and the stubborn ridges of the Urakami Valley – 50 per cent of Nagasaki was sheltered from the blast. And lives on in the 21st century as a city of no little flair and pep. • Dark tourism: why are we attracted to tragedy and death? • Dark tourism sites around the world So I pick up the 25 and return south, on the trail of Nagasaki’s non-nuclear past – and its thriving present. The former calls out from Suwamachi, the religious quarter, where the Kofukuji temple projects an aura of Buddhist calm, as it has since 1624 – and low-slung Meganebashi creeps across the Nakashima River, a shard of 1634 nicknamed “Spectacles Bridge” for the effect produced as its stone arches are mirrored by the water. Here, I enter Ichiriki, a restaurant that clings to that classical image of Japan – all fragile partitions, private chambers and little bowls of umewan (red-bean soup), its 1813 birth date apparent. Yesteryear sings too on a hilltop in Minamiyamatemachi, where the flower-strewn Glover Garden frames the former home of Thomas Glover – built in 1863 by the Scottish entrepreneur whose arrival helped kick-start the city’s industrial boom. And it links arms with the present in Dejima-machi, the two eras combining along a slice of the harbour where Dutch merchants – taking their lead from the Portuguese navigators who initiated the first contact between Japan and the West, in Nagasaki, in 1543 – held sway in the 17th and 18th centuries, making hay at a time when Japan was aloof to the rest of the planet. Trade and commerce still burble here – though in 2015, it is in the evening chatter of the city’s young things, in the eateries on the dock. Nagasaki is now a city with peace at its heart Photo: AP/FOTOLIA Elsewhere, the present goes it alone – in the huge Hamanomachi arcade, where youthful Nagasaki shops for fashionable clothes at Hama Cross 411, then dips into Cafe Olympic for rainbows of ice cream. And modernity glows at Nagasaki Prefectural Art Museum, a palace of glass, steel and illumination conjured in 2005 by the architect Kengo Kuma. Wandering the complex’s bright rooms, through its collections of Spanish art and contemporary photography, it occurs to me that if 1945 was Nagasaki’s descent to the grave, here is its resurrection – a life lived looking forward, the nightmares put away. This impression persists as the taxi struggles with the gradient, climbing to Akizukimachi and the Garden Terrace Hotel. Also designed by Kuma, Nagasaki’s foremost five-star preens in its lofty position on the west side of the port. It is late, and I am hungry – but the chef is in a mood to play, Toshihiko Yokoyama almost dancing behind the bar in the property’s sushi restaurant Tenku. And so they come, one after another, carefully prepared morsels of tuna, tiger shrimp, salmon, sea eel and trout – the freshest of fare. Beyond the maestro’s head, through a panoramic window, Nagasaki twinkles in the dusk. From this height, it does not look like Brighton. Nor does it resemble a war-torn corpse. It is a tiny Hong Kong, boats advancing across its harbour, sailing into tomorrow. Getting there There are no direct flights between Britain and Kyushu. KLM (020 7660 0293; klm.com ) flies daily from Amsterdam Schiphol to Fukuoka. The Shinkansen from Fukuoka to Nagasaki takes two hours. British Airways (0844 493 0758; ba.com ) flies to Tokyo (both Narita and Haneda) from Heathrow. Japan Airlines (020 7660 0348; uk.jal.com ) also serves Haneda from Heathrow. The Shinkansen from Tokyo to Fukuoka takes five hours. What to do Both the Nagasaki Atomic Bomb Museum at Hirano-machi 7-8 (0081 95 844 1231; nagasakipeace.jp ) and Nagasaki National Peace Memorial Hall (Hirano-machi 7-8; 95 814 0055; peace-nagasaki.go.jp/english ) are open daily 8.30am-5.30pm. Admission to the museum is £1. The Memorial Hall is free. Nagasaki Prefectural Art Museum at 2-1 Dejima-machi (95 833 2110; nagasaki-museum.jp ) is open daily 10am‑8pm. General entry free; exhibitions from £2. Hashima Island, south of Nagasaki Photo: AP/FOTOLIA Where to stay The Garden Terrace Nagasaki at 2-3 Akizukimachi (95 864 7777; gt-nagasaki.jp ) has double rooms from £217 per night, including breakfast. Tour Inside Japan (0117 370 9751; insidejapantours.com ) sells a 15-day Kyushu Adventure which covers the island in detail – spending two days in Nagasaki, but also venturing to the cities of Fukuoka and Kumamoto, as well as exploring the volcanic crater of Mount Aso. From £2,040 per person, not including international flights. Further information visit-nagasaki.com ; at-nagasaki.jp ; jnto.go.jp/eng . Telegraphtravel Follow @telegraphtravel Telegraph Travel Collection»", "external_links": [], "published": "2015-08-09T16:00:00.000+03:00", "crawled": "2015-08-09T10:35:14.288+03:00", "highlightTitle": ""}