{"organizations": [], "uuid": "fee26bde217468970d0dc1b79cf0381cce938c72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28177-pphe-hotel-group-expands-park-plaza-hotels-resorts-brand-in-germany-with-opening-of-park-plaza-berlin-kudamm", "country": "US", "title": "PPHE Hotel Group expands Park Plaza® Hotels & Resorts brand in Germany with opening of Park Plaza Berlin Kudamm", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "PPHE Hotel Group expands Park Plaza® Hotels & Resorts brand in Germany with opening of Park Plaza Berlin Kudamm", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T14:15:00.000+03:00", "replies_count": 0, "uuid": "fee26bde217468970d0dc1b79cf0381cce938c72"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28177-pphe-hotel-group-expands-park-plaza-hotels-resorts-brand-in-germany-with-opening-of-park-plaza-berlin-kudamm", "ord_in_thread": 0, "title": "PPHE Hotel Group expands Park Plaza® Hotels & Resorts brand in Germany with opening of Park Plaza Berlin Kudamm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hotel PPHE Hotel Group expands Park Plaza® Hotels & Resorts brand in Germany with opening of Park Plaza Berlin Kudamm PPHE Hotel Group expands Park Plaza® Hotels & Resorts brand in Germany with opening of Park Plaza Berlin Kudamm Details Category: Hotel   12:15 PPHE Hotel Group Limited, owner and operator of primarily full service upscale and lifestyle hotels including Park Plaza Hotels & Resorts in Europe, is expanding its portfolio with the opening of its third Park Plaza branded hotel in Berlin, opening 1 September 2015. Following a period of full refurbishment and rebranding, Park Plaza Berlin Kudamm will be based in the former building of art’otel berlin kudamm, within sight of the famous Kurfürstendamm boulevard. \nAll rooms and suites will be redeveloped and repositioned in line with the Park Plaza Hotels & Resorts upscale contemporary brand. Updates include the inclusion of new furnishings, modern shower partitions, vanity mirrors and, in over half of the rooms, additional cupboard space. As per Park Plaza & Hotels Resorts brand standards, all rooms will offer a special ‘pillow selection’ to improve the sleeping experience. Pillows at Park Plaza Berlin Kudamm are made of anti-allergic, fire-retardant microfibres, with guests able to choose between firm and soft options. Each of the 133 renovated rooms will feature modern facilities, including flat-screen televisions, adjustable air-conditioning, satellite TV, a mini bar, updated bathing facilities and free wireless internet throughout the hotel. Two conference rooms with natural daylight and a full array of audio visual and presentation technology will be available for hire. Thomas Borsbach, Regional General Manager PPHE Hotel Group, Germany & Hungary, says: “It’s an extremely exciting time for Park Plaza Hotels & Resorts as we expand with new openings in London and Nuremberg. Berlin is a key market for us, where our hotels are based in key inner-city locations such as Mitte and Prenzlauer Berg. With the opening of Park Plaza Berlin Kudamm, we occupy a popular area around the famous Kurfürstendamm boulevard, which is ideal for business and leisure guests. Along with our collection of two art’otels in Berlin, we have now increased Park Plaza Hotels & Resorts’ presence in Berlin to provide contemporary accommodation in several in-demand and central locations throughout the city.” Hotel Director for Park Plaza Berlin Kudamm, Ralph Schroedter, comments: “I’m delighted to be able to welcome holidaymakers and business clients to the first Park Plaza & Resorts hotel to be located in Berlin’s western part. With a postcode of this calibre, only a few steps from the Ku’damm, we look forward to further strengthening our presence within Berlin’s vibrant offering.” Park Plaza Berlin Kudamm is centrally located on Joachimsthaler Straße, a few minutes’ walk from the Kurfürstendamm, the Gedächtniskirche and the Zoo. The hotel is situated nearby several public transport options, including the U-Bahn stations Uhlandstrasse and Kurfürstendamm, as well as the Rankeplatz bus station. The new opening adds another 133 rooms and suites to the brand’s portfolio in the German capital, which already includes the Park Plaza Prenzlauer Berg Berlin and Park Plaza Wallstreet Berlin Mitte. Related articles", "external_links": [], "published": "2015-08-11T14:15:00.000+03:00", "crawled": "2015-08-11T14:39:08.373+03:00", "highlightTitle": ""}