{"organizations": [], "uuid": "24413b1997cd7ce5e6df6e9fc712a13442374bb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themoscowtimes.com", "main_image": "", "site_section": "http://www.breakingnews.com/feeds/rss/air-travel", "section_title": "Breaking news on air travel - breakingnews.com", "url": "http://www.themoscowtimes.com/article/528014.html", "country": "US", "title": "5 people aboard Russian military helicopter missing after Sea of Okhotsk crash; 11 rescued - @themoscowtimes", "performance_score": 0, "site": "themoscowtimes.com", "participants_count": 1, "title_full": "5 people aboard Russian military helicopter missing after Sea of Okhotsk crash; 11 rescued - @themoscowtimes", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T00:17:00.000+03:00", "replies_count": 0, "uuid": "24413b1997cd7ce5e6df6e9fc712a13442374bb0"}, "author": "David Wyllie", "url": "http://www.themoscowtimes.com/article/528014.html", "ord_in_thread": 0, "title": "5 people aboard Russian military helicopter missing after Sea of Okhotsk crash; 11 rescued - @themoscowtimes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Russian Helicopter Crashes Into Sea, 5 Missing But 11 Safe Combined Reports Last edited 19:04 Igorolkh / Wikicommons An island in the Sea of Okhotsk \nRussian investigators say a helicopter crashed into the Sea of Okhotsk in the far east, and five of the 16 people on board are missing and presumed dead. \nThe pilot reported by satellite phone that he and 10 others made it to a tourist base on the Tugur Peninsula, the Interfax news agency said, citing the emergency services. \nInvestigators said the Mi-8 helicopter took off Saturday from the Polina Osipenko village in the Khabarovsk region and was scheduled to land near a lake on the Tugur Peninsula, but crashed into the sea about 30 meters from the shore. Investigators believe the helicopter's engine may have failed, Russian media cited sources at the regional transport watchdog as saying. \nAnother theory circulating in the media was that the helicopter's crew may not have coped with the poor weather conditions — heavy fog had reportedly enveloped the area where it crashed into the sea. \nThe helicopter was transporting the head of Russian company VTB Leasing along with his two deputies on a trip to the rugged Shantar Islands, the company confirmed. The managers of the transport and oil and gas equipment leasing company were among the survivors, the company told the TASS news agency. \nSeven of the surviving passengers were taken by plane to a hospital in the region's biggest city Khabarovsk, while one other passenger and three crew members remained at the scene to help a rescue operation involving divers, RIA Novosti reported. \nThe helicopter crash is the latest in a series of aviation accidents to have befallen Russia in recent months. On Aug. 9, a helicopter collided with a seaplane over the Istra reservoir outside Moscow, killing nine people. Investigators said that pilot error was the likely cause of the fatal accident. \n(AP, MT) Вконтакте Google+ News from e-generator.net Dear reader, Due to the increasing number of users engaging in personal attacks, spam, trolling and abusive comments, we are no longer able to host our forum as a site for constructive and intelligent debate. It is with regret, therefore, that we have found ourselves forced to suspend the commenting function on our articles. The Moscow Times remains committed to the principle of public debate and hopes to welcome you to a new, constructive forum in the future. Regards, Tesco Reportedly Suspending Opening of F&F Stores in Russia British retailer Tesco Plc has suspended opening its F&F clothing stores in Russia, retail industry sources told Reuters. Foreign Airlines Quit Russian Market Amid Falling Demand International airlines are curtailing their activity in Russia as the ruble's sharp devaluation and the country's economic downturn have significantly reduced the number of passengers on international flights. Russian Supermodel Calls for Calm Over Disabled Discrimination Incident Russian model Natalia Vodianova appealed for calm after the owner of a cafe whose staff asked her autistic sister to leave because she was “scaring off clients” apologized amid a storm of outrage. Russia Denies Hosting Top Iranian Commander A senior Russian diplomat on Friday denied claims that an Iranian general visited Moscow in violation of United Nations sanctions banning travel. France's Auchan Targeted in Food Checks Campaign Nationwide inspections of the French grocery retailer Auchan launched late last month by a government watchdog have evolved into a high-profile vilification campaign involving top Russian officials. After Food, Now Russia Burns Dutch Flowers A week after angering many in Russia by burning illegally imported Western food, authorities have started feeding Dutch flowers to the flames. Madonna Likely to Never Perform in Russia Again Madonna has told celebrity news magazine Entertainment Weekly that she will most likely never return to Moscow or St. Petersburg because of Russia's stand on gay rights. The minimum monthly income a household needs to make ends meet, according to the average Russian, is 22,755 rubles ($350) per person — nearly 2.5 times more than the official minimum cost of living in Russia. On Wednesday just after you get home from work — at 8:40 p.m. to be exact — Earth and the debris left over from the Swift-Tuttle comet will reach their closest point of the year. At over 100,000 images, the archive of Oxford's Bodleian Library is a treasure trove of historical pictures. The process of digitizing these images was finished earlier this summer, and the archive is now open for everybody to browse.", "external_links": [], "published": "2015-08-17T00:17:00.000+03:00", "crawled": "2015-08-17T00:38:22.781+03:00", "highlightTitle": ""}