{"organizations": [], "uuid": "fe45a78878bae0dca1ff5317628f94988adbb022", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/25/12920360/Platinum Realty Makes the list.jpg", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/2015/08/prweb12920360.htm", "country": "US", "title": "Regional Company Makes the List of America’s Fastest-Growing Private Companies for the Fourth Year.", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Regional Company Makes the List of America’s Fastest-Growing Private Companies for the Fourth Year.", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "fe45a78878bae0dca1ff5317628f94988adbb022"}, "author": "Katy Kanne", "url": "http://www.prweb.com/releases/2015/08/prweb12920360.htm", "ord_in_thread": 0, "title": "Regional Company Makes the List of America’s Fastest-Growing Private Companies for the Fourth Year.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For the fourth time, Platinum Realty was included on Inc. Magazine’s list of fastest-growing companies in America. Prior year inclusions are 2010, 2013 and 2014. The recently announced 2015 list ranked Platinum Realty at #1936. “There comes a point when the persistence-finally-meets-opportunity kind of luck pays off. For us, size, market conditions, and technology were the reasons we debuted on the 2010 list. They were as strong and compelling at that time as they are today, as evidenced by our three additional inclusions on Inc.’s lists,” Founder/CEO Scott DeNeve says.\nPlatinum Realty’s size is just right. Not too big. Not too small. They can nimbly maneuver the marketplace and quickly incorporate technology without causing disruptive waves throughout the organization. Their agents are used to technology, and so they easily adopt and adapt to any technology they implement to make their lives and jobs easier.\nNecessity is the mother of invention. At Platinum Realty, it’s certainly true, but not in the way you might think. The company was paperless before going paperless was cool. They have never owned a file cabinet. Yes, they are early adopters of emerging technology… but DeNeve couldn’t afford to buy a file cabinet when he started the company and wasn’t going into debt to buy office furniture. Platinum Realty was and continues to be 100% debt free.\nDeNeve stated, “If I’ve said it once, I’ve said it a hundred times. I’d rather our company culture and vision be wrong because we tried something new than wrong because we followed the status quo.” Platinum Realty seems to be in the right place at the right time, according to the number of agents joining their culture of change. They have a bigger footprint across Missouri and Kansas markets with plans for more expansion.\nAbout Platinum Realty:\nFounded in 2005 by Scott DeNeve, Platinum Realty is one of the largest real estate companies in the region. Serving both the Kansas City and St. Louis metropolitan areas, more than 700 agents call Platinum Realty home. This is the fourth year they have been featured in the Inc. 500 & 5000 lists, proving themselves to be on the cutting edge of the real estate market. In 2010, Platinum Realty was named the fastest-growing real estate company in America by Inc. Magazine.\nRelated links:\nhttp://www.movewithplatinum.com/\nhttp://www.inc.com/profile/platinum-realty", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tb3Zld2l0aHBsYXRpbnVtLmNvbS8=", "http://www.inc.com/profile/platinum-realty", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5pbmMuY29tL3Byb2ZpbGUvcGxhdGludW0tcmVhbHR5", "http://www.movewithplatinum.com/", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5pbmMuY29tL2luYzUwMDAvbGlzdC8yMDE1Lw=="], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-27T14:11:08.301+03:00", "highlightTitle": ""}