{"organizations": [], "uuid": "bb69e1ee29136c604935764465263c4fea301401", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-event-news/", "section_title": "TRAVEL EVENT NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/kent-provides-the-quintessential-sea-side-summer-experience/", "country": "US", "title": "Kent provides the quintessential sea-side summer experience", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Kent provides the quintessential sea-side summer experience | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "bb69e1ee29136c604935764465263c4fea301401"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/kent-provides-the-quintessential-sea-side-summer-experience/", "ord_in_thread": 0, "title": "Kent provides the quintessential sea-side summer experience", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kent provides the quintessential sea-side summer experience Published on : Thursday, August 6, 2015\nThe county of Kent on England’s south-east coast is the perfect destination to experience quintessential English summer past-times for all ages, and was recently voted the top family destination in Europe for 2015 by Lonely Planet.\nPraised for the host of “opportunities it offers curious young minds”, which includes more Blue Flag beaches than anywhere else in Britain, the footpaths along the White Cliffs of Dover, Kent is also drawing children of all ages, with the re-launch of Dreamland amusement park in Margate, in June, following a refurbishment with some original rides restored and the addition of retro-style amusements that hark back to Dreamland’s 1960s heyday.\nWith the weather set fair for the rest of the summer Kent’s beaches are the perfect draw-card to while away summer afternoons on sandy beaches, explore secluded coves, lick delicious locally-made ice-cream cones, take in world-class art or dine on the county’s world-class cuisine.\nAlong the coast, explore the harbour towns of Margate, Ramsgate and Whitstable, gracing the Kent coast with English seaside-resort charm, sandy beaches and sparkling bays.\nStunning sea-scapes and sky-lines famously drew JMW Turner to Margate; fittingly it’s now home to the acclaimed Turner Contemporary gallery, which brilliantly showcases historical and contemporary works.\nVisit one of the smallest theatres in the world, Tom Thumb Theatre, in Margate; originally built as a coach house in Victorian times, the building was transformed into one of the smallest theatres in the world in 1984.\nSource:-Visit Britain", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T11:42:29.156+03:00", "highlightTitle": ""}