{"organizations": [], "uuid": "4b81516db3b7ef24d96d6612f09dd058c2d8d853", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/app_store_Home-169x300.png", "site_section": "http://www.travelandtourworld.com/news/article/category/cruise/", "section_title": "Cruise News| Online Cruise Industry News| Cruise Market Trends | Cruise Business News| Travel Industry NewsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/carnivals-enhanced-internet-access-including-social-media-packages-to-be-rolled-out-fleetwide-by-early-2016/", "country": "US", "title": "Carnival’s Enhanced Internet Access, Including Social Media Packages, To Be Rolled Out Fleetwide by Early 2016Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Carnival’s Enhanced Internet Access, Including Social Media Packages, To Be Rolled Out Fleetwide by Early 2016Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "4b81516db3b7ef24d96d6612f09dd058c2d8d853"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/carnivals-enhanced-internet-access-including-social-media-packages-to-be-rolled-out-fleetwide-by-early-2016/", "ord_in_thread": 0, "title": "Carnival’s Enhanced Internet Access, Including Social Media Packages, To Be Rolled Out Fleetwide by Early 2016Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carnival’s Enhanced Internet Access, Including Social Media Packages, To Be Rolled Out Fleetwide by Early 2016 Published on : Thursday, August 20, 2015\nCarnival Cruise Line’s new social media Internet packages – which offer access to a variety of popular Web sites for just $5 a day – are now available on more than half of the line’s ships with fleetwide implementation scheduled by the first quarter of 2016.\nAdditionally, the line’s new mobile app – currently available on Carnival Breeze and offering an innovative “chat” feature – has been very well received with a third of the ship’s guests actively using the app during their cruise. The app is expected to be available on five additional ships by the end of the year and be fleetwide by summer 2016.\n“Fast, affordable and reliable social media channels and the Internet have become essential on today’s cruise ships,” said Gabriela Gonzalez, Carnival’s vice president of guest technology. “We have thoughtfully approached this area to ensure we are providing options that guests sailing throughout our fleet find truly valuable and reliable,” she added.\nCurrently available on 13 ships, Carnival’s enhanced Internet access offers dramatically increased bandwidth and speed while the cruise industry’s first social media package provides unlimited access to Twitter, Facebook, Instagram, Snapchat, LinkedIn, Pinterest and other popular sites for just $5 per day with discounted plans available for the entire cruise.\nUnlike other shipboard Internet packages, Carnival’s social media package is unique in that it allows guests a convenient, flexible and highly affordable option for updating their favorite social media channels during their cruise at one low price.\nThere’s also a “value” plan that includes unlimited access to the Web for checking email, sports scores, weather updates and a wide range of other applications, and a “premium” package that provides the fastest available connection speed and allows access to video calling sites like Skype.\nThe new Carnival HUB mobile app currently on Carnival Breeze provides guests with a convenient, at-a-glance view of the ship’s many facilities and features along with updates on events and happenings taking place on board, all available free of charge. Available for download at the Apple App Store and Google Play Store, the app also includes an innovative “chat” feature that allows guests to exchange messages with their traveling companions using their mobile devices for a flat fee of $5 for the entire cruise.\nThe app also includes day-by-day schedules of hundreds of on-board events, information on food and beverage venues, searchable deck plans, itinerary details, Sail & Sign account balance and more. Recently added options include the ability to pre-purchase the line’s Cheers! and Bottomless Bubbles beverage programs and upload photos to be displayed on Carnival Breeze’s 270-square-foot Seaside Theatre during the voyage. Additional features are scheduled to be added in the future.\nSource:- Carnival Cruise Lines", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-21T01:43:09.869+03:00", "highlightTitle": ""}