{"organizations": ["BAA Indianapolis LLC"], "uuid": "82b29c48087ad3c3c24121b909c8db701f19dab2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/08/26/763725/10147315/en/Indianapolis-International-Airport-now-has-fastest-Wi-Fi-of-any-airport-in-the-nation.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "Indianapolis International Airport now has fastest Wi-Fi of any airport in the nation", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Indianapolis International Airport now has fastest Wi-Fi of any airport in the nation", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T22:43:00.000+03:00", "replies_count": 0, "uuid": "82b29c48087ad3c3c24121b909c8db701f19dab2"}, "author": "", "url": "http://globenewswire.com/news-release/2015/08/26/763725/10147315/en/Indianapolis-International-Airport-now-has-fastest-Wi-Fi-of-any-airport-in-the-nation.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "Indianapolis International Airport now has fastest Wi-Fi of any airport in the nation", "locations": ["U.S.", "Indianapolis International Airport"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indianapolis International Airport now has fastest Wi-Fi of any airport in the nation Recent upgrades boost speeds 8 to 10 times faster than major U.S. airports August 26, 2015 15:43 ET | Source: BAA Indianapolis LLC (Indianapolis International Airport) \nINDIANAPOLIS, Aug. 26,   Indianapolis International Airport (IND) has another achievement to celebrate: recent technology upgrades in the terminal have created a Wi-Fi system that is faster than any airport in the United States. Boasting an average of 40 mbps (megabits per second), IND's Wi-Fi allows more passengers to comfortably stream more movies, television shows and music than ever before. The new technology means IND guests can enjoy wireless speeds that are 8 to 10 times faster than even the largest U.S. airports. \n\"We are dedicated to keeping up with the demands of our customers and responding to their needs,\" says Mario Rodriguez, executive director of the Indianapolis Airport Authority (IAA). \"Travelers, especially our next generation of travelers, the millennials, expect a fast, reliable Wi-Fi experience. At IND, we made a commitment to deliver that better than anyone else.\" \nImprovements to the terminal's wireless infrastructure include nearly doubling the number of access points from 99 to 197. By increasing the density of the access points, IND now has multiple gateways for more people to enjoy faster speeds and better performance throughout the airport campus. \nAlso, the airport recently upgraded from wireless N technology to wireless AC technology. The faster speeds provided by wireless AC, combined with the increased density of access points provides a greater coverage area, virtually eliminating \"dead spots\" in the terminal and allowing speeds 10 to 15 times faster at each access point. \nBest of all, IND's Wi-Fi is free, secure and requires no log-in. \n\"We're pretty unique among airports,\" says Reid Goldsmith, IAA's Senior Director of Information Technology. \"We have implemented a Wi-Fi system where you don't have to sit through an ad or pay for internet access. You connect and go, just like at home.\" \nGoldsmith says IND's IT department will constantly use monitoring tools to measure crowds and usage at the airport. \"As demand for speed increases, we can quickly react and increase our capabilities to meet that demand.\" \nAbout the Indianapolis Airport Authority \nThe Indianapolis Airport Authority owns and operates Indiana's largest airport system. In addition to the Indianapolis International Airport, its facilities include the Downtown Heliport, Eagle Creek Airpark, Hendricks County Airport, Indianapolis Regional Airport and Metropolitan Airport. IND has received numerous prestigious awards recognizing it as a leader within its class, including best airport in North America in 2010, 2012, 2013 and 2014 in Airports Council International's annual Airport Service Quality awards. It has also been inducted into the ACI Director General's Roll of Excellence, one of the few U.S. airports to be included in this elite group of worldwide airports. IND is the first airport in the U.S. to win LEED® certification for an entire terminal campus. LEED is a green-building award for Leadership in Energy and Environmental Design. IND has won additional recognition for excellent customer service, concessions programs, and art and architecture. \nIND generates an annual economic impact in Central Indiana of more than $4.5 billion without relying on state or local taxes to fund its operations. About 10,000 people work at the airport each day. IND serves more than 7 million business and leisure travelers each year and averages 140 daily flights, seasonally and year-round, to 41 nonstop destinations. Home of the world's second-largest FedEx Express operation and the nation's eighth-largest cargo facility, IND is committed to becoming the airport system of choice for both passenger and cargo service. For more information, visit IND's Facebook page at Indianapolis International Airport and Twitter page at @INDairport. Angela Cain, IAA Director of Public Affairs Jeff Dutton, IAA Manager of Communications 317-487-5025 Related Articles", "external_links": [], "published": "2015-08-26T22:43:00.000+03:00", "crawled": "2015-08-27T03:12:14.161+03:00", "highlightTitle": ""}