{"organizations": [], "uuid": "e8259683d7bc237b45777b82cf7094e4b5e5e546", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/26/84/b3/c4942655e4fc491481f1e0465adab48d-69569c89af9a4a85b69bb8f4dd0ad757-0.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/top-news/palestinians-vatican-could-raise-un-flags-before-p/nnRF7/", "country": "US", "title": "Palestinians, Vatican could raise UN flags before pope visit", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Palestinians, Vatican could raise UN flags before pope visit | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T09:49:00.000+03:00", "replies_count": 0, "uuid": "e8259683d7bc237b45777b82cf7094e4b5e5e546"}, "author": "CARA ANNA", "url": "http://www.ajc.com/ap/ap/top-news/palestinians-vatican-could-raise-un-flags-before-p/nnRF7/", "ord_in_thread": 0, "title": "Palestinians, Vatican could raise UN flags before pope visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In a move likely to upset Israel's government, the Palestinians and the Vatican are seeking to raise their flags at U.N. headquarters — just in time for Pope Francis ' visit next month.\nSupporters of the idea hope the U.N. General Assembly will adopt a resolution on the flag-raising shortly before the pope arrives. They're betting that the United States or other allies of Israel will not block the plan and risk offending the Holy See on Francis' first U.S. visit.\nThe Palestinians' proposal has been tabled, and a draft of the resolution set to be made public Wednesday has been seen by The Associated Press. It would allow non-member observer states — there are only two — to display their flags with the 193 member states.\nFFILE - In this Sept. 18, 2007 file photo, the flags of member nations fly outside of the United Nations headquarters. In a move likely to upset Israel's government, the Palestinians and the Vatican are seeking to raise their flags at the U.N., just in time for Pope Francis' visit in September 2015. (AP Photo/Mary Altaffer, File) The United States and Israel oppose recognizing the Palestinian state, arguing that it undermines efforts to negotiate a peace agreement. That process, however, has largely been at a standstill since the deadly conflict in Gaza a year ago.\nMany states have shown support for the Palestinians' pursuit of statehood, including the Holy See.\nIn May, the Vatican officially recognized the state of Palestine in their first formal, bilateral treaty. Israel's foreign ministry said it was \"disappointed.\" During Francis' 2014 visit to the Holy Land, the Vatican's official program referred to Palestinian President Mahmoud Abbas as the president of the \"state of Palestine.\"\nIn 2012, the Vatican welcomed an overwhelming vote in the General Assembly to upgrade the Palestinians' status to a U.N. non-member observer state. Their delegation promptly unfurled the flag in the chamber.\nThe pope has not been shy about ambitious diplomacy. He helped bring the United States and Cuba together for their historic reestablishment of diplomatic ties. Last year, he invited the Israeli and Palestinian presidents for a day of peace prayers at the Vatican.\nMost countries in Western Europe have held off on recognizing a Palestinian state, but some have hinted that their position could change if peace efforts remain deadlocked. Most countries in Africa, Asia and South America have recognized Palestine.\nFrancis is scheduled to address the General Assembly on Sept. 25, opening a gathering of world leaders to launch a set of development goals aimed at ending both poverty and hunger over the next 15 years.\nMore than 100 heads of state and government are expected at the gathering, which leads into the annual U.N. General Assembly of world leaders the following week. President Barack Obama , Russian President Vladimir Putin , Chinese President Xi Jinping and Iranian President Hassan Rouhani are scheduled to speak on the first morning.", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/26/84/b3/c4942655e4fc491481f1e0465adab48d-69569c89af9a4a85b69bb8f4dd0ad757-0.jpg"], "published": "2015-08-26T09:49:00.000+03:00", "crawled": "2015-08-26T09:05:02.907+03:00", "highlightTitle": ""}