{"organizations": [], "uuid": "08263e3eb7028579f4ab76159084c1cb19405e01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/0e7d3169-607e-4567-ab1d-9494aaeaa9d6.img", "site_section": "http://www.ft.com/rss/companies/travel-leisure", "section_title": "Travel & Leisure", "url": "http://www.ft.com/cms/s/3/f3153d5a-4c95-11e5-9b5d-89a026fda5c9.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "country": "US", "title": "Ironman: Wanda why?", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Ironman: Wanda why?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T20:22:00.000+03:00", "replies_count": 0, "uuid": "08263e3eb7028579f4ab76159084c1cb19405e01"}, "author": "", "url": "http://www.ft.com/cms/s/3/f3153d5a-4c95-11e5-9b5d-89a026fda5c9.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Ironman: Wanda why?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wanda"], "text": "Mobile gaming — going cheep \nThe bragging rights. The needlessly expensive bikes. The Lycra. What is there for a middle-aged man not to love about Ironman Triathlons? One middle-aged man loves them more than others. Wang Jianlin, one of China’s richest men, has just paid $650m (via his Wanda group) for World Triathlon Corporation, the company that runs Ironman. It is just the latest in a line of sporting trophies for Mr Wang — he also owns one-fifth of Atletico Madrid and Infront Sports & Media, a sports marketing group. \nBut can a company that runs a few races (even 141-mile ones) really be worth $650m? There are no publicly available figures for sales or profits. Ironman had 230,000 racers last year, each one paying between $160 and $600. Assume that it generated race fees of $100m and perhaps twice that in sponsorships (watches, mattresses, perfume — you name it). The price Wanda paid is still more than two times those revenues. There are no listed triathlon organisers but Live Nation, a US-based events company, trades at less than one times revenues. \nSo Mr Wang must have big plans for Ironman. The aim is to expand the sport in China , from 100 amateur Chinese triathletes to 200,000 by 2025. Infront Sport and a reality TV show will promote it all. State incentives to raise China’s sport revenues from $10bn to $780bn by 2025 will help. Mr Wang knows how to take advantage of Chinese growth — he has also invested in shopping malls, theme parks and hotels often in line with state priorities. \nFor anyone watching all this exertion from afar, there are two lessons. First, Mr Wang is still a big believer in the growth of the Chinese middle-class (even if stock market investors are starting to have their doubts). Second, do not underestimate the business potential of live events. They have helped to save the music business when many were predicting its demise. Even in the age of mobile phones, tablets and smart watches, not all entertainment takes place via a screen. \nEmail the Lex team at lex@ft.com Related Topics", "external_links": [], "published": "2015-08-27T20:22:00.000+03:00", "crawled": "2015-08-28T08:43:33.964+03:00", "highlightTitle": ""}