{"organizations": [], "uuid": "0709e3ba2a689191e76d44c49b93d884697148b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/28/12930818/WDWlogo_Tagline_BostonStore.jpg", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/2015/08/prweb12930818.htm", "country": "US", "title": "7th Annual Wine & Dine Wisconsin to be Held on October 10th and 11th", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "7th Annual Wine & Dine Wisconsin to be Held on October 10th and 11th", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "0709e3ba2a689191e76d44c49b93d884697148b4"}, "author": "Dave Jones", "url": "http://www.prweb.com/releases/2015/08/prweb12930818.htm", "ord_in_thread": 0, "title": "7th Annual Wine & Dine Wisconsin to be Held on October 10th and 11th", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On October 10th – 11th, Wine & Dine Wisconsin, presented by Boston Store , will put on their seventh annual premier tasting event. This year’s Wine & Dine features a stellar line-up of vendors, multiple cooking and baking demonstrations, and countless food and beverage samples both days. \"Wine & Dine Wisconsin is a great way for attendees to connect socially around the unique culinary experiences Wisconsin has to offer,\" said David Ledlie, Senior Director of Marketing at Milwaukee Journal Sentinel. \"It's our pleasure to facilitate those connections and provide an event our attendees will bring their friends to year after year.\"\nAt Wine & Dine Wisconsin, guests can sample their way through exhibits featuring products, services, and menus from right here in Wisconsin. The event will have three main presentation stages: Chefs, Culinary and Libations, where expert demonstrations will take place throughout the weekend. Attendees can also cook with the experts from MATC’s Culinary Arts program and learn more about culinary careers at the MATC Hands-on Cooking Area, presented by Pick ‘n Save\nCritic’s Choice\nWine & Dine Wisconsin will also showcase some of the area’s premier restaurants in the Critic’s Choice area. All of the restaurants in Critic’s Choice are selected from Milwaukee Journal Sentinel Dining Critic Carol Deptolla’s Top 30 Restaurants list. Critic’s Choice will be held on Saturday only and a limited number of tickets are available.\nTicket Information\nSaturday General Admission Only: ($50 online, or $60 at the door) Includes access to all of the vendors, presentations, and hands-on demonstrations on the main floor.\nSaturday Critic’s Choice: ($85 online, or $95 at the door) The Critic’s Choice ticket includes General Admission.\nSunday General Admission Only: ($40 online, or $50 at the door) Includes access to all of the vendors, presentations, and hands-on demonstrations on the main floor.\nTickets are available now at http://www.wineanddinewisconsin.com .\nAbout Wine & Dine Wisconsin:\nWine & Dine Wisconsin, presented by Boston Store, is your place to Sip, Taste and Learn – in Style. Samples include wine, microbrews, craft cocktails and bite-size previews of what you’ll find when you visit Milwaukee area restaurants. The 2015 event will be held on October 10th-11th at the Wisconsin Center in downtown Milwaukee.\nAbout Boston Store\nBoston Store consistently offers a wide selection of unique and limited-distribution merchandise and competitively priced national and private brands tailored to the lifestyle needs of our customer. We provide our customer with an innovative and convenient shopping environment, attended by friendly and knowledgeable associates. Our website reaches out to all of our customers and allows us to serve markets that extend well beyond the geographical boundaries of our stores.\nAbout Milwaukee Journal Sentinel\nMilwaukee Journal Sentinel prints the Milwaukee Journal Sentinel newspaper as well as a range of other print and electronic products, including JSOnline.com, primarily serving people and businesses in southeast Wisconsin. The Milwaukee Journal Sentinel offers a bundled subscription for both print and digital or digital-only subscribers with added applications for both mobile devices and tablets. Journal Sentinel is committed to providing news coverage that reflects the ever-changing world and fulfills the needs of readers and advertisers both in print and online.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5ib3N0b25zdG9yZS5jb20v", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3dpbmVhbmRkaW5ld2lzY29uc2luLmNvbS9zaG93LWluZm8vY3JpdGljcy1jaG9pY2Uv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3dpbmVhbmRkaW5ld2lzY29uc2luLmNvbS8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy53aW5lYW5kZGluZXdpc2NvbnNpbi5jb20="], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-29T00:36:20.608+03:00", "highlightTitle": ""}