{"organizations": [], "uuid": "36d0bd8b589766daf891ccc868fe4f435d6292ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03403/grandparents2GETTY_3403877k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-26.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11794033/If-grandparents-were-paid-they-would-earn-20000-during-the-summer-holidays.html", "country": "US", "title": "If grandparents were paid they would earn £20,000 during the summer holidays", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "If grandparents were paid they would earn £20,000 during the summer holidays - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T15:01:00.000+03:00", "replies_count": 0, "uuid": "36d0bd8b589766daf891ccc868fe4f435d6292ec"}, "author": "Saffron Alexander", "url": "http://www.telegraph.co.uk/goodlife/11794033/If-grandparents-were-paid-they-would-earn-20000-during-the-summer-holidays.html", "ord_in_thread": 0, "title": "If grandparents were paid they would earn £20,000 during the summer holidays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More grandparents are making the decision to look after their grandchildren during the summer holidays. A new study has found that two thirds of grandparents except to spend \"significantly more time than usual\" looking after their grandchildren during the school holidays. The research, from HSL Chairs, found that the average grandparent in the UK will look after their grandchildren in some capacity for over 600 hours over the summer. If they were paid a realtime wage for their efforts, the study estimates some particularly hardworking grandparents would be entitled to over £20,000 for their six weeks of work. Using the website PayScale , the study worked out that some of the typical roles grandparents in the UK undertake are: personal chef (£29.04 per hour), chauffeur (£18.64 per hour), sports coach (£27.97 per hour), and private tutor (£23.18 per hour). 85 per cent of grandparents said they looked after their grandchildren out of love, whilst 60 per cent said they did it to make their own children's lives easier. 35 per cent said they wanted to help cut childcare costs with a further 21 per cent admitting to feeling guilty if they weren't able to help out. Grandparents take on a range of typically high paying occupations during the holidays Photo: Getty Linda Robson , a panellist on Channel 4's Loose Women, calls grandparents 'invaluable' after having relied heavily on her own mother to help with childcare for her children when they were younger: \"I couldn't have worked without my mum looking after my children when they were little, and I treasure my time with my granddaughter Lila. \"We have the best time together and have a special bond that will always be there. I love our time together.\" As well as being generous with their time, a third of grandparents also admitted to being extremely generous with their money. Grandparents, on average, spend slightly more than £100 on their grandchildren during the holidays with 2 per cent confessing to spending more than £400 on activities and gifts. Lesley Murphy has five grandchildren aged between 13 years and 2 years and regularly takes them on days out during the holidays: \"Choosing places to go can get a bit difficult because of the varied age range of my grandchildren, so we'll often end up going to places that are free, such as the park. We do also take them out for daytrips to waterparks or trampoline centre's, and we're about to take three of them to the coast for a week.\" In 2014 David Cameron suggested that hundreds of thousands of grandparents who look after their grandchildren could be given parental rights to paid leave and greater financial support . Lesley, like many other grandparents, doesn't ask for money to look after her grandchildren: \"Me and my husband offered to look after them during the holidays when we can. Sometimes, if we're doing something particularly costly their parents will contribute a little, but we don't ask for anything from them usually .\" Despite the hard work - 57 per cent said they felt physically exhausted during the holidays - a further 35 per cent said looking after their grandchildren offered the \"ultimate job satisfaction.\" How much could you earn during the holidays as a grandparent? telegraph.co.uk Follow @telegoodlife", "external_links": [], "published": "2015-08-26T15:01:00.000+03:00", "crawled": "2015-08-26T09:55:27.586+03:00", "highlightTitle": ""}