{"organizations": ["Dharamvir Bharati", "Hindustan Times"], "uuid": "e7ad466d4c6007a1eafa30214dc540850866d4ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/d1a5b189-4fc5-4c52-b8ca-8a4fc7bab40dMediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Books\r", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/books/why-dharamvir-bharti-s-gunahon-ka-devta-is-relevant-to-new-age-readership/article1-1375285.aspx", "country": "IN", "title": "Why Gunahon Ka Devta is relevant to new-age readership", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Why Gunahon Ka Devta is relevant to new-age readership", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T09:02:00.000+03:00", "replies_count": 0, "uuid": "e7ad466d4c6007a1eafa30214dc540850866d4ea"}, "author": "", "url": "http://www.hindustantimes.com/books/why-dharamvir-bharti-s-gunahon-ka-devta-is-relevant-to-new-age-readership/article1-1375285.aspx", "ord_in_thread": 0, "title": "Why Gunahon Ka Devta is relevant to new-age readership", "locations": ["New Delhi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ravi Subramanian"], "text": "Ravi Subramanian, Hindustan Times , New Delhi | Updated: Aug 01, 2015 14:31 IST Dharamvir Bharati (HT file photo) \nAt times, translations change the real experience of a literary piece. However, Poonam Saxena's translation of Dharamvir Bharti's Gunahon Ka Devta is an endeavour to be cherished. It introduces the modern Hindi classic to new-age readership, without any attempts to modernise. Ravi Subramanian explores how the new translation makes it all the more relevant for today's book lovers. Chander and Sudha is an intense examination of the prevailing social norms from about half a century ago in Dharamvir Bharti's Gunahon Ka Devta. The wit and verve with which the characters motivations are drawn out makes it a very accessible lens to analyse the living conditions of educated and upper class men and women of the time. The book is anchored by the main protagonist, 20 something Chander and a teenage Sudha. There are memorable side characters in the form of Sudha’s confidant, Binti and Chander’s lover Pammi. Their happy cocooned lives are thrown into disarray when it is decided that Sudha has become of marriageable age and it is time to find her a groom. In a time and place where the intermingling of the genders was taboo, Chander has been the only non-relative male presence in Sudha’s life because he is being mentored by Sudha’s father, Dr Shukla. This leads to the forming of a platonic bond of love between Chander and Sudha. The matter is complicated by Dr Shukla’s unflinching trust in Chander’s intentions towards Sudha and tasks him with the job of getting Sudha’s consent for marriage with a man that her aunt has chosen. The choice of Allahabad as the novel’s setting is ideal because of its proximity to cosmopolitan Delhi and the backwater of Shahjahanpur which ends up being Sudha’s marital home. Old timers would probably be transported to a more genteel age where learning and poetry were prime pursuits for the Allahabadi youth. Apparently, it was a time where it was perfectly natural for two friends to casually tease each other with sonnets. Chander is the ideal male, who is conscientious in all his dealings. However, he is also very aware of and enjoys the pedestal on which he is placed. Sudha is the innocent and pampered daughter of her father. She invests all her energies in taking care of Dr Shukla and swings with carefree abandon between seeking Chander’s opinions about everything and deliberately annoying him. All the characters transform in remarkable ways where they end up with opinions that would have seemed absurd to them at the beginning of the novel. Everyone has decisions to make and invariably their choices are clouded by what society expects of them rather than what they truly desire. This leads to disastrous outcomes for all concerned. Is dissatisfaction the price that one has to pay to ensure that societal norms aren’t violated? There is a deliberate sadness that pervades the novel and one constantly feels dark clouds looming over scenes of happiness. The quality of the translation is superb. I have read and reread Gunahon Ka Devta and this is one of those rare instances where the prose does not sound absurd in translation. It must have been a task to retain Dharamvir Bharati’s original pithy observations. All the characters are highly sentimental and wear their emotions like a badge of honour. Poonam Saxena’s translation crucially retains all of this, even in instances where the dialogue rings unreal in today’s times. She hasn’t attempted to modernise a classic. The dialogues are packed with emotional energy that wouldn’t be out of a place in a big budget movie. Sample this: \"Till today, your eyes have filled my life with bliss, and every breath of mine has given your wings the speed and strength of a storm. Both of us should be happy that we have this opportunity to prove to the world that our relationship has been pure, ethereal, intangible – that such a relationship is possible.\"Chander faces internal and external conflict when he begins to realise that his idea that only platonic love is true means he’s been looking at things from a narrow field of vision. When Chander loses Sudha in an act of apparent self-sacrifice, he is coaxed into seeing other aspects of love by the older and wiser Pammi, which causes him to doubt himself and to behave uncharacteristically. Meanwhile, Sudha displays a doomed resilience that no one suspected she had. Her husband, Kailash, is cast as a hapless onlooker, which might be Bharati’s way of cocking a snook at the men in the novel who behave as if the women are property that needs to be preserved and transferred. It would be erroneous to assume that the novel does not hold current relevance because themes of women’s emancipation, pre-marital sex and caste related rituals resonate even today. Poonam Saxena has etched out a beauty and joined the not-so-long list of authors — Arunava Sinha being the only other notable voice in this space — who lend credibility to translated works. That’s reason enough for Chander and Sudha to be on your reading list. Ravi Subramanian is the author of God is a Gamer. Tags", "external_links": [], "published": "2015-08-01T09:02:00.000+03:00", "crawled": "2015-08-01T13:47:00.894+03:00", "highlightTitle": ""}