{"organizations": [], "uuid": "63c910127be60ab3bbc32e6ceee1c14e7be2b8b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28525-gb-tennis-legend-to-lead-english-european-challenge-at-la-manga-club", "country": "US", "title": "GB tennis legend to lead English European Challenge at La Manga Club", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "GB tennis legend to lead English European Challenge at La Manga Club", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T17:00:00.000+03:00", "replies_count": 0, "uuid": "63c910127be60ab3bbc32e6ceee1c14e7be2b8b3"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28525-gb-tennis-legend-to-lead-english-european-challenge-at-la-manga-club", "ord_in_thread": 0, "title": "GB tennis legend to lead English European Challenge at La Manga Club", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GB tennis legend to lead English European Challenge at La Manga Club GB tennis legend to lead English European Challenge at La Manga Club Details Category: Venues & Events Created   15:00 British tennis legend Mark Cox will return to the international spotlight next month when he spearheads a strong English challenge that will compete at the 2015 European Senior Tennis Club Championships at Spain’s La Manga Club. Former Davis Cup star Cox, 72, who was ranked 13th in the world at the peak of his career, will be a member of Leicestershire Tennis & Squash Club’s men’s over-65 team that will bid for European glory at the elite event, which will be staged at the award-winning resort in Murcia, south-east Spain, from September 13-26. \nJoining the veteran left-hander and his teammates at La Manga Club will be 12 other clubs from England as they take on the cream of the amateur game from the continent for the chance to be crowned European champions in a range of different categories for men and women. St Georges Hill Lawn Tennis Club, from Weybridge, Surrey, will be represented by the most teams at the championships with three sides having qualified, with The Warwick Boat Club and Leicestershire Tennis & Squash Club sending two each. Teams from South Northumberland Churchill, Roehampton Club, Hallamshire LTC, Winchester Racquets and Fitness, Harpenden LTC, Woodford Wells LTC, West Hants TC, Byfleet LTC, The Wimbledon Club and The ‘45’ Club will make up the rest of the English entry. Organised by Tennis Europe – who extended its partnership with La Manga Club until 2017 earlier this year – the event will feature men and women from its 49 tennis federations competing at the resort’s extensive 28-court academy for titles in 11 different age categories. Founded in 1983, the championships are open to men over the age of 35 and women aged 40-plus from national champion clubs and the runners-up from the previous year in an international team competition across various age categories, as well as teams nominated by Tennis Europe member nations. Previous winners have included entrants from Germany, Portugal, Holland, France, England, Austria, Hungary, Italy, Belgium, Spain and Czech Republic and the competition is set to be as fierce as ever this year. Each country can be represented by a maximum of two clubs in every sector at La Manga Club, with teams comprising between four to seven players for men’s categories and two to five for women. The clay court championships will see elite players in the Super Seniors categories compete at the resort from September 13-19, with men’s age groups ranging from 55 to over-70s and women’s from 55-plus to over-65. Attention will then fall on the younger categories for the rest of the event, with seniors between the ages of 35-plus to 50 for men and 40-plus to 50-plus for ladies. With an average of more than 300 days’ sunshine a year, La Manga Club offers the perfect destination for professional and amateur tennis players to work on all aspects of their technique under sunny skies at the venue’s outstanding 28-court academy. Featuring 20 clay courts, four hard courts and four on artificial grass, the academy boasts some of the finest tennis facilities in Europe and a wide range of academies are available to guests of all ages to improve their racquet skills. The official overseas training base of the Lawn Tennis Federation, La Manga Club regularly hosts the world’s top tennis stars as well as staging both Davis and Fed Cup tennis matches, with South Africa’s Kevin Anderson, ranked 15th in the world, among the recent visitors. Among its recent accolades, the resort was named as Spain’s leading golf complex at the 2014 World Golf Awards and was voted ‘Best Golf Resort in Spain’ by UK readers of Today’s Golfer magazine for an impressive fourth year running. In addition to its outstanding tennis academy, La Manga Club’s extensive facilities also include three 18-hole championship golf courses and a new Leadbetter Golf Academy – the only one of its kind in mainland Spain – a new High Performance Sports Centre and 2,000m² spa and fitness complex, a five-star hotel, four-star serviced apartments and townhouses and more than 20 bars and restaurants. Related articles", "external_links": [], "published": "2015-08-28T17:00:00.000+03:00", "crawled": "2015-08-28T17:47:53.728+03:00", "highlightTitle": ""}