{"organizations": [], "uuid": "70865f7a7504aefa50c1b6a985038ac441cde799", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/download28.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mission-hills-st-andrews-fundraising-championship-embraces-chinas-golfing-future/", "country": "US", "title": "Mission Hills–St Andrews Fundraising Championship ‘Embraces China’s Golfing Future’Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Mission Hills–St Andrews Fundraising Championship ‘Embraces China’s Golfing Future’Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "70865f7a7504aefa50c1b6a985038ac441cde799"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mission-hills-st-andrews-fundraising-championship-embraces-chinas-golfing-future/", "ord_in_thread": 0, "title": "Mission Hills–St Andrews Fundraising Championship ‘Embraces China’s Golfing Future’Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mission Hills–St Andrews Fundraising Championship ‘Embraces China’s Golfing Future’\nChina’s golfing future came into sharp focus at the third edition of the Mission Hills–St Andrews: Home to Home Scholarship Fundraising Championship.\nUnderlining Mission Hills’ commitment to grow the game, the event was inaugurated in 2013 when St Andrews University was celebrating its 600th anniversary. The aim of the annual gathering remains to offer top-level education to academically gifted Chinese youngsters seeking to carve a career for themselves in the Royal and Ancient game.\nMission Hills, China’s premier golf and leisure brand, will identify candidates and draw up a shortlist before St Andrews, Scotland’s oldest university, makes the final selection. Mission Hills will also provide funding for a minimum of one semester and this can be extended to a whole academic year of a full degree course.\nThe student will also be considered for acceptance into the University of St Andrews’ Saints Golf Programme for the duration of the overseas study term.\nTenniel Chu, Vice Chairman of Mission Hills Group, said: “This tournament is about embracing the future – specifically, China’s golfing future.”\n“Both Mission Hills and the University of St Andrews share a commitment to grow golf in China by providing the talented young Chinese players access to a world-class university to study and improve their game. We feel strongly that a sustainable long-term future for golf in China depends on growing the game at the grass-roots level. This programme is a significant investment in that future.”\nPlayed over the Annika Sorenstam-designed course at Mission Hills Dongguan, the tournament attracted nearly one hundred players.\nAdding spice to the tournament was the fact that participants had to swop their golf clubs for a football on the 137-yard, par-three 17th hole and display their Footgolf skills.\nIn the event in which the best three Stableford scores from each team of four counted, victory went to the quartet of Zhu Sanjun, Deng Zhifeng, Sun Tianxiong and Lin Juncai. They win a trip to play over the hallowed links at St Andrews, the ancestral ‘Home of Golf’.\nSpeaking at the presentation dinner, Chu said: “Golf and the University of St Andrews go hand in hand and this is reflected in its impressive list of honorary graduates. Among the eminent politicians, tycoons, scientists and artists who have received honorary degrees, we see the names of golfing giants such as Jack Nicklaus, Arnold Palmer, Tom Watson and Sir Nick Faldo”.\nDerek Watson, Quaestor and Factor of the St Andrews University, said: “It has been a great pleasure for those of us who have travelled from St Andrews for this event, to see Mission Hills’ magnificent courses and facilities. We may be from the home of golf, but what I have seen here, China will play a huge part in the future of the great game.”\n“This event will contribute towards our scholarship funds. These will be used to give students from China and Hong Kong, the opportunity to come and be part of our family. We will welcome them, nurture their talent and educate them and move forward with them as they write our future.”\nThe tournament is part of a programme of activities and exchanges between Mission Hills and the University of St Andrews.\nThese include Mission Hills making a financial contribution to the town’s museum, to which St Andrews has responded by donating exhibits for the soon-to-be-opened Dr. David Chu Golf Museum – the first such public facility in China – at Mission Hills Shenzhen.\nSource:- IAGTO", "external_links": [], "published": "2015-08-29T03:00:00.000+03:00", "crawled": "2015-08-29T21:10:03.227+03:00", "highlightTitle": ""}