{"organizations": [], "uuid": "94200396dbb21b4fa2af54fd671cc195537fedca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/9/j/y/6/image.related.StuffLandscapeSixteenByNine.620x349.169jrj.png/1439176261039.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/themes/budget/70989391/Lonely-Planet-founders-budget-experiment-to-fly-home-with-22-stops", "country": "AU", "title": "Lonely Planet founder's budget experiment to fly home with 22 stops", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Lonely Planet founder's budget experiment to fly home with 22 stops", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T06:11:00.000+03:00", "replies_count": 0, "uuid": "94200396dbb21b4fa2af54fd671cc195537fedca"}, "author": "Gabrielle Dunlevy", "url": "http://www.stuff.co.nz/travel/themes/budget/70989391/Lonely-Planet-founders-budget-experiment-to-fly-home-with-22-stops", "ord_in_thread": 0, "title": "Lonely Planet founder's budget experiment to fly home with 22 stops", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lonely Planet founder's budget experiment to fly home with 22 stops GABRIELLE DUNLEVY Last updated 15:11, August 10 2015 Taranaki Daily News \nLonely Planet's founder Tony Wheeler is flying from London to Melbourne with 22 budget airlines. \nIt's not quite the shoestring travel that launched his success, but Lonely Planet founder Tony Wheeler is on the move and doing it on a budget again. \nThe Melbourne-based philanthropist's latest adventure takes him from London to home in 22 stops, on low-cost carriers all the way. \nWhile Wheeler is delighted by the hop-on, hop-off jaunt, one person's fully reclined seat is another's nightmare. \nMaureen, his wife and travel companion since the Southeast Asia road trip that began the guidebooks, is not along for this ride. \n\"Maureen said 'you are nuts, don't even consider asking me to come',\" he says. \n\"So she has gone on a European opera tour, which I don't have the stamina for. \n\"After a week of that I've had enough. So far, I'm really enjoying this.\" \nIt's now stop 14, in Singapore, and Wheeler is unbelievably unruffled despite deliberately choosing airlines of ill-repute. \nAmong them are perennial survey loser Ryanair, and Lion Air, which managed to overshoot an unusually decent Indonesian runway in Bali in 2013. \nBut it's all in the name of \"fun\", he says, and possibly another book. \nGoing the long way is a chance to see cities one wouldn't otherwise think to visit - in Wheeler's case he'd never been to Marseilles. \nHe's also taking statistics to measure airline performance. \n\"I have my iPad at the ready, recording how long each flight takes compared to their claims,\" he says. \n\"It's definitely a boy's geek thing.\" \nAlso on Wheeler's horizon is one of his favourite events, the Ubud Writers Festival, where he and Maureen will both be leading talks on things literary. \nThere's also a trip to Romania for a Global Heritage Fund project preserving Carpathian Mountain villages - one of the many causes the couple has taken up since selling the Lonely Planet empire. \nBut first, there's eight flights to catch before he's home. \nEarly bird tickets are now on sale for the Ubud Writers Festival, October 29 to November 1. - AAP", "external_links": [], "published": "2015-08-10T06:11:00.000+03:00", "crawled": "2015-08-11T05:31:37.426+03:00", "highlightTitle": ""}