{"organizations": [], "uuid": "c4947460f6eeb54f4e3e99957fc124be7c6bc4b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/191aa5c0-43f0-4987-8075-8b20ac7b85e8MediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Fashion\r", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/fashion/lfw-2015-teaser-manish-malhotra-s-first-ever-menswear-show/article1-1384011.aspx", "country": "IN", "title": "LFW 2015 teaser: Manish Malhotra's first-ever menswear show", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "LFW 2015 teaser: Manish Malhotra's first-ever menswear show", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T13:20:00.000+03:00", "replies_count": 0, "uuid": "c4947460f6eeb54f4e3e99957fc124be7c6bc4b2"}, "author": "", "url": "http://www.hindustantimes.com/fashion/lfw-2015-teaser-manish-malhotra-s-first-ever-menswear-show/article1-1384011.aspx", "ord_in_thread": 0, "title": "LFW 2015 teaser: Manish Malhotra's first-ever menswear show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Manish Malhotra"], "text": "| Updated: Aug 25, 2015 16:02 IST \nLakme Fashion Week (LFW) is back with the winter-festive edition and the forthcoming season will witness many firsts. From ace designer Manish Malhotra's first ever menswear show titled The Gentlemen's Club, Anita Dongre's maiden show for her new label 'Grassroot' to actor Vir Das's debut fashion show named \"Pret-A-Funny\", the extravaganza will be nothing less than a treat for fashion lovers. \nThe five-day event will start on Wednesday and Malhotra will introduce The Gentlemen's Club in the form of an offsite show at Mehboob Studio on the opening day of the fashion gala with Barfi! star Ranbir Kapoor as the showstopper. A photo posted by Manish Malhotra (@manishmalhotra05) on Aug 23, 2015 at 5:05am PDT \n\"In keeping with the season, The Gentlemen's Club collection is a festive fusion of Indian and western couture, focusing on shades of emerald green and adorned with botanical motifs,\" said Malhotra. \nDongre's Grassroot is a craft-based sustainable line and showcases a versatile range of wardrobe essentials that pay tribute to women's progressive attitude of embracing modernity, with due respect to the traditions of India. \nHer collection is going to be a part of the second day of the fashion gala which is also The Indian Handloom & Textile Day. A photo posted by anitadongre (@anitadongre) on Aug 24, 2015 at 8:11am PDT \nThis season, LFW launched a special initiative - Re-invent Banaras, a campaign to revive, uplift and celebrate Banaras handlooms in partnership with India's leading designers. \nSaket Dhankar, vice president and head - Fashion, IMG Reliance Ltd, said: \"The Indian Handloom & Textile Day at LFW commemorates the rich heritage of hand-woven luxury every season. \n\"This season, we celebrate crafts of weavers and artisans from Varanasi by launching 'Reinvent Banaras' campaign supporting the national initiative led by Shaina NC to promote the age-old Banaras textile tradition.\" \nA hundred designers from 18 cities and 13 sponsors will participate in LFW winter-festive 2015 with 31 from Delhi and 21 from Mumabi. A photo posted by Lakmé Fashion Week (@lakmefashionwk) on Aug 25, 2015 at 1:03am PDT \nAce designer duo Abu Jani-Sandeep Khosla will open the season on Tuesday through their collection titled \"Jawani Jaaneman\". The line is an ode to retro chic with designs inspired from the 1970s and 1980s. The duo has also chosen the collection to debut new silhouettes which include gowns, capes and kaftans, each created for the global diva. \nExploring the realm of fashion fantasy, Lakme's beauty statement for the season will play muse to designer Gaurav Gupta at the grand finale. Daniel Bauer, Lakme make-up expert, will collaborate with the designer to craft runway renditions of playful make-up looks on models with the Lakme Absolute Lip Pout. \nThe fashion week will also see the return of established designers like Namrata Joshipura, Ritu Kumar, Tarun Tahiliani, Neeta Lulla and Narendra Kumar Ahmed. \nJoshipura will be showcasing a unique LakmeInsta Light show inspired by the latest launch from Lakme and she has specially designed the clothes on the theme of Insta Light. \n\"Taking inspiration from Lakme's latest skin care innovation LakmeInsta Light, my collection aims to set the stage for a youthful and modern collection that glows and sparkles. Iridescence and shine are the primary elements of my collection and I am achieving this through both surface embellishment and interesting selection of fabrics,\" the designer told IANS. A photo posted by Namrata Joshipura (@namratajoshipura) on Aug 23, 2015 at 6:49am PDT \nAlso, designer Monisha Jaising, who has marked her entry in the e-commerce arena and is in the 25th year of her fashion career, will be presenting her creations here after a gap of five years. \nWith 21 designers to debut this season, LFW continues the trend of promoting new and emerging talent in the country. Some of the designers like Anand Kabra, Arjun Saluja, Nachiket Barve, Nikasha, Ruchika Sachdeva, Eina Ahluwalia whose fashion journey started with LFW platform, will be showcasing this season after a long time. A photo posted by @nachiketbarve on Aug 22, 2015 at 10:17am PDT \nLFW has also reinvented the Jabong stage that will now offer a new dimension in fashion content. The fashion week will give centre stage to new age fashion content in the form of experimental presentations by established artistic designers such as Kallol Datta, Ahluwalia, Little Shilpa and Bodice by Ruchika Sachdeva. \nAnother highlight of this season is that would-be brides will also get a chance to walk the ramp at Lakme Salon's bridal show co-created by designer Neeta Lulla. Tags", "external_links": [], "published": "2015-08-25T13:20:00.000+03:00", "crawled": "2015-08-25T16:36:23.563+03:00", "highlightTitle": ""}