{"organizations": [], "uuid": "b4bbcf00d17a51ca068869eed4564d2073c266d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/de5019219de347ffc08e4689646d0dfea9006bd0/c=0-77-1499-924&amp;r=x633&amp;c=1200x630/local/-/media/2015/07/30/USATODAY/USATODAY/635738585862218117-Casavana1.jpg", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/travel/flights/2015/07/31/airports-offer-restaurants--reflect-local-scene-and-cuisine/30616693/", "country": "US", "title": "Airports add local restaurants for fliers seeking unique fare", "performance_score": 1, "site": "usatoday.com", "participants_count": 2, "title_full": "Airports add local restaurants for fliers seeking unique fare", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T16:26:00.000+03:00", "replies_count": 1, "uuid": "e34592168758b453f96da277c1af4e89e42e8078"}, "author": "Charisse Jones , USA TODAY", "url": "http://www.usatoday.com/story/travel/flights/2015/07/31/airports-offer-restaurants--reflect-local-scene-and-cuisine/30616693/#post-0", "ord_in_thread": 0, "title": "Airports add local restaurants for fliers seeking unique fare", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Florida's Ft. Lauderdale-Hollywood International Airport has added two branches of Casavana, a local chain specializing in Cuban cuisine. (Photo: Delaware North)\n16 CONNECT 62 TWEET 2 LINKEDIN 1 COMMENT EMAIL MORE Increasingly, travelers are able to grab a bite of the best fare a destination has to offer without setting foot out of the airport.\nFrom Florida's Fort Lauderdale-Hollywood International to Los Angeles International, a growing number of airports are opening outposts of popular local restaurants, unique stands that serve regional cuisine, and menus crafted by prominent local chefs.\n\"The airport is really the doorstep of the community,'' says Rick Blatstein, CEO of OTG, which develops, owns and operates restaurants in 11 airports. \"And we think it's important to connect with the local tastes, flavors ... really the whole local vibe.''\nMichael Lomonaco, of Manhattan's Porter House restaurant, is the consulting chef at the Prime Tavern steakhouse in LaGuardia Airport's Terminal D. Passengers passing through Atlanta's Hartsfield Jackson International Airport can get a taste of southern barbecue at Mustard Seed, which opened in February and smokes its own meat inside its airport location.\nUSA TODAY\nCan LaGuardia Airport overhaul take it from worst to first?\nFliers can have breakfast all day long at Boise Airport's Big City Coffee, an outpost of a popular local restaurant, or regional fare and local craft beers at Bardenay, another Idaho eatery with an airport outlet.\nAnd Los Angeles' famous Farmers Market has opened a second location in LAX's Terminal 5, incorporating local ingredients into airport bites.\nThe trend of bringing local tastes into airports is largely in response to demand by millennial travelers and other fliers for fresh food and unique dining experiences, even while they're on the go.\n\"This industry is evolving ... with the changing public palate,'' says Kevin Kelly, president of the travel hospitality business for Delaware North, which manages over 300 eateries and stores at more than 30 airports and travel portals around the world.\nIn November, Delaware North helped introduce the popular Casavana Restaurant to Fort Lauderdale's airport, where it now has two locations.\nIt \"is a reflection of the community,'' Kelly says. \"It's Cuban cuisine. We've got croquettes, empanadas, and it's been very well received. There are still national chains that could fill that need, but it seems that sense of community resonates strongly with the airport authorities and the traveling market.''\nLazaro Garcia, Casavana's president, says that besides catering to traveling locals and airport employees already familiar with his restaurants, the airport locations expose Casavana's food and brand to throngs of tourists.\n\"It's a great opportunity for them to be able to see us in that atmosphere,'' he says, adding that the restaurant is exploring opening locations in other airports as well.\nThough Casavana's owners were used to delivering fast service in their local restaurants, many eateries have to adjust to the particular rhythms and restrictions that come with delivering food at an airport.\n\"A street-side restaurant may have a 200-seat dining room, and we tend to shoehorn these things into much smaller spaces in airport settings,'' Kelly said.\nSpeed is also critical. \"You've really only got half an hour to fill the order and let them enjoy the space, so the speed of service is also a non-traditional challenge that our street folks need to understand.''\nDelta worked closely with OTG to revamp the food offerings in its home terminals, C and D, at LaGuardia, as well as at New York's JFK Airport. Gail Grimmett, Delta's senior vice president for New York, said that they were mindful that higher-quality, locally flavored food offerings were vital to improving the overall customer experience.\n\"People are arriving early and everybody has a different preference,'' she says, noting that some fliers may want to sit in Prime Tavern, where they may not even feel like they're at the airport, while others want to stay near their flight's gate and have meals delivered to them. \"We're trying to find ways to ease anxieties as people travel. That comes from (offering) electrical outlets. That comes from food. All of that plays a role.''\nKevin Shaw, a member of USA TODAY's Road Warriors panel who is an information security consultant in Suffolk, Va., said that he really enjoys the unique offerings at Local Tavern in Philadelphia International Airport's Terminal F.\n\"I like that they have local beers and neat menu items like ... deviled eggs, a bacon appetizer and roasted Brussels sprouts I do not find elsewhere in my travels,'' he says..\n16 CONNECT 62 TWEET 2 LINKEDIN 1 //usat.ly/1SB7qre TOP VIDEOS", "external_links": ["http://www.gannett-cdn.com/media/2015/07/30/USATODAY/USATODAY/635738585862218117-Casavana1.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/c039b5c20a7558e4d0f816206c8974d60637d124/c=0-0-1601-1601/local/-/media/2015/07/28/USATODAY/USATODAY/635736876926105630-EPA-USA-CONSTRUCTION-LAGUARDIA-AIRPORT-001.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1SB7qre&mini=true", "http://usat.ly/1SB7qre", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1SB7qre&text=Airports%20add%20local%20restaurants%20for%20fliers%20seeking%20unique%20fare&via=usatoday", "http://www.gannett-cdn.com/-mm-/aa9d7e227ef589560eb696905979ef66b344c55c/c=84-0-1414-1000&r=x404&c=534x401/local/-/media/2015/07/30/USATODAY/USATODAY/635738585862218117-Casavana1.jpg"], "published": "2015-08-03T16:26:00.000+03:00", "crawled": "2015-08-03T19:28:34.379+03:00", "highlightTitle": ""}