{"organizations": ["ARUP", "DVVD", "University of Northern British Columbia", "Baobab", "MGA", "CNN"], "uuid": "6442b82c252f90ac0605edb0ebfdbee362d78e2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150610125941-wood-skyscraper-garden-paris-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_travel.rss", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/06/12/europe/worlds-tallest-wooden-skyscraper-paris/index.html?eref=rss_travel", "country": "US", "title": "Architects design 'world's tallest' wooden skyscraper", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Architects design 'world's tallest' wooden skyscraper", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T14:46:00.000+03:00", "replies_count": 0, "uuid": "6442b82c252f90ac0605edb0ebfdbee362d78e2a"}, "author": "", "url": "http://edition.cnn.com/2015/06/12/europe/worlds-tallest-wooden-skyscraper-paris/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "Architects design 'world's tallest' wooden skyscraper", "locations": ["France", "New York", "Stockholm", "Paris", "Australia", "Chicago", "Northern British Columbia", "Asia", "Vienna", "United Kingdom", "Middle East"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Michael Green", "Moller", "Rudiger Lainer", "Green", "Eoghan Macguire", "Andrew Lawrence", "Micheal Green", "Lawrence", "C.F. Møller", "George"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Architects design 'world's tallest' wooden skyscraper By Eoghan Macguire, CNN Updated 1118 GMT (1818 HKT) June 12, 2015 8 photos: The world's tallest wooden tower? The roof garden of the MGA-designed wooden skyscraper proposed for Paris as part of the Reinventer Paris competition. Hide Caption 8 photos: The world's tallest wooden tower? The firm states the building will be the world's tallest wood building if built. Hide Caption 2 of 8 8 photos: The world's tallest wooden tower? Architect Michael Green suggests wood could become a popular and sustainable material for constructing large urban buildings. Hide Caption 3 of 8 8 photos: The world's tallest wooden tower? Architects around the world have designed a number of wooden towers in recent years. Austrian architects Rudiger Lainer and Partner plan to construct a 84-meter (276-foot) wooden skyscraper in Vienna with work commencing in 2016. Hide Caption 4 of 8 8 photos: The world's tallest wooden tower? Danish architecture firm C.F. Møller have designed a 34-storey, wood-framed residential tower for the center of Stockholm, as part of a design competition. It could be built by 2023. Hide Caption 5 of 8 8 photos: The world's tallest wooden tower? MGA have already built the a 29.5-meter (97-foot) Wood Innovation and Design Center in Prince George, Northern British Columbia. Hide Caption 6 of 8 8 photos: The world's tallest wooden tower? A ground floor entrance of the Wood Innovation and Design Center in Prince George. The building is part of the University of Northern British Columbia campus. Hide Caption 8 photos: The world's tallest wooden tower? Green says new engineered woods allow for greater strength and heights in buildings. Hide Caption 8 of 8 (CNN) Forget steel and concrete. The new material of choice for skyscrapers could be wood if Canadian architect Michael Green has his way. Green's Vancouver-based MGA firm along with French architectural partners DVVD and real estate group REI France recently proposed what they claim would be the tallest wooden building in the world for Reinventer Paris , a design competition which sought new ideas for revitalizing architecture in the city. At 35-storeys tall, the tower at the center of the \"Baobab\" complex -- which also includes a student hotel, green space, bus station and e-car hub -- aims to help solve the French capital's housing challenges in a sustainable, creative and environmentally-friendly manner. Some within the project have even compared the concept to the Eiffel Tower in the iconic structures stakes. According to Green, the Eiffel Tower had a huge impact in inspiring architects to build with steel when it debuted as the world's tallest structure in 1889. Now he hopes Baobab can do the same. Wood, unlike steel and concrete, sequesters carbon dioxide, storing it away for the life of the building it is in Micheal Green, architecht \"Eiffel's vision redefined the skylines of the world, eventually (starting) the race for height in places like New York and Chicago in the 1920's and 30's and even... (in) new global cities in Asia and the Middle East today,\" Green told CNN via email. \"We love the idea that a wood tower in Paris, however modest in some respects ... will help champion a new global wave of building with more sustainable, renewable and beautiful materials,\" he added. Rise of the plyscraper? The idea of a \"plyscraper\" may sound far fetched to those unfamiliar with the concept and there are currently no plans to construct the MGA building in Paris. But tall wooden buildings are an architectural development being given increasingly serious consideration in a number of locations around the world. Work is set to begin on the HoHo building , a 275-foot structure made almost entirely from wood in the Austrian capital of Vienna next year. Meanwhile, a 34-storey wooden apartment block could be built in Stockholm by 2023 if architecture firm C.F Moller has its way. MGA has already built the 97-foot tall Wood Innovation and Design Center in Prince George, Northern British Columbia. Other ambitious wood buildings have also sprung up in the likes of Australia and the United Kingdom too. Architects C.F. Møller have designed a 34-story, wood-framed residential tower for the center of Stockholm. It could be built by 2023. The advantages of wood include its dexterity as a building material as well as its strong environmental credentials. Cross laminated timber -- a multiple panel wood product that is used to form the likes of walls, roof and floor panels -- in particular is has quickly established itself as a strong, reliable and popular wooden building material. \"Wood, unlike steel and concrete, sequesters carbon dioxide, storing it away for the life of the building it is in,\" Green said. \"As a renewable material grown by the power of the sun, wood offers us a new way to think about our future.\" Promotional literature relating to Baobab states it would store an estimated 3,700 metric tons of carbon dioxide. That's equivalent to keeping 2,207 cars off the road for a year or operating a home for 982 years, MGA state. The tower would also be constructed using a prefabricated construction method, where components are measured and built in a factory, often with space for doors, windows and wiring already carved into panels, before being rapidly transported and put together on site. This could potentially reduce cost, disruption and build time. Could you, wood you? On the downside, however, critics say the drawbacks of large wooden structures include the potential for increased fire hazard and the fact that economies of scale are not quite there yet to make it massively cheaper than the likes of steel and concrete. Reports earlier this year suggested the Vienna fire department was liaising with the architectural firm behind the HoHo building to figure out how to minimize the blaze risk. Green confirms building such ambitious structures with timber would mean \"reinventing wood; making it stronger, more fire safe, more durable and selecting material from sustainably managed forests.\" This last point is particularly relevant if wood is to fulfill its promise as a sustainable material. An efficient supply chain that replenished wood at a similar rate to which it was used would be a basic requirement. The \"Baobab\" complex as designed by MGA in conjunction with its design partners in France. Then there are the difficulties of introducing new materials and designs into a model for building that's already relatively efficient and cost-effective. Leading timber specialist at the engineering group ARUP, Andrew Lawrence, told CNN earlier this year that shear walls -- the central core of tall buildings -- are likely to continue to be made from concrete and steel for the foreseeable future. Dollar-for-dollar as a pure construction material, he said, wood can still struggle to be cheaper than concrete. What you need to do if you want an economic wood solution is to think about all the aspects from outset Andrew Lawrence, timber specialist Green pointed out that all MGA wooden buildings so far have been built with \"central elevator cores in mass timber.\" Although he added that the foundations have been made in concrete and steel has been used to make connections between the wood. However, Lawrence also pointed out that building with wood can still have its benefits if carefully planned out. \"What you need to do if you want an economic wood solution is to think about all the aspects from outset,\" Lawrence says. \"You will save on the program because it's all dry and is quick to erect and potentially, if you're making an office building, you can leave a lot of the wood exposed, saving on the cost and time of installing finishes.\" \"If you leave the wood exposed, you can (also) have a really nice environment inside the building,\" he says. As Green and MGA suggest, there would better no location to put wood's aesthetic and structural fortitude to the test than the picturesque city of Paris.", "external_links": [], "published": "2015-08-20T14:46:00.000+03:00", "crawled": "2015-08-20T15:45:42.219+03:00", "highlightTitle": ""}