{"organizations": [], "uuid": "982670a262c78c090db8a124217092c7061664c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gochicago.about.com", "main_image": "http://f.tqn.com/y/gochicago/1/S/H/8/-/-/Akira-Men.jpg", "site_section": "http://z.about.com/6/o/m/gochicago_t2.xml", "section_title": "About.com Chicago Travel: What's Hot Now", "url": "http://gochicago.about.com/od/chicagoshopping/tp/Shop-Like-A-Man.htm", "country": "US", "title": "Men's Specialty Shops In Chicago", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Men's Specialty Shops In Chicago", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T14:12:00.000+03:00", "replies_count": 0, "uuid": "982670a262c78c090db8a124217092c7061664c5"}, "author": "", "url": "http://gochicago.about.com/od/chicagoshopping/tp/Shop-Like-A-Man.htm", "ord_in_thread": 0, "title": "Men's Specialty Shops In Chicago", "locations": ["Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Articles and Resources \nEvery woman wants a sharp dressed man (cue the ZZ Top song ). But the changing fashions resorting to more relaxed styles means fewer opportunities to find cool boutiques serving up suits and ties. \nTo be perfectly honest, you can get that look anywhere, so why not go out of your way to discover a few unique pieces to add to your existing wardrobe when you’re traveling to the Windy City? The following Chicago stores cater to men and offer gems worth checking out, whether you’re shopping for yourself or for someone else. Photo courtesy of Akira Men Akira Men \nTargeting a flashy, fashion forward sort of fella, Akira Men showcases edgy shirts, slacks, shoes and accessories. Many of the items may be best described as “conversation starters,” with bold colors, designs and trendy features such as grommets on hats and shoes. Both locations--in Bucktown and Andersonville --boast clubby atmospheres with loud hip-hop, pop and rock music blaring throughout the spaces. Hours: 11 a.m.-9 p.m. Monday through Saturday; 11 a.m.-7 p.m. Sunday. 1910 W. North Ave., 312-423-6693 or 5229 N. Clark St., 773-275-3664 More » Photo courtesy of Apartment 9 Apartment 9 \nThe Bucktown shop aims for a more classic than trendy approach with its clientele. Regulars include the likes of Blackbird restaurant owner Donnie Madia, who’s known as a dapper dude around town. Styles range from hipster preppy to sophisticated businessman on the weekend with plenty of familiar designer names to choose from. Hours: 11 a.m.-7 p.m. Tuesday through Friday; 11 a.m.-6 p.m. Saturday; noon-5 p.m. Sunday. 1804 N. Damen Ave., 773-395-2999 More » Photo courtesy of Brooklyn Industries Brooklyn Industries \nWith so many similarities between Wicker Park and Brooklyn , it comes as no surprise the only Brooklyn Industries’ Midwest store is located in this hip, near west side neighborhood. It appeals to younger guys for street styles ranging from graphic tees to slouchy, slimmer-cut shorts and slacks. Guys can also find a lot of retro looks in accessories: hats, shoes and bags, to name a few. Hours: 11 a.m.-8 p.m. Monday through Saturday; noon-7 p.m. Sunday. 1426 N. Milwaukee Ave., 773-360-8182 More » Photo courtesy of Century Fashions Century Fashions Big & Tall \nOpen 365 days a year, the store caters to larger-to-fit sizes with fashionable clothing to make them shine among their slimmer counterparts. The apparel errs mostly on the casual side and much of it can be purchased at deep discount. It’s a 20-minute drive to the South Side from downtown. Hours: 10 a.m.-6:30 p.m. Monday through Friday; 9:30 a.m.-6:30 p.m. Saturday; 9:30 a.m.-5:30 p.m. Sunday. 4756 S. Ashland Ave., 773-247-2100 More » Photo courtesy of Haberdash Haberdash Men’s Shop The State Street store specializes in getting its clientele hard-to-find brands in a town where the competition’s fierce. Shoppers will find a nice mix of local and internationally known designers. Haberdash’s understated elegance proves that Chicago men dress well without being too flashy. Hours: 10 a.m.-7 p.m. Monday through Saturday; noon-6 p.m. Saturday 607 N. State St., 312-624-8551 More » Photo courtesy of Mankind Mankind \nThere's some fresh blood in Wicker Park with the arrival of this men's only shop from the owner of The Silver Room . The space offers a no-frills vibe, yet the clothing has been carefully curated to reflect fresh European looks from Denmark, Germany, France, United Kingdom, Netherlands and Sweden. Hours: noon-8 p.m. Monday through Saturday; 11 a.m.-6 p.m. Sunday 1410 N. Milwaukee Ave., 773-270-2025 Photo courtesy of Sir & Madame Sir & Madame \nThe vintage -obsessed shop owned by a husband-and-wife team sells enough unique items, guaranteeing you’ll leave with something few people own. The carefully curated collections for men--which include an exceptional Levi’s selection--are detailed oriented, right down to the socks. Hours: 11 a.m.-7 p.m. Monday through Saturday; 11 a.m.-5 p.m. Sunday. 938 N. Damen Ave., 773-489-6660 More » Photo courtesy of Trunk Club Trunk Club \nIdeal for the busy businessman or super-social socialite with expendable dollars, Trunk Club takes the personal shopper to the next level. To join, clients can sign up online or visit the Chicago store to create a profile with stats, preferences, etc. After that, a “trunk” shows up to your door on a regular basis, and you pay for the clothes you want and send the rest back. It’s that simple. The perks of visiting the store include taking advantage of the fully stocked bar. We hear there’s an enviable whiskey selection. Hours: Vary by appointment. 325 W. Ohio St., 312-266-8700 More » Related Articles", "external_links": [], "published": "2015-08-07T14:12:00.000+03:00", "crawled": "2015-08-07T21:53:29.200+03:00", "highlightTitle": ""}