{"organizations": [], "uuid": "dede6b3489bd96388291bc4559c0298b64397563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/snowboarders-fight-in-federal-appeals-court-to-lift-ban-at-utahs-alta-ski-resort-320420052.html", "country": "US", "title": "Snowboarders fight in federal appeals court to lift ban at Utah's Alta ski resort", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Snowboarders fight in federal appeals court to lift ban at Utah's Alta ski resort - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T13:12:00.000+03:00", "replies_count": 0, "uuid": "dede6b3489bd96388291bc4559c0298b64397563"}, "author": "The Associated Press", "url": "http://www.winnipegfreepress.com/travel/snowboarders-fight-in-federal-appeals-court-to-lift-ban-at-utahs-alta-ski-resort-320420052.html", "ord_in_thread": 0, "title": "Snowboarders fight in federal appeals court to lift ban at Utah's Alta ski resort", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY - A group of snowboarders have reasserted their claim that a ban at Utah's Alta Ski Area amounts to discrimination, with a new appeals court filing that pushes back against the notion that their lawsuit would set off a string of discrimination suits.\nIn a lawsuit that has reignited a long-festering culture clash on the slopes between skiers and snowboarders, the snowboarders are asking a federal appeals court to reinstate a case that was dismissed last year by U.S. District Judge Dee Benson.\nHe ruled that snowboarders don't have a constitutional right to practice their sport, and said allowing the lawsuit would open a wide door for many other groups to claim discrimination against private companies. Not so, said snowboarders in the court documents filed late Thursday.\n\"This is a unique case involving a specific group of people denied access to public land that Congress has already designated \"for skiing and other snow sports,\" the snowboarders' attorneys wrote. \"And all of the 119 other ski resorts operating on public land have determined that this includes snowboarding.\"\nTwo other resorts ban snowboarding: Deer Valley in Utah and Mad River Glen in Vermont.\nBoth sides in the Alta Ski Area case have asked the 10th Circuit Court to hear oral arguments, though no date has been set.\nAttorneys for Alta Ski Area argued in court documents last month that it's made a business decision to lure skiers to the private resort east of Salt Lake City with the promise of a snowboarder-free experience, and its well within its rights to keep snowboards off the slopes.\nThe U.S. Forest Service, which approves a permit for Alta, has backed the ski area in the court battle.\nThe snowboarders say Alta is distorting their claims and obscuring the real issue as they \"construct and attack a series of self-serving straw men.\" The group argues that they never said they have a constitutional right to snowboard, but rather that they should be treated the same as similar people, in this case skiers.\nThe snowboarders take issue with Alta's assertion that skiers find the slopes safer because they don't have to worry about being hit by snowboarders whose sideways stance leaves them with a blind spot.\n\"Action taken to appease unsupported, irrational concerns by community members does not constitute a legitimate state interest and certainly cannot \"immunize\" the decision from constitutional scrutiny,\" the snowboarders wrote.\n ", "external_links": [], "published": "2015-08-02T13:12:00.000+03:00", "crawled": "2015-08-02T21:04:03.929+03:00", "highlightTitle": ""}