{"organizations": [], "uuid": "5557f678787b0c2c9bf97e297f597d29c5eecaaf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/horizon-cruise-new-guinea-offered", "country": "US", "title": "On the Horizon: Cruise to New Guinea Is Offered", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "On the Horizon: Cruise to New Guinea Is Offered", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T21:10:00.000+03:00", "replies_count": 0, "uuid": "5557f678787b0c2c9bf97e297f597d29c5eecaaf"}, "author": "senh", "url": "http://www.wopular.com/horizon-cruise-new-guinea-offered", "ord_in_thread": 0, "title": "On the Horizon: Cruise to New Guinea Is Offered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Shangri-La Sydney Unveils Renovated Premium Hotel Rooms and Horizon Club Lounge Shangri-La Hotel, Sydney has reopened 90 newly refurbished Horizon Club rooms and Australia’s biggest and most sophisticated club lounge in a five-star hotel, after a much-anticipated multi-million dollar renovation. The Horizon Club Lounge on Level 30 ... 01/22/2015 - 2:56 am | View Link Ebola out of headlines but on the horizon Despite this positive news, Ebola remains largely out of control in Sierra Leone. The World Health Organization announced this month that Guinea is \"relatively stable,\" but the recent spread of the virus into Mali only confirms the need for a greater ... 11/28/2014 - 7:05 am | View Link Forza Horizon 2 (for Xbox One) You can truly create your own car and experience. You can drive wherever you want, too. Forza Horizon 2's open-world design lets you cruise through the rainy streets of Nice or go off-road and plow through somebody's field. If you have Kinect you can ask ... 09/25/2014 - 8:57 am | View Link Pick of the day: Sex: A Horizon Guide We learn just how difficult it must have been for pioneers to be taken seriously, never mind the guinea pigs who got down to business while scientists in white coats and holding clipboards looked solemnly on. See today's front and back pages, download the ... 09/10/2013 - 4:13 pm | View Link Make Your Voice Heard on the Anniversaries of the Exxon Valdez and BP Deepwater Horizon Oil Disasters Twenty-two years ago on March 24, 1989, the Exxon Valdez ran aground at Bligh Reef in Alaska’s Prince William Sound. The tanker spilled 11 million gallons of oil into the water, fouled 1,500 miles of Alaska’s coast and killed hundreds of thousands of ...", "external_links": [], "published": "2015-08-18T21:10:00.000+03:00", "crawled": "2015-08-19T05:29:07.266+03:00", "highlightTitle": ""}