{"organizations": [], "uuid": "eee5bb9745cd7f5f003f5c6bf8db1114c107aa46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/travel/us/20150829-corvette_museum_sinkhole_45464491.ece/BINARY/original/CORVETTE_MUSEUM_SINKHOLE_45464491", "site_section": "http://www.dallasnews.com/lifestyles/travel/us/", "section_title": "Dallas-Fort Worth Travel News and Destinations - News for Dallas, Texas ", "url": "http://www.dallasnews.com/lifestyles/travel/us/20150829-wrecked-cars-revving-up-visits-to-national-corvette-museum.ece", "country": "US", "title": "Wrecked cars revving up visits to National Corvette Museum", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Wrecked cars revving up visits to National Corvette Museum | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T17:22:00.000+03:00", "replies_count": 0, "uuid": "eee5bb9745cd7f5f003f5c6bf8db1114c107aa46"}, "author": "dallasnews", "url": "http://www.dallasnews.com/lifestyles/travel/us/20150829-wrecked-cars-revving-up-visits-to-national-corvette-museum.ece", "ord_in_thread": 0, "title": "Wrecked cars revving up visits to National Corvette Museum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BOWLING GREEN, Ky. — The car-swallowing hole has been fixed but not forgotten at the National Corvette Museum in Kentucky. Yellow tape now marks the boundaries of the cavity that became a sensation and put the museum on the map. Instead of a gaping sinkhole driving tourism, now it’s the vintage sports cars crunched by rocks and dirt.\nThe pit that consumed eight prized sports cars in early 2014 has been filled in. The repaired exhibit area has become a magnet for visitors, and the dirt-caked remains of the mangled cars are the stars.\n“It’s just horrifying,” said Corvette owner Doug Kidd of Canton, Ohio. “Nature’s a pretty big thing to deal with. They look like they went through a tornado.”\nSeven of the eight cars are back on display. Five were too beaten up for repairs. One is fixed, another will return in September after being repaired in Michigan, and another will be restored by the museum. The eight cars carried a total value believed to exceed $1 million.\nThe museum’s Facebook followers now exceed 200,000, compared to about 50,000 before the sinkhole opened. On social media, photos showcasing the damaged cars outpace those of the shiny, sleek models on display, said museum spokeswoman Katie Frassinelli.\n“People just really enjoy hearing the story and like seeing the damage,” she said. “I guess it’s the rubberneck effect. These cars definitely appeal to a wider audience.”\nIn the gift shop, jars of sinkhole dirt and rocks fetch $10 apiece. Nearly 2,400 jars had sold through July.\nWanda Cohen of Roswell, Ga., had just posted a photo of a wrecked car on her Facebook page.\n“It’s like looking at the worst wrecks you’ve ever seen,” she said.\nFor museum officials, the trick is to keep the site’s popularity from going in reverse now that visitors can’t gawk at the sinkhole. The museum cashed in on the giant chasm with record attendance and revenue in 2014.\nA temporary exhibit shows the now-famous security camera footage of the floor’s collapse and cars toppling like toys into the pit. The hole opened up when the museum was closed, and no one was injured.\nThere’s also video of the damaged Corvettes being pulled from the hole.\nA new sinkhole-themed exhibit is scheduled to open this fall.\nKidd said he wished at least part of the sinkhole had gone unplugged. It was an option discussed by museum leaders before they opted to fill it in.\n“It’s human nature to come and see,” Kidd said.\nThe repairs began last fall and cost about $5 million, Frassinelli said. Insurance covered everything but the museum’s deductible. Donations covered the deductible, she said.\nMuseum officials at first devastated by the chasm now have a much different attitude.\n“We decided to embrace it,” Frassinelli said. “And what could have been a really big negative for the museum turned out to be a positive.”\nThe Associated Press\nWhen you go The National Corvette Museum is at 350 Corvette Drive, across from the Bowling Green Assembly Plant, where all Corvettes are made. corvettemuseum.org", "external_links": [], "published": "2015-08-29T17:22:00.000+03:00", "crawled": "2015-08-31T08:47:45.458+03:00", "highlightTitle": ""}