{"organizations": [], "uuid": "857f21520a2c7d92c9af2a8883b6d55b86892cd9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/08/latam.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/latam-is-born-the-new-brand-for-lan-airlines-tam-airlines-and-affiliates-announced-today/", "country": "US", "title": "LATAM is Born: The New Brand for LAN Airlines, TAM Airlines and Affiliates Announced Today - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "LATAM is Born: The New Brand for LAN Airlines, TAM Airlines and Affiliates Announced Today - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "857f21520a2c7d92c9af2a8883b6d55b86892cd9"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/latam-is-born-the-new-brand-for-lan-airlines-tam-airlines-and-affiliates-announced-today/", "ord_in_thread": 0, "title": "LATAM is Born: The New Brand for LAN Airlines, TAM Airlines and Affiliates Announced Today - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LATAM is Born: The New Brand for LAN Airlines, TAM Airlines and Affiliates Announced Today Published on : Thursday, August 6, 2015\nAfter an extensive integration process following the association of LAN Airlines and TAM Airlines – during which the Group made great advances in achieving synergies for internal processes, network optimization, and fleet restructuring and modernization – LATAM Airlines Group has decided to adopt a single name and identity and announces that the new brand for the largest airline group in Latin America and its affiliates will be LATAM. The new LATAM branded airline group will unite all the passenger and cargo airlines for LATAM Airlines Group: LAN Airlines and its affiliates in Peru, Argentina, Colombia and Ecuador; in addition to TAM Linhas Aéreas S.A., and its subsidiary TAM Air Transport Mercosur S.A. (TAM Airlines (Paraguay), and the cargo carriers comprised of LAN CARGO, LAN CARGO Colombia, ABSA (TAM Cargo) and Mas Air.\nThe decision to create a new brand is a historic milestone in the airline industry not only because this is the first time an airline group has chosen to consolidate under a single brand, but because this is the first time a Latin America based airline group aspires to become one of the best in the world.\nFor that reason, the new brand will incorporate the most valued strengths and characteristics of both LAN and TAM, in addition to the important histories of both carriers, 86 and 39 years respectively, during which they became part of the history of the region by contributing to its growth, development and increased connectivity.\n“ Out of all of the options that we were considering, the name LATAM always seemed to us to be the most natural evolution of both the LAN and TAM brands, but a period of mutual understanding and maturation was necessary to make the decision. We knew that having a single brand was essential to consolidate the connection between LAN and TAM, and the name LATAM creates a strong identity for the airlines that form the largest airline group in Latin America. The new brand is born from the desire to capture the best of both identities and legacies and consolidate them to create an even stronger one that preserves the essence of each brand – an essence that is truly Latin American,” said Mauricio Amaro, President of the Board of Directors, LATAM Airlines Group.\n“With LATAM we will continue on the path of leadership that LAN and TAM started in parallel, working closely together over the past three years to implement an ambitious agenda of innovative projects for our passengers to have a better experience with us before, during and after their flight. The passenger experience will improve with access to a single product and service within one network, more powerful online presence and integrated channels of communication, in addition to faster development of innovation and technology in the countries where the Group operates. LATAM will increase optimization of our fleet, provide easier access for passengers and clients to the best network of destinations in the region while offering a new in-flight experience, updates in service and in-flight entertainment, and innovative technology that gives passengers more control over their travel experience. Our passengers have high expectations and we want to offer them service that meets those expectations.” LATAM will be a brand that builds a culture that is dedicated to taking care of its clients,” said Enrique Cueto, CEO of LATAM Airlines Group.\nCueto went on to explain in his own words the choice of the name LATAM: “LATAM Airlines Group was created by two large Latin American companies that started from zero and prospered thanks to their shared passion for flying, vision, dedication and innovation. Both companies and their respective affiliates conquered their markets and connected them with the world, promoting prosperity in the region and becoming known for their on-time performance, service and networks that won them the preference of their clients and become a part of their history. LATAM Airlines Group created a unique partnership in the industry that resulted in the largest airline group in the region. That is why we chose the name LATAM, because it honors who we were and who we want to continue to be, working together with our affiliates to be the ambassadors of a Latin America that grows and prospers, loyal to its natural and human roots – a region that never stops moving”.\nSource:- LATAM Airlines", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-07T07:14:53.375+03:00", "highlightTitle": ""}