{"organizations": [], "uuid": "a8498fe80065e31d09ec700cb05bfd567b3414f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/wtm-announces-responsible-tourism-awards-short-list/4698060.article", "country": "GB", "title": "WTM announces responsible tourism awards short list", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "WTM announces responsible tourism awards short list", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T13:23:00.000+03:00", "replies_count": 0, "uuid": "a8498fe80065e31d09ec700cb05bfd567b3414f7"}, "author": "", "url": "http://www.ttgdigital.com/news/wtm-announces-responsible-tourism-awards-short-list/4698060.article", "ord_in_thread": 0, "title": "WTM announces responsible tourism awards short list", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WTM announces responsible tourism awards short list 4 August 2015 Save \nA worldwide campaign to end canned hunting, a tour operator offering locally-led alternative city tours and a local mangrove conservation project in Madagascar are just some of the finalists at this year’s 2015 World Responsible Tourism Awards. \nHeld at WTM London, a total of 37 organisations will battle it out across 12 categories in the awards ceremony held on November 4 at the event. \nWith multi nationals fighting it out with boutique properties and finalists from 20 different countries, organisers are confident the winners will have met the highest standards. \nResponsible Travel managing director and founder of the awards Justin Francis said: “In our entries this year we’ve seen organisations clearly influenced by the work of our previous winners, for example city tours run by homeless guides. It is our responsibility to find those inspirational people again. \n“Looking at our hugely diverse list of finalists this year, I think we have found these people. The organisations in the list really prove that responsible tourism is viable and can be successful in all types of tourism, from niche to mainstream. \n“These organisations are the shining stars of responsible tourism.” \nProfessor Harold Goodwin, chair of the awards’ judging panel, added: “Our aim is to surprise and inspire, but the standard is rising, and we have to keep pushing up our expectations of our winners. \n“Being a finalist for one of these awards is not easy; the organisations are required to go through a rigorous process, evidencing the impact rather than intent of their work. \n“We can only award those who enter, and I’d like to thank everyone who took the time to share their stories with the judges. \n“The finalists we’ve chosen are just the tip of the iceberg of groundbreaking, inspirational work being done in responsible tourism across the globe”. \nVoting is currently underway for the Awards’ only publically-decided category, the People’s Choice in Responsible Tourism in association with National Geographic Traveller (UK) magazine.", "external_links": [], "published": "2015-08-04T13:23:00.000+03:00", "crawled": "2015-08-04T15:15:33.076+03:00", "highlightTitle": ""}