{"organizations": [], "uuid": "2be9f68adb7f58afdf07b7097e62bfc795700950", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/a620c34a9629de28a4a6a03d01205ebb50a1b0cb/c=0-104-2048-1261&amp;r=x633&amp;c=1200x630/local/-/media/2015/07/30/Phoenix/Phoenix/635738909931086062-CecilTheLion.jpg", "site_section": "http://www.azcentral.com/travel-explore/", "section_title": "Phoenix Arizona Travel Guide, Hotels, Sightseeing - azcentral.com ", "url": "http://www.azcentral.com/story/news/politics/azdc/2015/08/01/africa-jeff-flake-condemns-killing--cecil--lion/30917747/", "country": "US", "title": "Back from Africa, Sen. Jeff Flake condemns Cecil the Lion killing", "performance_score": 0, "site": "azcentral.com", "participants_count": 1, "title_full": "Back from Africa, Sen. Jeff Flake condemns Cecil the Lion killing", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T03:02:00.000+03:00", "replies_count": 0, "uuid": "2be9f68adb7f58afdf07b7097e62bfc795700950"}, "author": "AZ/DC", "url": "http://www.azcentral.com/story/news/politics/azdc/2015/08/01/africa-jeff-flake-condemns-killing--cecil--lion/30917747/", "ord_in_thread": 0, "title": "Back from Africa, Sen. Jeff Flake condemns Cecil the Lion killing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Sen. Jeff Flake is joining the chorus condemning a Minnesota dentist's trophy killing of Zimbabwe's much-loved Cecil the lion.\nFlake, R-Ariz., is the chairman of the U.S. Senate Foreign Relations subcommittee on Africa and Global Health Policy and returned early Wednesday from accompanying President Barack Obama to Kenya and Ethiopia on an official trip on which wildlife poaching was on the agenda.\n\"Boy, what kind of hunter gets his jollies shooting a lion with a (GPS) collar? That's what I want to know,\" Flake told The Arizona Republic as public outrage over the animal's death grew.\nOn Thursday, the U.S. Fish and Wildlife Service announced that it was investigating Cecil's killing and wanted to talk to Walter Palmer, the 55-year-old Eden Prairie, Minn., dentist who paid more than $50,000 to shoot the lion, which was lured off a preserve, with a crossbow.\nPalmer has issued a statement saying he didn't know the lion was well-known and that he regretted killing the beast, but that he believed he was acting legally.\nPalmer was widely vilified on social media and online, with critics leaving scorching messages on the Yelp page for his business, River Bluff Dental.\nWe share your concern about the issue surrounding #CeciltheLion and we&#39;re working to gather the facts. pic.twitter.com/91odwh7oPv\n— US Fish and Wildlife (@USFWS) July 29, 2015 Flake said he supports U.S. efforts to get to the bottom of the Cecil case and cooperation with Zimbabwe.\n\"They're finding out now if he was duped,\" Flake said of Palmer. \"That's going to be a tough sell. I don't think many of the people who are leaving him Yelp reports are buying it. We'll let them investigate for a while, but it's not looking good for the man.\"\nPoaching was more of a focus of the East Africa visit than Flake had expected, he said. The concern in Kenya is illegal elephant hunting to feed to ivory trade. Delegation members met with conservationist Richard Leakey and checked out a Nairobi national park that had animals such as zebras, giraffes and warthogs. At an orphanage for abandoned elephants, Flake tweeted a selfie of himself with a baby elephant that he dubbed an \"elphie.\"\nWhat do you do in Africa? Take an elphie, of course #elephantorphanage #Kenya #DSWT pic.twitter.com/fDc4Gg1blw\n— Jeff Flake (@JeffFlake) July 25, 2015 \"Lions aren't on the endangered list or anything. It's elephants and rhinos that are the real problem,\" Flake said. \"Kenya holds the last male northern white rhino. He's under continuous guard with his horn shaved off so nobody has incentive to take him. It's a sad state. There are only four left in the world , and the females are past (child-birth) time.\"\nThe United States can help fight the trafficking and try to dampen demand, particularly in Asia, for ivory and rhino horn, Flake said.\nFlake skeptical on Iran deal\nFlake has been supportive of the Obama administration's nuclear negotiations with Iran, but he told The Republic that doesn't necessarily mean he will support the final deal, which has come under scrutiny from the Foreign Relations Committee.\n\"I'm approaching it skeptically,\" Flake said. \"This is Iran. They haven't exactly honored other agreements that they've entered into.\"\nFlake said he is trying to avail himself to all information about the pact.\n\"You can say all you want about this agreement: It could have been better, or we didn't use our leverage,\" Flake said. \"That may all be true, but given where we are and given what the alternatives are, it's not an easy call.\"\nChief of staff Voeller quits\nLongtime Flake loyalist Steve Voeller is leaving his position as Flake's chief of staff to join Phoenix-based Summit Consulting Group as a partner.\nThe first order of business is to expand the group's client list, said Voeller, who was Flake's first chief of staff when he joined the U.S. House of Representatives in 2001, then left, and returned when Flake moved to the Senate in 2013.\n\"In a sense, nobody ever really leaves Jeff,\" Voeller said. \"I'll still be just a phone call away, and I'll help on the political side.\"\nFlake told The Republic \"nobody's better\" than Voeller, \"but we'll soldier on.\"\n\"It's a big loss. I started out with him in the House,\" Flake said. \"Then he left, had a sabbatical, then repented and came back. There's a good story about the returning prodigal, but I don't know if it can happen twice.\"\nNowicki is The Republic's national political reporter. Follow him on Twitter at @dannowicki and on his official Facebook page .", "external_links": ["http://www.cnn.com/2015/07/29/world/northern-rhino-dies/", "http://t.co/91odwh7oPv", "https://twitter.com/hashtag/Kenya?src=hash", "https://twitter.com/JeffFlake/status/624959773541318656", "http://t.co/fDc4Gg1blw", "https://twitter.com/USFWS/status/626411341507641344", "https://twitter.com/hashtag/DSWT?src=hash", "https://www.facebook.com/OfficialDanNowicki", "https://twitter.com/hashtag/CeciltheLion?src=hash", "https://twitter.com/hashtag/elephantorphanage?src=hash"], "published": "2015-08-02T03:02:00.000+03:00", "crawled": "2015-08-02T05:11:17.097+03:00", "highlightTitle": ""}