{"organizations": [], "uuid": "53ed8208b73d8e10d5a91e6d23344e8fd2add9bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29812668/skyline-international-announces-cad-10-million-investment-in-iconic-deerhurst-resort", "country": "US", "title": "Skyline International announces (CAD) $10 million investment in iconic Deerhurst Resort", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Skyline International announces (CAD) $10 million investment in iconic Deerhurst Resort - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "53ed8208b73d8e10d5a91e6d23344e8fd2add9bc"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29812668/skyline-international-announces-cad-10-million-investment-in-iconic-deerhurst-resort", "ord_in_thread": 0, "title": "Skyline International announces (CAD) $10 million investment in iconic Deerhurst Resort", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE Skyline International Development Inc.\nTORONTO , Aug. 18, 2015 /CNW/ - Skyline International is committing a (CAD) $10 million investment to the iconic Deerhurst Resort. The earmarked funds will be invested over two years, targeting a complete renovation of all Skyline-owned guest rooms, bathrooms and corridors, as well as significant upgrades to the Legacy Hall, Compass Lobby Bar, Maple Pub, Fitness Centre, and improvements to the lakeside waterfront.\n\"Deerhurst is an iconic brand that has been around for over 100 years and will be around for the next 100 years,\" says Skyline International CEO Michael Sneyd . \"We understand what this brand means to Muskoka and we want to raise people's expectations of what a visit to Deerhurst can entail.\"\n\"Everything we have targeted with this (CAD) $10 million investment is a result of feedback we have been getting from our top client group,\" adds Sneyd. \"We have been working on this for a while.\"\nThis direct investment in Deerhurst Resort, which traces its roots back to 1896 when Charles Waterhouse opened a small summer resort along Peninsula Lake, is part of a (CAD) $500 million overall master plan for Deerhurst, which includes a brand new village centre with a main street that overlooks Peninsula Lake and the Deerhurst Lakeside Golf Course.\nAs the overall master plan continues to progress through the planning process, the first and last waterfront condominium opportunity at Deerhurst, Lakeside Lodge, has already launched, offering purchasers units that start from the (CAD) $200s.\n\"Deerhurst may be located in cottage-country, but it isn't simply a cottage retreat. It's a community that promotes activity. There is so much potential for outdoor adventure that goes beyond the dock or golf course. With Lakeside Lodge, we wanted to create an ownership experience capturing all sides of life in Muskoka,\" says Raymond Zar , COO of Skyline International.\nAbout Skyline International Development Inc.\nA leading Toronto -based developer of hospitality properties and resort communities, Skyline owns over two million sq. ft. of real estate, has over 2,600 acres with development rights for almost 7,000 residential units and nearly 1,300 rooms in its holdings, employing more than 1,500 staff. Its unique asset mix includes part ownership of Toronto's iconic Omni King Edward Hotel, as well as ownership of, under the Skyline Hotels & Resorts brand, the city's contemporary boutique Pantages Hotel and Spa . Skyline's resort assets include landmark Deerhurst Resort with 45,000 sq. ft. of meeting space lakeside in Muskoka and Horseshoe Resort , home to Toronto's closest ski area and an adventure park. The company is also creating residential communities at Deerhurst, Horseshoe and, at the historic lakefront of Port McNicoll , Ontario , a restored gateway to the 30,000 Islands, a UNESCO World Biosphere Reserve. In early 2014, Skyline became a public company trading on the Tel Aviv Stock Exchange as (TASE: SKLN ). For more information, please visit: www.skylineinvestments.com .\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.skylinecommunities.com/Port-McNicoll", "http://www.xmlnews.org/ns/", "http://www.skylinehotelsandresorts.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=C4705&Transmission_Id=201508181042CANADANWWEB______C4705&DateId=20150818", "http://www.pantageshotel.com/", "http://www.horseshoeresort.com/", "http://www.deerhurstresort.com/", "http://www.marketwired.com/news_room/Stock?ticker=SKLN", "http://www.skylineinvestments.com/"], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-20T04:18:55.895+03:00", "highlightTitle": ""}