{"organizations": [], "uuid": "eebf0fcaa304f2bc8f456ac8e93346611e96e398", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/airportairline/28047-eagerly-anticipated-independent-airport-lounge-opens-at-london-heathrow-terminal-5", "country": "US", "title": "Eagerly anticipated independent Airport Lounge opens at London Heathrow Terminal 5", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Eagerly anticipated independent Airport Lounge opens at London Heathrow Terminal 5", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T14:15:00.000+03:00", "replies_count": 0, "uuid": "eebf0fcaa304f2bc8f456ac8e93346611e96e398"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/airportairline/28047-eagerly-anticipated-independent-airport-lounge-opens-at-london-heathrow-terminal-5", "ord_in_thread": 0, "title": "Eagerly anticipated independent Airport Lounge opens at London Heathrow Terminal 5", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eagerly anticipated independent Airport Lounge opens at London Heathrow Terminal 5 Eagerly anticipated independent Airport Lounge opens at London Heathrow Terminal 5 Details Category: Airport & Airline   12:15 Collinson Group, owners of Priority Pass, and Swissport, the world’s largest aviation services provider, today announced the opening of the first independent, shared use lounge at London Heathrow Terminal 5. ‘Aspire, the Lounge and Spa at LHR T5’ will be jointly owned and operated by Swissport and Airport Lounge Development (ALD), Collinson Group’s lounge operating arm. Located at Gate A18 in Terminal 5, it will be the first lounge open to all travellers in one of the world’s busiest airport terminals. \nPriority Pass members will have access to the lounge as part of their membership. Travellers without membership can enjoy three hours in ‘Aspire, the Lounge and Spa at LHR T5’ for £35 when booked in advance at www.executivelounges.com or for £40 at reception on the day subject to availability. The lounge is open from 5am until 11pm daily. Errol McGlothan, General Manager EMEA, Collinson Group said: “Aspire, the Lounge and Spa at LHR T5 has been designed to meet the exacting needs of the millions of travellers who travel through the terminal every year. Using insights gained from frequent travellers, we are confident that we’ve delivered the most compelling destination lounge where travellers can relax and refresh ahead of their next journey. Developed in partnership with Swissport, we are delighted to offer travellers access to an independent lounge at Heathrow Terminal 5 for the first time.” Stephen Wilkinson, Property Director, Heathrow said: “We are delighted to announce that as of today, we now have independent lounges in each of our terminals. Our team works tirelessly to ensure our customers receive the very best service when they fly and we’re delighted that Aspire, The Lounge and Spa at LHR T5, at Terminal 5 will enhance this service from today.” Shaun Weston, Travel Services Director, Swissport commented: “Since launching in 2012, the Aspire brand of airport lounges has grown in popularity and now covers many global destinations. The opening of ‘Aspire, the Lounge and Spa at LHR T5’ is a significant step for Swissport, giving us a presence in one of the world’s leading airport terminals. We look forward to combining our operational expertise with Collinson Group’s reach amongst travellers, to deliver a world class facility.” The 4,000 sq ft lounge space is dominated by soaring windows on two sides giving guests dramatic runway views. An extensive British-inspired seasonal food and drink menu has been created which includes a wide range of complimentary as well as premium (chargeable) options, changing throughout the day. Guests can also enjoy a unique opportunity to sample Spey Whisky, draught beer and a selection of wines on a complimentary basis or choose to pay for carefully selected ‘Wine Flights’, an innovative way to taste a variety of wines from different regions. A highlight of the lounge is the ‘Bliss Spa at Aspire’ which is the award-winning beauty company’s first location in an airport. The specially designed travel spa menu includes a range of facials, manicures and pedicures available as refreshing 20 minute express, or luxurious 40 minute appointments guaranteed to deliver amazing results in a fun, positive environment. This includes an express version of the famous Bliss Spa Oxygen Blast facial, a 40 minute complexion reviver for bright, glowing skin and the Hot Cream Manicure for perfect nails. To help guests relax before or during a long trip, state-of-the-art ‘rest pods’ let guests recline back on specially engineered, reclining loungers, watch television and recharge in private so that they are rejuvenated for the journey ahead. Travellers on business will have access to connected work spaces with complimentary high speed WiFi, charging posts and designated quiet zones to make the most productive use of their time. Related articles", "external_links": [], "published": "2015-08-04T14:15:00.000+03:00", "crawled": "2015-08-04T14:46:10.606+03:00", "highlightTitle": ""}