{"organizations": [], "uuid": "3b57309446540a7085665f38cfc3bd3864d2011b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094304599/UAEs-development-and-prosperity-create-a-welcoming-and-attractive-place-to-live?src=RSS", "country": "US", "title": "UAE's development and prosperity create a welcoming and attractive place to live", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "UAE's development and prosperity create a welcoming and attractive place to live | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "3b57309446540a7085665f38cfc3bd3864d2011b"}, "author": "Emirates News Agency (WAM)", "url": "http://www.menafn.com/1094304599/UAEs-development-and-prosperity-create-a-welcoming-and-attractive-place-to-live?src=RSS", "ord_in_thread": 0, "title": "UAE's development and prosperity create a welcoming and attractive place to live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Emirates News Agency (WAM)) Akhbar Al Sa'a, the News of the Hour Bulletin, has said that the multiplicity of aspects of stability enjoyed by the UAE at all levels, especially aspects of security, community, political and economic stability and community and cultural development under the turbulent regional and international environment, further consolidate the state's position as an oasis of peace and security in which young people, and all segments of the population, are looking forward to living, whether from Arab countries or from all countries of the world.\n\nThe bulletin noted that these aspects have been achieved as a logical consequence of the renaissance project adopted by the country through its policies, programmes and practical plans, which not only respond to today's aspirations, but also look forward to the future, demonstrating its keenness to provide all that will achieve sustainability of the state's overall development.\n\nThe bulletin, issued by the Emirates Centre for Strategic Studies and Research, ECSSR, under the title, \"UAE: Development, Prosperity, Attractive Place to Live\", said that according to many recent international economic reports explicitly confirm the importance of the development model of the UAE, which has become a distinctive business centre at both regional and international levels and a favourite destination for a large segment of the population of the region and the world in which to live and work. These reports not only covered aspects related to quantitative economic growth within the country but also dealt with aspects of its comprehensive and sustainable development.", "external_links": [], "published": "2015-08-09T03:00:00.000+03:00", "crawled": "2015-08-10T00:22:50.415+03:00", "highlightTitle": ""}