{"organizations": [], "uuid": "08fc92b8c71cf2007646cad59e55c76b5a2c22d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/news-release/2015/08/20/762254/10146719/en/photos/354023/35357/354023.jpg?lastModified=08%2F20%2F2015%2010%3A34%3A13&amp;size=2", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/08/20/762254/10146719/en/New-Margarita-Pedicure-Offered-at-Grand-Velas-Riviera-Nayarit-s-Award-Winning-Spa.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "New Margarita Pedicure Offered at Grand Velas Riviera Nayarit's Award-Winning Spa", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "New Margarita Pedicure Offered at Grand Velas Riviera Nayarit's Award-Winning Spa", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T17:33:00.000+03:00", "replies_count": 0, "uuid": "08fc92b8c71cf2007646cad59e55c76b5a2c22d5"}, "author": "", "url": "http://globenewswire.com/news-release/2015/08/20/762254/10146719/en/New-Margarita-Pedicure-Offered-at-Grand-Velas-Riviera-Nayarit-s-Award-Winning-Spa.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "New Margarita Pedicure Offered at Grand Velas Riviera Nayarit's Award-Winning Spa", "locations": ["Grand Velas Riviera Nayarit"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Margarita Pedicure Offered at Grand Velas Riviera Nayarit's Award-Winning Spa ET | Source: Velas Resorts photo-release \nMIAMI, Fla., Aug. 20,   Mexico's AAA Five Diamond Grand Velas Riviera Nayarit is now offering guests a new refreshing and authentic Mexican spa treatment for the toes, the Margarita Pedicure. The pedicure begins with a ground coffee bean detox exfoliation increasing circulation to feet, preparing the senses for the following 20-minute massage focusing on the feet's main reflexology points, and continues with a mud mask of local herbal extracts. The mud mask contains a concentrated extract of Mexican herbs with anti-inflammatory properties to relax and refresh feet, including chia seeds, amaranth grains, prickly pear cactus and blue agave, the main ingredient of tequila. During the Margarita Pedicure guests relax in a hydro-massage lounge chair and enjoy a fresh, complimentary Strawberry Spa Margarita, with or without alcohol based on request. The 80-minute treatment costs $110 USD. For more information on spa specials, visit www.luxuryspamexico.com . For reservations or more information, please call 877-418-2963 or visit http://vallarta.grandvelas.com/ . The Spa at Grand Velas offers more than 30 spa treatments, many inspired by the native traditions of Mexico. Additional Spa offerings include separate Kids and Teens Treatment Menus, offered year-round en-suite or beachside with spectacular views of the Banderas Bay, as well as the resort's signature Water Journey. Guided by a Spa Valet, the Water Journey includes a revitalizing shower, herbal steam and sauna, a dip in the two-temperature lagoon, time in the Jacuzzi, and a final multi jet Swiss shower. Guests end the ritual in the relaxation area with natural fruit-flavored waters, whole grain cookies and fresh fruit. About Grand Velas Riviera Nayarit: \nGrand Velas Riviera Nayarit, a Leading Hotel of the World, enjoys a privileged natural setting with flowering, landscaped gardens beside a long stretch of pristine beach and a dramatic backdrop of the Sierra Madre mountains. The centerpiece of the gardens is a three-tiered infinity pool, a preferred spot for catching the legendary sunsets. The AAA Five Diamond all-inclusive resort features 267 ocean-view suites, some with private plunge pools, and all with plasma TVs, wireless internet access, fully stocked mini bar, L'Occitane amenities and Nespresso machines. Of the resort's five restaurants, three, serving French, Italian and Mexican gourmet cuisine, have received AAA Four Diamond awards for distinguished cuisine and presentation. An oasis of wellbeing, the resort's Leading Spa of the World offers 20 treatment suites, more than 30 spa treatments, many inspired by the native traditions of Mexico and a signature water journey. Other features include a fitness center, 24/7 in suite service, water sports, business center, tennis, baby concierge, Kids Club, and teen lounge during holidays. Puerto Vallarta is just a 15 minute drive away. Grand Velas Riviera Nayarit features more than 25,000 square feet of indoor meeting facilities, including the Grand Marissa Ballroom, which consists of more than 6,000 square feet and is easily subdivided into five separate rooms. The resort's facilities also include four other rooms ranging from 681 to more than 1,954 square feet that offer several arrangement variations to maximize meeting productivity and efficiency. The resort has won numerous awards from Conde Nast Traveler, Travel + Leisure, TripAdvisor, U.S. News and World Report and Forbes, which named it one of the Top Ten Coolest All-Inclusive in 2012. Grand Velas Riviera Nayarit was built and is operated by Eduardo Vela Ruiz, majority owner, founder and president of Velas Resorts, with brother Juan Vela by his side, vice president of Velas Resorts. \nA photo accompanying this release is available at: http://www.globenewswire.com/newsroom/prs/?pkgid=35357 Megan Sterritt KWE Partners 786-247-4812 Related Articles", "external_links": [], "published": "2015-08-20T17:33:00.000+03:00", "crawled": "2015-08-20T17:46:18.205+03:00", "highlightTitle": ""}