{"organizations": ["Raghava KK", "Hindustan Times"], "uuid": "6d71f510fa88b89fc92d26642f28a043ecc080c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/244c5133-bf46-45fd-9b07-82ce435206a7MediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-ArtNews\r", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/art/exploring-evolution-through-a-surreal-blend-of-pop-culture/article1-1384415.aspx", "country": "IN", "title": "Exploring evolution through a surreal blend of pop culture", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Exploring evolution through a surreal blend of pop culture", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T12:57:00.000+03:00", "replies_count": 0, "uuid": "6d71f510fa88b89fc92d26642f28a043ecc080c3"}, "author": "", "url": "http://www.hindustantimes.com/art/exploring-evolution-through-a-surreal-blend-of-pop-culture/article1-1384415.aspx", "ord_in_thread": 0, "title": "Exploring evolution through a surreal blend of pop culture", "locations": ["Mumbai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Manali Shah"], "text": "Manali Shah, Hindustan Times , Mumbai | Updated: Aug 26, 2015 15:46 IST New York-based artist Raghava KK explores the concept of evolution through a surreal blend of pop culture, historical figures and cartoon characters. \nSelf-taught, multi-disciplinary artist Raghava KK's works have always embodied the unusual. He started out as a cartoonist in 1997, and continues to delve into sensitive issues with an element of humour. \nAt his ongoing show, Ridiculous Copycats, in the city, the artist explores the idea of evolution - of society, religion, ideology and knowledge. \"When we think of advancement, we generally think of improvement towards perfection. However, evolution is most often caused by the diversity that arises due to errors or mistakes, in [genetic] code. The show delves into how progress is directly related to error in replication,\" says Raghava. \nFrom L: Raghava KK and his work. \nFor his show, he has created a comic-book style narrative that begins in a simple manner, but turns rather complex as the universe it portrays becomes more and more diverse. \nHistorical figures, too, make prominent appearances in Raghava's shows, as he believes people, in general, are storytellers. \"We are constantly telling stories. When we share stories with each other, they become knowledge. History is the story of our past told by experts,\" he says. \nRaghava has often led the way when it comes to incorporating technology in art. In 2011, he launched Pop-it, an award-winning digital art-book for children that shook up the concept of the ideal family, and presented multiple perspectives. \nRaghava considers himself both a traditional as well as a new-age artist. \n\"The first stage of my work is to hand-draw all the characters. The second involves using the computer to assemble them using the politics of composition. It is impossible to explore all the possible permutations and combinations of these elements by hand, so I use technology to explore them. Then I come back to the art world, and manifest them as a traditional acrylic painting.\" \nRaghava considers himself both a traditional as well as a new-age artist. \"My thought and creation process is very rebellious and new, whereas my technique remains traditional. I embody the conflict between the traditional and the new. I'm presenting that in my works. My paintings are not new media - they are very much the traditional paint on canvas. But the way I see the world is extremely avant-garde.\" \nRidiculous Copycats is on at Art Musings till September 20. Tags", "external_links": [], "published": "2015-08-26T12:57:00.000+03:00", "crawled": "2015-08-27T16:05:28.381+03:00", "highlightTitle": ""}