{"organizations": [], "uuid": "12dec365cf4e98005002981304cc780ac3bdfe55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/fly-mango.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-event-news/", "section_title": "Travel Event News | Travel Technology News | Travel Industry News | Trade Shows | Travel Industry | Tourism Industry | Travel Association NewsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mango-launches-new-route/", "country": "US", "title": "Mango Launches New RouteTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Mango Launches New RouteTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "12dec365cf4e98005002981304cc780ac3bdfe55"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mango-launches-new-route/", "ord_in_thread": 0, "title": "Mango Launches New RouteTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mango Launches New Route Published on : Saturday, August 22, 2015\nMulti-award winning low-cost airline Mango this morning announced that it will launch a new route between Lanseria and Durban in October with 2 initial daily return flights. In addition the airline will be adding an additional early morning flight from Cape Town to Lanseria. The new route and schedule is effective 15 October with flights on sale from across all distribution channels. A launch fare of R 379 between Lanseria and Durban is available (limited seats) until 14 September for travel between 15 October 2015 and 30 November 2015. Mango remains the most on-time airline operating at Lanseria.\n“Mango is geared for further growth,” says Mango spokesperson Hein Kaiser. This, despite tougher competition and a challenging domestic market. “While trading conditions remain tough and some competitors have had to adopt a flexible schedule as a consequence, our average load factors have shown that there remains opportunity for business development, in particular our expansion out of Lanseria.” Over the past 6 months the airline has maintained an average 82% load factor across its network with an average of 1500 flights and more than 220 000 Guests carried every month.\nKaiser says that the addition of the Lanseria-Durban route and the additional Cape Town-Lanseria frequency will see the airline up its asset utilisation further. “A fundamental cornerstone of low-cost aviation is asset utilisation; if you are not flying, you are not earning. Mango holds the lowest cost base in the domestic market and additional frequencies and network expansion further reduces aggregate input costs.” Mango has ranked amongst the world’s top 5 airlines for asset efficiency and utilisation several times. The carrier plans to add additional aircraft to its schedule later this year with more growth and fleet additions expected during the next 2 years.\nThe new Lanseria Durban route will see Mango operate an initial twice-daily service in the mornings and late afternoons while a fourth early morning frequency between Cape Town and Lanseria has been added. “Demand at Lanseria has shown welcome growth over the past 24 months with well performing load factors across the schedule and we expect the additional Cape Town flight as well as the new Durban route to mirror performance at Lanseria and further stimulate growth,” says Kaiser. This year Mango celebrates its fifth year of operations in Lanseria and continues to achieve the most favourable on-time performance record at the airport.\nThe new Lanseria Durban schedule is as follows:\nLanseria to Durban departing 08:55 and 18:20\nDurban to Lanseria departing 07:50 and 16:30\nThe new Cape Town to Lanseria schedule sees the additional flight depart from Cape Town at 06:10.\nIn addition we are in talks to expand our existing network as per below; but a formal announcement will be made once official:\nA possible new Johannesburg Port Elizabeth schedule is as follows:\nJohannesburg to Port Elizabeth departing 06:15, 08:55, 13:50 and 17:00\nPort Elizabeth to Johannesburg departing 08:40, 11:20, 16:15 and 19:25\nA possible new Johannesburg Durban schedule is as follows:\nJohannesburg to Durban departing 06:00, 07:10, 08:30, 11:00, 12:20, 13:30, 15:20, 17:10 and 18:55\nDurban to Johannesburg departing 06:30, 09:00, 10:25, 11:35, 13:30, 15:20, 19:00, 20:00 and 20:55\nSource:- Fly Mango Airlines", "external_links": [], "published": "2015-08-22T03:00:00.000+03:00", "crawled": "2015-08-22T07:52:33.136+03:00", "highlightTitle": ""}