{"organizations": [], "uuid": "5ec1dcf48b401b16588b28cf8f5113b5351d20b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/12/Estonian-Air.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/estonian-air-earned-profit-in-june-and-july/", "country": "US", "title": "Estonian Air earned profit in June and JulyTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Estonian Air earned profit in June and JulyTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "5ec1dcf48b401b16588b28cf8f5113b5351d20b8"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/estonian-air-earned-profit-in-june-and-july/", "ord_in_thread": 0, "title": "Estonian Air earned profit in June and JulyTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Estonian Air earned profit in June and July\n„This year profitable summer months indicate that the restructuring plan has helped us to establish a solid foundation for long-term sustainability. Active sales in Estonia and destination markets and capacity providing for other airlines have contributed to the positive outcome. In addition, a wider choice of flight destinations and improved load factor shows more effective usage of our assets,“ said Indrek Randveer, the CCO of Estonian Air.\n„We will continue to develop our business and we realize that in order to keep sustainable profit and serving direct flights from Tallinn we need to find service opportunities from Scandinavia and Europe as well. For instance, operating SAS and Austrian Airlines flights as capacity provider and serving Swedish domestic flights starting from October where our business risks are hedged,” added Randveer.\n“Approaching autumn and winter time will bring a low flight season, and we are planning to have losses in 2015. Nevertheless, our results so far have been better than budgeted and next year we are aiming to reach the break-even,” said Randveer.\nEstonian Air has increased its sales and market share although the aviation market as a whole is in decline and the competition is increasing. Estonian Air carried 62 559 passengers in June, which is an increase of 14% and 65 643 passengers in July, which is an increase of 18%.\nIn the first seven months Estonian Air carried altogether 341 591 passengers, out of which 330 180 on regular flights. The total number of passengers increased 8.5% and on regular flights 9.1% compared to the same period last year. In the first seven months Estonian Air operated 7 040 regular and charter flights, which is 13% more than during the same period last year.\nEstonian Air, founded in 1991 and headquartered in Tallinn, is the largest carrier at Tallinn Airport. Estonian Air is aiming to provide Estonia with reliable and regular double daily connections to destinations of strategic importance and of substantial demand. Being a small country on the periphery of Europe, Estonia depends on such connections, and Estonian Air is committed to provide these services.\nEstonian Air currently operates a total of six aircraft: three Embraer 170 and three Bombardier CRJ900 aircraft. In September two CRJ700 aircraft will be added to the fleet.\nEstonian Air has two business lines: serving direct flights of strategic importance for Estonia and of substantial demand, and providing capacity to several major airlines in Europe and Scandinavia.\nEstonian Air operates regular routes from Tallinn to Stockholm (Arlanda and Bromma), Copenhagen, Amsterdam, Brussels, Oslo, Moscow, St Petersburg, Kiev, Vilnius and Trondheim. Until October 2015, Estonian Air operates seasonal flights to Munich, Paris, Berlin, Nice, Vienna, Milan and Split in addition.\nEstonian Air is a member of IATA (International Air Transport Association) and certified according to the IATA Operational Safety Audit (IOSA).\nSource:- Estonian Air", "external_links": [], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T14:59:41.180+03:00", "highlightTitle": ""}