{"organizations": [], "uuid": "c0d6b327f0523b7f9110056c939395c6d49bc170", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theepochtimes.com", "main_image": "http://www.theepochtimes.com/n3/eet-content/uploads/2015/08/14/Saintes-674x506.jpeg", "site_section": "http://www.theepochtimes.com/n3/c/travel/feed/", "section_title": "The Epoch Times » Travel", "url": "http://www.theepochtimes.com/n3/1718519-roaming-frances-atlantic-coast/", "country": "US", "title": "Roaming France’s Atlantic Coast", "performance_score": 0, "site": "theepochtimes.com", "participants_count": 1, "title_full": "Roaming France’s Atlantic Coast", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T20:28:00.000+03:00", "replies_count": 0, "uuid": "c0d6b327f0523b7f9110056c939395c6d49bc170"}, "author": "Susan James", "url": "http://www.theepochtimes.com/n3/1718519-roaming-frances-atlantic-coast/", "ord_in_thread": 0, "title": "Roaming France’s Atlantic Coast", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Susan James | August 14,   14, 2015 1:28 pm < > \nThe remains of a Roman amphitheatre in Saintes, a historic town noteworthy for its Gallo-Roman, medieval, and classical heritage. (Susan James) \nI could hear the bagpipes playing from half a mile away. In this remote village in France it was an unexpected sound. Peddling down a bumpy cobbled track on my bicycle I found three pipers in navy uniforms, practicing. \nI was six miles off the coast of western France on the Isle d’Aix, a tiny island in the Atlantic not even two miles long and accessible only by ferry and navigable only by foot and bicycle. I had come here to watch the departure of a fabled tall ship, the Hermione, as she sailed down the Charente River, past Isle d’Aix, and began her voyage across the Atlantic to the New World. \nIn March 1780 the Marquis de Lafayette sailed from nearby Rochefort on the first Hermione, together with four other French frigates and 5,500 men, to support General George Washington and the American War of Independence. To honour that Franco-American connection, an exact reproduction of the Hermione had been built and I was here to see its send-off. The practicing bagpipers formed the heart of the ship’s bon voyage band. Poitou-Charentes has earned the right to its maritime heritage as the region was once part of a vast undersea reef. Flags flew and sunlight sparked off the waves as a crowd gathered on the ramparts of old World War II bunkers to see Hermione depart. As I watched from the clifftop, an entire history of maritime shipbuilding swung at anchor offshore. Near the 1780 Hermione sat an exact replica of Magellan’s 1519 flag ship Vittoria with its Iberian crew. Also nearby was Hermione’s official escort, a modern French naval frigate that dwarfed both historic wooden ships. Later that evening, to the sound of the cannon’s roar and fireworks, Hermione finally set sail for Yorktown, Virginia. Naval History \nFrance’s naval history is written in the towns of Poitou-Charentes, a region of France that skirts the Atlantic just north of Aquitaine and south of the Loire. The town of Rochefort was chosen by Louis XIV in 1685 for the site of his new naval dockyards. His ambition was to construct a navy that would beat the British—self-proclaimed lords of the sea—at their own game. It was in Rochefort’s drydocks that the replica Hermione was built. \nWith its white limestone buildings, the town still has the flavour of the 17th century. At the Hotel de Cheusses, now the Maritime Museum, de Lafayette spent his last night before setting sail on the Hermione. Cannons greet the visitor in the cobbled courtyard and in the period rooms inside are ship models, swords, and armour on display, as well as the very bedroom where de Lafayette last slept. \nNapoleon was here, too, on his way to St. Helena and permanent exile. A copy of the letter he wrote to the British people renouncing any further political ambitions is kept in the commandant’s office. Exactly 200 years ago in 1815, Napoleon sailed from Rochefort to spend his last three nights in France on the Isle d’Aix in a modest mansion, now the Napoleon Museum. He never returned. \nRochefort’s other outstanding historical site, Corderie Royale, is a rare survival from a time when the power of empires travelled by ship and ships were powered by rope and sail. It was in this long, low stone building that the ropes that rigged the tall ships were made. A costumed re-creator showed me and a group of fascinated school kids how stalks of hemp were turned into rope and rigging. In another room, two virtuoso knot-tiers demonstrated some of the thousands of knots that sailors had to be able to tie in the dark, up the mast, and in all weathers. La Rochelle, Green Venice \nAnother town with ties to the sea, this time through trade and merchant adventuring, is La Rochelle, a 30-minute drive north of Rochefort. Known as the White City for its limestone buildings, three medieval stone towers guard the approach up the estuary to the inner and outer harbours. Half-timbered houses, leering gargoyles, and shaded street arcades that reminded me of Italy make La Rochelle a great city for walking. An art market under white umbrellas decorated the sidewalks near the port and over garden walls, flowering purple wisteria twisted in knots as intricate as a ship’s rigging. \nBut towers and timbers aside, for foodies the jewels in La Rochelle’s crown are its seafood restaurants cramming the waterfront and spilling tables out into the sunshine loaded with succulent offerings. At Andre’s, a local favourite, the lunch special was a platter of langoustines, shrimp, whelks, and the world’s best oysters. Poitou-Charentes is also a major wine- and cheese-producing region so it wasn’t difficult to match les fruits de mer with just the right pairings. \nOne of the most unexpected places in Poitou-Charentes is the Marais Poitevin, known as Green Venice. Just north of La Rochelle, it spans 400 miles of marshland, drained by canals built by monks in the 12th century. Here, in a water world of green, live red and purple heron, kingfishers, and wood doves. An hour or two in a rented punt floating along a bank of pollarded ash trees is just one of the many water adventures available in this historic area. Romanesque Remains \nPoitou-Charentes has earned the right to its maritime heritage as the region was once part of a vast undersea reef. Towns constructed of limestone blocks quarried from these ancient deposits still hold fossils and tiny remnants of antediluvian shell. The Romans came here and built baths, forums, and amphitheatres like the one preserved in Saintes. Later generations broke apart the Roman works to build mansions, churches, and cathedrals. \nPoitiers, an hour and a half inland from La Rochelle, is the site of the oldest Christian building in France, the 4th-century baptistery of St. Jean, as well as the stunning 6th-century Church of St. Radegonde. Byzantine-style frescos cover Romanesque arches and alabaster windows filter low light across brilliant colours. \nIn the fortified hill town of Angoulême to the south, the erudite and powerful sister of Francois I, Marguerite of Angouleme, was born. It is also where Isabelle of Angouleme, the beautiful and volatile last queen of the notorious English King John, ruled with an iron hand from a limestone palace that still stands. \nPoitou-Charentes is a region of sea winds and fresh oysters, of Roman gladiators and Romanesque cathedrals, of passionate queens and exiled emperors, of ships and sails and high adventure. On Isle d’Aix in the last century, a nacre industry once flourished where artisans delicately stripped the outer shells of sea mollusks and created jewels from the nacre revealed within. Today, the nacre of Poitou-Charentes can be found everywhere. \nSusan James is a freelance writer based in Los Angeles. She has lived in India, the U.K., and Hawaii, and writes about travel, art, food, and culture \nViews expressed in this article are the opinions of the author(s) and do not necessarily reflect the views of Epoch Times. Have you had a different experience visiting this region? Share it with us in the comments section!", "external_links": [], "published": "2015-08-14T20:28:00.000+03:00", "crawled": "2015-08-14T22:27:35.302+03:00", "highlightTitle": ""}