{"organizations": [], "uuid": "eb3666ac0ebf1dc75c98b0ff30b3f69a06062e5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/Once-proposal.jpg", "site_section": "http://entertainment.ie/travel", "section_title": "Escapes Home Travel photo galleries premieres interviews videos rumours news stories - entertainment.ie ", "url": "http://entertainment.ie/travel/Five-things-to-check-out-around-Ireland-this-August/368653.htm", "country": "IE", "title": "Five things to check out around Ireland this August", "performance_score": 0, "site": "entertainment.ie", "participants_count": 1, "title_full": "Travel | Five things to check out around Ireland this August - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T00:48:00.000+03:00", "replies_count": 0, "uuid": "eb3666ac0ebf1dc75c98b0ff30b3f69a06062e5b"}, "author": "entertainment.ie", "url": "http://entertainment.ie/travel/Five-things-to-check-out-around-Ireland-this-August/368653.htm", "ord_in_thread": 0, "title": "Five things to check out around Ireland this August", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With the bank holiday weekend over, summer is officially drawing to a close. But there's still a few weeks left before the kids head back to school, and plenty going on around the country keep them occupied or to keep the bank holiday spirit going all month.\nFilms You'd Love Your Kids to See\nKnowing that summer in Ireland can sometimes mean trying to keep young kids occupied on rainy days, the Light House cinema put together a summer programme of classical family films from the '70s and '80s, which the whole family can enjoy together. The Karate Kid, The Goonies and the Indiana Jones trilogy will all be showing in the cinema this August with afternoon screenings for children, and evening screenings for those who want to relive their childhoods.\nKilkenny Arts Festival\nThe marble city's annual arts festival kicks off on August 7th and runs until August 16th, with a programme of free and paid events to suit every age group and interest. Highlights include Mirazozo, an inflatable luminarium which will be set up in the grounds of Kilkenny Castle for the duration of the festival, and the Druid theatre company presenting a selection of Shakespeare's plays in the castle yard.\nIrish Craft Beer and Cider Festival\nCraft beers and ciders have exploded in popularity in recent years, and Irish breweries in all areas of the country have been producing some top quality beverages. The Irish Craft Beer and Cider festival gathers a load of breweries under the roof of the RDS between August 27th and 29th, giving you the opportunity to sample whatever you'd like. If you can't make it there, the Doolin Beer and Bluegrass festival and The Big Grill festival are also on in August.\nFleadh Cheoil na hEireann\nThe Fleadh Cheoil is the highlight of the year for many music fans, this year it's being hosted in Sligo between the 9th and 16th of August. There's a mix of gigs, workshops, competitions, talks, exhibitions taking place and even if you have little interest in traditional Irish music it's worth a visit for the general craic that will spread through the town for the duration of the festival. For those who can't make it, highlights will be broadcast on TG4\nOnce\nThe Oscar winning film, turned Tony winning musical, about a Dublin busker who falls in love with a flower seller, continues its run in the Olympia theatre all this month. The show spent three years on Broadway and two years on the West End before finally coming home to Ireland last month. The show runs Monday to Saturday at 8pm, with matinees on Saturday too.\nMORE: Exclusive: Panti to host live Q&A in Dublin with Amy Schumer and Judd Apatow for Trainwreck\nMORE: Deadly buzz: Giant swarm of bees spotted on Dublin street\nMORE: FYI, Henry Cavill is in Dublin right now", "external_links": [], "published": "2015-08-07T00:48:00.000+03:00", "crawled": "2015-08-06T22:00:44.013+03:00", "highlightTitle": ""}