{"organizations": [], "uuid": "3ff83d544ab71e67ce87fedba70a0aac9e9b03df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/transit-three-reasons-still-visit-puerto-rico", "country": "US", "title": "In Transit: Three Reasons to (Still) Visit Puerto Rico", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "In Transit: Three Reasons to (Still) Visit Puerto Rico", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T21:07:00.000+03:00", "replies_count": 0, "uuid": "3ff83d544ab71e67ce87fedba70a0aac9e9b03df"}, "author": "senh", "url": "http://www.wopular.com/transit-three-reasons-still-visit-puerto-rico", "ord_in_thread": 0, "title": "In Transit: Three Reasons to (Still) Visit Puerto Rico", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Three Reasons to (Still) Visit Puerto Rico Puerto Rico has been one of the company’s top five selling destinations for several years and continues to remain so, said Mr. Marmontello. In July, about 1,200 people booked trips to the island through the site, the same as this time last year. 08/5/2015 - 8:00 am | View Link Amsterdam Cruise Review by glomarrone: 14 Night Panama Canal Eastbound Transit Although we cruised the Panama Canal westbound with HAL several years ago, we decided to repeat the cruise going eastbound for several reasons. Our main reason ... 2014 visiting the ports of Puerto Vallarta, Mexico, Huatulco, Mexico, Puerto Quetzal ... 01/27/2015 - 6:01 am | View Link More expected to flee New Jersey as baby boomers age Those 204,000 were replaced by about 211,000 people moving to New Jersey from Puerto ... transit costs are making it difficult for young people to afford New Jersey. Hughes said millennials are among those expected to leave New Jersey, but for different ... 01/15/2015 - 12:32 am | View Link More expected to flee New Jersey as baby boomers age By the end of 2015, baby boomers born ... of living and high transit costs is making is difficult for young people to afford New Jersey. Hughes said millennials are among those expected to leave New Jersey, but for different reasons. People in their ... 01/12/2015 - 9:26 pm | View Link ch-aviation interview: Trevor Sadler, CEO interCaribbean Airways a vast majority of whom travel primarily for US visa reasons. It is also worth mentioning that a market segment that is currently growing quite rapidly is the European transit tourist niche i.e. tourists arriving from Europe use us to visit the islands of ...", "external_links": [], "published": "2015-08-05T21:07:00.000+03:00", "crawled": "2015-08-06T00:45:46.653+03:00", "highlightTitle": ""}