{"organizations": [], "uuid": "464397a2c0baa3c2b56326d744b2a458c56d9946", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/us-news-travel/headshot.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/us-news-travel/how-to-avoid-a-vacation-r_b_8017196.html", "country": "US", "title": "How to Avoid a Vacation Rental Nightmare", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "How to Avoid a Vacation Rental Nightmare", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T23:02:00.000+03:00", "replies_count": 0, "uuid": "464397a2c0baa3c2b56326d744b2a458c56d9946"}, "author": "U.S. News Travel", "url": "http://www.huffingtonpost.com/us-news-travel/how-to-avoid-a-vacation-r_b_8017196.html", "ord_in_thread": 0, "title": "How to Avoid a Vacation Rental Nightmare", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "hoteldelcoronado / Flickr \nYou scoured vacation rental sites and reviews for weeks to find the right place for your upcoming getaway. The home listing said it's \"steps from the beach\" and the rooms looked spacious and clean. You've paid in full and are ready to start relaxing only to arrive at the property to find a completely different image than the photos you've been gazing at for weeks. It's not steps from the beach; it's more like miles. And two of the rooms are more like closets. Now what? \nIn 2013, Phocuswright reported that Americans spent $23 billion on vacation rentals in 2012. Though the boom in the vacation rental industry has provided travelers with a wealth of new, budget-friendly lodging options, it's also created more headaches. Without a front desk staff, who can you call if something breaks? If the property is completely different than its online profile, can you get a full refund? Before you book your next vacation rental, read these tips to understand your consumer rights and what you can do if the property isn't what you expected. \nSee: 10 Questions to Ask Before Booking a Vacation Rental \nInvestigate if the property is legal \nThe legality of short-term rentals is murky. As of now, there are no uniform laws that regulate the short-term rental industry. It's up to individual states and cities to enact and enforce their own laws to protect consumers and simultaneously stymie the loss of hotel and occupancy tax revenue. Laws can vary widely, but if an owner or tenant would like to list his or her property as a short-term rental, typically he or she must obtain a business license or operating permit, pass a safety code inspection and pay an application fee. If you're just hoping to rent, this probably seems like somebody else's problem. Why should you care if the property is a registered short-term rental or not? After all, you're only staying at the property for a few days. \nFor starters, you'll have more peace of mind knowing that the property you're staying in has recently undergone a safety inspection and is on the up and up with regulators. Second, if something should go awry with your rental and you file a complaint with the state or city, you'll be more likely to recoup any monetary loss. In short: You'll be more empowered as a consumer with the state or city on your side. Before you rent, check with the local attorney general's consumer affairs department to see what protections are in place for short-term renters. Though sites like HomeAway (the parent company that encompasses other popular sites like VRBO.com and Bookabach) and Airbnb do offer protections for travelers who are unsatisfied with their vacation rental experience, the companies do not provide a 100 percent guarantee that you'll receive a full refund. TripAdvisor Vacation Rentals does provide full protection, however, if you book a property covered by its Peace of Mind protection. This guarantee provides payment protection on your booking against a variety of issues, including property misrepresentation, double bookings and the inability to access the property, among other hiccups. But since the amount of protection can vary widely across vacation rental sites, many consumers are choosing to book their rentals through a travel agent . \nSee: 5 Ways to Get a Deal on a Vacation Rental \nEnlist a travel agent \nSites like TripAdvisor Vacation Rentals, Airbnb and HomeAway do have security measures in place to protect users against fraudulent listings. User-submitted reviews, verified photos (in Airbnb's case) and an internal messaging system are meant to help travelers avoid any disappointment upon arrival. Relying on community reviews is an effective way to filter out unsatisfactory properties, but if you want to take the verification process one step further, rent from a travel agent. Travel agents rent properties managed by agencies -- not individual owners -- that have been personally visited and vetted by agency staff. Though these properties can be more expensive and not as widely available, renting a curated apartment, condo or home reduces your risk of fraud and dissatisfaction. Plus, if you rent through a travel agent, you'll have another advocate on your side should anything arise during your stay. Sites like Wyndham Vacation Rentals , onefinestay , Be Mate and Oasis Collections are examples of companies offering curated properties (some even offer hotel-like services, such as housekeeping and a local concierge). If you need help finding a travel agent, use this directory on the American Society of Travel Agents' website . \nAsk for a rental agreement \nJust as with a normal rental lease, a rental agreement or contract will outline your rights as the guest and the rights of the owner. The agreement should include information about fees, deposits and refunds, guidelines about the property's cleanliness (and an assurance that it will be habitable upon your arrival), plus any other rules you should know about the house or community. Sites like Airbnb and HomeAway don't require a rental agreement for hosts and guests, but hosts can opt to include one if they inform renters prior to booking. Keep in mind that the document basically defines the legal relationship between you and the owner, meaning you can refer back to it if there's a dispute. If you rent a listing offering a rental agreement, make sure it's signed by both you and the owner and that the agreement is squared away before you pay with your credit card. \nTo protect yourself even further, consider a service like SafelyStay . The site provides an extra layer of security by authenticating identities and running background checks on both guests and hosts (for a fee). Plus, if you want to check on a property's validity, SafelyStay will verify the listing against property records, real estate listings and other criteria to sniff out any risks and potential fraud. The site also helps with payment, too, holding the funds until the vacation is complete (not just until you arrive). So, if the utilities aren't working, the property isn't as described or the reservation isn't honored, SafelyStay will help you clear up any issues that can't be resolved on site. \nAnn Rivall is a Travel Editor at U.S. News. You can follow her on Twitter , circle her on Google+ or email her at arivall@usnews.com. \nFollow U.S. News Travel on Twitter: www.twitter.com/USNewsTravel More:", "external_links": [], "published": "2015-08-20T23:02:00.000+03:00", "crawled": "2015-08-20T23:29:59.246+03:00", "highlightTitle": ""}