{"organizations": [], "uuid": "b5625ce89b7addabe0753230405f4af5136abcb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/sydney-airport-logo1.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sydney-airport-launches-decadent-oliver-brown-chocolate-cafe-at-t1-international-terminal/", "country": "US", "title": "Sydney Airport Launches Decadent Oliver Brown Chocolate Café At T1 International terminalTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Sydney Airport Launches Decadent Oliver Brown Chocolate Café At T1 International terminalTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "b5625ce89b7addabe0753230405f4af5136abcb4"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sydney-airport-launches-decadent-oliver-brown-chocolate-cafe-at-t1-international-terminal/", "ord_in_thread": 0, "title": "Sydney Airport Launches Decadent Oliver Brown Chocolate Café At T1 International terminalTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sydney Airport Launches Decadent Oliver Brown Chocolate Café At T1 International terminal\nAs part of the exciting revitalisation of the food and beverage offering at T1 International terminal, Sydney Airport has announced the launch of speciality Belgian chocolate café Oliver Brown to the casual dining precinct.\nOpening in August, Oliver Brown will be a unique and decadent dessert destination for international passengers, visitors and staff enhancing the overall airport experience.\nThe café will showcase a range of desserts and hot and cold beverages designed to please every sweet tooth and chocaholic, from traditional hot chocolate to Hazelnut Affogato, Choc Mojito and Iced Tea Green Latte. Chocolate fondue, churros, crêpes and Belgian waffles as well as Macaroon gift boxes are just a small selection of what will be available from the dine-in menu.\nA bespoke kids menu will also be on offer with Oliver Brown Babycinnos and Rockin Poppin Kids Fondue sure to please even the fussiest little flyer.\n“The Oliver Brown brand brings a modern and unique approach to the traditional chocolate café setting and forms part of our strategic transformation of the T1 food and dining offer,” Sydney Airport General Manager Retail Glyn Williams said.\n“The new cafe will enhance choice and value for passengers and we feel confident our international travellers will welcome the addition to our newly configured T1 casual dining precinct.”\nOliver Brown CEO Jacob Kim said: “We are delighted to announce the launch of Oliver Brown at Sydney Airport’s T1. This incredible retail setting provides a unique opportunity to introduce the international passengers to our brand and delight them with our quality selection of Belgian desserts and beverages.”\nOliver Brown will be situated in Sydney Airport’s T1 International terminal casual dining precinct, located before customs.\nSource:- Sydney Airport", "external_links": [], "published": "2015-08-07T03:00:00.000+03:00", "crawled": "2015-08-08T03:02:18.549+03:00", "highlightTitle": ""}