{"organizations": [], "uuid": "8d8c8bcaa09c1167bab228e912208519db03fd60", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/airportairline/28309-first-look-inside-vietnam-airlines-new-b787-9-dreamliner", "country": "US", "title": "First look inside Vietnam Airlines' new B787-9 Dreamliner", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "First look inside Vietnam Airlines' new B787-9 Dreamliner", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T13:00:00.000+03:00", "replies_count": 0, "uuid": "8d8c8bcaa09c1167bab228e912208519db03fd60"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/airportairline/28309-first-look-inside-vietnam-airlines-new-b787-9-dreamliner", "ord_in_thread": 0, "title": "First look inside Vietnam Airlines' new B787-9 Dreamliner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First look inside Vietnam Airlines' new B787-9 Dreamliner First look inside Vietnam Airlines' new B787-9 Dreamliner Details Category: Airport & Airline   11:00 Following the arrival in Hanoi of the first of its new Boeing 787-9 Dreamliner, national carrier Vietnam Airlines has released the first official pictures showing the new aircraft’s stylish, high-tech interiors. With a total of 274 seats - configured in Business Class, Premium Economy and Economy cabins - the new Dreamliner offers a world class passenger experience throughout, with more space and legroom; individual on-demand in-flight entertainment systems; larger windows and stow bins with automatic touch buttons; modern LED lighting; higher humidity and cleaner air; lower cabin pressure; and a smoother, quieter ride. \nThe new Business Class cabin features 28 Zodiac Cirrus III fully-flat sliding seats in a 1-2-1 herringbone configuration, each affording passengers direct aisle access and the utmost in privacy. Business Class passengers benefit from 42-inch seat pitch, individual 15.4-inch in-seat TVs with HD touch screens, individual mini bars, noise-cancelling headsets and private reading lights. In Premium Economy, 35 Timco 3050 seats are configured in 2-3-2 formation, offering passengers a 42-inch seat pitch and 7 inch recline. The Economy cabin features BE Pinnacle seats in a 3-3-3 configuration, with 31-32-inch seat pitch and 5-6 inch recline. All Premium Economy and Economy seats also feature individual 10.6-inch in-seat TVs with HD touch screens. All 274 seats feature in-seat 110V-50Hz AC power outlets and USB ports, and in-flight WiFi and SMS connectivity is also set to be introduced. The latest extension to Boeing’s super-efficient 787 family, the Boeing 787-9 Dreamliner can fly farther, and with more passengers and more cargo, than the Boeing 787-8 - but with the same exceptional environmental performance: 20 per cent less fuel usage and 20 per cent fewer emissions than the aircraft it is replacing. Thanks to the latest innovative technologies and the all-new design of the Boeing 787-9, Vietnam Airlines’ passengers will feel better, breathe more healthily, rest with maximum pleasure and enjoy incomparable comfort on our most advanced fleet. From this September, Vietnam Airlines will be the first airline to operate the new B787-9 Dreamliner nonstop between Southeast Asia and Europe, with Heathrow becoming the first international destination on the Vietnam Airlines network to be served by the new aircraft. Frequencies between Hanoi/Ho Chi Minh City and London Heathrow will rise from four flights to five or six flights per week following the deployment of the Dreamliners, before increasing to a daily service for Summer 2016. Return fares from Heathrow to Ho Chi Minh City or Hanoi currently start from £441 or £525 per person respectively, inclusive of taxes. Related articles", "external_links": [], "published": "2015-08-18T13:00:00.000+03:00", "crawled": "2015-08-18T13:56:39.943+03:00", "highlightTitle": ""}