{"organizations": [], "uuid": "e12a7317bd8f44a2cfee6a0e900e408ac7144c9a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29849539/gates-corporation-announces-release-of-566-new-automotive-aftermarket-parts", "country": "US", "title": "Gates Corporation Announces Release of 566 New Automotive Aftermarket Parts", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Gates Corporation Announces Release of 566 New Automotive Aftermarket Parts - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e12a7317bd8f44a2cfee6a0e900e408ac7144c9a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29849539/gates-corporation-announces-release-of-566-new-automotive-aftermarket-parts", "ord_in_thread": 0, "title": "Gates Corporation Announces Release of 566 New Automotive Aftermarket Parts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Gates Corporation\nGates expands its aftermarket coverage with SKU additions across product lines, adding 566 parts for maximum coverage on late model vehicles.\nDENVER , Aug. 21, Gates Corporation , a global diversified manufacturer of industrial, automotive, and heavy-duty aftermarket products, today announces the release of 566 part numbers, expanding its coverage of OE quality automotive aftermarket products across several categories.\nThe release includes the launch of Gates new RPM (Racing, Performance, Muscle) serpentine belt line . The racing belts feature a new look and more durable construction to accommodate a wide variety of drive load. The line will launch with 83 SKUs.\nGates expands its new Century™ Series belt line with the addition of 4 Stretch Fit®, 13 Micro-V® and 2 Dual-Sided belts. All Stretch Fit belts in the line now feature a new sleeve design with a custom link to specific installation instructions available online.\nGates continues to address specific market needs with the introduction of Accessory Belt Drive Kits for school buses as well as for the Ford E-450 Azure Hybrid Drive System. Each of the 84 new FleetRunner® Accessory Belt Drive Kits for the school bus market are designed for systems working in harsh environments with long idle times and high temperatures. Kits contain a FleetRunner Micro-V Belt and a Green Stripe® DriveAlign® HD Tensioner. The new Azure Solution Kit for the Ford E-450 Azure Hybrid Drive System contains the replacement belt, tensioner, and pulleys for the system.\nGates extends its popular hybrid polymer hose line with new Hybrid Polymer Whip and Water Hoses that won't kink or curl. The Hybrid Polymer Whip Hose reduces wear and tear and features a ¼\" male ball swivel and ¼\" female NPT fitting while the Hybrid Polymer Water Hose has heavy-duty nickel-plated fittings and spring guard. Both hoses are available in a variety of lengths.\n\" Every new product release allows Gates to showcase its tradition of innovation by introducing products that address the latest market needs ,\" said Scott Howat , Gates Director of Marketing and Product Management for the North American Aftermarket. \" We're constantly striving to improve our product offering and expand coverage to remain the market leader in OE-quality automotive aftermarket parts .\"\nThe Gates Corporation is a global, diversified industrial company that provides advanced power transmission and fluid transfer solutions by engineering products and services that reduce the total cost of ownership for a wide variety of applications. Our products and services serve customers in five key end market segments: Energy/Exploration/Extraction, Infrastructure & Agriculture, Transportation, Automotive, and Process & Specialty.\nAs an engineering leader with a strong foundation in research and development, Gates is committed to advancing the science of motion performance by developing safe, forward-thinking products, services, systems, and solutions, as well as fostering long term customer and employee relationships. Headquartered in Denver, Colorado , Gates employs over 14,000 people across 106 locations in 30 countries. If it moves you, there's a good chance Gates has a part in it. Gates. Powering Progress .\nPhoto - http://photos.prnewswire.com/prnh/20150818/259469\nLogo - http://photos.prnewswire.com/prnh/20150521/217971LOGO\n releases/gates-corporation-announces-release-of-566-new-automotive-aftermarket-parts-300131621.html\n ", "external_links": ["http://www.gates.com/", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA82383&Transmission_Id=201508210735PR_NEWS_USPR_____LA82383&DateId=20150821", "https://photos.prnewswire.com/prnvar/20150818/259469", "http://photos.prnewswire.com/prnvar/20150521/217971LOGO", "http://photos.prnewswire.com/prnh/20150818/259469", "http://www.prnewswire.com/news-releases/gates-corporation-announces-release-of-566-new-automotive-aftermarket-parts-300131621.html", "http://photos.prnewswire.com/prnh/20150521/217971LOGO"], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T17:25:22.067+03:00", "highlightTitle": ""}