{"organizations": [], "uuid": "3325b92ba38c499b5fa28764a6cdbd7e5a26034a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29875951/automakers-spending-billions-on-technologies-that-many-consumers-dont-use", "country": "US", "title": "Automakers Spending Billions on Technologies That Many Consumers Don't Use", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Automakers Spending Billions on Technologies That Many Consumers Don't Use - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "3325b92ba38c499b5fa28764a6cdbd7e5a26034a"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29875951/automakers-spending-billions-on-technologies-that-many-consumers-dont-use", "ord_in_thread": 0, "title": "Automakers Spending Billions on Technologies That Many Consumers Don't Use", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " J.D. Power\nBuilt-in Connectivity among Least Used Technologies, Creating Lost Value\nWESTLAKE VILLAGE, Calif. , Aug. 25, Automakers are investing billions of dollars to put technologies in their cars and light trucks that are not being used by many of the owners of those vehicles, according to the J.D. Power 2015 Driver Interactive Vehicle Experience (DrIVE) Report. S M\nThe 2015 DrIVE Report measures driver experiences with in-vehicle technology features during the first 90 days of ownership.\nThe report finds that at least 20 percent of new-vehicle owners have never used 16 of the 33 technology features measured. The five features owners most commonly report that they \"never use\" are in-vehicle concierge (43%); mobile routers (38%); automatic parking systems (35%); head-up display (33%); and built-in apps (32%).\nThere are 14 technology features that 20 percent or more of owners do not want in their next vehicle, including Apple CarPlay and Google Android Auto, in-vehicle concierge services and in-vehicle voice texting. Among Gen Y 1 , the number of features unwanted by at least 20 percent of owners increases to 23, specifically technologies related to entertainment and connectivity systems.\n\"In many cases, owners simply prefer to use their smartphone or tablet because it meets their needs; they're familiar with the device and it's accurate,\" said Kristin Kolodge , executive director of driver interaction & HMI research at J.D. Power . \"In-vehicle connectivity technology that's not used results in millions of dollars of lost value for both consumers and the manufacturers.\"\nAmong all owners, the most frequently cited reasons for not wanting a specific technology feature in their next vehicle are \"did not find it useful\" in their current vehicle and the technology \"came as part of a package on my current vehicle and I did not want it.\"\nIn addition, owners who say their dealer did not explain the feature have a higher likelihood of never using the technology. Furthermore, features that are not activated when the vehicle is delivered often result in the owner not even knowing they have the technology in their new vehicle.\nKolodge noted that the technologies owners most often want are those that enhance the driving experience and safety, which are only available as a built-in feature rather than via an external device. In-vehicle technologies that most owners do want include vehicle health diagnostics, blind-spot warning and detection, and adaptive cruise control.\n\"The first 30 days are critical. That first-time experience with the technology is the make-it-or-break-it stage,\" said Kolodge. \"Automakers need to get it right the first time, or owners will simply use their own mobile device instead of the in-vehicle technology.\"\nBecause the first few weeks of ownership are so critical, dealerships play the most important role in helping owners get off to a good start with the technology in their vehicle, Kolodge noted.\n\"While dealers are expected to play a key role in explaining the technology to consumers, the onus should be on automakers to design the technology to be intuitive for consumers,\" said Kolodge. \"Automakers also need to explain the technology to dealership staff and train them on how to demonstrate it to owners.\"\nSafety and Repair Costs\nUse of in-vehicle technologies has implications beyond the auto industry. For example, the insurance industry is closely tracking automotive technology for safety and financial purposes. Insurers are concerned that difficult-to-use technology may distract drivers and cause an accident. Using smartphones instead of in-vehicle technology also creates safety issues. Additionally, in-vehicle technology can significantly increase claims costs for vehicles damaged in an accident.\n\"While some technologies, such as lane-departure warning, are making vehicles safer, the insurance industry is very concerned about the driver-distraction hazards caused by some of the other technologies,\" said Chip Lackey , senior director of the insurance practice at J.D. Power . \"In addition, technology drives up the repair and replacement costs. A slight bumper scrape that would normally cost a few hundred dollars to repair can catapult a claim into thousands of dollars when a park assist camera or other sensors are damaged.\"\nThe 2015 Driver Interactive Vehicle Experience (DrIVE) Report is based on responses from more than 4,200 vehicle owners and lessees after 90 days of ownership. The report was fielded in April through June 2015 .\nMedia Relations Contacts:\nJohn Tews ; J.D. Power; Troy, Mich. ; 248-680-6218; media.relations@jdpa.com\nAbout J.D. Power and Advertising/Promotional Rules www.jdpower.com/about-us/press-release-info\nAbout McGraw Hill Financial www.mhfi.com\n1 J.D. Power defines generational groups as Pre-Boomers (born before 1946); Boomers (1946-1964); Gen X (1965-1976); Gen Y (1977-1994); and Gen Z (1995 and later).\nLogo - http://photos.prnewswire.com/prnh/20130605/LA26502LOGO\n releases/automakers-spending-billions-on-technologies-that-many-consumers-dont-use-300132473.html\n ", "external_links": ["http://www.jdpower.com/about-us/press-release-info", "http://www.xmlnews.org/ns/", "http://www.mhfi.com/", "http://photos.prnewswire.com/prnh/20130605/LA26502LOGO", "http://photos.prnewswire.com/prnvar/20130605/LA26502LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA85459&Transmission_Id=201508251300PR_NEWS_USPR_____LA85459&DateId=20150825", "http://www.prnewswire.com/news-releases/automakers-spending-billions-on-technologies-that-many-consumers-dont-use-300132473.html"], "published": "2015-08-25T03:00:00.000+03:00", "crawled": "2015-08-25T20:43:10.008+03:00", "highlightTitle": ""}