{"organizations": [], "uuid": "5c53209f7f2384fef883ab1ecb230d23c9b7878b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150806165325-edward-kwon-cj-large-169.jpeg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/08/07/travel/chef-edward-kwons-culinary-journey/index.html", "country": "US", "title": "Chef Edward Kwon's quest to globalize Korean food", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "Chef Edward Kwon's quest to globalize Korean food - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T15:00:00.000+03:00", "replies_count": 0, "uuid": "5c53209f7f2384fef883ab1ecb230d23c9b7878b"}, "author": "Violet Kim, for CNN", "url": "http://edition.cnn.com/2015/08/07/travel/chef-edward-kwons-culinary-journey/index.html", "ord_in_thread": 0, "title": "Chef Edward Kwon's quest to globalize Korean food", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On this month's episode of Culinary Journeys, we follow celebrity chef Edward Kwon to Jeonju, a famous South Korean food city. Learn more about the show here: cnn.com/journeys .\nSeoul (CNN) With decades of experience in the kitchens of luxury hotels in South Korea , the United States and the United Arab Emirates -- where he served as head chef at Burj Al Arab -- celebrity chef Edward Kwon has proven that he's comfortable in a toque and apron.\nBut he's also demonstrated skills as a savvy businessman, whether as the star of a Korean cooking show, the author of multiple books or the CEO of food and dining company EK Food.\nJUST WATCHED On the next episode of Culinary Journeys: Edward Kwon. Replay More Videos ... MUST WATCH\nOn the next episode of Culinary Journeys: Edward Kwon. 00:30 PLAY VIDEO But before Kwon's culinary career kicked off -- he's founder and head of restaurant Lab XXIV in Seoul and Elements by Edward Kwon in Moscow -- he had a different plan for his life.\n\"Please don't laugh about it -- I wanted to be a priest when I was a kid,\" Kwon tells CNN.\nKwon is still devoted to preaching -- but these days he's singing the praises of Korean food.\n\"I'm trying to globalize Korean food,\" he says.\nKwon, 45, has transformed his name into a Korean culinary brand with global clout, but it was only through a series of fortunate accidents that he stepped into the world of food.\n\"Becoming a chef was never my dream,\" says Kwon.\n\"I had to feed myself, however, so I ended up working at a restaurant.\n\"My first job was as a dishwasher, then a server and at this point I had no desire to work in the kitchen.\"\nIt was only when a coworker informed him that cooks were paid more than servers that Kwon decided to change jobs.\nBittersweet overseas success\nIn the latest episode of CNN's Culinary Journeys, Edward Kwon travels to Jeonju, a famous South Korean food city, to learn to make the perfect bibimbap. A chef is on a culinary journey until the day he dies\nChef Edward Kwon\nAfter working a few years at the Ritz-Carlton Hotel in Seoul, Kwon, then 29, took a job at the Ritz-Carlton San Francisco -- even though he was unable to speak a lick of English.\n\"I was ready to die,\" says Kwon of his experiences in the aggressively competitive kitchens abroad, where he dealt with racial slurs on top of the language barrier.\nToday he speaks English fluidly and with character, if not native fluency.\nBut English isn't the only thing he gained from his time abroad.\nKwon says he'll always appreciate the importance of learning through travel.\n\"A chef is on a culinary journey until the day he dies,\" he says.\n\"It might be a journey to look for ingredients, or to eat out at a restaurant or even to eat street food. There's always a learning opportunity.\"\nBut success overseas was bittersweet.\n\"Because I've lived abroad for a long time, the media sometimes implies that I had an advantage because of my overseas experience,\" says Kwon.\n\"People have these misconceptions, thinking that I'm from a wealthy family, and had a lot of other advantages.\"\nKwon resents any suggestion that somehow he's less Korean for his stay abroad, or because he uses an English name.\n\"This kind of thing can be demoralizing for people who go abroad to study.\n\"A lot of the media comments can be hurtful. These people went abroad to learn, not to gain an unfair advantage.\"\nUnofficial ambassador for hansik -- Korean food\nAlthough Kwon specializes in French, his Moscow restaurant serves Korean food. Pictured is a bibimbap with crispy fried rice, fried chicken, bean sprouts and spinach. Kwon was trained as a hotel chef and his main game is French.\nEven his restaurant in Seoul serves French.\nBut abroad, Kwon is active in promoting Korean food -- called \"hansik\" -- and sees himself as an unofficial ambassador for his homeland's cuisine.\nThe Moscow-based Elements by Edward Kwon and his upcoming St. Petersburg restaurant serve Korean cuisine.\n\"Now a lot of people are getting interested in Korea, especially Korean drama and K-pop,\" says Kwon.\n\"But they don't really know about Korean food.\"\nKwon believes that food should lead the Seoul government's attempts to promote Korean culture abroad.\n\"With music or movies, people can change their minds the next day. But the memory of food lasts.\"\n\"As one of the Korean chefs most well-known abroad, I want to act as a liaison,\" says Kwon.\nThere's still a long way to go.\n\"One of the reasons I want to globalize is that I want to show that there's more to Korean food than Korean barbecue,\" says Kwon.\n\"Ten times out of 10, people will order Korean barbecue. But when friends visit from abroad, I'll take them to have ugeoji haejangguk and they love it.\"\nHaejangguk refers to a family of soups that often include ox blood as an ingredient, and literally means \" hangover cure soup .\"\nUgeoji is the dried outer leaves of a Napa cabbage.\nKorean through and through\nKwon's beautiful rendition of mandu -- Korean dumplings. \"If you don't protect your roots, the globalization of Korean food is meaningless.\"\nChef Edward Kwon\nKwon is quick to emphasize that the food he serves at international gala dinners is Korean through and through, despite the hotel setting and unorthodox plating.\nWhen cooking Korean, Kwon stays true to traditional seasonings and bases and tries to stick to Korean ingredients.\nThe style of presentation is a practical decision, because hansik often requires individual sets of dishes for the banchan (side dishes) or silverware that most hotels don't have on hand.\n\"You can put a twist on Korean food. But a Korean should be able to eat it and say, 'Yes, this is Korean food.'\"\nThe food at Elements follows this principle.\nKwon shows a photo of a dish that looks like a miniature garden, featuring some sort of wrap in the center, topped with a half-done egg.\n\"This is yukhoe,\" says Kwon.\nYukhoe is Korean-style beef tartare. It's unrecognizable in the photo.\n\"Usually in Korea it's served with pine nuts, and julienned,\" says Kwon.\n\"But I changed the way it looked on the plate. But when you dig in, it's yukhoe. It's just shaped differently.\"\nHe flips through a series of photos, all featuring unrecognizable, but attractively presented renditions of mandu (dumplings), ddeokbokki (rice cakes in a soy sauce or red pepper paste-based sauce) and tofu kimchi.\n\"The most important thing is that my Korean food is reinterpreted in a modern way, but that in the taste and the roots, it's perfectly Korean,\" says Kwon.\n\"If you don't protect your roots, the globalization of Korean food is meaningless.\"\nGot photos of your own Culinary Journeys to share? Tag them on Instagram with the hashtag #CNNFood for a chance to be featured on CNN. For inspiration, check out these recent submissions .", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150806165328-edward-kwon-cj-bibimbap-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806173746-edward-kwon-cj-mandu-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150803120908-cnn-culinary-journeys-edward-kwon-08-08-15-00000614-exlarge-169.jpg", "http://traffic.outbrain.com/network/trackpxl?advid=814&action=view", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806165328-edward-kwon-cj-bibimbap-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806165328-edward-kwon-cj-bibimbap-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806174824-edward-kwon-cj-goong-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150803120908-cnn-culinary-journeys-edward-kwon-08-08-15-00000614-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806173746-edward-kwon-cj-mandu-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150803120908-cnn-culinary-journeys-edward-kwon-08-08-15-00000614-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806173746-edward-kwon-cj-mandu-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150803120908-cnn-culinary-journeys-edward-kwon-08-08-15-00000614-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150803120908-cnn-culinary-journeys-edward-kwon-08-08-15-00000614-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806173746-edward-kwon-cj-mandu-super-169.jpg", "http://www.labxxiv.com/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806165328-edward-kwon-cj-bibimbap-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806174824-edward-kwon-cj-goong-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806174824-edward-kwon-cj-goong-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806165328-edward-kwon-cj-bibimbap-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806173746-edward-kwon-cj-mandu-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806174824-edward-kwon-cj-goong-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806174824-edward-kwon-cj-goong-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806174824-edward-kwon-cj-goong-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150803120908-cnn-culinary-journeys-edward-kwon-08-08-15-00000614-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150803120908-cnn-culinary-journeys-edward-kwon-08-08-15-00000614-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806165328-edward-kwon-cj-bibimbap-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806173746-edward-kwon-cj-mandu-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806174824-edward-kwon-cj-goong-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806173746-edward-kwon-cj-mandu-small-11.jpg", "https://www.facebook.com/pages/Elements-By-Edward-Kwon/1571869099743731", "http://i2.cdn.turner.com/cnnnext/dam/assets/150806165328-edward-kwon-cj-bibimbap-medium-plus-169.jpg"], "published": "2015-08-07T15:00:00.000+03:00", "crawled": "2015-08-07T11:23:16.024+03:00", "highlightTitle": ""}