{"organizations": [], "uuid": "8028715aefcf1250f8beaebfbf6ee69a6b20c379", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29827193/worldventures-once-again-recognized-as-an-inc-5000-fastest-growing-private-company", "country": "US", "title": "WorldVentures Once Again Recognized as an Inc. 5000 Fastest-growing Private Company", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "WorldVentures Once Again Recognized as an Inc. 5000 Fastest-growing Private Company - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "8028715aefcf1250f8beaebfbf6ee69a6b20c379"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29827193/worldventures-once-again-recognized-as-an-inc-5000-fastest-growing-private-company", "ord_in_thread": 0, "title": "WorldVentures Once Again Recognized as an Inc. 5000 Fastest-growing Private Company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " WorldVentures Marketing, LLC\nThe Company's Three-year Sales Growth Jumped 491%\nPLANO, Texas , Aug. 18, WorldVentures ™, the leading international direct seller of vacation club memberships, ranked No. 915 in Inc. magazine's 34th annual Inc. 5000, an exclusive ranking of America's fastest-growing private companies. WorldVentures received its ranking based on growth of 491% in the past three years.\nThe list represents one of the most important segments of the economy-America's independent entrepreneurs. Companies such as Yelp, Pandora, Timberland, Dell, Domino's Pizza, LinkedIn, Zillow, and many other prominent businesses, gained early exposure as members of the Inc. 5000.\n\"We're honored to be named to the fastest-growing companies list once again,\" WorldVentures Co-founder and Chief Visionary Officer Wayne Nugent said. \"We've catapulted from 2333 last year to number 915 this year and rank ninth for the top travel and hospitality companies. What a great achievement for our corporate team and Independent Representatives around the world who have worked so hard to deliver these results.\"\nThe 2015 Inc. 5000, unveiled online at Inc.com is the most competitive crop in the list's history. The average company on the list achieved an impressive three-year growth of 490%. The Inc. 5000's aggregate revenue is $205 billion , generating 647,000 jobs over the past three years. Complete results of the Inc. 5000 can be found at www.inc.com/inc5000 .\n\"The story of this year's Inc. 5000 is the story of great leadership,\" Inc. President and Editor-in-Chief Eric Schurenberg said. \"In an incredibly competitive business landscape, it takes something extraordinary to take your company to the top. You have to remember that the average company on the Inc. 5000 grew nearly six-fold since 2012. Business owners don't achieve that kind of success by accident.\"\nThis recognition comes at a time of tremendous growth for WorldVentures. In addition to the being named one of America's fastest-growing private companies in the Inc. 5000 list, WorldVentures was recognized at No. 47 on the Direct Selling News' DSN Global 100 list and No. 25 on the DSN North America 50 list. And recently, its core product, DreamTrips™ Memberships, eclipsed competitors for the coveted title of \" Africa's Leading Travel Club\" during the World Travel Awards.\nAbout WorldVentures\nWorldVentures is the leading international direct seller of vacation club memberships and helps people achieve more fun, freedom and fulfillment by offering DreamTrips Memberships, which include premium vacations at reduced prices. WorldVentures is a privately held company based in Plano, Texas , with active Representatives and members in 28 countries. For more information, please visit www.worldventures.com .\nAbout Inc. and the Inc. 500|5000\nFounded in 1979 and acquired in 2005 by Mansueto Ventures, Inc. is the only major brand dedicated exclusively to owners and managers of growing private companies, with the aim to deliver real solutions for today's innovative company builders. It is a winner of the National Magazine Award for General Excellence in both 2014 and 2012. Total monthly audience reach for the brand has grown significantly from 2,000,000 in 2010 to more than 13,000,000 today. For more information, visit www.inc.com .\nThe Inc. 500|5000 is a list of the fastest-growing private companies in the nation. Started in 1982, this prestigious list of the nation's most successful private companies has become the hallmark of entrepreneurial success. The Inc. 5000 Conference & Awards Ceremony is an annual event that celebrates their remarkable achievements. The event also offers informative workshops, celebrated keynote speakers and evening functions.\nMedia Contact:\nLaura Wards\nGlobal Marketing Communications Director\nWorldVentures Holdings\n(972) 805-5154\nEmail: press@worldventures.com\nLogo - http://photos.prnewswire.com/prnh/20150528/219300LOGO\n releases/worldventures-once-again-recognized-as-an-inc-5000-fastest-growing-private-company-300130341.html\n ", "external_links": ["http://www.worldventures.com/", "http://photos.prnewswire.com/prnh/20150528/219300LOGO", "http://www.inc.com/inc5000", "http://www.inc.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA82391&Transmission_Id=201508181824PR_NEWS_USPR_____DA82391&DateId=20150818", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnvar/20150528/219300LOGO", "http://www.prnewswire.com/news-releases/worldventures-once-again-recognized-as-an-inc-5000-fastest-growing-private-company-300130341.html"], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-19T01:46:59.189+03:00", "highlightTitle": ""}