{"organizations": [], "uuid": "50f6b44f2f3e6f9dad1a61c3d09d632fb88e413b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.luxurydaily.com", "main_image": "", "site_section": "http://www.luxurydaily.com/category/sectors/travel-and-hospitality/feed/rss/", "section_title": "Luxury Daily » Travel and hospitality", "url": "http://www.luxurydaily.com/mandarin-oriental-new-york-books-ensuite-programs-to-tout-redesigned-guest-rooms/", "country": "US", "title": "Mandarin Oriental, New York books ensuite programs to tout redesigned guest rooms", "performance_score": 0, "site": "luxurydaily.com", "participants_count": 1, "title_full": "Mandarin Oriental, New York books ensuite programs to tout redesigned guest rooms", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T10:45:00.000+03:00", "replies_count": 0, "uuid": "50f6b44f2f3e6f9dad1a61c3d09d632fb88e413b"}, "author": "Jen King", "url": "http://www.luxurydaily.com/mandarin-oriental-new-york-books-ensuite-programs-to-tout-redesigned-guest-rooms/", "ord_in_thread": 0, "title": "Mandarin Oriental, New York books ensuite programs to tout redesigned guest rooms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 19, 2015 Mandarin Oriental New York view \nThe Mandarin Oriental hotel in New York has updated its guest suites to further enforce its dedication to exclusivity and service. \nMandarin Oriental, New York, a five-star hotel, recently announced that it has restyled 42 of its one- and two-bedroom suites that offer guests panoramic views of Central Park, the Hudson River and the city’s skyline. Frequent updates in guest room style helps a hotel remain modern in its approach to hospitality and service. \n“ With these suites, we have the opportunity to present our guests with a new vantage point from which to discover New York so it is as if they are seeing and experiencing the city for the first time, each and every time,” said Lisa Caruso, director of communications at Mandarin Oriental , New York. \n“We pride ourselves in delivering a personalized and unique experience for all of our guests,” she said. “It is the large attention paid to smaller details that creates a memorable stay for our guests and keep them returning to the property. \n“We believe that through distinctive amenities and programming such as the Bedside Reading Program by Altuzarra, Rodarte New York City Guide , En Suite Meditation Program and Suite Cocktail Program , the Mandarin Oriental journey will transcend other hotel stays our guests have experienced.” \nFashionable stays To properly announce its redecorated suites, Mandarin Oriental has developed exclusive experiences and fashion partnerships to enrich the new in-room experiences. Through partnerships that combine elements of art, culture, fashion and gastronomy Mandarin Oriental’s new suites are enhanced. \nThe 42 suites were redesigned by architecture firm HOK, which selected three themes reflective of a day in New York. Themes include the Sunrise-themed Central Park View Suite, the Dusk-themed Hudson River View Suite and the New York Nights-themed Premier Central Park View Suite and the two-bedroom Central Park West Suite. \nArtwork further reflects these themes with pieces curated by Rare Culture, an art marketplace that has created a gallery-like feel within Mandarin Oriental’s suites. Art seen in the guest rooms was created by New York-based and New York-inspired artists such as Steve Wasterval, Per Johansson and Emmanuel Frangeul AKA Blew. \nMandarin Oriental, New York’s sunrise-themed Central Park View Suite \nWhile hotels offer a plethora of activities within the property, including dining options, spa treatments and off-site excursions, Mandarin Oriental, New York has developed an en suite events program to keep guests content within their newly styled rooms. \nFor example, the Spa at Mandarin Oriental, New York is hosting private, in-room meditation and heat experiences that create an “oasis of calm high above Manhattan.” Guests can request a plush DharmaCrafts meditation cushion to use during the one-on-one guided experience. \nThe meditative activity can be continued in the spa itself where guests can enjoy oxygen-infused vitality pools, amethyst crystal steam rooms and experience showers. \nFor guests looking to enjoy a cocktail in the privacy of their guest room, Mandarin Oriental, New York has created the Suite Cocktail program that re-imagines welcome amenities and signature drinks. Upon arrival in their room after check-in, the guest will receive a treat and house-made beverage inspired by that suite’s theme. \nThe program is further extended with an invitation to the MObar for a bespoke cocktail. For example, the Night cocktail, signature to the Premier Central Park View Suite and the Two Bedroom Central Park West Suite, is made with homemade honey ginger syrup, lemon juice, Glenfiddich 12 Year Old Whisky and candied ginger. \nMandarin Oriental, New York’s MObar \nFor those who plan to spend time outside the hotel’s rooms and amenities, Mandarin Oriental is helping plot out activities around New York through its bedside reading program featuring City Guides curated by fashion designers Kate and Laura Mulleavy. \nThe Mulleavy sisters own the clothing and accessory brand Rodarte and have compiled a guide with Mandarin Oriental that provides visualization to the duo’s New York experiences. Famous landmarks along with more personal locations will offer guests a unique look into the city, and the guide will double as a piece of art for guests to bring home after their stay ( see story ). \nMandarin Oriental New York’s promotion for the Rodarte New York City Guide \nBedside reading will also include a selection of New York-based fashion designer Joseph Altuzarra’s favorite books that have served as the inspiration behind his ready-to-wear designs for Altuzarra. Titles include The Line of Beauty by Alan Hollinghurst and In Search of Lost Time by Proust, with all books featured in the room available to take home when the guest checks out. \n“Typically, hotels focus their experiential offerings outside of the room itself, both on and off property,” said Taylor Rains, managing partner of Flugel Consulting , Charleston, SC. “In this case, however, the room itself has become a part of the overall experience. \n“Mandarin Oriental has designed suites that offer guests a unique way to experience some of what New York is known for – art, culture and fine cuisine,” he said. “Bringing these New York elements into the room itself, and keeping guests on property, is a great way for the brand to manage all aspects of the experience. I don’t think it will keep guests from stepping out to explore the city on their own, but instead supplement their individual experience with something catered to their interest.” \nSharing experiences Guests who enjoy the programs celebrating the Mandarin Oriental, New York’s new suites are encouraged to use the hashtag #MOSuiteLife on social media. \nAlso, Mandarin Oriental Hotel Group has creating its own social channel with user-generated content that encourages guests to share their experiences. \nThe channel hosts a space for both the celebrity fans and guests to post images and descriptions of experiences to share with other fans. “Fans of MO” offers the hotel brand an opportunity to learn its guests’ favorite aspects of staying at its properties and be able to duplicate those experiences for others ( see story ). \n“New York is an experience-driven city,” Mr. Rains said. “Visitors know what they want to get out of a trip but don’t necessarily know how to go about finding it. \n“By curating the stay in such a way, Mandarin Oriental is ensuring that guests experience the New York they were hoping for, making it an attractive offer for the hotel,” he said. “Keeping the experience on-property and in-room strengthens the guest’s relationship with the hotel itself. In other words, the guests New York experience will be indelibly linked to the property that fostered it, in this case, Mandarin Oriental. When well executed, that sort of program is hugely beneficial to the establishment of guest loyalty.” \nFinal Take Jen King, lead reporter on Luxury Daily, New York Jen King is a lead reporter on Luxury Daily. Her beats are consumer electronics, consumer packaged goods, food and beverage, fragrance and personal care, jewelry, media/publishing, software and technology and telecommunications. Reach her at jen@napean.com.", "external_links": [], "published": "2015-08-19T10:45:00.000+03:00", "crawled": "2015-08-19T12:00:04.823+03:00", "highlightTitle": ""}