{"organizations": [], "uuid": "bc39f3b3a465cb392fd717b4ff08429b7de71de4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02676/minstry_2676943a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/finance/newsbysector/retailandconsumer/leisure/11794792/Why-are-Britains-nightclubs-in-such-a-desperate-situation.html", "country": "US", "title": "Why are Britain's nightclubs in such a desperate situation?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 3, "title_full": "Why are Britain's nightclubs in such a desperate situation? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T02:40:00.000+03:00", "replies_count": 3, "uuid": "176cb0377f497d185ef3b11c39f11782b2e831df"}, "author": "Elizabeth Anderson", "url": "http://www.telegraph.co.uk/finance/newsbysector/retailandconsumer/leisure/11794792/Why-are-Britains-nightclubs-in-such-a-desperate-situation.html#post-0", "ord_in_thread": 0, "title": "Why are Britain's nightclubs in such a desperate situation?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The music has stopped for almost half of Britain’s nightclubs over the last decade - and for many of the rest it’s beating a weary rhythm. Hit by tighter bureaucracy, the smoking ban, the effects of the financial crisis and a fall in alcohol consumption, Britain’s nightclubs have almost halved from 3,144 in 2005 to 1,733 in 2015. Lifestyle changes have played their part, but the industry is also being “suffocated” by overly restrictive planning laws and tax levies, says the Association of Licensed Multiple Retailers (ALMR), the industry body that represents clubs as well as thousands of other hospitality operators across the UK. “There’s a real shift in the country’s attitude to nightclubs. Councils are discriminating against young people and we’re in a terrible situation,” says Raymond Stevenson, who has spent decades organising club nights across the world. The Arches, a popular club in Glasgow, recently went into administration after having its opening hours scaled back In the past year, a string of well-known venues have closed their doors. Among them were Soho haunt Madame JoJo’s which had its licence permanently revoked in December after 50 years of trading under its current name. The Arches, a popular venue in Glasgow, went into administration two months ago after the city’s licensing board brought forward its closing time from 3am to midnight, causing revenue to halve. “Nightclubs are there to support the music and artists. They need to be vibrant and forever changing. Look at iconic places like Ministry Of Sound – even that’s under pressure because flats are being built nearby,” adds Stevenson, who previously owned South London-based nightclub Imperial Gardens. His venue was forced to close more than a decade ago after the local council gave permission for a block of flats to be built on the doorstep. Total revenue for the nightclub industry has declined by almost 25pc since the start of 2011 to £2bn this year, according to research firm IBISWorld. It is forecast to fall by another 3.2pc next year. Fighting against noise complaints, tired neighbours and strict planning laws have apparently led many owners to think it’s no longer worth the effort. Late licences are routinely met with opposition, say people in the industry, and pubs and clubs are disproportionately blamed for anti-social behaviour. Nightclubs are unfairly blamed for binge drinkers, say club operators Photo: REX/London News Pictures Alan Miller, who used to own Brick Lane’s Vibe Bar, which closed after 20 years last November, adds nightclub owners are often trapped in a vicious circle. Clubs breathe life and help regenerate rundown areas, but as more businesses then move in, clubs find themselves squeezed out. “Hackney used to have enormous problems, and nightclubs helped transform it into the fashionable destination it’s become. But now the local authority are punitive towards nightclubs and bars. They’re associated with anti-social behaviour, when in fact they create economic growth and employ huge numbers of young people.” Other factors have contributed to Britain’s flagging nightclub industry. Alcohol consumption in the UK has fallen, while the smoking ban and heavy taxes on alcohol have also taken their toll. At the same time, there are many other venues competing with clubs to attract revellers looking for a more sober night-time activity, from late-night exhibitions to immersive cinema experiences . The recent introduction of blanket breathalyser tests for clubbers in Birmingham, Croydon and Shrewsbury are also putting people off, further contributing to a fall in reputation of venues in those areas, says the ALMR. Other rules, such as a ban on football shirts being worn in some clubs, also send a subliminal message to punters that trouble is expected. Young revellers are now enjoying more sober experiences Photo: Matt Badenoch Photography Nightclubs are generally seen as a blight on developing areas, says Euan Johnston, who has owned a number clubs. These included SE1, Cable and Crucifix Lane, which were all based in the arches of London Bridge and forced to close when landlord Network Rail took possession of them for the station’s redevelopment. He has moved further towards the centre of the capital, recently opening The Steel Yard, a club with an electro focus, in the City of London. But even now he suspects he could be on borrowed time. The club is situated under the railway arches of Cannon Street Station. “Club owners should always take the view that their licence is under review, even if they have had no approach. At the first opportunity to shut these places down, the authorities are prepared to do it.” • Relief for Britain's troubled pubs as younger landlords take charge However, despite the bureaucratic troubles that come with clubbing, Johnston believes there is still a place for them in Britain. “Our industry is on it knees. But I refuse to believe that kids have stopped wanting to go clubbing – and even if they have, there are many in their 30s and 40s who are ready to carry on.” telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-08-11T02:40:00.000+03:00", "crawled": "2015-08-10T21:18:44.273+03:00", "highlightTitle": ""}