{"organizations": [], "uuid": "3f77a4c2f2d00c923d9a9c35957664d44a5d5fa0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/08/09/travel/09ALASKA1SUB/09ALASKA1SUB-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT &gt; Travel", "url": "http://www.nytimes.com/2015/08/09/travel/alaska-brown-bears-katmai-national-park.html", "country": "US", "title": "At Katmai National Park in Alaska, Bears Rule", "performance_score": 10, "site": "nytimes.com", "participants_count": 1, "title_full": "At Katmai National Park in Alaska, Bears Rule - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T16:09:00.000+03:00", "replies_count": 0, "uuid": "3f77a4c2f2d00c923d9a9c35957664d44a5d5fa0"}, "author": "Jenna Schnuer", "url": "http://www.nytimes.com/2015/08/09/travel/alaska-brown-bears-katmai-national-park.html", "ord_in_thread": 0, "title": "At Katmai National Park in Alaska, Bears Rule", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Katmai National Park sprawls over four million acres in southern Alaska . So why does its only established campground allow for just 60 people per night — a limit that leads to an online booking fray every January? The answer is also one of the park’s main draws, and its primary claim to national fame: bears. Lots of them — about 2,200 at the National Park Service’s last count, with 60 or so regulars that hang around Brooks Camp every summer. In theory, you can camp elsewhere in Katmai , but the campground has an electric fence and constant activity, making it an unlikely place to find a bear too close to your tent for sleeping comfort.\nBy last spring, just about a year into my life as a full-time Alaskan, I had designs on spending time at Brooks Camp, long considered one of the state’s premier bear-viewing spots. Campground spots for July — peak season for viewing brown bears fishing, establishing hierarchy and practicing their version of flirting (the boys can be such pests) — can be reserved as of Jan. 5 every year, and go quickly. So by early May, having missed my window, I had long given up on making it, figuring I would have to spend another season watching the bears via webcams.\nContinue reading the main story Video Bears Feeding at Katmai National Park Explore.org’s cameras captured bears fishing for salmon at Katmai National Park in Alaska.\nBy EXPLORE.ORG on Publish Date August 5, 2015. Streaming since July 2012, Katmai’s webcams, set up by Explore.org, (there are four trained on brown bear fishing areas) have turned the local bears into social media celebrities and, for their most loyal followers, the biggest incentives to board a floatplane to Brooks, where dozens of bears return each summer to bulk up on salmon in the Brooks River. (Bulk is the operative word; by November, when the bears start turning in for their long winter’s naps, the males can weigh 1,000 pounds or more.)\nMy Facebook feed had been lighting up with bear news for weeks — friends across the country all playing a seasonal parlor game trying to figure out if bear 32, a.k.a. Chunk, had improved his fishing skills or if bear 814, a.k.a. Lurch, was going to calm down this year, or if he would continue to intimidate other bears out of their prized fishing spots. The live streams had interrupted more than a few of my own work hours, too.\nWhile on a spring camping trip in Denali National Park, an acquaintance casually presented a near-miraculous offer: “I reserved a camping spot for two people at Brooks Camp in July but can’t use it. You want it? I think it was about $50.” I recruited my Anchorage-born friend Tara Stevens, an experienced angler, and we were off. The virtual experience, I hoped, would soon be real.\nAdvertisement\nContinue reading the main story After an Alaska Airlines flight from Anchorage to the town of King Salmon, we collected our bags stuffed with layers of clothing, rain gear, camping and cooking gear, and food, and headed to the Katmai Air Service office for the flight to Brooks Camp, which sits at the confluence of Naknek Lake and the Brooks River. After weighing in for the flight — when traveling by floatplane in Alaska, you get used to people telling you to hop on a scale — we were soon climbing skyward in a blue and white 1962 de Havilland Otter, its single engine drowning out any conversation.\nThick clouds hung overhead and even the grassy areas below looked slightly gray. Color broke through now and again — bright green roofs on a small group of buildings below, a pale aqua river threading through the glum landscape.\nTwenty minutes later, we descended onto Naknek Lake, the plane bumping along on its floats toward the driftwood-strewn beach and the Brooks Camp employees waiting there. (Brooks Camp also has cabins run by a park concessionaire, Katmailand ; they’re spare and pricey but a good option for the camping-averse.) Everybody on the plane, which holds 10 passengers, was a bit giddy as we rolled toward the start of the summer adventure, like the first moments arriving at sleep-away camp.\nPhoto Visitors arriving from the town of King Salmon via floatplane. Credit Mark Meyer for The New York Times We were directed to the visitors’ center for the “Brooks Camp School of Bear Etiquette,” meant to keep visitors and the bears coexisting peacefully. Orientation started with a 10-minute film. The clothing and hairstyles were delightfully out of date, but the how-to’s still applied: Keep 50 yards from any bear; 100 yards from a bear with cubs. Move back as a bear moves closer. When hiking, stay alert and make sounds — talking and clapping — so bears know you’re there. If a bear gets too close, don’t run — it may think you’re prey. Speak to the bear in a firm but calm voice. Then start to walk back slowly. Give the bear the right of way.\nAfter the film, a ranger rehashed some of the key points, gave us lapel pins that indicated we had been through bear school, and sent us on our way.\nWe loaded our gear onto a wheeled cart and headed down the trail toward the campground. Though it was about a third of a mile from the visitors’ center, that first walk seemed quite a bit longer. Thick woods were on the left and, on our right, a thinnish strip of trees blocking our view of the beach, where, it had been made clear, bears loved to wander.\n“How has nobody been mauled here?” Tara asked. We kept a slightly-louder-than-normal rambling conversation going. There might have been singing.\nAdvertisement\nContinue reading the main story Soon enough we rolled the cart through the campground’s electric fence, which didn’t look as if it could keep out a kitten. It was tempting to touch the fence, but I decided to trust the park service and stayed shock free.\nThe tent up, we headed back down the trail to grab dinner at the lodge.\nBut before long: “Bear in camp! Bear in camp!”\nA ranger’s shout went up outside the lodge, warning people to stay or get inside. The dining room tables emptied as people ran to the windows. Two brown bears, their long claws in clear view, loped through the camp, did a few circles just feet from the lodge porch, and ran back off. I had spent plenty of time in bear country before, but the pair’s romp made it so much clearer that we were playing in the bears’ world. I got ever that much giddier about spending two nights exploring the area.\nThe walk to the viewing platform at Brooks Falls crosses a wood bridge over the Brooks River. With plenty of daylight to go, the river remained peppered with wader-clad fishermen casting lines. A bear lazed on the ground in the near distance. I wondered if I would have the nerve to share the river with the animals.\nThe 1.2-mile Brooks Falls Trail cuts through a forest of spruce and birch trees and a seemingly endless array of green mosses and colorful lichens. Along the way, I exchanged hellos with day-trippers scuttling back down the trail in time to make their flight out. As the floatplanes left, Brooks Camp started to feel more remote, less connected to the busy summer tourist season.\nAdvertisement\nContinue reading the main story The bears, of course, don’t clear out. We walked up the boardwalk trail, passing through several bear-proof gates, to the falls, the best known of the viewing sites. We found several bears not caring a bit that a few dozen people were watching their every move from the platform, with thousands more eyeballing them via webcam.\nContinue reading the main story Brooks Falls Time Lapse Brown Bear Feeding Frenzy Video by EXPLORE.org Films Bear viewing never gets boring: watching the huge beasts lunge (often unsuccessfully) for a salmon; or, in the “hot tub” section of the falls, watching one bear just hang out with the water swirling around, that same satisfied look on its face that dogs get when napping in the sun.\nThe remaining onlookers cheered when bears caught a fish and even when a salmon finally made the big leap up the falls. It took serious effort. Bear 747, known for his red-tinged shoulders, the bald patch on his forehead and his short muzzle, soon showed up; he ran the hot-tubber off, chased a few others from fishing spots and took control.\nAdvertisement\nContinue reading the main story On the way back to camp, we were mostly on our own. When the last of the day-trippers clears out, the rangers give up their posts on the trail, leaving those staying in Brooks’s cabins and at the campground to put their bear etiquette training to work. But walking down bear-laden trails makes fast friends of people. We teamed up with others, fanned out now and again to make sure we knew if anything was coming from any and every direction and, again, chattered incessantly.\nPhoto The viewing platform at Brooks Falls, from which the animals’ natural behavior can be observed. Credit Mark Meyer for The New York Times The next day, after a day trip into the Valley of 10,000 Smokes, a dramatic ash- and pumice-filled gorge, we headed back up to the viewing platforms. That’s where I met my first superfan, Pat Nelson of Jackson, Mo., who kept the livestream of the webcams going while watching TV at home. She had big news to share: Ted was back. “With the scar there. That’s Ted. He’s an older bear,” she said. “People were worried he didn’t make it through the winter.”\nA light rain was falling. One man was wearing a Mickey Mouse poncho to ward off the wet. That’s when I realized I had to separate myself from the less adventurous. We had to go fishing.\nWe met up with our fishing guide, Zacari Pacaldo, the next morning. He had been working at Brooks Camp for three summers. He was torn between his love of music — he was heading off to music school in the fall — and his love of fishing.\nAfter we suited up in waders, we followed Zacari through brush and up and down small embankments until, finally, he led us into the river. For an hour we fished (well, Tara did, while I did a sort of uncoordinated attempt). And then … there he was, a brown bear, heading our way.\nMy heart, I’ll admit, raced. Zacari stepped forward, a can of bear spray in hand, the two of us behind him. We pulled in our lines and slowly backed away from the bear’s path. He walked up onto a small patch of land that was in front of us midriver and then strolled back into the water heading downstream, never even looking our way. I was good with that. You don’t really want a bear to look. (Though, of course, I did make sure Zacari took a photo of me with the bear.)\nWith the fishing and bear-sighting behind us, we packed up our campsite and rolled our belongings back down the trail. We boarded the floatplane out with five members of a tour group. One woman, wearing a sweatshirt with her name bedazzled on it, was debriefing her group on all they’d seen. “That female that hunts like a male …” she began. I had a feeling she was practicing the speech she would give her webcam-watching pals, hopefully urging them all to hop offline and go the following summer.\nContinue reading the main story Brooks Falls - Katmai National Park, Alaska powered by EXPLORE.org Video by Explore.org, via YouTube Advertisement\nContinue reading the main story Advertisement\nContinue reading the main story How Extreme? Rankings are from 1 (not at all) to 4 (very).\nRemoteness: 3\nKatmai National Park, including Brooks Camp, is accessible only by air or boat. To get to Brooks from Anchorage, connect through King Salmon, Alaska, a one-hour flight on Alaska Airlines or PenAir. From King Salmon, it’s a 20-minute floatplane flight to Brooks Camp. Air taxis to Brooks Camp are also available from Homer and Kodiak.\nCreature Discomforts: 2\nFans of camping will think the campsite comfortable. Don’t know much about camping? Rent gear in Anchorage. Because of the bears, all cooking must be done in the cooking area. Buy fuel at the camp store or check the bottom shelf of the fuel cabinet, where there might be leftovers. If you’d rather not carry food and kitchen gear, you can buy meals at the lodge.\nPhysical Difficulty: 2\nThe walk to Brooks Falls is an easy 1.2 miles, and it’s wheelchair accessible. Though the hike down and, more so, back up out of the Valley of 10,000 Smokes had its exhausting moments, you can take it slow and steady.", "external_links": ["http://static01.nyt.com/images/2015/08/09/travel/09ALASKA3/09ALASKA3-superJumbo.jpg", "http://explore.org/live-cams/player/brown-bear-salmon-cam-brooks-falls", "http://static01.nyt.com/images/2015/08/09/travel/09ALASKA3/09ALASKA3-articleLarge.jpg", "http://www.katmailand.com/", "http://static01.nyt.com/images/2015/08/09/travel/09ALASKA2SUB/09ALASKA2SUB-articleLarge.jpg", "http://www.nps.gov/katm/index.htm", "http://static01.nyt.com/images/2015/08/09/travel/09ALASKA2SUB/09ALASKA2SUB-superJumbo.jpg"], "published": "2015-08-06T16:09:00.000+03:00", "crawled": "2015-08-06T16:21:38.227+03:00", "highlightTitle": ""}