{"organizations": [], "uuid": "e3dd74729ac4a727f8575a897915da59e9156234", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55d4b1bf14000077002e35d1.jpeg?cache=8qZSfDcmbS", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/news.xml", "section_title": "Travel News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/vacation-for-everyone-paris_55d4b0fee4b07addcb44f714", "country": "US", "title": "Thousands Of Kids In Need Get Special Summer Trip To Paris", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Thousands Of Kids In Need Get Special Summer Trip To Paris", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T20:31:00.000+03:00", "replies_count": 0, "uuid": "e3dd74729ac4a727f8575a897915da59e9156234"}, "author": "Sally Lauckner", "url": "http://www.huffingtonpost.com/entry/vacation-for-everyone-paris_55d4b0fee4b07addcb44f714", "ord_in_thread": 0, "title": "Thousands Of Kids In Need Get Special Summer Trip To Paris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thousands Of Kids In Need Get Special Summer Trip To Paris By Maggy Donaldson Posted: 08/19/2015 01:31 PM EDT \nPARIS (AP) — Paris takes in billions of euros each year from tourists, but the international vacation destination welcomed thousands of special visitors Wednesday with a spirit of giving. \nThe French charity Secours Populaire brought children from dozens of different countries — including those living through war, poverty or natural disasters — to join kids from France for a day of summer fun, allowing even those with limited means to take a vacation at the height of the French holiday season. Francois Mori/ Associated Press Children wave during a live music concert, the Vacation for Everyone day event, at the Eiffel Tower in Paris, France, Wednesday Aug. 19, 2015. \nThousands of children fanned out around Paris for a treasure hunt, while others played in the shadow of the Eiffel Tower or took boat tours on the Seine. They arrived in Paris on Wednesday after spending several weeks at summer camps scattered throughout France. Both the Paris event and the camps were paid for by the charity. \nThe association's head of international cooperation Corinne Makowski said the event aims to help some temporarily escape injustices and troubles that make taking holiday time off impossible. \nAmrla Shoufi attended the event with a delegation from civil war-torn Syria, his last full day in France before he returns to his home city Sweida near the Jordanian border. The 17-year-old said the ten days of painting, climbing, swimming and sightseeing were a welcome relief from the dangers of his home country. \"It's great to have a chance to get peace when you are at war,\" he said. Francois Mori/ Associated Press Mohamed from Algeria paints a multicolored model of the Eiffel Tower during the Vacation for Everyone day event at the Eiffel Tower in Paris, France. \nApproximately 10,000 French adult volunteers helped facilitate the event. \nNext to a concert stage, 10-year-old Chris Delaroux from the eastern French city Metz painted a multicolor model of the Eiffel Tower, drawing inspiration as he sat in front of the iconic Paris monument. The event capped his two weeks at a camp where he said he played and created memories with children from all over the world, and learned to embrace similarities rather than focus on differences. \n\"We are all the same,\" he said.  The Many Moods of the Eiffel Tower of", "external_links": [], "published": "2015-08-19T20:31:00.000+03:00", "crawled": "2015-08-19T20:41:57.525+03:00", "highlightTitle": ""}