{"organizations": [], "uuid": "e5b3420ced0c9dbd5bf10527b168ce3342141566", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/image0081.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tata-starbucks-hosts-first-coffee-championship-in-india/", "country": "US", "title": "Tata Starbucks hosts first Coffee Championship in IndiaTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Tata Starbucks hosts first Coffee Championship in IndiaTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "e5b3420ced0c9dbd5bf10527b168ce3342141566"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tata-starbucks-hosts-first-coffee-championship-in-india/", "ord_in_thread": 0, "title": "Tata Starbucks hosts first Coffee Championship in IndiaTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tata Starbucks hosts first Coffee Championship in India Published on : Friday, August 28, 2015\nTata Starbucks Pvt. Ltd. hosted the grand finale of the first Starbucks Coffee Championship in India, giving its partners an opportunity to compete with each other on their expertise and knowledge of coffee along with the accuracy of their beverage crafting skills. After many competitive regional rounds testing their coffee skills and acumen, Saili Rane from Starbucks store at Mumbai Domestic Airport earned the title of the ‘Starbucks Coffee Champion’. Rubeena Qureshi from Starbucks at Bandra, Mumbai and Shikhar Hali from Starbucks at Mantri Mall, Bangalore were announced as the runner ups.\nThe Championship’s Grand Finale in Mumbai was held amidst a panel of prominent judges comprising of the Tata Starbucks leadership team as well as senior Starbucks Leadership from CAP region. During the finale; partners competed in four exciting and challenging rounds which comprised of a Personal Coffee Tasting – Pour Over session in which they demonstrated both their knowledge & passion for coffee in an interactive coffee tasting, a Bar Skill round which tested their Beverage Artistry skills and the ultimate Blind Tasting Round to test the accuracy of their coffee palate. The last round was an elaborate Question & Answer round in which the six Coffee Masters were judged on the basis of their proposed presentations to elevate coffee leadership in their markets.\nThe Starbucks Coffee Championship unfolded with three competitive levels and saw an overwhelming participation from 150 Starbucks partners and Coffee Masters. These coffee experts were nominated from each of the six cities in India where Starbucks is present. The participants competed at the district level wherein only 22 contenders were chosen to proceed to the Regional Semi-Final round based on their Coffee knowledge and Bar skills. Ultimately, six of the most outstanding and knowledgeable partners were picked to battle it out for the ‘Starbucks Coffee Champion’ title at the national Grand Finale in Mumbai. The winners of the India Championship will participate in the Starbucks Regional Championship to be held later this year in South East Asia.\nCommenting on the occasion, Avani Davda, CEO Tata Starbucks Pvt Ltd said, “We’re thrilled to host the first Starbucks Coffee Championship in India. Our partners directly contribute to the success of Starbucks by helping us build the brand one cup, one person at a time, in every neighborhood we serve. The Starbucks Coffee Championship is a celebration of our unique store partners and their passion and commitment to the brand as well as their coffee artistry”.\nTata Starbucks Private Ltd\nTata Starbucks Private Limited, the 50/50 joint venture between Starbucks Coffee Company and Tata Global Beverages Limited, entered the Indian market in October 2012 and currently operates 76 Starbucks stores in India across Mumbai, Delhi NCR, Pune, Bengaluru, Hyderabad and Chennai, through a network of 1200 passionate partners.", "external_links": [], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-29T12:19:00.344+03:00", "highlightTitle": ""}