{"organizations": [], "uuid": "b48c43bf8009c727f0fa17de2d7fb04640f38ce3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.futuretravelexperience.com", "main_image": "http://www.futuretravelexperience.com/wp-content/uploads/2015/08/NL040815-bae-systems.jpg", "site_section": "http://www.futuretravelexperience.com/feed/", "section_title": "Future Travel Experience", "url": "http://www.futuretravelexperience.com/2015/08/airline-provided-ife-demand-streaming-can-go-hand-hand/", "country": "GB", "title": "Airline-provided IFE and on-demand online streaming can go ‘hand in hand’", "performance_score": 0, "site": "futuretravelexperience.com", "participants_count": 1, "title_full": "Airline-provided IFE and on-demand online streaming can go ‘hand in hand’", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T14:23:00.000+03:00", "replies_count": 0, "uuid": "b48c43bf8009c727f0fa17de2d7fb04640f38ce3"}, "author": "Ryan Ghee", "url": "http://www.futuretravelexperience.com/2015/08/airline-provided-ife-demand-streaming-can-go-hand-hand/", "ord_in_thread": 0, "title": "Airline-provided IFE and on-demand online streaming can go ‘hand in hand’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Ryan Ghee BAE Systems’ Jared Shoemaker (right), pictured here speaking to FTE Editor Ryan Ghee in April 2015, said this week that his main focus is on “getting our first STC under our belt and then moving more meaningfully into the market”. \nA little over three months since announcing Indian airline Vistara as the launch customer for its IntelliCabin in-flight entertainment (IFE) system, BAE Systems is working towards gaining the Supplemental Type Certificate (STC) that will enable the installation of the full wireless IFE streaming solution. In the meantime, Vistara’s passengers are making use of Samsung Galaxy Tab S tablets pre-loaded with content. \nAs this work goes on – “the STC process is typically a four to eight month process” – Jared Shoemaker, Director, Cabin Programs, and his colleagues are keeping a close eye on other developments in the fast-moving IFE market. “What we’re seeing is our industry head in a direction in which airlines have more choice than they’ve ever had before, which from our customers’ perspective is fantastic and from a passenger’s perspective is very good. What that’s started driving is an increased pace of innovation. Providers such as BAE Systems are going to be driven to innovate at a much faster pace than we have in the past, firstly because of the competition, and secondly because of the wireless and consumer technologies that are enabling that faster pace.” On-demand streaming ‘not a threat’ to wireless IFE \nAs FTE reported last month , new IFE models such as pre-flight downloads are gaining traction among some carriers and high-speed onboard connectivity is now enabling passengers to stream movies from the likes of Netflix and Amazon Prime at 30,000 feet. Referring to the latter – in-flight streaming – Shoemaker told FTE “I don’t view that as a threat” to the BAE Systems type model, which will provide in-flight wireless streaming of airline-hosted content to passengers’ personal electronic devices (PEDs) once the STC has been issued. Instead, the solutions can complement one another, he stated. \n“I believe that’s a natural progression of where the industry’s going to go,” he said, and suggested that both models can exist side by side. “With the scheduled launches of satellites over the next couple of years you’re going to see bandwidth explode globally and more airlines and providers pushing the fact that they can offer these sorts of streaming services online. I view these wireless onboard solutions as a natural fit where potentially you’re looking at the early window content and some localised content that you have on the device or the system on the aircraft; that naturally goes hand in hand with what a passenger can stream from such a service.” \nTalking of early window content, Shoemaker said BAE Systems is currently seeking the necessary approvals to offer such content on its Samsung tablets. An announcement on this front could be just weeks away, he hinted. Semi-embedded IFE \nTo meet the security requirements of the Hollywood studios, early window content can only be viewed on airline-owned tablets, not on passengers’ personal devices. With this in mind, some see semi-embedded IFE – whereby consumer tablets are integrated into the seatback – as another potential differentiator, especially given the added flexibility and cost savings such a solution could offer to airlines. While some suppliers have already created concepts, Shoemaker isn’t convinced that the associated Head Injury Criterion (HIC) testing can be satisfied. “It is a really big hurdle,” he said. “It’s clearly something we’re interested in looking at…but we don’t believe that anybody can commit to it today because of what must be overcome in order to pass the necessary certification tests.” \nIt’s not necessarily a question of when tablet/seatback integration will happen, he said, but “if it ever happens at all”. “I really want it to happen,” he continued, “but there’s a lot of work to be done and there’s a good probability that it can’t work. The material science isn’t there at the moment to have a solution that passes all the necessary criteria.” \nShoemaker isn’t overly concerned about these hurdles right now, though. His main focus is on “getting our first STC under our belt and then moving more meaningfully into the market”. Don't miss the next two   events in Las Vegas and Singapore! See also...", "external_links": [], "published": "2015-08-04T14:23:00.000+03:00", "crawled": "2015-08-04T16:11:08.344+03:00", "highlightTitle": ""}