{"organizations": [], "uuid": "ace3334468794e0d794525cc276ebd1ca034cb95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29891029/nyx-gaming-group-limited-reports-second-quarter-financial-results", "country": "US", "title": "NYX Gaming Group Limited Reports Second Quarter Financial Results", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "NYX Gaming Group Limited Reports Second Quarter Financial Results - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "ace3334468794e0d794525cc276ebd1ca034cb95"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29891029/nyx-gaming-group-limited-reports-second-quarter-financial-results", "ord_in_thread": 0, "title": "NYX Gaming Group Limited Reports Second Quarter Financial Results", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " NYX Gaming Group Ltd.\nRecord Revenue for the quarter of $10.7 million up 44.5%\nLAS VEGAS, NV , Aug. 27, 2015 /PRNewswire/ - NYX Gaming Group Limited (TSXV:NYX) (\"NYX Gaming Group\" or \"Company\") today announced its financial and operating results for the second quarter June 30, 2015 . All amounts expressed are in Canadian dollars unless otherwise noted.\n\"I'm pleased to announce that Q2 was a very strong quarter for NYX, as we closed the purchase of Game360 and the buyout of our joint venture partner, Sportech, in New Jersey. This quarter, we have generated record revenues in our core business driven by the strong organic performance of our gaming products and are well advanced in our realization of meaningful cost synergies from our recent acquisition of Chartwell and CryptoLogic.\" said CEO Matthew Davey .\nSecond Quarter Three Month 2015 Highlights\nRevenue of $10.7 million 44.5% growth year-over year growth; Revenue excluding acquisitions of $9.8 million or 32.0% year-over year growth; Royalty and License Revenue excluding acquisitions of $8 million or 38% growth; Gross Profit of $9.1 million ; Adjusted EBITDA of $(0.6) million including the results of Ongame and $2.5 million excluding Ongame; Adjusted Net Income of $1.5 million excluding $3.3 million in losses from Ongame and the $17.4 million gain of the buyout of the Sportech joint venture and acquisition charges of $1.7 million ; Basic and diluted income per share of $0.41 and $0.31 and $0.26 and $0.20 for the three and six month period; Adjusted basic and diluted income (loss) per share of $0.04 and $0.03 and ($0.01) and nil for the three and six month period, when excluding Ongame,the purchase of the Sportech joint venture, and acquisition and restructuring charges; Signed 12 new contracts and launched 9 new customers during the quarter; Revenue pipeline includes 28 signed contracts in various stages of development Subject to shareholder approval, the Board of Directors approved the Normal Course Issuer Bid (\"NCIB\") to purchase up to 5% of NYX's common shares; Subsequent events to quarter-end: On July 31, 2015 the company announced that has completed its previously announced acquisition (the \"Acquisition\" ) of the entire issued share capital of Amaya ( Alberta ) Inc., formerly Chartwell Technology Inc. ( \"Chartwell\" ) and CryptoLogic Limited (\" CryptoLogic \") for an initial purchase price consisting of $110 million in cash, subject to a customary working capital adjustment and the issuance of $40 million exchangeable preferred shares of a subsidiary of NYX to Amaya. NYX also entered into a preferred supplier licensing agreement with a subsidiary of Amaya to provide casino gaming content to Amaya's real-money casino offering, which will be integrated into two of the world's largest online poker rooms, Pokerstars and Full Tilt. The Acquisition increased our customer base from 130 to 170. Additionally, we are ahead of schedule with our integration and cost synergy achievements On August 7, 2015 we announced that the Company has entered into a long-term global agreement to provide online poker and casino games to planetwin365 and the SKS365 Group - one of the largest gaming operators in the Italian market, for a minimum of five years. The partnership will start with the planetwin365 site which is expected to launch on NYX Poker in Q4 2015. This will significantly enhance the network's player liquidity. Once complete, it will position NYX Poker as a top tier B2B poker platform on a global level. In addition, the Company has acquired eGaming Consulting, which previously supplied planetwin365 with their gaming operations. The current eGaming Consulting team of 14 people located in Belgrade will augment NYX's existing poker operations and lead to an overall reduction in costs for NYX as the resources are integrated. The total investment, which includes a mobile platform is €7,500,000 cash, which includes a sum of €3,375,000 that will be paid on closing. Then remainder will be paid over the following six months as clear milestones are met. The purchase price paid is based on a range of 5.5x to 7.5x 2015 estimated EBITDA and financed with cash on hand (which includes the expected revenue from the long term global agreement with planetwin365). The transaction remains subject to customary gaming regulatory approvals.\nSummary of Results\nThree Months Ended\nSix Months Ended\nIn 000's except share data\nJune 30, 2015\nJune 30, 2014\n% Change\nJune 30, 2015\nJune 30, 2014\n% Change\nRevenue\n$10,698\n$7,405\n44.5%\n$20,636\n$12,426\n66.1%\nGross Profit\n$9,091\n$6,486\n40.2%\n$17,859\n$10,760\n66.0%\nGross Margin %\n85.0%\n87.6%\n86.5%\n86.6%\nAdjusted EBITDA (1)\n($553)\n$3,027\nnm\n($1,006)\n$3,382\nnm\nNet income (loss)\n$13,868\n$1,596\n769%\n$8,835\n$498\n1,674%\nEarnings (loss) per share basic\n$0.41\n$0.08\n413%\n$0.26\n$0.02\n1,200%\nEarnings (loss) per share dilutive\n$0.31\n$0.05\n520%\n$0.20\n$0.02\n900%\n(1)\nThree and six months Adjusted EBITDA excludes share-based compensation, derivative value adjustment, gains and losses, net interest, foreign currency and acquisition and restructuring cost.\nThree Months Ended\nSix Months Ended\nIn 000's except share data\nJune 30, 2015\nJune 30, 2014\n% Change\nJune 30, 2015\nJune 30, 2014\n% Change\nAdjusted EBITDA ex Ongame (1)\n$2,447\n$3,027\n(19.2%)\n($1,006)\n$3,382\n(130.0%)\nAdjusted Net income (loss) (2)\n$1,470\n$1,596\n(8.0%)\n($211)\n$498\n(142.0%)\nAdjusted Earnings (loss) per share basic (2)\n$0.04\n$0.06\n(33.3%)\n($0.01)\n$0.02\n(150.0%)\nAdjusted Earnings (loss) per share dilutive (2)\n$0.03\n$0.05\n(40.0%)\nnil\n$0.02\nnm\n(1)\nThree and six months Adjusted EBITDA ex Ongame, excludes Ongame losses of $3.0 million, share-based compensation, derivative value adjustment, gains and losses, net interest, foreign currency and acquisition and restructuring cost.\n(2)\nThree and six months Adjusted Net income (loss) and Adjusted Earnings (loss) per share excludes Ongame losses of ($3.3) and ($6.3),, gains of $17.4 million, and $1.7 and $2.0 million of acquisition and restructuring cost.\nQ2 2015 Operating and Financial Results\nDuring Q2 2015, we signed 6 new Open Gaming System (\"OGS\") contracts and received 11 letter of intent's (\"LOIs\") from clients committed to launch OGS and NYX Open Platform System (\"OPS\") including another US contract win through Golden Nugget to be delivered in early Q3. These commitments include contracts with some of the world's largest operators, including: Nektan PLC, Full Tilt, Pala Interactive and several clients in the newly regulated Spanish market. NextGen released 13 new games during the three-month period June 30, 2015 bringing the total of 26 new releases during the six months of 2015. With the launch of 18 new clients and 26 new game releases during the first half of 2015, we saw the number of game instances across our distribution network grow by 58% from 5,454 in Q4 2014 to 8,628 in Q2 2015.\nOur recently acquired subsidiary Game360 located in Italy is now distributing content via the NYX OGS platform. As a direct result, Game360 performed strongly during Q2 through the delivery of OGS content to 9 of its existing licensees, including SISAL and Cogetech. Game360 also signed an agreement with NetBet to deliver its Game360 Betting app.\nAs of June 30, 2015 , our development pipeline remains strong as we held commitments with 28 customers that are being prepared for launch. These include 4 new customers integrating with NYX OPS Platform, 3 new NYX Poker customers and 20 OGS Platform customers plus an additional game bespoke development.\nRevenue. Revenue for the three months ended June 30, 2015 has grown to $10.7 million or 44.5% from $7.4 million for the three months ended June 30, 2014. Royalty and License revenue was the main driver of growth as revenues increased $3.0 million for the three months ended June 30, 2015 to $8.9 million .\nRevenue for the six months ended June 30, 2015 has grown to $20.6 million or 66.1% from $12.4 million for the six months ended June 30, 2014. Royalty and License revenue was the main driver of growth as revenues increased $8.2 million for the six months ended June 30, 2015 to $16.9 million . The growth was attributable to the addition of new customers, growth from existing customers, and revenue from the acquisition of Ongame.\nGross Profit. Gross profit increased by $2.6 million and $7.1 million for the three and six months ended June 30, 2015 to $9.1 million and $17.9 million , respectively. Gross profit percentage was 85.0% and 86.5% for the three and six months ended June 30, 2015 compared to 87.6% and 86.6% for the comparable period in June 30, 2014. The decrease was a result of decreases in social and professional services revenue during the period.\nNet Income (Loss). Basic and diluted earnings (loss) per share was $0.41 and $0.33 and $0.26 and $0.21 for the three and six-months ended June 30, 2015, respectively. Basic and diluted earnings (loss) per share was $0.06 and $0.06 and $0.02 and $0.02 for the three and six-months ended June 30, 2015, respectively. The increase in earnings per share was the result of a $17.4 million dollar gain recognized with the buyout of our SNG joint venture partner. Net income for the three and six-month period ended June 30, 2015 was $13.8 million and $8.8 million compared to $1.6 million and $0.5 million for the three and six-months ended June 30, 2014. The increase in net income was the result of a $17.4 million dollar gain recognized with the buyout of our SNG joint venture partner.\nAdjusted EBITDA. Adjusted EBITDA was ($0.6) million and ($1.0) million for the three and six-months ended June 30, 2015 compared to Adjusted EBITDA of $3.0 million and $3.4 million for June 30, 2014, respectively. The decrease for the three and six month period was the result of the Company's EBITDA negatively impacted by the continued losses from Ongame of $3.0 million and $5.7 million , respectively.\nFinancial Position as of June 30, 2015\nCash and cash equivalents of $10.4 million Total assets of $104.6 million Total liabilities of $47.1 million Total borrowings of $9.8 million net of the discount on the convertible debt Total stockholders' equity of $57.5 million\n2016 Full Year Financial Guidance\nThe following represents forward-looking information and user are cautioned that actual results may vary.\nTotal revenues of CAD $85 to $95 million GBP/CAD – 2.07, as at close on August 24, 2015 EUR/CAD – 1.50, as at close on August 24, 2015 USD/CAD – 1.32, as at close on August 24, 2015 Includes the revenue guarantee from the licensing agreement with Pokerstars and Fulltilt of CAD $12.0 million per year Potential revenue earned from additional acquisitions that may occur in 2016 is not included. Total adjusted EBITDA[1] CAD $28 to $33 million GBP/CAD – 2.07, as at close on August 24, 2015 EUR/CAD – 1.50, as at close on August 24, 2015 USD/CAD – 1.32, as at close on August 24, 2015 SEK/CAD - .16, as at close on August 24, 2015 AUD/CAD - .96 as at close on August 24, 2015 Includes the revenue guarantee from the licensing agreement with Pokerstars and Fulltilt of CAD $10.0 million per year [NTD: $12 million ?] Potential EBITDA from additional acquisitions that may occur in 2016 is not included. EBITDA Guidance is based 15% growth on core business, Ongame being breakeven for 2016, full realization of cost synergies from the Cryptologic/Chartwell acquisition of $7.0 to $9.0 , full realization of revenue synergies from the Cryptologic/Chartwell acquisition of $3 to $5 million , positive contribution from New Jersey and Italian businesses, and $10 million contribution from the Amaya revenue guarantee. 1\nAdjusted EBITDA as defined by the Company is earnings before net interest, taxes, depreiation and amortization, foreign currency, share-based compensation, derivative value adjustment, gains and losses, and acquisition and restructuring cost.\nFinancial Statements and Management's Discussion and Analysis\nNYX Gaming Group's audited consolidated financial statements, notes thereto and Management's Discussion and Analysis for the three and six month period ended June 30, 2015 will be available on SEDAR at www.sedar.com . Additional information relating to NYX Gaming Group and its business may also be found on SEDAR at www.sedar.com and the Company's website www.nyxgaminggroup.com .\nSecond Quarter 2015 Conference Call Details\nNYX Gaming Group Limited will host a conference call on Thursday, August 27, 2015 at 8:30 a.m. ET to discuss its financial results for the second quarter of fiscal 2015. To access the conference call by telephone, please dial 647-427-7450 or 1-888-231-8191. We recommend callers to dial-in 15 minutes prior to the beginning of the call to ensure participation. A taped rebroadcast will be available to listeners until 23:59 ET on Thursday, September 3, 2015 . To access the rebroadcast, please dial 416-849-0833 or 1-855-859-2056 and enter passcode 5467733, followed by the number sign.\nAbout NYX Gaming Group Limited\nNYX Gaming Group Limited is a leading digital gaming supplier headquartered in Las Vegas with a staff of more than 350 employees based in 8 countries across Europe , North America and Australia . The Company provides one of the world's largest portfolios of market leading content and technology to some of the largest gaming operators, lotteries and casinos across the globe. NYX has one of the broadest distribution bases in the industry with over 170 unique customers and a collective game catalogue of over 650 games. The market leading game catalogue includes slots, table games, scratch cards, lottery, bingo and poker available across web and mobile formats. NYX Gaming Group Limited is listed on the TSX Venture Exchange under the symbol (TSXV: NYX).\nDisclaimer\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is definite in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nCaution Regarding Forward-Looking Statements and Non-IFRS Financial Measures\nCertain statements included herein, including those that express management's expectations or estimates of our future performance, constitute \"forward-looking statements\" within the meaning of applicable securities laws. Any statements that are contained in this news release that are not statements of historical fact may be deemed to be forward-looking statements. Forward-looking statements are often identified by terms such as \"may\", \"will\", \"should\", \"expect\", \"plan\", \"anticipate\", \"believe\", \"intend\", \"estimate\", \"potential\" or the negative of these terms or other similar expressions. Forward looking statements are based on certain assumptions regarding the Company's expected growth, results of operations, performance, industry trends and growth opportunities. Forward-looking statements are necessarily based upon a number of estimates and assumptions that, while considered reasonable by management at this time, are inherently subject to significant business, economic and competitive risks, uncertainties and contingencies that could cause actual results to differ materially from those expressed or implied in such statements. Investors are cautioned not to put undue reliance on forward looking statements. Applicable risks and uncertainties include, but are not limited to: credit, market, currency, operational, liquidity and funding risks, including changes in economic conditions, interest rates or tax rates, the impact of government regulation on the on-line gaming industry and the risk that such regulation is subject to change, competition from other providers of online gaming services, the possibility that the Company be unable to successfully integrate the B2B Business as described herein, the risks associated with international and foreign operations, the impact of consolidations in the online gaming industry and the other risks identified under the heading \"Risk Factors\" in the Company's final long form prospectus dated December 18, 2014 , as filed on SEDAR at www.sedar.com , and in other filings that NYX Gaming Group may make with applicable securities authorities in the future. The forward-looking statements contained herein reflect NYX Gaming Group's current views with respect to future events, and except as required by law, NYX Gaming Group does not intend, and undertakes no obligation, to update any forward-looking statements to reflect, in particular, new information or future events, or otherwise.\nThis release contains Non-IFRS financial measures and are noted where used. These financial measures are used by many investors to compare companies and management believes they are important measures in evaluating NYX Gaming Group. However, they are not recognized measures under IFRS and do not have a standardized meaning prescribed by IFRS. Therefore, they may not be comparable to similar measures presented by other issuers. Investors are cautioned that such measures should not be construed as alternatives to comparable IFRS measures determined in accordance with IFRS.\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=TO88016&Transmission_Id=201508270700PR_NEWS_USPR_____TO88016&DateId=20150827", "http://www.nyxgaminggroup.com/", "http://www.xmlnews.org/ns/"], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-27T16:44:50.457+03:00", "highlightTitle": ""}