{"organizations": [], "uuid": "290bfacc13ae8ec86bef311b329a37a5d9fbbf76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03403/perseidu-GettyImag_3403880k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/11794723/What-is-the-Perseid-Meteor-Shower-and-where-can-I-see-it.html", "country": "US", "title": "What is the Perseid Meteor Shower and where can I see it?", "performance_score": 5, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "What is the Perseid Meteor Shower and where can I see it? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T02:00:00.000+03:00", "replies_count": 1, "uuid": "70b2333b0243dfc2ea00ff3b29066e7f63aefc47"}, "author": "Hugh Morris", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/11794723/What-is-the-Perseid-Meteor-Shower-and-where-can-I-see-it.html#post-0", "ord_in_thread": 0, "title": "What is the Perseid Meteor Shower and where can I see it?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What is it? The Perseids is an annual meteor shower that peaks around mid-August. It is regarded as one of the brightest and most visible meteor showers. The Perseid cloud, consisting of particles ejected from the comet Swift-Tuttle, is expected to be particularly spectacular this year as the heavens align to please astronomers across the country. A new moon on the night of August 14 will create perfect viewing conditions, while the International Space Station is also expected to make an appearance, flying over the UK at about 10.30pm. Stargazers can expect to see as many as 100 meteors an hour streak across the night sky, each leaving a trail. The Perseid Meteor Shower will be best visible in the early hours of Thursday morning Photo: Getty • The best places to see the Northern Lights Meteors are bits of ice and dust, sometimes as small as a grain of sand or as large as a pea, entering the Earth's atmosphere at 134,000mph and burning up. The Perseids appear to originate from within the star constellation Perseus, hence the shower's name. What time can I see it? Though happening from July 17 to August 24, and visible any night this week, it will peak overnight on Wednesday and into the small hours of Thursday morning - it will be best seen when the sky is at its darkest. The International Space Station will make a cameo appearance around 10.30pm, moving across the sky from the west below the bright star of Arcturus, towards the south. It will be best seen in the south of England and will be the brightest light in the sky before it moves out of sight shortly after 10.30pm. The shower is best seen away from light pollution Photo: Getty Where can I see it? The shower will be most visible in the south of England. Look for the shower's \"radiant\" from the north-east corner of Perseus. But really the best place to see it is dependant on your location on the ground - anywhere away from the light pollution of towns and cities, where the sky is darkest, will help you see the meteors more clearly. Here are a few great options: Galloway Forest Park: Galloway is a couple of hours from Glasgow and an hour from Carlisle. The park's most popular spot for stargazing is Loch Trool. Exmoor and around: Exmoor was granted International Dark-Sky Reserve status by the International Dark-Sky Association in 2011. Light pollution is managed to make the area more appealing to amateur astronomers. Romney Marsh: Night once provided cover for smugglers known as Owlers, but today Romney Marsh offers celestial bounty, arching over a landscape adorned with the spires of ancient churches. Kielder: Kielder Forest is officially the darkest place in England – 250 square miles of wooded beauty where Northumberland brushes against Scotland. It has its own fabulous, modern, wood-clad observatory on the slopes of Black Fell above Kielder Water North York Moors: As well as stunning night skies, the North York Moors boast historic market towns such as Helmsley and Pickering, plus appealing coastal spots, including Scarborough and Whitby. There are plenty of other suggestions in our guide to Britain's best stargazing locations Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-08-11T02:00:00.000+03:00", "crawled": "2015-08-10T21:26:52.982+03:00", "highlightTitle": ""}