{"organizations": [], "uuid": "66743113c4b3f19fe19c9886196137800c6ad5af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/08/2b519806-4603-11e5-a3de-66b28610ac11-474x711.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/seattle-news/science/cascadia-fault-chatters-and-pops-with-little-quakes/", "country": "EU", "title": "Cascadia fault chatters and pops with little quakes", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Cascadia fault chatters and pops with little quakes | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T21:50:00.000+03:00", "replies_count": 0, "uuid": "66743113c4b3f19fe19c9886196137800c6ad5af"}, "author": "Sandi Doughton", "url": "http://www.seattletimes.com/seattle-news/science/cascadia-fault-chatters-and-pops-with-little-quakes/", "ord_in_thread": 0, "title": "Cascadia fault chatters and pops with little quakes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Initial results from a program to monitor the Cascadia Subduction Zone in unprecedented detail show that the fault off the Northwest coast isn’t as seismically quiet as it has long appeared.\nSeafloor seismometers deployed as part of the National Science Foundation’s Cascadia Initiative detected nearly 600 small earthquakes off central Oregon during their first year of operation — quakes that didn’t register on any land-based instruments.\nThough the subduction zone can unleash magnitude-9 megaquakes and tsunamis, there’s no reason to think the small tremors are unusual or precursors to something bigger, seismologists say.\nSections of the 700-mile-long fault have probably been popping and snapping all along. But until now, there’s never been such an extensive network of underwater instruments to listen in.\nMost Read Stories Chelan blazes: With no end in sight, thousands evacuate Percy Harvin doubles down on comments about his Seahawks tenure Reactions mixed to NYT story about Amazon’s work conditions Jeff Bezos says Amazon won’t tolerate ‘callous’ management practices Inside Amazon: wrestling big ideas in a bruising workplace “Putting seismometers out in the ocean is giving us a better understanding of what’s going on, because we’re closer to where the action is,” said Danielle Sumy, of the Incorporated Research Institutions for Seismology , a consortium that develops instruments and shares data.\nThe goal of the Cascadia Initiative is to assemble a more complete picture of the Northwest’s most dangerous fault — including what to expect the next time it ruptures. In addition to deploying more than 60 ocean-bottom seismometers and pressure gauges, the project also strengthened the land-based seismometer network and upgraded nearly 250 GPS stations to deliver rapid data on the way the region is being squeezed and warped by tectonic forces.\nThe initiative was funded with $10 million from the 2009 economic-stimulus package. The White House included it on a list of 100 Recovery Act projects “that are changing America.”\nThe first results, published Tuesday in a special section of the journal Seismological Research Letters , also include reports on the fault’s structure and the use of ocean-bottom sensors to track tsunamis and provide warnings.\nGeologists have long puzzled over the lack of small earthquakes on the Cascadia Subduction Zone, where the tectonic plate comprising the seafloor is being forced under the North American plate. Most subduction zones around the world are rattled by frequent quakes, so many experts once argued that Cascadia’s relative quiet proved the fault didn’t pose any threat.\nBut the silence took on a more ominous air by the early 1990s, when geologists uncovered evidence of monstrous earthquakes and tsunamis in the past, the most recent in 1700 .\n“We now realize that the reason it’s so quiet is that it’s locked and accumulating strain,” said seismologist Susan Schwartz , of the University of California, Santa Cruz. “And it’s certain that it will experience a large earthquake again.”\nStudying the fault is tough because much of it is underwater and 70 miles or more offshore.\nStarting in 2011, Cascadia Initiative scientists on board research ships deposited seismometers in water up to 1.5 miles deep. For shallower sites near shore, they designed new instruments encased in cone-shaped metal shields to prevent them from being snagged by trawl nets.\nThe seismometers were left on the seafloor for a year at a time, fished up to extract stored data, then shifted to another location. The sensors will be retrieved for the last time in September, when seafloor-data collection will come to an end.\nEmily Morton and Susan Bilek, of New Mexico Tech, detected the hundreds of small quakes — none bigger than magnitude 3 — by analyzing data from two seismometers between 2011 and 2012.\nThe quakes probably represent places where the tectonic plates briefly jerk past each other, Morton explained. “When you have two plates sliding past each other, it’s not smooth,” she said. “It’s kind of like trying to slide two bricks past each other.”\nAs more data is analyzed, the scientists hope patterns will emerge that can help identify which portions of the fault are most tightly locked and which segments might slip most during a powerful quake.\n“We expected that we would find these small earthquakes,” Morton said. “Now we’re just getting to the point where we can start analyzing them and finding out what they can tell us.”\nAnother group of researchers analyzed data from the pressure gauges in each instrument package, which were fortuitously positioned to track a small tsunami in 2012.\n“We were lucky to be able to pick that up,” said Anne Sheehan, of the University of Colorado.\nThe tsunami was triggered by a magnitude- 7.8 earthquake near Haida Gwaii , formerly called the Queen Charlotte Islands, off the coast of British Columbia. No one was injured, but surges up to 40 feet high pounded the shores of the sparsely populated islands.\nThe pressure gauges recorded valuable information on the way the tsunami behaved as it approached shore, Sheehan said. That can help scientists improve computer models used to predict flooding from a Cascadia tsunami and map out evacuation routes.\nResults from the Cascadia Initiative will also be useful in incorporating ocean-bottom pressure sensors into tsunami-warning networks, Sheehan said.\n“Right now, it’s more of a research mode, but the more we can learn about how the tsunami propagates, the better the system will be.”\nAll the data from the Cascadia Initiative are freely available, and scientists around the world are beginning to tap into the trove, Schwartz said.\n“There are going to be many, many more results to come out,” she said. “This experiment got a lot of people excited and interested in doing more of this offshore work.”\nThere’s still no way to predict when the fault will rupture, Schwartz said. Estimates of the average recurrence rate range between 250 and 500 years — but past quakes have struck at widely irregular intervals.\nSome data from Japan’s 2011 megaquake hint that subduction zones may begin slipping in the weeks and days before a major quake, but it will take more intensive seafloor monitoring to find out if that’s true.\n Related video: Earthquake warning system John Vidale, director of the Pacific Northwest Seismic Network, explains how an early warning system could alert people before an earthquake hits. Read more . (Steve Ringman & Corinne Chin / The Seattle Times) Both the U.S. and Canada have installed cabled networks of underwater instruments, including seismometers and pressure gauges, to continuously monitor small sections of the subduction zone. But scientists hope to greatly expand the networks in the future.\nInterest and panic around the coming Northwest megaquake spiked last month with the publication in The New Yorker of a dramatic account of the expected damage and death toll.\nA healthy amount of fear is a good thing, said Schwartz, who hopes the issue doesn’t fade quickly from the public consciousness.\n“There is a real hazard,” she said. “I want people to take that fear and turn it into positive action, making sure that they’re as prepared as they can be.”\nSandi Doughton at: 206-464-2491 or sdoughton@seattletimes.com", "external_links": ["http://www.eurekalert.org/pub_releases/2015-08/ssoa-cit081115.php", "https://www.whitehouse.gov/sites/default/files/100-Recovery-Act-Projects-Changing-America-Report.pdf", "http://seismo.berkeley.edu/~rallen/pub/2014toomey/ToomeyEtAl-CascadiaInitiative-Oceanography-2014.pdf", "http://www.newyorker.com/magazine/2015/07/20/the-really-big-one?intcid=popular", "http://www.pmc.ucsc.edu/~seisweb/susan_schwartz/", "http://www.interactiveoceans.washington.edu/file/Regional_Scale_Nodes", "http://www.oceannetworks.ca/installations/overview", "http://www.iris.edu/hq/", "https://en.wikipedia.org/wiki/2012_Haida_Gwaii_earthquake", "http://www.geodesy.cwu.edu/data/map/velocity_field/"], "published": "2015-08-18T21:50:00.000+03:00", "crawled": "2015-08-19T09:24:46.278+03:00", "highlightTitle": ""}