{"organizations": [], "uuid": "14d4bee2a0fa8861c7d57e88db9bea66c03aa1c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 9:24 a.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_HIKERS_BEHAVING_BADLY_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "Hikers behaving badly: Appalachian Trail partying raises ire", "performance_score": 0, "site": "ap.org", "participants_count": 1, "title_full": "Hikers behaving badly: Appalachian Trail partying raises ire", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T16:00:00.000+03:00", "replies_count": 0, "uuid": "14d4bee2a0fa8861c7d57e88db9bea66c03aa1c7"}, "author": "ALANNA DURKIN", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_HIKERS_BEHAVING_BADLY_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "Hikers behaving badly: Appalachian Trail partying raises ire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Links Yesterday's Places BAXTER STATE PARK, Maine (AP) -- When Jackson Spencer set out to tackle the Appalachian Trail, he anticipated the solitude that only wilderness can bring - not a rolling, monthslong frat party. Shelters where he thought he could catch a good night's sleep while listening to the sounds of nature were instead filled with trash, graffiti and people who seemed more interested in partying all night, said Spencer, who finished the entire trail last month in just 99 days. \"I wanted the solitude. I wanted to experience nature,\" he said. \"I like to drink and to have a good time, but I didn't want that to follow me there.\" Spencer, or \"Mission\" as he is known to fellow thru-hikers, confronted what officials say is an ugly side effect of the increasing traffic on the Georgia-to-Maine footpath every year: More people than ever causing problems. At Maine's Baxter State Park, home to the trail's final summit on Mount Katahdin, officials say thru-hikers are flouting park rules by openly using drugs and drinking alcohol, camping where they aren't supposed to, and trying to pass their pets off as service dogs. Hundreds of miles away, misbehaving hikers contributed to a small Pennsylvania community's recent decision to shutter the sleeping quarters it had offered for decades in the basement of its municipal building. With last year's release of the movie \"Wild,\" about a woman's journey on the Pacific Crest Trail, and what experts call a growing interest in outdoor activities, the number of people on the Appalachian Trail has exploded. And the numbers are only expected to climb further after \"A Walk in the Woods\" - a movie based on the 1998 Bill Bryson book about the Appalachian Trail- hits theaters this week. More than 830 people completed the 2,189-mile hike last year, up from just 182 in 1990, according to the Appalachian Trail Conservancy, based in Harpers Ferry, West Virginia. At Baxter, the number of registered long-distance hikers grew from 359 in 1991 to more than 2,000 in 2014. The growing number of hikers is becoming a management nightmare at Baxter, where officials say they also believe the culture and attitude of the people using the footpath is changing. Jensen Bissell, director of the park, said in a letter to the Appalachian Trail Conservancy late last year that AT hikers are \"open and deliberate in their desire for freedom from all rules and regulations.\" He warns that the trail may need to end somewhere besides Katahdin if something doesn't change soon. \"If we have 2,000 hikers now, how will it be when we have 3,500 or 4,000 hikers?\" Bissell said. Some say there appears to be a growing sense of entitlement among thru-hikers, many of whom are just out of college or have enough money to leave work for months at a time. \"We had to take off half a year of working, and not a lot of people can do that,\" Karl Berger, a 24-year-old Maine resident known on the trail as GQ, said from a camp site in Baxter, where he was resting with his father behind finishing the hike up Katahdin. \"I don't think a lot of hikers acknowledge that it's a privilege to be out here.\" Many hikers said they believe the concerns are being overblown. \"There is always a bad apple or two, but these are people that spend four to six months for a year on the trail, on their feet, experiencing the wilderness. I can't imagine them wanting to do things that would violate the wilderness,\" said Scott Jurek, an ultramarathoner from Colorado who last month completed the trail in a record time of 46 days, eight hours. After celebrating with a bottle of champagne at Katahdin's summit, Jurek received citations for consuming alcohol, hiking with a large group and littering. He argued that the citations were unfair and that Baxter officials were using him to send a message to problem hikers. Policies regarding alcohol vary by state and park. Dogs are allowed along most of the trail except for a few places, including Baxter. Ron Tipton, executive director of the Conservancy, said the vast majority of thru-hikers are respectful and on the trail for the right reasons. He said he believes that the sharp increase in hikers has simply made it more challenging to deal with the behavior of a few. His group has implemented several initiatives to deal with the surge in trail use, such as encouraging people to start the path at different spots to better distribute hikers. It also recently held a meeting with Baxter officials to address the concerns about hiker behavior and is dedicated to resolving the issues, Tipton said. With the end of the trail in jeopardy, there's much at stake, officials and hikers say. \"Katahdin is such an icon; it's such a prize that it motivates all kinds of people,\" said Lester Kenway, president of the Maine Appalachian Trail Club. \"Having the trail end somewhere short of that would be a disappointment for many of us.\" --- Follow Alanna Durkin at http://www.twitter.com/aedurkin", "external_links": [], "published": "2015-08-31T16:00:00.000+03:00", "crawled": "2015-08-31T21:07:01.975+03:00", "highlightTitle": ""}