{"organizations": [], "uuid": "8f30808e0389de9551f8a345b0541f7c5d8f6e7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/07/16/66/3a/AJC-OGImage200x200.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/us/circus-says-its-reeling-from-tent-collapse-that-ki/nnDL3/", "country": "US", "title": "Official: Circus crowd was told to stay put as storm neared", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Official: Circus crowd was told to stay put as storm neared | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T14:55:00.000+03:00", "replies_count": 0, "uuid": "8f30808e0389de9551f8a345b0541f7c5d8f6e7d"}, "author": "RODRIQUE NGOWI", "url": "http://www.ajc.com/ap/ap/us/circus-says-its-reeling-from-tent-collapse-that-ki/nnDL3/", "ord_in_thread": 0, "title": "Official: Circus crowd was told to stay put as storm neared", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Circus workers first told spectators to stay put as a severe storm bore down on the tent where they had gathered and then told them to seek shelter in their cars just before the tent collapsed, killing a father and daughter, the state fire marshal said Wednesday.\nFire Marshal Bill Degnan said workers saw a piece of loose canopy near the tent's main entrance and told the roughly 100 people inside to remain seated while they secured it. As the winds rose, they told spectators to leave immediately and go to their cars.\nThe National Weather Service issued a severe storm warning seven minutes before the show started at 5:30 p.m., and the tent came down at about 5:45 p.m. Winds of 55 to 60 mph, with gusts up to 75 mph, were recorded in the area, and Degnan said the storm cut a swath a half-mile to a mile long, taking down trees as it neared the tent.\nDegnan said investigators are talking to spectators and consulting soil experts and structural engineers as they try to figure out why the tent fell, killing 41-year-old Robert Young and his 8-year-old daughter, Annabelle Young, of Concord, Vermont.\n\"Robert died a hero trying to save Annabelle,\" Trisha Belliveau, the girl's mother, told WPTZ-TV.\nDegnan said Wednesday that the number of injured rose from 32 to more than 50, mostly because several people drove themselves to doctors and reported their injuries later.\nThe operator of the circus, Sarasota, Florida-based Walker International Events Inc., said on its Facebook page that the cast and crew were shocked by what had happened.\n\"The entire cast and crew of Walker International Events, Inc. are deeply saddened by the tragic chain of events that occurred in Lancaster, N.H.\" it said. \"We have been reeling with the shock of these events. Our very deepest condolences and prayers go out to the families whose lives were affected. We cannot begin to express the pain and sadness we feel.\"\nThe company has not returned repeated phone calls and emails seeking an interview. It canceled two shows in Vermont and its remaining eight shows in New Hampshire.\nDegnan said his office is investigating whether local officials knew or should have known the show was taking place. The show required a place-of-assembly permit, but one was not sought, Degnan said. State law says that permit should have been issued by town officials and the town would be required to make sure the tent was inspected. The investigation also is looking at how the tent was set up.\n\"The bottom line is the responsibility lies with the operator,\" Degnan said.\nHe said the circus has been cooperative in the investigation. Town fire officials and the town clerk's office referred questions to the fire marshal's office.\nDegnan said authorities will review relevant laws and consult with the county attorney before deciding if any charges could result from the collapse.\nWalker's president, John Caudill Jr., has a history of violations with the U.S. Department of Agriculture, primarily while operating another company, Walker Brothers Circus Inc. Those charges are all related to animal care.\nA tent manufacturer said Wednesday that the large tents are designed to withstand high winds as long as they are put up correctly.\n\"Different tents are engineered to different specifications, but almost everything today is engineered to the uniform building code so chances are it was engineered to take a 70 mph wind load,\" said Randy McCauley, of Rainier Tents, a Wilsonville, Oregon-based manufacturer of event and other tents.\nThe principal of Annabelle Young's school said the small community of Concord was rallying around the family, which had asked for privacy.\n\"They're a great family. It's just really tragic when you take kids to have a good time and this is what happens,\" Julie Donahue said, her voice breaking.\nRobert Young was a direct-care worker at Common Ground, which provides services for people with intellectual disabilities. Director Mark Vincent said Young was dedicated and cared deeply about them.\n\"For him, it was a vocation, not just a job,\" Vincent said.\nVincent said Young's biggest passion was his family and he was never without a photograph of his two daughters.\n___\nAssociated Press writers Holly Ramer in Concord, Vermont, and Kathy McCormack and Rik Stevens in Concord, New Hampshire, contributed to this report.", "external_links": [], "published": "2015-08-05T14:55:00.000+03:00", "crawled": "2015-08-06T02:37:16.240+03:00", "highlightTitle": ""}