{"organizations": [], "uuid": "f78f36cb1db5809701afb8c97f72f8cc573ff068", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/07/16/66/3a/AJC-OGImage200x200.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/top-news/dream-of-free-and-open-internet-dying-lawyer-says/nnDbN/", "country": "US", "title": "Dream of free and open Internet dying, lawyer says", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Dream of free and open Internet dying, lawyer says | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T15:25:00.000+03:00", "replies_count": 0, "uuid": "f78f36cb1db5809701afb8c97f72f8cc573ff068"}, "author": "BREE FOWLER", "url": "http://www.ajc.com/ap/ap/top-news/dream-of-free-and-open-internet-dying-lawyer-says/nnDbN/", "ord_in_thread": 0, "title": "Dream of free and open Internet dying, lawyer says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The dream of a free and open Internet is slowly being killed by overregulation, censorship and bad laws that don't stop the right people, a top computer crime defense lawyer says.\nThe annual Black Hat computer security conference in Las Vegas kicked off Wednesday with a keynote address from Jennifer Granick, director of Civil Liberties at the Stanford Center for Internet and Society. Granick said that while the Internet needs to be reasonably safe in order to be functional, it's no longer the revolutionary place it was 20 years ago.\nNo one is murdering the dream of an open Internet, she said, but it's withering away because no one is prioritizing its protection. On top of that, new Internet users are coming from countries whose citizens aren't protected by a Bill of Rights or a First Amendment.\n\"Should we be worrying about another terrorist attack in New York, or about journalists and human rights advocates being able to do their jobs?\" she asked.\nGranick also railed against the federal Computer Fraud and Abuse Act, which carries sentences of up to 10 years in prison for a first-time offense. It does nothing to prosecute countries like China that launch state-sponsored attacks against the U.S. government and major companies, along with other dangerous hackers based overseas, she said. But, she added, it often hits small-time American hackers with unfairly harsh prison sentences.\nIn a separate briefing later Wednesday, Leonard Bailey of the Department of Justice's Computer Crime and Intellectual Property section, said that in most cases, prosecutions of computer crimes are very \"reasonable\" and not \"prosecutors gone wild.\"\n\"But all it takes is one flogging in the public square and there's a chilling effect,\" he says. \"So, we have to try to get this right.\"\nA slew of hackers and information security professionals took the stage at Black Hat later on Wednesday.\nOne of the most popular talks featured Charlie Miller and Chris Valasek, who gained fame recently by hacking into and taking control of a Jeep Cherokee, prompting Fiat Chrysler to recall 1.4 million vehicles to fix the problem.\nIn a light-hearted talk in a packed ballroom that was often interrupted by applause, the pair detailed how they spent a year hacking into the Jeep, before ultimately infiltrating it through the cellular connection in its radio and then connecting to its controls.\nWednesday's later talks were set to include sessions on the cloning of contactless payment devices such as Apple Pay and Google Wallet, along with the hacking of gas pumps, new research on the prevalence of Internet scams and the hacking of Square Inc.'s mobile credit card-reading devices.\nThe conference continues on Thursday with sessions featuring the hacking of an Internet-connected sniper rifle, a look at ransomware and a discussion of the hidden risks of biometric identification.\n___\nFollow Bree Fowler on Twitter at https://twitter.com/apbreefowler.", "external_links": ["https://twitter.com/apbreefowler."], "published": "2015-08-05T15:25:00.000+03:00", "crawled": "2015-08-06T02:37:05.538+03:00", "highlightTitle": ""}