{"organizations": [], "uuid": "e538a5471cf3e6f0cee3726e680a3082e3017d5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/08/fbdf5c94-45f7-11e5-a3de-66b28610ac11-474x711.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/seattle-news/seattle-area-to-celebrate-new-fm-hyperlocal-radio/", "country": "EU", "title": "Seattle area to celebrate new FM ‘hyperlocal’ radio", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Seattle area to celebrate new FM ‘hyperlocal’ radio | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T02:58:00.000+03:00", "replies_count": 0, "uuid": "e538a5471cf3e6f0cee3726e680a3082e3017d5a"}, "author": "Jack Broom", "url": "http://www.seattletimes.com/seattle-news/seattle-area-to-celebrate-new-fm-hyperlocal-radio/", "ord_in_thread": 0, "title": "Seattle area to celebrate new FM ‘hyperlocal’ radio", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Whether you’re in Ballard or Kent, Duvall or Rainier Valley, a “hyperlocal” radio station is gearing up to bring new voices and fresh perspectives to the airwaves near you.\nFifteen low-power FM stations, each licensed to broadcast with the power of a 100-watt light bulb in an area with a radius of roughly 3.5 miles, have been sharing experiences as part of the Puget Sound Community Radio Cohort.\nAmong their motivations is promoting “media justice,” giving voice to those often ignored by major broadcast outlets and media organizations.\nNational Radio Day 11 a.m.-12:30 p.m. Thursday, Seattle Public Library’s Fourth Avenue Atsuhiko and Ina Goodwin Tateuchi Plaza. 1000 Fourth Avenue\n“Media justice means making sure everyone has access, particularly marginalized communities,” said Garrett Kelly, a co-founder of Hollow Earth Radio in Seattle’s Central Area.\nMost Read Stories Chelan blazes: With no end in sight, thousands evacuate Percy Harvin doubles down on comments about his Seahawks tenure Reactions mixed to NYT story about Amazon’s work conditions Jeff Bezos says Amazon won’t tolerate ‘callous’ management practices Inside Amazon: wrestling big ideas in a bruising workplace Seven of the 15 new stations are located in Seattle and will be honored at a “National Radio Day” event at 11 a.m. Thursday at the downtown Seattle Public Library.\nAs these stations become a reality, their backers say they’ll explore the gamut: music, lifestyles, social causes, community news, politics, drama, food, hobbies and more.\nThis hasn’t always been possible.\nSabrina Roach, an organizer of the radio cohort, said the key was the passage in Congress in 2010 of the Local Community Radio Act, jointly sponsored by Sen. Maria Cantwell, D-Wash., and Sen. John McCain, R-Ariz., and signed by President Obama in 2011.\nThat law, which had been opposed by major private and public broadcast outlets, let groups in urban areas apply to create low-power FM stations, previously only allowed in rural areas.\nThis will be the first time National Radio Day is observed coast to coast, with 30 cities participating, Roach said.\nAt the Seattle event, a temporary “pop up” radio station will broadcast from the library’s Fourth Avenue Atsuhiko and Ina Goodwin Tateuchi Plaza.\nYoung broadcasters will bring the station to life with music and interviews, and those attending could get a chance to hear what they’d sound like on the radio, and look over an interactive 6-foot antenna.\nRoach is working on the community radio project in her job as a “doer” with Brown Paper Tickets . The company has four such employees, hired to work on community-service projects in which they have a background.\nOf the 15 stations in the cohort, only the Voice of Vashon is now broadcasting terrestrially — that is, over the airwaves — Roach said. It’s at 101.9 FM\nSome have been operating online, streaming their content on the Web.\nAmong those is Hollow Earth Radio, born in 2007 in the basement of Kelly and his wife, Amber Kai Morgan.\nInitially, Kelly said, the focus was to give airtime to small and unusual bands that wouldn’t get play on commercial stations. That’s still important, but as part of a wide “media justice” effort, Kelly said.\nAmong the shows on Hollow Earth Radio that illustrate that is “ #LuluNation + #SadBoisHypeClub ,” a talk show geared to LGBT people of color.\nA co-host of the show, Luzviminda Uzuri “Lulu” Carpenter, said the greatest benefit of the radio station may be that “We’re finding ways technology can unite us, rather than divide us.”\nThe FM signal will allow them to reach people who don’t have computers or aren’t on the Web.\nCarpenter is also the station’s youth-program lead, encouraging those new to radio to explore ways to connect with listeners. “In order for people to shine, they need to be able to experiment,” she said.\nHollow Earth hopes to begin broadcasting on its assigned FM frequency, 100.3, next year.\nEncouraging new talent and new content is a goal of low-power FM stations, Roach said, and so is becoming a “community glue,” offering people a way to learn about and get involved in issues important close to home.\nHaving a radio station in your neighborhood “is similar to the value of a public library branch in a neighborhood, or a community arts and culture center,” Roach said.\nIt’s estimated that 90 percent of Seattle neighborhoods will be in the broadcast area of at least one of the new stations, and that many areas will be able to tune in to two or more.\nTo survive and succeed, the new low-power FM stations face multiple challenges and hard work.\nRoach said it can take $60,000 just to get the station up and running. And stations are required to generate locally a significant portion of what they broadcast, and not simply act as “repeater” stations for national broadcasts.\nEric Muhs estimates it will take the sustained efforts of 100 to 150 volunteers to create and maintain a station being established in Ballard that also would serve Fremont, Greenwood, the University District, and even reach to the north slopes of Queen Anne and Magnolia.\nMuhs, a physics and astronomy teacher at Ballard High School, said nonprofit Fulcrum Community Communications hopes to hit the FM airwaves next year.\nA core group has been brainstorming topics that could lend themselves to regular shows — such as a beer-oriented show, tapping the expertise of the area’s craft brewers.\nBut like Carpenter at Hollow Earth, Muhs says much of the radio station’s long-term benefit may lie in what it means to the generation coming of age.\n“Young people have stories to tell,” he said. “The aspect of them telling their stories — through music, journalism, creative writing or other ways — is really powerful.”\nJack Broom: jbroom@seattletimes.com or 206-464-2222", "external_links": ["http://community.brownpapertickets.com/Doers/", "http://www.hollowearthradio.org/programs/57"], "published": "2015-08-19T02:58:00.000+03:00", "crawled": "2015-08-19T09:40:36.425+03:00", "highlightTitle": ""}