{"organizations": [], "uuid": "afb30a65e74324e8288843581bebd22fc622e802", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03388/Hadrians-wall_3388983a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-04.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/walking-holiday/11765736/scottish-walking-routes.html", "country": "US", "title": "Walking in Scotland: exploring paths less travelled", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Walking in Scotland: exploring paths less travelled - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T19:00:00.000+03:00", "replies_count": 0, "uuid": "afb30a65e74324e8288843581bebd22fc622e802"}, "author": "Beverley Glick", "url": "http://www.telegraph.co.uk/sponsored/travel/walking-holiday/11765736/scottish-walking-routes.html", "ord_in_thread": 0, "title": "Walking in Scotland: exploring paths less travelled", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "You don’t need to take a long-haul flight to find beautiful landscapes to explore. Ramblers Worldwide Holidays also offers a huge range of walking trips close to home – many of which visit places that traditional itineraries pass by. Walking with Ramblers Worldwide Holidays will open your eyes to the fascinating nooks and crannies of the UK, with holidays that cater to all levels, from gentle strolls to vigorous hikes in enduringly inspiring locations such as the Lake District, Offa’s Dyke, Hadrian’s Wall and the Peak District. The Orkney Islands offer something for everyone and provide a microcosm of the perfect Ramblers Worldwide Holidays getaway. Fantastic walks take you past stunning coastal scenery and World Heritage-listed archaeological sites that form an astonishing human history of the British Isles – and your Ramblers Worldwide Holidays' leader will be on hand to bring to life what you are looking at. These islands, which are located 10 miles off the coast of Caithness in northern Scotland, were first settled during the Mesolithic era, around 7,000BC. The Neolithic village of Skara Brae, dating to around 4,000BC, is probably the best-preserved Stone Age settlement in Europe. Later, in the Iron Age, fortified towers called brochs sprang up – many of which can still be seen today. Then the Vikings arrived and left behind their unique culture and language. Travelling with your leader and a small, friendly group of walkers, you’ll stay in the unspoilt fishing village of Stromness for easy access to coastal paths. The terrain in Orkney is gently undulating, so none of the walks involve sustained climbing. You’ll hike to the Kitchener Memorial, high above the stormy seas of Orkney’s Marwick Head; Wideford Hill cairn, a fascinating neolithic burial chamber; and (subject to ferries) the famous 450ft stack, the Old Man of Hoy. Orkney has more RSPB reserves than anywhere else in the UK, with a wide variety of habitats and birds to observe Tours of the islands’ capital of Kirkwall, as well as Stromness and Birsay (the ancient capital) will probably be included on your holiday, as well as visits to the Ring of Brodgar (an important Neolithic stone circle), Scapa Flow (one of Britain’s most historic stretches of water) and the islands of Hoy, Burray and South Ronaldsay. Orkney has more RSPB reserves than anywhere else in the UK, with a wide variety of habitats and birds to observe. May is a great time to visit, when breeding birds have arrived and migrant birds are passing through. During numerous walks, you’ll have a chance to see puffins, gannets, guillemots, razorbills and tysties on the cliffs; waders on the mudflats; Eider ducks and other divers in the wetlands; and great Arctic skua, short-eared owls and hen harriers on the moorlands. On special Ramblers Worldwide Holidays birdwatching departures, you’ll have access to a 60x magnification telescope so you can get really close to the action. Accommodation is at the comfortable three-star Stromness Hotel, overlooking the picturesque fishing harbour and Scapa Flow, where the bar, lounge and restaurant serve a variety of locally produced food and drink. There’s so much to discover on your own doorstep, and Ramblers Worldwide Holidays is perfectly placed to surprise and delight you with paths less travelled and expert support from your dedicated group leader. • Find advice, rewards and a brochure at Ramblers Worldwide Holidays or simply call an expert on 01707 331133", "external_links": [], "published": "2015-08-04T19:00:00.000+03:00", "crawled": "2015-08-04T23:27:14.787+03:00", "highlightTitle": ""}