{"organizations": [], "uuid": "e85944f77f35536e10a502965a4df226dfd5eb6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62727/iata-premium-traffic-monitor-june-2015", "country": "US", "title": "IATA Premium Traffic Monitor: June 2015", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "IATA Premium Traffic Monitor: June 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T11:43:00.000+03:00", "replies_count": 0, "uuid": "e85944f77f35536e10a502965a4df226dfd5eb6b"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/62727/iata-premium-traffic-monitor-june-2015", "ord_in_thread": 0, "title": "IATA Premium Traffic Monitor: June 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IATA Premium Traffic Monitor: June 2015   \nAug 18, 2015 eTN   \nIATA's released it's assessment of premium and economy travel for June. \nPassenger travel on international markets rose by just 3.0% in June compared to a year ago, decelerating significantly on the May increase of 6.2% year-on-year. Economy class travel grew at a stronger rate than premium international air travel, but both classes experienced a notable slowdown within the Far East region; \nEconomy class travel rose 3.2% in June year-on-year, a slowdown on May growth of 6.4%. Growth in economy class travel – the more price sensitive travel market – has been supported by lower fares over recent months; \nPremium travel was up just 1.4% in June year-on-year, down from May growth of 4.1%. Growth in premium travel has been reflecting continued weakness in business travel demand drivers, with global business confidence being dragged down by emerging markets; \nIn June, the subdued performance in both travel classes was mostly a result of slow growth within the Far East. This result could be the first sign of weakness in air travel demand following months of sluggish economic performance in some parts of Asia; \nLooking ahead, although improvements in the Eurozone economy have translated into stronger demand for travel in both premium and economy classes over recent months, weakness in emerging markets could counter this positive trend. The June data suggests downside risks may already be materializing.", "external_links": [], "published": "2015-08-18T11:43:00.000+03:00", "crawled": "2015-08-18T12:24:28.908+03:00", "highlightTitle": ""}