{"organizations": [], "uuid": "896e843c7a7e834567dca7b90e8fcd29d4cc64ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/09/asae-logo.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS Archives - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/asaes-new-global-growth-strategies-report-outlines-key-steps-for-associations-establishing-international-operations/", "country": "US", "title": "ASAE’s New Global Growth Strategies Report Outlines Key Steps for Associations Establishing International OperationsTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "ASAE’s New Global Growth Strategies Report Outlines Key Steps for Associations Establishing International OperationsTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "896e843c7a7e834567dca7b90e8fcd29d4cc64ad"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/asaes-new-global-growth-strategies-report-outlines-key-steps-for-associations-establishing-international-operations/", "ord_in_thread": 0, "title": "ASAE’s New Global Growth Strategies Report Outlines Key Steps for Associations Establishing International OperationsTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ASAE’s New Global Growth Strategies Report Outlines Key Steps for Associations Establishing International Operations Published on : Thursday, August 27, 2015\nIn the second phase of research in the Association Global Management Series, the ASAE Foundation takes a deep dive look at how associations plan, execute, and refine their global efforts. In Global Growth Strategies, the report provides important steps associations should consider as they decide to establish operations in international markets and for associations who want to take the next step.\nThis report also includes a “Special Focus on China,” which examines the strategies and operations of associations working in that country. Throughout the report, the study includes actionable advice on a variety of topics including: strategic planning, operational decisions, and cultural issues.\n“Global Growth Strategies provides associations with recommendations on how to best build their global strategy. It examines how to create strategies around these practices, the potential roadblocks you may encounter, and what’s required in terms of research, governance, and member relations,” said ASAE Executive Vice President and ASAE Foundation President Susan Robertson, CAE.\nThe ASAE Foundation and MCI Group, a global network of 62 offices in 32 countries providing market development services and conference management, joined forces to study processes and strategies of how associations are operating throughout the world.\nMCI provided partial funding to support the research and participated with ASAE staff in developing the research plan, interpreting research findings, and preparing reports. MCI also served in an advisory capacity on the overall multi-year research initiative, along with the Global Management Series Advisory Group.\nThe report is free for members and $9.95 for non-members. To download a copy, visit ASAE’s bookstore.", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-28T02:00:41.666+03:00", "highlightTitle": ""}