{"organizations": [], "uuid": "2682f17b04ed1e935c75aff99b4163f2d457d27a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/Bahai_Structure.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/seychelles-minister-st-ange-appreciated-the-bahai-structure-at-hyfa-in-israel/", "country": "US", "title": "\"Understanding and appreciating faiths & religions of the world to better understand ourselves\" said Seychelles Minister St.Ange as he appreciated the BAHAI Structure at Hyfa in IsraelTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "\"Understanding and appreciating faiths & religions of the world to better understand ourselves\" said Seychelles Minister St.Ange as he appreciated the BAHAI Structure at Hyfa in IsraelTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "2682f17b04ed1e935c75aff99b4163f2d457d27a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/seychelles-minister-st-ange-appreciated-the-bahai-structure-at-hyfa-in-israel/", "ord_in_thread": 0, "title": "\"Understanding and appreciating faiths & religions of the world to better understand ourselves\" said Seychelles Minister St.Ange as he appreciated the BAHAI Structure at Hyfa in IsraelTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seychelles Minister St.Ange appreciated the BAHAI Structure at Hyfa in Israel\nThe working visit to the State of Israel by Alain St.Ange, the Seychelles Minister responsible for Tourism and Culture was also an opportunity for the Minister who says often that the islands of the Seychelles are a melting pot of cultures because of the diversity that made the Creole People of Seychelles who they are today.\nSeychelles is of course also known for the diversity of islands that make these islands what they are as they offer both granitic mountain clad islands as well as flat coral islands all offering unrivaled swimming with immaculate white sandy beaches that are lapped with clear and clean turquoise blue seas that remains warm on a year round basis.\nBut Seychelles is also known across the world as a religious tolerant country allowing everyone to not only observe, but to also practice their faith freely. Today even though the Roman Catholic Church still remains the predominant Church of the islands one can appreciate the diversity of faiths and religions in these mid ocean islands. TheAnglican Church, the Bahai Centre, the Hindu Temple, the Muslin Mosques, the Buddhists, the Adventists Church and Pentecostal Churches amongst others are all set up side by side offering a rare atmosphere of total harmony through the Inter Faith Body that meets often to ensure every one is seen and noticed.\nIt is against this backdrop that Minister Alain St.Ange, the Seychelles Minister responsible for Tourism and Culture jumped to the opportunity when he was invited to see for himself the great Bahai centre of Hyfa as he was in that Israeli City for a few hours during his working visit. “Understanding and appreciating faiths and religions of the world helps anyone better understand ourselves” said the Seychelles Minister . “The imposing Bahai centre with its immaculate manicured gardens remain a must visit site because this side of Israel with its own diversity of faiths few appreciate unless Israel has been visited” said Minister St.Ange.\nSource:- Seychelles Tourism", "external_links": [], "published": "2015-08-07T03:00:00.000+03:00", "crawled": "2015-08-08T03:03:02.416+03:00", "highlightTitle": ""}