{"organizations": [], "uuid": "dfd3a52b085cdb47af09a2b3ee488be3af47949b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25733", "country": "", "title": "Bangkok bombing a brief impact on tourism: officials", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "Bangkok bombing a brief impact on tourism: officials", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "dfd3a52b085cdb47af09a2b3ee488be3af47949b"}, "author": "Michael MacKey, Bangkok, August 26, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25733", "ord_in_thread": 0, "title": "Bangkok bombing a brief impact on tourism: officials", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bangkok bombing a brief impact on tourism: officials Michael MacKey, Bangkok, August 26, 2015 \nTHAILAND is bracing itself for what it believes will be only a brief post-bomb turbulence on tourist arrivals, said the Ministry of Tourism and Sports during a press conference in Bangkok today. \n\nThe Thai government acknowledged a blip in arrivals after the bombing, but expect measures being put in place to bring forth a quick and strong recovery. \n\n“The incident has had an impact, but it is limited, as hotel bookings and reservations are still good up till the end of the year,” said Kobkarn Wattanavrangkul, Thailand’s minister of tourism and sports during today's press conference. \n\nAreepong Bhoocha-oom, permanent secretary of the Ministry of Sport and Tourism told TTG Asia e-Daily that the daily arrivals at all the country’s international airports combined were at 85,000 till August 17, when a bomb blew up at the Erawan Shrine in Bangkok. \n\nAfter the bombing, daily arrivals fell to 70,000, which was still 10 per cent higher than the same period last year, he added. Conference arrivals during the August 1-23 period, meanwhile, reached 2.1 million, up 31.7 per cent from the same period in 2014. \n\nOfficials are emphasising on the moves taken to stabilise the market, pointing to the estimated 4,000 more security officers being stationed across public places in Bangkok. They also point to the increased and improved use of technology such as CCTV as well as support given to the bomb victims. \n\nThailand is still on track to meet its arrival target this year, according to the minister. In addition, Thailand will be stepping up marketing efforts in key source markets such as China, added Kobkarn.", "external_links": [], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T12:24:29.088+03:00", "highlightTitle": ""}