{"organizations": [], "uuid": "36cd7a30fd618181f741858ba481e10f4f027397", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/NaplesMarcoIslandEverglades-04aug15.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/naples-marco-island-everglades-cvb-re-accredited-in-destination-management-and-marketing/", "country": "US", "title": "Naples Marco Island Everglades CVB re-accredited in Destination Management and Marketing", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Naples Marco Island Everglades CVB re-accredited in Destination Management and Marketing - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "36cd7a30fd618181f741858ba481e10f4f027397"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/naples-marco-island-everglades-cvb-re-accredited-in-destination-management-and-marketing/", "ord_in_thread": 0, "title": "Naples Marco Island Everglades CVB re-accredited in Destination Management and Marketing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Naples Marco Island Everglades CVB re-accredited in Destination Management and Marketing\nThe Naples, Marco Island, Everglades Convention and Visitors Bureau (CVB), Collier County, Florida’s official tourism destination management organization (DMO), was re-accredited in the Destination Marketing Accreditation Program (DMAP) by Destination Marketing Association International (DMAI) at the organization’s recent annual conference in Austin, Texas. The CVB was the first Florida DMO to achieve accreditation in 2006, which was renewed in 2010. The CVB recently completed the entire process to be fully re-accredited. The CVB is one of only 208 accredited DMOs worldwide. There are over 600 DMOs in the U.S. alone.\nThe accreditation seal was granted in recognition of the CVBs commitment to industry excellence and for meeting the industry standards for performance and accountability of DMOs around the world. The accreditation program requires a DMO to successfully comply with a multitude of mandatory and voluntary standards that span a variety of performance areas to gain this momentous achievement. The standards cover nearly all aspects related to the management and marketing of a DMO including governance, finance, human resources, sales, communications, destination development and research.\n“DMAP accreditation requires DMOs like ours to truly evaluate and define not only their policies and procedures, but also determine their guiding principles and solidify their importance to their communities in all they do,” said Jack Wert, executive director for the CVB and Collier County’s tourism department, and the current DMAP board chair. “The Naples, Marco Island, Everglades CVB joins the ranks of over 200 DMOs worldwide that have obtained DMAP recognition demonstrating compliance across 16 disciplines composed of 53 mandatory standards. DMAP is globally recognized by the destination marketing industry as the highest achievement in destination excellence.”\n“We are pleased to have the Naples, Marco Island, Everglades CVB join our distinguished group. I look forward to their participation and influence as a part of the growing DMAP community,” added Valencia Bembry, Senior Vice President of Accreditation and Strategic Initiatives at DMAI.\nSource:- IAGTO", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T21:42:40.950+03:00", "highlightTitle": ""}