{"organizations": [], "uuid": "e698493daa93c38548ab381f0bd45fbc855e8a0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62096/creation-canadas-46th-national-park-announced", "country": "US", "title": "Creation of Canada's 46th national park announced", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Creation of Canada's 46th national park announced", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T04:09:00.000+03:00", "replies_count": 0, "uuid": "e698493daa93c38548ab381f0bd45fbc855e8a0d"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/62096/creation-canadas-46th-national-park-announced", "ord_in_thread": 0, "title": "Creation of Canada's 46th national park announced", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Creation of Canada's 46th national park announced Adv: Leona Aglukkaq, Minister of the Environment and Minister responsible for Parks Canada Adv: \nOTTAWA, Canada - The Honourable Leona Aglukkaq, Minister of the Environment and Minister responsible for Parks Canada, along with the Honourable Dan Crummell, Minister of Environment and Conservation for the Province of Newfoundland and Labrador and Ms. Anastasia Qupee, Grand Chief of the Innu Nation, today announced Akami–uapishku - KakKasuak - Mealy Mountains National Park Reserve as Canada's 46th national park. \nThe agreement between the governments of Canada and Newfoundland and Labrador will see the transfer of 10,700 square kilometres of land from the province to the Government of Canada to create the national park reserve. The national park proposal was the subject of extensive consultation with Labradorians, local communities, stakeholders and Aboriginal groups. \nThe Government of Canada and the Innu Nation agreement will ensure the management of the national park reserve respects the rights and interests of the Innu and provides for the continued use by Innu of the land and its resources. The agreement confirms cooperative management and planning of the park between the Innu and Parks Canada. Parks Canada is also working to finalize collaborative relationships with the Nunatsiavut Government, NunatuKavut Community Council and the Quebec Innu. \nThe national park reserve in the Mealy Mountains of Labrador will protect a nationally significant example of the East Coast Boreal Natural Region. The landscape is also of great cultural significance to Aboriginal people. The area includes mountain tundra, marine coasts, boreal forests, islands and rivers that are home to Atlantic salmon and trout. It will also protect important habitat for the threatened Mealy Mountains caribou herd, as well as for wolves, black bear, martens and many other species of wildlife. \nThis new national park reserve will provide unique Aboriginal cultural experiences and outdoor recreation activities such as canoeing, backcountry camping, and hiking. \nThe park's creation contributes to Canada's National Conservation Plan with concrete action to conserve Canada's lands and waters and connect Canadians to nature. \nQuick Facts \n• The national park reserve will protect roughly 10,700 sq. km, an area the size of Jamaica. \n• Mealy Mountains National Park Reserve has been under consideration since the mid-1970s and will be the largest national park in Eastern Canada. \n• The national park reserve is named for the Mealy M0untains, glacially-rounded, bare rock summits which overlook Lake Melville and reach to 1,100 metres. Akami–uapishku and KakKasuak are the traditional names for the park reserve: Akami–uapishku is the Innu name for the area meaning White Mountain across and KakKasuak is the Labrador Inuit word for mountain. \n• The Mealy Mountains National Park Reserve is home to a 50 km long beach, the Wunderstrand, which was mentioned in the Viking sagas. \n• The national park reserve will be formally protected under the Canada National Parks Act once a Park Impacts and Benefits Agreement has been negotiated with the Nunatsiavut Government and a bill tabled in Parliament. \nQuotes \n\"Our Government has demonstrated unparalleled leadership in the conservation and protection of Canada's natural heritage. We have presided over one of the greatest periods of conservation in Canada's history. Getting this done is a huge accomplishment for both the region and Canada and I am proud that today's hard work means future generations will be able to experience this beautiful part of our country.\" \nThe Honourable Leona Aglukkaq, Minister of the Environment and Minister responsible for Parks Canada \n\"The Mealy Mountains National Park Reserve represents an excellent model of sustainable environmental, social and economic benefits for residents and communities of Newfoundland and Labrador. The Provincial Government is committed to protecting provincially and nationally significant landscapes and contributing to a Canada-wide network of protected areas and I welcome the addition of the Mealy Mountains National Park Reserve to our existing parks and protected areas system.\" \nThe Honourable Dan Crummell, Minister of Environment and Conservation Province of Newfoundland and Labrador \n\"Our Elders have been stewards of Akami–uapishku for countless generations. Innu Nation looks forward to sharing the natural and cultural heritage of our land and the Innu way of life with all Canadians.\" \nGrand Chief Anastasia Qupee, Innu Nation", "external_links": [], "published": "2015-08-01T04:09:00.000+03:00", "crawled": "2015-08-01T04:00:51.439+03:00", "highlightTitle": ""}