{"organizations": [], "uuid": "d2566de86fadd5c38a9ebe4c08752f173d9768a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/09/Tourism-Australia.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-partnership-to-strengthen-australias-share-of-luxury-tourism-market/", "country": "US", "title": "New Partnership To Strengthen Australia's Share Of Luxury Tourism MarketTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "New Partnership To Strengthen Australia's Share Of Luxury Tourism MarketTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "d2566de86fadd5c38a9ebe4c08752f173d9768a7"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-partnership-to-strengthen-australias-share-of-luxury-tourism-market/", "ord_in_thread": 0, "title": "New Partnership To Strengthen Australia's Share Of Luxury Tourism MarketTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Partnership To Strengthen Australia’s Share Of Luxury Tourism Market\nTourism Australia has signed a major new partnership with the world’s leading luxury travel network, Virtuoso®, in an agreement which will help build greater connection between the international luxury market and Australia’s highly desirable luxury offering.\nTourism Australia’s Managing Director, John O’Sullivan and Virtuoso CEO and Chair, Matthew D. Upchurch launched the partnership at Virtuoso Travel Week in Las Vegas, the biggest luxury travel extravaganza where travel advisors shop for the best, high end travel products from around the world.\n“Australia is one of the top destinations for our US market, with an impressive 137 per cent growth in year-on-year bookings from our network of luxury travel agencies across the US. This partnership is a fantastic opportunity to further leverage this demand for both our clients, and the Australian tourism industry,” Mr Upchurch said.\n“Americans love Australia – the wide open spaces, great beaches, amazing wildlife, food and that famous Aussie spirit. This agreement, and the marketing and education elements that go with it, will help Virtuoso’s members to really understand the Australian product in order to sell great holidays to their high net worth clients.\n“Virtuoso is the network, through more than 370 travel agencies and 9,800 travel advisors across the world that provides luxury travel sales worth more than US$14 billion a year. Our members are talented and passionate experts who are connected to the best products on offer and they ensure their clients get the kind of VIP treatment you can’t get yourself.”\nMr O’Sullivan, who joined Tourism Australia’s LA-based partnership team at Virtuoso Travel Week, said the announcement coincided with the relaunch of the award winning Aussie Specialist Program (ASP) which helps to equip advisors with the knowledge and skills to sell Australia.\n“We’ve put a lot of focus in the past 12 months into finding distribution partners which help us better target high yielding international travellers, and nowhere is this more important than the United States,” Mr O’Sullivan said.\n“The US now boasts more high net worth individuals than any other market in the world and these discerning travellers are looking for a unique, distinctive and high quality holiday experience, which we know Australia possesses.\n“We will be investing additional marketing dollars and increasing resources on the ground, as well as working closely with our Australian state and territory tourism partners to ensure our premium story is told and sold well in the US,” he said.\nAustralia’s desirability is evidenced in the latest tourism data released last month showing that US visitors have spent close to A$2.95 billion, an increase of 14 per cent over the year.\nTourism Australia’s Regional General Manager Americas, Jane Whitehead said Virtuoso had an impressive network of premium travel advisors who generated more than US$10 billion in sales from the US and Canada each year.\n“With Virtuoso’s high-end client base, we now have an established distribution partner that will help us package and promote the best of our country’s premium product to this very important and lucrative market,” she said.\nThe agreement, which includes Destination NSW, the South Australian Tourism Commission, Tourism Northern Territory and Tourism Tasmania will last through until 2016 and will include a digital and print marketing campaign with a focus on trade engagement and agent training.\nSource:- Tourism Australia", "external_links": [], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-12T04:19:54.894+03:00", "highlightTitle": ""}