{"organizations": [], "uuid": "1589b87578c938d7341206cff9cc15d582f6e583", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28066-travelport-hotelzon-appoints-daniel-guillou-as-managing-director", "country": "US", "title": "Travelport Hotelzon appoints Daniel Guillou as Managing Director", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Travelport Hotelzon appoints Daniel Guillou as Managing Director", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T12:00:00.000+03:00", "replies_count": 0, "uuid": "1589b87578c938d7341206cff9cc15d582f6e583"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28066-travelport-hotelzon-appoints-daniel-guillou-as-managing-director", "ord_in_thread": 0, "title": "Travelport Hotelzon appoints Daniel Guillou as Managing Director", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travelport Hotelzon appoints Daniel Guillou as Managing Director Travelport Hotelzon appoints Daniel Guillou as Managing Director Details Category: Appointments   10:00 ravelport Hotelzon, a leading hotel distribution technology provider for the B2B travel industry, has announced the appointment of Daniel Guillou as its new Managing Director, effective immediately. Based in Finland, Guillou will be responsible for taking Travelport Hotelzon to its next level of growth through further international expansion including entry into new territories outside of Europe. \nGuillou brings over 20 years’ experience working in the international IT and telecommunications industry where he held leadership positions at a number of high profile organizations including Ericsson and Tieto. In his most recent role at Tieto, the largest Nordic IT services company, Guillou successfully drove solid growth across his customer portfolio. He also has extensive experience of working in other regions having held roles in Japan, Nigeria and the Netherlands during his career. Commenting on the appointment, Niklas Andréen, SVP of Hospitality and Digital Media for Travelport, said: “I am delighted to welcome Daniel to Travelport Hotelzon, bringing as he does significant experience and expertise in growing entrepreneurial start-up companies, leading high performing teams and driving business transformation. His timely appointment marks the start of a new phase for the business as it embarks on its second year with Travelport with ambitions to grow in the hotel and corporate travel space on an international basis.” Guillou added: “I cannot be happier joining a leading business like Travelport Hotelzon. The opportunity is huge; the team has an intensive focus on developing pioneering products for its corporate and hotel customers while taking up the challenge of expanding its network into new territories. I look forward to building on that foundation and applying my experience so we realize the full growth potential of the business over the coming years.” Also joining the Travelport Hotelzon senior management team this month is Olli Kaivola as Head of Finance. Kaivola brings with him extensive experience in auditing, tax law and financial and management reporting. Related articles", "external_links": [], "published": "2015-08-05T12:00:00.000+03:00", "crawled": "2015-08-05T13:35:53.419+03:00", "highlightTitle": ""}