{"organizations": ["Marcus Corporation Files Universal Shelf Registration Statement The Marcus Corporation Files Universal Shelf Registration"], "uuid": "5695514e65ad8b21a8d17df49479900104453e29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtTWQ==", "section_title": "Business Wire Travel: Lodging News", "url": "http://www.businesswire.com/news/home/20150811005236/en/Marcus-Corporation-Files-Universal-Shelf-Registration-Statement", "country": "US", "title": "The Marcus Corporation Files Universal Shelf Registration Statement", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "The Marcus Corporation Files Universal Shelf Registration Statement", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T00:00:00.000+03:00", "replies_count": 0, "uuid": "5695514e65ad8b21a8d17df49479900104453e29"}, "author": "", "url": "http://www.businesswire.com/news/home/20150811005236/en/Marcus-Corporation-Files-Universal-Shelf-Registration-Statement", "ord_in_thread": 0, "title": "The Marcus Corporation Files Universal Shelf Registration Statement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Marcus Corporation Files Universal Shelf Registration Statement August 11, 2015 05:00 PM Eastern Daylight Time \nMILWAUKEE--( BUSINESS WIRE )-- The Marcus Corporation (NYSE: MCS) today announced that it has filed a new universal shelf registration statement with the Securities and Exchange Commission to allow The Marcus Corporation to potentially offer an indeterminate principal amount and number of securities in the future with a proposed maximum aggregate offering price of up to $150,000,000. The new shelf registration statement replaces The Marcus Corporation’s prior universal shelf registration statement, which is scheduled to expire on October 26, 2015. \nUnder the shelf registration statement, The Marcus Corporation will have the flexibility to publicly offer and sell from time to time debt securities, common stock, preferred stock, warrants and other securities or any combination of such securities. The Marcus Corporation may periodically offer one or more of these securities in amounts, at prices and on terms announced if and when the securities are ever offered. The specifics of any potential future offerings, along with the use of proceeds of any such securities offered by The Marcus Corporation, will be described in detail in a prospectus supplement at the time of any such offering. \nGregory S. Marcus, president and chief executive officer of The Marcus Corporation, said, “Like many public companies who file these types of registration statements, we consider this filing to be a proactive step to facilitate our future ability to raise public equity or debt capital to potentially expand existing businesses, fund potential acquisitions, invest in other growth opportunities, or repay existing debt.” \nThis press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to the registration or qualification under the securities laws of any such state or jurisdiction. \nAbout The Marcus Corporation \nHeadquartered in Milwaukee, Wisconsin, The Marcus Corporation is a leader in the lodging and entertainment industries, with significant company-owned real estate assets. The Marcus Corporation’s theatre division, Marcus Theatres® , currently owns or manages 681 screens at 55 locations in Wisconsin, Illinois, Iowa, Minnesota, Nebraska, North Dakota and Ohio. The company’s lodging division, Marcus® Hotels & Resorts , owns and/or manages 20 hotels, resorts and other properties in 11 states. For more information, visit the company’s web site at www.marcuscorp.com . \nCertain matters discussed in this press release are “forward-looking statements” intended to qualify for the safe harbors from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements may generally be identified as such because the context of such statements include words such as we “believe,” “anticipate,” “expect” or words of similar import. Similarly, statements that describe our future plans, objectives or goals are also forward-looking statements. Such forward-looking statements are subject to certain risks and uncertainties which may cause results to differ materially from those expected, including, but not limited to, the following: (1) the availability, in terms of both quantity and audience appeal, of motion pictures for our theatre division, as well as other industry dynamics such as the maintenance of a suitable window between the date such motion pictures are released in theatres and the date they are released to other distribution channels; (2) the effects of adverse economic conditions in our markets, particularly with respect to our hotels and resorts division; (3) the effects on our occupancy and room rates of the relative industry supply of available rooms at comparable lodging facilities in our markets; (4) the effects of competitive conditions in our markets; (5) our ability to achieve expected benefits and performance from our strategic initiatives and acquisitions; (6) the effects of increasing depreciation expenses, reduced operating profits during major property renovations, impairment losses, and preopening and start-up costs due to the capital intensive nature of our businesses; (7) the effects of adverse weather conditions, particularly during the winter in the Midwest and in our other markets; (8) our ability to identify properties to acquire, develop and/or manage and the continuing availability of funds for such development; and (9) the adverse impact on business and consumer spending on travel, leisure and entertainment resulting from terrorist attacks in the United States or incidents such as the recent tragedy in a movie theatre in Louisiana. Shareholders, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. The forward-looking statements made herein are made only as of the date of this press release and we undertake no obligation to publicly update such forward-looking statements to reflect subsequent events or circumstances. Contacts", "external_links": [], "published": "2015-08-12T00:00:00.000+03:00", "crawled": "2015-08-12T01:43:23.794+03:00", "highlightTitle": ""}