{"organizations": [], "uuid": "ce41602f2f0001c0bb1783652fab433251c68dcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/28/19/5d/eb7e62c1899d432eb4bec5eface735fd-52b5bee854834fdfaa136f191f86e551-0.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/top-news/businesses-reopening-at-scene-of-deadly-on-air-sho/nnSW7/", "country": "US", "title": "Gunman in TV killings remembered as 'professional victim' | www.ajc.com", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Gunman in TV killings remembered as 'professional victim' | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T10:27:00.000+03:00", "replies_count": 0, "uuid": "ce41602f2f0001c0bb1783652fab433251c68dcd"}, "author": "ALAN SUDERMAN and ADAM GELLER", "url": "http://www.ajc.com/ap/ap/top-news/businesses-reopening-at-scene-of-deadly-on-air-sho/nnSW7/", "ord_in_thread": 0, "title": "Gunman in TV killings remembered as 'professional victim' | www.ajc.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vester Flanagan constantly saw himself as the target in his conflicts with WDBJ-TV colleagues, leading his former boss to describe him as a \"professional victim.\"\nWhen the station tried to persuade Flanagan to get along better with his co-workers, he accused them of discrimination.\n\"He was victimized by everything and everyone and could never quite grasp the fact that he was the common denominator in all of these really sometimes serious interpersonal conflicts that he had with people,\" said Dan Dennison, the former news director at WDBJ in Virginia.\nRoanoke City Council member Anita Price, right, is comforted by friend Jan DeVries as they gather at a candlelight vigil in front of the WDBJ-TV station in Roanoke, Va., Thursday, Aug. 27, 2015, a day after reporter Alison Parker and cameraman Adam Ward from the station were killed during a live broadcast. Vester Flanagan filmed himself gunning down the journalists and posted the video on social media after fleeing the scene. (AP Photo/Don Petersen) Flanagan killed two of his former colleagues on Wednesday during a live broadcast and later died of a self-inflicted gunshot wound.\nOn the day he was fired in 2013, Flanagan pressed a wooden cross into Dennison's hand and said, \"You'll need this,\" as two police officers escorted him out. Flanagan's departure was filmed by Adam Ward, the cameraman who was killed along with reporter Alison Parker.\nParker and Ward died of gunshot wounds to the head and body, the medical examiner's office said Friday. The woman Parker was interviewing, Vicki Gardner, was shot in the back and was in good condition at a hospital.\nPeople attend a vigil in front of the WDBJ-TV station in Roanoke, Va., Thursday, Aug. 27, 2015, a day after reporter Alison Parker and cameraman Adam Ward from the station were killed during a live broadcast. Vester Flanagan filmed himself gunning down the journalists and posted the video on social media after fleeing the scene. (AP Photo/Don Petersen) Gov. Terry McAuliffe met privately Friday with grieving station employees to share his condolences. The 50 or so workers have been described as a close-knit group, and they have continued reporting on their slain colleagues in the face of the tragedy.\n\"The courage and determination they showed is truly, truly extraordinary,\" McAuliffe said outside the station.\nHe talked about his support for universal background checks for gun purchases and said \"there are too many guns in America and there are clearly too many guns in the wrong hands.\" But McAuliffe, himself a gun owner, also said Flanagan had passed a background check.\nA makeshift memorial for WDBJ-TV reporter Alison Parker and cameraman Adam Ward gathers by a tree near the station Thursday, Aug. 27, 2015, in Roanoke, Va. Vester Flanagan filmed himself gunning down the journalists and posted the video on social media after fleeing the scene. (Erica Yoon/The Roanoke Times via AP) LOCAL TELEVISION OUT; SALEM TIMES REGISTER OUT; FINCASTLE HERALD OUT; CHRISTIANBURG NEWS MESSENGER OUT; RADFORD NEWS JOURNAL OUT; ROANOKE STAR SENTINEL OUT; MANDATORY CREDIT Dennison, the former news director, said WDBJ had no idea of Flanagan's personal shortcomings before he was hired there and he had received positive recommendations.\nFlanagan's hair-trigger temper became evident at least 15 years ago at WTWC-TV in Tallahassee, Florida, said Don Shafer, who hired him there in 1999. Shafer recalled Flanagan as a good reporter and a \"clever, funny guy\" — but he also had conflicts with co-workers \"to the point where he was threatening people.\"\n\"Had some physical confrontations with a couple of people, and at one point became such a distraction that we finally had to terminate him,\" said Shafer, now news director with XETV in San Diego.\nDan Dennison, a former news director at WDBJ-TV in Roanoke, Va., speaks in Honolulu, Thursday, Aug. 27, 2015. Dennison said Thursday the former employee, Vester Flanagan, who shot two ex-colleagues on live television had a long history of being a \"professional victim.\" (AP Photo/Audrey McAvoy) After stints in California, Florida and North Carolina, Flanagan's last television job was at WDBJ in Roanoke.\nOthers who ran across Flanagan after he lost his job at WDBJ described a man increasingly irked by slights more often imagined than real.\nA former co-worker at a UnitedHealthcare call center where Flanagan worked until late 2014 said he tried to grab her shoulder and told her never to speak to him again after she offhandedly said he was unusually quiet.\nAttorney General Mark Herring speaks at a candlelight vigil Thursday, Aug. 27, 2015, for WDBJ-TV reporter Alison Parker and cameraman Adam Ward, in Roanoke, Va. Vester Flanagan filmed himself gunning down the journalists and posted the video on social media after fleeing the scene Wednesday. (Erica Yoon/The Roanoke Times via AP) LOCAL TELEVISION OUT; SALEM TIMES REGISTER OUT; FINCASTLE HERALD OUT; CHRISTIANBURG NEWS MESSENGER OUT; RADFORD NEWS JOURNAL OUT; ROANOKE STAR SENTINEL OUT; MANDATORY CREDIT The manager of a bar in Roanoke said Flanagan was so incensed when no one thanked him for his business as he left the tavern that he sent a nearly 20-page letter, lambasting employees' behavior.\nFlanagan described himself in a court document as an aggrieved and unappreciated victim.\n\"How heartless can you be? My entire life was disrupted after moving clear across the country for a job only to have my dream turn into a nightmare,\" Flanagan wrote in a letter to a judge filed as part of his 2013 lawsuit against WDBJ-TV. \"Your Honor, I am not the monster here.\"\nThe lawsuit was dismissed in July 2014. But in recent weeks, Flanagan laid careful plans for retribution. He contacted ABC News about what he claimed was a story tip and filled his Facebook page with photos and video montages seemingly designed to introduce himself to a larger audience.\nOn Wednesday, after killing Parker, 24, and Ward, 27, he went online to claim they had wronged him in the past.\nHe also texted a friend suggesting he had \"done something stupid,\" investigators wrote in a search warrant. He turned the gun on himself when police caught up to him a few hours later. Inside his rental car, investigators found extra license plates, a wig, shawl, sunglasses and a hat as well as some stamped letters and a \"to do\" list.\nOn Thursday, the station's general manager, Jeffrey Marks, recalled a series of problems with Flanagan while he worked at WDBJ from March 2012 to February 2013. Flanagan accused a news photographer of trespassing on private property. He confronted an anchor over a story and attempted to reach the company's CEO to complain. He filed a complaint with the Equal Employment Opportunity Commission, as well as the lawsuit.\nFlanagan's joking and smiling one minute could turn to anger in the next, former colleague Justin McLeod said.\nOnce, for no apparent reason, Flanagan told a photographer he knew the man didn't like him because he was gay. The photographer told Flanagan he hadn't known about his sexual orientation, McLeod said.\nFormer co-workers, surprised that Flanagan had stayed in town after losing his job, passed him from time to time. They called them \"Bryce sightings,\" referring to Flanagan's on-air name, Bryce Williams, McLeod said.\nOthers who crossed paths with Flanagan during that time, said he took offense easily.\nHeather Fay, general manager of Jack Brown's Beer & Burger Joint in downtown Roanoke, said she threw out a lengthy letter Flanagan had sent, criticizing the staff for telling customers to \"have a nice day\" instead of \"thank you.\"\n\"It was bizarre, for sure,\" she said.\nFlanagan's interpersonal conflicts were at odds with the outgoing student some recalled in Oakland, California, where he was chosen junior prince at Skyline High School's homecoming. At San Francisco State University, Flanagan relished being in the spotlight during group presentations.\n\"He was such a nice guy, just a soft-spoken, well-dressed, good-looking guy. He never had any problems, no fights, nothing like that,\" said a high school classmate, Chris Dobbins, now an Oakland attorney.\n___\nAssociated Press reporters Matthew Barakat, Jonathan Drew, Alan Suderman, John Raby and David Dishneau in Roanoke, Virginia; Larry O'Dell in Richmond, Virginia; Audrey McAvoy in Honolulu; Holbrook Mohr in Jackson, Mississippi; Terry Chea in Vallejo, California; Garance Burke in Oakland, California; Julie Watson in San Diego and researcher Jennifer Farrar in New York contributed to this story.", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/28/53/14/eb7e62c1899d432eb4bec5eface735fd-52b5bee854834fdfaa136f191f86e551-2.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/28/33/df/eb7e62c1899d432eb4bec5eface735fd-d47cd6469e2f49a4a0ae6d1480dfc1a8-4.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/28/68/62/eb7e62c1899d432eb4bec5eface735fd-d47cd6469e2f49a4a0ae6d1480dfc1a8-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/28/19/5d/eb7e62c1899d432eb4bec5eface735fd-52b5bee854834fdfaa136f191f86e551-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/28/1e/06/eb7e62c1899d432eb4bec5eface735fd-d47cd6469e2f49a4a0ae6d1480dfc1a8-1.jpg"], "published": "2015-08-28T10:27:00.000+03:00", "crawled": "2015-08-28T21:40:55.141+03:00", "highlightTitle": ""}