{"organizations": [], "uuid": "a0599ee408b9998dbd718ac46178dc0c33eabdd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62617/seychelles-musicians-wall-fame-enter-la-digue-veteran-artists", "country": "US", "title": "Seychelles Musicians’ Wall of Fame: Enter La Digue veteran artists", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Seychelles Musicians’ Wall of Fame: Enter La Digue veteran artists", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T23:03:00.000+03:00", "replies_count": 0, "uuid": "a0599ee408b9998dbd718ac46178dc0c33eabdd4"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/62617/seychelles-musicians-wall-fame-enter-la-digue-veteran-artists", "ord_in_thread": 0, "title": "Seychelles Musicians’ Wall of Fame: Enter La Digue veteran artists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seychelles Musicians’ Wall of Fame: Enter La Digue veteran artists   \nAug 14, 2015 Banners   \nFour veteran artists from La Digue have been added to the Seychelles Musicians’ Wall of Fame at the entrance of National Cultural Centre. \nDespilly Williams, Jeanne Legge, Thomas Knowles, and Fernande Armantine, have theirs stars engraved into the Musicians’ Wall of Fame. \nIt was the Minister for Tourism and Culture, Alain St.Ange, who publicly announced the names of the four veterans from La Digue, and together with the Designated Minister, Vincent Meriton, who also heads the Ministry of Community Development, Social Affairs and Sports; Jean Paul Adam, the Minister for Finance, Trade and Blue Economy; Benjamine Rose, the Principal Secretary for Culture; and Sherin Naiken, the Chief Executive of the Seychelles Tourism Board, unveiled the four stars in the Musicians’ Wall of Fame. \nIt is not surprising that names of four veteran artists from La Digue are mentioned and engraved on a star in the Musicians’ Wall of Fame. \nIn 2013, the Ministry of Tourism and Culture, National Arts Council and Seychelles Musicians Association (SEMAS), came out with a new initiative to recognize artists for their long-standing contribution in the country’s musical arena. \nThe Musician’s Wall of Fame was born during Festival Kreol with it two shooting stars, Francois Havelock and David Philoe. \nIn 2014, for Festival Kreol, Jany De Letourdie, Patrick Victor, David Andre, Jean Marc Volcy, and Jean Marc Volcy joined the stars of the Wall of Fame. \nThe Ministry of Tourism and Culture and the National Arts Council and the Seychelles Musicians Association made it their duty not to rely solely during the Festival Kreol to honor living artists, but to unveil the stars during the Ministry of Tourism and Culture’s annual calendar of events. \nIt is with this in mind, for the eve of La Digue’s Feast of the Assumption, the timing was right to add four veteran artists from La Digue in the Musician’s Wall of Fame. \nMinister St.Ange congratulated the four artists for their hard work in putting culture in the center of development. \n“Culture is one aspect of our country, where Seychellois have contributed immensely to bring the performing and visual arts where it is today. There is no nation without culture. It is the culture that forge a nation and give its people its identity,” said Minister St.Ange, adding that it is the duty of the Ministry of Tourism and Culture to honor its living artists. \n“I would like to congratulate Thomas Knowles for inspiring our people with his music, Fernande Armantine for creating the mardilo dance troupe and passing it within her family’s generation, Despilly William whose hits have inspired so many Seychellois, and Jeanne Legge who continues to be an inspiration for our young people. You have done a lot for culture, and with this star you will always be remembered and never forgotten,” said Minister St.Ange. \nThe unveiling of the stars took place in the absence of Despilly William and Jeanne Legge who for unforeseen circumstances could not make it to the ceremony. However, it will be during the show of Joseph Sinon organized on La Digue for the Feast of Assumption, that all the four artists will receive their certificates in the presence of their people. \nThe Seychelles Musicians’ Association (SEYMAS) said other forms of arts will in the coming future be included as nominees for the Musicians’ Wall of Fame. He appealed to these associations to submit their proposals to the Seychelles Musicians’ Association. \nSeychelles is a founding member of the International Coalition of Tourism Partners (ICTP) . Source: Seychelles Ministry of Tourism and Culture", "external_links": [], "published": "2015-08-14T23:03:00.000+03:00", "crawled": "2015-08-15T12:28:44.890+03:00", "highlightTitle": ""}