{"organizations": [], "uuid": "cd6799408d05f302d747c280d7a6ad0064d2a091", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29812685/whats-charging-the-demand-for-battery-energy-storage-systems", "country": "US", "title": "What's Charging the Demand for Battery Energy Storage Systems?", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "What's Charging the Demand for Battery Energy Storage Systems? - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "cd6799408d05f302d747c280d7a6ad0064d2a091"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29812685/whats-charging-the-demand-for-battery-energy-storage-systems", "ord_in_thread": 0, "title": "What's Charging the Demand for Battery Energy Storage Systems?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Frost & Sullivan\nFrost & Sullivan partners with The Battery Show to discover what's charging the future of the energy storage industry\nMOUNTAIN VIEW, Calif. , Aug. 18, 2015 /PRNewswire/ -- Recently, Frost & Sullivan issued a joint survey with The Battery Show detailing the energy storage industry and potential challenges of the future in its early stages of development . In an effort to discover what's charging the swelling energy storage industry, the survey will investigate battery industry contributor's attitudes towards key issues such as positive and preventative aspects of the market, which will dictate the future of the industry.\nPhoto - http://photos.prnewswire.com/prnh/20150818/259284\nBattery and energy storage users across industries are invited to participate in the short survey by clicking the following link: http://bit.ly/1GLuYxv .\nThe survey provides participants the opportunity to anonymously share their view of the industry and assist in updating battery industry participants of their client's opinions on key industry trends. Participants of the survey will be entered into a drawing for one free delegate pass to attend The Battery Show this September in addition to receiving the results of the survey following the conference.\nThe survey investigates the following:\nKey market trends Factors driving & restraining the market Potential market size Major competitors in the market Seasoned Frost & Sullivan Energy & Environment Research Manager, Vishal Sapru will conduct a presentation on the results found during the survey. As the presentation will focus on the growing demand for battery energy storage systems (BESS), Sapru will unveil the battery market discoveries.\n\"At the heart of many technological innovations are the batteries that store the power needed to drive these breakthrough innovations. The batteries market has been growing at a compound annual growth rate of over 20 percent,\" noted Frost & Sullivan Energy & Environment Research Manager, Vishal Sapru . \"This survey will help us understand the overall spend on energy storage, regions that hold future growth potential and emerging technologies that will make energy storage more reliable and safe, and key competitors.\"\nAbout The Battery Show\nTaking place September 15-17, 2015 , in Novi , Detroit, Michigan , The Battery Show 2015 is the premier showcase of the latest advanced battery technology. The exhibition hall offers a platform to launch new products, make new contacts and maintain existing relationships. With more qualified buyers and decision makers than any other event in North America , The Battery Show 2015 is the key to unlocking your future business opportunities.\nThe Battery Show is attended by technical leaders, scientists, engineers, project leaders, buyers and senior executives concerned with advanced energy storage and will host the very latest advanced battery solutions for electric & hybrid vehicles, utility & renewable energy support, portable electronics, medical technology, military and telecommunications.\nAbout Frost & Sullivan\nFrost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants.\nOur \"Growth Partnership\" supports clients by addressing these opportunities and incorporating two key elements driving visionary innovation: The Integrated Value Proposition and The Partnership Infrastructure.\nThe Integrated Value Proposition provides support to our clients throughout all phases of their journey to visionary innovation including: research, analysis, strategy, vision, innovation and implementation. The Partnership Infrastructure is entirely unique as it constructs the foundation upon which visionary innovation becomes possible. This includes our 360 degree research, comprehensive industry coverage, career best practices as well as our global footprint of more than 40 offices. For more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organization prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies?\nContact Us: Start the discussion\nJoin Us: Join our community\nSubscribe: Newsletter on \"the next big thing\"\nRegister: Gain access to visionary innovation\nContact:\nJaylon Brinkley\nCorporate Communications\nP: 210.247.2481\nE: jaylon.brinkley@frost.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/whats-charging-the-demand-for-battery-energy-storage-systems-300129969.html\n ", "external_links": ["http://www.thebatteryshow.com/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/whats-charging-the-demand-for-battery-energy-storage-systems-300129969.html", "http://bit.ly/1GLuYxv", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Register", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Contact", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=PRFooter", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Join", "http://photos.prnewswire.com/prnh/20150818/259284", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA81823&Transmission_Id=201508181102PR_NEWS_USPR_____DA81823&DateId=20150818"], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-18T18:28:55.735+03:00", "highlightTitle": ""}