{"organizations": [], "uuid": "f81c4407be2027bab1b6895413dec23dd03b5604", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62294/iata-passenger-demand-remains-strong", "country": "US", "title": "IATA: Passenger Demand Remains Strong", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "IATA: Passenger Demand Remains Strong", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T13:48:00.000+03:00", "replies_count": 0, "uuid": "f81c4407be2027bab1b6895413dec23dd03b5604"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/62294/iata-passenger-demand-remains-strong", "ord_in_thread": 0, "title": "IATA: Passenger Demand Remains Strong", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IATA: Passenger Demand Remains Strong Adv: \nAug 06, 2015 Adv: \nThe International Air Transport Association (IATA) announced global passenger traffic results (revenue passenger kilometers or RPKs) for June showing a 5.7% increase in demand compared to June 2014. This was a slowdown compared to the 6.9% year-over-year growth recorded in May, in part owing to the timing of Ramadan, which depressed travel demand in the Middle East. June capacity (available seat kilometers or ASKs) climbed 6.0%, and load factor dipped 0.2 percentage points to 81.1%. \n\"June was another healthy month for demand for air connectivity, although slower trade activity in emerging Asia-Pacific markets and the impact of the Greek debt crisis on European travel remain worrisome,\" said Tony Tyler, IATA’s Director General and CEO. \nJune 2015 vs. June 2014 RPK Growth ASK Growth PLF International 5.3% 6.0% 80.4% Total Market 5.7% 6.0% 81.1% \nYTD 2015 vs. YTD 2014 RPK Growth ASK Growth PLF International 6.3% 6.2% 78.6% Total Market 6.3% 5.9% 79.4% \nInternational Passenger Markets \nJune international passenger demand rose 5.3% compared to June 2014. Airlines in all regions except Africa recorded growth although there was wide variation between regions. Capacity climbed 6.0% pushing down load factor 0.5 percentage points to 80.4%. \nAsia-Pacific airlines’ June traffic rose 6.8% compared to the year-ago period, which was down from a 9.3% rise recorded in May. Capacity climbed 5.8% and load factor increased 0.7 percentage points to 78.1%. Latest data show that trade activity to/from Emerging Asia is down 8% compared to the end of 2014, while China’s manufacturing sector has been struggling in recent months, accompanied by weakness in export orders, according to the financial data firm Markit. \nEuropean carriers saw demand climb 4.1% in June versus June 2014, which was below the 5.7% rise in traffic in May. Although business activity indicators suggest that the region’s economic recovery is on track, consumer sentiment has been hampered by events in Greece including the potential consequences of the country exiting the Eurozone. Capacity rose 3.5% and load factor climbed 0.4 percentage points to 84.0%. \nNorth American airlines experienced a 2.7% increase in traffic, which was above the 2% increase recorded in May. Capacity rose 2.8% and load factor slipped 0.1 percentage points to 84.9%, which still was the highest among the regions. While it is expected that the US had better economic performance in the second quarter than the first quarter, the strengthening dollar is likely to continue to put pressure on international leisure travel to the US. \nMiddle East carriers’ June demand climbed 10.5% but this was eclipsed by a 19.5% jump in capacity that caused load factor to plunge 5.7 percentage points to 74.3%. Although June traffic growth was slower than in May (14%), this was partly owing to the timing of Ramadan, which started in June this year but occurred mostly in July in 2014. The holy month tends to subdue demand for air travel. \nLatin American airlines had a 5.9% rise in traffic compared to June 2014. Capacity rose 5.8%, causing load factor to edge up 0.1 percentage points to 79.6%. Regional trade volumes showed strong improvement during the first half of 2015, providing a boost to business-related international travel despite weakness in Brazil and Argentina. \nAfrican airlines’ traffic fell 2.0% in June year-to-year, due to negative economic developments in parts of the continent including Nigeria, which relies heavily on oil revenues. Capacity slipped 1.7% and load factor dipped 0.2 percentage points to 67.1%. \nDomestic Passenger Markets \nDomestic travel demand rose 6.5% in June compared to June 2014, with the strongest growth occurring in India, China and the Russian Federation. Total domestic capacity was up 6.0%, and load factor was 82.2%, up 0.4 percentage points. \nJune 2015 vs June 2014 RPK Growth ASK Growth PLF Australia -2.1% -3.3% 74.8% China P.R 12.1% 10.1% 80.4% India 16.3% 6.6% 84.5% Russian Federation 9.5% 16.6% 75.4% US 4.9% 4.9% 87.6% Domestic 6.5% 6.0% 82.2% \nAustralia’s airlines saw domestic traffic decline by 2.1% in June as signs of an improving economy have not spurred a turnaround in air travel. \nRussian air travel experienced a spike in June (+9.5%) as a combination of added capacity and a weak ruble helped boost domestic air travel, despite the country’s economic woes. The increase was nonetheless outstripped by the 16.6% increase in domestic capacity. The Bottom Line: \n\"Midway through the peak summer travel season in the Northern Hemisphere, demand for connectivity remains high. Tourism is the life blood of many economies and much of it arrives by air. Unfortunately, too often governments appear not to realize this, burdening airlines and travelers with high fees and taxes. The short-term financial benefit comes at the long-term expense of the economy. The French government’s decision to allow annual charges increases at Paris’s two airports between 2016 and 2020 is the latest example—incredible for a country where tourism and global business play such big economic roles. Dialogue between industry and government is critical to finding win-win solutions. \n\"That is what we are hoping for in India with the imminent announcement of its new aviation policy. Improved air connectivity would make a major contribution to the government’s efforts to make it easier to do business in India. For that, we need a policy framework that reduces onerous taxes and regulation and that continues to improve infrastructure and cost efficiency. Aviation has much to contribute to any country’s economy. But it will not happen by accident. The peak travel season should serve as a reminder to all governments of the importance of aviation policies focused on enabling aviation to catalyze economic growth,\" said Tyler.", "external_links": [], "published": "2015-08-06T13:48:00.000+03:00", "crawled": "2015-08-06T19:12:44.860+03:00", "highlightTitle": ""}