{"organizations": [], "uuid": "8949ba9ea039001c8f461cf534443c102b3b930c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maxim.com", "main_image": "", "site_section": "http://www.maxim.com/maxim-man/travel", "section_title": "Travel | Maxim", "url": "http://www.maxim.com/maxim-man/travel/article/guide-get-inside-chicago-0", "country": "US", "title": "The Guide to Get Inside: Chicago", "performance_score": 0, "site": "maxim.com", "participants_count": 1, "title_full": "The Guide to Get Inside: Chicago | Maxim", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "8949ba9ea039001c8f461cf534443c102b3b930c"}, "author": "Maxim Staff", "url": "http://www.maxim.com/maxim-man/travel/article/guide-get-inside-chicago-0", "ord_in_thread": 0, "title": "The Guide to Get Inside: Chicago", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored by SKYN\nWhere to LAY\nTHE JAMES HOTEL\nA hip spot in “River North”, The James Hotel combines swanky and modern elements to create a sexy and unmatched ambiance. David Burke’s Primehouse is located right downstairs, but dessert is best served upstairs in your room.\nLONGMAN & EAGLE\nLongman & Eagle is the essential spot for a complete evening with your significant other. While the outdoor seating area is quaint and removed, Longman & Eagle's indoor space is filled with an endless supply of energy. Featuring six hotel rooms, you won’t have to go far to get far.\nPUBLIC HOTEL\nThe sexy, sleek, and inimate ambiance of The Public makes it a destination of choice to get more comfortable and spend the night. Downstairs is home to a lively bar and restaurant, created by celebrity chef Jean-Georges Vongerichten. This location will surely get her thinking about where the night will take you, so keep your eyes on the prize.\nVIRGIN HOTEL\nA brainchild of billionaire Richard Branson, this 26-story hotel is as sexy as it is breath-taking. The entire hotel is elegantly designed, infused with elements of modern technology and sensual decor.\nWhere to PLAY\nBORDEL\nEnjoy a night at Bordel , a dimly lit bar with different themes and performers each night. She will be lusting after you at the end of each performance.\nPRIMARY\nAt this renowned club you, can find yourself comfortable with another energetic stranger in no time. The club offers a 30-foot bar so you can spend less time waiting in line, and more time enjoying your night beneath the massive LED-wall.\nKOVAL DISTILLERY\nFor an adventurous experience, take a personal tour of the Koval Distillery - taking in the rich history behind Koval and learning about the quality and craftsmanship that goes into the product.​ Great things take time to develop, so show her that you’re in it for the long run.\nNORTH POND (LINCOLN PARK)\nQuaint and beautiful, this is the perfect spot to escape from Chicago's hustle and bustle. Located in Lincoln Park, North Pond is the place to be for those quieter, more relaxing moments. ​\nWhere to SAVOR\nMOMOTARO\nIn a massive three-level venue, this Japanese-inspired space has a floor that meets every need. The second floor serves as a hot spot for young and youthful professionals who regularly visit the dimly lit lively space for good times and good vibes. Maybe even new friends.\nBLACKBIRD\nKnown as one of Chicago’s most high-end dining experiences, Blackbird provides truly exquisite taste with an eclectic menu. This spot is sure to amaze your date, from the appetizer to the dessert.\nNACIONAL 27\nThis local spot brings Latin flare to the city of Chicago, with traditional music taking you into the early hours.\nSUNDA\nA trendy Asian-fusion restaurant with a five star trifecta of great food, strong drinks and welcoming staff. Give her the whole package, and she’ll take care of yours.\nWhere to SIP\nBROKEN SHAKER\nBring her to the Broken Shaker , where they pride themselves on using local ingredients, with a spice of international flavor. The menu is \"street food\" inspired, setting the mood for a casual evening with no strings attached.\nCERISE\nThe Cerise rooftop is an area where young singles gather daily, networking and meeting potential new friends. Perfect for singles on the hunt for a new flame.\nTHE MID\nSimilar to you,, The Mid has two personalities: it can be the center of attention, popping bottles, or it can change itself into a smaller venue where guests become more intimate. The club specializes in bringing in up-and-coming talented DJ’s. The Mid will let you and her keep going all night.\nWARD 8\nWelcoming bartenders are more than happy to make a mixing of your choice in a relaxed, but hip environment. With one of the most unique, innovative, and out-of-the-box drink menus in the country, take her here for a cocktail she will not soon forget.", "external_links": ["http://www.themidchicago.com/", "http://thefreehand.com/chicago/the-broken-shaker/", "http://sundachicago.com/", "https://virginhotels.com/", "https://virginhotels.com/dine-and-drink/cerise/", "http://www.longmanandeagle.com/", "http://nacional27chicago.com/", "http://primarychi.com/", "http://blackbirdrestaurant.com/", "http://www.northpondrestaurant.com/", "http://www.jameshotels.com/chicago", "http://www.wardeight.com/", "http://www.momotarochicago.com/", "http://www.publichotels.com/chicago/home/", "http://www.bordelchicago.com/", "http://www.koval-distillery.com/newsite/"], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T23:58:24.992+03:00", "highlightTitle": ""}