{"organizations": [], "uuid": "8dcbec7221d561db38b270d3a0c3f2507dc5ac6b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03404/tipsu-C3A4GM_3404530k.jpg", "site_section": "http://www.telegraph.co.uk/travel/destinations/northamerica/rss", "section_title": "North America travel information, holiday ideas, advice and reviews", "url": "http://www.telegraph.co.uk/travel/11794597/Why-are-Britons-so-bad-at-tipping.html", "country": "US", "title": "Why are Britons so bad at tipping?", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Why are Britons so bad at tipping?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T15:43:00.000+03:00", "replies_count": 0, "uuid": "8dcbec7221d561db38b270d3a0c3f2507dc5ac6b"}, "author": "Hugh Morris", "url": "http://www.telegraph.co.uk/travel/11794597/Why-are-Britons-so-bad-at-tipping.html", "ord_in_thread": 0, "title": "Why are Britons so bad at tipping?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Why are Britons so bad at tipping? Britons have again been branded some of the world's most stingy tippers. We ask why and look at how technology is changing the gratuity culture Leaving a few coins as tip seems much more organic than giving money to a card machine Photo: Alamy Comments \nThe British are the second worst tippers in the world, behind only the French, according to a new Global Tipping Index. \nWe have been victims of such a label before , and will probably be again, because no matter how much is written on the issue of whether to tip or not to tip, no matter how much the merits and methods of the service charge are discussed, we will never have a clear-cut, global understanding of how and when to tip. \nUsing research from 105 bars across nine countries, Direct Line says that the British are regarded the worst for tipping by one in five establishments, and the French by a third. At the other end of the spectrum, 27 per cent praised the American approach to gratuities, and 21 per cent reckoned the Germans were the best. \n• How much should you tip around the world? Why are we stingy? \nI can’t speak for other nationalities but I can attempt to explain why we are seen as stingy. And rather unsurprisingly it is a result of a stubborn attempt to conform to what we perceive to be etiquette while minimising hassle. It's all a big misunderstanding, basically. \nStaff often use novelty tip jars to entice a little extra change \nSocial awkwardness \nFirstly, there’s the classic British stereotype of an all-consuming social awkwardness. Unsure what to do or how to do it, and desperate not to offend, we opt for what we know best, which equates to either 10 per cent, as is customary in the UK, or ignoring the situation altogether until it goes away. \nThe British might rarely ask what would be appropriate to tip because it opens up a wormhole occupied by two scenarios we try our best to avoid: confrontation and talking about money. \nThe above survey that proclaims us stingy does not go so far as to interview waiting staff for their perceptions of the British tippers. I would wager they'd respond with something along the lines of: \"There is also an uncomfortable fear in their eyes, then they leave a rubbish tip.\" It's ignorance and confusion. \nThe Americans, however, are the best tippers because not only is it ingrained in their culture – gratuities are traditionally used to make up the salaries of poorly paid service staff (a practice illegal in the UK) – but they are free from the shackles of social hang-ups. And yet even they – in the form of a number of New York restaurants – wanted to do away with tipping because it spawns too much discomfort. \nWhat's more is technology is making this worse (see below for more). Michael Lynn, a professor of consumer behaviour at the Cornell University School of Hotel Administration, told the New York Times that having to choose to pay a tip on a card machine is \"putting a new social pressure on customers\". He said: \"It’s up to me to leave the change in the tip jar, or not. Yet when you turn the screen around and I have to explicitly click ‘No Tip’ in front of you, that’s a lot harder.\" \nWe have grown used to an included service charge \nHowever, the real issue is how we’re being conditioned – especially it seems in bars and restaurants in London, writing from experience – not to add a tip as more and more establishments include the “optional” service charge in the bill. There’s no way I’m going to ask for that to be removed unless something akin to outright verbal abuse or a spittle-covered dinner occurs (cf. British social awkwardness), and the industry well knows it. \nIt’s a cheap trick and one that sullies the art of paying a little extra to thank your custodian for good service. It is also killing tipping. \nGiven how used I am to paying a bill with anything up to 15 per cent service charge included, and often begrudgingly because my option for discretion has in the past been removed, I now pay less attention to future bills and whether or not a service charge has been included. \nCharges are so outrageous that it's ok to be stingy \nThe nail in the coffin is the fact that it is increasingly common to be presented with a service charge at the bar. I was in a bar five minutes from Liverpool Street a few months ago where the proprietors had decided that each transaction, whether nine Cosmopolitans or one bottle of beer, deserved a 12.5 per cent top up. It took me one taste of paying an additional £1.70 for a beer for my friend and I before I managed to overcome my British sensibilities and ask that the barman take it off the next time he bent down, picked two bottles from a fridge three feet away, opened them both and plonked them on the bar. \nIt made for an unpleasant interaction and worse left a sour taste in my mouth that affected my decision to tip in the next bar when faced with the card machine and either YES or NO. And anyway, technology is changing the rules \nThere’s no point worrying about the tired stereotypes of past – let us look to the future. \nCard machines - among other technology - is creating a cashless society Photo: Alamy \nLast month Apple Pay - a programme that allows users to pay with their iPhones - launched in the UK, another step towards becoming a cashless society. Even without considering Paypal, iWatches, or contactless plastic, cards, not cash, are taking over as the staple currency in cities. And this shift is threatening tips. \nWhereas before we’d just chuck a few coins in the dish to make up the tip, we’re now faced with a card machine asking us bluntly if we would like to add a gratuity – and how much. This is the kind of choice, Britons, nay humans, don’t like being faced with. We’re much like electricity in that we choose the path of least resistance. \nNow, this doesn’t mean we have to say no to a tip. We can press YES and add as many percentage points as we want. But the problem with card payments is we have to choose to pay more, rather than an absent-minded addition of a few pounds that feels more like a friendly afterthought. Though some research shows that people tip more when a card machine is shoved in front of them - partly because numbers mean less on a screen than physical coins or notes - I'd be inclined to say this is a teething period and soon we'll grow smart to it. \nThere’s also something a lot less attractive about your tip money being swept along into the money pot of the restaurant chain with the rest of the bill, than say, putting the coins directly in the hands of your waiter or waitress, especially where there are concerns about what percentage of the tip is actually given to the staff . \nIn short, the British may not be the best at tipping - but it's not because we're miserly. Between the shift from cash to cards and the mire of international social etiquette, we're just not really sure what to do. And the rest of the world isn't either. Here's a quick guide to tipping etiquette around the world .", "external_links": [], "published": "2015-08-11T15:43:00.000+03:00", "crawled": "2015-08-11T21:45:58.086+03:00", "highlightTitle": ""}