{"organizations": [], "uuid": "9c814e7c849a49da955ecfb14b156a8261699393", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62746/bahamas-launches-special-dol-fans-mom-and-me-bahamas-slumber-par", "country": "US", "title": "Bahamas launches special Dol-fans: “Mom and Me, Bahamas Slumber Party” package", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Bahamas launches special Dol-fans: “Mom and Me, Bahamas Slumber Party” package", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T21:00:00.000+03:00", "replies_count": 0, "uuid": "9c814e7c849a49da955ecfb14b156a8261699393"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/62746/bahamas-launches-special-dol-fans-mom-and-me-bahamas-slumber-par", "ord_in_thread": 0, "title": "Bahamas launches special Dol-fans: “Mom and Me, Bahamas Slumber Party” package", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bahamas launches special Dol-fans: “Mom and Me, Bahamas Slumber Party” package   \nAug 18, 2015 eTN   \nNASSAU, Bahamas - The Islands Of The Bahamas and Floridians have a special relationship and in recognition of this bond and shared passion for football, The Bahamas Ministry of Tourism has a strong partnership with the Miami Dolphins – the NFL team that keeps getting better each season, with loyal fans being dubbed, ‘Finatics.’ Bahamians know that Finatics represent the entire spectrum, from young and old, from children to millennials to families to grandparents, all bonded under the umbrella of love for the Miami Dolphins. \nUnfortunately, spending time together to bond, as a family is not always easy, beyond spending time together watching the games during the season. To help in providing some fun time for bonding for Finatics, The Bahamas has launched a special “Mom and Me, Bahamas Slumber Party,” offer for $265 per adult. The 3-day/2-night package includes round-trip transportation on the Balearia Ferry Express from Port Everglades to Grand Bahama Island. The package includes a standard king size or two full-sized bedrooms at Flamingo Bay Hotel & Marina. \nFlamingo Bay Hotel and Marina is adorned by the beautiful emerald green Bell Channel Waterway. Though already surrounded by the stunning natural beaches of Grand Bahama Island, guests enjoy full use of the largest pool on the island, a stunningly beautiful beach and a business center with free WiFi. Rooms are either king or two full size beds and have a kitchenette. The hotel includes a variety of amenities including an ocean front restaurant, a watersport activity center and more. \nGrand Bahama Island is full of history and charm, with a range of activities for visitors to enjoy, Grand Bahama Island is the perfect sun destination for a vacation. Along with sun, sand and sea, the historic appeal and ecological spectacles of Grand Bahama Island are juxtaposed with modern attractions, each providing an experience that is memorable. Island settlements such as Pinder’s Point, Russell Town and William’s Town serve as cultural hot spots while visitors seeking an experience that is untouched by commercialism and in a natural environment will explore the island’s three national parks, two of which are home to a significant number of birds. \nFrom dining to shopping to water sports to relaxing on the white sand beaches to exploring the local culture – The Bahamas have everything needed for some relaxing bonding time between mom and kids. \nAnd the Balearia Ferry Express is the easiest and most relaxing way to get there, ensuring the bonding experience will begin from departure. To keep you busy on-board there is a variety of entertainment from units featuring movies to restaurants to shopping that includes duty-free purchasing to a casino, for those brining children over the age of 18. Time will pass in the blink of an eye. \nTo plan your “Mom and Me, Bahamas Slumber Party,” simply email Balearia Ferry Express at email or call 1.866.243.4151 at least 72 hours in advance and use the promo code #DOLFANS-TFB. \nAct quickly; the package is available now until December 20, 2015, so make sure your next slumber party is in The Bahamas, as it truly is better there. \nAbout The Islands of The Bahamas \nThe Islands of The Bahamas have a place in the sun for everyone from Nassau and Paradise Island to Grand Bahama to The Abaco Islands, The Exuma Islands, Harbour Island, Long Island and others. Each island has its own personality and attractions for a variety of vacation styles with some of the world’s best golf, scuba diving, fishing, sailing, boating, as well as, shopping and dining. The destination offers an easily accessible tropical getaway and provides convenience for travelers with pre-clearance through U.S. customs and immigration, and the Bahamian dollar is on par with the U.S. dollar. Do everything or do nothing, just remember It’s Better in The Bahamas. For more information on travel packages, activities and accommodations, call 1-800-Bahamas or visit their website. \nLook for The Bahamas on the web on:", "external_links": [], "published": "2015-08-18T21:00:00.000+03:00", "crawled": "2015-08-18T22:59:09.129+03:00", "highlightTitle": ""}