{"organizations": [], "uuid": "c693214c82840bdd6140b4c962f5d32c0bafb97f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tripideas/23-big-bucket-list-adventures/ar-BBm5npz", "country": "US", "title": "23 BIG bucket list adventures", "performance_score": 0, "site": "msn.com", "participants_count": 6, "title_full": "23 BIG bucket list adventures", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 5, "uuid": "c2d5b43f5bc888d722c30228a5dccfc7f06f8121"}, "author": "Wanderlust", "url": "http://www.msn.com/en-us/travel/tripideas/23-big-bucket-list-adventures/ar-BBm5npz#post-0", "ord_in_thread": 0, "title": "23 BIG bucket list adventures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "23 BIG bucket list adventures Wanderlust 3 days ago Wanderlust\nThe rarest travel experiences. The toughest. The dearest. The ones that won’t be around for much longer. These are the real do-before-you-die journeys...\n1. Raft the Grand Canyon, Arizona, US © Provided by Wanderlust Inner Grand Canyon (Shutterstock) Why? To see the great gorge from a completely different – and rare – angle. Looking down on the squiggle of the Colorado River from a mile up on the rocky rim, it seems impossible that this river could have carved the gargantuan Grand Canyon.\nOf course, it’s had about two billion years to do so, slowly slicing through the black-red-orange-purple strata to create one of the natural wonders of the world. And this is why seeing the canyon from water level is the best way to appreciate it – the experience offers a far more intimate encounter than peering in from the top, as well as a close up of all that glorious geology.\nThe official launch point for a full run is Lees Ferry, at the north-east of Grand Canyon National Park; the end is at Lake Mead, 443km further on. En route are side canyons, Puebloan sites, swimming holes and sandy beaches, not to mention plenty of wild water.\nSo, all good – it’s just getting authorisation to enter that’s the problem. There’s a ‘weighted lotteryʼ system, with a waiting list of several years, to secure a private rafting permit. Fortunately, commercial tour-op trips – which range from one-day to three-week floats – are available, but even these need booking in advance if you want to guarantee your rendezvous with all this ancient rock.\nNeed to know: The best time to raft the Colorado is May-October. Overall, the river is graded a IV (intermediate), with many I-III rapids, plus some Vs. More information\nLike that, try this... Tackle the Rio Futaleufu, an absolute classic that cuts through the canyons and wilderness of Patagonia.\n2. See the Sistine Chapel in Vatican City, Italy © Provided by Wanderlust Sistine Chapel (Shutterstock) Why? Massive art, small crowds. Damn Michelangelo for not picking a bigger room! The 40m long by 13m wide box, squished into the Vatican Museum complex is woefully inadequate for the 25,000-odd people who now traipse through here every day.\nYes, the iconic ceiling, and particularly the altar wall’s Last Judgement, are probably the most impressive paintings you’ll ever see – but that’s only if you can see them, over the heads of the rest of humanity.\nFortunately, there is another way. It’s possible to book private tours of the site, which take small groups (15 people) into Vatican rooms usually off limits, and finish in the Sistine Chapel for an after-hours viewing of Michelangelo’s masterpieces, without all the other people.\nNeed to know: A private after-hours tour costs approx $387. Advance booking essential.\nLike that, try this... When in Rome... join a nighttime, crowd-free tour of the Colosseum too.\n3. Sleep at Everest Base Camp, Nepal © Provided by Wanderlust Everest base camp (Shutterstock) Why? To complete an epic trek, then snooze with the summiteers. The trek to Everest Base Camp – a breathtaking 14-day out-and-back into Sagarmatha NP to the foot of the world’s highest mountain – is a classic. And after the tragic earthquakes in 2015, the surrounding communities need the support from tourists.\nBut while the teahouse hospitality and Himalaya views en route are magnificent, most treks are not actually allowed to stay at Everest Base Camp – it requires specific permission. Most hikers visit their 5,340m goal for a ‘been there’ photo op, then descend to nearby Gorak Shep to sleep.\nHowever, a few special departures do offer the chance to overnight at the iconic camp. Also, these trips may be timed to coincide with peak summit-attempt season, when groups of climbers are also in residence.\nIt’s a unique opportunity, to both sleep in the shadow of the mighty mountain and to speak to the brave/mad souls making their final preparations; you might even see teams setting off up the notorious Khumbu Ice Fall, the start of their push for the top.\nNeed to know: Summiteers usually arrive at Base Camp April/May. Trekkers with illnesses will not be allowed to stay at Base Camp to avoid potentially infecting the climbers.\nLike that, try this... Hike up to Camping Arolla (1,950m), in Petit Praz, Switzerland – Europe’s highest campsite.\n4. Trek to Machu Picchu, Peru © Provided by Wanderlust Machu Picchu (Shutterstock) Why? It’s more satisfying than the train, and there are lots of options. It’s virtually impossible to make a bucket list that doesn’t include Machu Picchu. A secret city, never found by those pesky conquistadores, perched in the mountains, swirled by mists and mysteries – it’s the stuff of travel legend.\nThe trouble is, when you’ve seen so many, many photos of the Inca citadel, there’s a danger it’ll be a bit of a let-down. And that’s one reason why, if you can, you should go on foot. The city deserves the slow build, the accumulated excitement, that trekking there provides.\nAlso, deciding to lace up doesn’t mean you have to hit the Inca Trail. There are plenty of alternatives to the classic: you can hike via the much less-visited ruins of Choquequirao; head along the dramatic and diverse Salkantay Trail (with posh lodges en route); or tackle the tough Vilcabamba Traverse.\nNeed to know: Hikes vary in length, altitude and difficulty; acclimatise before setting off. Dry season is April-October. Permits are increasingly an issue on the Inca Trail.\nLike that, try this... Make a grand entrance at Jordan’s once-lost Nabatean city via the multi-day Dana-Petra trek – the Inca Trail of the Middle East.\n5. Hike the Milford Track, New Zealand © Provided by Wanderlust Milford Track (Shutterstock) Why? Complete one of New Zealand’s Great(est) Walks in great style. New Zealand has nine official Great Walks, and the Milford Track is arguably the greatest of the lot.\nThis four-day, 53.5km hike from Lake Te Anau to Milford Sound slices through the splendour of Fiordland National Park, taking in lakes, waterfalls, ice fields, forest and plenty of pioneer history, and tops out at the panoramic Mackinnon Pass (1,154m).\nIn the peak summer trekking months (November-April), it’s always oversubscribed; camping is not permitted and numbers are limited by the bunk-space available in the three DOC lodges en route. That is, unless you opt for an upgrade. Ultimate Hikes operates a series of private lodges (with both dorms and doubles) that enable hikers to tramp the track, with a guide, in a little more comfort.\nYou still have to carry your own bag, but – unlike those in the DOC huts – you get hot showers, duvets, drying rooms and hairdryers; breakfasts, lunches and three-course dinners are cooked up for you; each lodge even has a well-stocked bar. Cheers to that: a Great Hike indeed.\nNeed to know: Ultimate Hikes ’ five-day/four-night Guided Walk costs from NZ$1,930. More information\nLike that, try this... Hike Tasmania’s Overland Track in style with Cradle Mountain Huts.\n6. Sleep under the stars in NamibRand, Namibia © Provided by Wanderlust NamibRand (Shutterstock) Why? To experience some of the world’s best celestial sights. Sure, leave the big city and you can see stars almost anywhere. But the experience will be extra heavenly if you travel somewhere very dark, very clear and very remote.\nNamibia’s vast NamibRand Nature Reserve is one of only a few gold-certified Dark Sky Reserves. Simply, it has some of the world’s best dark skies. There are no towns or settlements inside it, or even nearby – Namibia is one of the planet’s most sparsely populated countries. And the dry climate means cloudless skies are the norm.\nBy day, explore NamibRand’s ochre-hued wilderness of dunes, mountains and plains, looking for oryx and Hartmann’s zebra. Then, after a blazing sunset, it’s time to turn your eyes skyward.\nSplurge on a stay at Sossusvlei Desert Lodge, which has its own observatory and ten luxurious chalets, each with a terrace, telescope and skylight over the bed. Or join the Tok Tokkie Trails three-day desert walk, on which nights are spent sleeping on a canvas stretcher under the stars.\nNeed to know: The reserve is around 375km from Windhoek. More information .\nLike that, try this... Unroll a swag in Australia’s Red Centre for a snooze with uninterrupted night-sky views.\n7. Swim with turtles in Ningaloo, Western Australia © Provided by Wanderlust Green sea turtle, Ningaloo Reef (Shutterstock) Why? To take a dip with endangered species. Western Oz’s Ningaloo Reef isn’t as big as the Great Barrier, on the opposite coast. But it’s still comprises 250 types of coral and attracting 500 species of fish; best of all, in parts it lays only 100m offshore, making its underwater riches extremely accessible – the snorkelling is superb too.\nThree of the world’s seven species of marine turtles nest on beaches and islands near Ningaloo between November and April: green (listed as vulnerable), hawksbill (critically endangered) and loggerhead (the most endangered species).\nHowever, turtles swim offshore year-round, their lumpen on-land movements transformed into a graceful ballet once they’re in the water. Good spots include Shark Bay, the Muiron Islands and Turtle Bay on Dirk Hartog Island.\nNeed to know: Main hub Exmouth is 1,200km north of Perth. More information\nLike that, try this... Snorkel with endangered leatherback and hawksbill turtles in Barbados.\n8. Visit an endangered tribe in the Amazon, Ecuador © Provided by Wanderlust Amazon, Ecuador (Shutterstock) Why? To glimpse a unique culture, but to do it sensitively and responsibly. Understandably, many struggling minority tribes don’t want to be gawped at by tourists passing through – the arrow-firing Sentinelese of the Andaman Islands being a case in point.\nBut for some such groups, tourism is providing a cultural lifeline, and travellers staying at lodges or booking tours owned and run by the tribes themselves are helping to keep endangered traditions alive (and protect their much-threatened environment from developers), while also giving visitors an authentic insight into how the peoples have existed for centuries: everybody wins.\nThe indigenous peoples of Ecuador’s Oriente seem to have mastered this kind of community eco-tourism; there are several well-regarded options. For example, the Cofán – one of the oldest Amazonian tribes, now numbering just 2,000 – have been running community-based ecotourism in northern Ecuador since 1978.\nTrips here include canoeing and piranha fishing, sleeping in traditional thatched huts and trekking into the wildlife-dense rainforest with Cofán guides – with optional overnight camping trip for the adventurous minded.\nNeed to know: Trips t o the Cofán community at Zabalo depart from Lago Agrio (7-8hrs from Quito by bus). More information\nLike that, try this... Visit the El Molo of Lake Turkana, Kenya, for whom tourism is helping their economy.\n9. Spot a snow leopard in Ladakh, India © Provided by Wanderlust Snow leopard, India (Shutterstock) Why? Few have seen this endangered cat. There are thought to be just 4,000 to 6,500 snow leopards left in the wild. Coupled with the fact that these charismatic big cats tend to live in cold, inhospitable, rocky clifftops at altitudes above 3,000m, they’re not that easy to spot.\nThis makes a sighting very special, and most trips that venture into their domain – largely Tibet, the Himalaya and the ’Stans – make it clear that you’d be fortunate to see even a paw-print. However, in recent years Ladakh’s Hemis National Park has gained a reputation as the world’s snow leopard capital, with around 200 leopards, and as time passes, local guides gain an ever better understanding of their habits.\nThere are still no guarantees, but in Hemis’s Husing, Tarbuns and Rumbak Valleys, sightings are relatively common; Husing is on a well-known snow leopard corridor. Visit in winter, when the snow brings the cats to lower ground and, with the help of local knowledge, trained trackers and spotting scopes, you might be in luck.\nNeed to know: Flights connect Delhi to regional hub Leh (1.5hrs), which is 40km from Hemis NP. There are six villages in the park; accommodation is in homestays or camping.\nLike that, try this... Track giant pandas in China’s Foping Nature Reserve, for the frisson of seeing the posterchild of conservation in the wild.\n10. Descend into a volcano, Iceland © Provided by Wanderlust Thrihnukagigur magma chamber (Shutterstock) Why? For a unique descent into the earth’s belly. To inject some Jules Verne adventure into your bucket list you need to head to Iceland. It’s a strange, singular place; a newborn babe in geological terms, you can virtually see it being formed before your eyes – the land groans, hisses and spews.\nThis makes delving beneath the surface quite exciting indeed, though something that’s been easy to achieve since 2012, when commercial tours began plunging into Thrihnukagigur volcano.\nClipped on to what’s essentially a window-cleaner’s lift, you’re slowly lowered 120m into another world – a magma chamber uniquely drained of its magma. Lights reveal a cavern of many colours – bruise purples, sulphur yellows, blood reds.\nWater drip-drips from above, while breaking into song demonstrates the excellent acoustics. It is wonderful, and very weird. Thrihnukagigur is dormant, last erupting over 4,000 years ago. There’s no sign that it’s about to spring into life, but tours are only announced on a year-by-year basis because, well, you never know...\nNeed to know: Tours run 15 May-30 Sept and cost ISK39,000. More information\nLike that, try this... Hike up Mount Etna, to stand on Europe’s most active volcano .\n11. Sail to St Helena, South Atlantic © Provided by Wanderlust St Helena (Shutterstock) Why? To cruise to one of the remotest islands, aboard the last Royal Mail Ship… and before the first plane lands. The romance of a high-seas voyage. A last-of-its-kind journey. A fascinating far-flung isle. The knowledge that it’s all about to change... This may tick every bucket list box.\nSt Helena is a worthy port of call in its own right: the South Atlantic speck is a crumple of glorious geomorphology – small, but riven with deep gullies, gulches and volcanic after-effects, and swept with semi-tropical lushness.\nThe waters are brim-full of dolphins and sometimes whales; the skies wheel with myriad birds. But it’s the human story that is most fascinating – around 4,000 people live on this lonely isle, in settlements little changed since Georgian times. But how much longer St Helena will remain so unique remains unclear.\nFor now, a long trip from South Africa on the RMS St Helena is the only way to reach it, but the long-mooted airport is finally due for completion by early 2016.\nNeed to k now: The RMS St Helena sails from Cape Town; it takes five days to reach the island. More information\nLike that, try this... Sail to Russia’s Wrangel Island (polar bear heaven), only accessible July-Aug by very few specialist cruise ships.\n12. Sleep on a private isle in Scotland © Provided by Wanderlust Summer Isles (Shutterstock) Why? Who doesn’t fancy an island to themselves? Sadly, most of us don’t have a Branson-sized budget – but that doesn’t mean you can’t claim your own patch of sea-lapped solitude.\nThanks to the fact that Scotland has almost 800 islands, as well as a favourable attitude to wild camping, it’s possible to tick this must-do off the list without spending a penny. Tiny Tanera Beag, the second-largest of the 20-odd north-western Summer Isles, has never been inhabited – though you might be joined by a few sheep, occasionally brought here to graze.\nYou can sea kayak from the mainland, over Badentarbet Bay and around larger (inhabited) Tanera Mor to reach Tanera Beag. Once you’ve hauled ashore, look out for seals in the lagoon by Eilean Flada Mor, climb to the island’s 83m high-point for views over the nearby rock stacks and skerries, and pitch your tent amid the heather to feel like a laird for the night.\nNeed to know: Achiltibuie, on the coast of Wester Ross & Sutherland, is the best access point. Tanera Mor is 3km offshore; Tanera Beag is just beyond. More information\nLike that, try this... Canoe to little Algonquin Island, on Ontario’s Kawawaymog Lake, to stay in a Canadian log cabin, away from the world.\n13. Visit North Korea © Provided by Wanderlust Pyongyang, North Korea (Shutterstock) Why? Who knows what the future holds? The secretive nation is the ultimate destination for the world-curious. Those who want boutique hotels or fancy cuisine look away now. Forget even the ability to chat to a local or take a detour down a side-street just because you fancy it.\nThis is totalitarian tourism, freedom-less but fascinating for the brief insight it gives into a country like no other. If you visit now you can (probably) expect to see the military machinations of the DMZ, the massive bronzes of Kim Il Sung and Kim Jong Il at Pyongyang’s Mansudae Grand Monument, a dazzling Mass Games and the natural beauty of Mount Myohyang.\nBut maybe not. North Korea is a nation that might decide to ban all visitors if current dictator Kim Jong-Un doesn’t score a hole in one, or something. Unpredictable, edgy, utterly unique.\nNeed to know: Independent travel is not permitted – travellers must be accompanied by an official guide at all times. More information\nLike that, try this... Explore the breakaway Soviet republic of Transnistria, a self-declared ‘country’ between Moldova and Ukraine.\n14. Climb Kilimanjaro, Tanzania © Provided by Wanderlust Aerial view of Mount Kilimanjaro (Shutterstock) Why? It’s travel’s greatest trekking summit – and it could well be losing its snows. Tanzania’s Mount Kilimanjaro deserves to be on every travel bucket list.\nNo other mountain manages to combine such a wealth of wow-factors to tick all those boxes: it’s an aesthetically awesome monolith poking out of the African plains; it’s a tough but achievable challenge; at 5,895m, it’s the roof of a continent; it’s a climatological oddity, proving snow can sit virtually on the equator. Tick, tick, tick, tick.\nBut just to add an extra bit of tock to all those ticks, doom-sayers predict that those snows might be gone by as early as 2022 – all the more reason to tackle Kili quick.\nNeed to know: Kilimanjaro cannot be climbed independently. Choose a longer trip to allow more time for acclimatisation and increase your chances of success. More information\nLike that, try this... For extra kudos, try climbing Argentina’s Aconcagua, a tougher, higher, non-technical challenge.\n15. Tour Havana in a classic car, Cuba © Provided by Wanderlust Classic car, Havana (Shutterstock) Why? Hop in an iconic vintage motor before they get scrapped. It’s all change in Cuba. A gentle thaw in relations with their big neighbours to the north means that some travel to the island has become (slightly) easier for American citizens and some trade restrictions have been lifted. The result? A 95% increase in online ‘Cuba’ searches.\nFor now, Cuba remains quite unique, with an intoxicating je ne sais quoi that’s strong of culture and loose of hips. Perhaps the most iconic Cuba image, though, is of a classic 1950s car bumping down a Havana backstreet. But for how long?\nThe change in trade laws may facilitate an influx of cheaper imported cars; how much longer will Habaneros diligently buff their old Chevys if it’s easier to buy a new Ford? So, while you can, take a tour in vintage motor, listening to its retro roar as you glide by the capital’s crumbly grandeur.\nNeed to know: You can’t self-drive a classic car, but several companies offer tours with driver/ guides. Expect to pay from around £20 an hour.\nLike that, try this... Up the ante: join a Rickshaw Rally, to negotiate India at the wheel of a tuk-tuk.\n16. Cuddle a whale in Baja California, Mexico © Provided by Wanderlust Grey whale in Baja California (Shutterstock) Why? Closer encounters with massive mammals. You can see whales in lots of places, but there are few spots where you can actually give one a hug. From December to April grey whales gather in Baja California’s San Ignacio Lagoon to mate, calve, nurture their young and – so it seems – have a jolly old time with the weird human creatures that sail out to see them.\nDespite having been hunted to near extinction, these greys bear no grudge; indeed, they bump into boats and surface within touching distance, inviting pats and strokes. However, there’s only a short window of opportunity to see the greys here each year, with February, March and April the best months, and good trips sell out far – often years – in advance.\nNeed to know: Activity varies by month. In February you see more breaching adults; calves grow more confident in March-April, approaching boats more frequently.\nLike that, try this... From Jan-April you can swim with humpbacks in the Dominican Republic.\n17. Capture the Northern Lights on camera © Provided by Wanderlust Photographing the Northern Lights (Shutterstock) Why? To record a spectacular photo of the northern lights that you saw. In this age of instant images and selfies, it’s not good enough anymore to just see the planet’s most spectacular light show – to hopefully be in the right place at the right time – now you have to snap a frame-worthy photo of it too.\nOne way to increase your chances of filling that memory card is to join an aurora photography tour. You’ll not only get tips from pros on how to snap the show – sharpening up those DSLR skills for those future travels – but they’ll also be attuned to where those spectral waves are most likely to start pulsing through the night.\nYour daylight hours will then be spent exploring the wild Arctic terrains that best yield luminous results – Finland, Norway, Sweden or Canada.\nNeed to know: October-November and February-March are the best times to see the northern lights. Dark skies yield better displays – avoid full moon.\nLike that, try this... Look for the southern lights (aurora australis) on New Zealand’s Stewart Island.\n18. See an eclipse in Indonesia & the US © Provided by Wanderlust Eclipse (Shutterstock) Why? To be in the best place when the world goes weird. Total eclipses – when the moon blocks out the sun, basking the earth in an eerie glow – happen roughly every 18 months. But you need to be in the right place, ideally somewhere in the path of the solar maximum, to fully appreciate the effect, and you’d have to wait an average of 375 years to see two total eclipses from the same spot.\nSometimes being in the path of an eclipse is simple. On 21 August 2017 the total eclipse will swing right across the middle of the USA, visible in states such as Wyoming, Nebraska and South Carolina; its point of greatest eclipse will be just north-west of Hopkinsville, Kentucky, where totality will last around two minutes and 40 seconds.\nSometimes, though, it’s a bit trickier – the eclipse in March 2015 was best viewed in the snowy wilderness of Svalbard, while in March 2016 you need to head to the remoter parts of Indonesia or Micronesia. Part of the battle is securing a place on a good, expert-led eclipse-watching trip: these specialist departures can fill up well in advance.\nNeed to know: Cloud cover will affect the quality of eclipse-viewing; if possible, check forecasts and head for clearer skies. The NASA Eclipse site is a mine of information.\nLike that, try this... The Perseid Meteor Shower was a highlight this summer, visible across the northern hemisphere.\n19. Leaf-peep on the Appalachian Trail, US © Provided by Wanderlust New Hampshire in the fall (Shutterstock) Why? See fall colours without the other people. The idea of visiting New England in autumn, wending between comely white clapboard houses, verges lined with pumpkins and forested hillsides completely aflame, is a romantic notion. Now add in hiked prices and all the other cars and coaches trying to get to the same scenic lookArguably out, and it isn’t quite so dreamy.\nthe best way to appreciate the glorious death of New England’s trees is to stride among it, camping out each night. So, why not combine a smidgen of the Appalachian Trail – the East Coast’s seriously long long-distance hike, bucket list-worthy in itself – to see the leaves without the crowds.\nThe 70km stretch between New Hampshire’s White Mountains and the Vermont border is particularly renowned for its fabulous fall foliage – think maples smoldering crimson, dogwoods turning purple and birch trees burning gold.\nNeed to know: Fall colours usually start to appear in New England from mid-September. Shelters and campsites along the trail are basic. More information\nLike that, try this... Make for Québec’s Laurentian Mountains, where the sugar maples turn magnificent late-Sept to mid-Oct.\n20. Drive through Glacier National Park, US © Provided by Wanderlust Glacier National Park (Shutterstock) Why? See retreating ice from a capricious drive. The Going-to-the-Sun Road somehow carves an 80km-long furrow through the mountains of north-west Montana. It’s also notoriously difficult to clear of winter snows. Portions of it remain open year-round, but the very earliest in the season that the entire length might be accessible is mid-June.\nThen, by late September, parts are off-limits all over again, leaving a brief window for a traverse. It’s worth trying though: the road slices through the parks most dramatic sections, with hair-raising hairpins and a haul over 2,026m Logan Pass.\nYou can also see the park’s rapidly retreating Jackson Glacier from the tarmac, which you should certainly pull over for – it’s estimated that Glacier NP may be entirely glacier-free by 2030.\nNeed to know: Driving the road without stopping takes around two hours. For road accessibility updates, see nps.gov/glac .\nLike that, try this... Norway’s switchbacking Trollstigen is closed in late autumn and winter.\n21. See a spirit bear in British Columbia, Canada © Provided by Wanderlust Great Bear Rainforest (Shutterstock) Why? These rare bears roam only here. Even for a country big on big empty, Canada’s Great Bear Rainforest takes some beating. What the GBR does have, though, is lots of lovely wildlife: grey wolves, grizzlies, cougars, orca, sea otters, humpback whales and, uniquely, Kermode – or spirit – bears.\nThese unusual ursines are black bears with a recessive gene, which renders about 10% of them creamy-pale. Like spirits, though, they’re tricky to spot – only around 1,200 are thought to exist, and fewer than 200 of those are white.\nBut if you head to the right part of this roadless, fjord-cut, river-riven rainforest, you might be in luck. The area around Klemtu is a known Kermode hang-out, and lodges accessible only by floatplane have guides expert in tracking them down.\nNeed to know: The best time to visit is late August to mid-October, when returning salmon tempt bears to the rivers.\nLike that, try this... Visit Timbavati’s white lions, on Kruger NP’s western edge, South Africa.\n22. Ride the Trans-Siberian, Russia-China © Provided by Wanderlust Trans Mongolian train (Shutterstock) Why? To take the slow route across Siberia. What’s the old adage? It’s better to travel than to arrive? Could have been written for the Trans-Siberian train journey.\nIf you were that desperate to get between Moscow and Beijing (the route of the network’s Trans-Mongolian branch, arguably the most interesting), you could fly it in under eight hours. But no, it’s this six-night, 7,621km train that is slow travel at its most atmospheric, an unhurried spooling of endless birch trees, Lake Baikal shimmer, grassy steppe, Gobi Desert, yurt camps, camel herds and station-traders selling sweets and sausages.\nThe train provides a cosy confinement within that vastness, where your cabin-mates could be Buddhist monks or Russian businessmen, where vodka flows freely and the hot-water samovar is always steaming, ready to make a brew. Plans have been mooted to build a high-speed line from Moscow to Beijing, slashing the journey time from seven days to two. Progress, perhaps – but what’s the rush?\nNeed to know: There is no hop-on hop-off option; to make stopovers, you must buy separate tickets for each leg. See seat61.com .\nLike that, try this... Ride The Canadian, from Toronto to Vancouver, another vast, cross-country, multi-day epic.\n23. Raft the Zambezi River, Zambia © Provided by Wanderlust Zambezi River (Shutterstock) Why? Run the great river, while you can. The Zambezi is one of the world’s most iconic waterways, slicing its way through south-eastern Africa and famously plunging over Victoria Falls.\nRafting it – whether you choose a short trip from Livingstone or a multi-day, beach-camping expedition – is up there with the world’s greatest river journeys. You’ll tackle hair-raising rapids called things like Oblivion and The Devil's Toilet Bowl. You’ll might spot hippos lazing in the channels and even crocs on the banks.\nBut there’s also a sense of urgency here. Plans are afoot to build a dam that will greatly effect the Zambezi’s flow, disrupting its natural ecosystems and wiping out its rapids (and therefore rafting industry). If the dam gets the go-ahead, it is due to be completed by 2025.\nNeed to know: Low-water season – the best time for rafting – is August to December. More information\nLike that, try this... Raft Tasmania’s Franklin River, the wild waterway that conservationists saved from dam-nation.\n ", "external_links": ["http://www.viator.com/Rome-attractions/Sistine-Chapel/d511-a706", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59dH.img&description=Everest+base+camp+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5l5I.img&description=Machu+Picchu+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59el.img&description=Green+sea+turtle%2c+Ningaloo+Reef+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5l65.img&description=Amazon%2c+Ecuador+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5pKI.img&description=Photographing+the+Northern+Lights+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm57we.img&description=Milford+Track+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59fW.img&description=Eclipse+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59dA.img&description=Sistine+Chapel+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5noS.img&description=Classic+car%2c+Havana+(Shutterstock)+-+Provided+by+Wanderlust", "http://www.tanzaniaparks.com/kili.html", "http://www.nps.gov/glac", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59f1.img&description=St+Helena+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5esE.img&description=Thrihnukagigur+magma+chamber+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5pL2.img&description=Great+Bear+Rainforest+(Shutterstock)+-+Provided+by+Wanderlust", "http://www.eclipse.gsfc.nasa.gov/eclipse.html", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5etU.img&description=Trans+Mongolian+train+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59fN.img&description=Grey+whale+in+Baja+California+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5esd.img&description=NamibRand+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5jBP.img&description=Snow+leopard%2c+India+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59fg.img&description=Summer+Isles+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59fv.img&description=Aerial+view+of+Mount+Kilimanjaro+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm59fj.img&description=Pyongyang%2c+North+Korea+(Shutterstock)+-+Provided+by+Wanderlust", "http://www.nps.gov/grca", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5bQi.img&description=Zambezi+River+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5gYV.img&description=Inner+Grand+Canyon+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5l7b.img&description=New+Hampshire+in+the+fall+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm5npz%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBm5pKU.img&description=Glacier+National+Park+(Shutterstock)+-+Provided+by+Wanderlust"], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-29T23:16:08.098+03:00", "highlightTitle": ""}