{"organizations": [], "uuid": "41f1de94612dcf98719b10cdfa5bd4ec856bd817", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/opinion/editorials/the-power-of-a-backpack-to-help-children-gain-confidence-in-the-new-school-year/", "country": "EU", "title": "The power of a backpack to help children gain confidence in the new school year", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "The power of a backpack to help children gain confidence in the new school year | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T01:30:00.000+03:00", "replies_count": 0, "uuid": "41f1de94612dcf98719b10cdfa5bd4ec856bd817"}, "author": "Seattle Times editorial board", "url": "http://www.seattletimes.com/opinion/editorials/the-power-of-a-backpack-to-help-children-gain-confidence-in-the-new-school-year/", "ord_in_thread": 0, "title": "The power of a backpack to help children gain confidence in the new school year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ASK 11-year-old Girl Scout Emma Hoerle how she feels when she goes to school with a backpack full of school supplies and she responds without hesitation: “I feel confident.”\nEvery child should feel that. Unfortunately, thousands of children in our region don’t.\nThat’s why Hoerle and other girls from her troop recently gathered at the Renton field office of the YWCA Seattle King Snohomish. They stuffed hundreds of backpacks. More than 1,800 will be given to children.\nTwo more weeks to help Donate online: seati.ms/edschoolsupplies\nSend checks to: The Seattle Times School Supply Drive, P.O. Box C-11025, Seattle, WA 98111\nSeattle Times readers have been helping to make such events possible by donating to our editorial board’s annual school-supply drive. Every dollar collected through Sept. 5 goes directly toward supplies for thousands of students associated with Hopelink, YWCA Seattle King Snohomish and the Seattle/King County Coalition on Homelessness.\nTheir clients often struggle with poverty, domestic violence, homelessness and other traumatic events.\nAt the YWCA’s event, the Girl Scouts worked in pairs. One girl held a backpack open and called out the supply list while another troop member filled it with paper, markers, a USB thumb drive and sometimes even a scientific calculator.\nThe sooner we help kids find confidence and know that they can do well and be part of deciding their own future, there’s a strong likelihood they’ll finish high school and have options.” - Liz Mills Liz Mills, policy and advocacy director for YWCA Seattle King Snohomish, gets teary-eyed watching the young volunteers move down a line of tables and sifting through boxes of donated goods.\n“I loved school. It’s one of the paths out of poverty,” she says. “The sooner we help kids find confidence and know that they can do well and be part of deciding their own future, there’s a strong likelihood they’ll finish high school and have options.”\nEditorial board members are editorial page editor Kate Riley, Frank A. Blethen, Ryan Blethen, Brier Dudley, Mark Higgins, Jonathan Martin, Thanh Tan, Blanca Torres, William K. Blethen (emeritus) and Robert C. Blethen (emeritus).", "external_links": ["http://seati.ms/edschoolsupplies"], "published": "2015-08-26T01:30:00.000+03:00", "crawled": "2015-08-26T09:30:04.907+03:00", "highlightTitle": ""}