{"organizations": [], "uuid": "450588a987f4cef51507a1e445c797251b3c2bca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources3.news.com.au/images/2015/08/28/1227502/879079-3c4ce9ea-4d23-11e5-bff6-26fc1dcc3623.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-ideas/new-14-billion-city-is-being-built-in-the-desert/story-fnjpja3r-1227502878740?from=public_rss", "country": "IL", "title": "$1 billion city where no one lives", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "$1 billion city where no one lives", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T11:02:00.000+03:00", "replies_count": 0, "uuid": "450588a987f4cef51507a1e445c797251b3c2bca"}, "author": "", "url": "http://www.news.com.au/travel/travel-ideas/new-14-billion-city-is-being-built-in-the-desert/story-fnjpja3r-1227502878740?from=public_rss", "ord_in_thread": 0, "title": "$1 billion city where no one lives", "locations": ["New Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The new city being built in New Mexico. Picture: Pegasus Global Holdings Source: Supplied \nAT FIRST glance it appears to be an illusion — a giant, very pricey one. \nA new city is being built in the middle of the desert at a whopping price tag of $1.4 billion and while it’s a very real place, it’s unlike anything the world has ever seen. \nDespite featuring all the infrastructure you’d expect to find in a normal city, including skyscrapers, 35,000 homes, a shopping centre, church, service station and an airport, nobody will be allowed to live here. \nThe 38-square-kilometre area will also encompass farms, an industrial area, a rural road system and a highway. \nIt will be under constant surveillance and connected by underground tunnels, yet there will be no colourful details such as artwork or billboards. \nWelcome to the Center for Innovation, Testing and Evaluation (CITE), a planned ghost town for New Mexico, America. \nEssentially, it’s a huge, fully functional test city, the first of its kind in the world. Futuristic city \nAccording to development company Pegasus Global Holdings: “City Lab will be a representative example of a modern day, mid-sized American city. It will ... include urban, suburban and rural zones as well as the corresponding infrastructure. \n“City Lab will be pre-wired for data collection giving researchers the ability to simulate system-wide scenarios and then draw data from such activities. \n“It’s the first of its kind, in scale and scope.” \nHere, drones will rule the sky as they test out the delivery of goods, and roads will be filled with driverless cars and trucks. And the beauty of it being empty of humans is that if something goes wrong, there won’t be any mass injuries. \n“It will be a true laboratory without the complication and safety issues associated with residents,” Bob Brumley, managing director of Pegasus says. \n“Here you can break things and run into things and get used to how they work, before taking them out into the market.” \nJust 300 people will oversee experiments and maintain the city’s infrastructure. It will have all the hallmarks of a real, functioning city. Picture: Pegasus Global Holdings Source: Supplied \nCITE is a replica of Rock Hill, South Carolina, which proved to be a great testing model due to its mix of old and new building materials. \nBut the project has suffered some setbacks. \nConstruction was originally scheduled to begin in June 2012, near the town of Hobbs, in the arid Lea County, but the project was put on hold due to environmental concerns. \nIts fate then seemed to be heading in the direction of these other forgotten, unbuilt cities . \nNow it’s full steam ahead with ground set to be broken outside of Las Cruces for the real-life Sim City within the next three months. How it could look. Picture: Pegasus Global Holdings Source: Supplied", "external_links": [], "published": "2015-08-28T11:02:00.000+03:00", "crawled": "2015-08-28T13:52:38.401+03:00", "highlightTitle": ""}