{"organizations": [], "uuid": "9740fa3404f9b84fd237165f18c81bdde4770a02", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/homeworkers-move-to-high-street-pays-off/4698215.article", "country": "GB", "title": "Homeworker's move to high street pays off", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Homeworker's move to high street pays off", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T13:02:00.000+03:00", "replies_count": 0, "uuid": "9740fa3404f9b84fd237165f18c81bdde4770a02"}, "author": "", "url": "http://www.ttgdigital.com/news/homeworkers-move-to-high-street-pays-off/4698215.article", "ord_in_thread": 0, "title": "Homeworker's move to high street pays off", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Homeworker"], "text": "Save \nMoving onto the high street has helped a homeworker diversify his business and grow his customer base. \nA Cheshire homeworker who opened his first high street premises last month has predicted the move will see the agency double its turnover by the end of the year. \nJai Porter, owner of Freedom member TravelLab, had worked from home for eight years, building up a team of three other homeworkers. When the business began to outgrow his home-office, he found it would be almost as costly to rent a serviced office space as it would a high street retail unit. \nHe opened the store in the market town of Frodsham in early July, with the help of a former Thomson manager from a neighbouring town, and is already looking to appoint a third member of staff. \n“Previously we were selling 80% Maldives, with average booking value as high as £3,200 per person, but such a big focus on one destination left us rather exposed,” said Porter. \n“We’ve already seen the profile of our business change since opening the shop, with enquiries for everything from Italy and Florida to cruise and Antarctica.” \nWith a Thomas Cook store the only other agency in the town, he estimates the store has the potential for around £100,000 of sales per month, and says the store has been “a zoo” on market days and Saturdays. \nBut while he is convinced there is good business to be had on the high street, he stressed the importance of location. \n“There is a big part of the market who will consider [a high street agent] if they walk by and see you. But you have to choose wisely. There aren’t many towns like Frodsham, where footfall is so good, and I looked for over a year to find just the right premises,” he warned. \n“The reaction from local people has been very encouraging; people are saying ‘thank goodness we don’t have to go into Chester any more’, and ‘thank goodness there’s an independent agent in town’,” he explained. \nHis dog, Charlie, has also been a big hit with visitors to the store, while putting a water-bowl outside the store for passing dogs has also brought customers in. \nThe store has a luxurious feel, with a coffee machine and stylish furniture, and a champagne fridge to be installed shortly. \nBut despite Travel Lab’s high-end roots, and the fact the shop’s first booking was a £6,000 business class flight to Sydney, the agency has also welcomed clients on more modest budgets. \n“We’re going to have to book £200 holidays and £12,000 holidays here; we don’t want to be perceived as those people that don’t help, just because someone may only have £200 today,” said Porter. \nHe noted that tour operators have been very supportive of the new venture, with Gold Medal hoping to provide vinyl signage for the window and Kuoni hoping to install a brochure wall. \nFuture plans for TravelLab include holding a cruise week, advertising in local press, and tying up with other local businesses such as a delicatessen and a salon that makes home-made beauty gifts. \n“We’ve had our honeymoon period, and now we need to really switch on the marketing,” he insisted. \nHe also admitted the transition from working alone at home to being in the “fishbowl” environment of a busy store had not been easy. \n“I’ve had to learn how to re-immerse myself into normal society,” he joked. “It’s very hard to get any work done when people are coming in every half hour, but I’m really enjoying the social side.” Readers' comments (2) spencerthomas@itc-uk.com | Thu, 20 Aug 2015 11:41 am \nI love stories like this - great news and super well done! Unsuitable or offensive? Report this comment Michael Edwards | Thu, 20 Aug 2015 3:49 pm \nNot all gloom and doom on the high street then! Good luck in your new venture and hope you hurt the competition!", "external_links": [], "published": "2015-08-20T13:02:00.000+03:00", "crawled": "2015-08-21T20:10:34.706+03:00", "highlightTitle": ""}