{"organizations": [], "uuid": "b172a1d9399ca8c93448af80c69924a7499efe22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 9:24 a.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_NEW_ENGLAND_APPLES_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "Growers see strong apple-picking season in region", "performance_score": 0, "site": "ap.org", "participants_count": 1, "title_full": "Growers see strong apple-picking season in region", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T16:01:00.000+03:00", "replies_count": 0, "uuid": "b172a1d9399ca8c93448af80c69924a7499efe22"}, "author": "BOB SALSBERG", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_NEW_ENGLAND_APPLES_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "Growers see strong apple-picking season in region", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Links Yesterday's Places BOSTON (AP) -- As summer winds down in New England, apple-picking season is gearing up with growers forecasting a bumper crop. According to the U.S. Apple Association, the six-state harvest is expected to be about 14 percent higher than last year's and 18 percent above the region's five-year average. The USDA's National Agricultural Statistics Service forecasts the total New England apple production will come in at just under 170 million pounds this year. Growers point to generally favorable weather conditions in early spring and summer and during the pollination period, with little or no damage from frost - historically one of the greatest threats to the local crop. While things were shaping up nicely overall, Russell Powell, senior writer with the regional trade group New England Apple Association, said some areas, particularly in Connecticut and New Hampshire, experienced dry spells over the summer. And several farms, he noted, were battered by severe thunderstorms and golf ball-sized hail. \"There was some scattered hail damage in the region earlier this month, but the crop is big enough so it's not going to have a huge impact,\" Powell said. Last year's crop was affected by several factors including a higher-than-usual occurrence of a bacterial disease known as fire blight, Powell said, though the 2014 harvest still slightly exceeded the five-year average of about 144 million pounds. Apple-picking is a time-honored fall ritual for countless New Englanders who visit orchards and stroll among the trees, filling plastic bags with the plumpest, juiciest and shiniest apples they can find - often lumbering up ladders to pluck their prizes from the highest branches. Frank Carlson, who along with two brothers operates the 79-year-old Carlson Orchards in Harvard, Massachusetts, said he opened last weekend offering early-season varieties including ginger golds. But he expects the picking season to begin in earnest around Labor Day when McIntosh apples, which account for about two-thirds of New England production, become available. \"We have a good crop of apples,\" said Carlson. \"In general I haven't heard anyone tell me they have a low crop.\" The farm, which also sells retail and wholesale under its own brand name, did feel some lingering effects from a record-setting winter, Carlson said, as a small number of trees weren't properly pruned because of the deep snow, resulting in less red color in the fruit. Luckily, however, his crop escaped damage from a pair of recent hail storms. \"Someone was looking out for us,\" he said. Chuck Souther, who started Apple Hill Farms in Concord, New Hampshire, with his wife Diane in 1978, just wrapped up blueberry season and anticipates strong apple sales after what he described as a strong growing season marked by a beautiful bloom and good pollination. \"We're in the sweet spot right here,\" said Souther, who noted that areas of the state had been dry while portions of northern New Hampshire and Vermont were on the wetter side. The rosy New England forecast stands in contrast to projections of an overall drop in the apple crop nationally from a year ago, due in part to drought and wildfires in Washington state, the nation's largest apple producer. --- Online: New England http://www.newenglandapples.org", "external_links": [], "published": "2015-08-31T16:01:00.000+03:00", "crawled": "2015-08-31T21:07:08.107+03:00", "highlightTitle": ""}