{"organizations": [], "uuid": "2da4c66dee387932eeed2c872db6fb144be2841a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/odisha-travel-guide-discover-the-land-of-lord-jagannath.html", "country": "US", "title": "Odisha Travel Guide - Discover The Land of Lord Jagannath", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Odisha Travel Guide - Discover The Land of Lord Jagannath", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T04:56:00.000+03:00", "replies_count": 0, "uuid": "2da4c66dee387932eeed2c872db6fb144be2841a"}, "author": "Devendra Singh-2015-08-03T02:56:50-0400", "url": "http://www.articlesfactory.com/articles/travel/odisha-travel-guide-discover-the-land-of-lord-jagannath.html", "ord_in_thread": 0, "title": "Odisha Travel Guide - Discover The Land of Lord Jagannath", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | August 3, 2015 \nOdisha, (Orissa) is an eastern state in India. The land is a wholesome combination of pilgrimage, natural beauty, and diverse hub of culture and tradition. The artefacts and monuments of the state resemble exquisite craftsmanship and sculpture. Grab a glimpse of the state in all its forms in the succeeding sections. \nHow to ReachThe state is easily accessible from many other major cities. The airport in Bhubaneshwar can be reached from cities in the south like Chennai, Vishakhapatnam, Hyderabad, Bangalore et al. Other nearby cities include Kolkata, Delhi, Mumbai, Port Blair etc. one of the recent developments of the state is the availability of international flights. \nThere are innumerable trains that run across the state and connect it with most other key cities in adjoining states and farther. \nIn order to explore the length and breadth of the state there are ample taxis that charge reasonably and provide with a panoramic view. \nBest Time to VisitWell, it is ideal to follow the migratory birds when they flock together to Odisha! The time from October to March is the perfect time when Nature decks herself in her best and adorns beautiful Odisha. The flight of the migratory birds is a sight to uphold for a lifetime. The scenic beauty is too appalling to miss. Later in the winter, the state celebrates traditional festivities which make for a huge crowd attraction. And finally a cool weather with the mild winter is an added advantage to visit Odisha during the above mentioned months. \nSIGHTSEEING \n1- Historical Monuments \nKonark Temple or the Black Pagoda in Konark is the creation of Raja Narasimha of the Ganga Dynasty. The massive structure with the chariot being drawn by seven horses and bound by twelve wheels. The temple was constructed in the 13yj century. \nJagannath Temple is one of the oldest temples standing on the soils of Odisha. Constructed by the royals, this temple is complete with architectural excellence. The deities of the temple include Lord Jagannath, Goddess Subhadra, and Lord Balabhadra. \nLingaraj Temple, Bhubaneshwar is yet another place where the pilgrims come in huge numbers. The temple stands as the base for the devotees of Lord Shiva. It houses the supreme of all lingas, a symbol of the Lord. \nThese are some of the most visited temples in Odisha, apart from several others. \n2- Famous Beaches \nChandipur Beach - Famous for its mystical waters and swaying casuarina trees, Chandipur is haven of beaches and a complete wonderland for all the beach lovers. Talasari - A cinematic view of the backwaters, red crab, and the otherwise calm sea water make Talasari stand apart from other beaches.Paradip Beach - This beach is renowned for its azure sea water, port, rocks, and green forests along the coast. \nFairs and FestivalsOdisha boasts of a culture that is well recognized. There are umpteen festivals that are celebrated all through the year. The chief ones which are most prominent include, RathYatra, ChandanYatra, Bali Yatra, Konark Dance Festival, Puri Beach Festival, Makar Mela and numerous others. \nCuisineOdiya cuisine has commanded nation wide acclaim for its unique culinary tradition and use of extra ordinary spice mix that enhance the flavours manifold. The most common types of vegetables earn a different blend f taste just by the addition of the unique Odiya spices. The use of vessels and a distinct Odiya style of cooking lend a superior taste to the common dishes. Fish forms a key ingredient for non-vegetarian dishes. It is worth mentioning that the Mahaprasadoffered to Lord Jagannath each day at the Jagannath temple is a must have for any tourist. \nShoppingThere are tons of things that a tourist can pack from Odisha. Handloom, handicraft, wooden items, woven items, silverware, stone carved items, and paintings are all too flashy and gorgeous to be overlooked by the shopaholics. Whether to pick a memento or a gift item a shopping spree in the markets of Odisha is never disappointing. Source: Free Articles from ArticlesFactory.com ABOUT THE AUTHOR \nDevendra Singh an expert writer of Blog, news, article now focusing on tours and travel topics, who love traveling and share his experience to others. For more details about Orissa Tour Packages, please click here to access detail:www.namasteindiatrip.com", "external_links": [], "published": "2015-08-03T04:56:00.000+03:00", "crawled": "2015-08-04T17:17:58.062+03:00", "highlightTitle": ""}