{"organizations": [], "uuid": "56a38e0ae75d1d5beaeecc47acd249683616d1e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/World-Golf-Village-Resort.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/renaissance-world-golf-village-resort-in-ne-florida-offering-sizzling-summer-golf-package/", "country": "US", "title": "Renaissance World Golf Village Resort in NE Florida Offering 'Sizzling Summer Golf Package'Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Renaissance World Golf Village Resort in NE Florida Offering 'Sizzling Summer Golf Package'Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "56a38e0ae75d1d5beaeecc47acd249683616d1e5"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/renaissance-world-golf-village-resort-in-ne-florida-offering-sizzling-summer-golf-package/", "ord_in_thread": 0, "title": "Renaissance World Golf Village Resort in NE Florida Offering 'Sizzling Summer Golf Package'Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Renaissance World Golf Village Resort in NE Florida Offering ‘Sizzling Summer Golf Package’ Published on : Friday, August 14, 2015\nIf you are a golfer, you should definitely check out the very enticing “Sizzling Summer Golf Package” that The Renaissance World Golf Village Resort in Jacksonville/St. Augustine, Florida is offering through September 30, 2015. The package at the Northeast Florida resort includes one round of golf daily on the resort’s popular Slammer & Squire championship course (just steps from The Renaissance Resort) or renowned King & Bear championship course (the only course co-designed by Arnold “The King” Palmer and Jack “The Bear” Nicklaus) per golfer, as well as overnight accommodations in a deluxe guest room.\nMaking the package even more appealing is that the award-winning resort also provides a complimentary shuttle for individual guests (based on availability) to and from historic downtown St. Augustine. This service enables guests to easily visit such sites in St. Augustine, which was founded in 1565 (and is celebrating its 450th anniversary in 2015), as the historic Castillo de San Marcos fort, The Fountain of Youth, and shopping on the charming, brick-paved St. George Street. Additional options in downtown St. Augustine include the Old Town Trolley Tour, The Old Jail, The St. Augustine History Museum, The Spanish Quarter, The Oldest Wooden Schoolhouse, Flagler College, Whetstone’s Chocolate Factory, Lightner Museum, and a variety of water activities.\nLocated within the lush 6,300-acre World Golf Village, The Renaissance World Golf Village Resort is ideally situated adjacent to the World Golf Hall of Fame, the ultimate destination for the celebration of golf’s greatest players with fun interactive exhibits and historic golf artifacts. In addition to the two beautiful championship golf courses, the resort features a spa, state-of-the-art fitness center, pool, hot tub, and full-service concierge. Guests also have access to four additional golf courses within 15 minutes of the resort, for a total of 108 holes of golf. Plus, guests enjoy an easy walk to an IMAX® 3D Theater and to the Walk of Champions, and can take golf lessons at the renowned PGA TOUR Golf Academy.\nThe “Sizzling Summer Golf Package” starts at just $119 per room, per night, plus tax for one golfer in the room on weekdays (Sunday-Thursday night), or from $169 per room, per night, plus tax for two golfers in the room on weekdays. On weekends (Friday-Saturday night), the package starts at $149 per room, per night, plus tax for one golfer in the room, or from $209 per room, per night, for two golfers in the room. Note that resort guests also benefit from no resort fees and complimentary self-parking. The package is available through September 30, 2015, based on availability, but is not available Labor Day weekend. Advanced reservations are required, and the offer cannot be combined with any other offer and does not apply to groups of 10 or more rooms. Blackout dates may apply, and other restrictions may apply.\n“The ‘Sizzling Summer Golf Package’ is a very appealing package for any golfer,” said William McBroom, the resort’s director of sales & marketing. “It provides a great opportunity to experience these outstanding ‘bucket list’ courses, at our lowest rates of the year. Combine that with the resort’s ideal location adjacent to the World Golf Hall of Fame, and just steps from the Slammer & Squire, an Island Challenge Hole, and a beautiful championship putting course, and you can see why this is such a wonderful package.”\nCo-designed by Arnold “The King” Palmer and Jack “The Bear” Nicklaus, the challenging, par-72 King & Bear measures 7,279 yards, and is known for its picturesque lakes, beautiful Loblolly pines and stately oaks.\nThe 6,939-yard, par-72 Slammer & Squire features generous fairways, contoured greens, and plenty of water hazards along with impressive views of the World Golf Hall of Fame. Designed by Bobby Weed, with design consultants Sam “The Slammer” Snead and Gene “The Squire” Sarazen, the championship course is one of Northeast Florida’s most popular courses.\nIn addition to its recreational amenities, The Renaissance Resort also features the popular Villagio Italian Grille; The Resort Shop, which proudly serves Starbuck’s coffees, pastries, breakfast fare, sandwiches, soups, salads, wraps, and desserts, as well as an array of local gifts and souvenirs; a picturesque gazebo; and a dramatic nine-story atrium lobby, which features a Colonial/Asian theme with lush foliage and a colorful 7-story modern hanging sculpture that is reminiscent of open Florida skies.\nWhen visiting the resort, guests have the opportunity to take fun eco-tours and chartered fishing trips, enjoy exceptional shopping at two large outlet malls, and explore historic St. Augustine.", "external_links": [], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T07:55:08.848+03:00", "highlightTitle": ""}