{"organizations": [], "uuid": "a6626b8806fae6f011cd74a8b09df1bd817b528f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.philly.com", "main_image": "http://media.philly.com/images/080215-personal-journey-600.jpg", "site_section": "http://www.philly.com/philly/travel/", "section_title": "Philadelphia Travel Deals and Tourism - Philly.com", "url": "http://www.philly.com/philly/living/travel/20150802_Personal_Journey__Dropping_in_on_the_Andes_in_Ecuador.html", "country": "US", "title": "Personal Journey: Dropping in on the Andes in Ecuador", "performance_score": 0, "site": "philly.com", "participants_count": 1, "title_full": "Personal Journey: Dropping in on the Andes in Ecuador", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "a6626b8806fae6f011cd74a8b09df1bd817b528f"}, "author": "Kayla Scheimreif,", "url": "http://www.philly.com/philly/living/travel/20150802_Personal_Journey__Dropping_in_on_the_Andes_in_Ecuador.html", "ord_in_thread": 0, "title": "Personal Journey: Dropping in on the Andes in Ecuador", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We had two days to see Ecuador. This country advertises itself as the perfect one-stop vacation: With the Andes, Amazon, coast, and Galápagos, \"all you need is Ecuador.\" But we had a time limit, so we chose the Andes and decided to pack as much doing into 48 hours as possible.\nIn Quito, the Ecuadorean capital, we selected the cheapest rental car, a Chevy Spark. The Budget representative glanced skeptically at the three of us and our three bulky packs. \"I'm sure we'll be able to fit everything just fine,\" I assured him. I neglected to mention that we were planning on taking the little thing to a 12,000-foot elevation. A minor detail.\nPeter shifted gears and pulled out onto the nearly empty highway. Our destination was Otavalo, an Andean city best known for its colorful Plaza de los Ponchos textile market. The drive was dusty and slow, switchbacking uphill past endless lines of greenhouses. Our little car crept up the road, holding up families of four on motorcycles.\nLunch was at Dos Hemisferios, right on the equator. The restaurant's middle-of-nowhere location belied its elegance. The kitchen was stainless steel and spotless; our waiters were overly attentive, even offering to snap a photo of us with our inch-thick lomo steak. This is something of a rarity in a country where tipping isn't practiced.\nMore coverage Personal Journey: Enroute to the sea, a wrong turn up mountain In Cambodia, majesty, tragedy, rebirth Tourism boom drives Japan to convert offices into hotels The first thing we saw as we descended to Otavalo was the great snow-covered volcano, Imbabura, and before it, a wide lake pointing toward the city.\nWe stopped at the first hostel we saw. The 10-year-old at the counter told us that a room including a private bathroom, three beds (outfitted with Dora the Explorer blankets), and Wi-Fi was $30. When the precocious young proprietor helped us park our car and gave us the keys to the room, Andrew remarked that he must be hitting retirement soon.\nWe walked two blocks and happened upon the Plaza de los Ponchos. At 7 in the evening, most of the vendors were packing up; tiny old women pushed through the crowd carrying bales of cloth that towered over their heads. But a row of yellow tents was being erected as these others were taken down. Inside, women were cooking rice, beans, pork chops, grilled plantains, corn, cheese-stuffed empanadas, and fried chicken. We walked from tent to tent, sampling it all.\nWhen we returned to the market the next morning, the tents had crept out into the streets like urban sprawl into open spaces. Used shoes lay in piles on the sidewalk, hammocks were strung like inverted rainbows from one side of a tent to the other. Ponchos, hats, jewelry, spices.\nAfter the congestion of the market, we drove up a cobblestone road to Cayambe Coca Ecological Reserve. The road was a bit too much for our car, but when we spotted the six-inch giant hummingbird and its relative, the striking black-tailed trainbearer, at an agave plant, we were satisfied. We found an eatery where we tried cuy - guinea pig - and called it a day.", "external_links": [], "published": "2015-08-02T03:00:00.000+03:00", "crawled": "2015-08-04T12:16:24.186+03:00", "highlightTitle": ""}