{"organizations": [], "uuid": "11d5ff243ad111ae823d6dafb4ccf9bc9710e469", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/Trade-Expo-Indonesia-2015-300x131.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-30th-trade-expo-indonesia-targets-2000-world-class-companies/", "country": "US", "title": "The 30th Trade Expo Indonesia Targets 2,000 World Class CompaniesTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "The 30th Trade Expo Indonesia Targets 2,000 World Class CompaniesTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "11d5ff243ad111ae823d6dafb4ccf9bc9710e469"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-30th-trade-expo-indonesia-targets-2000-world-class-companies/", "ord_in_thread": 0, "title": "The 30th Trade Expo Indonesia Targets 2,000 World Class CompaniesTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The 30th Trade Expo Indonesia Targets 2,000 World Class Companies Published on : Saturday, August 15, 2015\nThe Ministry of Trade is committed to maximizing an increase in trade transactions by promoting national exports on an international scale with largest trade expo in Indonesia, the Trade Expo Indonesia (TEI) 2015. Around 2,000 national companies will participate in this international event. This was emphasized by the Directorate General of National Export Development’s Director of Promotions and Image Development of the Ministry of Trade, Pradnyawati, during the launch of the 30th TEI today at the Ministry of Trade Office, Jakarta.\n“TEI is our strategic promotional event to attract world markets towards Indonesia’s leading products and services. This year the Ministry of Trade is targeting 2,000 exhibiting companies and 15,000 visitors, both domestic and foreign,” asserted Pradnyawati.\nAs an effort to increase the earnings at TEI, explained Pradnyawati, the Ministry of Trade will optimize the role of its Trade Attaches and Indonesian Trade Promotion Centers (ITPCs) in countries abroad by way of conducting intensive dissemination and approaches towards potential buyers so that they would attend the TEI 2015 event.\nTEI 2015 is scheduled to be held on 21-25 October 2015 at the Jakarta International Expo (JIExpo), Kemayoran, Jakarta. Within the 50,000 m2 exhibition area, there will be products and services that are divided into several zones, namely manufactured goods and services; furniture and furnishing; food, beverages, and agricultural products; premium fashion, lifestyle, and creative products; premium products from 34 Indonesia Provinces; and garden furniture.\nAs a display area for Indonesia’s finest products at TEI 2015, there will be a Pride of Indonesia (POI) Pavilion with an area of 500 m2 that will showcase a group of products and services from Indonesian companies that have recorded achievements/good performance and is a pride of the strategic industry sector (Primary Equipment for Defense Systems, paper, rubber boats, and medical equipment; biotechnological products (environmentally friendly plastic bags, green resource materials, vaccines); agricultural downstream products (organic food, essential oils); mining (gold ingots); automotive products and their parts; IT and creative products; and also SME products. There will also be an open space arena showcasing garden furniture, knockdown houses, and heavy equipment.\nThere will also be an ASEAN Pavilion that will provide information from representatives of ASEAN countries as part of welcoming the ASEAN Economic Community 2015. As many as nine countries have confirmed their participation in TEI this year, namely Brunei Darussalam, the Philippines, Indonesia, Cambodia, Laos, Malaysia, Singapore, Thailand, and Vietnam.\nPradnyawati explained that TEI is part of an effort to boost exports by 300% during the 2014-2019 period, and from the export of manufactured products in particular. “I hope that this commitment to furthering exports will be stregnthened by a commitment from all stakeholders in making TEI an expo of quality with international standards, and one that supports the concept of Business to Business (B to B) to promote trade transactions,” he said.\nFurthermore, said Pradnyawati, as with TEI last year, it is hoped that various countries will send trade mission delegations to TEI this year to directly seek out the best export products. Facilities that will be provided will be accommodations for TEI buyers at designated official hotels as well as shuttle buses from the hotel to the exhibition venue. Besides that, there will also be handlers and greeters of buyers at the airport.\nIn an effort to help make Indonesia’s chairmanship of the Indian Ocean Rim Association (IORA), whose series of meetings are scheduled to be held in Padang and Jakarta in 20-23 October 2015, a success, the Ministry of Trade will facilitate IORA by providing a booth at TEI 2015. Moreover, as part of the preparations for Indonesia’s participation in the Specialty Coffee Association of America (SCAA) 2016 event, a selection of coffee that will be featured at the SCAA event will also be featured at TEI 2015 making the coffee zone a “Road to Atlanta 2016″ event.\nThe Main Programs of TEI 2015\nAs in previous years, TEI 2015 will also feature a Trade and Investment Forum aimed at providing information to exporters, buyers, and investors on how to take advantage of international trade and investment opportunities. Besides that, there will also be a one-on-one Business Matching, which is a facility to introduce exhibitors with international buyers. It is hoped that the participants of this program can conduct trade inquiries and establish trade contracts while at the same time expand their distribution network to countries abroad.\nBearing in mind the effectiveness of the promotion of Indonesian products, which is also supported by the consistency of exporters and importers, this year’s TEI will also be consistent with the presentation of the Primaniyarta and Primaduta award. The Primaniyarta is awarded to exporters that have contributed to the development of the economy by way of increasing the export performance while the Primaduta is awarded to importers of Indonesian products abroad that has consistently imported Indonesian products.\nTEI 2014 drew 1,550 exhibitors, and a total of 14,345 visitors from China, Japan, Australia, South Africa, and India. In total, TEI managed to attain transactions amounting to USD 1.42 billion, comprising USD 814 million in transactions for products, USD 105 million in transactions for services, and USD 500 million in investments. The products that attracted the most buyers during TEI 2014 were furniture, processed food, textile and clothing, building materials, and also paper and paper products.\nSource: Trade Expo Indonesia 2015", "external_links": [], "published": "2015-08-15T03:00:00.000+03:00", "crawled": "2015-08-15T12:05:12.929+03:00", "highlightTitle": ""}