{"organizations": [], "uuid": "ea6e3a761159b200628ab038e697b6878ed12c03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/m/k/b/o/image.related.StuffLandscapeSixteenByNine.620x349.16mh4y.png/1441001043912.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/71592514/Jetstar-skips-Hamilton-and-Rotorua-in-regional-routes-announcement", "country": "AU", "title": "Jetstar skips Hamilton and Rotorua in regional routes announcement", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Jetstar skips Hamilton and Rotorua in regional routes announcement", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T09:04:00.000+03:00", "replies_count": 0, "uuid": "ea6e3a761159b200628ab038e697b6878ed12c03"}, "author": "Rachel Thomas", "url": "http://www.stuff.co.nz/travel/71592514/Jetstar-skips-Hamilton-and-Rotorua-in-regional-routes-announcement", "ord_in_thread": 0, "title": "Jetstar skips Hamilton and Rotorua in regional routes announcement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jetstar skips Hamilton and Rotorua in regional routes announcement RACHEL THOMAS Last updated 18:04, August 31 2015 ROSS GIBLIN/FAIRFAX NZ \nJetstar announces new regional flight routes. \nHamilton and Rotorua have lost a bid to get Jetstar into their airports, but the region's leaders have said they will continue trying to attract the airline. \nJetstar unveiled a new regional network in New Zealand, launching low fares on five routes between Nelson, Napier, New Plymouth, Palmerston North, Auckland and Wellington. Christel Yardley \nHamilton Mayor Julie Hardaker \nMayor of Hamilton, Julie Hardaker, said while she was \"really disappointed\" in the announcement, council would continue to make a case for the airline to include Hamilton in future plans. \n\"They indicated from day one they were very keen to expand to regional New Zealand and they would be starting with four but the intention was to increase that number.\" \nRotorua Mayor Steve Chadwick said while she was disappointed Rotorua had not been chosen, Rotorua Airport and Air New Zealand would continue to focus on increasing passenger numbers through Auckland and the South Island. Craig Robertson \nRotorua Mayor Steve Chadwick \n\"Increased capacity and flight connectivity are critical for accommodating growing year-on-year demand and we will continue to focus on the Auckland and Queenstown links in particular, to offer travellers the best possible routes and costs.\" \nJetstar first announced plans for a regional network in June this year and considered proposals from Hamilton, Rotorua, New Plymouth, Napier, Palmerston North, Nelson and Invercargill. \nThe final announcement was made on Monday morning in Wellington by David Hall, chief executive of Jetstar Australia and New Zealand. \n\"We believe the routes we've announcedoffer the strongest opportunities to grow the market and make a real difference to local economies and locals' wallets, encouraging more travel and saving people money when they fly.\" Ad Feedback \nHardaker said her view was Jetstar needed to choose a route network that would be sustainable. \n\"It also seems to me that being about one hour's drive from Auckland Airport will have also been a factor in their decision, as we know locals do travel to Auckland for domestic flights.\" \nHall said Jetstar would continue talks with stakeholders in Hamilton, Rotorua, Invercargill and Tauranga \"because they've all expressed a desire for airline competition\" . \nRotorua Airport chief executive Nicole Brewer said Rotorua would continue to explore future opportunities with both Jetstar and Air New Zealand. \n\"Our discussions with them do not finish here.\" \nNew Zealand-owned Kiwi Regional Airlines has restated its support for regional direct flights in the wake of Jetstar's announcement. \n\"We are pleased that fliers from these centres now have more choice when connecting with Auckland and Wellington, but we note that still none of the big airlines are offering region to region direct flights, like Kiwi is,\" chief executive Ewan Wilson said. \nWilson said that his company's first aircraft, which arrives tomorrow in Hamilton from Europe, includes both Hamilton and Queenstown in its first route. - Stuff", "external_links": [], "published": "2015-08-31T09:04:00.000+03:00", "crawled": "2015-08-31T11:11:39.125+03:00", "highlightTitle": ""}