{"organizations": [], "uuid": "517aad670781b75b37a9f525fccd656c61c5fdee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03394/0108_barossa__3394632k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-01.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/foodanddrink/wine/11775322/Light-bright-and-elegant-the-new-Australian-wines.html", "country": "US", "title": "Light, bright and elegant: the new Australian wines", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Light, bright and elegant: the new Australian wines - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T15:00:00.000+03:00", "replies_count": 0, "uuid": "517aad670781b75b37a9f525fccd656c61c5fdee"}, "author": "Victoria Moore", "url": "http://www.telegraph.co.uk/foodanddrink/wine/11775322/Light-bright-and-elegant-the-new-Australian-wines.html", "ord_in_thread": 0, "title": "Light, bright and elegant: the new Australian wines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A pretty brick building, covered in rambling roses, set at a parting of the thickly green Wiltshire lanes, is an unlikely outpost for lovers of Australian wines . The Harrow restaurant at Little Bedwyn has a chef-proprietor who, for years, has pursued his interest in wine from the Antipodes and let it spill into the cellar. Its dark rooms are stuffed with old rieslings that weave and wind as if they have many stories to tell, and young rieslings, lively with fierce lime and rushing lilac. There are immaculate, majestic chardonnays made from grapes grown in the cool of Tasmania and the Adelaide Hills; gorgeous, peony-lush pinot noir from the Mornington Peninsula. This isn’t just an Australian list – the rest of it betrays a love for wine in general – but only someone with Roger Jones’s focus could have created the connections and opportunities that bring not just bottles but also winemakers from the other side of the world through his door. How, I wonder, did Roger get involved with Australian wine – so fashionable now, not so much 20 years ago – in the first place? “Have I never told you? Very simple. I’m dyslexic and my French is terrible. But it was very easy to pick up Australian names. I got interested and we’ve seen it grow, seen the change, seen how much more delicate and clean the wine is getting – like the food.” • The story of the Australian wine clan behind Hardys Ah, yes, the food. Roger has a rare understanding of both food and wine. He is often seen at wine tastings, preparing trays of food that he has tweaked to bring out the nuances in both food and wine. He was at it again at The Harrow a couple of weeks ago as he hosted the Mamba Awards, an event now in its eighth year, intended to promote Australian wines. Australian wine used to be dismissed as Chateau Chunder “Back then it was still hard to tell people that Australian wines were good,” says Roger. “We wanted to highlight it, to our customers and others.” Every year two grape varieties (one white, one red) are chosen, entries are invited from the wine trade, and about five dozen tasters descend on the Harrow to judge the wines and then eat and drink into the night. This year was the turn of grenache and sémillon (as both a single varietal and a sémillon-sauvignon blend). With a couple of exceptions, it tends to be mainstream importers who enter such awards, but it is still a great tasting opportunity. Three wines stood out for me in the grenache and grenache blends tasting. Many of these wines were just so big, like huge, juicy pom-poms, as incontinent in their flavour as ripe mulberries. The John Duval Annexus Grenache 2013 (£39.95, slurp.co.uk), which is made from vines from just two Barossa vineyards, each of them more than a century old, was outstanding and the winner in its section: a mighty wine, aromatic and authoritative, that had some of the pumice taste you find in wines from the Rhône. I also rated the wine that came second: Teusner “Joshua” GSM (grenache, syrah, mourvedre) 2013 (£24.95, wineutopia.co.uk) is completely unoaked, a rare thing at this level of wine, and has refreshing elegance. Her Majesty enjoys a glass of white wine at Chateau Barossa on a tour of Australia in 2002 Picture: Ian Jones • The allure of the Loire: why it's time to celebrate chenic blanc I was still tasting the whites as trayfuls of canapés started coming out of The Harrow’s kitchen – and as I don’t like to eat while I taste (professionally anyway), I missed most of them. But I can say that the sashimi of bream with olive oil and lime and the seared yellowfin tuna with curried crust were superb with the sémillon-sauvignon blends, in particular Cullen Mangan sauvignon blanc-sémillon 2013 from the Margaret River ( winedirect.co.uk , £19.50). This is a white reminiscent of the toasty smell of cumin seeds dry-frying, and vibrant citrus. A third of the blend is fermented in oak, so there’s an underlying woody spice. Gorgeous. The winner in this section was Larry Cherubino’s assertive, grassy, toasty Pedestal 2014 (£14.99, strictlywine.co.uk ), which also smelt a tiny bit of crispy bacon. Oddly. I mean that in a good way. Also worthy of mention: I have a soft spot for the Fraser Gallop sémillon-sauvignon blanc 2012 from the Margaret River ( winedirect.co.uk , £16.95). The estate was only founded in 1998, but has quickly found its feet. This is another white made with oak, which has a richness, like passion fruit is rich, and tastes of white currants with lime and pink grapefruit riffing through it. • The best wines to drink this summer The bottle is another reminder Australian wine has changed. It’s lighter and brighter. “Like the food,” says Roger as we chat after dinner over a gorgeous glass of syrah, E&E Black Pepper Shiraz 1996 he picked up years ago – “I drove around the country, buying all the stock I could from Thresher” – and has hung on to ever since (that was his last one). There is tenacity. Long may it continue. THREE WINES TO TRY YALUMBA OLD BUSH VINE GRENACHE 2013 Australia (14.5%, Co-op, Tesco, £11.99) A generous, loosely knit, sweetly ripe red made from the fruit of low-yielding old grenache vines in a sandy Barossa vineyard. This wine got my vote for the Mamba best-value wine trophy – and won it. Reminiscent of mulberries and white pepper. Try it with lamb and redcurrant burgers. EDEN ROAD WINES THE LONG ROAD CHARDONNAY 2012 Australia (12.5%, Noel Young Wines in Cambridge, £22.49) The beautifully named region of Tumbarumba is in New South Wales, about halfway between Sydney and Melbourne, and in the past few years, as a cooler, more controlled style of wine has become fashionable, it has justly won plaudits for the quality of its chardonnay. This one is a beauty, fermented in French oak. Satisfying and complete. ROLF BINDER CABERNET MERLOT 2013 Australia (13.5%, Waitrose, £10.99 down from £13.99 to 11 August) A gorgeous, juicy red from Australia. This is a bordeaux blend, but it has none of those dusty French characteristics. @telegraph", "external_links": [], "published": "2015-08-01T15:00:00.000+03:00", "crawled": "2015-08-01T14:50:49.534+03:00", "highlightTitle": ""}