{"organizations": [], "uuid": "c42510a1bbb0bc025d59806bfbbfbb45dd9012b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kentucky.com", "main_image": "http://www.kentucky.com/mistatic/images/facebook/HeraldLeader.jpg", "site_section": "http://www.kentucky.com/163/index.rss", "section_title": "Kentucky.com -- Travel", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/08/17/3992178_finding-appalachian-culture-fun.html", "country": "US", "title": "Wisconsin's Rustic Roads program, which preserves bucolic drives, celebrates 40th anniversary", "performance_score": 0, "site": "kentucky.com", "participants_count": 0, "title_full": "Wisconsin's Rustic Roads program, which preserves bucolic drives, celebrates 40th anniversary", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T11:00:00.000+03:00", "replies_count": 0, "uuid": "c42510a1bbb0bc025d59806bfbbfbb45dd9012b6"}, "author": "", "url": "http://www.kentucky.com/welcome_page/?shf=/2015/08/17/3992178_finding-appalachian-culture-fun.html", "ord_in_thread": 0, "title": "Wisconsin's Rustic Roads program, which preserves bucolic drives, celebrates 40th anniversary", "locations": ["Minneapolis", "Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["JIM BUCHTA"], "text": "Wisconsin's Rustic Roads program, which preserves bucolic drives, celebrates 40th anniversary By JIM BUCHTA Star Tribune (Minneapolis) August 17, 2015 2015-08-17T12:09:38Z \nMany times while traveling Wisconsin's Great River Road, I've passed a plain brown \"Rustic Road\" sign along a narrow gravel lane just north of Maiden Rock. \nJust a warning to avoid another shock-absorber-killing country road, I'd thought. \nI couldn't resist. \nThis spring, I followed that Rustic Road sign near the intersection of Hwy. 35 and County Road AA and was quickly on a gravel lane that zigzagged through a thick hardwood forest. Snow-white trilliums skipped across the shady understory and maidenhair ferns stood poised and ready to unfurl their fiddle-like branches toward random peaks of sunlight. \nI passed a couple of houses tucked discreetly into the woods, but saw not a single billboard, power line or street sign. \nThis was Rustic Road 51, one of 117 rural roads to receive such a designation in Wisconsin, the nation's first state to safeguard the bucolic nature of certain scenic roadways. Unaware of where it might take me and getting no clues from the car's GPS system, I followed No. 51 up and down the roller-coaster contours of the Driftless Area. \nBucolic beauty and historic features line Wisconsin's Rustic Roads. The remains of an old sawmill, above, lies along Rustic Road 9 in Door County. \nIn at least three places, in an act of natural defiance, narrow streams carved deep ruts across the road, forcing me to drive through the foot-deep water slowly, like the loggers once did when their skids were drawn by real horse power. \nFour miles later, I was back on pavement, back in the 21st century and eager for another trip down a rustic road. \nThe program - now celebrating its 40th year - is administered by the Wisconsin Department of Transportation and has its own its staff and coordinator that works with communities to identify, establish and maintain the roads. A 10-member Rustic Roads board votes on local recommendations, requiring that roads have outstanding natural features or some other attribute that sets them apart, be lightly traveled and have a rustic quality. Roads remain under local control. The first Rustic Road designation came in 1975. \nJane Carrola, who coordinates the program, said that it has been called one of the state's longest-running state-local partnerships. She calls it a \"Wisconsin Original.\" \nOn average, she said, only one or two routes are designated each year, and there are now about 670 miles of rustic road in the state. The most recent designee was No. 117 in Waushara County, about 80 miles north of Madison. That 1.8-mile stretch has glimpses of the Pine River, sandhill cranes and several historic structures, including a town hall, a covered bridge and a Civil War-era bell. It was designated in December. \nCarrola said the program aims to preserve roads that have some kind of natural beauty, without compromising their safety. Bikers, hikers and motorcyclists are all encouraged to use the roads, and communities are encouraged to adopt zoning rules that limit or discourage development. \nDuring my Rustic Road treks this summer, nature wasn't the only thing that made me brake. \nAlong Rustic Road 7, aka Sleepy Hollow Road near Kewaunee, Wis., I stopped to admire the Reinke Mill, an imposing 1905 fieldstone flour mill, while a rooster with bright red comb and two white hens clucked about. \nOn a recent trip to Door County, I took several Rustic Road detours. Rustic Road 77, a paved road that passes a lighthouse and a Coast Guard station, is near the spot where American Indians portaged from Lake Michigan to Sturgeon Bay before the ship canal was built. The road eventually traces the craggy shoreline of Lake Michigan as it meanders past dozens of quaint beach houses and windswept dunes. \nHere, as on most of the Rustic Roads, traffic moves slowly. The speed limit along these byways must not exceed 45 miles per hour, and there's little incentive to speed. \nOn Rustic Road 9, a nearly 7-mile stretch of paved road, I caught broader glimpses of the lake and stopped to watch the Shivering Sands Creek pass beneath a bridge. \nShortly before the end of that Rustic Road, near the sandy beaches of Whitefish Dunes State Park, I stopped to check out the remnants of a creaky old sawmill. \nHere, far from the din of freeway noise, I could hear the faint buzzing of bumblebees collecting nectar, grateful that I'd taken another of Wisconsin's roads less traveled.", "external_links": [], "published": "2015-08-17T11:00:00.000+03:00", "crawled": "2015-08-19T08:02:40.055+03:00", "highlightTitle": ""}