{"organizations": [], "uuid": "758d269a51d12147d762af0cf30305b1e51ceda9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/02/26/petrobras-xxx/ALTERNATES/crop_100x100/Petrobras+xxx+", "site_section": "http://www.bdlive.co.za/life/travel", "section_title": "Travel &amp; Food | BDlive ", "url": "http://www.bdlive.co.za/world/americas/2015/08/18/graft-probes-may-cost-petrobras-record-1.6bn-or-more", "country": "ZA", "title": "Graft probes may cost Petrobras record $1.6bn or more | Americas", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "Graft probes may cost Petrobras record $1.6bn or more | Americas | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T20:19:00.000+03:00", "replies_count": 0, "uuid": "758d269a51d12147d762af0cf30305b1e51ceda9"}, "author": "Jeb Blount and Mica Rosenberg", "url": "http://www.bdlive.co.za/world/americas/2015/08/18/graft-probes-may-cost-petrobras-record-1.6bn-or-more", "ord_in_thread": 0, "title": "Graft probes may cost Petrobras record $1.6bn or more | Americas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A file picture of Petrobras oil platforms at Campos basin in Rio de Janeiro. The state oil company is embroiled in a growing corruption scandal. Picture: REUTERS Related articles Petrobras earnings beat forecasts amid graft probe gloom NEWS ANALYSIS: Petrobras overhaul calls for much more than corruption clean-up Scandal-hit Petrobras reports huge loss in 2014 Braskem implicated in Petrobras corruption scandal Petrobras mulls over divestments as corruption scandal clogs bond sale efforts Petrobras scandal becomes a risk to contracts RIO DE JANEIRO/NEW YORK — Brazil’s Petrobras may need to pay record penalties of $1.6bn or more to settle US criminal and civil probes into its role in a corruption scandal, a person recently briefed by the company’s legal advisors told Reuters.\nState-run Petroleo Brasileiro SA, as the company is formally known, expects to face the largest penalties ever levied by US authorities in a corporate corruption investigation, according to the person, who has direct knowledge of the company’s thinking. The settlement process could take two to three years, this person said.\nTo date, the largest settlement of corporate corruption charges with the US Department of Justice and the US Securities and Exchange Commission (SEC) was a 2008 agreement with Siemens AG, the German industrial giant. It agreed to pay the $800m to settle charges related to its role in a bribery scheme, and paid about the same amount to German authorities.\nThe person told Reuters the legal advisors said they believed Petrobras faced fines that could be as large as, or more than, the $1.6bn in combined US and German penalties that Siemens faced.\nTwo other sources with direct knowledge of Petrobras’ plans also said that any settlement, while several years away, would likely be \"large,\" but declined to give a specific estimate.\nAll three sources requested anonymity, and cautioned that any estimates for the size of possible fines are very preliminary.\nPetrobras has not yet begun settlement talks with US authorities, whose investigations are believed to be in an early phase, they said.\nIn November, the SEC sent a subpoena to Petrobras requesting information about the widening corruption investigations that have ensnared top company executives, major private contractors and senior politicians in Brazil.\nAccording to people familiar with the matter, the Department of Justice, which can bring criminal charges, is also investigating the company.\nBid-rigging\nPetrobras’ lawyers maintain that the firm was a victim of corruption and bid-rigging by engineering firms and other suppliers to the firm, a group of former employees who allegedly took or arranged bribes, and Brazilian politicians who benefited from kickbacks from Petrobras suppliers, according to Petrobras officials.\nHowever, the attorneys also said they believe that investigations by US authorities are likely to result in charges that Petrobras itself violated the US Foreign Corrupt Practices Act (FCPA) and securities laws, according to the person who was briefed.\nLast December, Brazil’s prosecutor-general Rodrigo Janot said Brazilian prosecutors were co-operating with investigations by the SEC and the Department of Justice into whether the corruption scheme hurt the interests of US investors in Petrobras shares listed in New York.\nIn an e-mailed response to questions, Petrobras declined to comment on the US investigations or any estimates of how much an eventual settlement may cost.\nThe department and the SEC also declined to comment for this article.\nPetrobras falls under US jurisdiction because its shares are traded in the US — until recently it was the largest foreign company on the New York Stock Exchange.\nThe person who was briefed said legal advisors warned Petrobras that if money related to the case moved through US banks it could open the company up to prosecution. Brazilian prosecutors have produced evidence that some of the illegal payments were arranged on US soil, according to court documents filed in Brazil.\nThis source also said the advisors’ view was that a negotiated settlement and penalties makes more sense than fighting the US Justice Department.\nSuch fines would be another financial hit for Petrobras, whose market value has sunk to less than $40bn from nearly $300bn seven years ago.\nBrazilian prosecutors have made no moves to punish the company, even though their investigation has led to more than 100 indictments.\nTwo senior Petrobras executives are among a dozen people who have already been convicted in Brazil for offences such as money laundering and racketeering.\nPetrobras executives allegedly conspired with construction and engineering companies and other suppliers to rig bids and inflate the cost of contracts. The excess was then kicked back to executives, politicians and political parties as bribes and campaign contributions, according to Brazilian court documents, including court rulings and prosecutors’ presentations.\nBrazilian prosecutors say they have found no evidence of illegal payments that went directly from Petrobras to government officials. But even if the company is not found to have bribed officials it could be penalised under the \"books and records\" provision of the FCPA.\nThe provision requires companies to keep accurate financial accounts and maintain an adequate system of internal accounting controls.\nPetrobras took a $17bn charge against earnings in 2014 to account for overvalued assets in the wake of the scandal. At the time, Petrobras said 12% of that total, or more than $2bn, was directly related to corrupt acts not accounted for in earlier periods.\nSince November, Petrobras has been working to limit the damage. The oil company hired US law firm Gibson, Dunn & Crutcher and the Brazilian law firm Trench, Rossi e Watanabe to conduct an internal investigation into the allegations and has promised to turn over information to the authorities.\nThe law firms report to Ellen Gracie Northfleet, former chief justice of Brazil’s Supreme Court and Andreas Pohlmann, who was chief compliance officer of Siemens from 2007 to 2010 — the period in which it agreed to pay the record-setting fines.\nMs Gracie and Mr Pohlmann were hired in December by the Petrobras board to ensure that the investigation remained independent.\nGibson Dunn did not respond to a request for comment.\nTrench, Rossi e Watanabe declined to comment.\nPetrobras also created a compliance unit with an independent senior executive with broad powers and a mandate to investigate anyone at the company, including the CE.\nCo-operation with investigations by the US authorities may reduce the amount of penalties negotiated in a settlement deal, legal experts said.\nSome of Petrobras’ contractors could face their own large US penalties for bribing Petrobras executives, who are considered government officials under the FCPA, the experts said.\nReuters", "external_links": [], "published": "2015-08-18T20:19:00.000+03:00", "crawled": "2015-08-18T17:54:43.310+03:00", "highlightTitle": ""}