{"organizations": [], "uuid": "e1f7511af0b857c04b5aaa9b44ab48ccbf1a53fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/record-complete-sc-court-of-appeals-to-take-up-contentious-cruise-terminal-dispute-321862721.html", "country": "US", "title": "Record complete: SC Court of Appeals to take up contentious cruise terminal dispute", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Record complete: SC Court of Appeals to take up contentious cruise terminal dispute - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T10:58:00.000+03:00", "replies_count": 0, "uuid": "e1f7511af0b857c04b5aaa9b44ab48ccbf1a53fd"}, "author": "Bruce Smith, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/record-complete-sc-court-of-appeals-to-take-up-contentious-cruise-terminal-dispute-321862721.html", "ord_in_thread": 0, "title": "Record complete: SC Court of Appeals to take up contentious cruise terminal dispute", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLESTON, S.C. - The South Carolina Court of Appeals is ready to consider a challenge to a state permit for a contentious $35 million cruise passenger terminal in Charleston more than a year after the appeal was first filed.\nCourt documents show that, as of last Monday, the record was complete for the appeal filed in April, 2014. Now the judges must decide whether to hear oral arguments before ruling or decide the issue on documents already submitted.\nThe South Carolina Ports Authority wants to build a new cruise terminal to accommodate an expanded cruise industry by renovating a waterfront warehouse.\nThe state Department of Health and Environmental Control granted a permit almost three years ago allowing five additional clusters of pilings to be placed beneath the old warehouse where there are now more than 1,000 clusters.\nAn administrative law judge upheld the permit saying conservation, preservation and community groups lacked standing to object. Those groups, who contend the new terminal will hurt property values, the quality of life and increase pollution, then appealed.\nLast month, the state Supreme Court refused to directly hear the appeal. Their one-page ruling did not give a reason.\nMeanwhile, a spokeswoman for the Charleston District of the U.S. Army Corps of Engineers said Thursday the agency has already received about 50 comments from the public on a renewed application for a federal permit.\nThat permit, again allowing the additional pilings, was issued in 2012. But the following year a federal judge sent it back for a more extensive review.\nU.S. District Judge Richard Gergel said while the Corps reviewed the impact of the pilings on the water, it should have considered the larger issue of the terminal's impact on Charleston.\nThe public has until Aug. 24 to comment. Then the Corps will decide whether a full Environmental Impact Statement, which could take a year, should be compiled.\nThe Ports Authority proposed the new terminal in 2010, the same year Carnival Cruise Lines based its 2,056-passenger liner Fantasy in Charleston, giving the city a year-round cruise industry.\n ", "external_links": [], "published": "2015-08-14T10:58:00.000+03:00", "crawled": "2015-08-14T16:36:56.569+03:00", "highlightTitle": ""}