{"organizations": [], "uuid": "3b8050bd62eeff3e18d0eb3f9ba6258af14a92eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150817Mexico.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/08/17/salman-rushdie-paul-aster-and-other-prominent-writers-blast-mexican-president-over-journalist-slayings", "country": "US", "title": "Salman Rushdie, Paul Aster and other prominent writers blast Mexican president over journalist slayings", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Salman Rushdie, Paul Aster and other prominent writers blast Mexican president over journalist slayings", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T21:18:00.000+03:00", "replies_count": 0, "uuid": "3b8050bd62eeff3e18d0eb3f9ba6258af14a92eb"}, "author": "Jill Replogle", "url": "http://www.ticotimes.net/2015/08/17/salman-rushdie-paul-aster-and-other-prominent-writers-blast-mexican-president-over-journalist-slayings", "ord_in_thread": 0, "title": "Salman Rushdie, Paul Aster and other prominent writers blast Mexican president over journalist slayings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Salman Rushdie, Paul Aster and other prominent writers blast Mexican president over journalist slayings AFP From: To: \nMexican journalists take part a demonstration protesting for the murder of photojournalist Ruben Espinosa, in Acapulco, Guerrero state, Mexico, on August 4, 2015. Espinosa was found shot dead on August 1, 2015, in Mexico City, where he had moved two months ago from Veracruz after reporting strong threats from the state government. AFP/Pedro Pardo MEXICO CITY , Mexico — A group of prominent writers, artists and intellectuals have called on the Mexican president to address the country’s terrible record on protecting journalists who report on drug violence and other criminal activity. \nAcross Mexico , 88 journalists have been murdered since 2000, according to Reporters Without Borders , and another 20 or so have disappeared. \nNearly 500 prominent voices, including Britain’s Salman Rushdie, American writer Paul Auster and Canada’s Margaret Atwood, signed an open letter Sunday to President Peña Nieto decrying violence against journalists. \nWe “would like to express our indignation regarding the deadly attacks against reporters in your country,” the letter states. \n“An attempt on the life of a journalist is an attack on society’s very right to be informed.” \nThe most recent case to attract widespread revulsion is that of photojournalist Ruben Espinosa , who had fled the violence-plagued state of Veracruz and gone to Mexico City after receiving threats. \nEspinosa was one of five victims found dead this month at an apartment in the capital, their hands bound and their bodies bearing signs of torture. \n“This is only the latest in a long series of outrages against the press, and it took place in a city that was considered one of the last safe places in the country for reporters to work. There would now seem to be no safe haven for the profession,” the letter states. \nAt least 11 Veracruz journalists have been killed in the past five years in the eastern state, leading Reporters Without Borders to rank it the third most dangerous place in the world to practise the profession, after Iraq and Syria. \n“Mr. President, there must be no more murders,” states the letter, which goes on to call for the perpetrators to be brought to justice. \n“In your country, the statistics are disastrous regarding impunity in crimes against the press.”", "external_links": [], "published": "2015-08-17T21:18:00.000+03:00", "crawled": "2015-08-18T00:22:28.390+03:00", "highlightTitle": ""}