{"organizations": [], "uuid": "d13a5df0e3011de44ab40534e6fe12866aa3633e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "travel.iafrica.com", "main_image": "http://travel.iafrica.com/apps/imageUtil/view/article/1001859/1/630x385/", "site_section": "http://feeds.feedburner.com/IafricacomTravelLatestNews", "section_title": "iAfrica :: Travel : Top Stories", "url": "http://travel.iafrica.com/bulletinboard/1001859.html", "country": "US", "title": "Get free access to SA National Parks", "performance_score": 0, "site": "iafrica.com", "participants_count": 1, "title_full": "Get free access to SA National Parks", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T16:33:00.000+03:00", "replies_count": 0, "uuid": "d13a5df0e3011de44ab40534e6fe12866aa3633e"}, "author": "Megan Ellis", "url": "http://travel.iafrica.com/bulletinboard/1001859.html", "ord_in_thread": 0, "title": "Get free access to SA National Parks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Get free access to SA National Parks Article By: Megan Ellis Fri, 07 Aug 2015 5:33 PM Share Your Email A lion at the Kruger National Park. Credit: flickr.com/ flowcomm \nInterested in visiting South Africa's awesome national parks for free? Then you'll be glad that National Parks Week is arriving soon. \nNational Parks Week will see free access granted to day visitors for most of South Africa's 21 national parks. \nThis year, the event will be from September 14 - 18. \nHowever, some parks will extend the free access through the weekend. \nOf course, this doesn't include free accommodation or tourist activities. However it's still a great deal. \nAll SANParks national parks will be participating, except for Namaqua National Park and the Boulders Penguin Colony. \nThe initiative is aimed at showing the public the role that SANParks plays as the custodian of South Africa's natural heritage. \n\"If we are to create a sense of ownership of the natural heritage of South Africa in all South Africans, then all South Africans must be able to have access to such. We especially want our young people to take advantage of this opportunity because this heritage will be under their protection in the near future,\" SANParks CEO Fundisile Mketeni said in a statement. \n\"The survival of the South African national parks system and our natural and cultural heritage lies in the people of South Africa. Environmental education and protection is the responsibility of everyone, not just a privileged few.\" Related Articles", "external_links": [], "published": "2015-08-07T16:33:00.000+03:00", "crawled": "2015-08-08T10:24:10.282+03:00", "highlightTitle": ""}