{"organizations": [], "uuid": "74687ae4de27c8b3023693688a3abcab5451e927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03411/Old-Mutual-3-golfe_3411545a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-18.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/sport/golf-challenge/11810311/third-regional-final-london-golf-club.html", "country": "US", "title": "Third regional final: Shaw shows international class", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Third regional final: Shaw shows international class - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T01:11:00.000+03:00", "replies_count": 0, "uuid": "74687ae4de27c8b3023693688a3abcab5451e927"}, "author": "Oliver Pickup", "url": "http://www.telegraph.co.uk/sponsored/sport/golf-challenge/11810311/third-regional-final-london-golf-club.html", "ord_in_thread": 0, "title": "Third regional final: Shaw shows international class", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The third regional final of the 2015 Old Mutual Wealth Golf Challenge took place on the International Course at London Golf Club near Brands Hatch in Kent, a venue notable for its fast, undulating fairways that staged the 2014 Volvo World Match Play Championship. After 18 holes of medal play that tested the nerve of 48 amateur players – 24 men and 24 women, all of whom had qualified via competitions at their home clubs – the quartet of West Hove’s Tom Shaw, Daniel Boyle of West Herts, Boughton’s Alexandra Ord and Kate Dunham, who plays at Clandon Regis, came out on top and advanced from the South and South East pool. Shaw, who had four birdies on the back nine in a round of 63 to finish five strokes clear of runner-up Boyle, praised the International Course for being in “immaculate condition” and modestly added that he was pleased “things went right instead of wrong for once”. Ord managed a round of 70 – one better than Dunham – and was similarly glowing about the venue, labelling it “beautiful [and my] favourite”. She suggested that avoiding the water was the key to her success as well as good “course management”. The four have been rewarded with berths in next month’s inaugural Grand Final at Old Head Golf Links, near Kinsale in Co Cork, a spectacular cliff-top course. The Grand Final is on 28 and 29 September and will be held in the company of Sam Torrance, the 2002 Ryder Cup-winning captain, 2014 vice-captain and eight-times Ryder Cup player. Almost 600 golf clubs in England, Scotland and Wales entered the inaugural Old Mutual Wealth Golf Challenge and the remaining four of the 16 finalists will be determined in the last regional competition at Celtic Manor, Newport. LEADERS Men Tom Shaw (West Hove) 63 Daniel Boyle (West Herts) 68 Simon Ostrom (Rowlands Castle) 69 Matthew Seldon (West Kent) 69 Darron Millar (The Drift) 69 Women Alexandra Ord (Boughton) 70 Kate Dunham (Clandon Regis) 71 Mandy Overton (Alresford) 73 Elaine Parkes (Sedlescombe) 74 Ezzie Massey (Crowborough Beacon) 74 • Discover more about the Old Mutual Wealth Golf Challenge »", "external_links": [], "published": "2015-08-19T01:11:00.000+03:00", "crawled": "2015-08-18T19:44:31.832+03:00", "highlightTitle": ""}