{"organizations": [], "uuid": "6563f7ceabc30a65349727db9cc681fe22c8f402", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources0.news.com.au/images/2015/08/27/1227501/439136-84e95158-4c55-11e5-b250-71d2033ae921.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/five-premium-economy-classes-that-are-worth-paying-extra-for/story-fn6yjmoc-1227501439358?from=public_rss", "country": "IL", "title": "Five of the best premium economy airline seats", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Five of the best premium economy airline seats", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T09:15:00.000+03:00", "replies_count": 0, "uuid": "6563f7ceabc30a65349727db9cc681fe22c8f402"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/five-premium-economy-classes-that-are-worth-paying-extra-for/story-fn6yjmoc-1227501439358?from=public_rss", "ord_in_thread": 0, "title": "Five of the best premium economy airline seats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What are these? There’s wider seats and more legroom in premium economy. Source: Supplied \nCATTLE class verges on the painful during a quick flight, but can become incredibly excruciating when you’re in it for the long haul. \nSometimes, it’s just worth it to pay a bit extra for comfort. \nSo instead of starting off your holiday on a sour note, check out this list of premium economy classes that will let you upgrade without blowing your entire budget. \n1. Singapore Airlines \nSingapore Airlines is already a formidable name in the skies, but the premium economy class they’ve rolled out makes them worth bookmarking on all your devices. They’re not sparing a thing — from each seat offering 38 inches (96 centimetres) of pitch compared to 32in (81cm) in standard economy and the ability to recline eight inches, there are also features almost unheard of in anything other than business class such as a calf rest and foot bar. \nPassengers also have priority check-in and boarding, plus access to two USB plugs, a universal power plug, Wi-Fi, and 13-inch high-definition monitors that come with noise-cancelling headphones. \nIf that’s not enough, passengers can choose to sip on wine or champagne and have the option to pre-order their meal before the flight. Satay in the sky, anyone? The Singapore Airlines’ premium economy class. Source: Supplied \n2. Lufthansa \nThe premium economy cabins on German airline Lufthansa are completely separate compartments from economy class. \nPremium Economy passengers not only receive priority boarding, but also have access to Lufthansa Business Class Lounges for an additional $25. Plus they are given an additional baggage allowance and meals with china tableware and real cutlery, just like grown-ups. A meal given to those in Lufthansa’s premium economy section. Source: Flickr \n3. Qantas \nPassengers on Qantas’ premium economy class have a separate, dedicated check-in counter as well as priority boarding, much like most premium economy classes for the other airlines. \nTheir standout feature is the private cabin that’s equipped with ergonomically designed seats that have a multiway adjustable headrest. Your body will thank you after the long haul, trust us. Premium Economy seats on Qantas. Source: Supplied \n4. Cathay Pacific \nAdmit it, sometimes the only thing you want is more leg room. If that’s what you’re looking for, Cathay Pacific will offer you just that, and a little bit more. \nYou get eight inches of recline, plus leg and foot rests. Seats on Cathay Pacific have 38 inches of pitch, plus a tray table with a smaller cocktail table. \nYou also get additional baggage allowance, either in weight or the number of pieces you check in. Premium economy, Cathay Pacific. Source: Supplied \n5. ANA (All Nippon Airways) \nThe leading Star Alliance carrier out of Japan offers priority check-in and baggage handling, and it also gives premium economy ticket holders complimentary lounge access. \nThe lounges can be found in both Tokyo airports, plus those in New York, Los Angeles, San Francisco, London, and more around the world. \nThe seats offer upgrades with the likes of 38 inches of pitch, a seat width of at least 18 inches, universal power points, large tray tables, and extendible footrests. ANA’s offering. Source: Supplied \nFor more travel advice go to Skyscanner.com.au .", "external_links": [], "published": "2015-08-27T09:15:00.000+03:00", "crawled": "2015-08-27T12:36:07.474+03:00", "highlightTitle": ""}