{"organizations": [], "uuid": "8adcef040fd224a12af6adb1f881488f8521a98f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://WCAX.images.worldnow.com/images/8560897_G.jpg", "site_section": "http://www.wcax.com/category/23748/travel", "section_title": "Travel &amp; vacation planning tools, tips, destinations and ideas - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/29781126/murder-suspects-ex-faces-charges-in-armed-standoff", "country": "US", "title": "Murder suspect's ex faces charges in armed standoff", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Murder suspect's ex faces charges in armed standoff - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "8adcef040fd224a12af6adb1f881488f8521a98f"}, "author": "Alex Apple", "url": "http://www.wcax.com/story/29781126/murder-suspects-ex-faces-charges-in-armed-standoff", "ord_in_thread": 0, "title": "Murder suspect's ex faces charges in armed standoff", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BARRE, Vt. - It took several hours for the Washington County Sheriff's Department to bring the suspect, Henry Premont to his arraignment because he was in the state's custody due to mental health concerns.\nHenry Premont, the man who was involved in an hour armed standoff with police Wednesday was screaming for his ex-girlfriend at the scene. That ex-girlfriend is a name very familiar to Vermonters.\nPolice say when Premont walked out of Rickie's Shell Station in Barre Town Wednesday he seemingly wanted police to shoot him.\n\"Premont specifically asked the troopers to blast him,\" said Washington County State's Attorney Scott Williams.\nPremont surrendered after a one hour standoff and a day later was arraigned on two misdemeanor charges: disorderly conduct and reckless endangerment.\nWilliams says police started searching for Premont Wednesday after a concerned relative said he threatened Armageddon if confronted by police.\nCourt papers show he demanded to speak with his ex-girlfriend and alleged murderer Jody Herring who police say shot a Department for Children and Families social worker last week.\n\"Mr. Premont walked out of the store with two beer cans in his hand. Dropped one of the beer cans and pulled a pistol from his holster on his right hip,\" said Williams.\nAfter his court appearance Thursday, Washington County Sheriffs transported Premont back to a mental health facility.\nMeanwhile Williams left hoping the string of violence in central Vermont is over.\n\"I'm cautiously optimistic that this is the last dramatic hiccup of this tragedy,\" said Williams.\nAssistant Attorney General John Treadwell says the investigation into the depths of Jody Herring's three family members is ongoing but no final word on when charges will come.\nRelated Stories:\nFormer boyfriend of alleged murder suspect in custody after Barre standoff\nHerring family breaks silence about slain loved ones\nFather: Killing of Vermont social worker like a 'soap opera'\nSobel funeral held; Vt. officials discuss new security measures\nHerring family: Avoid social media fundraising sites\nMass. social workers hold vigil in honor of Vt. colleague\nBarre woman pleads not guilty to killing state employee\nSlow healing for communities hit by violence\nState flags ordered at half-staff\nFriends, family hold vigil for slain social worker\nShumlin: Vermonters Shocked, horrified, grief stricken\nHerring officially charged in deadly Barre shooting\n3 women found dead in Berlin related to Barre shooting suspect\nVt. leaders react to Barre murder, Berlin deaths\nSurveillance video may show deadly Barre shooting\nVt. DCF worker shot and killed in Barre", "external_links": [], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-14T07:37:53.157+03:00", "highlightTitle": ""}