{"organizations": [], "uuid": "39f40d49c14507e88d9d7882ae66ab412b03e244", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150808SanJoseSuite.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/08/07/costa-rican-capital-stars-in-u-s-composers-musical-odyssey", "country": "US", "title": "Costa Rican capital stars in composer's musical odyssey", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rican capital stars in composer's musical odyssey -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T16:54:00.000+03:00", "replies_count": 0, "uuid": "39f40d49c14507e88d9d7882ae66ab412b03e244"}, "author": "Emilie Pons", "url": "http://www.ticotimes.net/2015/08/07/costa-rican-capital-stars-in-u-s-composers-musical-odyssey", "ord_in_thread": 0, "title": "Costa Rican capital stars in composer's musical odyssey", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When I spoke with trumpet player and composer Etienne Charles outside the upper Manhattan club Smoke a few weeks ago, he told me about his latest project. It’s an unusual suite involving San José, Costa Rica; San Jose, California; and St. Joseph in Trinidad.\nThe three cities have more in common than just their names. Each has known colonization. Charles, who is from Trinidad, became interested in seeing how the people of each culture were affected by history and how “music helped people overcome adversities.”\nThe project, commissioned by the national organization Chamber Music America, has been a way to see “how music relates to a society and can tell the story of a society and a people,” Charles said. “Musicians are important in terms of telling people what’s going on. The common thread that I was working with was the theme of resistance from community in respect to conquest: how do these people deal with the advent of conquest, with people who come into their land to get money?”\n“Conquest leads to new communities being formed,” the musician added. “When you get a community together, a real resistance can happen.”\nCharles’ upbringing exposed him to various cultures, which allowed him to gain different perspectives on the power of music.\n“In every society, music has different functions,” Charles said. “In some societies, music is for healing; in others, music is used to bring you closer to God. It’s about digging into what each culture does, how they use music. It’s about digging into what the rituals are that the music came out of. It’s about seeing what activities have music in them.”\nCharles made field visits to all three cities to research the country as part of the composition process, and incorporated rhythms and influences from each of the three countries represented into the finished work. In Costa Rica, his visit put him face to face with artists including calypso king Walter Ferguson and indigenous leaders in the town of Boruca. He said he was “very surprised at how much they use Caribbean music in Costa Rica.”\nA commission is usually a work in progress until the performance. It neither gets recorded nor gets repeated, and artists generally don’t even know if they are going to have a chance to play it again. Charles’ sextet, featuring Brian Hogan on alto saxophone, Alex Wintz on guitar, Victor Gould on piano, Ben Williams on bass and John Davis on drums, will premiere the piece at the San Jose Jazz festival this weekend in California.\nThe project was made possible thanks to the Doris Duke Charitable Foundation and the performance is funded in part by a grant from the Castellano Family Foundation; the perfromacne will last from 60 to 75 minutes.\nFor Charles, this suite can appeal to people who like history and knowledge, and he has incorporated some of his idiosyncratic syncopations and root grooves into the piece, he said.\nFor more information on the piece or its premiere in San Jose, California, on August 8, visit the San Jose Jazz Festival website.", "external_links": ["http://summerfest.sanjosejazz.org/artists/etienne-charles-san-jose-suite"], "published": "2015-08-07T16:54:00.000+03:00", "crawled": "2015-08-08T06:17:00.017+03:00", "highlightTitle": ""}