{"organizations": [], "uuid": "c643778063fd63376ec85bf4de07b7b3af826dd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/christmas-packages/28086-london-marriott-hotel-grosvenor-square-unveils-its-festive-christmas-package-2015", "country": "US", "title": "London Marriott Hotel Grosvenor Square unveils its festive Christmas package 2015", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "London Marriott Hotel Grosvenor Square unveils its festive Christmas package 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T17:45:00.000+03:00", "replies_count": 0, "uuid": "c643778063fd63376ec85bf4de07b7b3af826dd5"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/christmas-packages/28086-london-marriott-hotel-grosvenor-square-unveils-its-festive-christmas-package-2015", "ord_in_thread": 0, "title": "London Marriott Hotel Grosvenor Square unveils its festive Christmas package 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "London Marriott Hotel Grosvenor Square unveils its festive Christmas package 2015 London Marriott Hotel Grosvenor Square unveils its festive Christmas package 2015 Details Category: 2015 Christmas Venues & Packages near you!   15:45 London Marriott Hotel Grosvenor Square invites companies to come and be merry this Christmas party season with the hotel’s Christmas Package 2015. With the aid of the hotel’s Meeting Imagined concept, customers can create a memorable celebration. \nThe Christmas Package 2015 includes pre-dinner drinks, a three-course meal of festive favourites including smoked ham hock tart, roasted breast of Norfolk turkey with all the trimmings, pan fried sea bass, as well as amaretto and cherry Christmas pudding. Diners will also be gifted a half bottle of wine per person and a dancefloor with staging area will be available for colleagues to ‘make merry’. Boasting the largest pillar-free ballroom in London, the hotel can host dazzling intimate and gala events up to 500 guests. With a dedicated events manager on hand to ensure a seamless occasion, London Marriott Hotel Grosvenor Square will create a magical event for everyone with the Christmas Package 2015 priced at £100 per person. Following a highly successful trial period, Meetings Imagined was launched in April 2015 at Marriott’s flagship conference and events hotel, London Marriott Hotel Grosvenor Square. It is an innovative online conference, events and meeting tool designed to help meeting organisers’ visualise, plan and implement their event. Originally a stately townhouse, the hotel is home to 217 rooms and 20 suites in addition to its events space. Based in Grosvenor Square, the hotel has an ideal central London location which allows guests to enjoy the glamorous spirit of Mayfair at Christmas, while only being a short distance away from the capital’s best transport links. Related articles", "external_links": [], "published": "2015-08-05T17:45:00.000+03:00", "crawled": "2015-08-05T21:12:22.399+03:00", "highlightTitle": ""}