{"organizations": [], "uuid": "26a0b6707960c82cc42c8cddf9f6b674bb3c59a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/bangkok-airways-and-emirates-announce-codeshare-agreement/", "country": "US", "title": "Bangkok Airways and Emirates Announce Codeshare Agreement", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Bangkok Airways and Emirates Announce Codeshare Agreement | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "26a0b6707960c82cc42c8cddf9f6b674bb3c59a1"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/bangkok-airways-and-emirates-announce-codeshare-agreement/", "ord_in_thread": 0, "title": "Bangkok Airways and Emirates Announce Codeshare Agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bangkok Airways and Emirates Announce Codeshare Agreement\nBangkok Airways (PG) and Emirates (EK) recently announced the commencement of their codeshare agreement on Bangkok Airways’ selected flights in Thailand and the region.\nThe new partnership will enable passengers of Emirates a smooth transit in Bangkok to connect with all Bangkok Airways’ Thailand network and the neighbouring countries including Cambodia and Myanmar.\nFrom today onwards, Emirates customers are able to book these codeshare services with Emirates.\nThis partnership will offer a unique advantage for Emirates’ passengers with Bangkok Airways’ unparalleled services including check-through service, lounge access, in-flight meal.\n“The codeshare agreement provides passengers more choices, flexibility and convenience when travelling between major cities. We expect the codeshare agreement will offer a boost to tourism in Thailand, as well as in the region. This new codeshare agreement with Emirates will also strengthen Bangkok Airways’ extensive codeshare scheme of 18 codeshare partners including Emirates.” said Mr. Peter Wiesner, Bangkok Airways Senior Vice President – Network Management.\nThierry Antinori, Emirates’ Executive Vice President and Chief Commercial Officer, said:\n“Our new codeshare agreement with Bangkok Airways will provide our passengers with increased choice, flexibility and ease of connection to different cities across Southeast Asia to and from Dubai, ultimately offering a smoother, more convenient travel experience.”\n“Emirates already offers six daily services to Bangkok, and from December, four of these services will be operated by our flagship A380 aircraft. This provides many options to connect to the region as part of our new codeshare. Together with Bangkok Airways, we are taking more people to more places and opening up new South East Asian destinations to people around the world. The region has some of the most stunning tourist and World Heritage sites including Schwedagon Pagoda and Angkor Wat, and these sites will now be more accessible to Emirates travellers. It’s an important partnership as we continue to expand the destinations available to Emirates’ passengers.”\nSource:- Bangkok Airways", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T10:14:07.931+03:00", "highlightTitle": ""}