{"organizations": ["The Society of Interventional Radiology", "Society of Interventional Radiology The Society of Interventional Radiology", "Interventional Radiology"], "uuid": "d7e7a886f70cf90e8eb2c8f190f0b046f3efc7e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_2_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13262041/1/image-guided-therapies-share-your-discovery-with-the-world.html?cm_ven=RSSFeed", "country": "US", "title": "Image-guided Therapies: Share Your Discovery With The World", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Image-guided Therapies: Share Your Discovery With The World", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T18:06:00.000+03:00", "replies_count": 0, "uuid": "d7e7a886f70cf90e8eb2c8f190f0b046f3efc7e5"}, "author": "", "url": "http://www.thestreet.com/story/13262041/1/image-guided-therapies-share-your-discovery-with-the-world.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Image-guided Therapies: Share Your Discovery With The World", "locations": ["North America", "Canada", "Va.", "Vancouver", "British Columbia", "FAIRFAX"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint FAIRFAX, Va. , Aug. 20, 2015 /PRNewswire-USNewswire/ -- The Society of Interventional Radiology is accepting scientific abstracts covering all areas of vascular and nonvascular interventional radiology for its 41st Annual Scientific Meeting , which will be held April 2-7, 2016, in Vancouver, British Columbia , Canada. Practicing experts, early career professionals, research scientists, clinical associates, trainees and medical students are invited to submit scientific abstracts for oral or poster presentation by Oct. 6 . Researchers will have the opportunity to advance the field of image-guided interventions by sharing their basic science results, device and procedure innovations and clinical outcomes research at SIR 2016—the world's most comprehensive interventional radiology meeting, which attracts more than 5,000 attendees from around the globe. Interventional radiology addresses many of today's medical problems, including cancer, cardiovascular and venous disease and stroke. All selected scientific abstracts will be published in SIR's flagship publication, the Journal of Vascular and Interventional Radiology , and on its website. Selected abstracts may be designated as Distinguished, Featured or Abstract of the Year. Additionally, national and international consumer and trade media reports on SIR medical news. Research awards to support travel are available through SIR Foundation for medical students, residents and fellows whose abstracts are accepted for oral presentation at SIR 2016. SIR's International Scholarship program enables physicians (who are within 10 years of completion of training and who are practicing outside North America ) an opportunity to train and learn at the meeting. SIR also offers two SIR 2016 scholarships for IRs-in-training: the SIR Medical Student Scholarship and SIR Resident-in-Training Scholarship . For more information, please visit www.SIRmeeting.org . About the Society of Interventional Radiology The Society of Interventional Radiology is a nonprofit, professional medical society representing more than 5,600 practicing interventional radiology physicians, scientists and clinical associates, dedicated to improving patient care through the limitless potential of image-guided therapies. SIR's members work in a variety of settings and at different professional levels—from medical students and residents to university faculty and private practice physicians. Visit sirweb.org . SIR is holding its Annual Scientific Meeting April 2-7 at the Vancouver Convention Centre in British Columbia, Canada . Logo - http://photos.prnewswire.com/prnh/20100127/SIRLOGO", "external_links": [], "published": "2015-08-20T18:06:00.000+03:00", "crawled": "2015-08-20T18:46:16.806+03:00", "highlightTitle": ""}