{"organizations": [], "uuid": "130a4f5d5a0707e4f2db748b487234d59dcd3916", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lakenewsonline.com", "main_image": "http://www.lakenewsonline.com/storyimage/MO/20150730/NEWS/150739860/AR/0/AR-150739860.jpg", "site_section": "http://www.lakenewsonline.com/lifestyle/travel?template=rss&mime=xml", "section_title": "Travel - The Lake News Online", "url": "http://www.lakenewsonline.com/article/20150730/NEWS/150739860/2010/LIFESTYLE?rssfeed=true", "country": "US", "title": "Day Trippin': See the Lake area from the back of an American mustang", "performance_score": 0, "site": "lakenewsonline.com", "participants_count": 1, "title_full": "Day Trippin': See the Lake area from the back of an American mustang", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T20:00:00.000+03:00", "replies_count": 0, "uuid": "130a4f5d5a0707e4f2db748b487234d59dcd3916"}, "author": "LAKE SUN newsroom@lakesunonline.com", "url": "http://www.lakenewsonline.com/article/20150730/NEWS/150739860/2010/LIFESTYLE?rssfeed=true", "ord_in_thread": 0, "title": "Day Trippin': See the Lake area from the back of an American mustang", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Jul. 31, 2015 at 12:00 PM By LAKE SUN Posted Jul. 31, 2015 at 12:00 PM Macks Creek A 120-acre farm near Macks Creek may not be where you would expect to find a herd of the iconic American mustang, but spend a few minutes visiting with Chris Jamison or her husband Phil, and you will quickly learn how the beautiful wild horses have found a home at the Old Family Farm. Their goal is to provide the mustangs with a home and a job providing trail rides. The trail rides are to offset the cost of their care, as well as provide a trail riding experience for those that come to visit or live in the Lake of the Ozarks area. Chris Jamison's love of the breed of horse began when she was a young girl and her mother decided to adopt a wild mustang through the U.S. Bureau of Land Management. The Jamisons now have a herd of 19 horses; most of them adopted mustangs. They refer to the herd as \"the boys.\" \"These are beautiful horses, gentle and quiet and not easily spooked,\" Chris said. \"My husband and a cousin inherited this farm, it has been in their family for 120 years.\" At the time, the Jamisons lived near Sedalia. Chris said it took them a while to get moved down here with the horses. Once here, they decided the farm with its rocky trails and heavily wooded areas was well-suited for recreational rides. The trails consist of sloping hills, a small spring-fed meandering creek, and is almost completely in the shade of the woods. Last summer, the Jamisons stuck a sign on the highway to advertise. They spent months working with the horses and felt they were ready to see how the trail ride business would do in that location. They took what they learned last summer and tweaked it over the winter. By this spring they felt they had a good plan in place and, with the help of Ethan Martin who works alongside Chris running the trail rides, they opened fulltime. \"We have had a good summer\" Chris said. Although the rain caused a few delays, she said business has been steady and they are finding many riders are returning for a second visit. The farm has turned out to be the perfect setting for the rides, offering a quiet and scenic place to ride and relax, and spend some time with family and friends. The pony rides are a favorite among the younger riders, and Chris said they will work with visitors to do birthday parties and group events. By LAKE SUN", "external_links": [], "published": "2015-07-31T20:00:00.000+03:00", "crawled": "2015-08-01T05:56:29.349+03:00", "highlightTitle": ""}