{"organizations": [], "uuid": "959f4670cdc07dc464e3034910d1bb10d183d327", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62292/power-bad-hotel-review", "country": "US", "title": "The power of a bad hotel review", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "The power of a bad hotel review", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T06:20:00.000+03:00", "replies_count": 0, "uuid": "959f4670cdc07dc464e3034910d1bb10d183d327"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/62292/power-bad-hotel-review", "ord_in_thread": 0, "title": "The power of a bad hotel review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The power of a bad hotel review Adv: \nBy Hon. Thomas A. Dickerson | Aug 06, 2015 Hon. Thomas A. Dickerson Adv: \nJust how powerful are negative travel reviews? It is clear that Trip Advisor and Yelp and similar consumer review websites have revolutionized, inter alia, the travel industry by providing consumers with information (positive and negative) about travel services provided by suppliers and tour operators. This development has allowed consumers to rely less on hyperbolic and often misleading travel industry advertising in making decisions about which travel service to purchase. This development is so important that we have on three previous occasions written articles about the potential liability arising from rendering an unfavorable travel review [see Liability for Unfavorable Travel Reviews, eturbonews.com (1/31/2014), Unfavorable Travel Reviews: if you write a bad review, can you be sued?, eturbonews.com (11/6/2014) and Online reviews: Fakes, linguistic analysis & protecting children, eturbonews.com (2/11/2015)]. This week we discuss a recent case in which the court upheld the decision of a hotel franchiser to terminate a franchise agreement “based largely upon the results of guest satisfaction surveys” [see Podesta, Bad Reviews Could Shut Down Your Hotel Franchise, law360.com (6/29/2015)]. \nTravel Law Update \nAirline Price Gouging \nIn Transportation Chief: 5 Airlines Probed for Price-Gouging (AP), nytimes.com (7/24/2015) it was noted that “the government has opened a price-gouging investigation involving five airlines that allegedly raised airfares in the Northeast after a deadly Amtrak crash in Philadelphia in May disrupted rail service...The investigation was prompted in part by a May 19 letter from Sen. Christopher Murphy, D-Conn., who complained to the Obama administration that some airlines had increased fares to as high as $2,300 following the train crash. However, he also noted that some airlines ‘self-corrected after I initially expressed concern’”. \nProtecting Online Commenters \nIn Weiss, Federal bill backed by Yelp would increase protections for online commenters, Internet Law (Posted 7/21/2015) (“A federal bill that is backed by Yelp is designed to protect online commenters and others who speak out about matters of public concern when they face meritless defamation suit. The Speak Free Act would require a plaintiff filing a suit against commenters or speakers in such cases to demonstrate at the outset that the suit is likely to succeed...Twenty-eight states and the District of Columbia already have so-called SLAPP laws intended to discourage lawsuits against those who speak out on matters of public concern”. Stay tuned. \nDrones Stay Away, Please \nIn FAA: Wildfires and drones don’t mix, eturbonews.com (7/29/2015) it was noted that “Responding to recent incidents in which unmanned aircraft systems (UAS), also known as ‘drones’ interfered with manned aircraft involved in wildland firefighting operations, the (FAA) is supporting the US Department of the Interior and US Forest Service in their simple message to drone operators: If you fly, we can’t...’The FAA’s top priority is safety. If you endanger manner aircraft or people on the ground with an unmanned aircraft, you could be liable for a fine ranging from $1,000 to a maximum of $25,000\". See also our article Travel by Drone: New FAA proposed rules, eturbonews.com (4/2/2015). \nCarnival Cruise Line And The Disabled \nIn Justice Department Reaches Agreement with Carnival Corp, Over ADA Violations by Carnival Cruise Line, Holland America Line and Princess Cruise, justice.com (7/23/2015) it was noted that “The settlement agreement is the result of an investigation of complaints (including) allegations that the company failed to: properly provide and reserve accessible cabins for individuals with mobility disabilities; reasonably modify policies, practices and procedures to accommodate individuals with disabilities; afford individuals with disabilities the same opportunities to participate in programs and services, including embarkation and disembarkation; and provide effective communication during muster and emergency drills...Today’s settlement represents the first time the Department of Justice has required a cruise company to provide a minimum number of accessible cabins, to conduct a survey of its ships and to develop a rededication plan to comply with the ADA”. \nUber Drivers In Miami \nIn Hanks, For Uber, loyal drivers and a new fight for benefits, miamigerald.com (5/21/2015) it was noted that “As Uber wages its battle to change Miami-Dade’s taxi laws and operate legally, it also has recruited a growing fleet of drivers happy for the quick cash that the car service brings. Now it’s facing a new skirmish: whether an ex-driver can collect unemployment insurance. This week, Florida notified Cutler Bay’s Darrin McGillis that he was in fact an employee of Uber while driving for the company earlier this year...The state decision on McGillis’s employment status can be appealed, and Uber is fighting similar designations on multiple fronts across the country”. \nUkraine Shootdown \nIn Pounian & Green, Legal Challenges Faced by Victims of Plane Shootdown Over Ukraine, newyorklawjournal.com (6/26/2015)it was noted that “This coming July 17 will mark the first anniversary of the shootdown of Malaysia Airlines Flight 17 over eastern Ukraine...But was the airline negligent for operating its aircraft over the eastern Ukraine during a time of known hostilities? Three days before the flight 17 disaster, a Ukrainian military transport at 21,000 feet was shot down by a surface-to-air missile over eastern Ukraine and there had been similar attacks on other Ukrainian government aircraft. Indeed, during the several weeks prior to the disaster, other airlines-including Asiana, China Airlines & Quantas-decided to change their flight routes to avoid overflying eastern Ukraine”. The airspace over eastern Ukraine, however, was officially closed only up to 32,000 feet and remained legally open to commercial jets like Flight 17 that were operating above that altitude...The question is therefore raised: If airspace remains open for flight according to the responsible government authorities, to what extent must airlines question that decision and take it upon themselves to assess the risk of possible military or terrorist activity?” \nAirline Ancillary Revenue Up \nIn Airline ancillary revenue raking in the big bucks, eturbonews.com (7/13/2015) it was noted that “Airline ancillary revenue has continued to grow for the eighth consecutive year...Airlines tracked...reported substantial increases in revenue gained from retail activities and the sale of a la carte services and frequent flier miles. Ancillary revenue per passenger among the 63 airlines (surveyed) is $17.49, which is 8.5 percent more than the 2013 result...The top ten carriers achieved an increase of nearly $4.6 billion in a single year, which represents revenue growth in excess of 22.5 percent”. \nTravel Law Article: Hampton Inn Termination \nIn HLT Existing Franchise Holding LLC (HLT) v. Worcester Hospitality Group, LLC, (WHG) No. 14-593-cv (2d Cir. April 9, 2015), affirming 994 F. Supp. 2d 520 (S.D.N.Y. 2014), a Hampton Inn franchisee (WHG) sued its franchiser (HLT) for damages arising from HLT’s termination of a franchising agreement. On appeal of the District Court’s decision granting summary judgment to HLT, WHG argued that the “district court erred in (1) considering results from guest-satisfaction surveys when deciding whether HLT properly terminated the franchising agreement; (2) finding that HLT acted properly in terminating the franchising agreement because it did not arbitrarily, irrationally, or in violation of its duties of good faith and fair dealing; and (3) permitting HLT to recover liquidated damages under the agreement”. \nGuest Satisfaction Surveys \n“First, WHG argues that...these survey results were improperly considered on HLT’s motion for summary judgment because they were inadmissible hearsay statements and were not properly authenticated...In this case the district court concluded that the guests’ survey responses were not hearsay statements, finding that the survey data were admitted not ‘to prove the truth of the matter in the statement’...but rather ‘solely for the purpose of determining what guests reported they thought about the hotel’. We agree with the district court that the survey responses were not hearsay, but reach that conclusion for slightly different reasons. We hold that the guests’ survey responses were admissible because those responses were admitted solely for the purpose of showing their effect on HLT’s decision to terminate the franchising agreement”. \nReasonable Reliance Upon Guest Survey \n“In determining whether HLT acted arbitrarily, irrationally, or in violation of the implied covenant of good faith and fair dealing, the existence of the guest survey reports that appear to reflect customer dissatisfaction is relevant because it supports HLT’s contention that it acted on what it reasonably understood to be evidence of such dissatisfaction. The surveys were thus not admitted for the truth of what the customers actually thought, still less for the accuracy of their purported reactions; what matters is that the data existed and that HLT did not act in bad faith or irrationally in relying on it”. \nThird Party Survey \n“Our analysis on the admissibility of the survey data does not end there, however. The survey data were transmitted to HLT via a third party survey administrator, Medallia, Inc....we conclude that the survey data was properly admitted. First, assuming arguendo that Medallia’s reports to HLT contained assertions, we find that those reports were properly considered as records of a regularly conducted activity...HLT established that Medallia regularly compiled guest survey scores at the time guests submitted those responses to the surveys. Because Medallia’s reports recorded guest impressions in the course of regularly conducted activity and neither party disputes the trustworthiness of Medallia’s records, it is immaterial that Medallia, and not HLT, compiled those records...HLT has offered evidence to establish the authenticity of the survey data, but WHG has not produced any contradictory evidence”. \nIndependent Basis For Termination \n“We need not determine whether the district court erred in concluding that there was no genuine factual dispute about the arbitrariness or irrationality of the evaluations. This is because any dispute as to the arbitrariness or irrationality of the on-site inspections was rendered irrelevant because of HLT’s independent basis for terminating the franchising agreement. Specifically, WHG failed the two evaluations that prompted HLT’s termination because of failing scores on the guest surveys, and not because of failing scores on the on-site inspection. As such, even if HLT conducted portions of its on-site evaluations in an arbitrary or irrational manner, those arbitrary or irrational actions did not cause the termination of the franchising agreement. Because HLT terminated the franchising agreement based on a contractually permitted, rational and non-arbitrary factor-the poor guest survey scores-it did not breach the implied covenant of good faith and fair dealing or act arbitrarily or irrationally”. \nRecovery Of Liquidated Damages \n“WHG argues that the district court erred in permitted HLT to recover liquidated damages under the agreement. The agreement permitted HLT to recover three years’ worth of estimated future royalties if HLT terminated the agreement due to WHG’s breach. Under New York law, ‘[a] contractual provision fixing damages in the event of breach will be sustained if the amount liquidated bears a reasonable proportion to the probable loss and the amount of actual loss is incapable or difficult or precise estimation’...WHG contends that the district court overlooked a declaration provided by Sunil Nayak, who claims, based on over twenty years of experience in the hotel industry, that a prototype Hampton Inn hotel can be constructed in less than a year...the district court did not err in disregarding this declaration because the declaration does not address the question central to the liquidated damages inquiry in this case-that is, at the time of contract formation, how long did the parties reasonably anticipate that HLT would need to replace WHG as franchisee and to reopen a Hampton Inn hotel in the event that HLT terminated the contract”. \nConclusion \nConsumer travel reviews have become a very powerful instrument in encouraging travel service suppliers to deliver on their promises and immediately correct any identified operational problems. \nThe author, Justice Dickerson, has been writing about Travel Law for 39 years including his annually updated law books, Travel Law, Law Journal Press (2015) and Litigating International Torts in U.S. Courts, Thomson Reuters WestLaw (2015), and over 350 legal articles. For additional travel law news and developments, especially in the member states of the EU, see IFTTA.org. \nThis article may not be reproduced without the permission of Thomas A. Dickerson.", "external_links": [], "published": "2015-08-06T06:20:00.000+03:00", "crawled": "2015-08-06T12:10:29.035+03:00", "highlightTitle": ""}