{"organizations": [], "uuid": "b2a3b7484b530148104011b60c1cba2548f4a0ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63090/us-airline-coalition-gulf-carriers-admit-massive-subsidies", "country": "US", "title": "US airline coalition: Gulf carriers admit to massive subsidies", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "US airline coalition: Gulf carriers admit to massive subsidies", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T02:46:00.000+03:00", "replies_count": 0, "uuid": "b2a3b7484b530148104011b60c1cba2548f4a0ab"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63090/us-airline-coalition-gulf-carriers-admit-massive-subsidies", "ord_in_thread": 0, "title": "US airline coalition: Gulf carriers admit to massive subsidies", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US airline coalition: Gulf carriers admit to massive subsidies   \nAug 27, 2015 eTN   \nWASHINGTON, DC - The United Arab Emirates spent a staggering $7.8 billion to build an opulent, 11-story air terminal at Dubai International Airport for the sole benefit of its airline, Emirates, according to documents the airline filed with the US government that confirmed one of the most excessive and unapologetic violations of Open Skies policy to date. \nIn papers recently submitted to the Obama administration, Qatar Airways, Etihad Airways and Emirates acknowledged dozens of instances where they received subsidies from the treasuries of the UAE and Qatar, as well as actions they took to shield their finances from scrutiny. The Partnership for Open and Fair Skies, which represents the U.S. carriers and several airline employee unions, highlighted the subsidies and their harm to American workers in a major legal filing this week with the U.S. government. \nSome of the subsidies acknowledged by the Gulf carriers include: \n• Qatar Airways confirmed it received free land worth $452 million from the government of Qatar. Its submission to the U.S. government clearly states that \"the State provided Qatar Airways with parcels of land to ensure that the carrier had enough real estate for office and residential space,\" and \"in 2013, appropriated the land for the public interest at its then market value.\" \n• Emirates confirmed that it allowed its parent company, the Investment Corporation of Dubai (ICD) to assume its fuel hedging contracts, explaining that it \"had the option to pursue a different approach,\" one that made it unnecessary to report its hedging losses. The result is that Emirates shifted costs off its books and artificially increased its profits – all without the typical risk a commercial enterprise would encounter in the marketplace. \n• Etihad admitted that it sold its frequent flyer program to itself in 2013 in order to show a profit. According to its own 2014 financials recently uncovered in Hong Kong, Etihad sold its own cargo company to itself the following year to similarly show a profit – actions that a typical commercial enterprise would be unable to take. \n\"These endless cash infusions from foreign government treasuries have allowed the Gulf carriers to expand far beyond what market forces could ever support, fundamentally distorting the marketplace and harming U.S. carriers and American jobs,\" said Jill Zuckman, chief spokesperson for the Partnership for Open & Fair Skies. \"It's urgent that the Obama administration take swift action and request consultations to end these trade violations before the Gulf carriers damage the U.S. aviation industry the same way they have devastated Europe's.\" \nOne of the most striking admissions comes from Emirates, which told U.S. regulators that the government directly subsidizes the cost of the airport terminals that it builds for Emirates' exclusive use. The government spent $7.8 billion to construct the Emirates terminal at the Dubai International Airport, which is the first facility of its kind: 11 floors designed for the largest fleet of A380s, with fine dining, a full service spa and other amenities all intended to give Emirates a competitive advantage over the U.S. and other international carriers in attracting passengers connecting around the world. \nIn its legal filing, the Partnership noted that unlike the subsidized expansion of the Emirates terminal, U.S. airports are required to be \"self-financing,\" using revenue generated from landing fees, passenger fees, facilities rentals and other charges to fund the respective airport's operating and capital costs. Furthermore, the filing notes that Emirates' \"success would suffer if they were required to cover the costs through charges and fees, which would be prohibitive.\" \nU.S. airport executives and mayors from across the country said the brazen subsidization scheme by the UAE and Qatar is undermining their airports and air service to small and mid-sized communities across the nation. \n\"The Emirates terminal at the Dubai airport is an ostentatious display of the power of unlimited cash from a government treasury, and shows just what we're up against,\" said Dan Mann, Executive Director of Columbia Metropolitan Airport (SC). \"If Emirates and the other Gulf carriers continue this subsidized growth in the U.S., it will lead to service cuts at both regional and international airports in the United States.\" \n\"As the Gulf carriers continue to rapidly descend into U.S. cities, hundreds of thousands of American aviation jobs are on the chopping block. The Gulf carriers can support lavish services and tax-free infrastructure because they receive unrestricted financial backing from their government owners, the scale of which is unmatched by any airline or airport in the world,\" said Mayor Beth Van Duyne of Irving (TX). \n\"It's well past time for the Obama administration to take action on behalf of the U.S. aviation industry,\" said Ron Phillips, Airport Director at Monroe Regional Airport (LA). \"We're happy to compete with anyone, but not when they break their agreements with our country.\" \nOn Monday, the Partnership supplied the U.S. government with never-before-seen financial statements from Etihad Airways. The statements included damning new evidence of massive subsidies in violation of Open Skies. The Partnership also provided the government with new data showing that the Gulf carriers are not creating new demand when they enter U.S. markets, and instead are causing significant harm to the U.S. aviation industry.", "external_links": [], "published": "2015-08-28T02:46:00.000+03:00", "crawled": "2015-08-28T03:18:01.970+03:00", "highlightTitle": ""}