{"organizations": [], "uuid": "e3c3785f3f3021d05d6cec384c73fa57af2e4899", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/08/16/travel/16BITES-SUB/16BITES-SUB-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT &gt; Travel", "url": "http://www.nytimes.com/2015/08/23/travel/chile-las-cabras-restaurant-review.html", "country": "US", "title": "At Las Cabras in Santiago, Pedigree Is All", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "At Las Cabras in Santiago, Pedigree Is All - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T15:00:00.000+03:00", "replies_count": 0, "uuid": "e3c3785f3f3021d05d6cec384c73fa57af2e4899"}, "author": "Oliver Strand", "url": "http://www.nytimes.com/2015/08/23/travel/chile-las-cabras-restaurant-review.html", "ord_in_thread": 0, "title": "At Las Cabras in Santiago, Pedigree Is All", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The fuente de soda is Chile’s particular take on the soda fountain, a culinary institution along the lines of the American diner — friendly, familiar, old-fashioned. You go to one to tuck your tie into your shirt and wolf down a churrasco completo (imagine a comically large hamburger, but made with sliced meat, mashed avocado, tomatoes and mayonnaise). Throw back a freshly made juice or a beer and you’re ready to get back to work.\nAt Las Cabras, which opened late last year on a busy side street in the Providencia district, the counter seating, bright lighting and waxy napkins recall the fuente de soda. But they also set the stage for the well-known chef Juan Pablo Mellado Arana to pose the question: What happens when you use immaculate ingredients and good technique to treat comida rápida Chilena with love and respect?\n“In Chile we have been eating this all our lives,” Mr. Mellado Arana said. “This renovated fuente de soda is simply comida rica, comfort food that lives in the public.”\nPace yourself: The portions at Las Cabras are big. Start with the palta cardenal, an avocado stuffed with shrimp salad that’s bright and flavorful and tastes like the sea. Or the apio palta, celery salad with avocado. The celery sits overnight in a lemon juice marinade that pools in the bottom of the bowl and can be finished off with a straw. You could make a meal of the crudo de filete, a kind of steak tartare brought by German immigrants in the 19th century.\nIndeed, the main courses are for sharing. The charchas de chancho — “charchas” is slang for something trashy and cheap, a stew cut — is pork cheeks braised until tender. There’s nothing on the page about where the pigs are from (Patagonia), or how their lives were lived (on a spacious farm). It doesn’t matter what you order; the pedigree will be equally impressive.\nIt’s not typical for a fuente de soda to carry craft beer, or to have a full bar. But who would object to starting off lunch with a perfectly made pisco sour? Or a churrasco made with high-quality meat that still has the greasy, salty soul of the classic version? This is what it’s like when a dive does everything right.", "external_links": [], "published": "2015-08-21T15:00:00.000+03:00", "crawled": "2015-08-21T16:05:07.722+03:00", "highlightTitle": ""}