{"organizations": [], "uuid": "fd70b4e5ac2b73e62576ef301c09b888a233acd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/cc/0a/WHIO_Facebook_Icon.png", "site_section": "http://www.whio.com/feeds/categories/travel/", "section_title": "News | Travel", "url": "http://www.whio.com/feed/travel/where-to-snorkel-in-south-florida/fCF7Cn/", "country": "US", "title": "Where to Snorkel in South Florida", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "Where to Snorkel in South Florida", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T12:49:00.000+03:00", "replies_count": 0, "uuid": "fd70b4e5ac2b73e62576ef301c09b888a233acd1"}, "author": "", "url": "http://www.whio.com/feed/travel/where-to-snorkel-in-south-florida/fCF7Cn/", "ord_in_thread": 0, "title": "Where to Snorkel in South Florida", "locations": ["South Florida"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated: 2:35 p.m. Monday, Aug. 17, 2015 | Posted: 5:49 a.m. Monday, Aug. 17, 2015 Where to Snorkel in South Florida In Partnership with VisitFlorida.com \nNational Geographic \nSunken shipwrecks, stingrays, statues, and a rainbowed realm of reef life await. Sites include America’s first undersea park and waters clear as crystal in the shadow of a Civil War fort where Hemingway reportedly met the Cuban captain who inspired “The Old Man and the Sea.” \nAnd you don’t need any fancy gear – a snorkel and fins will do. Many spots are located a short swim from shore and tour boats serve much of the best of the rest. \nSo, ahem, let’s dive in: \nPalm Beach County \nThe Phil Foster Park / Blue Heron Bridge area in the Intracoastal Waterway is known for brightly colored tropical fish, squid and octopus, spotted rays, urchins and starfish – and seahorses, too. They flit around the bridge pilings and, since it opened in August 2012, along the 800-foot-long Phil Foster Park Artificial Reef and Snorkel Trail , making both favorite picture spots for underwater photographers. Depths run from 4- to 18-feet. \nBreaker’s Reef , Cable Crossing and a sunken pier sit just offshore from Palm Beach’s historic Breakers Hotel in Palm Beach . Named for a large telecommunication cable running through it, Cable Crossing rests in 16- to 22-feet of water and is home to manta rays, sea turtles, nurse sharks and tropical fish. The shallowest parts of Breaker’s Reef run less than 30-feet, and are filled with angelfish, parrotfish, eels, and sea turtles. The coral crusted remains of an old pier teems with fish barely 50 yards offshore from the hotel, making for a perfect – and easy – shore dive. \nBroward County \nThe Lauderdale-by-the-Sea Snorkel Trail runs just 400 feet offshore in 12- to 15-feet of water. It includes two sets of concrete cannons, a large anchor and a ballast pile, replicating the remains of a scattered shipwreck. Underwater explorer Jean-Michele Cousteau dedicated the area in 2002; today it swarms with lobster, eels, nurse sharks, sea turtles, cuttlefish, manta and eagle rays, and more. \nJohn Cote for VISIT FLORIDA \nA real shipwreck, the SS Copenhagen , lies in just 16- to 31-feet of water three-quarters of a mile offshore from Lauderdale-by-the-Sea . A 19th-century steel-hulled steamship, it ran aground carrying coal from Philadelphia to Havana in 1900. Nowadays, the 325-foot by 47-foot ship serves as an artificial reef in an underwater preserve, as part of Florida’s “Museums in the Sea.” \nThe SS Lofthus sits a mere 175 yards from Manalapan , in just 15- to 20 feet of water. The iron-hulled sailing vessel ran aground in 1898 carrying lumber to Buenos Aires. Salvagers stripped what they could and dynamited the hull. It’s now effectively three wrecks in one, scattered over a nearly 300-foot-long stretch. \nMiami-Dade County \nBill Baggs Cape Florida State Park, Peter W. Cross for VISIT FLORIDA \nBiscayne National Park is as big as Austin, Texas, and a full 95 percent is underwater, with reefs, wrecks, seagrass meadows and marine life ranging from manatees and dolphins to loggerhead turtles and lionfish. There are fields of fan coral, brain coral, sea anemones and sponge. And they’re all in water that averages about 10 feet deep. You’ll need a boat to get to them, but at least one tour runs out of Miami Beach , and can include a visit to Boca Chita Key in the heart of the park. \nThe park contains the Maritime Heritage Trail , with six wrecks dating from the 19 th Century to 1966. The most recent bears the remains of the Windjammer schooner Mandalay , which ran aground on New Year’s Day. The 112-foot luxury cruise ship known as the “red carpet ship of the Windjammer fleet” now rests in 10 feet of water, surrounded by schools of colorful fish and coral. \nMonroe County \nJohn Pennekamp Coral Reef State Park holds the distinction of being the country’s first undersea park, and one of the best snorkeling spots in all of South Florida. It’s full of crabs, lobsters and shrimp; urchins and eels; and sea cucumbers, sand dollars and sponges – just to name a few. Its most famous feature, though, is the nine-foot bronze statue of Jesus Christ, a replica of the “Christ of the Abyss” statue in the Mediterranean Sea, standing 20 feet below the surface. The park runs tours twice a day; so do a dozen or more private operators. \nVISIT FLORIDA \nLooe Key gets its name from the HMS Looe, a British ship that supposedly ran aground there in 1744, towing a captured French ship. But that’s not why people come here. The reef is 800 yards long, 200 yards wide, and home to some 50 types of coral and more than 150 species of fish. There’s yellowtail, angelfish, parrotfish and barracuda; as well as staghorn, elkhorn, and – watch yourself around these – fire corals. Bahia Honda State Park runs twice-daily snorkel tours. \nIt’s said that Hemingway met Gregorio Fuentes when they weathered a hurricane together at Fort Jefferson, and Gregorio liked to say he was the model for Santiago in “The Old Man and the Sea.” True or not, it’s understandable why the two fishermen would have been at what is now Dry Tortugas National Park . \nVISIT FLORIDA \nThe historic Union Army prison stands like the striking stronghold of an island kingdom, surrounded by some of the most pristine water you’ll ever find. It’s nearly 70 miles west of Key West, accessible only by boat – there are regular ferry runs – or seaplane. Snorkeling spots are an easy swim from shore, about 5- to 7-feet deep, and packed with reef fish, corals and, naturally, sea turtles ( tortugas in Spanish, which is where the islands’ name comes from).", "external_links": [], "published": "2015-08-17T12:49:00.000+03:00", "crawled": "2015-08-18T02:30:23.520+03:00", "highlightTitle": ""}