{"organizations": ["Sabre Hospitality", "Interactive Media Council, Inc.", "The Carolina Inn", "Sabre Corporation", "Sabre Hospitality Solutions"], "uuid": "351bfc034405d461cb3151061b0757dad0992ca0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_9_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13262379/1/sabre-sweeps-interactive-media-awards-with-best-in-class-website-design-and-development-for-hotels.html?cm_ven=RSSFeed", "country": "US", "title": "Sabre Sweeps Interactive Media Awards With Best-in-class Website Design And Development For Hotels", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Sabre Sweeps Interactive Media Awards With Best-in-class Website Design And Development For Hotels", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T21:19:00.000+03:00", "replies_count": 0, "uuid": "351bfc034405d461cb3151061b0757dad0992ca0"}, "author": "", "url": "http://www.thestreet.com/story/13262379/1/sabre-sweeps-interactive-media-awards-with-best-in-class-website-design-and-development-for-hotels.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Sabre Sweeps Interactive Media Awards With Best-in-class Website Design And Development For Hotels", "locations": ["Texas", "SOUTHLAKE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alex Alt"], "text": "Reprint SOUTHLAKE, Texas , Aug. 20, 2015 /PRNewswire/ -- Sabre Corporation (NASDAQ: SABR), a global technology provider to the travel industry, today announced that its hospitality business has won several Best-In-Class Interactive Media Awards for excellence in website design and development. Sabre Hospitality Solutions received IMA's top honors for websites built for Sabre hotel customers including The Carolina Inn website, The Umstead hotel and spa website, Trump Hotel Collection mobile website and Palmetto Dunes website. The Best-In-Class award is the highest honor bestowed by the Interactive Media Awards. It represents the very best in planning, execution and overall professionalism. \"Our digital marketing group at Sabre Hospitality focuses on quality over quantity. We make it our mission to design and develop websites that meet the towering expectations of our customers but with a strong focus on UX and conversion,\" said Alex Alt , president of Sabre Hospitality Solutions. \"We want visually stunning websites that translate into bookings for our hotels and receiving the highest level of recognition in an award category like this is validation that we achieved our goals.\" The Interactive Media Awards recognize the highest standards of excellence in website design and development and honor individuals and organizations for their outstanding achievement. Entries are judged based on five criteria: Design, Content, Feature Functionality, Usability and Standards Compliance. To win an IMA, websites must excel in each criterion, rise above competitors' sites and deserve to be a top choice for their target market. Created by the Interactive Media Council, Inc. (IMC), a nonprofit organization of leading web designers, developers, programmers, advertisers and other web-related professionals, the competition is designed to elevate the standards of excellence on the Internet and offer winners a boost in marketing and exposure. IMC serves as the primary sponsor and governing body of the Interactive Media Awards™, establishes the judging system and provides the judges for the competition. 1 of 2", "external_links": [], "published": "2015-08-20T21:19:00.000+03:00", "crawled": "2015-08-20T21:32:05.360+03:00", "highlightTitle": ""}