{"organizations": [], "uuid": "c8d20e174c379744e183d272965df667353d1831", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/95040b68-f594-48c4-bd02-4500c6e01275MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Travel", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/travel/sachin-bhandary-s-story-25-trains-in-25-days-across-india/article1-1379845.aspx", "country": "US", "title": "Sachin Bhandary's story: 25 trains in 25 days across India", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Sachin Bhandary's story: 25 trains in 25 days across India", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T18:34:00.000+03:00", "replies_count": 0, "uuid": "c8d20e174c379744e183d272965df667353d1831"}, "author": "", "url": "http://www.hindustantimes.com/travel/sachin-bhandary-s-story-25-trains-in-25-days-across-india/article1-1379845.aspx", "ord_in_thread": 0, "title": "Sachin Bhandary's story: 25 trains in 25 days across India", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bhandary", "Sachin Bhandary"], "text": "Updated: Aug 13, 2015 21:19 IST PR professional-turned-traveller Sachin Bhandary. \nAir miles notwithstanding, there are few things that can match the adventure of a train journey. It was on his 32nd birthday last year that Sachin Bhandary decided to quit his job as a public relations executive to travel. \nIronically, it was a good appraisal in 2013 that turned into a moment of epiphany for him. “As a 24-year-old, I had promised myself that I would travel the world. The time had come. The calling was so strong that I realised I would regret not doing this for the rest of my life,” he says. \nHe started The Odd Traveller , a website to inspire others to travel, and embarked on what he terms ‘ The 12 Project ’. His plan is to travel over 12 months, in 12 countries, surmounting 12 different challenges. \nHis first challenge: a train journey across India, towards the farthest railway stations in all the major directions. This Sunday, he is set to share his experiences at a session titled Surviving India — Stories of 25 Days, 25 Trains, at The Hive. Incidents he will narrate include meeting a tea shop owner couple in Kochi on a mission to tour the world, being robbed in Dibrugarh, Assam and being hosted by a cop in Sopore, Jammu and Kashmir. Sopore, a town in the Baramulla district of Jammu and Kashmir \n“I experienced excruciating and enlightening moments on this journey. Also, I know a little more about India and its great colonial legacy — the railways. The most interesting part was hearing the stories of people I met along the way,” he adds. \nTo fund his travels, Bhandary took to crowdfunding, which fetched him Rs 1,20,000. For the rest of his travel-related expenses, he relies on his savings, and on the kindness of strangers. He has also partnered with the accommodation website, Airbnb. “Many people have supported me with equipment and contacts. The only reason I was comfortable with crowdfunding was because this journey goes beyond me. Eventually, the site will be an ecosystem for people to take trips into the unknown,” he shares. \nIf you have the time, and love watching landscapes and people pass by, no form of transport can beat the train, Bhandary feels. “Trains are cheap, so you can do more with your money. A second class train ticket costs less than the number of kilometres you travel,” he points out. Milk cans being carried on the Ruhelkhand Express in Aishbagh, Uttar Pradesh \nNext up, Bhandary is off to Brazil on August 24, and will travel through Chile, Peru, Colombia, Costa Rica, Mexico, Puerto Rico and the US. “I have nine challenges lined up which includes learning batucada drums from people of the Candomblé religion in Salvador, Brazil,” he says. \nListen to Sachin Bhandary speak On August 16, 5pm onwardWhere: The Hive, Chuim Village Road, Khar (W)Follow his adventures on theoddtraveller.in \nTips and tricks * Plan well, as much in advance as possible. \n* Be prepared to improvise and adapt. Don’t worry too much if things don’t work out as planned. \n* Don’t hesitate to ask for help. At the worst, people will say no. \n* Work on your communication skills (including how and whom to ask for help). \n* Only get into a situation that you think you can get out of. Don’t refuse a stranger’s offer immediately. But if you are not comfortable, make small talk with him/her and take your time. Tags", "external_links": [], "published": "2015-08-13T18:34:00.000+03:00", "crawled": "2015-08-14T09:49:05.001+03:00", "highlightTitle": ""}