{"organizations": [], "uuid": "40e18533b644daa51ca7dbebcfc16a8e1f4dfa36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02358/weather-rain_2358605k.jpg", "site_section": "http://www.telegraph.co.uk/news/weather/", "section_title": "Weather News - latest news and snow travel updates - Telegraph", "url": "http://www.telegraph.co.uk/news/weather/11766178/Will-2015-be-Britains-windiest-year-in-two-decades.html", "country": "GB", "title": "UK weather: Will 2015 be Britain’s windiest year in two decades?", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "UK weather: Will 2015 be Britain’s windiest year in two decades? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T01:40:00.000+03:00", "replies_count": 0, "uuid": "40e18533b644daa51ca7dbebcfc16a8e1f4dfa36"}, "author": "Sarah Knapton , Science Editor", "url": "http://www.telegraph.co.uk/news/weather/11766178/Will-2015-be-Britains-windiest-year-in-two-decades.html", "ord_in_thread": 0, "title": "UK weather: Will 2015 be Britain’s windiest year in two decades?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With gales battering the country it may come as no surprise to learn that 2015 is on course to be the windiest year that Britain has experienced for two decades. The Met Office said that the traditional calmer months of summer have been dominated by low pressure systems which have brought blustery conditions to most of the UK. Just eight days this year have been officially ‘calm’ which is defined when at least 20 British weather stations record maximum gusts of 11mph or less. Interactive: 2807 weather Fewer than 22 calm days over the whole year would make 2015 the windiest year since 1995. Although it is only July and there’s still another five months to pass, crucially none of these days have fallen in May, June or so far July – months that would usually notch up a few calm days. And the year is now moving towards a seaonally more windy period. “Calm days are typically associated with areas of high pressure, which normally bring dry, settled conditions during summer and cold, frosty conditions in winter – but common to both seasons often light winds,” said Mike Kendon, climate information scientist at the Met Office. “Areas of high pressure tend to block the prevailing westerly airflow across the UK. However, the variability of our climate means that some years see more days of high pressure, others see fewer such days,” he added. Sea level pressure for the six months of the year has been lower-than-normal to north of Scotland but higher-than-normal to the southwest, resulting in a westerly airflow over the UK - and that has resulted in windier weather. On Sunday the Met Office issued a weather warning for \"unseasonably strong winds\" in coastal areas that threaten to disrupt holidaymakers' outdoor activities and cause hazardous driving conditions early in the week. A woman's umbrella blows inside out amid windy weather in Swanage, Dorset Credit: REX Forecasters warned gusts might exceed 50mph along the north coasts of Cornwall, Devon and Somerset, and also Bristol Channel coasts of south Wales. It comes after wet weather swept in from the Atlantic on Sunday, bringing widespread heavy downpours and a washout end to the weekend, following a brief respite to the soggy summer on Saturday, when most of the country enjoyed dry conditions. The Met Office said “disappointing” holiday conditions “won’t feel like summer,” with below-average 14-20C highs feeling like a grim 9-16C in rain and windchill until Thursday as colder air is dragged down from Scandanavia. However despite downpours over the weekend, the Met Office said July was unlikely to see record rainfall. Dog walkers brave the wet and windy weather along Weymouth seafront Credit: REX Provisional rainfall statistics for July 2015 so far suggest that with 5 days of the month remaining much of the country has already received close to or above average rainfall for the month – but we’re some way off breaking the records for each country. The highest wind gusts ever recorded in the UK was 142mph in 1989 in Fraserburgh, Aberdeenshire. ", "external_links": [], "published": "2015-07-28T01:40:00.000+03:00", "crawled": "2015-08-08T10:13:03.000+03:00", "highlightTitle": ""}