{"organizations": [], "uuid": "c5902f641eb7d3dd746f1f4bd661ac37ae92da6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62744/cannabis-world-congress-confirms-melissa-etheridge-keynote-speak", "country": "US", "title": "Cannabis World Congress confirms Melissa Etheridge as Keynote speaker at LA marijuana expo", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Cannabis World Congress confirms Melissa Etheridge as Keynote speaker at LA marijuana expo", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T20:25:00.000+03:00", "replies_count": 0, "uuid": "c5902f641eb7d3dd746f1f4bd661ac37ae92da6a"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62744/cannabis-world-congress-confirms-melissa-etheridge-keynote-speak", "ord_in_thread": 0, "title": "Cannabis World Congress confirms Melissa Etheridge as Keynote speaker at LA marijuana expo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cannabis World Congress confirms Melissa Etheridge as Keynote speaker at LA marijuana expo   \nAug 18, 2015 eTN   \nPARAMUS, NJ - Melissa Etheridge, Grammy and Academy Award Winning singer-songwriter, will be a Keynote speaker during the Cannabis World Congress & Business Exposition (CWCBExpo), September 16-18 at the Los Angeles Convention Center in Los Angeles, CA. Her much anticipated Keynote Address will take place on Thursday, September 17th at 2pm. The CWCBExpo in LA is the leading event for the legalized and medical marijuana industries. \n\"I was extremely honored to be asked to speak at the CWCBExpo because as a Cancer survivor, who discovered the unparalleled medical benefits of cannabis during my recovery, I feel very passionate about helping to remove the negative stigma and educating people about its real medicinal value,\" said Melissa Etheridge. \n\"We are thrilled to have Melissa Etheridge Keynote at CWCBExpo in LA. Not only is she an iconic rock star, but also a very successful entrepreneur and advocate within the legalized cannabis industry. Her historic keynote will be enormously well received and very captivating,\" said Christine Ianuzzi, Managing Partner of Leading Edge Expositions, LLC, and Show Director for CWCBExpo. \nKnown for her confessional lyrics and raspy, smoky vocals, Melissa Etheridge has remained one of America's favorite female singer-songwriters for more than two decades. She began her distinguished musical career in 1988 when she stormed onto the American rock scene with the release of her critically acclaimed self-titled debut album. Her popularity continued to rise with hits such as \"Bring Me Some Water,\" \"No Souvenirs\" and \"Ain't It Heavy,\" for which she won a Grammy in 1992. Her fourth album, Yes I Am in 1993, featured the massive hits \"I'm the Only One\" and \"Come to My Window,\" that brought Etheridge her second Grammy Award for Best Female Rock Performance. \nIn 1995, Etheridge issued her highest charting album, Your Little Secret, that included hit single, \"I Want to Come Over,\" and earned her the Songwriter of the Year honor at the ASCAP Pop Awards in 1996. \nIn February 2007, Melissa Etheridge celebrated a career milestone with an Academy Award for Best Song for \"I Need to Wake Up,\" written for the Al Gore documentary on global warming, An Inconvenient Truth. Most recently, she released her most personal album to date, This Is M.E., which features singles \"Take My Number,\" \"A Little Bit of Me,\" and \"Monster.\" Among her other accolades is a star on the Hollywood Boulevard Walk of Fame. \nA cancer survivor, Etheridge has publically spoken about the medicinal value of cannabis in her recovery and is launching her own line of canna-products including a marijuana-infused wine. \n\"Melissa Etheridge is a perfect fit for CWCBExpo in LA. Her personal journey with medical marijuana and belief in the industry's impact and business potential will resonate with our attendees,\" said Dan Humiston, President of International Cannabis Association (ICA) and sponsors of CWCBExpo. \nEtheridge's keynote is part of a powerful line-up of top speakers at CWCBExpo in LA that includes successful businessman George Zimmer, Founder of Men's Wearhouse and zTailors and Ethan Nadlemannn, Founder and Executive Director of Drug Policy Alliance. \nCWCBExpo in LA also includes educational programming on September 17-18 on what is needed to succeed in this rapidly changing and growing industry including in-depth workshops on September 16th. CWCBExpo in LA features an exhibit floor (September 17-18) with suppliers in the industry showcasing cutting-edge products and services.", "external_links": [], "published": "2015-08-18T20:25:00.000+03:00", "crawled": "2015-08-18T22:59:10.067+03:00", "highlightTitle": ""}