{"organizations": [], "uuid": "5528ffc536693147451db408f23c56934246e166", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.lakenewsonline.com", "main_image": "http://www.lakenewsonline.com/storyimage/MO/20150806/NEWS/150809436/AR/0/AR-150809436.jpg", "site_section": "http://www.lakenewsonline.com/lifestyle/travel?template=rss&mime=xml", "section_title": "Travel - The Lake News Online", "url": "http://www.lakenewsonline.com/article/20150806/NEWS/150809436/2010/LIFESTYLE?rssfeed=true", "country": "US", "title": "Day Trippin': Head west to Brickley Hollow, where the bass roam free", "performance_score": 0, "site": "lakenewsonline.com", "participants_count": 1, "title_full": "Day Trippin': Head west to Brickley Hollow, where the bass roam free", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T00:00:00.000+03:00", "replies_count": 0, "uuid": "5528ffc536693147451db408f23c56934246e166"}, "author": "LAKE SUN newsroom@lakesunonline.com", "url": "http://www.lakenewsonline.com/article/20150806/NEWS/150809436/2010/LIFESTYLE?rssfeed=true", "ord_in_thread": 0, "title": "Day Trippin': Head west to Brickley Hollow, where the bass roam free", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Aug. 7, 2015 at 4:00 PM By LAKE SUN Posted Aug. 7, 2015 at 4:00 PM Lake Area It’s the American tradition to head west for adventure, and that holds true at the Lake of the Ozarks as well. Head to Brickley Hollow Conservation Area on the west end of the lake to see a different aspect of the lake region. This 186-acre natural area has lake access via the lesser-known Cole Camp Creek Arm. Be sure to wear your hiking shoes though. The walk-in access to the water is a one-mile trail from the road. Located in Benton County, Cole Camp Creek feeds into the Osage Arm of the Lake of the Ozarks near the 80 mile marker. At 2 miles long, this “arm” of the lake is much smaller than the well known Gravois, Glaize, and Niangua sections. From the conservation land, head north on the Cole Creek Arm for views of Leeder Bluff, or go south toward Gross Point, a cape between Brickley and Hay hollows that leads into the Osage channel of the lake. So many miles from Bagnell Dam, the upper reaches of the lake narrows to a river feel. Past the 50 mile marker, the lake begins to feature more mud flats and submerged logs and brush, and on the banks, less and less in the way of development. This is a great place to get away from the crowds for a little fishing with good populations of bass, crappie and sunfish as well as a fair amount of catfish. According to Bass Fishing Midwest, some of the best bass fishing at the Lake of the Ozarks in the summertime is in the upper Osage. With siltation in and near many of the tributaries in this area though, boaters should be careful. Fishing or not, a kayak or canoe may be a better vessel for getting around. On land in the conservation area, glade restoration is under way. There are small expanses of woodland, savanna, native grassland and a dolomite glade to explore. In late spring and summer, you’ll find showy summer wildflowers, such as rose gentian, blazing stars and prairie dock. Getting there About one mile south of Lincoln on Highway 65, take Highway H east nearly 11 miles to Heits Point Ave., formerly Lake Road H-25, and go south about 0.3 mile to reach Brickley Hollow Conservation Area. More to see Just the trip to get Brickley Hollow Conservation Area can be quite a journey. Make the most of it with some sightseeing from your vehicle on the way there. Lincoln has a large antique mall on the south side of town, and on Highway H, you’ll see the Lincoln Lookout Tower and Edmonson Church. By LAKE SUN", "external_links": [], "published": "2015-08-08T00:00:00.000+03:00", "crawled": "2015-08-08T00:32:46.411+03:00", "highlightTitle": ""}