{"organizations": [], "uuid": "0e4616e9e951c25eb78b66622a126617b022b11a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arabianbusiness.com", "main_image": "http://www.arabianbusiness.com/incoming/article360442.ece/BINARY/Visa+cards+2.jpg", "site_section": "http://www.arabianbusiness.com//industries/travel-hospitality/?service=rss", "section_title": "Arabian Business - Travel & Hospitality", "url": "http://www.arabianbusiness.com/uae-s-ramadan-spending-rises-14-despite-russian-chinese-slump-602526.html", "country": "US", "title": "UAE's Ramadan spending rises 14% despite Russian, Chinese slump", "performance_score": 0, "site": "arabianbusiness.com", "participants_count": 0, "title_full": "UAE's Ramadan spending rises 14% despite Russian, Chinese slump", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T00:07:00.000+03:00", "replies_count": 0, "uuid": "0e4616e9e951c25eb78b66622a126617b022b11a"}, "author": "", "url": "http://www.arabianbusiness.com/uae-s-ramadan-spending-rises-14-despite-russian-chinese-slump-602526.html", "ord_in_thread": 0, "title": "UAE's Ramadan spending rises 14% despite Russian, Chinese slump", "locations": ["UAE"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UAE's Ramadan spending rises 14% despite Russian, Chinese slump Article By Staff writer Saturday, 15 August 2015 1:07 AM \nOverall spending in the UAE during Ramadan has increased by 14 percent compared to the holy month last year, according to a new report by payments firm Network International. \nThe report, based on credit or debit card transactions by country during Ramadan 2015, found that the major surge came from stronger domestic market spends with a 17 percent growth in spending. \nInternational spending also witnessed overall growth of seven percent, the report said, adding that the domestic market made up 75 percent of the total spending. \nDavid Mountain, chief commercial officer, Network International, said: \"The coinciding of the Islamic calendar with the traditionally quieter summer months in the UAE has given rise to interesting variations in spends, with the market still registering a strong overall increase. \n\"Domestic spend of locals and expatriates based in the UAE becomes particularly important during these months.\" \nNorth Americans were the largest international spenders with 7 percent of the total spend and GCC nationals made up 3 percent. \nThe rest of world spend, which made up 15 percent of the total, was flat, driven by significant declines from Russians (down 30 percent), the Chinese (down 22 percent) and the Germans (down 8 percent). \n\"This seems to reflect recent economic turmoil in all three countries,\" Mountain said, adding that Brits and Saudis had the largest growth among the foreign spend. \nThe report said the growth in spending on the hotel sector was a modest 5 percent, with almost half of this spend coming from UAE residents taking advantage of Ramadan packages for domestic travel. \nThis domestic trend was even more pronounced in restaurants, which saw domestic spend accounting for 83 percent of the total spend. Driven by this spend, restaurants enjoyed an increase of 27 percent spending as compared to last year. \nThe report said retail spending was flat for jewellery and luxury watches, but fashion witnessed a growth of 12 per cent in terms of absolute spend, driven in part by a surge in Nigerian spending. \nSupermarkets saw an increase of 12 percent indicating an increase in household consumption during Ramadan. \nServices generally performed well versus 2014, with professional services and government services up by well over 25 percent versus last year.", "external_links": [], "published": "2015-08-15T00:07:00.000+03:00", "crawled": "2015-08-15T04:04:37.826+03:00", "highlightTitle": ""}