{"organizations": [], "uuid": "a63d53955f5b4ce4416c3d79b4486aef60d882da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/travel/", "section_title": "Forbes - Travel Information and Travel News - Forbes.com", "url": "http://www.forbes.com/sites/kenrapoza/2015/08/30/inside-a-real-brazilian-ghost-town/", "country": "US", "title": "Inside a Real Brazilian Ghost Town", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "Inside a Real Brazilian Ghost Town", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T20:20:00.000+03:00", "replies_count": 0, "uuid": "a63d53955f5b4ce4416c3d79b4486aef60d882da"}, "author": "Kenneth Rapoza", "url": "http://www.forbes.com/sites/kenrapoza/2015/08/30/inside-a-real-brazilian-ghost-town/", "ord_in_thread": 0, "title": "Inside a Real Brazilian Ghost Town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It’s best to stomp your feet when walking in the taller grass, we are warned. There are yellow anacondas here. Vagno Pereira Pires, the captain of the boat that brought us to Vila dos Descalvados, looks around like he’s been struck by a bad memory. He points to a low lying electric fence, steps over it, and says to me in Portuguese, “I hate this place. This place is nothing but bad news.”[caption id=\"attachment_44785\" align=\"\" width=\"1037\"] Descalvados...a haven for Brazilian hauntings in the Pantanal. So say the locals who have spent time there. (Photo by Jackie O. Cruz/FORBES)[/caption]Vila dos Descalvados is a ghost town in every imaginable way. On any given day, the population is around five. It’s located on the edge of the Paraguay River, deep in the heart of the Brazilian Pantanal, a mega wet land that makes the Florida Everglades look small.Descalvados’ history dates back to the 1860s, used for farming, contraband, and as prison barracks. Teddy Roosevelt famously made his four-month scientific expedition through the Amazon over 100 years ago and camped out here. At the turn of the century, it belonged to a Belgian firm that did everything from making beef jerky to selling illegal rubber tapped from Brazilian forests and making off that it was Bolivian in order to avoid taxes. An American Wild West investor named Percival Farquhar bought the property in 1912 and went bankrupt five years later. Brazil’s government took it over and it was divided up and sold to a well-known political family in the state of Mato Grosso, where Descalvados sits not far from the Bolivian border and just south of the Amazon rainforest.The Lacerda family lived there until the 1980s before abandoning it and leaving it to the care of a trusted farm hand. They all lived on a land steeped in the sad history of African slaves, Indian burials, and – as many people say – a ten year old ghost who asks guests if they want to play with her.Soely Figueiredo is the 42 year old owner of a travel agency named Estação Paraiso Viagens e Turismo in the tiny riverside city of Caceres, about a two hour go-fast boat trip from Descalvados.She stayed there last on Nov. 2, 2009 and this is what she claims happened.“I was taking pictures of the river at 10 in the morning when I heard the voice of a young girl calling to me,” she says in a phone interview. “I thought it was strange because there were no children at the inn at the time. I turned to where the voice was coming from and there was this little girl with pigtails and ribbons in her hair. She didn’t look real. I felt terrified. I ran down the stairs and when I looked back she was nowhere to be seen. I asked people if there was a little girl staying at the inn and everyone there said no. This is a very small inn. People would know. The management would know. But nobody saw her. It’s a very strange place.”[caption id=\"attachment_44786\" align=\"\" width=\"1037\"] A church built the Belgian owners at the turn of the 20th Century on the site of Descalvados village. Inside, the patron saints of gold miners. Much of the gold here was stolen and shipped to Europe. (Photo by Jackie O. Cruz/FORBES)[/caption]Pedro Cardoso, 53, ran the inn between 1992 and 2012 under the ownership of Luiz Antonio Lacerda. When Luiz rented it to Antanor Alves Jr., Pedro left.“All this talk about the property being haunted is nonsense. I lived there for 18 years and I never saw a ghost,” he says.Cardoso has heard of close encounters with the supernatural kind, however. He claims to have investigated them as they happened. Screaming in the old barn? An anaconda had wrapped itself around a dog and the dog’s squeals were echoing throughout the building.“I’ve heard about the ghosts destroying the main building,” he says of the tallest structure on the site, a newly painted yellow building only opened on the first floor. Alves is currently reforming it. The 12 room inn is now known as Lenda Pantanal. There’s shiny new kitchen equipment inside. But for now, only a day laborer named Cesar Macete is there carving out benches and western style swing doors during the day with his wife, his daughter, a groundskeeper and the manager. A couple of horses graze about 300 yards away.We went upstairs to look at the second floor where ghosts supposedly ransacked the place. Elias Ribeiro, the Indian groundskeeper whose bloodline is buried on this land, begrudgingly opened the padlocked door, as if in slow motion.Bats circle frantically around a spiral staircase, first brought to the building from England by the Belgians. Bat feces stain the staircase railing. Upstairs, more bats circle over head with some hanging upside down in a hole in the ceiling.Old vanities remained in place, like make-up mirrors and armoires. Floor boards were ripped out. The ceiling had collapsed in places, becoming little bat caves. There’s a dead bat on the floor in the hallway outside the bedrooms.“It wasn’t a ghost that destroyed it. The place is 150 years old. Things fall apart,” Cardoso says, emphatically.But, Ribeiro is not so sure of all this. He has spent many nights in the crew quarters. It’s a decrepit white structure that sits on a native burial site discovered by Brasilia-based archeologist Maria Clara Miggliacio in 2001. The site is a national historic landmark and remains untouched.[caption id=\"attachment_44787\" align=\"\" width=\"1037\"] \"I don’t know what it was. I heard it again, and again. It wasn’t thunder. I’m glad it ended,\" said Elias Ribeiro, a groundskeeper at Lenda Pantanal, the small 12 room inn now being run from the \"super natural\" Descalvados. (Photo by Jackie O. Cruz/FORBES)[/caption]“A few weeks ago I was sleeping there alone when I heard this thundering sound,” he says, making a sound of a heavy object falling and dragging, like a thunder roll echoing in the building. “I don’t know what it was. I heard it again, and again. It wasn’t thunder. I’m glad it ended,” he says. “There was nobody there that I knew of. Just me and God.”Beside him, new manager Antonio Nunes Lopes, shakes his head. He doesn’t buy a lick of this nonsense.Pires heard the same sound many years ago.“I was there last with four men in 1992. We were returning from a fishing trip. The whole site was vacant. Not a soul. This blue building here was opened on both sides, like a big cow barn,” he points out. “It started to thunder and lightning and we needed cover. Around 11:30 at night, we all hear this weird sound like a cattle stampede,” he says. He makes the sound. It’s the same sound Ribeiro makes, only they describe it differently. For Pires, its cattle or horses running scared.Was he sure it wasn’t just thunder? It was raining heavily that night, he confessed.“I know the sounds of the Pantanal. That wasn’t thunder. That was like a stampede of hoofed animals,” he says. “I remember getting up and raising my lantern to see what was there. There was nothing there. No leaking water from rain. No animals. We went back to sleep, then a while later when the rain and thunder stopped, we heard it again,” he says, eyes wide open as if this whole experience just happened yesterday. The four men grabbed their sleeping gear and decided it was better to spend the night in a wet fishing boat than there.Stories abound of drowning children, and war-time torture victims from the old Brazil-Paraguay war.“A lot of people drowned in the river just outside the property, including children,” says Marcinho Lacerda, one of the family members of the property.Despite the fresh coats of paint on the exterior, few people populate the inn. It was empty both times we went there, including on a weekend.“Some one was here a month ago,” says Lopes, standing in the shade in a wide brimmed straw hat. A small crop of onions and basil are just cracking the dirt beside him. It’s winter, but it is 93 degrees out.In typical developing country style, business owners are willing to throw money away, albeit at cheap labor, simply to stand guard, trim the weeds, and plant some herbs. There’s a lot of work to be done, but the only man working is Ribeiro on the lawn and Macete behind a power saw.Lenda Pantanal needs at least a dozen Macetes before this thing has more live humans on site than dead ones. It’s been five years rebirthing the place. It’s still a ghost town.Perhaps if global ghost hunters want to find something new and under-populated, then Lenda Pantanal might just be the place. It’s likely they’ll be plenty of room at the inn.[gallery2012]", "external_links": [], "published": "2015-08-30T20:20:00.000+03:00", "crawled": "2015-08-30T15:38:51.443+03:00", "highlightTitle": ""}