{"organizations": ["Vienna Austria Travel Guide Vienna", "Europe Travel"], "uuid": "94a64edd00efc942baf7762af698ae78888c15a7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeurope.about.com", "main_image": "http://f.tqn.com/y/goeurope/1/S/U/b/2/volkstheater-vienna.jpg", "site_section": "http://z.about.com/6/g/goeurope/b/index.rdf", "section_title": "About Europe Travel", "url": "http://goeurope.about.com/cs/vienna/a/vienna_guide.htm", "country": "US", "title": "Vienna Austria Travel Guide", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Vienna Austria Travel Guide", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T02:44:00.000+03:00", "replies_count": 0, "uuid": "94a64edd00efc942baf7762af698ae78888c15a7"}, "author": "", "url": "http://goeurope.about.com/cs/vienna/a/vienna_guide.htm", "ord_in_thread": 0, "title": "Vienna Austria Travel Guide", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Martin"], "text": "Vienna: Volkstheater and Tram. James Martin, Europe Travel \nUpdated: December 21, 2014 \nVienna is conveniently located on the rail lines between Venice , Budapest, and Prague, the crossroads between Eastern and Western Europe. \nVienna stands at the heart of Europe, smack on the intersection between the East and West. Conquerors--Celts, Romans, Babenbergs, and finally the Hapsburgs--have all left their marks. Now Vienna is the sole EU capital with a UN headquarters. \nViennese architecture tends toward the massive. You feel quite small walking the city center as monumental buildings brood over you, and many visitors have reported a coldness to Vienna that they can't really put a finger on. \nBut there is a warmth to Vienna as well. Coffee shops buzz with life, trams full of people clatter along, crisscrossing the city in abundance. Getting to Vienna from the Airport \nThe Cat Train gets you to the airport from the main \"Wien-Mitte\" Railway station in 16 minutes. Trains leave every half hour. There is a discount when you use a Vienna card. Getting Around Vienna \nThe extensive underground, tram, and bus system is all you need. A Vienna Card will set you back €18.50 ( check current prices ) and can be purchased at your Vienna hotel, a tourist information office or at Vienna Transport sales counters. \nA Vienna Card provides: Unlimited free travel by underground, bus (excluding night buses) and tram for 72 hours Vienna Airport Lines - shuttle bus from the airport to the city center at reduced prices. Reduction or benefits at 170 museums and sights, theaters, concerts, shops, restaurants, cafés and Heurigen (wine taverns). \nOther transportation options include a 24 hour transportation ticket for €5 and 72 hour ticket for €12. A single ticket costs €1.50. \nTrams 1 and 2 make a loop around the historic core of Vienna. If you're tired or it's raining and you want a cheap unguided tour, just ride one of these trams (they're both on the same route, they just go in opposite directions around the loop.) \nYou can also buy Vienna 24 and 72 hour public transportation tickets from vending machines around Vienna, covering tram, bus and U-Bahn fares. They offer a good deal if you intend to use public transportation several times on your stay. Remember to validate your ticket using the blue machines on the trams or buses. Where to Stay \nIf you arrive in Vienna without hotel reservations you may need the services of the City Center Tourist Information office in the 1st district, Albertinaplatz / Maysedergasse. It's open daily 9 a.m. - 7 p.m. There's another Tourist Information Office in the Airport opposite the baggage carousels that's open daily 8.30 a.m. - 9 p.m. There are travel agencies in both train stations, but check outside first for convenient hotels. \nVienna hotels tend to be expensive, but no more expensive than in most European capitol cities. In 2003, we stayed at the Hotel Congress Wien for €80 ( check current prices on Hipmunk ). The Hotel, at Wiedner Gurtel 34, is across the street and to the left as you exit the South train station (Südbahnhof). \nYou can compare prices on Vienna user-rated hotels at Hipmunk: Vienna, Austria Hotels . If you'd like to live the good life in a Vienna apartment or vacation rental, HomeAway lists almost 300 Vienna Vacation Rentals . Day Trips \nVienna is surrounded by great cities, not to mention the Vienna Woods. Why not take an apartment in Vienna and enjoy some day trips to cities like Prague or Budapest, or explore the Danube valley? We have suggestions for apartments and day trips: Vienna Day Trip Guide . Vienna Restaurants \nThere are many restaurants in an area called Spittelberg [ map ], a reconstructed Biedermeier neighborhood. Walk down Spittelberg street (in the museum quarter, the tourist map you get at the hotel will point it out) and you'll notice a lively restaurant, arts, and bar scene. \nOur best meal was just off Spittleberg on the Burggasse in an up and coming Viennese restaurant called Zu ebener Erde und erster Stock at Burggasse 13. We were able to snag a table without reservations, but got the last one by the door. We're not German speakers, but the waiter happily repeated the entire menu in English for us. We settled on the special, a gourmet multi-course meal built around the local crayfish, with a glass of Austrian wine for each course selected to go with the food. Dinner with wine and a glass of the local sparkling wine an aperitif came to around $100 with tip. And it was worth it. \nIn the summer, International food stalls are set up in front of the City Hall (Rathaus) and movies are shown on a giant screen. Go here if you're looking for bargains or you miss your Texas barbecue. Vienna's Historic Coffee Houses \nA trip to Vienna isn't complete without a relaxing stop at a \"Kaffeehaus\", one of those elegant and quiet places to sip and savor. We've made a list of some of Vienna's best: Vienna's Top Cafés . Museums in Vienna \nAs you would expect, Vienna has a number of museums , many of which have to do with art and music. If you're looking for unusual, you might try the Papyrus Museum : \nThe objects on display range from the oldest papyrus in the collection, a Book of the Dead from the middle of the second millennium BC, to documents of the Islamic period written on paper in the 13th century AD. These objects illustrate the life of people living in the Nile Valley over a period of three thousand years. \nThe Papyrus Museum and the unique Globe Museum are part of the Austrian National Library . You can get a guided tour to the library or just the museums you choose. \nThe Kunsthistorisches Museum is Vienna's star attraction, offering a picture of European culture through art spanning five millennia. \nLike wars, snakes and fishy things? The Haus des Meeres may be to your liking. According to Travelwriticus: \"The Haus des Meeres , located inside a former blockhouse tower of World War II, houses several aquariums and two tropic houses.\" Vienna Weather and Climate - When to Go to Vienna \nVienna has a moderate climate, and summers are often ideal, especially the months of June and September. For historic temperature and precipitation information, see: Vienna, Austria Travel Weather . \nFor more on Vienna, see our Vienna Travel Directory . You'll find hotel, apartment, and hostel information, as well as maps, sights, entertainment, coffeehouse and cultural event information. Vienna in Pictures \nSee our Vienna Picture Gallery . Rail Passes and Scenic Rail Journeys in Austria \nSee our article Austria Scenic Train Rides to get maps and routes of the best rail journeys through Austria. The last page is devoted to Austrian Rail Passes. Related Articles", "external_links": [], "published": "2015-08-03T02:44:00.000+03:00", "crawled": "2015-08-04T02:46:40.697+03:00", "highlightTitle": ""}