{"organizations": [], "uuid": "79c84c17ece3e4ec78b07d622a9c300936f13e03", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-55bf9635/turbine/os-florida-ski-club-trips-20150803", "site_section": "http://www.sun-sentinel.com/travel/rss2.0.xml", "section_title": "Travel - Sun Sentinel", "url": "http://www.sun-sentinel.com/travel/os-florida-ski-club-trips-20150803-story.html", "country": "US", "title": "Florida ski clubs offer trips to heed the call of the North", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Florida ski clubs offer trips to heed the call of the North", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T18:47:00.000+03:00", "replies_count": 0, "uuid": "79c84c17ece3e4ec78b07d622a9c300936f13e03"}, "author": "Georgina Cruz, Special Correspondent", "url": "http://www.sun-sentinel.com/travel/os-florida-ski-club-trips-20150803-story.html", "ord_in_thread": 0, "title": "Florida ski clubs offer trips to heed the call of the North", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Florida ski clubs offer trips to heed the call of the North Colorado Jack Affleck / Vail Resorts Ski lessons offered by the Beaver Creek Ambassador Program can accommodate different groups and ages. Ski lessons offered by the Beaver Creek Ambassador Program can accommodate different groups and ages. (Jack Affleck / Vail Resorts) By Georgina Cruz, Special Correspondent Canada Florida ski clubs offer trips to heed the call of the North \nWant the excitement of shussing down a dazzling slope with fresh powder? And want to share the experience with friends? Whether you are a novice who hasn’t even seen snow, or whether you take to the slopes like an Olympian, you can do so on trips planned by local ski clubs. The clubs schedule a roster of trips to winter wonderlands each year, and the trips are open to skiers of all skill levels. 8 \nBenefits of joining a ski club include social activities –in addition to ski trips each winter, many ski clubs have a year-round schedule of activities including parties, picnics, golf outings and more so you can get to know other members and go skiing with them. Another benefit is that the club typically takes care of ski trip details such as airline tickets, lodging, lift tickets, ground transfers, etc. \nEach winter the clubs plan a variety of trips to popular national resorts like Aspen, Keystone and Breckenridge, Colorado as well as to international spots like Whistler, British Columbia, Canada and Cervinia and Paganella, Italy, among the planned destinations this year. Some of the programs are Florida Ski Council Trips, attended by clubs from various parts of the state, so they offer even more opportunities to make friends with people who share your interest in skiing. 0 \nBelow is a selection of some ski tripsavailable from local clubs this coming season. Most prices are per person, double occupancy, and are subject to change as are the trip dates, itineraries and other details such as, in some cases, the inclusion of air and lift tickets in the price. Triple and quad \noccupancy may be available. Club membership dues are usually required.Contact each individual club for possible additional trips, moreinformation and features included in each trip. \nAspen/Snowmass, Colorado – \nJan. 30-Feb. 6 – Boca Ski Club, Interlude Condos, $1,670 per person, double, two bedroom/two bath condo. \n\nBeaver Creek, Colorado – \nJan. 16-23 – Palm Beach Gator Snow Ski Club, The Charter at Beaver Creek, $1,890. \nMarch 19-26 – Boca Ski Club, Charter at Beaver Creek, four people per two-bedroom/two bath condo, $1,845 per person. \n\nJan. 9-16 – Palm Beach Gator Snow Ski Club, Village at Breckenridge, $1.475. \n\nMarch 4-12 – Boca Ski Club, Sertorelli Sporthote, $2,795 per person. \n\nMarch 19-26 – Palm Beach Gator Snow Ski Club, The Evergreen Condos, $1,765. \n\nFeb. 20-27 – Palm Beach Gator Snow Ski Club, $2,100, details TBA. \nFeb. 20-27 – Boca Ski Club, Oxford Hotel Downtown Bend, $1,930 per person. \n\nPaganella, Italy – \nMarch 11-19 – Palm Beach Gator Snow Ski Club, Hotel Cristallo, $2,500, post trip extension to Florence available. \n\nFeb. 13-20 – Miami Ski Club, Park City Peaks Hotel, $1,652 per person, double. \nThe Canyons, Utah – \nFeb. 6-13 – Palm Beach Gator Snow Ski Club, The Silverado Lodge, $1,920. \n\nJan. 23-30 – Palm Beach Gator Snow Ski Club, Florida Ski Council Trip, Tantalus Lodge, $1,940. \nJan. 23-30 – Boca Ski Club, Delta WhistlerSuites, four people per two-bedroom condo, $1,795 per person. \nJan.23-30 – Miami Ski Club, Crystal Lodge inWhistler, Fairmont Hotel in Vancouver, $1,914 per person, double. Extension in Vancouver available. \n\nZell-Am-See, Austria – \nMarch 4-12 – Miami Ski Club, Florida Ski Council Trip, Superior Grand Hotel, $2,965. Extension to Vienna/Budapest available. \n\nFor more information on local ski clubs, visit: \nBoca Ski Club: www.BocaSkiClub.com . \nFort Lauderdale Snow Ski Club: www.fortlauderdaleskiclub.com . \nMiami Ski Club: www.miamiskiclub.com . \nPalm Beach Gator Snow Ski Club: www.gsscotpbatc.wildapricot.org . \nSunshine Sloper’s Ski Club: www.sunshineslopers.com .", "external_links": [], "published": "2015-08-03T18:47:00.000+03:00", "crawled": "2015-08-03T22:31:31.820+03:00", "highlightTitle": ""}