{"organizations": [], "uuid": "05e0a7abcb2c49e88cc54c7f0c2e7d13b8eea45f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/07/Southwest-Airlines-logo.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/southwest-airlines-board-of-directors-elects-ron-ricks-as-vice-chairman/", "country": "US", "title": "Southwest Airlines Board Of Directors elects Ron Ricks as Vice Chairman - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Southwest Airlines Board Of Directors elects Ron Ricks as Vice Chairman - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "05e0a7abcb2c49e88cc54c7f0c2e7d13b8eea45f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/southwest-airlines-board-of-directors-elects-ron-ricks-as-vice-chairman/", "ord_in_thread": 0, "title": "Southwest Airlines Board Of Directors elects Ron Ricks as Vice Chairman - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Southwest Airlines Board Of Directors elects Ron Ricks as Vice Chairman\nThe Board of Directors of Southwest Airlines announced today that Ron Ricks, 65, has been elected as Vice Chairman of the Board. Concurrently, Ricks announced that he is retiring from his position as Executive Vice President and Chief Legal and Regulatory Officer after serving as an Officer of Southwest Airlines for the past 29 years.\n“Ron has provided counsel to Southwest Airlines since the early years of the Company, and I am delighted that he will continue to provide leadership and guidance through his role as Vice Chairman,” said Gary Kelly, Chairman of the Board, President, and Chief Executive Officer. Ricks will remain a non-Officer Employee of the Company to assist with the transition of complex legal projects and specialized governmental affairs issues. Before joining Southwest Airlines, Ricks was a partner in the San Antonio law firm founded byHerb Kelleher, working extensively on the Southwest Airlines account. Altogether, Ricks has represented Southwest since 1981.\nSouthwest Airlines announced these additional leadership changes, all reporting to Kelly:\nTammy Romo was promoted to Executive Vice President and Chief Financial Officer. In addition to maintaining her most recent responsibilities as Sr. Vice President and CFO, the leadership of Supply Chain Management now reports to Romo. Romo joined Southwest Airlines in 1991. Mark Shaw was promoted to Sr. Vice President General Counsel and Corporate Secretary. In addition to maintaining his responsibilities over the Company’s General Counsel Department, Governmental Affairs leadership now reports to Shaw. Shaw has been with Southwest Airlines since 2000. Jeff Lamb, who has been with Southwest Airlines since 2004, maintains the responsibilities of his most recent role as Executive Vice President Chief People and Administrative Officer, and expands his leadership to now include Airport Affairs. His new title is Executive Vice President Corporate Services.\nSource:- Southwest Airlines", "external_links": [], "published": "2015-08-01T03:00:00.000+03:00", "crawled": "2015-08-02T17:40:23.535+03:00", "highlightTitle": ""}