{"organizations": [], "uuid": "8bdab349e482d3ac992ab5fb64514bbaaba8e0e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/d/8/n/i/image.related.StuffLandscapeSixteenByNine.620x349.16d8jb.png/1439688888672.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/asia/71161463/The-erotic-allure-of-Indias-Khajuraho-temples", "country": "AU", "title": "The erotic allure of India's Khajuraho temples", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "The erotic allure of India's Khajuraho temples", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T04:34:00.000+03:00", "replies_count": 0, "uuid": "8bdab349e482d3ac992ab5fb64514bbaaba8e0e6"}, "author": "Alison Stewart", "url": "http://www.stuff.co.nz/travel/destinations/asia/71161463/The-erotic-allure-of-Indias-Khajuraho-temples", "ord_in_thread": 0, "title": "The erotic allure of India's Khajuraho temples", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The erotic allure of India's Khajuraho temples ALISON STEWART Last updated 13:34, August 16 2015 KAMAL KISHORE/REUTERS \nA tourist takes pictures of erotic Hindu sculptures in the Indian town of Khajuraho. \nPuritans viewing the erotic carvings on the Khajuraho Temples in central India's Madhya Pradesh have been quick to pronounce them \"offensive pornographic scenes to excite savage passions\". \nEven Mahatma Gandhi found the temples deeply distressing, and encouraged his posse of pious vandals to chip the temple walls clean of \"indecent and embarrassing\" affronts to Indian culture. They weren't terribly successful. \nBut Khajuraho experts say these people, including tourists visiting merely for Kama Sutra ogling, misunderstand Khajuraho's purpose. Far from sordid sleaze, the World Heritage site, with its remaining 25 elaborate temples, represents a philosophy of life that employed the sensuous to achieve the sublime. \nTemples in Khajuraho are famous for displaying erotic carvings and sculptures that date back to hundreds of years in a country that gave birth to the Kama Sutra. Photo: KAMAL KISHORE/REUTERS \nFashioned in an age of extreme tolerance, people had an integrated view of life. Kama, or pursuit of pleasure, was one of the four purusharthas, or aims of life, a stepping stone to moksha or deliverance. The temples are also masterpieces of preserved Indo-Aryan medieval temple art and architecture, with the sculptures conforming to classical traditions. \nAnd they provide insight into ancient history, at a time when written records were rare. Their significance is magnified by ongoing Islamic State desecration. Islamic State recently destroyed the 2000-year-old Lion of al-Lat in Palmyra, Syria. \nKhajuraho, the most visited Indian attraction after the Taj Mahal, was an important capital of the Chandela warrior kings who ruled Madhya Pradesh from the 9th to the 13th centuries AD. \nThe Kandariya-Mahadeva temple in the western group. Ad Feedback \n\nThe 85 original temples, dedicated mainly to Shiva, Vishnu and the Jain Tirthankaras (spiritual masters), covered 21 square kilometres. Though some granite was used, they were built largely from hard pink river sandstone, excavated and transported by elephants from River Ken quarries 22 kilometres away. \nBlocks were put together using interlocking grooves, with no cement. A lock at the top fixed the structure. Carvings are so intricate, they clearly display tiny details like garment folds, water droplets, hair strands, nails and skin creases. Each temple took about 25 years to finish. \nWhile the Chandela dynasty failed in the 13th century, remoteness saved the temples from desecration. Khajuraho was rediscovered in 1838 when British army captain T.S. Burt, following the directions of his palanquin bearer, or palki wallah, ventured into the jungle in search of the \"wonders of a place called Khajrao\". \nThe seductive surasundari, or celestial nymphs, are among the featured sculptures. Photo: Rob Mills \nWe are visiting Khajuraho as part of our Abercrombie & Kent In Search of Tiger itinerary and meet A&K local tour guide, Ranvir Singh, who has a profound respect for the era that produced such superb artworks. \n\"It wasn't just a religion, more a way of life,\" he says. \"It showed a sophisticated, open-minded society. It wasn't just about sex, but more about affection, respect and enjoyment, slowing down and doing good things – a strong message for us today.\" \nRanvir points to the shape of the temples – the broad base curving up to the crowning circular top, or Amalaka – showing how people should start life slowly, enjoying themselves, helping others and finally, reaching for the way to heaven. \nThe temples are grouped into Western, Eastern and Southern, with the Western group the most visited. Here you'll find the exquisite Lakshmana Temple, the earliest and best preserved; the Kandariya-Mahadeva Temple, the grandest with its 800 sculptures; and the Visvanatha Temple, with arguably the most beautiful artworks. \nThe Lakshmana Temple's numerous fine examples of medieval art include the minstrel pair, their faces expressing devotional rapture, a wonderful dancing Ganesha, and the seductive surasundari (celestial nymph) draped in a wet sari, a sculpture possibly more erotic than the frolicking fornicators. \nTourists walk along a wall of erotic Hindu sculptures in the Indian town of Khajuraho. Photo: KAMAL KISHORE/REUTERS \nIn the Visvanatha Temple, look for these lovely sculptures: a woman with fruit in one hand and a parrot in the other, a mother with child, a flute-playing surasundari and another painting her foot, plus numerous couples slowing down and enjoying life in the sauciest possible way. \nTourists tend to linger at the northern and southern facades of the Kandariya-Mahadeva Temple, perhaps because of the concentration of erotic sculptures, including a gymnastic \"plural congress\" carving – orgy to you. \nThere are five categories of carved figures – deities like Shiva and Vishnu; minor gods and goddesses; and three-dimensional relief sculptures that are dynamic, elegant, sensual and provocative, shown putting on makeup, washing hair, writing, playing games, dancing, removing thorns from feet, dressing. \nThen there are the gymnastic lovers executing the positions described in texts like the Kama Sutra , Rati Rahasya and Ananga Ranga , as well as various examples of bestiality, confirming that horses were sometimes man's best friend (Lakshmana Temple – tourist central). Other sculptures and friezes show dancers, hunters, teachers, battle scenes and animals, including the rampant horned lion. These expressive sculptures vividly depict human emotions: fear, love, desire, enjoyment, humour and astonishment. \nIt's a remarkable window to another world, where the adoration of beauty in all its forms was paramount. \nMORE INFORMATION abercrombiekent.com.au ; incredibleindia.org/en \nGETTING THERE Qantas flies to Mumbai return via Singapore. The Singapore-Mumbai leg is a codeshare with Jet Airways or Air India. See qantas.com . \nSTAYING THERE Hotel Chandela, in park-like grounds 1.2 kilometres from the Khajuraho Temples, has doubles from $100. See tajhotels.com . \nTOURING THERE Abercrombie & Kent's 8-day/7-night In Search of Tiger costs from $7625 a person twin share (October-December). See abercrombiekent.com.au. \nThe writer was a guest of Abercrombie & Kent, Taj Hotels and Qantas.", "external_links": [], "published": "2015-08-16T04:34:00.000+03:00", "crawled": "2015-08-16T10:23:46.665+03:00", "highlightTitle": ""}