{"organizations": [], "uuid": "1365031190d1d0586a5992a5a37a1c96392db3c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29843226/rotary-lift-receives-us-patent-for-trio-three-stage-lift-arms", "country": "US", "title": "Rotary Lift Receives U.S. Patent for Trio™ Three-Stage Lift Arms", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Rotary Lift Receives U.S. Patent for Trio™ Three-Stage Lift Arms - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "1365031190d1d0586a5992a5a37a1c96392db3c0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29843226/rotary-lift-receives-us-patent-for-trio-three-stage-lift-arms", "ord_in_thread": 0, "title": "Rotary Lift Receives U.S. Patent for Trio™ Three-Stage Lift Arms", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Rotary Lift\nTrio lift arms offer unmatched reach and precision for properly lifting more vehicles\nMADISON, Ind. , Aug. 20, 2015 /PRNewswire/ -- Rotary Lift has been granted United States patent 8,973,712 for its technician-friendly Trio ™ vehicle lift arms. Trio arms have up to a 20 percent greater reach than traditional lift arms, so they can be used to service a wider range of vehicles. Their proprietary three-stage design enables technicians to more easily move the arms into position and then precisely position adapters exactly where they're needed for proper lifting. Trio arms come standard on the best-selling Rotary Lift SmartLift ® 10,000 lb. capacity inground lift .\nPhoto - http://photos.prnewswire.com/prnh/20150820/259913\nRotary Lift introduced the original three-stage arm to much fanfare in North America in 2005. SmartLift with three-stage arms was named one of the Top 20 Tools for 2005 by Motor Magazine . The original three-stage arms consisted of three telescoping sections that slid inside of each other so they could be extended or retracted as necessary to reach more vehicle pick-up points than was possible with traditional lift arms.\nThe original three-stage arm design has been widely copied and is now available on many light-duty two-post surface and inground lifts. But Rotary Lift engineers were not satisfied. Rotary Lift invented the original hydraulic lift in 1925, and over the last 90 years the company has had a singular focus on developing the most efficient, reliable and longest-lasting lifts for its customers.\nIn 2011, Rotary Lift introduced an even better three-stage arm: the Trio. The Trio arm design keeps the first two telescoping arm sections and replaces the third with a multi-position sliding adapter integrated into the second arm. This design lets technicians easily interchange truck adapters, round polymer adapters or three-position flip-up adapters depending on the job at hand. They can easily rotate the adapters 360 degrees and can slide them from a fraction of an inch to several inches to precisely position them at the proper pick-up points.\n\"Trio arms have the most advanced arm design around. Their versatility, ease-of-use and precision makes them very popular with technicians, service managers and shop owners. A single lift equipped with Trio arms can service practically any vehicle under 10,000 lbs., from a unibody car to a light-duty pickup,\" says Jim Dirksen , vice president of light-duty for Rotary Lift. \"As the technician population ages, bay ergonomics become increasingly important. It's easier to slide just one telescoping arm and then move an adapter than it is to slide two heavy arm sections. Plus, with today's vehicle designs, it's more important than ever that technicians lift a vehicle only at the OEM-designated lifting points. No other lift arm out there offers the fine adapter adjustment made possible by our Trio arm design.\"\nTrio arms were designed by Rotary Lift engineers in Madison, Ind. , and have been performance tested to 20,000 lift cycles, which is the equivalent of 10 years of real-world use. All SmartLift inground lifts are third-party tested and Automotive Lift Institute (ALI) certified to meet ANSI lift safety and performance standards.\nTo learn more about SmartLift Trio arms from Rotary Lift, visit www.rotarylift.com/LIGHTDUTY/SmartLifts/ , watch https://vimeo.com/83787548 , call (800) 640-5438 or contact your local Rotary Lift distributor. You can also find Rotary Lift on Facebook, www.facebook.com/RotaryLift and Twitter, twitter.com/RotaryLift . Check out Rotary Lift videos on Vimeo, http://vimeo.com/groups/rotary .\nAbout Rotary Lift\nRotary Lift is the leading brand of vehicle lifts designed to increase technician productivity. Celebrating 90 years in 2015, Rotary Lift was founded in 1925 by the inventor of the first automotive hydraulic lift and now offers the broadest line of lifts for use in professional automotive service, commercial truck and transit applications. There are more Rotary Lift products used in vehicle repair facilities around the world than any other brand.\nRotary Lift is a Vehicle Service Group (VSG) brand. VSG comprises nine global vehicle lifting and collision repair brands: Rotary Lift, Chief ® Automotive Technologies, Forward ® Lift, Direct-Lift ® , Hanmecson ® , Revolution ® Lift, Elektron, Blitz ® and nogra ® . Based in Madison, Ind. , VSG has operations worldwide, including ISO 9001-certified manufacturing centers in the U.S., Europe and Asia .\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/rotary-lift-receives-us-patent-for-trio-three-stage-lift-arms-300131299.html\n ", "external_links": ["http://www.facebook.com/RotaryLift", "http://twitter.com/RotaryLift", "http://www.rotarylift.com/LIGHTDUTY/SmartLifts/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/rotary-lift-receives-us-patent-for-trio-three-stage-lift-arms-300131299.html", "http://photos.prnewswire.com/prnh/20150820/259913", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL83744&Transmission_Id=201508201227PR_NEWS_USPR_____CL83744&DateId=20150820", "http://vimeo.com/groups/rotary", "https://vimeo.com/83787548", "http://www.rotarylift.com/SL210SW/"], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-20T22:17:39.274+03:00", "highlightTitle": ""}