{"organizations": ["Sunshine Coast", "Sunshine Coast B.C.", "Sunshine Coast Try"], "uuid": "78051797ad358b8d68b3630ca3f9c104f258e24d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vancouversun.com", "main_image": "http://www.vancouversun.com/cms/binary/11302213.jpg", "site_section": "http://rss.canada.com/get/?F7439", "section_title": "Vancouver Sun - Travel", "url": "http://www.vancouversun.com/travel/mini+break+Sunshine+Coast/11315602/story.html", "country": "CA", "title": "Try a mini-break on B.C.'s Sunshine Coast", "performance_score": 0, "site": "vancouversun.com", "participants_count": 0, "title_full": "Try a mini-break on B.C.'s Sunshine Coast", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T16:24:00.000+03:00", "replies_count": 0, "uuid": "78051797ad358b8d68b3630ca3f9c104f258e24d"}, "author": "", "url": "http://www.vancouversun.com/travel/mini+break+Sunshine+Coast/11315602/story.html", "ord_in_thread": 0, "title": "Try a mini-break on B.C.'s Sunshine Coast", "locations": ["Vancouver"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Try a mini-break on B.C.'s Sunshine Coast B.C.'s Sunshine Coast lies just a short ferry ride and a 40-minute drive from Vancouver. Here we luxuriated for a few days at Rockwater Secret Cove Resort, an ocean-side resort which offers a variety of accommodations, all with spectacular views. Beneath a rustic moss-covered rooftop, our waterfront cabin’s interior had been charmingly updated. Photograph by: RockwaterSecretCoverResort.com , Screengrab \nB.C.'s Sunshine Coast lies just a short ferry ride and a 40-minute drive from Vancouver. Here we luxuriated for a few days at Rockwater Secret Cove Resort, an ocean-side resort which offers a variety of accommodations, all with spectacular views. Beneath a rustic moss-covered rooftop, our waterfront cabin’s interior had been charmingly updated. Kicking off our shoes, we relaxed on our private patio, gin and tonic in hand. It was mesmerizing to look out over the rippling waters of the Malaspina Strait and watch the sun slowly descend below the horizon. \nOn that first afternoon, we strolled along the elevated boardwalk which wove its way amongst arbutus and fir trees to a number of luxurious tent house suites perched high on the rocky cliffs. It was a hot summer day and the swimming pool was beckoning me. But oh no, I’d forgotten my bathing suit! Guests could also choose to rent kayaks or sign up for an open-air spa treatment. Later, seated at a window table in the resort restaurant, we enjoyed a romantic dinner in celebration of a significant birthday. \nThe next morning we set off to explore Francis Peninsula Marine Park, a few miles south of the small community of Madeira Park. We wandered through the forest and followed the footpath which gently undulated over some rocky terrain and then ran alongside the water. Relaxing on the rocks at trail’s end, we listened to the birds’ twitter, watched the boats ply their way along Malaspina Strait and reveled in the area’s peace and serenity. Another short but steep hike brought us to the top of Pender Hill. Here we had a bird’s eye view of the many bays, coves, inlets, small islands and scattered settlements that comprise Pender Harbour. It was from this lookout that over 100 years ago indigenous Coast Salish sentries would watch for parties of marauding war canoes. \nBut it was time for a change of pace and a leisurely guided boat tour of Pender Harbour. Mark of Slocat Tours, our guide, explained a little of the area’s history and geography. Once upon time more than 5,000 Coast Salish people lived in longhouses on these shores. However, about a century ago a smallpox epidemic reduced this number by almost 90%. Later the area became an important logging and medical centre. Today, it is a favourite summer retreat and a popular tourist destination. \nAs we chugged along, Mark told us that more than 60 kilometers of shoreline border the harbour, a distance similar to that from Pender Harbour to Vancouver. Until the 1960s, most travel was on the waterways rather than the twisting roads that link the outlying communities. Consequently, a boat was a necessity to get around and so the designation “Venice of the North” was coined. The fishermen were working hard as the last day of the season to catch spotted prawns was imminent. Strong demand exists for these tasty morsels in Asia where they sell for $200 per pound. Here at home they cost roughly $15 per pound. Lucky us! For protection the wooden pilings were traditionally coated with creosote which killed the herring eggs. Nowadays, most pilings are metal which permits more herring to survive. The salmon feed on the herring and we (and the resident orcas) feed on the salmon. Several harbour seals were frolicking in the bay happy to have escaped the jaws of the transitory orcas. \nAt water’s edge, the sun-loving broadleaf evergreen Arbutus trees towered as much as 90 ft. above us. Their rusty-coloured bark was just starting to peel revealing a smooth pale yellow bark beneath. Mark added that bears like to munch the red berries on their treetops and often pull down the upper branches. \nWe also passed an old whaling ship which will perhaps see a new life as a restaurant, a half-sunken tugboat, old boathouses and fishing shelters supported on stilts, sightseeing floatplanes, a First Nations sweat lodge and a bald eagle’s nest. \nThe next day we had time for one last hike to Smugglers Cove Marine Park. In the late 1800s, Smugglers Cove was an access point and refuge for illegal human and marine traffic. We hoped that the sailboats moored here and the zippy little kayaks weren’t modern-day rum-runners. This fairly flat trail has wonderful views of the water and the woods. It traverses wooden boardwalks over wetlands and an extensive bog where the resident beavers have been hard at work creating a ghostly stand of dead and dying trees. \nA mini-break from routine was all we needed. Sometimes, just sometimes, a little piece of paradise turns up unexpectedly in one’s own backyard. We returned to Vancouver feeling refreshed and re-energized. What more could one want?", "external_links": [], "published": "2015-08-25T16:24:00.000+03:00", "crawled": "2015-08-26T09:44:07.463+03:00", "highlightTitle": ""}