{"organizations": [], "uuid": "5cb75b5e9d3277816aa0b19fd23c92111019f89a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/life/travel/2015/08/13/peta-offending-treats-on-the-menu-in-philippines/rosemaryandwormjpg.jpg", "site_section": "http://www.thestar.com/life/travel.html", "section_title": "Travel | Vacations, Destinations &amp; Reviews | Toronto Star", "url": "http://www.thestar.com/life/travel/2015/08/13/peta-offending-treats-on-the-menu-in-philippines.html", "country": "CA", "title": "PETA-offending treats on the menu in Philippines", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "PETA-offending treats on the menu in Philippines | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "5cb75b5e9d3277816aa0b19fd23c92111019f89a"}, "author": "Rosemary Counter", "url": "http://www.thestar.com/life/travel/2015/08/13/peta-offending-treats-on-the-menu-in-philippines.html", "ord_in_thread": 0, "title": "PETA-offending treats on the menu in Philippines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos View photos zoom MANILA, PHILIPPINES –“Dare me to eat this worm?” I asked, holding the raw, but dead, woodworm from its squirmy tip. For a few pesos paid to an 8-year-old girl, a half-dozen “woodworms” —plucked one-by-one from fallen rotten trees in Filipino mangroves — are served with a side of vinegar to “cook” them in.\nIt was my latest (and most slippery) swallow in what proved a serious vacation feat: to eat all the weirdest, grossest, stomach-turning, PETA-offending treats that the Philippines has to offer. Deep-fried crocodile, cheese ice cream, the unfortunately named Chicken Ass, raw woodworms and street-style duck fetuses are all mine—assuming I can stomach them. Delicious or disgusting? There’s only way to find out.\nKeso Ice Cream:\nWhat & Where: A classic ice cream cone — only cheddar-cheese-flavoured — is sold from colourful wooden carts on just about every street corner. (Keso is a phonetically spelled Queso, or cheese in Spanish.)\nThe Ick Factor: Knee-jerk reaction not so great, as cheese plus sugar are unlikely allies, but the sentiment doesn’t hold up to scrutiny: Remember cheesecake?\nFinal Verdict: Disappointingly, my keso cone is sweet and tasty but very subtle. As usual, there’s simply not enough cheese. Eat up and enjoy your lazy, underserved street cred.\nChicken Ass:\nWhat & Where: Pwet Ng Manok, or “chicken ass”, is marinated, skewered and grilled or blackened over charcoal. Popular as street-meat from ample vendors, or as an appetizer in local restaurants, like this one from Puerto Princesca City.\nThe Ick Factor: High, if you can’t get over the ass-thing, which I cannot. But if you can grill chicken feet, head and intestines, why not ass?\nFinal Verdict: Forget about asses and you’re chowing down on a familiar, kinda-boring spicy kabob. For the record, tastes like chicken.\nCrocodile Sisig:\nWhat & Where: A challenge to find, but spotted finally on the menu at Ka Inato, a local restaurant in the province of Palawan. Sisig is native Filipino food-prep where animal parts — whether pig head, ox brain or croc meat — are boiled, then broiled, then grilled.\nThe Ick Factor: Medium, at most. Any reservations of thinly sliced crocodile meat are easily off-set by the promise of a spicy-battered deep-frying. And since the Philippines is home to some of the biggest crocs on the planet, remember a crocodile would most certainly eat you.\nFinal Verdict: Absolutely scrumptious! (And you guessed it, here’s where I sprung for seconds.) With a pork texture and a fishy taste, it’s literally the best of both sand and surf. Only thing missing is a mayo-based dipping sauce.\nHalo-Halo:\nWhat & Where: Halo-halo, which translates to “Mix-Mix,” is a very popular dessert and just as it sounds — an over-the-top dessert parfait of Jello, fruit (bananas and mango), cooked tapioca, ice milk, ube (purple yam jam) and . . . boiled beans?\nThe Ick Factor: None at all . . . until you hit the beans. Kidney and garbanzos lurk in the halo-halo’s deeper layers. Get ready.\nFinal Verdict: Adopt Joey Tribbiani’s food style —“What’s not to like? Custard, good. Jam, good. Meat, good!”— and you’ll discover why halo-halo’s so well-loved. Double points for an aesthetic Anthony Bourdain called “oddly beautiful.”\nBalut Egg:\nWhat & Where: A developing duck embryo, boiled and eaten from the shell. This one’s cooked atop peanuts and served from a vendor in a night-time marketplace. Enjoy with a sprinkling of salt and a glass of beer.\nThe Ick Factor: 10 out of 10, so gross its consumption was a dare on Fear Factor, and so egg-y in the 40 C heat that I took one whiff and threw up over a wall. True story.\nFinal Verdict: Everyone has their culinary line and maybe it’s good I finally found mine. That said, I’m told a perfect balut (at 17 days old, the chick won’t have a beak, bones or feathers) is not just a delicious delicacy, but a potent aphrodisiac, too.\nRosemary Counter is a Toronto-based travel writer. She’ll eat just about anything. This trip was supported by Intrepid Travel.\nMore on thestar.com\nWine Lovers’ Escape: Niagara Escarpment\nWomen waiting for female sex-drug", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-13T18:06:47.230+03:00", "highlightTitle": ""}