{"organizations": [], "uuid": "b382a9446c88d2452bc87d6919bae684ff2b73b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/02/Denver-International-Airport-CEO-Kim-Day.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-technology-news/", "section_title": "Travel Technology news | Travel and Tour World | Online technology news | distributive system | mobile application |travel trade professionalsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/denver-international-airport-and-denver-fire-break-ground-on-a-new-landside-fire-station-2/", "country": "US", "title": "Denver International Airport and Denver Fire Break Ground on a New Landside Fire StationTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Denver International Airport and Denver Fire Break Ground on a New Landside Fire StationTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "b382a9446c88d2452bc87d6919bae684ff2b73b2"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/denver-international-airport-and-denver-fire-break-ground-on-a-new-landside-fire-station-2/", "ord_in_thread": 0, "title": "Denver International Airport and Denver Fire Break Ground on a New Landside Fire StationTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Denver International Airport and Denver Fire Break Ground on a New Landside Fire Station Published on : Wednesday, August 26, 2015\nDenver International Airport (DIA) and the Denver Fire Department (DFD) today held a ground-breaking ceremony at the future site of Fire Station 35, located at 25365 E 75th Avenue, near Jackson Gap and 75th Avenue. Expected to be completed in the summer of 2016, this will be the airport’s fifth fire station. The contemporary designed building will be approximately 18,000 square feet with four, large apparatus bays and an arced roof, resembling an airplane hangar. Metal panels on the façade will give it a modern look, adding texture that gives the building depth and different appearances throughout the day as sunshine and shadows create interesting visual effects.\nThis will be the first airport fire station accessible to the public, and firefighters will respond primarily to public safety events at structures. The other four fire stations are on the airfield and focus on aircraft rescue firefighting and structural response. Initially, four firefighters, or one company, will be stationed 24-7 at Fire Station 35. There will be one fire engine for initial water attack housed at the new station, and in 2020, a fire truck equipped with numerous ladders and other supplies will be added for additional support.\n“This new fire station will enhance the ability for our partners at the Denver Fire Department to respond to areas that are farther away from the airfield, such as the Federal Aviation Administration’s radar control center, Peña Boulevard, Final Approach, the south campus and the new Westin Hotel and RTD train stations on airport property,” said Denver International Airport CEO, Kim Day. “This is the right time to position first responders closer to Peña Boulevard as we continue to plan for future growth and development.”\nThe new fire station will be constructed as a design-build project, meaning that one company, PCL Construction Services, will deliver the design and construction services. They were selected through a competitive bid process with Disadvantaged Business Enterprise goals of 25 percent for design and 33 percent for construction. The building is designed to meet LEED Gold certification, which is a measurement used for resource-efficient buildings. Some features include a permeable paver system, which serves as a stormwater filter and a more effective way to replenish ground water than concrete or asphalt, and a state-of-the art roofing system, similar to the Westin Denver International Airport hotel.\n“It is so rewarding to break ground on this new fire station because it was identified over a decade ago as a future need,” said Airport Fire Division Chief, Angela Cook. “As more and more development is taking place around airport property, this new fire station will enhance our ability to protect property and life. We are also looking forward to having a community firehouse at the airport where the public can have greater access and connect to Denver firefighters.”\nSource:- Denver International Airport", "external_links": [], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T07:09:25.290+03:00", "highlightTitle": ""}