{"organizations": [], "uuid": "ea2e5f8bc0569f97e4f40028fd520568b7747082", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150810Torres1.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/08/11/jason-torres-from-bad-boy-to-national-surfing-champ", "country": "US", "title": "Jason Torres: From bad boy to national surfing champ", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Jason Torres: From bad boy to national surfing champ", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T12:30:00.000+03:00", "replies_count": 0, "uuid": "ea2e5f8bc0569f97e4f40028fd520568b7747082"}, "author": "Jill Replogle", "url": "http://www.ticotimes.net/2015/08/11/jason-torres-from-bad-boy-to-national-surfing-champ", "ord_in_thread": 0, "title": "Jason Torres: From bad boy to national surfing champ", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jason Torres at the Copa Beach Club Nosara competition, June 14, 2015. Ellen Zoe Golden/The Tico Times \nAmong the best rags-to-riches success stories in Costa Rica surfing is the tale of Jason Torres, the Jacó man who swapped his reputation as a hot-tempered devil child for that of a national champion. Along the way he has become an extraordinary individual with a beautiful wife and daughter and a bright future in surfing ahead of him. \nHis win on the National Surf Circuit last month in Playa Hermosa, Puntarenas was long overdue. Torres had been chasing the crown for years, and had the talent, but one thing or another happened to favor others. While his surfing has always been outstanding — a mixture of power and aerials — Torres has had to learn and accept an important lesson among professional competitors: It takes a certain mindset to be a winner. Along the way, while collecting other accolades, including three Central American championship titles, he got the message. \n“I just tried to do my best in every event,” Torres explained about his national title win. “What was different was I pushed myself and told myself even though I want to win this event, I want to have fun. It was an attitude change. It seems like I was always fighting a lot of injustices before.” \nChallenges began in his early home life. Because of them, Torres left home at age 9 and lived with friends, including Lisbeth Vindas and Diego Naranjo, both of whom became national champions before Torres. \n“I knew Jason even before he started surfing,” Vindas recalled. “Actually, he started surfing with me and Diego.” Back then, Vindas said, Torres was always looking for trouble. \nSee also Jacó gold: Chatting with Costa Rican surf champion Lisbeth Vindas \n“He had a lot of energy. People used to call him diablillo ,” she said. “We took him surfing (and) right away you could tell he had a lot of potential. He was a good athlete; he had an athletic body, too. From the first few waves he was already riding.” \nDespite his unflattering nickname, Torres said he wasn’t trying to be a bad kid. “It was because I wanted attention,” he said. “I was always hanging around with my friends, trying to get iguanas and trying to hit the beehives. Surfing was a place to put all my energy.” \nThe psychic change begin when he was a young man. From the creation of the National Circuit in 2001, when Torres began competing, he demonstrated tremendous potential in the water. His skills caught the attention of Antonio Pilurzu, founder of the Costa Rica Surf Federation and its premier national contest. \n“From the moment he started, I thought he had pure talent,” Pilurzu recalled. \nAttitude change \nBased on excellent results in 2003 and 2004, Pilurzu tapped Torres to join Costa Rica’s national junior surf team on a trip to Tahiti for the International Surfing Association (ISA) World Junior Surfing Games in 2004. There, he competed in his first international event in the under 16 category. \nYet, while in Tahiti, Torres got upset with a decision from the judges and his quick-trigger temper led to an altercation that put Pilurzu in a difficult position. ISA officials told him to take action against Torres, or the whole team would be disqualified. \n“At the World Surfing Games, there was a problem with Jason’s attitude,” Pilurzu recalled. “He didn’t know how to handle the truth. It’s possible he was too young and didn’t know how to control himself.” \nEven before Tahiti, Torres had gained a reputation for being quick-tempered, argumentative and difficult in competition. Upon Torres’ return to Costa Rica from the island, the Federation reluctantly suspended him from competing in the 2004-05 National Circuit. \nTorres doesn’t like to talk about that chapter in his life. “It’s my past,” he said about the incident. \nWatching from the sidelines as his friends competed that year was difficult for the youngster. He began a thorough self-evaluation. A newfound humility grew, and he returned to the circuit in 2005 with a positive attitude. \nBut even before he re-emerged on the national scene, he gained notoriety by acing out a slew of seasoned pros at a Quiksilver contest in 2005, winning Best Barrel and his first cash award of $250. He was 15 years old. \nNext year, the surf federation was putting together a national junior surf team to travel to the Pan American Surf Games in Peru. Pilurzu advocated for Torres to be included – and the team was lucky he did. \nAt the competition, the then 17-year-old powerhouse maintained enough focus in the coldest water he had ever surfed to pull off expert maneuvers on his last wave in the last heat of the finals to become the first Costa Rican ever to win a gold medal. \n“It was like a dream for me to compete and beat a couple of big names in surfing,” he recalled. “It was my first time winning something big, and I had a lot of support from the Costa Rican team. I got to know the sport’s support system that week.” \nThat new lesson about teamwork would serve Torres well as he competed with Costa Rica over the following years in many Central American Surfing Games. Not only did he help the Ticos win as a team every year, but he managed to gather three top individual titles: in the juniors category in 2006 and the open category in 2007 and 2008. \nLooking beyond Tico shores \nCarlos Brenes of the Costa Rica Surf Federation said that at the time, given the wins Torres was racking up, he was sure Torres would one day be Costa Rica’s national champion. He was runner-up on the circuit twice – in 2007 and 2009. But then Torres abandoned national competition for a time. \nHe wanted to make it to the top circuit of the World Surf League (WSL) but he lacked the funds to compete for a spot. So Torres opted to participate in the next-level competition in the region – The Association of Latin American Professional Surfers ( ALAS ), which has its competitions at various spots around Latin America. \nIn 2010 Torres finished in second place on the ALAS Latin Tour, just short of the big win. \n“ALAS is a good place to compete against people better than you,” he said. “But you don’t want to stay there. You have to dream big and go to the QS,” Torres said, referring to the Qualifying Series of the World Surf League, where surfers vie for spots on the top-rung World Championship Tour. \nTorres still had a few more detours to take. Still, he got a taste of the big leagues when he garnered enough votes in a video contest to allow him to participate in last year’s O’Neill Coldwater Classic in Santa Cruz, California. The World Surf League specialty event offered 16 unsponsored surfers the prize of a $50,000 sponsorship to pursue events on the WSL Qualifying Series. \nTorres got into the contest based on his video submission full of big airs and above-the-lip surfing. But in northern California’s frigid water, and with difficult small-wave conditions, Torres stayed close to the wave, playing a rail game that earned him wins in both Round 2 and 3 and a spot in the quarterfinals. He lost by a narrow margin, but the WSL took notice of his potential. \nFirst thing’s first \nBack in Costa Rica, Torres then hopped on the new Guanacaste Surf Circuit, a cash prize tournament set up at various beaches in that province. He won the championship and began again to eye a Qualifying Series rotation. This time, his sponsor O’Neill had a proposition: win a national championship and it would re-evaluate plans for Torres, including possible financial support for a run at the QS. \n“That was the extra motivation to have this title fight,” Torres admitted, referring to his return to the National Circuit. \nSee also: New generation of Costa Rican surfers puts sport in the spotlight \nAnd so, this year Torres began competing again in his home country with a whole new attitude – and a long list of supportive sponsors to boot, including O’Neill, Tsunami Sushi, BYD Autos, Freestyle, Creatures, Costa del Mar, and Wanted Dream . \nAt the first competition in Tamarindo, he set the tone for the whole circuit by winning first place. At subsequent events, Torres was a formidable competitor. It seemed he was finally able to get the right combination of surfing excellence, focus, self-control and maturity to win his coveted national championship. It helped that his wife, Merary, and son, Jaziel, were on the beach rooting for him at every contest. \nIn June, Jason participated in the ISA World Surfing Games in Popoyo, Nicaragua, where he helped Costa Rica earn its first team gold medal. One member of that winning team was Lisbeth Vindas, Costa Rica’s 12-time national women’s champion, and Torres’ lifelong cheerleader. She, too, is beaming with pride at what her friend has been able to accomplish. \nJason Torres at the 2015 Grand Reef Final in Playa Hermosa, July 19, 2015. (Courtesy Alfredo Barquero) \n”I’m very, very happy that he finally became a national champion of Costa Rica because he tried for so many years. He really deserved that because so many times he was so close, and at the last minute something happened and someone else ended up winning,” she said. “That’s how the sport is. Something will happen when it’s supposed to happen and I think this was the right moment for him. I hope he’ll keep surfing because he’s an amazing athlete.” \nNow, finally, with the Costa Rica national championship in hand, Torres hopes to take the next step in his professional journey with a visit to the United States. There he’ll sit down with O’Neill representatives in hopes of finally getting sponsorship to jump to the World Surf League Qualifying Series, a place where he thinks he should have been competing five or six years ago. \nIn preparation for the day he hits the series, Torres says he’s always training, staying focused, sleeping well. \n“After all,” I’m trying to have the chance to compete with the best people in the world,” he said. \nPilurzu agrees that Torres should be competing for the top international circuit. \n“I’m surprised that Jason is not in the best position of the QS or WCT (World Championship Tour) because he has so much talent. He was coming up when Carlos Muñoz was just a little boy.” Muñoz is currently Costa Rica’s highest ranked surfer on the QS. \nEven though Pilurzu has left the Costa Rica Surf Federation, he says he’s watched video of Torres’ recent competitions on the Internet. “Every time I see him I ask myself, ‘why is he not at the top of the world’s surfers?’” \nTorres may very well be headed in that direction. \nVindas also thinks her friend and teammate has a bright future. She’s particularly proud of him for overcoming his personal difficulties in the early part of his life. \n“In his journey, he had good things, tough things, but he’s a good example for the kids and teenagers of wanting to reach a goal in life,” Vindas said, “(showing) you can change and do it. He has a lot of love in life, he’s a great dad, husband, surfer. He’s a champion.”", "external_links": [], "published": "2015-08-11T12:30:00.000+03:00", "crawled": "2015-08-11T14:47:23.058+03:00", "highlightTitle": ""}