{"organizations": [], "uuid": "58a05e59555eae602f2ff4c6b20b1fa507911eb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62968/springhill-suites-hotel-opens-houston", "country": "US", "title": "SpringHill Suites Hotel opens in Houston", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "SpringHill Suites Hotel opens in Houston", "spam_score": 0.0, "site_type": "news", "published": "2015-08-25T02:16:00.000+03:00", "replies_count": 0, "uuid": "58a05e59555eae602f2ff4c6b20b1fa507911eb4"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62968/springhill-suites-hotel-opens-houston", "ord_in_thread": 0, "title": "SpringHill Suites Hotel opens in Houston", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SpringHill Suites Hotel opens in Houston   \nAug 24, 2015   \nHOUSTON, TX - The 167-suite SpringHill Suites by Marriott in Downtown Houston, Texas, opened today. Located at 914 Dallas Street, Houston, TX, 77002, the SpringHill Suites Houston Downtown/Convention Center will operate as a Marriott franchise, owned by RLJ Lodging Trust of Bethesda, Maryland, and managed by White Lodging Services of Merrillville, Indiana. \nIn downtown Houston, eight miles from Hobby Airport (HOU) and 21 miles from George Bush Intercontinental Airport (IAH), the hotel offers guests convenient access to the George. R. Brown Convention Center, as well as being walking distance to Minute Maid Park, home of the Houston Astros, and Toyota Center home of the Houston Rockets. \n\"We're delighted that the SpringHill Suites Houston Downtown is the latest addition to our growing number of properties across the United States,\" said Loren Nalewanski, vice president and global brand manager, SpringHill Suites. \"The hotel's design provides a seamless blend of style and function at an affordable price, and our all-suite offering allows guests enough room to relax and reenergize.\" \nFeaturing suites that are larger than typical hotel rooms, SpringHill Suites Houston Downtown / Convention Center is ideal for business and leisure travelers looking for style and inspiration in their stay. \nThe building is in the previous home of the Humble Oil Building, built in 1921. The building was listed on the national register of Historic Places in 1999. Every aspect, from furniture and lighting to colors and fabrics, has been carefully selected to offer calm and refreshing spaces, while preserving the original windows and facade. Separate living, working and sleeping spaces also provide guests with flexibility and functionality. The perfect place to sink into a good night's sleep, the hotel offers luxurious linens and plush pillows, while a comfortable pullout sofa bed and lounge chair offer additional space for relaxation or extra family members. The hotel's tasteful bathroom includes modern touches, a marble-top vanity, iridescent tile walls and creative lighting features, which help travelers revive and refresh. \nBusiness travelers can take advantage of a large, well-lit desk with ergonomic chair. Complimentary Wi-Fi in the hotel's lobby and high-speed Internet access in every suite allow guests to remain connected at all times. \nFeaturing a brand new design that adds depth and sophistication to the decor, the lobby is a great venue for conducting casual meetings or simply to socialize. Using warm colors, accent fabrics and walnut-stained wood, the lobby's earth tones inspire guests to sit, relax and enjoy their stay. The hotel also offers business services, same-day dry cleaning, guest laundry facilities, an outdoor swimming pool with whirlpool and a fitness center. In the lobby, the Market offers convenient 24/7 access to food and beverages. \nA daily complimentary hot breakfast buffet is SpringHill Suites' way of making sure guests have a good start to their day. The property also has 2,133 square feet of meeting space to accommodate meetings and functions of up to 100 people. \nSpringHill Suites by Marriott is an all-suite brand that offers design and style at an affordable price, appealing to both business and leisure travelers. Ranked highest in the Guest Satisfaction Study for the Upscale Brand Segment by J.D. Power and Associates' 2012 North America Guest Satisfaction Index Study, the brand features spacious suites and smart layouts that allow guests to relax and reenergize. Launched in 1998, the brand currently has nearly 300 locations in the United States and Canada. SpringHill Suites participates in the award-winning Marriott Rewards® frequent travel program that allows members to earn hotel points or airline miles for every dollar spent during each stay.", "external_links": [], "published": "2015-08-25T02:16:00.000+03:00", "crawled": "2015-08-25T03:12:11.625+03:00", "highlightTitle": ""}