{"organizations": [], "uuid": "645d59468282e647f2dcdd0778996a3fc07cd5a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/airportairline/28372-delta-increases-flights-to-the-bahamas", "country": "US", "title": "Delta increases flights to The Bahamas", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Delta increases flights to The Bahamas", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T15:30:00.000+03:00", "replies_count": 0, "uuid": "645d59468282e647f2dcdd0778996a3fc07cd5a3"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/airportairline/28372-delta-increases-flights-to-the-bahamas", "ord_in_thread": 0, "title": "Delta increases flights to The Bahamas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Delta increases flights to The Bahamas Delta increases flights to The Bahamas Details Category: Airport & Airline   13:30 The Exumas, an archipelago of 365 cays and islands in The Bahamas, are an exotic collection of dream destinations and home to the world famous swimming pigs. The Exumas are now even easier to get to as Delta Air Lines has recently announced increasing the non-stop flights from their Atlanta Hartsfield-Jackson Airport to George Town. Exuma. Starting in December, the three flights per week will be increased to daily services. \nExuma International Airport’s New Schedule: Delta’s Atlanta to George Town (Exuma International Airport) schedule: Flight Number DL 5607 Departs: Atlanta (ATL) at 10:15 a.m. Arrives: George Town (GGT) at 12:35 p.m. Frequency: Daily Departs: George Town (GGT) at 1:24 p.m. Arrives: Atlanta (ATL) at 3:55 p.m. Frequency: Daily Effective: December 19, 2015 Surrounded by sapphire-blue water everywhere and with so many cays and islands, both inhabited and uninhabited, to discover – one for each day of the year! – The Exumas are a popular spot for yachting, sailing, diving, coral reef and cave exploring. Split into three major areas: Great Exuma, Little Exuma and The Exuma Cays, each provides its own unique Bahamian experience. Great Exuma and Little Exuma are known for their laid-back surrounding, while The Exuma Cays boast numerous private homes, luxury resorts and beachside condos and is a haven for yachtsmen. A popular activity is to swim with the ‘domesticated’ pigs that live on the uninhabited Major’s Spot Cay. While it is uncertain on how this pack of pigs came to live on the island, they have become the welcoming committee for visitors arriving to the Island, by swimming out to their boats. Visitors who venture out to join the pigs in the water, get the opportunity to swim and play with them. Among the most recent celebrities to enjoy the unusual and unique pastime are actress Gabrielle Union and her husband, Miami Heat’s star basketball player Dwayne Wade. For those interested in exploring the authentic Bahamian culture, in George Town there is the famous Chat ‘N’ Chill bar; a volleyball beach bar and grill, that is an international playground for visitors from around the world. At the popular spot, guests enjoy the casual laid-back atmosphere, menu of grilled island foods, tropical drinks, 6 volleyball courts and over 1,000 feet of pristine white sand beach. Also shoes are never required. An ‘Out Island’ in of itself, the only way to get to Chat ‘N’ Chill is by boat or seaplane. Ranked by TripAdvisor visitors as a top 5 activity in The Exumas, it is an experience not to be missed. Another not to be missed attraction is the Exuma Cays Land and Sea Park. The park spans 22 miles, and is the first park of its kind in the world, offering some of the best snorkeling and diving in the country, or for those preferring land activities there are hiking trails and birding sites. For the more adventurous, there are opportunities to swim with dolphins and sharks! Wildlife also thrives throughout the Exumas. There is Moria Harbour Cay National Park which is a vital part of the ecosystem between Great and Little Exuma. This park includes sand dunes, beaches, mangroves and sea grass beds that are home to nesting seabirds and nursery for marine life. Back on the mainland, George Town, Visitors have their pick of local artwork at the popular Sandpiper Arts&Crafts shop, which is filled with authentic Bahamian souvenirs. Shoppers can also peruse the Straw Market that features items from individual vendors and artisans from straw goods including beautiful baskets and other handcrafts such as jewelry and art. Related articles", "external_links": [], "published": "2015-08-20T15:30:00.000+03:00", "crawled": "2015-08-20T16:35:09.556+03:00", "highlightTitle": ""}