{"organizations": [], "uuid": "fe41408eddbf8a8ad0ec302abedce7c5dbe793c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62184/brush-fires-rage-hawaii", "country": "US", "title": "Brush fires rage in Hawaii", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Brush fires rage in Hawaii", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T06:45:00.000+03:00", "replies_count": 0, "uuid": "fe41408eddbf8a8ad0ec302abedce7c5dbe793c9"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/62184/brush-fires-rage-hawaii", "ord_in_thread": 0, "title": "Brush fires rage in Hawaii", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brush fires rage in Hawaii Adv: \nBy Linda Hohnholz, eTN editor | Aug 04, 2015 Photo © Linda Hohnholz Adv: \nWahiawa is a small country town of around 18,000 residents that tourists pass through every day on their way to the famous North Shore in Hawaii. Mostly just a place to drive through as visitors head to the famous beaches on the island of Oahu, right now it is surely not to be missed, as it is filled with smoke and flying ash from two major brush fires. \nAn initial brush fire began on Saturday in the hills of Wahiawa known simply as the “heights” about a mile away from the highest homes in the area. The fire was burning in a deep ridge, making it difficult for firefighters to reach, so efforts to douse the flames had to be done by helicopters carrying loads of water. \nStrong tradewinds, however, fanned the flames and increased the power of the fire, which has so far scorched at least 75 acres of the area known as the Ewa Forest Reserve. The following day, a new brush fire also began, hopping over even closer to homes in the quiet little town. \nSo far 14 fire companies have been on the scene along with 3 helicopters and 43 personnel. No homes have had to be evacuated yet, although flames are visible from many of the houses. \nIt was also reported that today, Monday, August 3, 2015, yet another brush fire has erupted on the other side of Wahiawa, a town ironically surrounded on three sides by a man-made reservoir – Lake Wilson - developed for farming activities, especially during the heydays of the Dole pineapple plantations. To get into and out of Wahiawa, one must travel over one of two (or both) bridges. \nAccording to reports, the fire is visible to drivers along a portion of the freeway that heads into the town. \nWahiawa is located on the central plateau of Oahu between the island’s two mountain ranges – the Waianae range to the west and Koolau range to the east. Its name means “place of noise,” as it is said that in ancient Hawaii, before the development of modern-day things that drown out the sounds of nature, like cars and electricity, one could hear the roar of the ocean as the sound traveled between the two mountain ranges. \nSee raw video footage of the fire here.", "external_links": [], "published": "2015-08-04T06:45:00.000+03:00", "crawled": "2015-08-04T06:16:41.217+03:00", "highlightTitle": ""}