{"organizations": [], "uuid": "db6fb42d1aecd9803cf16e21188264f4eb407ff7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29881202/new-car-sales-to-drop-4-percent-in-august-2015-according-to-kelley-blue-book", "country": "US", "title": "New-Car Sales To Drop 4 Percent In August 2015, According To Kelley Blue Book", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New-Car Sales To Drop 4 Percent In August 2015, According To Kelley Blue Book - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "db6fb42d1aecd9803cf16e21188264f4eb407ff7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29881202/new-car-sales-to-drop-4-percent-in-august-2015-according-to-kelley-blue-book", "ord_in_thread": 0, "title": "New-Car Sales To Drop 4 Percent In August 2015, According To Kelley Blue Book", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Kelley Blue Book\n2015 Labor Day Timing to Impact Results; Fiat Chrysler Sales Streak to End\nIRVINE, Calif. , Aug. 26, New-vehicle sales are expected to decline 4 percent year-over-year to a total of 1.52 million units in August 2015 , resulting in an estimated 17.2 million seasonally adjusted annual rate (SAAR), according to Kelley Blue Book www.kbb.com , the only vehicle valuation and information source trusted and relied upon by both consumers and the automotive industry. Industry sales are expected to decline in comparison to this time last year because auto sales from Labor Day weekend in 2014 were included in last year's August results. This year, the Labor Day weekend sales days will be included in the September 2015 results, so the shift in the timing of Labor Day this year impacts the year-over-year results.\n\"While the outlook for August remains bright, we must keep an eye on the financial markets which have declined precipitously in the last few weeks on uncertainty in international markets, namely China ,\" said Alec Gutierrez , senior analyst for Kelley Blue Book. \"We remain confident that sales in August will remain robust; however, should the U.S. financial markets continue to falter, we could see demand for new cars soften in the short to medium term. It should be noted that the unemployment rate in the U.S. remains below 6 percent, while the auto finance environment remains as attractive as ever, so we don't necessarily expect to see the sales pace deviate from its current 17 million-plus SAAR trajectory for 2015 unless the stock market continues its downward trajectory in the weeks and months to come.\"\nKey Highlights for Estimated August 2015 Sales Forecast:\nIn August 2015 , new light-vehicle sales, including fleet, are expected to reach 1,520,000 units, down 4 percent from August 2014 and up 0.8 percent from July 2015 . The seasonally adjusted annual rate (SAAR) for August 2015 is estimated to be 17.2 million, even with August 2014 and down from 17.5 million in July 2015 . Retail sales are expected to account for 88.8 percent of volume in August 2015 , up from 88.2 percent in August 2014 . Fiat Chrysler Sales Streak to End; F-150 Could Help Ford Buck Decline Trend\n\"This could be the end of Fiat Chrysler Automobile's streak of consecutive monthly sales increases, which began in March 2010 , as Kelley Blue Book projects a 3.2 percent decline in volume,\" said Gutierrez. \"However, the automaker is still having an incredible year of growth with the highest year-to-date sales increase of all major manufacturers.\"\nDue to the exclusion of Labor Day in this month's sales results, Kelley Blue Book expects most automakers to report sales decline in August. One manufacturer that could buck this trend is Ford , with its F-150 growing both in sales and available inventory, following a slow launch earlier this year. Ford F-Series sales, the best-selling nameplate in the country, are down 1.3 percent through July.\nSales Volume 1\nMarket Share 2\nManufacturer\nAug-15\nAug-14\nYOY %\nAug-15\nAug-14\nYOY %\nGeneral Motors (Buick, Cadillac, Chevrolet, GMC)\n258,000\n272,423\n-5.3%\n17.0%\n17.2%\n-0.2%\nFord Motor Company (Ford, Lincoln)\n222,000\n221,373\n0.3%\n14.6%\n14.0%\n0.6%\nToyota Motor Company (Lexus, Scion, Toyota)\n221,000\n246,100\n-10.2%\n14.5%\n15.5%\n-1.0%\nFiat Chrysler (Chrysler, Dodge, FIAT, Jeep, RAM)\n192,000\n198,379\n-3.2%\n12.6%\n12.5%\n0.1%\nAmerican Honda (Acura, Honda)\n154,000\n167,038\n-7.8%\n10.1%\n10.6%\n-0.4%\nNissan North America (Infiniti, Nissan)\n128,000\n134,388\n-4.8%\n8.4%\n8.5%\n-0.1%\nHyundai-Kia\n124,000\n124,670\n-0.5%\n8.2%\n7.9%\n0.3%\nVolkswagen Group (Audi, Volkswagen, Porsche)\n55,000\n56,822\n-3.2%\n3.6%\n3.6%\n0.0%\nTotal 3\n1,520,000\n1,582,675\n-4.0%\n-\n-\n-\n1 Historical data from OEM sales announcements\n2 Kelley Blue Book Automotive Insights\n3 Includes brands not shown\nCompact Utility Segment Continues Reign, While Car Segment Market Share Continues Decline\n\"Kelley Blue Book anticipates that the compact utility segment will top all others in August. With a host of new models at price points around $20,000 , and with gas prices remaining reasonable, this segment has never been more popular,\" said Gutierrez. \"As a result of moderate gas prices and increased interest in utility vehicles, we expect market share for cars to fall once again in August. Year-to-date, sales of cars comprise 44.5 percent of the market, whereas they made up 47.3 percent of sales last year.\"\nSales Volume 1\nMarket Share\nSegment\nAug-15\nAug-14\nYOY %\nAug-15\nAug-14\nYOY %\nCompact SUV/Crossover\n225,000\n208,821\n7.7%\n14.8%\n13.2%\n1.6%\nMid-Size Car\n221,000\n244,021\n-9.4%\n14.5%\n15.4%\n-0.9%\nCompact Car\n212,000\n229,196\n-7.5%\n13.9%\n14.5%\n-0.5%\nFull-Size Pickup Truck\n188,000\n194,003\n-3.1%\n12.4%\n12.3%\n0.1%\nMid-Size SUV/Crossover\n164,000\n168,202\n-2.5%\n10.8%\n10.6%\n0.2%\nTotal 2\n1,520,000\n1,582,675\n-4.0%\n-\n-\n-\n1 Kelley Blue Book Automotive Insights\n2 Includes segments not shown\nThere are 26 sales days in August 2015 , compared to 27 sales days in August 2014 . All percentages are based on raw volume, not daily selling rate.\nTo discuss this topic, or any other automotive-related information, with a Kelley Blue Book analyst on-camera via the company's on-site studio, please contact a member of the Public Relations team to book an interview.\nFor more information and news from Kelley Blue Book's KBB.com, visit www.kbb.com/media/ , follow us on Twitter at www.twitter.com/kelleybluebook (or @kelleybluebook), like our page on Facebook at www.facebook.com/kbb , and get updates on Google+ at https://plus.google.com/+kbb .\nAbout Kelley Blue Book ( www.kbb.com )\nFounded in 1926, Kelley Blue Book, The Trusted Resource® , is the only vehicle valuation and information source trusted and relied upon by both consumers and the automotive industry. Each week the company provides the most market-reflective values in the industry on its top-rated website KBB.com, including its famous Blue Book® Trade-In Values and Fair Purchase Price, which reports what others are paying for new and used cars this week. The company also provides vehicle pricing and values through various products and services available to car dealers, auto manufacturers, finance and insurance companies, and governmental agencies. Kelley Blue Book's KBB.com ranked highest in its category for brand equity by the 2015 Harris Poll EquiTrend ® study and has been named Online Auto Shopping Brand of the Year for four consecutive years. Kelley Blue Book Co., Inc. is a Cox Automotive company.\nLogo - http://photos.prnewswire.com/prnh/20121108/LA08161LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-car-sales-to-drop-4-percent-in-august-2015-according-to-kelley-blue-book-300133246.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.kbb.com/new-cars/", "http://photos.prnewswire.com/prnh/20121108/LA08161LOGO", "http://www.prnewswire.com/news-releases/new-car-sales-to-drop-4-percent-in-august-2015-according-to-kelley-blue-book-300133246.html", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnvar/20121108/LA08161LOGO", "http://www.facebook.com/kbb", "http://www.kbb.com/ford/", "http://www.twitter.com/kelleybluebook", "https://plus.google.com/+kbb", "http://www.kbb.com/media/", "http://www.kbb.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA86880&Transmission_Id=201508260500PR_NEWS_USPR_____LA86880&DateId=20150826", "http://www.kbb.com/ford/f150-regular-cab/"], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T13:31:35.229+03:00", "highlightTitle": ""}