{"organizations": [], "uuid": "657d40ddddc73e8530ba867b31be1af52d77b634", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63152/omans-police-issues-safety-warning-after-tourists-hiking-death", "country": "US", "title": "Oman's police issues safety warning after tourist's hiking death", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Oman's police issues safety warning after tourist's hiking death", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T21:34:00.000+03:00", "replies_count": 0, "uuid": "657d40ddddc73e8530ba867b31be1af52d77b634"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63152/omans-police-issues-safety-warning-after-tourists-hiking-death", "ord_in_thread": 0, "title": "Oman's police issues safety warning after tourist's hiking death", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oman's police issues safety warning after tourist's hiking death   \nAug 30, 2015 eTN   \nMUSCAT, Oman - Hikers exploring unmarked terrain in the mountains and valleys of Oman should be escorted by experienced guides, warned police and experts following the death of a British woman who went missing in Wadi Sameeni near Mhadha, Buraimi, on Saturday. \n“Safe trekking paths on mountains in Oman are marked by the Ministry of Tourism. Those paths that are unmarked are unsafe. Hiking on those unmarked mountain trails should be done only with the help of guides who have safety gears, or else hikers will be risking their lives,” said Khalid Al Anqoodi, an experienced mountaineer who leads bi-weekly group hikes for the Oman Mountain Club and has scaled several mountains in and around the region, during an interview with the Times of Oman. \nThe British woman, belonging to a 12-member hiking group including Arab and non-Arab nationals, had gone missing on Saturday evening in the mountains of Wadi Sameeni near Mhadha. \nThe Royal Oman Police (ROP)found the woman’s body on Sunday morning after an extensive search was launched with the help of helicopters. \nAn official from the Public Authority of Civil Defence and Ambulances (PACDA) described the area as “a mountainous and rocky region where people can get lost easily if they don’t know the area”. \n“These kinds of trips are risky. Adventurers should always go in a group with people who are experienced in these kinds of ventures. They should also collaborate with people who are not part of the group by using social media and let people know where they are. When you feel you are in danger, call the police immediately,” said the official. \nOn Saturday evening, four of the 12-member group were initially reported missing. However, by late in the evening police had rescued three of the hikers. \n“Adventure tourists should seek help from a licensed tour guide who is an expert in the field before starting a trip, rather than just googling and hiring inexperienced guides. The Ministry of Tourism has clearly posted all marked trekking sites in Oman on their websites. Tourists should follow those, rather than risking their lives,” said Sajad Ahmed, a registered tour guide for nine years at Universal Travels and Tours in Oman. \n“The ministry even provides training for tour guides who want to lead adventure tourists,” Sajad added. The three recognised trekking paths in Oman, according to the ministry, are paths to the southern summit of Jabal Shams from ‘The Plateau’, a path to Mutrah or Riyam and a path to the western Hajar Mountains. \nIn Oman, the official trekking season runs from September to May, but the best time for hiking is between October and April. \nDespite the rough terrain, hiking remains the best way to enjoy the Sultanate’s striking mountainous sites.", "external_links": [], "published": "2015-08-30T21:34:00.000+03:00", "crawled": "2015-08-30T23:08:34.390+03:00", "highlightTitle": ""}