{"organizations": [], "uuid": "d8389390a1aabddf0a178b693c510e71bae7b4d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/02/Hilton-Worldwide-300x107.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/curio-a-collection-by-hilton-celebrates-brands-first-hotel-in-midwest-with-opening-of-hotel-alex-johnson-in-south-dakota/", "country": "US", "title": "Curio – A Collection by Hilton Celebrates Brand’s First Hotel in Midwest with Opening of Hotel Alex Johnson in South DakotaTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Curio – A Collection by Hilton Celebrates Brand’s First Hotel in Midwest with Opening of Hotel Alex Johnson in South DakotaTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8389390a1aabddf0a178b693c510e71bae7b4d3"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/curio-a-collection-by-hilton-celebrates-brands-first-hotel-in-midwest-with-opening-of-hotel-alex-johnson-in-south-dakota/", "ord_in_thread": 0, "title": "Curio – A Collection by Hilton Celebrates Brand’s First Hotel in Midwest with Opening of Hotel Alex Johnson in South DakotaTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Curio – A Collection by Hilton Celebrates Brand’s First Hotel in Midwest with Opening of Hotel Alex Johnson in South Dakota\nA historic hotel with a blend of American Western, German and Native American culture, Hotel Alex Johnson Rapid City today joined Curio – A Collection by Hilton. As Hilton Worldwide’s rapidly-expanding global collection of distinctive hotels, Curio caters to passionate travelers seeking local discovery and authentic experiences. Located in the heart of downtown Rapid City and near Main Street Square, Hotel Alex Johnson Rapid City, Curio Collection by Hilton is located just steps from a variety of award-winning restaurants and some of the region’s most diverse shopping and entertainment venues.\n“Hotel Alex Johnson combines an ideal location with a historic setting for an authentic guest experience, and has also hosted six U.S. presidents and numerous celebrities and dignitaries,” said Dianna Vaughan, global head, Curio – A Collection by Hilton. “With its location just steps from the popular Art Alley – an iconic tribute to local artists and their creativity – and just a short drive from Mount Rushmore and all the iconic Black Hills have to offer, this beautiful hotel makes a perfect addition as the first Midwest property in our growing global collection of remarkable upscale and luxury hotels.”\nHotel Alex Johnson is a distinct hotel exuding modern flare, while at the same time paying tribute to the unique history of the region. Built in 1928, this boutique upscale hotel combines the ambiance of the late 1920s with regional art. This includes carefully-restored bricks in the lobby and hand-painted Sioux designs and ‘four sacred directions’ symbols, a tribute to the area’s Native American culture and beliefs.\nGuests can relax in one of 143 spacious guest rooms that include vibrant views of Main Street Square and a vibrant outdoor entertainment venue. Built by railroad magnate Alex Johnson, the hotel is reflective of Johnson’s German heritage and love of the Sioux culture. Guest rooms combine modern conveniences with historic charm, including complimentary WiFi, 42-inch flat-screen TVs, luxurious and plush linens and coffeemakers. Additional highlights include a newly-renovated 24-hour fitness center with Life Fitness Equipment, as well as an ideal location just two blocks away from Founder’s Park offering access to more than 10 miles of running and hiking trails.\n“Our storied history and setting in the heart of downtown Rapid City – along with the reassurance that comes with the iconic Hilton name – will truly set us apart from other offerings in the market,” said Caleb Arceneaux, CEO, Liv Hospitality, LLC. “During their stay at Hotel Alex Johnson, our guests will not only experience the tremendous pride and passion our talented team has for our city, but they will also be intrigued to make new discoveries that are truly unforgettable.”\nThe hotel features three unique and dynamic dining options, including:\nA full service Starbucks in the lobby offering spacious, inviting gathering areas and a cozy fireplace. Guests can choose from an array of sandwiches, pastries and other Starbucks favorites. Paddy O’Neills Pub offers guests a traditional atmosphere with all the comforts of a neighborhood pub. Live entertainment, 24 tap beers and a time-honored juke box set the backdrop for the perfect casual gathering spot. Signature dishes include Paddy’s award-winning Signature Hot Wings and Paddy’s Signature Shepherd’s Pie. Vertex Skybar is the hotel’s private, upscale rooftop venue featuring indoor and outdoor seating with sweeping views of the downtown Rapid City skyline and the Black Hills. Open exclusively to hotel guests and members, Vertex Skybar features an expansive cocktail and wine list, as well as a dinner menu with local favorites that include Panko-breaded deep fried Walleye Fingers and Buffalo Grilled Tenderloin.\nFor those seeking a memorable event, conference or wedding, Hotel Alex Johnson offers some of the biggest event space in the region with nearly 8,000 sq. ft. of flexible meeting space and a grand ballroom. Customized on-site catering and state-of-the-art audio/visual equipment will ensure every event – large or small – is a success.\nHotel Alex Johnson participates in Hilton HHonors, the award-winning guest-loyalty program for Hilton Worldwide’s twelve distinct hotel brands. Hilton HHonors Members always get our lowest price with our Best Price Guarantee, along with HHonors Points, free WiFi, digital check-in and no booking fees only when they book directly through Hilton. Gold and Diamond HHonors members staying at Hotel Alex Johnson will enjoy complimentary breakfast for up to two registered guests per room, space-available room upgrades and a Starbucks coffee voucher. To celebrate the opening, Hotel Alex Johnson is offering a special bonus of 1,000 Hilton HHonors points per night for stays through February 18, 2016 when booking the best available rate.", "external_links": [], "published": "2015-08-18T03:00:00.000+03:00", "crawled": "2015-08-18T20:51:43.021+03:00", "highlightTitle": ""}