{"organizations": ["Associated Press", "The Associated Press", "Red Sox", "AP"], "uuid": "86658f9b58f01a8507f15e49f60abdb193cfa5ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/101612_metals_mining9_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13240562/1/hitchhiking-robots-cross-country-trip-in-us-ends-in-philly.html?cm_ven=RSSFeed", "country": "US", "title": "Hitchhiking Robot's Cross-country Trip In US Ends In Philly", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Hitchhiking Robot's Cross-country Trip In US Ends In Philly", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T03:35:00.000+03:00", "replies_count": 0, "uuid": "86658f9b58f01a8507f15e49f60abdb193cfa5ee"}, "author": "", "url": "http://www.thestreet.com/story/13240562/1/hitchhiking-robots-cross-country-trip-in-us-ends-in-philly.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Hitchhiking Robot's Cross-country Trip In US Ends In Philly", "locations": ["San Francisco", "US", "East Coast", "Canada", "Massachusetts", "Philadelphia", "U.S", "Philly Reprint PHILADELPHIA", "Boston", "Europe", "Netherlands", "Marblehead"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Frauke Zeller"], "text": "Reprint PHILADELPHIA (AP) — A hitchhiking robot that captured the hearts of fans worldwide met its demise in the U.S. The Canadian researchers who created hitchBOT as a social experiment told The Associated Press that someone in Philadelphia damaged the robot beyond repair on Saturday, ending its first American tour after about two weeks. The kid-size robot set out to travel cross-country after successfully hitchhiking across Canada in 26 days last year and parts of Europe. It is immobile on its own so gets from place to place by relying on the kindness of strangers. It started in Marblehead, Massachusetts, on July 17 with its thumb raised skyward, a grin on its digital face and tape wrapped around its cylindrical head that read \"San Francisco or bust.\"It bounced around the Boston area and was briefly taken to sea. One day, it took in a Red Sox game. But hitchBOT never made it off the East Coast. The creators were sent an image of the vandalized robot Saturday but cannot track its location because the battery is dead. They said they don't know who destroyed it or why. But co-creator Frauke Zeller said many children who adored the robot are now heartbroken. hitchBOT was designed to be a talking travel companion and could toss out factoids and carry limited conversation. A GPS in the robot tracked its location, and a camera randomly snapped photos about every 20 minutes to document its travels. During past travels, the robot attended a comic convention and a wedding, and it had its portrait painted in the Netherlands. It once spent a week with a heavy metal band. Copyright 2014 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-08-02T03:35:00.000+03:00", "crawled": "2015-08-02T05:20:11.713+03:00", "highlightTitle": ""}