{"organizations": [], "uuid": "39c4a37f06dd8750184c37bc8df1e31ea35315a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/04/hbaa.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/mice-news/", "section_title": "MICE Travel | Meeting | Incentive | Conference | Exhibition | business travellers | MICE destinations | MICE industry | MICE tourism | Outbound MICETravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hbaa-ashfield-meetings-events-get-innovative-at-the-lab/", "country": "US", "title": "HBAA: Ashfield Meetings & Events Get Innovative At The LabTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "HBAA: Ashfield Meetings & Events Get Innovative At The LabTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "39c4a37f06dd8750184c37bc8df1e31ea35315a2"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hbaa-ashfield-meetings-events-get-innovative-at-the-lab/", "ord_in_thread": 0, "title": "HBAA: Ashfield Meetings & Events Get Innovative At The LabTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HBAA: Ashfield Meetings & Events Get Innovative At The Lab Published on : Thursday, August 20, 2015\nAshfield Meetings & Events is running their annual supplier networking and education event – The Lab – on Wednesday 19 August at Ashfield’s divisional UK headquarters in Ashby De La Zouch.\nThe Lab is an interactive event for UK staff dedicated to delivering continued professional development through a combination of sharing best practice, facilitated workshops, external speakers and exhibit environments. The event is designed to complement the existing award winning training programme in place at Ashfield Meetings & Events.\nLuke Flett (Global Head Of Marketing) commented: “This year the theme is ‘Innovation Through Collaboration’. We wanted to encourage collaborative behaviours that will drive the creative thinking that fuels innovative solutions. We will use the educational stream to further integrate SPARK THINKING brand philosophies within the agency and to connect the expertise across the Ashfield Healthcare Communications and Ashfield Insight & Performance businesses. In addition we will be blending teams from across the agencies as part of a team-building exercise based on idea generation.”\nFlett added: “The Lab’s content will also include a showcase of the latest technologies available to enhance event experiences. This will include a best practice case study of how working collaboratively with event technology suppliers can create new types of value for our clients.”\nAnother important component to The Lab is the exhibition environment, built on-site, that allows key suppliers across the venue finding and engagement supply chain to have the opportunity to interact with over 160 UK-based staff. Furthermore, suppliers have the opportunity to learn about Ashfield Meetings & Events’ future strategy and brand developments. This year the agency have over 30 suppliers attending.\nNicola Burns (Global Managing Director) commented: “Our suppliers are of huge importance to our business and the continued evolution of our offerings. We coordinate events such as The Lab to recognise this, share insight and understanding, and develop more collaborative relationships and strategic partnerships. The day is coordinated in a creative manner that ensures unrivalled access to our staff.”\nThe day will culminate in team-building activity followed by food and drinks in the office restaurant.\nSource:- HBAA", "external_links": [], "published": "2015-08-20T03:00:00.000+03:00", "crawled": "2015-08-21T01:34:08.327+03:00", "highlightTitle": ""}