{"organizations": [], "uuid": "6c50ea96c76da44bf92cef7fa2a9de90403e1458", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/rss/press-releases-1/168.xml", "section_title": "PR.com Press Releases: Travel Arrangement & Reservation Services News", "url": "http://www.pr.com/press-release/633943", "country": "US", "title": "SpiceRoads Adds More Departures to Popular Tours", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "SpiceRoads Adds More Departures to Popular Tours", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T10:00:00.000+03:00", "replies_count": 0, "uuid": "6c50ea96c76da44bf92cef7fa2a9de90403e1458"}, "author": "SpiceRoads Co., Ltd", "url": "http://www.pr.com/press-release/633943", "ord_in_thread": 0, "title": "SpiceRoads Adds More Departures to Popular Tours", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "RSS Feeds: SpiceRoads Adds More Departures to Popular Tours Bangkok, Thailand, August 21, 2015 --( PR.com )-- To keep up with growing demands, more scheduled tour dates have now been introduced, offering customers more choices and flexibility than ever!Due to increased demand, SpiceRoads now offers more departures on popular scheduled tours such as the epic Saigon to Hanoi, the multi-country Saigon to Bangkok, scenic Bicycling Bangkok to Phuket and wondrous Burma Adventure. What the tours involve: Saigon to HanoiAn epic cycle trip along the length of Vietnam, starting from bustling Saigon to the serene northern capital of Hanoi. The landscape is diverse and the history is interesting. One of the highlights of the tour includes exploring the picturesque ancient city of Hue and Hoi An.Days: 17 days / 16 nightsCost: US$3,150 (US$3,290 after Oct 1, 2015)2015: Sep 13 (guaranteed), Oct 11, Nov 8 (limited), Nov 22 (New), Dec 20 (guaranteed)2016: Jan 17, Feb 21, Mar 13, May 8Saigon to BangkokThis tour takes in three of Southeast Asia's most diverse and fascinating countries - Vietnam, Cambodia and Thailand. On this tour riders will travel on peaceful country back-roads through local villages and farms, enjoy a boat trip up the mighty Mekong river and explore the famous temples of Angkor.Days: 14 days / 13 nightsCost: US$2,6752015: Oct 4 (guaranteed), Nov 1 (limited), Nov 8 (limited), Nov 15 (New), Nov 29 (guaranteed), Dec 13,2016: Jan 3 (guaranteed), Jan 10 (guaranteed), Jan 17, Jan 31 (guaranteed), Feb 14 (guaranteed), Feb 28Bicycling Bangkok to PhuketA road ride from the capital of Thailand to the stunning beach resort island of Phuket. The resorts are fabulous, the seafood delicious and the roads are smooth, fast and with spectacular view of endless white sand beaches.Days: 10 days / 9 nightsCost: US$1,950 (US$2,050 after Oct 1, 2015)2015: Sept 20 (guaranteed), Oct 4, Oct 25 (limited), Nov 8 (New), Nov 22 (guaranteed), Dec 6, Dec 13 (guaranteed)2016: Jan 3 (guaranteed), Jan 24, Feb 14, Feb 28, Mar 13Burma AdventureExplore the country's most iconic areas on this cycle trip, including the ancient city of Bagan, stunning Mandalay and the picturesque Inle Lake where local fishermen row standing on a single-leg, whilst fishing - a truly spectacular sight!Days: 14 days / 13 nightsCost: US$3,750 (US $3,850 after Oct 1, 2015)2015: Sep 20, Oct 18, Nov 1 (guaranteed), Nov 29 (New), Dec 20 (guaranteed)2016: Jan 17, Feb 14, Mar 13, May 15Expert GuidesAll SpiceRoads tours are fully supported by air conditioned support vehicles with an endless supply of cold drinks and snacks and riders in need of a break are able to catch a ride at any time. The tours are led by their professionally licensed expert guides. And their knowledge of the route and area means that you are always “in the know”: not only in terms of distance and difficulty but also of the local culture, people and local places.For additional images or for more information contact sally@spiceroads.comAbout SpiceRoadsSpiceRoads is a specialist bicycle tour operator based in Bangkok offering a range of two-wheel tours in 28 destinations worldwide. SpiceRoads tours cater for every level of cyclist and range from day trips to complete country explorations. Participants are invited to join tours with fixed date departures scheduled throughout the year, while private or tailor-made tours can be arranged for groups or individuals on request. The highly professional operation employs experienced cycle guides to lead all tours and has a fleet of well-maintained mountain and road bikes and support vehicles. Contact Information", "external_links": [], "published": "2015-08-21T10:00:00.000+03:00", "crawled": "2015-08-21T17:26:05.724+03:00", "highlightTitle": ""}