{"organizations": ["Celebrate Dia de los Muertos in Mexico Celebrate Dia de los Muertos"], "uuid": "7c6876ff3fed246986e638324530b27accb642a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/news-release/2015/08/11/759719/10145606/en/photos/352872/35069/352872.jpg?lastModified=08%2F11%2F2015%2009%3A06%3A32&amp;size=2", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/08/11/759719/10145606/en/Celebrate-Dia-de-los-Muertos-in-Mexico.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "Celebrate Dia de los Muertos in Mexico", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Celebrate Dia de los Muertos in Mexico", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T16:05:00.000+03:00", "replies_count": 0, "uuid": "7c6876ff3fed246986e638324530b27accb642a6"}, "author": "", "url": "http://globenewswire.com/news-release/2015/08/11/759719/10145606/en/Celebrate-Dia-de-los-Muertos-in-Mexico.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "Celebrate Dia de los Muertos in Mexico", "locations": ["Mexico"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Celebrate Dia de los Muertos in Mexico Come and experience this Mexican tradition with Grand Velas Riviera Maya ET | Source: Velas Resorts photo-release \nMIAMI, Aug. 11,   There is no better time to visit Mexico than during the Día de los Muertos (Day of the Dead) celebrations in November. During this two-day holiday, Mexicans gather to remember the lives of their dearly departed family members and ancestors, build private altars called ofrendas, and visit graves with gifts such as sugar skulls and marigolds. In celebration of this vibrant and colorful tradition awarded Intangible Cultural Heritage of Humanity status by UNESCO, the five-star Grand Velas Riviera Maya, on Mexico's stunning Yucatan Peninsula, invites visitors to join in the festivities with an exclusive Día de los Muertos package. Valid from October 18th to November 16th, Día de los Muertos provides guests with an exclusive itinerary of tequila tasting, Mexican cooking classes, gourmet dining and spa time. As part of the experience, guests will enjoy a Mexican cooking class led by Ricardo de la Vega, the executive chef at Frida, the resort's award-winning Mexican restaurant, followed by a private dinner on their suite's terrace. Visitors will also have the opportunity to sample some of Mexico's finest tequilas and mezcals. The package includes complimentary tickets to the eco-archaeological park of Xcaret for The Festival of Life and Death on November 2nd, during which visitors will experience the Hanal Pixan ritual (food for the souls), as well as traditional Day of the Dead dishes and treats such as candied pumpkin and pan de muerto, skull making, art exhibitions, theatre and dance. Guestswill also receive$50 USD Spa Credit to spend at the resort's award-winning spa. They can indulge in the new Bacal Massage, an authentic Mayan treatment using one of Mexico's most sacred plants, corn. The Bacal Massage is part of the Spa's Journey Through Ancient Mexico menu, which also includes a Coffee and Cocoa Experience, Mayan Jade Facial and Mayan Shawl Massage. Día de los Muertos package starts from $5,600 USD based on two persons sharing and includes: Seven nights' accommodation in a Zen grand suite all inclusive 1 Cooking Class led by executive chef of Frida restaurant (Mexican cuisine) 1 Tequila Tasting 1 Private dinner at room terrace 50 USD Spa Credit Park entrance to Xcaret on November 2nd for The Festival of Life and Death Traditions Xcaret Roundtrip transportation Airport-Hotel-Airport. \nFor more reservations or more information on Grand Velas Riviera Maya, please email reservations@velasresorts.com, call 1-888-407-4869, or visit http://rivieramaya.grandvelas.com/ . About Grand Velas Riviera Maya: \nSet on 205 acres of pristine jungle and mangroves and with the finest white sand beach in the Riviera Maya, the AAA Five Diamond Grand Velas Riviera Maya is an ultra-luxury all-inclusive resort. Guests can choose among three separate ambiances in this Leading Hotel of the World, including adults only ocean-front, family friendly ocean view and a Zen-like tropical setting, embraced by the flora and fauna of the Yucatan Peninsula's jungle. All 539 designer-like suites are exceptionally spacious, more than 1,100 square feet each, all with balconies, and some with private plunge pools. All feature fully stocked mini bars, plasma TVs, wireless Internet access, L'Occitane amenities, artisanal tequila and Nespresso machines. Bathrooms deserve special mention with walk in glass shower, deep soaking Jacuzzi tubs and marble interior. Eight restaurants, including five gourmet offerings, present a tour of Mexico, Europe and Asia. Cocina de Autor, at the hands of the disciples of world celebrity chef Arzak, won the AAA Five Diamond Award, the only all-inclusive restaurant in the world to win this prestigious distinction. Grand Velas Spa, a Leading Spa of the World, is the region's largest spa sanctuary at more than 90,000 square feet, known for its authentic Mexican treatments, offerings from around world and signature seven-step water journey. Other features include 24-hour personal butler concierge, 24/7 insuite service, three swimming pools, two fitness centers, water sports, innovative kids club and teens lounge, Karaoke Bar, Koi piano bar and business center. The resort offers more than 91,000 square feet of meeting spaces and outdoor areas for events and has a 31,000-square-foot Convention Center, able to accommodate up to 2,700 guests. The resort has won numerous awards from Travel + Leisure, Conde Nast Traveler, USA Today, Tripadvisor's 2015 Certificate of Excellence, Best of the Best Spa by Virtuoso, U.S. News and World Report and Forbes.com; which named it one of the Top Ten Coolest All-Inclusive in 2012. Grand Velas Riviera Maya was built and is operated by Eduardo Vela Ruiz, majority owner, founder and president of Velas Resorts, with brother Juan Vela by his side, vice president of Velas Resorts. \nPhotos accompanying this release are available at:", "external_links": [], "published": "2015-08-11T16:05:00.000+03:00", "crawled": "2015-08-11T17:21:19.776+03:00", "highlightTitle": ""}