{"organizations": [], "uuid": "3d58b92754dd7d51c9428240d7471327feddb28f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150802JerusalemAttack01.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/08/02/teen-stabbed-at-gay-pride-march-dies-as-pressure-mounts-on-israel", "country": "US", "title": "Teen stabbed at Gay Pride march dies as pressure mounts on Israel", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Teen stabbed at Gay Pride march dies as pressure mounts on Israel", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T00:05:00.000+03:00", "replies_count": 0, "uuid": "3d58b92754dd7d51c9428240d7471327feddb28f"}, "author": "David Boddiger", "url": "http://www.ticotimes.net/2015/08/02/teen-stabbed-at-gay-pride-march-dies-as-pressure-mounts-on-israel", "ord_in_thread": 0, "title": "Teen stabbed at Gay Pride march dies as pressure mounts on Israel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Teen stabbed at Gay Pride march dies as pressure mounts on Israel Mike Smith | AFP From: To: \nIsraeli girls cry during a gathering of hundreds of friends, classmates, teachers, members of the gay community and supporters in downtown Jerusalem on Aug. 2, 2015 to mourn the death of Israeli Shira Banki, who was stabbed at the Jerusalem Gay Pride march. Gali Tibbon/AFP \nJERUSALEM – A teenager stabbed at a Gay Pride march died of her injuries Sunday as the attack and a firebombing that killed a Palestinian child put pressure on Israel to crack down on Jewish extremists. \nShira Banki, 16, was among six people stabbed at the Jerusalem march on Thursday by a suspect identified as an ultra-Orthodox Jew released from prison only weeks earlier for a similar attack. The five other victims suffered light injuries. \nBanki’s family said Shira had been murdered because “she came to support the rights of her friends and any person to live as they wish.” \n“For no reason and due to evil, stupidity and negligence, the life of our wonderful flower was cut off,” they said in a statement. \nHundreds of mourners, including classmates, teachers, members of the gay community and supporters, held a vigil for Banki at Zion Square near the spot where she was stabbed. \nThey lit candles while music she loved was played through speakers and pictures of her were projected on a large screen, an AFP photographer said. \nThe suspect of the attack, Yishai Shlissel, had stabbed and wounded three people at the 2005 Gay Pride march in Jerusalem. He served 10 years in prison and was released just three weeks ago. \nBefore the latest assault he posted a letter on the Internet speaking of the “abomination” of a Gay Pride parade being held in the Holy City and the need to stop it. \nPolice formed a committee following harsh criticism over how Shlissel — who has told the court he did not accept its authority — was allowed near the march so soon after his release from jail. \nOn Friday morning, hours after the march, assailants suspected of being Jewish settlers firebombed a Palestinian family’s home in the West Bank, killing an 18-month-old toddler. \nThe attacks have put a spotlight on Jewish extremists, and the firebombing further inflamed tensions between Israelis and Palestinians, with clashes breaking out in various cities. \nOn Sunday morning, Palestinian protesters clashed with Israeli police at Jerusalem’s Al-Aqsa mosque, one of Islam’s holiest sites, though calm was later restored. \nPrime Minister Benjamin Netanyahu condemned both attacks and called the firebombing “terrorism”— a word usually used by Israelis to refer to violence by Palestinians. On Sunday, he spoke of “zero tolerance” for such acts. \nIsraeli security forces block Palestinian protesters from using a road leading to the annexed east Jerusalem Al-Aqsa mosque compound on Aug. 2, 2015 as they take part in a demonstration against the death of an 18-month-old child killed in an arson attack in the occupied West Bank earlier in the week. Clashes broke out across the country two days after a Palestinian toddler was burned alive in a firebombing by suspected Jewish extremists. Ahmad Gharabli/AFP \nNo arrests \nMany have accused Netanyahu’s government of failing to address the problem of Jewish extremism and of going dangerously far in its support for right-wing settler groups. \n“Those who incite against Israel’s Arab citizens should not be surprised when churches and mosques are set on fire, and when finally a baby is burned in the middle of the night,” ex-president Shimon Peres told an anti-violence rally in Tel Aviv on Saturday night. \nHis comments were seen as at least partly directed at Netanyahu, who on election day in March caused outrage when he warned that Arabs were being mobilized “in droves” to the ballot boxes. \nWhile Netanyahu and others have sought to avoid further escalation since the arson attack, no arrests have been announced. \nThe firebombing which killed 18-month-old Ali Saad Dawabsha also left his parents and 4-year-old brother critically wounded. \nThe family’s small brick and cement home in the village of Duma was gutted by fire, while a Jewish Star of David was spray-painted on a wall along with the words “revenge” and “long live the Messiah.” \nSome have speculated that the attack was revenge for the demolition of two buildings in a settlement last week. \n‘Ideological crimes’ \nOn Sunday, Defense Minister Moshe Yaalon authorized the use of a controversial detention procedure — generally reserved for Palestinians — for suspects in the firebombing. \nThe procedure, known as administrative detention, allows suspects to be held indefinitely without charge, theoretically to allow investigators to gather evidence while preventing further attacks. \nIsrael has been accused of abusing the procedure to keep militants behind bars without trial. \nAccording to Israeli human rights group Yesh Din, some 85 percent of cases involving “ideological crimes” are closed due to investigative failures with no charges filed. \nNetanyahu said Sunday he had “instructed security and law enforcement officials to use all legal means at their disposal” to deal with the suspects in both attacks. \n“We are determined to vigorously fight manifestations of hate, fanaticism and terrorism from whatever side,” he said.", "external_links": [], "published": "2015-08-03T00:05:00.000+03:00", "crawled": "2015-08-03T00:45:28.437+03:00", "highlightTitle": ""}