{"organizations": [], "uuid": "6d8ad6881d80a830aab3a651576137ba0430195f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03386/Laser_eye_surgery__3386534a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-07.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/health/optical-express-opticians/11750626/natasha-smith-laser-eye-story.html", "country": "US", "title": "'After having laser eye surgery I had 20/20 vision'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "'After having laser eye surgery I had 20/20 vision' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T22:35:00.000+03:00", "replies_count": 0, "uuid": "6d8ad6881d80a830aab3a651576137ba0430195f"}, "author": "Helen Pickles", "url": "http://www.telegraph.co.uk/sponsored/health/optical-express-opticians/11750626/natasha-smith-laser-eye-story.html", "ord_in_thread": 0, "title": "'After having laser eye surgery I had 20/20 vision'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Learn more about laser eye surgery » Natasha Smith is not a pushover when it comes to laser eye surgery; she spent 12 years making up her mind. Finally, this year, aged 40 and having worn glasses and contact lenses for more than 20 years to correct her short sight, she took the plunge with Optical Express. She now wonders why it took her so long. Married and with two teenage children, Natasha lives in south-east London and works as a medical receptionist for the NHS. “Wearing glasses was a pain. When I went running with the dog when it was drizzling, I either couldn’t see because my glasses steamed up or I was forever pushing them up my nose. I had to wear them for work as I use a computer, and my eyes tended to dry out if I wore my lenses. I’d also wear them for early-morning runs as it was a fiddle to put in lenses. I’d change to lenses for going out socially, or if I was doing longer runs. “I’d thought about laser surgery on and off for about 12 years but dismissed it as being risky. Plus I had young children and thought if I lost my sight I wouldn’t see them growing up. But when I got to 40, I began to feel frumpier with glasses. The most surprising thing was discovering how easy the whole process is. You don’t even need recovery time “Optical Express offered a free consultation so I thought I might as well find out if I was eligible, plus I could discuss my concerns. Everything was explained in layman’s terms. My main worry was the danger of something going wrong and my losing my sight, or it ending up being worse and still having to rectify it with glasses. But I discovered there was actually more chance of an infection wearing contact lenses. “After waiting 12 years, I suddenly wanted to get it done as fast as possible. All my fears had gone. Because of work, and because you’re advised not to use public transport for a day or so, I chose to have it done on a Friday, so I could be back at work on the Monday. “On the morning I was a lot less anxious than I expected. They first carried out tests to check nothing had changed. Each eye takes less than 30 seconds, and the whole process around 15 minutes. Every step was explained, from putting in the drops to numb my eyes to counting down before they do the procedure. It felt very controlled and there was no pain, no discomfort, just a slight pressure. “Afterwards, my eyes felt a bit hazy. They give you a goodie bag with three different eye drops to be taken four times a day, plus goggles so you can’t accidentally scratch your eyes at night. I did as they suggested and went straight home to bed. I feel more confident, less frumpy and I can go out for a run without thinking “I had some discomfort and pain after the anaesthetic wore off but nothing that concerned me. The next day, when I went to the clinic to have my eyesight checked, I had 20/20 vision. I couldn’t believe that at 9.50am I had perfect sight even though I’d only had surgery at 4pm the day before. My eyesight now is sharper than when I wore glasses or lenses. “I feel more confident, less frumpy and I can go out for a run without thinking. If I go swimming, I don’t have to worry about getting water in my eyes or worry where my children are because I can’t see. I don’t squint as much and everything has been enhanced. “Downsides? I haven’t seen any yet. The most surprising thing was discovering how easy the whole process is. You don’t even need recovery time. “My recommendation is not to leave it 12 years like I did. Go for the free consultation: at least you’ll know if it’s a reality.” • Search Optical Express for more information on laser eye surgery", "external_links": [], "published": "2015-08-07T22:35:00.000+03:00", "crawled": "2015-08-07T19:53:35.700+03:00", "highlightTitle": ""}