{"organizations": ["Nazis", "Church of Peace", "UNESCO"], "uuid": "cd4540b073232d387b91791f4e57e44cd5f78da7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/188", "section_title": "Artipot: Travel > Destinations Articles", "url": "http://www.artipot.com/articles/1922541/trips-around-wroclaw-and-in-lower-silesia-region.htm", "country": "US", "title": "Trips around Wroclaw and in Lower Silesia region (Chris F Malecki)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Trips around Wroclaw and in Lower Silesia region (Chris F Malecki)", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T10:03:00.000+03:00", "replies_count": 0, "uuid": "cd4540b073232d387b91791f4e57e44cd5f78da7"}, "author": "", "url": "http://www.artipot.com/articles/1922541/trips-around-wroclaw-and-in-lower-silesia-region.htm", "ord_in_thread": 0, "title": "Trips around Wroclaw and in Lower Silesia region (Chris F Malecki)", "locations": ["Szklarska Poreba", "Old Town", "Sniezka", "Bolkow", "Klodzko", "Europe", "Karpacz", "Bardo", "Kamienna Gora", "Walbrzych", "Eastern Poland", "Silesia", "Wroclaw", "Wrocław", "Poland", "Central Europe", "Masuria", "Lesser Poland", "Srebrna Gora", "Germany", "Lower Silesia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Adolf Hitler", "Snieznik", "Sobotka", "Duszniki Zdroj", "Ruda", "Kudowa Zdroj", "Chris F Malecki"], "text": "By Chris F Malecki Aug 13, 2015 Poland is a beautiful country located in Central Europe, definitely worth visiting. It has a lot of picturesque areas - like Masuria region, mountains in the South, Lesser Poland, Eastern Poland, Lower Silesia or - beaches in the north of the country.One of these picturesque regions in Poland is Lower Silesia area, located around amazing city - Wrocław. Over the last centuries it was a part of Poland, Czech and Germany - and you may sense that feel of history and cultural mix really well when you walk on the streets of some small Lower Silesia town...Old buildings, beautiful mountains, old towns and cities, castles, world- famous churches, ex-nazi secret buildings - you may see all of that in Lower Silesia region.As Lower Silesia region is quite big (around 20,000 square kilometres) and to see everything from it you would need months, I will try to highlight for you its biggest attractions in this article. So let's start.Wroclaw. Charming and big polish city (around 1 mln habitants). With vibrant atmosphere; many young people going here to study and many big companies opening here their offices, this city is a beautiful capital of Lower Silesia and one of the richest cities in Poland. It has a lot of parks, historical buildings, museums, and the concerts, festivals, exhibitions and other cultural activities - are here every day. You can't go wrong with going to Wroclaw and you will never get bored here. Oh, and did I tell you about its old historical Main Market Square, which is one of the biggest in Europe ? Just sit in one of the cheap bars and restaurants and enjoy your beer, tea or coffee...Swidnica. Called by many as little Wroclaw\", this small city can be also interesting, but just for few hours visit. Its main attraction is old Church of Peace, which is world-class and UNESCO monument, made completely of wood in XVI century.Castle Ksiaz. Located near Walbrzych (around 100 km from Wroclaw), this castle covers centuries of german and polish history connected together. Did you know that during the Second World War Castle Ksiaz was meant to be as one of palaces for Adolf Hitler? The tunnels below the castle made by Nazis are silent witness of XX century's history...Klodzko. Charming small city (or rather big town ? ) located in the valley, surrounded by picturesque mountains. Among its charming small streets with old buildings there is also historical old bridge (built of stone in XIII century) and the Fortress of Klodzko - generally speaking, Klodzko is good spot to visit for around 4-6 hours.Bardo Slaskie. Small lower silesian town, with its old bridge from the end of XV century. In Bardo you may also see old churches and the Old Town - hundreds of centuries just in front of you ! Good for a visit of around 4 hours.Gluszyca Nazi Underground Tunnels. Built by Nazis at the end of the Second World War, these tunnels are the mystery until today. Just don't forget to take your sweater, as the temperature underground even during the hot summer day is around 10 Celsius degrees (50 Fahrenheit).Duszniki Zdroj and Kudowa Zdroj. Charming small towns located in beautiful mountains. During the winter, good for skiing - during the summer - good for mountain walking and some relax after in the bar/cafe...Srebrna Gora. Village with a beautiful fortress from XVIII century. Srebrna Gora was also famous for its silver mines.Bolkow and its castle. Located around 80 km from Wroclaw, Bolkow is famous for its castle from XIII century. These days, the castle is a home for summer goth and metal music festival in July.Sobotka. Located just 30 kms south of Wrocław, Sobotka is a home for the mountain Sleza - which is good for one day hike.Nowa Ruda, Kamienna Gora. Typical small charming lower silesian towns, located in the mountains. Good for short visit to enjoy the views and some coffee...Miedzylesie, Szklarska Poreba, Karpacz - also charming and also small towns and also located in the mountains - but this time - high in the mountains. These places are good to start your hiking trip, maybe to one of the highest peaks in Lower Silesia - Sniezka and Snieznik ? About the Author Despite its beauty, sometimes it is difficult and not convenient to visit Lower Silesia attractions during one day, because of unreliable and slow public transport. If you want private car trip around best Lower Silesia attractions, you may always check out http://www.funtrips.club Rating:", "external_links": [], "published": "2015-08-13T10:03:00.000+03:00", "crawled": "2015-08-13T22:15:38.569+03:00", "highlightTitle": ""}