{"organizations": [], "uuid": "12bff0c0e99131bb7cc6a413b2befad4f081399a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150826144325-singapore-structures-sutd2-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/08/27/travel/singapore-5-new-structures/index.html", "country": "US", "title": "5 spectacular new structures in Singapore", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "5 spectacular new structures in Singapore - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T22:24:00.000+03:00", "replies_count": 0, "uuid": "12bff0c0e99131bb7cc6a413b2befad4f081399a"}, "author": "Jonathan Choe, for CNN", "url": "http://edition.cnn.com/2015/08/27/travel/singapore-5-new-structures/index.html", "ord_in_thread": 0, "title": "5 spectacular new structures in Singapore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN Travel's series often carries sponsorship originating from the countries and regions we profile. However, CNN retains full editorial control over all of its reports. Read the policy .\n(CNN) Singapore -- the home of Esplanade \"the durian\" Theatre, ArtScience \"the banana\" Museum and other iconic structures -- continues to reinvent itself with new marvels of modern construction.\nCoinciding with the city state's jubilee anniversary are five stunning new public developments.\nEach is redefining the Singapore's fabric with fancy facades, crazy curves, and decadently restored historic structures.\nSouth Beach\nAfter nearly decade of planning (due to project delays resulting from the 2007-8 financial crisis), the highly anticipated South Beach complex is nearing completion.\nWith a prime location occupying an entire city block next to Raffles Hotel, the development features a number of repurposed historic structures, along with office towers by renowned British architect Norman Foster, and a hotel designed by Philippe Starck.\nThe highlight is a beautiful wave-like canopy forming a large sheltered outdoor mall, which will no doubt become one of the coolest new spots in the city to shop, eat, and hang out.\nThe complex is opening gradually, with the office tower completed and designer hotel slated to open in April 2016.\nSouth Beach , Beach Road, Singapore; complex opening in stages.\nIndian Heritage Centre\nThis brand new gallery literally shimmers like a jewel in Singapore's vibrant \"Little India\" district.\nIts colorful facade is inspired by Indian \"baori\" (step wells). Activity pulses along the newly pedestrianized street out front.\nThe sleek Indian Heritage Centre is enough to delight any modern architecture fan, but it also features traditional elements such as a 16-feet-high (five meters) entrance door, hand carved by Indian craftsmen especially for the new building.\nDark, dramatic exhibition spaces feature priceless artifacts of Singapore's Indian heritage alongside interactive and multimedia displays.\nAfter each level of galleries, a moment of visual ecstasy is provided through a trip down a flight of \"baori\" stairs, hanging on the outside of the buildings in a glass enclosure with stunningly colorful graphics and a panoramic view of the Singapore skyline and cityscape of Little India.\nIndian Heritage Centre , 5 Campbell Lane, Singapore 209924 Singapore; open Tuesday-Thursday 10 am-7 pm, Fri-Sat 10am-8pm, Sunday & Public Holidays 10am-4pm. Closed on Mondays. Admission is free for all Singapore Citizens & Permanent Residents, S$4 for visiting Adults.\nSingapore University of Technology & Design\nThe high-tech SUTD campus buildings were designed by avant-garde Dutch architects UNStudio. People don't often think of visiting a university campus, unless they're a freshman going for a campus tour.\nThe brand new SUTD campus is different.\nIt's funky, fresh buildings epitomize the high-tech architecture of Singapore.\nAnd nestled among the cutting-edge buildings are four priceless Qing and Ming dynasty structures more than 400 years old, which were shipped over from China by film star Jackie Chan as a gift to the new university.\nSingapore University of Technology & Design , 8 Somapah Road, Singapore; campus open to public.\nNational Gallery Singapore\nAlthough this spectacular new art gallery doesn't open until November, it's possible to get a sneak glimpse at the immaculately restored museum (sans art) on one of the \"naked museum\" tours if you're lucky.\nAfter opening, the gallery's first traveling exhibition will be a collaboration with the famous Centre Pompidou in Paris, featuring works by Pablo Picasso, Wassily Kandinsky and Marc Chagall.\nDesigned by French architects Studio Milou with local partner CPG Consultants, the new National Gallery Singapore integrates the historic Supreme Court and City Hall buildings, with the creation of a new glass and steel roof.\nIt's a fusion the architects describe as a \"very non-violent way of joining the two without changing the existing buildings.\"\nThe gallery opens November 2015.\nNational Gallery Singapore , 1 St. Andrew's Road, Singapore 178957 Singapore;\nCapitol Singapore\nFancy catching a play but bored with all the typical venues?\nThe recently completed Capitol Singapore breathes new life into the historic Capitol Theatre, one of Southeast Asia's first cinemas, which was built in the 1930s.\nAll jazzed up, it now incorporates stylish new shopping and dining venues in the heart of the city.\nCapitol Singapore , 11 Stamford Road, Singapore; +65 6499 5599\nFOLLOW CNN Travel Follow @cnntravel", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150826144325-singapore-structures-sutd2-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826144325-singapore-structures-sutd2-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826144325-singapore-structures-sutd2-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826144325-singapore-structures-sutd2-full-169.jpg", "https://www.facebook.com/cnntravel&send=false&layout=button_count&amp;width=450&show_faces=false&action=like&colorscheme=light&font=arial&height=21", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826144325-singapore-structures-sutd2-exlarge-169.jpg", "http://www.tripadvisor.com/Attraction_Review-g294265-d8077179-Reviews-m14631-National_Gallery_Singapore-Singapore.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826144325-singapore-structures-sutd2-super-169.jpg", "https://twitter.com/cnntravel", "http://i2.cdn.turner.com/cnnnext/dam/assets/150826144325-singapore-structures-sutd2-small-169.jpg", "http://www.tripadvisor.com/Attraction_Review-g294265-d8072555-Reviews-m14631-Indian_Heritage_Centre-Singapore.html"], "published": "2015-08-26T22:24:00.000+03:00", "crawled": "2015-08-28T04:36:34.707+03:00", "highlightTitle": ""}