{"organizations": [], "uuid": "1287efdb28065acbc14c78b87f2e95f4c9ff9824", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/24/12921050/pic001465420131011.jpg", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/2015/08/prweb12921050.htm", "country": "US", "title": "Salt Lake City’s Dented Brick Distillery Hires New Deal Distillery's Ethan Miller", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Salt Lake City’s Dented Brick Distillery Hires New Deal Distillery's Ethan Miller", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "1287efdb28065acbc14c78b87f2e95f4c9ff9824"}, "author": "Marc Christensen", "url": "http://www.prweb.com/releases/2015/08/prweb12921050.htm", "ord_in_thread": 0, "title": "Salt Lake City’s Dented Brick Distillery Hires New Deal Distillery's Ethan Miller", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With construction nearly complete at Salt Lake City’s Dented Brick Distillery, the executive team has signed Ethan Miller as Head Distiller. Mr. Miller was formally the Production Lead for New Deal Distillery in Portland, OR. Prior to New Deal, Mr. Miller worked for High West Distillery in Park City, UT, bringing more than 5 years of distilling art to Dented Brick’s Grain to Glass production strategy. “From the start, this project has been about creating something absolutely original,” said Celeste Royal, CFO at Dented Brick Distillery. “Watching the creation of the distillery from the ruins of the old brick house was a powerful experience for the team. Many things have come together for us in the last few months. Hiring Ethan was one of the most important feathers in our cap since inception”\n“Following several successful events in the last few months, and with distillery construction nearing completion, bringing a qualified distiller on board prior to our grand opening events was a real coup,” according to Marc Christensen, CEO. “We were really pushing our timeline, but we wanted to wait and make sure we got the best person available for the position. We think Ethan is perfect and are glad we waited, although it will make things a bit frantic in the next few months.”\nWhen the doors open in the fall, the public is invited to explore the 17,000 square foot distillery and get an up-close view of the grain-to-glass process, creating liquor 100% fermented, distilled, infused, and bottled from high quality botanicals, grains, yeast, and molasses.\n\"Dented Brick Distillery is the latest in a series of small businesses that have made significant investments in our community,” said Cherie Wood, Mayor of the City of South Salt Lake. “Their new building will revitalize and enhance the mixed-use neighborhood along our TRAX corridor. We are glad to have them be a key part of our city on the move.\"\n\"The distillery team has been working on this project since we received our original basic permit in March of 2011,” said Marc Christensen, CEO at Dented Brick Distillery. “Bringing Ethan on is a huge step towards finally bringing this dream to reality. We look forward to the grand opening, finally firing our stills, and bringing our original grains to glass recipes to market!\"\nAbout Dented Brick Distillery\nDented Brick Distillery is owned and operated by Salt Lake City Distillery, LLC with majority Utah private investors.\nDented Brick Distillery is Salt Lake City’s first destination distillery where public and private groups can visit and see the grain-to-glass process. Dented Brick Distillery is bringing the art of grain-to-glass – liquor 100% fermented, distilled, infused, and bottled from high quality botanicals, grains, yeast, and molasses – to the people of the Wasatch Front. The 17,000 square foot distillery is built to house the custom-built 500 gallon Vendome copper batch still, 28 foot tall stripping still with vodka arm and gin basket, and is capable of running 24/7 with a startup capacity of 12,000 to 15,000 cases per year. The still room, retail store, and barrel aging room will line the east-facing front of the distillery, giving a curbside view of the size and scope of distillery operations. Watch for Grand opening events kicking off in the fall.", "external_links": [], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T16:19:44.222+03:00", "highlightTitle": ""}