{"organizations": [], "uuid": "858353a981569888568f2df8608453d750d4c988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/08/26/13/2BA4432000000578-0-image-a-8_1440593951635.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/news/peoplesdaily/article-3210133/Athletic-pensioner-new-tourist-attraction-China-hundreds-watch-dive-sea-200-times-day.html", "country": "GB", "title": "Chinese pensioner dives into the sea over 200 times a day", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Chinese pensioner dives into the sea over 200 times a day | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T23:39:00.000+03:00", "replies_count": 1, "uuid": "87ea3c3b8b2894520c7f96e0747242ab802d5977"}, "author": "Qin Xie For Mailonline", "url": "http://www.dailymail.co.uk/news/peoplesdaily/article-3210133/Athletic-pensioner-new-tourist-attraction-China-hundreds-watch-dive-sea-200-times-day.html#post-0", "ord_in_thread": 0, "title": "Chinese pensioner dives into the sea over 200 times a day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5 shares 1\nView\ncomments\nA pensioner's passion for diving has turned him into a regular tourist attraction.\nZhang Quantong has been diving off a pier in Qingdao, eastern China, almost everyday for more than a decade, reported People's Daily Online .\nThe 73-year-old can make over 200 dives a day, adding up to over 17,000 times a year.\nThe 73-year-old can make over 200 dives a day, adding up to over 17,000 times a year. He even dives in winter\nHe also power walks three miles a day, does hand stands and completes 100 exercises on parallel bars\n Next Chinese villager who hacked wife and eight family members to... Chinese toddler hospitalised with parasitic infection after... Zhang Quantong's unusual hobby has gained him a large following and a crowd always turns out for his dives.\nSpeaking about his hobby, Zhang said: 'I've been diving for more than 10 years. Even if I just miss one day's diving I will feel uncomfortable.\n'Before I go out for a dive, I always do the warm up at home. I also do 100 exercises on the parallel bars each day.'\nIncredibly, he also takes 3 mile power walks and does handstands each day to keep fit.\nZhang Quantong (above) has been diving off a pier in Qingdao, China, almost everyday for more than a decade\nZhang said: 'I've been diving for more than 10 years. Even if I just miss one day's diving I will feel uncomfortable'\nZhang Quantong has been a fitness fanatic for a long time.\nEven in his younger days, he's kept fit with winter swims and triathlons.\nIn 2003, he decided to start a diving team in the local area with some friends, all of whom are said to be in their 60s.\nWhat started out as just 'fooling around' has turned into regulation dives.\nFor the 2008 Olympics, Zhang even challenged himself to dive 208 times in a single day.\nZhang's routine has kept him incredibly fit.\nIn 2003, he decided to start a diving team in the local area with friends, all of whom are said to be in their 60s\nIt's important to know the water before attempting a dive and Zhang always stops tourists from trying their hand\nThe only time he's been in hospital in the last few years has been when he was involved in a car accident in March 2014.\nDespite having to use crutches in the months following the accident, nothing could stop him from diving again just 100 days later in July.\nHe said: 'In reality, if you put your mind to it, you can keep fit with any exercise. Everyone is the same.'\nHowever, when tourists want to try their hand at diving, he always stops them.\nHe explains, 'When I dive, I always arrive when the tide is in and leave when the tide goes out.\n'If you don't have the experience, don't dive in blind. If you don't know where the hidden reefs are it can be very dangerous.\n'But if anyone really wants to learn, I can always teach them.'\nHe added: 'As long as I can move, I will keep diving.'\nThe only time he's been in hospital in the last few years has been after a serious car accident in March 2014\nDespite still having to use crutches, nothing could stop him from diving again after a traffic accident in 2014\nRead more: Read more at People's Daily Online", "external_links": ["http://unn.people.com.cn/n/2015/0824/c14717-27506527.html", "http://dailym.ai/1UdhlPp"], "published": "2015-08-26T23:39:00.000+03:00", "crawled": "2015-08-26T22:16:07.010+03:00", "highlightTitle": ""}