{"organizations": [], "uuid": "d7241ef5be05a40c16ba2e0d6aca8bcebb941d3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/000_SAWH970428037300-e1438971932874.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/08/07/costa-ricas-top-10-goals-time", "country": "US", "title": "Costa Rica's top 10 goals of all time", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rica's top 10 goals of all time", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T22:07:00.000+03:00", "replies_count": 0, "uuid": "d7241ef5be05a40c16ba2e0d6aca8bcebb941d3a"}, "author": "Michael Krumholtz", "url": "http://www.ticotimes.net/2015/08/07/costa-ricas-top-10-goals-time", "ord_in_thread": 0, "title": "Costa Rica's top 10 goals of all time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nRolando Fonseca, Costa Rica’s all-time leading goal scorer, is the author of one of Costa Rica’s most important goals. Tomas Stardgarter/AFP \nWhile the Costa Rica men’s football team remains in a winless drought, its important to look back on better times. Thats why The Tico Times has compiled a list of the top 10 goals in the national team’s history. \nAs Costa Rica football is a relatively new force on the international scene, many of La Sele ‘s top goals come from this century, including three from the historic 2014 World Cup performance. \nGoals were ranked to weight historical significance over mere style. Though a goal’s difficulty level counts for something, it only truly matters if it came at a defining moment for the national team. \nWithout further ado, here are the top 10 goals in Costa Rican football history. Let the debate begin. \n10. Winston Parks v. Turkey, 2002 World Cup \nPaired in a group with eventual World Cup champion Brazil and third-place finisher Turkey, La Sele tied with the latter and nearly made it out of group play. But in the next game, a 5-2 loss to Brazil combined with Turkey’s 3-0 win over China would keep Costa Rica out of the knockout stages because of a goal differential tiebreaker to Turkey. \nBut Winston Parks’ equalizer in the final minutes with Turkey kept the Ticos’ hopes momentarily alive as the team finished 1-1-1 in Group C. \n9. Joel Campbell v. Uruguay, 2014 World Cup \nWhen Costa Rica entered the “Group of Death” at Brazil in 2014, no one gave them a chance of advancing past former world champions Italy, England, and Uruguay. But in its first game, against a team whose fans were taunting La Sele with “Costa Pobre” chants leading up to the match, Costa Rica beat up on La Celeste 3-1. \nThe affair started off with Joel Campbell’s amazing goal and equally amazing celebration to honor the birth of his newborn child. \n“¿Quien dijo miedo?” \n8. Paulo Wanchope v. Uruguay, 2001 Copa América \nPerhaps the greatest player in Costa Rican history, current head coach Paulo Wanchope dazzled with this magnificent goal against Uruguay in the 2001 Copa América. Generally regarded as the third most important tournament in international football, behind the World Cup and the Euro Cup, the Copa América features the best of South America against select invitees from the Confederation of North, Central American and Caribbean Association Football (CONCACAF). \nWanchope’s 28 th minute goal led to a 1-1 tie with Uruguay in the group stages before Costa Rica made a run to the quarterfinals. There, the Ticos again met Uruguay and lost 2-1, despite another impressive goal from Wanchope. Their fifth place finish in the 2001 tournament remains their best result to date in the Copa América. \n7. Enrique Rivers v. Italy, 1984 Olympics \nThe 1984 Olympic Games marked a watershed year for football: the first time professional players were allowed to compete in the games. Though Costa Rica didn’t make it past the group stages because of prior losses to Egypt and the United States, its lone win in the Olympics came against an Italy squad that at the time held the World Cup crown. \nDespite bowing out early, a score from Limón native Enrique Rivers gave Costa Rica legitimacy for the first time on the world stage, showing it could compete with the game’s best. That’s why Rivers’ goal at the storied Rose Bowl in Pasadena, California remains one of the most important in Costa Rican history. \n6. Juan Cayasso v. Scotland, 1990 World Cup \nCosta Rica’s first ever goal in a World Cup was a thing of beauty. Claudio Jara’s masterful, behind-the-back feed to Juan Cayasso was the only score La Sele would need as it garnered a win in its first game at football’s biggest tournament. \nThough Costa Rica would lose 1-0 to world power Brazil, the Ticos advanced from Group C with a 2-1 win over Sweden. \n5. Hernán Medford v. Sweden, 1990 World Cup \nAfter the 1-0 win over Scotland in the team’s first ever World Cup game, the Ticos followed up the debut performance with a worthy encore. After Sweden goalie Thomas Ravelli sent off a long kick to midfield, it was immediately rebounded by Costa Rica. The speedy Hernán Medford, who had just subbed in, found space alone and took off with the ball in front of Swedish defenders. \nThe game-winning score lifted the Ticos to the knockout stages at the World Cup in Italy. The goal, and the call from Manuel Antonio “Pilo” Obando, live on in Costa Rican football lore. \n4. Bryan Ruíz v. Italy, 2014 World Cup \nJust when everyone thought Costa Rica’s 3-1 win over Uruguay was a fluke, the Ticos came back to beat 2006 world champion Italy. The match’s lone goal came at the head of captain Bryan Ruíz, who put home a beautiful cross pass from Júnior Diaz past legendary Italian keeper Gianluigi Buffon. \nThe header was all La Sele would need as the defense, led by goalie Keylor Navas, remained unbreakable. With the second win in group stage and a 0-0 tie with England in the next match, Costa Rica became the biggest story of the 2014 World Cup as the improbable winners of the “Group of Death.” \n3. Pastor Fernández v. El Salvador, 1989 CONCACAF \nAt the old National Stadium, in front of President Óscar Arias, Pastor Fernández lifted Costa Rica to qualification for its first ever World Cup with a crucial header. The win also marked the Ticos last CONCACAF championship. \nIn an ironic twist, Fernández was left off of Costa Rica’s final roster for the World Cup in Italy. \n2. Michael Umaña v. Greece, 2014 World Cup \nWhen Oscar Duarte was sent off with a second yellow card, it looked certain that Costa Rica’s 1-0 lead over Greece in the first knockout round would quickly slip away. But the story of the match was goalkeeper Keylor Navas, who made up for a 10-man Costa Rica squad with save after save until a Greek goal finally came in the 91st minute. \nBut Navas and the undermanned defense held together long enough to get to penalties. After Navas made a diving block on the fourth Greek penalty kick, Michael Umaña came right back with the game-clinching goal, lifting Costa Rica to advance to the World Cup quarterfinals for the first time in history. \nHere’s the now-legendary call, and subsequent celebration, from the booth with Channel 7’s Kristian Mora. \n1. Rolando Fonseca v. Mexico, 2001 CONCACAF qualifier \nIt didn’t happen in a tournament, and it wasn’t even the game-clinching goal, but the best goal in Costa Rican history came from the toes of its all-time leading scorer. \nIn a game simply known as the “Aztecazo,” Costa Rica beat Mexico at Estadio Azteca in Mexico City 2-1 (a Hernán Medford goal would later give the Ticos an outright win). It remains one of the most important games in CONCACAF history, as Costa Rican football had been an afterthought in the region behind the United States and Mexico. The Mexicans had never lost an elimination game in their home country until Fonseca’s magnificent goal catalyzed the Ticos to an improbable win. \nThe win also boosted the team to the top of the region’s standings en route to qualification for the 2002 World Cup. In the 70 years leading up to the game, Costa Rica had been to the World Cup one time. But ever since 2001, they’ve played in the world’s biggest sporting event three times. Fonseca’s defining goal should be given a lot of credit for the country’s ascension to the world level. \nAside from the historical significance, an entire story could be written on the aesthetics of the goal itself. The way it curves into a perfect part of the far corner, beyond the desperate reach of Mexico’s goalie, makes it look like a work of art crafted from the feet of a Costa Rican legend.", "external_links": [], "published": "2015-08-07T22:07:00.000+03:00", "crawled": "2015-08-07T22:26:39.970+03:00", "highlightTitle": ""}