{"organizations": [], "uuid": "f3e0c81a30c7f66531c63f5615e4d6a4e1a034c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/download-13.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lost-humpback-whale-lured-back-to-open-sea/", "country": "US", "title": "Lost Humpback Whale Lured Back To Open Sea", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Lost Humpback Whale Lured Back To Open Sea - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3e0c81a30c7f66531c63f5615e4d6a4e1a034c6"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lost-humpback-whale-lured-back-to-open-sea/", "ord_in_thread": 0, "title": "Lost Humpback Whale Lured Back To Open Sea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lost Humpback Whale Lured Back To Open Sea\nA lost whale which made a surprise visit to a marina in the Buenos Aires port area, periodically surfacing among the yachts while hundreds of onlookers tried to capture the moment with smartphones, finally was lured back to the open sea in a combined operation on Tuesday.\nThe mammal, apparently a humpback, measuring some seven meters appeared near the Yacht Club on Monday morning, an unexpected diversion from its migration route beginning in Argentina’s southeast up to the warmer Brazilian.\nRescue workers, with help from the Coast Guard, the Environment secretary, marine biologists and local NGOs tried to lead the whale to open water on Monday. It was showing signs of malnutrition and wounds on its skin, experts said.\nBut it is was only on Tuesday morning when workers led by city government vessels were able to guide the animal toward the Rio Plata River, from which they hoped it would reach the Atlantic Ocean.\nOn Monday news of the whale quickly spread on social media and was broadcast live by local stations, prompting hundreds to line up to catch a glimpse. The Coast Guard office said the whale had some fishing net pieces hanging.\nMariano Sironi, scientific director of the Whale Conservation Institute in Argentina, said whales sometimes get disoriented and swim upstream in rivers. When that happens, they often need help to get back to sea — usually from boats to direct them.\nA freshwater environment like a marina can hurt the skin of whales, provides no food and makes it harder for them to swim because it is not as buoyant as salt water, Sironi said.\n“Its health does not appear to be the best,” Fundacion Cethus president Miguel Iñiguez told the Buenos Aires TN television network on Tuesday, adding that the whale appeared to be “skinny.”\nFundacion Cethus specialists also helped lead the whale to open water.\nGabriela Bellazzi from the Stranded Whales network in Puerto Madryn warned that if the whale remains too long in fresh water “she rapidly dehydrates because she obtains brine from her food”.", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T21:34:53.680+03:00", "highlightTitle": ""}