{"organizations": [], "uuid": "a17f7d915f76812b7da801c9072b9b42ddb7a5f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/scotland/28507-celebrating-40-years-on-loch-ness-with-10-increase-in-visitors", "country": "US", "title": "Celebrating 40 years on Loch Ness with 10% increase in visitors", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Celebrating 40 years on Loch Ness with 10% increase in visitors", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T11:45:00.000+03:00", "replies_count": 0, "uuid": "a17f7d915f76812b7da801c9072b9b42ddb7a5f0"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/scotland/28507-celebrating-40-years-on-loch-ness-with-10-increase-in-visitors", "ord_in_thread": 0, "title": "Celebrating 40 years on Loch Ness with 10% increase in visitors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Celebrating 40 years on Loch Ness with 10% increase in visitors Celebrating 40 years on Loch Ness with 10% increase in visitors Details   09:45 Local MSP Fergus Ewing guest of honour at milestone anniversary celebrations Inverness based cruise company Loch Ness by Jacobite made a splash yesterday celebrating 40 years of sailing on the world’s most famous loch. The company’s ruby anniversary comes as the firm announces a 10 per cent annual increase in visitor numbers to 180,000 since August last year. \nLast week the business revealed a £1m tourism investment for Loch Ness including new headquarters, a brand refresh and a new addition to the Jacobite fleet. Minister for Business, Energy & Tourism, Fergus Ewing MSP, joined the celebrations at Jacobite’s Dochgarroch HQ, christening the company’s newest vessel, the Jacobite Rebel, which will guide an additional 800 passengers across the loch every day. Mr Ewing said: “I welcome the chance to christen the Jacobite Rebel, another impressive addition to the Loch Ness by Jacobite fleet. With its popular tours and strong focus on customer service, it's no surprise the company is growing visitor numbers and expanding its operations. “Loch Ness by Jacobite is providing the kind of memorable visitor experiences that are so valuable to the reputation of Scotland’s tourism industry.” The minister was joined by 50 guests for an hour long loch cruise to celebrate the milestone occasion in style. Freda Newton, managing director of Loch Ness by Jacobite said: “This is a great year for Loch Ness by Jacobite with a 40th anniversary, new boat and an increase in visitor numbers. “We are seeing an increase in tourists from Asia and the USA, with visitors drawn to the Highlands following the area’s exposure on film and television from the likes of Outlander and Disney’s Brave. “I would like to thank Mr Ewing and our excellent staff as they continue to help us provide a great service. It was a real pleasure to celebrate with the businesses that we have worked so closely with over the years to help us achieve such success.” The anniversary celebration featured the launch of the new book, Loch Ness by Jacobite, A History of Cruising on Loch Ness, written by Inverness-based author Roy Pedersen. Local celebrity Willie Cameron known as ‘Mr Loch Ness’ also entertained guests with an ode to the new boat, the Jacobite Rebel. Related articles", "external_links": [], "published": "2015-08-28T11:45:00.000+03:00", "crawled": "2015-08-28T13:42:00.527+03:00", "highlightTitle": ""}