{"organizations": [], "uuid": "175521c52e35cbb61667ccbeab2df798446b01a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25714", "country": "", "title": "National standards for Thai tour guides receive lukewarm response", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "National standards for Thai tour guides receive lukewarm response", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "175521c52e35cbb61667ccbeab2df798446b01a4"}, "author": "Michael MacKey, Bangkok, August 21, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25714", "ord_in_thread": 0, "title": "National standards for Thai tour guides receive lukewarm response", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "National standards for Thai tour guides receive lukewarm response Michael MacKey, Bangkok, August 21, 2015 \nTHE industry has given a mixed welcome to plans by the Thai government to bring in national standards for tour guides and operators. \n\nDraft legislation had already received approval this past week. “The draft covers several issues including the guidelines for granting the tour guide licence, protective measures for travellers on cancellation policy and the suspension of licenses when regulations have been violated by tour operators,” stated a government website. \n\nOne of the suggested reforms receiving a welcome was the idea of travellers needing to have insurance. \n\n“I think the insurance is a good thing,” Thanet Supornsahasrungsi, vice president, budget and planning of the Tourism Council of Thailand told TTG Asia e-Daily , pointing out that most developed countries have it anyway. \n\nWhere there was less agreement was how to go about raising standards. \n\n“I don’t know about minimum standards. There are too many things that need to be considered for the profession,” said Wirot Titaprasertnand, president of Thailand’s Professional Guides Association. \n\nWirot added that not all guides are active, which complicates things. Work depends on the season, the market and sometimes the languages spoken or needed. \n\nMore frequent licensing might also not be the way to go. \n\n“It's not the way to solve the problem,” said Thanet, pointing out that requiring licenses more often creates work the government might not be able to finish fast enough. There are some 50,000 guides currently registered with the Department of Tourism. \n\nAnother issue is the need for the Thai government to consult the industry, something all sources contacted said. \n\nA proposal for national rather than optional company uniforms was suggested in June, but has seemingly been dropped after heated trade debate.", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T16:24:39.129+03:00", "highlightTitle": ""}