{"organizations": [], "uuid": "b7f5d65325c62aacf08739e5b839432cec9a6f24", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/WoodSpring-Suites.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/europe-travel-news/", "section_title": "Europe Travel News - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/woodspring-suites-reports-second-quarter-2015-results/", "country": "US", "title": "WoodSpring Suites Reports Second Quarter 2015 ResultsTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "WoodSpring Suites Reports Second Quarter 2015 ResultsTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "b7f5d65325c62aacf08739e5b839432cec9a6f24"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/woodspring-suites-reports-second-quarter-2015-results/", "ord_in_thread": 0, "title": "WoodSpring Suites Reports Second Quarter 2015 ResultsTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WoodSpring Suites Reports Second Quarter 2015 Results Published on : Friday, August 21, 2015\nWoodSpring Suites, operators of the nation’s fastest growing value segment extended-stay hotel brand, today released its second quarter 2015 results.\nSecond Quarter 2015 Highlights:\nThe Company’s revenue increased by 18.7 percent to $32.7 million as compared to the second quarter of 2014 Royalty revenue increased by 10.7 percent as compared to the second quarter of 2014 System-wide hotel room revenue was $61.6 million, an increase of 12.1 percent over second quarter of 2014 Comparable system-wide hotel room revenue per available room (RevPAR) rose 5.8 percent as compared to second quarter of 2014; including a 7.4 percent average daily rate increase Comparable Corporate hotels (74 properties) generated EBITDA margins of 49.0 percent The company executed on 14 hotel license agreements during the quarter System-wide there were 14 hotels under construction System-wide, 3 hotels were opened during the quarter System-wide, franchise hotels in the pipeline increased by 50% compared to the end of second quarter of 2014, including 69 under development active properties and 10 under construction\nYear to Date 2015 Highlights:\nThe Company’s revenue increased by 22.3 percent to $63.1 million as compared to the same period in 2014 Royalty revenue increased by 9.4 percent as compared to second quarter in 2014 System-wide hotel room revenue was $119 million, an increase of 12.8 percent over the same period of 2014 Comparable system-wide hotel room revenue per available room (RevPAR) rose 7.7 percent as compared to the same period of 2014; including a 8.6 percent average daily rate increase Comparable Corporate hotel (74 hotels) revenue per available room (RevPAR) increased by 9.8 percent as compared to the same period in the prior year Comparable Corporate hotels (74 properties) EBITDA grew by 9.7 percent as compared to the same period in 2014 as EBITDA margins of 49.5 percent were realized during the period\n“We are very pleased with our second quarter results,” said Bruce Haase, CEO of the company. “We are continuing to grow our unit count from both franchise and company-owned properties. Developers are taking notice of our “It’s Simple. Done Better.” business model and are attracted to our strategy to gain access to new markets, go after additional customer segments, and continue to drive RevPAR growth.”\nThe company is currently transitioning all hotels operating under the Value Place brand to WoodSpring Suites. The full transition is expected to be complete by the end of first quarter 2016.\n“We are making big changes with our transition to WoodSpring Suites, and our high margins demonstrate our commitment to the operating principles that have fueled our success,” said Kyle Rogg, President and Chief Operating Officer. “We are continuing to grow our same store results and our brand contribution has increased with the help of additional investment in our online distribution and contact center resources.”\nThe Company continues to achieve national recognition for the success of its franchise operations. In January, Franchise Business Review named the company a Top 50 Franchise for the fourth consecutive year, and the hotel category winner for 2015. The company was named by Forbes magazine in 2014 as the top hotel franchise in the US and recognized as one of 2014’s Top 500 Franchises by Entrepreneur magazine.\nSystem-Wide Hotel Activity, Q2 2015 Openings Owner Date Opened Atlanta, GA Corporate 4/01/2015 Ft. Lauderdale, FL Corporate 4/16/2015 Louisville, KY Franchisee 4/22/2015 Under Construction Colorado Springs, CO Corporate Denver, CO Corporate Oklahoma City, OK Corporate Miami, FL Corporate San Angelo, TX Franchisee Columbus, OH Franchisee Dallas, TX Franchisee Tulsa, OK Franchisee Tampa, FL Franchisee Frederick, MD Franchisee Lafayette, LA Franchisee Nashville, TN Franchisee Chattanooga, TN Franchisee Chicago, IL Franchisee", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T00:20:48.115+03:00", "highlightTitle": ""}