{"organizations": [], "uuid": "6956bc2bfb3709abdddf4ef9df41255dfd8ffe6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/fuivowwcvi2fx7zuuwxm.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/do-something-different-this-autumn-with-fred-olsen-cruise-lines/", "country": "US", "title": "‘Do Something Different’ this autumn with Fred. Olsen Cruise LinesTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "‘Do Something Different’ this autumn with Fred. Olsen Cruise LinesTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "6956bc2bfb3709abdddf4ef9df41255dfd8ffe6a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/do-something-different-this-autumn-with-fred-olsen-cruise-lines/", "ord_in_thread": 0, "title": "‘Do Something Different’ this autumn with Fred. Olsen Cruise LinesTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "‘Do Something Different’ this autumn with Fred. Olsen Cruise Lines Published on : Friday, August 21, 2015\nFred. Olsen Cruise Lines is offering cruise guests four completely unique ‘experiential’ cruises this autumn. Committed to offering holidaymakers so much more than ‘just a sun-tan’, guests can choose from; a five-night comedy extravaganza on Braemar ’s ‘Sea is for Comedy’ cruise; an 11-night around the UK ‘Myths and Legends’ sailing aboard Boudicca ; an opportunity to ‘tell the Captain where to go’ on Braemar ’s ‘You Choose Your Cruise’ sailing; or a 13-night ‘Agatha Christie Cruise’, which celebrates the 125 th anniversary of the legendary author.\nNathan Philpot, Sales & Marketing Director at Fred. Olsen Cruise Lines, said:\n“These four cruises, setting sail in October and November, showcase our commitment to giving guests a ‘once-in-a-lifetime’ experience. They are the perfect opportunity to escape daily routines and try something completely new!”\nFred. Olsen’s four ‘Do Something Different’ cruises are:\n– Boudicca ’s 11-night D1522 ‘Myths & Legends’ cruise, departing from Newcastle on 6 th October 2015. Prices start from £799 per person.\nOn this fascinating journey, guests can unravel a host of intriguing myths, mysteries and legends, as Boudicca cruises around the British Isles.\nArriving first in Portsmouth , England guests can take a tour to explore Stonehenge, one of the ancient wonders of the world and the best-known prehistoric monument in Europe.\nAfter a call in Falmouth , England – where guests can visit Tintagel Castle, which is shrouded in mystery and thought to be the birthplace of King Arthur – Boudicca will arrive in Cobh , Republic of Ireland. From here, guests can visit the historic Blarney Stone, where legend has it that anybody who kisses the Stone will be bestowed with eloquence.\nNext, guests can listen to the stories of Molly Malone and Leprechauns in the city of Dublin , Republic of Ireland or take a tour to Louth – ‘Land of the Legends’.\nA visit to Belfast , Northern Irelandis next, to discover the tales and myths of the impressive Giant’s Causeway, an exceptional natural sculpture in the Irish Countryside. Once Boudicca has cruised past Fingal’s Cave , guests will have the chance to visit the beautifully preserved Neolithic village of Skara Brae in Kirkwall . Guests can also stand inside the Ring of Brodagar; it is the Orkneys very own Stonehenge.\nThe mystery of the Loch Ness Monster is next, with a call into Invergordon , Scotland. Travel along the Great Glen to Inverness – ‘Capital of the Highlands’ – to listen to stories of the legendary ‘Nessie’!\nBoudicca will then visit Edinburgh , Scotland where, on a shore tour, guests can learn more about the numerous theories, myths and legends of Rosslyn Chapel – star of the Da Vinci Code – and its claimed connections to the Knights Templar, Freemasonry and the Holy Grail.\nThroughout this cruise, guests can also enjoy talks from Dr. Patrick McCafferty, a guest speaker on Irish Mythology.\n– Braemar ’s 15-night M1527 ‘You Choose Your Cruise’, departing from Southampton on 10 th October 2015. Prices start from £999 per person.\nThis exciting and innovative cruise gives guests the chance to ‘steer the ship’, as they vote for the next port of call from two choices every 48 hours.\nThe first decision to make is whether to point Braemar towards Vigo in Spain, or Leixoes in Portugal for tours to Oporto . Next on this ‘first for Fred.’ cruise is a choice between Andalucian Malaga in Spain, or Algeciras in Spain. Braemar will then cruise to either Gaudi-inspired Barcelona (Spain), or traditional Palam ós , on the Spanish Costa Brava.\nThe options continue, with a host of Spanish ports, choosing between cultural Valencia or Mallorca’s cathedral city of Palma ; then guests mustdecide between the ancient city of Cartagena , or the classic Costa Blanca harbour city of Alicante .\nGuests will then pick between Cadiz (Spain), for tours to beautiful Seville, or opt to visit the Algarve region of Portugal, with a call into Portimão . The final choice for guests on this unusual cruise is the Galician city of Ferrol in Spain, or La Coruna , also in Spain, for tours to UNESCO-listed Santiago de Compostela.\n– Braemar ’s five-night M1528 ‘Sea is for Comedy’ fly-cruise, departing from Southampton (ends in Santa Cruz, Tenerife) on 25 th October 2015. Prices start from £399 per person (price shown includes flight to London Gatwick or Manchester and transfer from the ship).\nThis cruise will have guests laughing from start to finish. Braemar becomes Fred. Olsen’s very own comedy club on a five-day trip to Santa Cruz in Tenerife.\nEnjoy evening entertainment from Jon Clegg – Comedy Impressionist who was a Finalist on ITV’s Britain’s Got Talent ; delight in some light-hearted fun from Jonty Stephens & Ian Ashpitel, a brilliant homage to Eric and Ernie, the greatest double act ever; Miki Travis who will showcase some risqué late night laughs and Fred. Olsen favourite Don Reid.\nDuring the daytime guests can enjoy a daily programme of special presentations and events, including a comedy ‘Murder Mystery’ dinner with The Black Watch Theatre Company.\nOn arrival in Tenerife, guests can choose to spend time on the sunshine island, or fly back to the UK.\n– Balmoral ’s 13-night L1520 ‘The Agatha Christie Cruise’, departing from Southampton on 8 th November 2015. Prices start from £899 per person.\nThe Canary Islands offer a welcome break from the chilly and dark nights of a British winter, and on this sunshine cruise, guests can also celebrate the 125 th Anniversary of the Queen of Crime – Agatha Christie.\nTaking in five destinations – Funchal in Madeira, Santa Cruz in Tenerife – where Balmoral will dock overnight, so that guests can make the most of the Agatha Christie Festival in Puerto de la Cruz – Las Palmas in Gran Canaria, Arrecife in Lanzarote and Lisbon in Portugal, guests can soak up all that these fascinating destinations have to offer whilst also making the most of the celebrations on board.\nGuests will be able to enjoy talks from Mathew Prichard, Agatha Christie’s grandson, as he unveils a personal insight into the life and times of the famous British writer and Julius Green, the author of Curtain Up: Agatha Christie: A Life in the Theatre as well as performances from the Agatha Christie Theatre Company.\nGuests can also choose to upgrade to Fred. Olsen’s ‘all-inclusive’ package on selected drinks, from just £10 per person, per night.\nSource:- Fred. Olsen Cruise Lines", "external_links": [], "published": "2015-08-21T03:00:00.000+03:00", "crawled": "2015-08-21T10:31:17.166+03:00", "highlightTitle": ""}