{"organizations": [], "uuid": "97494fd86e592b49f6ac25c3b114b77f042bedcd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/28353-the-appointment-group-expands-the-corporate-travel-division-to-their-manchester-based-operation", "country": "US", "title": "The Appointment Group expands the Corporate travel division to their Manchester based operation", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "The Appointment Group expands the Corporate travel division to their Manchester based operation", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T17:45:00.000+03:00", "replies_count": 0, "uuid": "97494fd86e592b49f6ac25c3b114b77f042bedcd"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/28353-the-appointment-group-expands-the-corporate-travel-division-to-their-manchester-based-operation", "ord_in_thread": 0, "title": "The Appointment Group expands the Corporate travel division to their Manchester based operation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Appointment Group expands the Corporate travel division to their Manchester based operation The Appointment Group expands the Corporate travel division to their Manchester based operation Details   15:45 The Appointment Group (TAG) has today announced the expansion of its corporate division to the Manchester office. As part of the expansion of The Appointment Group’s central Manchester office, TAG has launched their Global Corporate division to focus on business travel opportunities and to realise the full potential of the thriving corporate marketplace in the North West region of the UK. \nThe Manchester based corporate team will provide the excellent service levels expected by TAG’s client base and ensure that its clientele benefit from the exceptional cost savings it achieves for them. Deborah Brumby will head up TAG Global Corporate Travel in Manchester. Deborah started her career as a retail clerk and progressively worked her way up to Director level. She quickly became one of the most well-respected figures in the corporate travel industry in the north west. It is Deborah’s responsibility to manage the corporate department, ensuring all aspects of the client needs are met whilst offering the very highest levels of service. Trevor Johnson, General Manager of TAG Manchester, quotes: “These are exciting times in the north of the UK with investment in business strong in many areas of commerce & industry. We have a keen focus on the corporate market and our close working partnership with the Greater Manchester Chamber of Commerce highlights this. We welcome Debbie Brumby onto our team here in Manchester as we strive to develop our business and become the number one travel management company in the region” Related articles", "external_links": [], "published": "2015-08-19T17:45:00.000+03:00", "crawled": "2015-08-19T18:23:31.941+03:00", "highlightTitle": ""}