{"organizations": [], "uuid": "d091b9c615e76323c4640ec2060d33ddfc647b2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maxim.com", "main_image": "", "site_section": "http://www.maxim.com/maxim-man/travel", "section_title": "Travel | Maxim", "url": "http://www.maxim.com/maxim-man/travel/article/guide-get-inside-new-york-city", "country": "US", "title": "The Guide to Get Inside: New York City", "performance_score": 0, "site": "maxim.com", "participants_count": 1, "title_full": "The Guide to Get Inside: New York City | Maxim", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "d091b9c615e76323c4640ec2060d33ddfc647b2b"}, "author": "Maxim Staff", "url": "http://www.maxim.com/maxim-man/travel/article/guide-get-inside-new-york-city", "ord_in_thread": 0, "title": "The Guide to Get Inside: New York City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored by SKYN\nWhere to LAY\nTHE GRAMERCY PARK HOTEL\nThis luxury hotel is the perfect hideaway, located right between the midtown hustle and the downtown bustle. The Gramercy Park Hotel offers unique rooms with gorgeous views and premium accommodations that are sure to impress.\nTHE SURREY\nA true New York Classic. The Surrey , located on Manhattan's Upper East Side, offers the perfect mix of privacy, class, and personalized service. Take her here and she'll be thinking she just hit the jackpot.\nTHE STANDARD - HIGH LINE\nKnown as one of the trendiest hotels in NYC, and located in the city's famed Meatpacking District, The Standard is perhaps one of the most unique and exciting locations to visit. With incredible restaurants, modern decor, and exciting nightlife hotspots, this is simply the place to be. Don't forget to take her for a romantic walk along the High Line Park, located right underneath the hotel.\nTHE NOMAD\nA modern twist on an old-fashioned restaurant, The NoMad offers a dining experience unlike any other - with passionate staff members and bartenders that will keep your eyes glued as they concoct all sorts of mixology masterpieces.\nWhere to PLAY\nTHE MUSEUM OF SEX\nLocated in the Flatiron District in New York City, The Museum of Sex is a great place to take a date, and is the perfect location to break the ice and really open things up, in more ways than one. Visit the gift shop, too, for fun things to try at home.\nUMPIRE ROCK (CENTRAL PARK)\nEscape the city hustle by taking her to Umpire Rock . Located in Central Park, this is one of the few spots in New York City where you can truly soak in the beauty of the iconic skyline. And her.\nQUEEN OF THE NIGHT\nDinner theatre is an old tradition of classic New York City entertainment, and Queen of the Night brings it to a new level. This fun, interactive, and sexually-charged dinner show is the complete package for a stimulating night on the town.\nROYAL PALM SHUFFLEBOARD CLUB\nA playful Brooklyn atmosphere with a fantastic selection of craft beers. Although this hotspot is typically enjoyed with a group of friends, the Shuffleboard Club is a great spot for a memorable date night.\nWhere to SAVOR\nBEAUTY & ESSEX\nWith an entrance unlike any other, don’t be alarmed when you’re guided through a pawn shop to get to the multistory restaurant - fit for New York’s elite.\nVALBELLA\nA modern Italian dining experience, complemented by exceptional service and some of the finest wines available in New York. Valbella ’s delicately crafted Italian cuisine is some of the best the city has to offer, located conveniently near top nightclubs and bars in the Meatpacking District. Make this your first move.\nDIRTY FRENCH\nWith culinary creations from Torrisi, Carbone, and Zalaznick, this downtown kitchen is cooking up mouthwatering courses, night after night. Beyond the kitchen is a chic, intimate setting with couple style table seating. Don't be surprised to see a celebrity or two sitting just tables away.\nPEASANT\nPeasant , a local secret in Nolita, sets the mood with a sexy ambiance and rustic themes, from their décor to the homestyle Italian menu. This traditional-style dining experience will set the mood for your evening, as though you were in rural Italy, in the privacy of your own villa. Every girl loves a spontaneous trip to Europe.\nWhere to SIP\nTOP OF THE STANDARD\nTop of The Standard offers top-to-bottom elegance in a high class setting, with breathtaking panoramic views of the entire city. It's always better on top.\nUP & DOWN\nThis ultra-exclusive nightclub has been a magnet for A-List celebrities; such as Leonardo DiCaprio, Rihanna, and Bradley Cooper. Take her here and you’ll both leave feeling famous.\nAPOTHEKE\nAn old time Parisian speakeasy feel with soft remixes and delicious crafted cocktails, Apotheke provides the quintessential atmosphere to get up close and personal with her.\nDEATH + COMPANY\nBeyond its hidden and mysterious exterior, Death & Company serves up raved-about small portion dishes and a selection of house-made liquors, creating a unique evening that she will not soon forget.", "external_links": ["http://www.deathandcompany.com/", "http://www.royalpalmsshuffle.com/", "https://www.thenomadhotel.com/", "http://www.valbellarestaurants.com/", "http://beautyandessex.com/", "http://www.standardhotels.com/high-line/food-drink/the-top-of-the-standard", "http://www.centralparknyc.org/things-to-see-and-do/attractions/umpire-rock.html", "http://www.standardhotels.com/high-line", "http://www.dirtyfrench.com/", "http://www.apothekenyc.com/", "http://www.gramercyparkhotel.com/", "http://queenofthenightnyc.com/", "http://www.peasantnyc.com/", "http://uadnyc.com/"], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T23:59:26.494+03:00", "highlightTitle": ""}