{"organizations": [], "uuid": "12b52431fa97050ac951fe7989c326eadcfe614a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/08/U.S.-Travel-Associations-Education-Seminar.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/u-s-travel-association-honors-mmgy-global-partners-at-esto-2015-ceremony/", "country": "US", "title": "U.S. Travel Association Honors MMGY Global Partners at ESTO 2015 CeremonyTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "U.S. Travel Association Honors MMGY Global Partners at ESTO 2015 CeremonyTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "12b52431fa97050ac951fe7989c326eadcfe614a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/u-s-travel-association-honors-mmgy-global-partners-at-esto-2015-ceremony/", "ord_in_thread": 0, "title": "U.S. Travel Association Honors MMGY Global Partners at ESTO 2015 CeremonyTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. Travel Association Honors MMGY Global Partners at ESTO 2015 Ceremony\nThe U.S. Travel Association ended its annual Educational Seminar for Tourism Organizations (ESTO) conference this week in Portland, OR by recognizing the best in U.S. destination marketing. Three MMGY Global partners – New Mexico Tourism Department, Visit Santa Barbara and Destination Cleveland – were honored with a total of four awards for their innovative work in the industry.\n“We’re thrilled to be honored with this recognition for the marketing work we’ve done with our destination partners,” said MMGY CEO Clayton Reid. “Along with many of our clients, these three help drive innovation among destinations and shape the future of the tourism industry.”\nAwards include:\nNew Mexico Tourism Department was awarded an NCSTD Mercury Award in digital marketing for the New Mexico True digital campaign that it collaborated with MMGY Global on in 2014. It also earned recognition earlier this year at HSMAI’s Adrian Awards.\nVisit Santa Barbara earned two Destiny Awards for its Brighten Your Day campaign, one for Branding and Integrated Marketing, and a second for Social Media.\nDestination Cleveland, which earned Best of Show honors for its new brand at this year’s HSMAI Adrian Awards, was recognized again for its new brand with a Destination Council Destiny Award.\nAs the premier annual learning and knowledge-sharing forum for destination marketing professionals, ESTO serves as a forum for destination professionals to learn about new business tools and techniques, share best practices, and identify solutions to common issues affecting destinations.\nThe Mercury Awards recognize members for excellence and creative accomplishment in state destination marketing and promotion, while the Destinations Council Destiny Awards recognize U.S. Travel destination members for excellence and creative accomplishment in destination marketing and promotion at the local and regional level.\nSource:-U.S. Travel Association", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-28T00:59:01.665+03:00", "highlightTitle": ""}