{"organizations": [], "uuid": "5511428a8f1b2896f59741b9a9449a90fff404a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/07/28/18422716-large.jpg", "site_section": "http://impact.al.com/travel/atom.xml", "section_title": "Travel Impact - al.com", "url": "http://www.al.com/living/index.ssf/2015/07/why_were_murals_hung_in_alabam.html", "country": "US", "title": "Alabama's New Deal post office art: How it got there, what survives", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Alabama's New Deal post office art: How it got there, what survives", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T23:12:00.000+03:00", "replies_count": 0, "uuid": "5511428a8f1b2896f59741b9a9449a90fff404a9"}, "author": "Kelly Kazek | kkazek@al.com", "url": "http://www.al.com/living/index.ssf/2015/07/why_were_murals_hung_in_alabam.html", "ord_in_thread": 0, "title": "Alabama's New Deal post office art: How it got there, what survives", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments \nIn the late 1930s, in an effort to relieve the hardships of The Great Depression, President Franklin Roosevelt's New Deal brought many changes to Alabama, most significantly the Tennessee Valley Authority and electricity for rural residents. \nBut Roosevelt's Works Progress Administration had numerous branches that resulted in projects such as flooding towns to form lakes, building public facilities like post offices and creating entire farming communities. Click here to read: \"The federal government built 8 Alabama towns during the Depression.\" \nThe president also knew artists were hit particularly hard by the Depression and hired them to create original works for public buildings in Alabama communities. \nOne benefit of the Federal Arts Project is the rich photographic documentation of the era by photographers like Walker Evans . Another benefit was the number of artworks, from paintings to reliefs, displayed in public buildings. Most typically, the art was in the form of murals depicting the local community and hung in post offices built through WPA programs. Click here to read more . \nAccording to TheArtStory.org, many of the paintings have been lost. \"In all, nearly 200,000 artworks were created under the Federal Art Project, yet many of those works have since become lost or were destroyed after the WPA auctioned off thousands of paintings in 1943, when all federally-funded art programs were dissolved.\" \nIn Alabama, at least 30 New Deal artworks survive. Below is a list compiled from LivingNewDeal.org and WPAmurals.com . If you know of any that have been omitted, email kkazek@al.com . \nAtmore Post Office, built 1935 using Treasury Department funds. \nMural: \"The Letter Box\" by Anne Goldthwaite, painted 1938 \nBay Minette Post Office, built 1937, now houses North Baldwin Utilities. The mural was moved to the new post office. \nMural: \"Removal of the County Seat from Daphne to Bay Minette\" by Hilton Leech, 1939. \nCarrollton Post Office and Agriculture Building , built in 1940 . \nMural: \"Farm Scene with Senator Bankhead\" by Stuart R. Purser, 1943. \nEast Lake Branch, Birmingham Public Library, built in 1928. \nMural: \"Fairytale Characters\" by Carrie Hill, 1937. It features Mother Goose characters such as Little Red Riding Hood, Little Miss Muffett, and the Rabbit from Alice in Wonderland. The mural was damaged by a fire but was restored in 1993. \nEnterprise Post Office, no longer in use. \nMural: \"Saturday in Enterprise\" by Paul Arlt, 1941. Now housed in Enterprise Public Library. \nEutaw Post Office, c onstructed with federal Treasury Department funds in 1938; still in use. \nMural: \"The Countryside\" by Robert Gwathmey, 1941. \nFairfield Post Office, built with Treasury Department Funds in 1937; still in use. \nMural: \"Spirit of Steel\" by Frank Hartley Anderson, 1938. \nFort Payne Post Office, no longer in use after new one built in 1980. The mural was moved to Hunt Hall. \nMural: \"Harvest at Fort Payne\" by Harwood Steiger, 1938. \nGuntersville Post Office, built in 1940 with federal Treasury Department funds. Listed on the National Register of Historic Places. \nMural: \"Indians Receiving Gifts from the Spanish\" Charles Russel Hardman, 1947. \nHaleyville Post Office. The 1939 post office now houses the public library. \nMural: \"Reforestation\" by Hollis Holbrook, 1940. The mural was painted over and an art expert has confirmed the original painting is beneath several layers of paint. The local Historical Society hopes to restore the painting. In the meantime, a smaller replica of the painting was commissioned to hang in the spot of the original. \nHartselle Post Office , built 1939, no longer in use. \nMural: \"Cotton Scene\" by Lee R. Warthen, 1941, now hangs in the Hartselle Chamber of Commerce offices, which are housed in the historic depot. \nHuntsville Federal Courthouse and Post Office , built in 1932. \nMural: \"Tennessee Valley Authority\" by Xavier Gonzalez, 1937. It was the largest mural commissioned in Alabama. \nLuverne Post Office. Houses \"Cotton Field\" by Arthur Getz, 1942. \nMobile City Hall/Southern Market, built from 1855-1857. Named a National Historic Landmark in 1973 and now houses the Museum of Mobile. Murals were painted directly on the walls. \nMurals: A series of murals depicting Mobile's history by John Augustus Walker, 1936. \nMonroeville Post Office and Agricultural Building, completed in 1938 using federal Treasury Department funds; still in use. \nMural: \"Harvesting\" by Arthur Leroy Bairnsfather, 1939. \nMontevallo Post Office, built in 1937 using federal Treasury Department funds. It is listed on the National Register of Historic Placed and is still in use. \nMural: \"Early Settlers Weighing Cotton\" by William S. McCall, 1939. \nOzark Post Office, built as a post office, now houses the board of Education offices. \nMural: \"Early Industry of Dale County\" by J. Kelly Fitzpatrick, 1938. \nPhenix City Post Office, now used as the public library. \nMural: \"Cotton\" by J. Kelly Fitzpatrick, 1939. \nRussellville Post Office, built in 1940 with federal Treasury Department funds; still in use. \nMural: \"Shipment of First Iron Produced in Russellville\" by Conrad A. Albrizzio, 1938. \nTuscumbia Post Office , now serves as City Hall, mural still hangs inside. \nMural: \"Chief Tuscumbia Greeting the Dickson Family\" by Jack McMillen, 1939. \nTuskegee Post Office, built in 1935; currently used as an arts center. \nMural: \"The Road to Tuskegee\" by Anne Goldthwaite, 1937. \nWoodlawn High School, built in 1922, designed by architect Harry B. Wheelock. \nMural: Known as \"Gloried Be They...,\" the full name of the 1936 painting by Richard Coe and Sidney Van Sheck is \"Gloried Be They Who Foresaking Unjust Riches Strive in Fulfillment of Humble Tasks for Peace Culture and the Equality of All Mankind.\" It was restored in 2009. \nOther artworks: \nNot all New Deal artworks were paintings. \nAlexander City Post Office, built before 1941, now houses the Charles T. Porch Community Center. \nRelief: Three terra cotta reliefs by Franc Epping, 1941. The reliefs called \"Wheat,\" \"Tobacco\" and \"Cotton,\" are now in storage in city hall. \"Wheat is broken into two pieces. \nScottsboro Post Office, built in 1938 with federal Treasury Department funds; still in use. \nRelief: \"Alabama Agriculture\" by Constance Ortmayer, 1940.", "external_links": [], "published": "2015-08-05T23:12:00.000+03:00", "crawled": "2015-08-06T02:08:16.640+03:00", "highlightTitle": ""}