{"organizations": [], "uuid": "e04c58df008dd7118e8749b04b2701340ccc8840", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/uncle-sam-says-bring-it-on-yelpers-under-deal-federal-agencies-to-respond-to-online-reviews-322358551.html", "country": "US", "title": "Uncle Sam says bring it on Yelpers! Under deal, federal agencies to respond to online reviews", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Uncle Sam says bring it on Yelpers! Under deal, federal agencies to respond to online reviews - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T01:37:00.000+03:00", "replies_count": 0, "uuid": "e04c58df008dd7118e8749b04b2701340ccc8840"}, "author": "Julie Watson, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/uncle-sam-says-bring-it-on-yelpers-under-deal-federal-agencies-to-respond-to-online-reviews-322358551.html", "ord_in_thread": 0, "title": "Uncle Sam says bring it on Yelpers! Under deal, federal agencies to respond to online reviews", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO - Watch out TSA: You'll be joining the ranks of beauty salons, taco stands, and other services reviewed on Yelp, and Uncle Sam says it will take the online ratings into account to improve what the government calls \"customer satisfaction.\"\nUnder a deal with Yelp, the government will officially recognize the public's star ratings on its federal agencies, from the Transportation Security Administration to national parks.\nFrustrated travellers have already been turning to the popular site for years to vent about long, slow-moving airport security lines and what some have said are intrusive body scans. Now the public will be able to do it in real time, and the government says it will respond to the comments and use the feedback to improve. People can, among other things, rate bathrooms at national parks, review their experiences with the Internal Revenue Service, or assess the efficiency of the local post office.\n\"In some ways, it augments our democracy,\" said Luther Lowe, Yelp's vice-president of public policy. He said the platform could shine the light on both what works and what doesn't in the federal government — just as it directs people to the yummiest Indian restaurant in town or the best nail salon.\nThe General Services Administration made the announcement on digitalgov.gov in a page that resembled a typical Yelp page with the title \"Best Public Services and Government in Washington D.C.\" It said: \"Adding customer satisfaction ratings and reviews to public services just got easier now that Yelp offers a terms of service for official government use.\"\nIt touted how the platform \"hosts insights from real people giving their honest and personal opinions on everything from restaurants and spas to coffee shops,\" and added that with the government joining in under the Yelp umbrella, federal agencies can find new ways to better serve taxpayers.\nLowe said there's no need for TSA agents or other federal officials to worry: Positive reviews already outweigh negative comments on Yelp for businesses, and he doesn't expect that will change with people reviewing federal agencies. It'll still take weeks before it is up and running.\nAndy Stoltzfus, vice-president of Voce Connect, a digital-consulting firm, said the deal is not what is expected of a massive federal government. \"It's very inspiring to see them adapting to the digital age,\" he said.\nIts success in revamping the image of the stodgy, unresponsive federal bureaucrat will hinge on pointing out how the feedback has specifically changed public services for the better, he added. Will a post office that is rated poorly be shuttered while one across town that is praised for its fast-moving lines get more funding? he asked.\nThe government also will need to ensure that coastal cities do not get most of the attention because there are more active Yelpers living there while other places are less tech-savvy.\nPer the government's terms, advertisements will be removed from official government pages to prevent perceived endorsements.\nSan Diego resident Erik Carstensen, who flies frequently, said it's an interesting idea, but he's not sure how effective it will be.\n\"To have everybody chime in on everything and each other is not necessarily a good thing,\" he said. \"I think the public can be pretty short-sighted or emotional.\"\n ", "external_links": [], "published": "2015-08-20T01:37:00.000+03:00", "crawled": "2015-08-20T12:05:23.828+03:00", "highlightTitle": ""}