{"organizations": [], "uuid": "5502b8fdb5cc764fa179bfc6d2f8f66dd918c3d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://www.marketwire.com/library/MwGo/2015/8/17/11G050981/SunwingCa_Orangebk_2015-599071268733.jpg", "site_section": "http://www.marketwire.com/rss/mwTravelandHospitality.xml", "section_title": "Marketwired - Travel and Hospitality", "url": "http://www.marketwired.com/press-release/sunwing-makes-winter-vacation-planning-easy-with-new-price-drop-guarantee-reduced-deposit-2048390.htm", "country": "CA", "title": "Sunwing Makes Winter Vacation Planning Easy With New Price Drop Guarantee & Reduced Deposit", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Sunwing Makes Winter Vacation Planning Easy With New Price Drop Guarantee & Reduced Deposit", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T00:34:00.000+03:00", "replies_count": 0, "uuid": "5502b8fdb5cc764fa179bfc6d2f8f66dd918c3d6"}, "author": "", "url": "http://www.marketwired.com/press-release/sunwing-makes-winter-vacation-planning-easy-with-new-price-drop-guarantee-reduced-deposit-2048390.htm", "ord_in_thread": 0, "title": "Sunwing Makes Winter Vacation Planning Easy With New Price Drop Guarantee & Reduced Deposit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 17, 2015 17:34 ET Sunwing Makes Winter Vacation Planning Easy With New Price Drop Guarantee & Reduced Deposit \nTORONTO, ON --(Marketwired - August 17, 2015) - Just launched this Friday, August 14 th , Sunwing's new Price Drop Guarantee and Reduced Deposit promotion will allow customers to book their vacations with confidence. They can reserve their perfect winter getaway now without worrying that the price may reduce closer to their departure date, plus enjoy a reduced deposit of only $100 per person. Especially handy for families looking to secure a larger room or suite, or couples keen to make plans for an anniversary or extra special getaway, the promotion is available to all customers that book a cruise or vacation package for travel between December 19, 2015 and April 30, 2016 inclusive, as long as they confirm their reservation before September 23, 2015. \nCustomers can make their reservation with a reduced deposit of only $100 per person and take advantage of the Price Drop Guarantee as a complimentary benefit. Should the cost of the identical package then be reduced outside of 28 days prior to the intended departure date, they will be entitled to claim up $400 per person back 1 . \nWith a choice of over 30 of the most popular vacation destinations across the Caribbean, Mexico and Cuba accessible from 32 different gateways, Sunwing has vacations to cater to all tastes and budgets this coming season. \nHandpicked for their beachfront location, supervised children's activities, pools and family-friendly accommodations, Sunwing's Family Collection™ resorts are perfect for those travelling with little ones. Or for a slower pace, Sunwing's Adults Collection™ resorts offer a tranquil haven for couples looking to unwind in a beachfront setting and take advantage of stylish dining, elegant bars and relaxed entertainment. Guests of all ages looking to relax and be pampered will appreciate the Luxury Collection™ of properties where the range of superior amenities include indulgent spa treatments, gourmet dining, spacious, well-appointed rooms & suites and 24 hour room service. \nFor more information or to book your next vacation, visit sunwing.ca or contact your local travel agent. \n1 Terms and conditions apply \nAbout Sunwing Vacations \nAll Sunwing Vacations packages include award winning Sunwing Airlines' Champagne Service, which features a complimentary glass of sparkling wine, hot towel service, Hot & Fresh Bistro Meals™ served with a choice of wine at lunch and dinner, and complimentary in-flight entertainment, including first run movies and a generous 20 kg free baggage allowance. For just $50 more per flight segment, travellers can upgrade to Sunwing's Elite Plus service, which features advance seat selection, complimentary headsets, separate check-in at a majority of airports, advance boarding, 30 kg baggage allowance, priority baggage handling, and extra legroom seats.", "external_links": [], "published": "2015-08-18T00:34:00.000+03:00", "crawled": "2015-08-18T00:49:28.664+03:00", "highlightTitle": ""}