{"organizations": [], "uuid": "e42d9f67b65ed351a82cefad04f424ce76c3f03b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28296-major-refurbishment-complete-at-maritim-airport-hotel-hannover", "country": "US", "title": "Major refurbishment complete at MARITIM Airport Hotel Hannover", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Major refurbishment complete at MARITIM Airport Hotel Hannover", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T17:15:00.000+03:00", "replies_count": 0, "uuid": "e42d9f67b65ed351a82cefad04f424ce76c3f03b"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28296-major-refurbishment-complete-at-maritim-airport-hotel-hannover", "ord_in_thread": 0, "title": "Major refurbishment complete at MARITIM Airport Hotel Hannover", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Major refurbishment complete at MARITIM Airport Hotel Hannover Major refurbishment complete at MARITIM Airport Hotel Hannover Details Category: Hotel   15:15 The first class deluxe MARITIM Airport Hotel Hannover has come to the end of a major refurbishment programme which has seen all areas of the property renovated, upgraded and enhanced. To ensure that it retains its leading position within the global hotel industry, MARITIM invests in an ongoing programme of upgrade and refurbishment at its hotels which aims to set it apart from its competitors and meet the ever changing needs, desires and aspirations of its German and international guests. \nOver the last 18 months, all 527 guest rooms and suites at the MARITIM Airport Hotel Hannover have been upgraded with new flat screen televisions and carpets, wallpaper and other soft furnishings in restful shades of cream, grey and light blue. The existing wooden furniture has been reupholstered to suit the new colourscheme. All guest bathrooms have also been updated to an ultra-modern, clean and contemporary style featuring large white floor and wall tiles and single lever stainless steel taps. The curtains in the bathtubs have been replaced by stylish glass panel shower screens. The communal areas including the lobby, corridors and Galerie Bar have also been improved. The carpets in all corridors have been replaced and all of the furniture in the lobby and Galerie Bar has been upgraded to ensure a smart warm welcome for guests on arrival and a quality impression when moving around the hotel. The hotel’s fine dining restaurant, the Bistro Bottaccio, the everyday Rotisserie Restaurant and Night Flight hotel bar have also been enhanced with new carpets and curtains and all furniture has been freshly re-covered in stylish and coordinating materials. Last, but not least, all conference rooms have also been renovated and outfitted with the latest in projection equipment and state-of-the-art audio systems. Event organisers and meeting planners will be interested to know that the MARITIM Airport Hotel Hannover offers an unusual and exclusive venue space which is located on the top of one of the garages on the rooftop of the hotel. This area can be used as an event location, when booked through MARITIM’s meetings, events and conference service (MECS) and provides fabulous views of the action on the airport runways and beautiful surrounding areas of Hannover. MARITIM Hotels is Germany’s largest privately owned hotel operator. With 36 first class deluxe hotels in Germany and 14 hotels around the world in locations as diverse as Mauritius, Mallorca, Turkey, Egypt, Malta and China, MARITIM welcomes thousands of business and leisure travellers every year and is committed to delivering an exemplary experience for every guest during their stay. Related articles", "external_links": [], "published": "2015-08-17T17:15:00.000+03:00", "crawled": "2015-08-17T21:13:59.066+03:00", "highlightTitle": ""}