{"organizations": [], "uuid": "cdb0c0cc0738fea88552c323a215444fba055959", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn1.scmp.com/sites/default/files/styles/620x356/public/2015/08/19/5ee0457df73c176a935276b0e7faeb04.jpg?itok=rBUUVs8N", "site_section": "http://www.scmp.com/rss/37/feed", "section_title": "South China Morning Post - Travel &amp; Leisure feed", "url": "http://www.scmp.com/magazines/post-magazine/article/1850852/hong-kong-bali-travel-deal-swanky-como-eyes-perth", "country": "HK", "title": "Hong Kong to Bali travel deal; swanky Como eyes Perth", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "Hong Kong to Bali travel deal; swanky Como eyes Perth | South China Morning Post", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "cdb0c0cc0738fea88552c323a215444fba055959"}, "author": "Adam Nebbs", "url": "http://www.scmp.com/magazines/post-magazine/article/1850852/hong-kong-bali-travel-deal-swanky-como-eyes-perth", "ord_in_thread": 0, "title": "Hong Kong to Bali travel deal; swanky Como eyes Perth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New edition The Beijing-based Bespoke Travel Company, which, as you may be able to deduce, specialises in tailor-made tours, has just launched an eight-day pick-and-mix (or \"bespoke\", if you must) tour package that takes in Beijing, Shanghai and Suzhou. Potential clients can choose from a fairly wide selection of things to do and places to visit at the China Edit section of the Bespoke Travel website ( www.bespoketravelcompany.com ) in either the Families or Couples category. Visits to the Great Wall, hutongs and more \"quirky\" options such as a Communism Tour and a run in a PLA motorbike and sidecar (top) are among the Beijing offerings. In Shanghai, as might be expected, the emphasis seems to be on colonial architecture, with tours of the Bund and the former French Concession, while the Suzhou segment is essentially a day trip out of Shanghai by train. The China Edit is priced from US$3,640 per person for a family of four and US$5,650 each for couples. Accommodation at some of the best hotels in Beijing and Shanghai is included, as are tour guide fees, transfers and ground transport, and entrance tickets. Flights and meals are not, however, and the package is probably best suited to deep-pocketed tourists visiting the three cities for the first time.\nGoing for a song Republic or Death! Travels in Search of National Anthems is the title of a new book by Alex Marshall, who has travelled the globe in search of the stories behind songs that are \"sung by millions across the world each day, that school children know by heart and sports fans belt out perfectly even after eight beers\". Marshall, a freelance journalist who seems to have worked mainly for The Guardian newspaper and the BBC, cycled along the route taken by French revolutionaries as they first gave voice to La Marseillaise , and entered a competition for the best rendition of The Star-Spangled Banner . He also travelled to Paraguay (the national anthem of which gave his book its title), to Kazakhstan and to Nepal, \"in order to uncover the story behind the only national anthem written on a Casio keyboard\". This is Marshall's first book, and will probably appeal to fans of other British writers such as Tim Moore, whose Nul Points provided an excuse to travel around Europe visiting failed Eurovision Song Contest entrants, and who cycled around France for French Revolutions. Visit Marshall's blog at republicordeath.wordpress.com for an idea of what to expect. Republic or Death! will be available in hardcover from this Thursday at Amazon.co.uk .\nDown to Perth The hotel scene in Perth, Western Australia, will be getting a much-needed boost in October with the opening of Como The Treasury (above), a 48-room luxury boutique hotel in the new Cathedral Square neighbourhood. The hotel, housed in the old Treasury buildings, was originally supposed to be managed by the more upmarket Aman Resorts, but it pulled out somewhere along the line. Still, the swanky Como presence will be welcomed in a city where the main international players are currently Hyatt Regency, Pan Pacific, Best Western, Holiday Inn and Crowne Plaza. Perth is also looking forward to Ritz-Carlton and Westin hotels opening in a couple of years. For a look at Como The Treasury and its opening rates, visit www.comohotels.com . Cathay Pacific flies from Hong Kong to Perth 10 times a week.\nDeal of the week The Park Regis Kuta, in Bali, is the cheapest offering with Swire Travel's new three-night package to the Indonesian island. Rates here start from HK$4,630 per person, twin share, but if you're travelling as a family the similarly rated Centra Taum Seminyak offers better value from HK$4,890, with round-trip airport transfers, and an upgrade to half-board for children under 12. Better resorts on offer include Le Meridian Bali Jimbaran (from HK$6,020) and the Sofitel Bali Nusa Dua Beach Resort (from HK$6,620). Top of the price list is the Four Seasons Resort Bali at Jimbaran Bay (above), which is available from HK$10,630 with airport transfers, and one set dinner and a 60-minute Balinese massage for two. This package also includes daily breakfast and flights with either Cathay Pacific or Dragonair. For further details and reservations, go to www.swiretravel.com or call 3151 8888.", "external_links": [], "published": "2015-08-22T03:00:00.000+03:00", "crawled": "2015-08-22T20:45:06.279+03:00", "highlightTitle": ""}