{"organizations": [], "uuid": "8f407db3f67b78e7dc302ba77e4179a761078be5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150814MotherBaby.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/08/15/giving-birth-costa-ricas-public-healthcare-system", "country": "US", "title": "Giving birth through Costa Rica's public health care system", "performance_score": 0, "site": "ticotimes.net", "participants_count": 2, "title_full": "Giving birth through Costa Rica's public health care system -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T00:00:00.000+03:00", "replies_count": 2, "uuid": "8f407db3f67b78e7dc302ba77e4179a761078be5"}, "author": "Jill Replogle", "url": "http://www.ticotimes.net/2015/08/15/giving-birth-costa-ricas-public-healthcare-system", "ord_in_thread": 0, "title": "Giving birth through Costa Rica's public health care system", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In honor of Mother’s Day and in hopes of providing useful information to moms and families, The Tico Times is proud to share the first-person accounts of two of our writers who recently gave birth in Costa Rica. Here, Managing Editor Jill Replogle describes her experience navigating the Caja as a new arrival to the country.\nWhen I first heard the term “obstetric violence,” I was a few weeks into my new job as managing editor at The Tico Times, a few more weeks into my new life in Costa Rica and six months pregnant. I was browsing stories in La Nación online and came across one about a woman who had given birth in the bathroom at the Women’s Hospital in San José. The Ombudsman’s Office called it “obstetric violence.”\nThe story mentioned another case: that of a woman at the same hospital who said she was forced to expose herself in her incomplete hospital gown to male personnel who didn’t have anything to do with gynecological care.\nI later Googled the term and found this definition from the women’s rights group May28.org :\nObstetric violence is a specific type of violation of women’s rights, including the rights to equality, freedom from discrimination, information, integrity, health, and reproductive autonomy. It occurs both in public and private medical practice during health care related to pregnancy, childbirth, and post-partum and is a multi-factorial context of institutional and gender violence.\nAt the time, my husband had been pushing for me to have our baby at a public hospital. After all, he said, he had broken his arm on his first trip to Costa Rica 15 years ago, spent several days at Hospital Calderón Guardia (or maybe San Juan de Dios, he can’t remember) and received great treatment. Best of all, he said, it was free.\nNow, a hefty chunk of my monthly paycheck was going toward my government health insurance, whether I chose to use it or not.\nStill, I was pushing for something a little more…romantic.\nMy first child was born at a Kaiser hospital in the United States. For the second, I was thinking home birth, with a loving midwife, perhaps a hot tub. I even found a midwives group in Costa Rica that offered just that for a price that was cheap by U.S. standards.\nStill, my husband reminded me, it was going to cost a lot more than free.\nI had a few months to decide, so I filed away the obstetric violence stories in the back of my head and got signed up for prenatal care at my local EBAIS clinic. Everything had been fine with my pregnancy thus far, so prenatal visits seemed like a good way to test the waters of Costa Rica’s public health system.\nBasic care\nEBAIS , Equipos Básicos de Atención Integral, are the primary-care clinics that make up the base of Costa Rica’s public health care system, or Caja. The EBAIS I was assigned to is run by the Universidad Iberoamericana under contract with the Caja.\nOn my first visit, I was told by the nurse that he and the doctor I was assigned to would see me through my entire pregnancy, including postnatal care. With the exception of one prenatal visit, this has been true. And this is great if you like your caregivers – not so great if you don’t.\nI’m lukewarm about my assigned EBAIS nurse and doctor. I’ve become buds with the nurse, and he seems completely proficient at what he does, which is basically take height and weight, fill out forms and give shots. My doctor also seems perfectly proficient at what she does, but she’s not exactly warm and attentive.\nMy biggest beef: during my pregnancy, she never once asked me if I had any questions — about anything. This was so different from my visits to the Kaiser nurse-widwife who oversaw my first pregnancy.\nLuckily, since this was my second child and everything seemed fine, I didn’t have a lot of questions.\nBut I did have a few: Which hospital should I go to when the time came? When should I go? What should I bring? It’s not that my doctor wouldn’t answer questions, it’s just that I had to take the initiative to fit them into our short visits.\nA friend pointed out later that the answers to most pregnancy-related questions for new Costa Rican moms-to-be probably come from their experienced mothers, aunts and sisters. But that doesn’t necessarily mean they’re giving good advice. Plus, there are surely Costa Rican women who don’t have strong support systems. What about the confused, pregnant 19-year-old who’s estranged from her family?\nNevertheless, as it got closer to delivery time, I was warming to the idea of having my baby at Calderón Guardia, my assigned hospital. Yes, I had heard some horror stories, but most of the Costa Rican women I talked to had good things to say about their births in public hospitals.\nInspection\nI went to check out Calderón Guardia’s maternity digs one day, hoping to make a final decision. A friendly nurse answered my questions about the delivery process and let me peek in on the ward. She even told me they had birthing balls for women who requested them. I was impressed.\nThe recovery rooms, on the other hand, looked a little bleak — no big bouquets of flowers and “It’s a boy!” balloons. And there were eight beds to a room.\nStill, it seemed all right. Plus, our bank account was in a waning phase, making the home birth option seem increasingly expensive.\nAlso, I’m a journalist who’s mostly lived in a country, the U.S., with a heavily-debated health care system based on private practice (I’m not going to get into Obamacare here). I figured I should have a full universal health care experience and, maybe, share what I learned with others.\nNothing like subjecting your unborn child to experiential journalism.\nD-Day\nMy ID band from Calderón Guardia.\nJill Replogle/The Tico Times\nPart of my plan for making my birth experience at least vaguely romantic was to limit the institutional part of the birth as much as possible. So when I started feeling contractions at 2 a.m., I kept my cool and went back to sleep. I labored all the next day at home, keeping track of the length and spacing of my contractions per guidelines I found on the Internet (remember, the doctor had told me nothing about when to head to the hospital).\nFinally, around 5 p.m., I decided it was time to hit the road.\nWhen my husband and I got to the emergency entrance at Calderón Guardia, an orderly immediately took me in and guided me to a sort of cul-de-sac at the end of a corridor with a few benches surrounded by basic examination rooms. My husband had to stay behind, I thought to do paperwork.\nIn the pre-maternity area, a male nurse took me into one of the examination rooms, told me to strip (while he half turned his back), put on a gown and get on the examination table. He left the door open.\nPrivacy is clearly much less a concern here than in a U.S. medical setting. I had already figured this out from my prenatal visits to EBAIS, but here, it was even more clear. No paper sheet over my bottom half; No leaving the room while the patient undresses.\nI didn’t care. Modesty and childbirth don’t really jive. But I now see his demeanor as a sign of his general attitude toward women in labor. The nurse’s subsequent probing was one of the more painful examinations I’ve ever had. When I groaned loudly, clearly in pain, he smirked and said, “What, that hurts?”\nThis, I thought, was obstetric violence. And I had barely gotten through the door.\nWhen the exam was over (quickly, thank God), the nurse told me to sit down on one of the benches and wait. So I waited, and waited. As my contractions got closer and closer together, I wondered with increasing angst why they hadn’t yet sent my husband back. After what seemed like forever (but was probably only about 15 minutes), I asked and someone went to retrieve him from the lobby.\nFinally, one of the orderlies took us, along with two other laboring women and their partners, up to the maternity ward. The whole group had to wait for me several times as I doubled over with contractions in the hallway and on the elevator. By the time we got to the delivery wing, I was ready to push.\nI asked to go to the bathroom, and mistakenly said something about feeling the urge to push in the same breath. “No, no,” a nurse said in a panicky voice, “don’t push!”\nI don’t know for sure, but I imagine something like this is what happened to the woman who had her child in a bathroom at the Women’s Hospital. Now, all maternity staff seemed to be on alert.\nI managed to pee without dropping a newborn in the toilet, but afterwards, they wheeled me straight into the delivery room.\nPush!\n“Feet in the stirrups,” one of the nurses said as they transferred me onto the birthing bed.\n“Do I have to?” I asked.\n“No,” the obstetric nurse in charge said, stepping in. Then she addressed the rest of the medical team and reminded them gently that patients can give birth in whatever position they want. I immediately felt better. I could tell that this woman had been schooled in the new way of treating women during birth — with respect for their choices and confidence in their ability to get the job done without unnecessary interference.\nShe was great. She encouraged me, coached me when I needed it and kept me informed on how things were going. Less than an hour and a half after I got to the hospital, Emilio was born.\nMy husband cut the umbilical cord and a nurse handed me the baby almost immediately — another sign of good maternity practices. But I had to give him up after less than a minute while they commenced cleaning and checking him.\nStill, the obstetric nurse explained what they were going to do to the baby and had my husband oversee everything while I got stitched up.\nRecovery\nWhen I had gone earlier to check out one of the post-maternity recovery rooms at Calderón Guardia — the ones with the eight beds — I had only seen three or four of the available beds actually occupied. So I figured, when it came my turn, maybe I’d be so lucky.\nNope: all eight beds were full in my room.\nI barely noticed that first night. After that, it was actually kind of fun sharing the first hours of motherhood with a group of women at the exact same stage. We swapped birth stories and tips for getting the milk flowing.\nBesides, I remember having so many interruptions from nurses and others after I gave birth to my daughter in the U.S. that this really didn’t seem much different.\nThe nurses here were attentive, and it turned out to be comforting to have them in the room around the clock. When my newborn started choking on phlegm, a nurse rushed to my bed, snatched the baby and swept him away. She came back a few seconds later with a calmly-breathing Emilio and one of those snot sucking bulbs that she instructed me how to use if it happened again.\nThere were some inconveniences — like no toilet paper most of the time in the recovery room’s shared bathroom. I borrowed from my more prepared Costa Rican roommates.\nThe food was fine. Or, as one of my roommates said: the food was free, ergo it was excellent.\nIn the end, my hospital stay was barely over 24 hours — a success in my book. Would I recommend it to a friend? It depends on the friend.\nIf the idea of sharing your child’s first day(s) of life with a group of strangers — and other crying babies — sounds awful, maybe a public hospital in Costa Rica is not for you. If you’re dreaming of a water birth with candles and soft music, you’ll need to look elsewhere.\nIf you want to join the ranks of the majority of Costa Rican women who have given birth — most of them safely — through the country’s proudly-defended (and often critiqued) public health care system, then go for it.\nThree months after I left Calderón Guardia with a tiny new member of the family, he’s happy, healthy and hungry. He keeps me smiling and gives me the strength to handle chronic sleep deprivation and an aching back. In the end, that’s all that matters.\nSee also: West Side (Birth) Story – Isla arrives at CIMA", "external_links": ["http://www.ccss.sa.cr/noticias/index/32-/379-ccss-ofrece-cobertura-con-ebais-al-94-de-la-poblacion", "http://www.nacion.com/nacional/salud-publica/Defensoria-servicio-sanitario-Hospital-Mujer_0_1473452725.html", "http://www.may28.org/obstetric-violence/"], "published": "2015-08-16T00:00:00.000+03:00", "crawled": "2015-08-18T04:07:26.996+03:00", "highlightTitle": ""}