{"organizations": [], "uuid": "8e321dcbf4e5c7e219146f886afb04d611274b47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/airportairline/28187-acs-reveals-its-top-5-private-jet-hotspots-in-2015-so-far", "country": "US", "title": "ACS reveals its Top 5 private jet hotspots in 2015 so far", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "ACS reveals its Top 5 private jet hotspots in 2015 so far", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T17:15:00.000+03:00", "replies_count": 0, "uuid": "8e321dcbf4e5c7e219146f886afb04d611274b47"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/airportairline/28187-acs-reveals-its-top-5-private-jet-hotspots-in-2015-so-far", "ord_in_thread": 0, "title": "ACS reveals its Top 5 private jet hotspots in 2015 so far", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ACS reveals its Top 5 private jet hotspots in 2015 so far ACS reveals its Top 5 private jet hotspots in 2015 so far Details   15:15 >Nice still top this summer for private jet travellers in Europe Leading aircraft charter specialist, Air Charter Service, has revealed that the most popular travel hotspot for its European based private jet clients remains Nice in southern France, but there are some big movers in the company’s top five holiday destinations so far this summer. \nAndy Christie, Group Director of Private Jets, says: “Nice is always so popular, especially with clients who use our European offices. I think that, aside from its obvious attraction as a stand-alone destination, the fact that you are also so close to places such as St Tropez and Monaco means that it acts as a kind of ‘mini-hub’ for holiday-makers in the French Riviera [Côte D’Azur], many using helicopters to travel between them.” Last year’s number two however, the ever popular Balearic Island of Ibiza, slips to number four, with Malaga a new entry in at number two keeping Palma de Mallorca in third spot. Another destination in the south of France, Cannes, completes the list. Olbia in Sardinia drops out of the top five for the first time in three years. Christie continues: “In the past we’ve had clients combine the top destinations and have ‘the best of both worlds’ by flying between Nice, Cannes, Palma and Ibiza. “These are figures taken purely from our client base – I wouldn’t normally expect Malaga to feature anywhere near the top private jet destinations, but we have had a few new clients booking several flights there, which has put it almost at the top of our list. Olbia is always popular with our Russian customers but, due to the current economic situation in the country, bookings from there to Sardinia are down this year.” The favourite long haul destination is currently Teterboro, the closest airport to downtown Manhattan in New York. 2014:", "external_links": [], "published": "2015-08-11T17:15:00.000+03:00", "crawled": "2015-08-11T20:22:07.408+03:00", "highlightTitle": ""}