{"organizations": [], "uuid": "530387941b9c5c6347443105db044de9aeab91f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28112-kimpton-hotels-restaurants-expands-footprint-in-san-francisco-and-manchester-vermont", "country": "US", "title": "Kimpton Hotels & Restaurants expands footprint in San Francisco and Manchester, Vermont", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Kimpton Hotels & Restaurants expands footprint in San Francisco and Manchester, Vermont", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T17:45:00.000+03:00", "replies_count": 0, "uuid": "530387941b9c5c6347443105db044de9aeab91f8"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28112-kimpton-hotels-restaurants-expands-footprint-in-san-francisco-and-manchester-vermont", "ord_in_thread": 0, "title": "Kimpton Hotels & Restaurants expands footprint in San Francisco and Manchester, Vermont", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kimpton Hotels & Restaurants expands footprint in San Francisco and Manchester, Vermont Kimpton Hotels & Restaurants expands footprint in San Francisco and Manchester, Vermont Details Category: Hotel   15:45 Kimpton Hotels & Restaurants recently announced that it is further expanding its profile through the opening of two hotels, including a new pied-a-terre property in Kimpton’s hometown of San Francisco and a new boutique hotel in Manchester, Vermont. The Buchanan Hotel in San Francisco and The Taconic Hotel in Vermont mark the hotel group’s 67th and 68th properties in the USA, having expanded in Savannah, Georgia; Sedona, Arizona; Palm Beach, Florida and Huntington Beach, California over the past year. Kimpton is also planning further openings in Palm Springs, California; Cleveland, Ohio; Milwaukee, Wisconsin; Nashville, Tennessee; and Grand Cayman during 2016. \nThe Buchanan Hotel, San Francisco ￼ Fulfilling a long-desired need for a hip, boutique hotel situated amidst the Pacific Heights neighbourhood and historic Japantown, The Buchanan opened its doors on 23 June 2015, providing a sophisticated design scheme while echoing the neighbourhood influence with artful elements of Japanese culture. The residential experience features a private courtyard, a Whiskey Lounge-inspired lobby, large rooms, many of which boast private outdoor patios with expansive views and a quiet neighbourhood experience for savvy travellers looking to explore the city beyond standard tourist traps. At The Buchanan, the long-time favourite Kimpton robe has become a lightweight Shibori-print Kimono and the Kimpton-classic Hosted Wine Hour incorporates Sake Tastings, as nods to the cultural heritage of the property. Additionally, in catering to the modern traveller The Buchanan’s exclusive App Guide provides guests with access to a directory of the best dining, wellness and sightseeing suggestions. For those looking to enrich their stay with amenities celebrating the spirit of the new hotel, The Buchanan is welcoming guests with the Sake In The City Experience Package and the Kanpai & Kimono Package both available through 30 December 2015. ‘Sake In the City’ Package at The Buchanan Hotel from £107 ($165) per person, per night The ‘Sake In The City’ experience features one night accommodation in one of Kimpton’s guestrooms and a sampling of three fine sake varieties sourced from local San Francisco boutique True Sake. The owner and expert Dan Bromberg will also be on-site every Friday pouring intriguing sake selections during Wine Hour. The package starts from £107 ($165) and is available until 30 December 2015. ‘Kanpai & Kimono’ Package at Buchanan Hotel from £146 ($225) per person, per night Guests experiencing The Kanpai & Kimono package will enjoy overnight accommodation in one of Kimpton’s guestrooms and a signature Buchanan Kimono-inspired, Shibori print robe along with two tasting-sized bottles of deluxe Hibiki Suntory Japanese Whiskey. The package is available from 1 August 2015 – 30 December 2015. The Taconic Hotel, Manchester, Vermont Named after the Taconic Mountains, The Taconic Hotel is the first Kimpton property in the popular, year-round destination Manchester, Vermont. Located in the heart of Bennington County, Manchester and scheduled to open in Autumn 2015, the 87-room new hotel will feature guest rooms with a variety of expansive views of the Taconic and Green mountain ranges, as well as three standalone cottages. A 110-seat tavern with an additional 75 outdoor patio seats adjacent to the hotel, will serve regional American fare that reflects Vermont's culinary traditions. The hotel will also feature a 2,600 square foot ballroom, along with an elegant outdoor venue perfect for weddings and other events. Inspired by the area’s grand resorts of the late 19th and early 20th century, the Taconic’s exterior will include a hotel façade highlighted by classic clapboard and shingle-style architecture and anchored by large wrap-around porches and porch columns, which were a favourite feature in the early Manchester hotels. Kimpton Chief Executive Officer Mike DeFrino, said “Given the popularity we’ve experienced in Vermont’s primary drive markets of New York and Boston, where Kimpton already operates a combined seven hotels it was a logical decision to extend our footprint here and be a part of this exciting project. The Taconic also offered us the opportunity to create a gorgeous year-round destination resort and to partner again with Heaton Companies, with whom we’ve had great success at our Vero Beach Hotel & Spa in Florida.” Related articles", "external_links": [], "published": "2015-08-06T17:45:00.000+03:00", "crawled": "2015-08-06T22:24:54.472+03:00", "highlightTitle": ""}