{"organizations": ["Hindustan Times"], "uuid": "6f97def93f42b0d55f663b7e87a34e6b1ebdfc0a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/5/1af23b5f-0542-41f4-a3b6-78c638462618MediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Wellness\r", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/wellness/women-too-prone-to-coronary-artery-disease-reveals-study/article1-1381166.aspx", "country": "IN", "title": "Women too prone to coronary artery disease, reveals study", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Women too prone to coronary artery disease, reveals study", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T20:15:00.000+03:00", "replies_count": 0, "uuid": "6f97def93f42b0d55f663b7e87a34e6b1ebdfc0a"}, "author": "", "url": "http://www.hindustantimes.com/wellness/women-too-prone-to-coronary-artery-disease-reveals-study/article1-1381166.aspx", "ord_in_thread": 0, "title": "Women too prone to coronary artery disease, reveals study", "locations": ["Mumbai", "Misbaah Mansuri"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Misbaah Mansuri, Hindustan Times , Mumbai | Updated: Aug 17, 2015 22:47 IST Doctors said some of the causes are changes in a working woman’s lifestyle, stress, high blood pressure and diabetes. (Shutterstock) \nA study has debunked the notion that women are less prone to develop coronary artery disease (CAD) compared to men. \nConducted between 2010 and 2015 at Vile Parle’s Nanavati Hospital, the study found that 20% of the 3,250 women screened had CAD. However, the findings cannot be extrapolated to the general population as the sample set also comprised women who already had a cardiac condition. \nThe findings made through coronary angiogram (a test done to assess the health of arteries) also revealed high incidence of hypertension and obesity. \nThere was a high prevalence (45.62%) of single-vessel disease (where there is a blockage in only one artery), revealed the study headed by Dr Lekha Adik Pathak, head of department of cardiology, Nanavati Hospital, and executive president of Heart Foundation of India. \nDoctors said some of the causes are changes in a working woman’s lifestyle, stress, high blood pressure and diabetes. \nThe study showed that 74% of the women had hypertension and 54% were obese because of improper diet, lack of exercise and added domestic responsibilities. \n“If you smoke, kick the habit. Smoking can damage and tighten blood vessels and raise your risk for CAD. Also, try to avoid second-hand smoke,” said Pathak. \nThe women who were screened included those who went for routine check-ups, those who had suspected CAD symptoms and those who were already being treated in the hospital. \n“It is presumed that women are less vulnerable to coronary artery disease, which is not true. A woman detected with diabetes or hypertension should regularly undergo check-ups and should take preventive measures. The earlier she is scanned for CAD, the better,” said Dr Hasmukh Ravat, cardiologist, Fortis Hospital, Mulund. \nDoctors said a healthy food habit is essential to keep the risk of CAD at bay. “A healthy diet is low in sodium (salt), added sugars, solid fats, and refined grains. Solid fats are saturated fat and trans-fatty acids. Refined grains come from processing whole grains, which results in a loss of nutrients,” said Dr Pathak. Tags", "external_links": [], "published": "2015-08-17T20:15:00.000+03:00", "crawled": "2015-08-18T07:01:50.035+03:00", "highlightTitle": ""}