{"organizations": [], "uuid": "6ed1cbfa6684b0414122ba2c1334c1a60da726cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03413/Emanuele_Pirro_at__3413471k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/diesel-performance/11814154/fastest-diesel-car.html", "country": "US", "title": "What’s the fastest diesel car?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "What’s the fastest diesel car? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T20:10:00.000+03:00", "replies_count": 0, "uuid": "6ed1cbfa6684b0414122ba2c1334c1a60da726cb"}, "author": "Erin Baker", "url": "http://www.telegraph.co.uk/sponsored/motoring/diesel-performance/11814154/fastest-diesel-car.html", "ord_in_thread": 0, "title": "What’s the fastest diesel car?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Winning the 24 Hours of Le Mans race is one of motoring’s highest honours, eagerly contested by dozens of car manufacturers, tyre brands and fuel companies every year. The thinking behind this magnificent event when it began in the Twenties was to advertise the reliability behind a brand in the most glamorous way possible, and 24-hour endurance racing is the finest example of motorsport. It’s where efficiency meets speed and reliability meets innovation. How to strike the perfect balance between all these variables, and thus secure a podium finish at the world's top 24-hour race? It's not easy. You can choose to enter a car in either the GT division, based on production sports cars, or the prototype classes (LMP1 and LMP2). The LMP1 division alone sees more testing and innovation than an entire F1 season, with petrol, diesel, electric and hybrids all vying for a place on the grid. Fuel efficiency is paramount for all types of car on the track, and Shell has had a hand in a staggering 50 victories, from Bentleys in 1924 to the turbocharged Porsches of 1976. Endurance-racing manufacturers love diesel because it uses less fuel at lower revs More recently, as the Official Fuel Partner for the entire FIA World Endurance Championship which includes Le Mans, Shell has worked flat out with the competing manufacturers to produce V-Power and V-Power Diesel racing fuels that meet the tough fuel-efficiency targets set at the beginning of last year’s season. “Diesel racing cars?” I hear you cry. In fact, they dominate this sport. Ever since the first diesel Le Mans racer, the 650-horsepower Audi R10 TDI, punted its way round the track at an alarming top speed of 211mph in 2006, diesels have been on the grid at Le Mans. (Actually, they’ve been there much longer: few will remember, but in 1949 a French car, the six-cylinder diesel-powered Delettrez, qualified and raced, but did not finish.) The year after the Audi R10’s success, Peugeot brought its 908 HDi car to the grid, winning in 2009 with an even higher top speed of 215mph. Endurance-racing manufacturers love diesel because, in a long-distance race, it uses less fuel at lower revs and, because of the torque curve the engine produces, drivers can exit corners on different lines to their petrol counterparts. Mazda jumped on the wagon by announcing its intention in 2012 to supply its SkyActiv diesel engines to LMP2 class racing cars, and the use of diesel now barely raises an eyebrow. What’s the world’s fastest diesel? For now and the foreseeable future, look no further than Le Mans. The views expressed in this article in connection with car manufacturers are the author’s independent views Do you want to help look after your engine? Non-premium fuels can, over time, cause gunk to build-up on critical fuel system components such as diesel engine fuel injectors – which can rob engines of power. Shell V-Power Nitro+ Diesel is formulated to help recover engine power lost to performance-robbing deposits. Shell's advanced formulation is designed to work under the extreme conditions of the fuel injection system, breaking down and cleaning away harmful gunky deposits. Shell V-Power Nitro+ Diesel is also designed to form a protective film on metal surfaces, which decreases the corrosion rate, helping to protect precision fuel system components. To find out more about Shell V-Power Nitro+ Diesel and to find your nearest station, visit shell.co.uk * Actual effects and benefits may vary according to vehicle, age of vehicle, driving conditions and driving style. Corrosion protection based on laboratory tests carried out according to ASTM D665A. • Discover more diesel performance news and tips » You may also be interested in: • What are BMW M cars? • The top five driving experience days • The best-loved diesels of all time", "external_links": [], "published": "2015-08-28T20:10:00.000+03:00", "crawled": "2015-08-28T17:12:48.877+03:00", "highlightTitle": ""}