{"organizations": [], "uuid": "e324febe6e2f65f8c304225f6d4c3673a9cd9620", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03418/Dark_red_BMW_X6_M5_3418262k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/diesel-performance/11821473/best-diesel-engine.html", "country": "US", "title": "What is the best diesel engine?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "What is the best diesel engine? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T20:04:00.000+03:00", "replies_count": 0, "uuid": "e324febe6e2f65f8c304225f6d4c3673a9cd9620"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/diesel-performance/11821473/best-diesel-engine.html", "ord_in_thread": 0, "title": "What is the best diesel engine?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Diesel engines – that is, combustion engines whose fuel is ignited by compression – have been around since the 1890s. Because they require sturdier construction, they were initially heavy and used in ships, trains and trucks before advancing technology enabled their use in cars. They provide more torque and better fuel efficiency than petrol engines of equal power, which is why roughly four in 10 cars sold in the UK today run on diesel. In France, it’s nearer seven in 10. But what is the most advanced diesel engine currently on the market? Every manufacturer could make justifiable claims. Audi, Peugeot and Porsche have had great success at Le Mans with their diesel engines. But BMW’s M50d engine, currently to be found in the X5, X6 and M550d models, is considered by many to be one of the current state-of-the-art models. By squeezing a mighty 740 Newton-metres of torque out of a mere three litres of capacity, it shows what can be done with the appliance of science. “Years ago, we would never have put an M badge on a diesel car,” says BMW’s Benjamin Titz. “Now we have a range of diesel cars that can proudly wear an M badge. They not only match our internal performance requirements but live up to the expectations of the people that will buy them – especially in Europe. The output of the M50d is equivalent to what super-sports cars achieved in another era It’s a huge challenge to create more power and efficiency within a confined space, says Titz. You have to consider not just the mechanics but the thermodynamics. “Other challenges include much higher fuel injection pressure, higher complexity in combustion geometry, ever-tighter emission regulations and, on top of all this, a smooth engine character.” BMW’s answer to this is a groundbreaking triple turbo arrangement. At low revs, the first turbocharger [1] is permanently engaged to ensure fast acceleration. At medium revs, a second large turbocharger [2] is added, boosting torque. In the upper rev range, another small turbocharger [3] comes online as well. Innovative: the M50d engine “Our system allows for the best possible torque and power from a six-cylinder engine,” says Titz. “It’s a compact engine that has near-peak torque from very low in the rev range. To make a diesel with this kind of power would once have required more cylinders, and so worse fuel economy. This six-cylinder triple-turbo performs approximately like our competitors’ V8 diesels, but with far less fuel consumption and less weight (which again leads to a perfectly balanced vehicle).” In fact, Titz says, the output of the M50d is equivalent to what a super-sports car would have achieved in another era. “BMW is always pushing the boundaries and seeing where extra performance can be gained. Ours are one of the most advanced engines in their respective classes. But this, to some degree, is only possible if all the other elements that make an engine function properly are also of a similarly high standard.” This is why BMW’s M division recommends Shell V-Power Nitro+ Diesel, Shell’s best performance fuel. “This incredible power plan will only perform at its absolute best if all these factors are in place,” Titz says. The views expressed in this article in connection with car manufacturers are the author’s independent views Do you want to help look after your engine? Non-premium fuels can, over time, cause gunk to build-up on critical fuel system components such as diesel engine fuel injectors – which can rob engines of power. Shell V-Power Nitro+ Diesel is formulated to help recover engine power lost to performance-robbing deposits. Shell's advanced formulation is designed to work under the extreme conditions of the fuel injection system, breaking down and cleaning away harmful gunky deposits. Shell V-Power Nitro+ Diesel is also designed to form a protective film on metal surfaces, which decreases the corrosion rate, helping to protect precision fuel system components. To find out more about Shell V-Power Nitro+ Diesel and to find your nearest station, visit shell.co.uk * Actual effects and benefits may vary according to vehicle, age of vehicle, driving conditions and driving style. Corrosion protection based on laboratory tests carried out according to ASTM D665A. • Discover diesel performance news and tips » You may also be interested in: • What’s the fastest diesel car? • The top five driving experience days • The best-loved diesels of all time", "external_links": [], "published": "2015-08-28T20:04:00.000+03:00", "crawled": "2015-08-28T17:16:09.487+03:00", "highlightTitle": ""}