{"organizations": [], "uuid": "21a92f767a484fad62c8eb957db7af32c8022183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150805Porteadores.jpg", "site_section": "http://www.ticotimes.net/categories/topics/business", "section_title": "Business Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/08/06/judicial-investigation-police-investigate-porteadores-threats-traffic-police-officers", "country": "US", "title": "Police to investigate alleged threats by private chauffeurs against traffic officers", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Police to investigate alleged threats by private chauffeurs against traffic officers -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T17:00:00.000+03:00", "replies_count": 0, "uuid": "21a92f767a484fad62c8eb957db7af32c8022183"}, "author": "L. Arias", "url": "http://www.ticotimes.net/2015/08/06/judicial-investigation-police-investigate-porteadores-threats-traffic-police-officers", "ord_in_thread": 0, "title": "Police to investigate alleged threats by private chauffeurs against traffic officers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If an audio recording circulating on social media is legit, the latest chapter in the ongoing squabble between the Costa Rican government and private chauffeurs, known as porteadores, has reached a new level.\nOn Tuesday evening Traffic Police Director Mario Calderón asked the Judicial Investigation Police to look into a recording of a conference call in which a supposed porteadora encourages others to intimidate Traffic Police officers who issue tickets to porteadores who no longer have operating permits or take away their license plates.\nIn July only half of the permits normally granted to porteadores were renewed, following orders from the Government Attorney’s Office. The permits are officially known as Special Taxi Service (SEETAXI) permits.\nThe recording, which started circulating this week on social media, starts with a woman called Rebeca who says she is a porteadora. She talks about the government’s decision to cut permits in half and the porteadores’ failed petition to reverse the decision.\nRebeca gets angry and calls for porteadores groups across the country to take action to prevent their license plates from being confiscated. She tells people on the call that if a Traffic Police officer detains someone who lost his or her permit, that person should immediately make a general call on his radio for porteadores to come and offer support in pressuring and intimidating the officer. She says such an action would be “a defense of their rights and a defense of their rice and beans,” a colloquial expression used by Ticos meaning “to fight for one’s way of living.”\n“Everyone must attend the call of any of us whose license plates are being confiscated,” the woman says emphatically on the recording. “Experience has told us that a single officer can’t do anything against a crowd. Let them feel the pressure, make them tremble. Please … you need to remain strong. Don’t back down. Godspeed,” Rebeca says.\nSome of the participants in the call, which lasts some six minutes, ask questions about how they should proceed during street blockades and demonstrations planned for coming days.\nPublic Works and Transport Minister Carlos Segnini said that he had heard the recording, and that he repudiates the threats and fully supports the measures taken by Traffic Police.\nThe president of the Porteadores Chamber, Carlos González, denied rumors that the woman on the call was a chamber leader and said her statements were “reckless and completely out of proportion.” However, he also said that the conversation was a clear example of private chauffeurs’ desperation over losing their jobs.\nHomer Alfaro, president of the Professional Traffic Police Officers’ union, said he and his colleagues weren’t afraid of the threats but he did think they were real calls to attack officers.\n“That conversation is a call to war,” Alfaro said. “We ask porteadores to ignore those negative leaders.”\nListen to the recording (Spanish only):", "external_links": ["https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/217978656&color=ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false"], "published": "2015-08-06T17:00:00.000+03:00", "crawled": "2015-08-06T15:16:48.813+03:00", "highlightTitle": ""}