{"organizations": [], "uuid": "fdafb7034ea84ee4affdb1308157d9a2421afa28", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/Nuevo-estadio-nacional-7.jpg", "site_section": "http://www.ticotimes.net/categories/topics/sports", "section_title": "Sports Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/08/04/international-track-field-officials-deny-allegations-widespread-doping", "country": "US", "title": "International track and field officials deny widespread doping allegations ahead of Costa Rica regional championships", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "International track and field officials deny widespread doping allegations ahead of Costa Rica regional championships -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T01:55:00.000+03:00", "replies_count": 0, "uuid": "fdafb7034ea84ee4affdb1308157d9a2421afa28"}, "author": "Michael Krumholtz", "url": "http://www.ticotimes.net/2015/08/04/international-track-field-officials-deny-allegations-widespread-doping", "ord_in_thread": 0, "title": "International track and field officials deny widespread doping allegations ahead of Costa Rica regional championships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On the eve of the regional track and field championships coming to Costa Rica, the sport’s international governing body finds itself swatting away serious doping allegations among its top performers. The International Association of Athletics Federation ( IAAF ) released a statement Tuesday to deny comments made in a recent article from the U.K.’s The Sunday Times that said one-third of long distant running medal winners are suspected of using performance-enhancing drugs.\nThe article, and an additional report from Germany’s ARD broadcast organization, cited more than 12,000 leaked blood tests from thousands of distance runners across the world, with many purportedly showing abnormal results among Olympic and World Champion medalists.\n“The published allegations were sensationalist and confusing: the results referred to were not positive tests,” said the IAAF’s statement. “In fact, ARD and The Sunday Times both admit that their evaluation of the data did not prove doping.”\nToday's front page: Third of medals won by athletes with suspicious blood tests http://t.co/LJLvHo3380 #dopingscandal pic.twitter.com/SmVS6sW0kk\n— The Sunday Times (@thesundaytimes) August 2, 2015\nIAAF officials added that there was no possible way to leak these tests because the federation already published them in a 2011 data report.\n“While the ARD and The Sunday Times may wish to pretend they have a ‘scoop’ by reporting on suspected prevalence of doping, their efforts are in fact over four years behind those of the IAAF,” the statement read. “The IAAF has already publicly published (in 2011) a review of its blood profiles in a peer reviewed journal . Far from hiding from these statistics, to our knowledge the IAAF is the only sport in the world to have openly reported, reviewed and analysed the statistics available in its long-term blood profiling database.”\nWhile potentially disastrous allegations hover over the sport, Costa Rica is set to play host to the North American, Central American and Caribbean (NACAC) Championships that begins on Friday.\nThe official list of athletes participating in San José’s National Stadium was released Tuesday. However, it is notably absent of the sport’s biggest stars like Jamaicans Usain Bolt and Asafa Powell, as well as Tyson Gay and Justin Gatlin of the United States, as they presumably prepare for the 2015 IAAF World Championships in Beijing that begin Aug. 22. There Bolt, who was reportedly not included on the list of “suspicious blood tests,” will look to eclipse his own world record of 9.58 seconds in the 100 meter dash.\nOne big name coming to Costa Rica on the women’s side is U.S. athlete Lolo Jones, who has competed in the past two summer Olympics in addition to the 2014 Winter Olympics in Russia as a bobsledder. She is expected to compete in the 100 meter hurdles this weekend.\nGames begin at 10 a.m. local time on Friday with the men’s 100 meter dash preliminaries.", "external_links": ["https://twitter.com/thesundaytimes/status/627720488027058177", "http://t.co/LJLvHo3380", "http://t.co/SmVS6sW0kk", "http://www.thesundaytimes.co.uk/sto/news/uk_news/thedopingscandal/article1588427.ece", "https://twitter.com/hashtag/dopingscandal?src=hash", "http://www.iaaf.org/download/download?filename=caebec23-be94-435c-a458-c6b19a749468.pdf&urlslug=2011%20IAAF%20Prevalence%20Study%20into%20Blood%20Doping", "http://www.iaaf.org/news/press-release/statement-response-ard-sunday-times-anti-dopi"], "published": "2015-08-05T01:55:00.000+03:00", "crawled": "2015-08-07T10:29:36.429+03:00", "highlightTitle": ""}