{"organizations": [], "uuid": "0ae80587b1f5ee615d4696211d7482338ad5b9a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "honestcooking.com", "main_image": "http://honestcooking.com/wp-content/uploads/2015/07/pro-pig-pic-635x4761.jpg", "site_section": "http://honestcooking.com/category/culinary-travel/feed/", "section_title": "Honest Cooking » Culinary Travel", "url": "http://honestcooking.com/whole-hog/", "country": "US", "title": "The Whole Hog: Prohibition Pig in Waterbury, Vermont", "performance_score": 0, "site": "honestcooking.com", "participants_count": 1, "title_full": "The Whole Hog: Prohibition Pig in Waterbury, Vermont", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T14:00:00.000+03:00", "replies_count": 0, "uuid": "0ae80587b1f5ee615d4696211d7482338ad5b9a2"}, "author": "Sheila McGrory-Klyza", "url": "http://honestcooking.com/whole-hog/", "ord_in_thread": 0, "title": "The Whole Hog: Prohibition Pig in Waterbury, Vermont", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Testing The Whole Hog: Prohibition Pig in Waterbury, Vermont \nWhat could be a more perfect meal after a long hike up Mount Abraham than a plate of barbecued pork with collards and grits at Prohibition Pig in Waterbury? By Sheila McGrory-Klyza \nAs you approach the village in which I live, the peak of Mount Abraham rises above the Green Mountains in the near distance. At 4,006 feet, it’s the fifth highest peak in Vermont, and my favorite one to climb. I climb it every year, not only for the breathtaking 360 degree view at the top, but also for the climb itself. \nClimbing mountains is used metaphorically in all kinds of literature and music, and for good reason: I made it. I did it. We did this together. I’ve reached a point in my life where I now have new perspective and clarity about where I’ve been and where I’m going. Standing at the top of Mount Abe, as locals call it, has brought all of these feelings to mind, and more, depending on the year in which I’m climbing it. \nThis year, the day we climbed it was a picture perfect summer day: blue skies with puffy clouds, no humidity, and a temperature hovering in the mid-70s. \nThe way down Mount Abe, for me, is usually harder than the uphill. Those who have knee issues will understand why. By the time we’re nearing the bottom, our bodies feel the sense of satisfaction and exhaustion from having pushed ourselves beyond our norm. We’ve also worked up quite an appetite. Food always tastes better after exertion, and a few years ago we discovered the perfect place to enjoy a meal following Mount Abe: Prohibition Pig in Waterbury. It’s about a 30-minute drive down into the Mad River Valley on the other side of the mountain range, and what awaits at Prohibition Pig lives up to its intriguing name. \nThis restaurant gives the term foodgasm new meaning, especially if you have an appreciation for Southern food like I do—Southern food of the freshest, highest quality possible, made with local ingredients. Pork rinds, hush puppies, and fried pimiento cheese are all on the menu, along with Yankee-Southern mashups such as cheddar grits and maple baked beans. OOhhhh Baby. \nKale Salad is also on the menu, but this is not the place to order that (although I’m sure it’s excellent). If I’m going to go with a salad post-hike, it’s the Crisphead wedge that calls my name, covered as it is with bacon, Bayley Hazen blue cheese, and Mad River Valley Ranch dressing. \nChick’n Biscuits are another favorite, but since I had those the last time I was at Pro-Pig I decided to forego them this time for the specialty of chopped pork barbecue, “Eastern North Carolina style,” made from local Snug Valley whole hog. I grew up below the Mason-Dixon Line and went to college in North Carolina, so this particular style of comfort food is dear to my heart. \nThe Chopped Pork BBQ Plate features a pile of succulent pork seasoned to perfection with hints of vinegar and spice. It comes with hushpuppies and a choice of two sides; it was tough to choose but I went with the traditional collard greens (to keep it healthy) and grits. Although I’ve been told that true Southerners only eat grits for breakfast, I prefer mine with dinner, and these made good company with the juicy pork. And I mean g d. \nFaye likes a quality burger, and Prohibition Pig’s House Burger comes topped with a fried green tomato, pimento cheese, and bacon. Add to that shoestring fries and she was a happy girl. \nChris forewent his usual hankering for pork barbecue (he lived for two years of his life in North Carolina as well) and opted for the Pit Smoked Chicken. Burnished to a golden brown and deliciously smoky, this chicken is not your everyday chicken. Black eyed peas, hushpuppies, and shoestring fries rounded out his plate. \nAll washed down with some local beer (Waterbury is thought by some to be the center of the craft beer universe), and Italian Barbera for me. \nIn the end, all that was left was a stray collard green. We can vouch that Prohibition Pig’s desserts are swoon-worthy as well (especially the Key Lime Pie), but tonight we were more than satisfied. \nMany mountains yet to climb. And many meals to savor. Sheila McGrory-Klyza \nSheila McGrory-Klyza is a writer who is interested in the intersection of food, culture, and conservation. She is mainly a self-taught cook, but has taken a class here and there. She lives in a small Vermont village and is inspired by the bounty of food producers and growers surrounding her. An avid Francophile, she has also lived in France at a few different times, most recently in Paris in 2010. She writes about her food adventures in Vermont and France, and other culinary travel, on her blog The Vermont Epicure. \n  31,  ", "external_links": [], "published": "2015-07-31T14:00:00.000+03:00", "crawled": "2015-08-01T09:31:37.363+03:00", "highlightTitle": ""}