{"organizations": [], "uuid": "a4c66c1bb8fce716c78a8bc82a3cdab62e3b06e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://www.independent.co.uk/incoming/article10450213.ece/binary/original/v2-Surf-Snowdonia.jpg", "site_section": "http://www.independent.co.uk/travel/rss", "section_title": "- Travel RSS Feed", "url": "http://www.independent.co.uk/travel/uk/activity-breaks/surfs-up-the-worlds-first-artificial-wave-park-has-opened-in-snowdonia-wales-10450221.html", "country": "IE", "title": "Surf's Up: The world’s first artificial wave park has opened in Snowdonia, Wales - Activity Breaks - UK", "performance_score": 0, "site": "independent.co.uk", "participants_count": 2, "title_full": "Surf's Up: The world’s first artificial wave park has opened in Snowdonia, Wales - Activity Breaks - UK - The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T03:00:00.000+03:00", "replies_count": 1, "uuid": "62b3b854ed3a58e613760a3a0230b126ba25314a"}, "author": "James Stewart", "url": "http://www.independent.co.uk/travel/uk/activity-breaks/surfs-up-the-worlds-first-artificial-wave-park-has-opened-in-snowdonia-wales-10450221.html#post-0", "ord_in_thread": 0, "title": "Surf's Up: The world’s first artificial wave park has opened in Snowdonia, Wales - Activity Breaks - UK", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It’s only when you’re bobbing on your board – when you taste fresh water not salt and take a moment to gaze at the bucolic loveliness ahead – that you fully comprehend the sheer brilliance of the world’s first inland surfing lagoon.\nSurf Snowdonia recently opened in the Conwy Valley. In place of a derelict aluminium smelter in Dolgarrog village are now cute camping pods, a glass-walled café-bar-restaurant, a surf shop and, at the centre of it all, the 300m-long lagoon in which the longest wave ever made by man peels across a beautiful valley. \nIt sounds bonkers. Almost as loopy as the thought that that you can now book waves online, and that Wales conceivably now ranks alongside Hawaii and California as a surf pioneer. Almost as barmy, in fact, as going inland for a surf. Yet as I drive south of Conwy a familiar sensation bubbles in my stomach. It’s the same feeling I have before any new break; a cocktail of excitement and anticipation. Surf’s up.\nSurfing, like few other activities, is hostage to the elements. It requires that King Neptune be in benevolent mood. Faced by flat spells or winds that can turn good waves into slop, a surfer in Britain requires a weather eye that’s as sharp as their technique. So, the surf community frothed in 2013 when a group of Spanish surfer-engineers unveiled the Wavegarden wavepool after a decade of tinkering.\nSurf Snowdonia represents its first commercial implementation. The Spaniards, who are fine-tuning during my visit, are guarded about the precise details of their technology – imagine an aquatic snowplough and you’re close. It’s the stats that hint at Surf Snowdonia’s complexity: six million gallons of rainwater from a hillside reservoir fill the lino-floored lagoon; a 25-ton force is required to drag the wavefoil beneath its central pier; computer control can alter the power of the wave.\nThe really clever bit is the contoured bottom that shapes the wavefoil’s single pulse into three breaks on each side of the pier: knee-high for beginners, chest-high for so-so surfers and, for the advanced, a head-high wave which unfurls for 20 seconds down the pool’s centre. A limitless supply of empty waves guaranteed every two minutes – it’s the surfing dream.\nWales is as excited as the surf industry. A series of launches has seen the country emerge as an adventure hub. Surf Snowdonia now joins brilliant mountain bike parks and zip wire rides as attractions alongside time-honoured activities such as hiking or kayaking amid some of the most beautiful scenery in Britain. Adventure tourism now contributes £480m annually to the Welsh economy. \nGiven that Surf Snowdonia anticipates 75,000 visitors in its first year – from beginners to experienced surfers honing their skills on predictable waves – this is a big deal for north Wales. It certainly is for Dolgarrog. When the lagoon was drained to tweak the wavefoil a week before launch, prayers were said during Sunday mass.The surprise is that surfing’s elite is so enthusiastic. “This is a game-changer, definitely,” says Casper Steinfath, vice-president of the International Surfing Association. I meet the professional surfer and two-times stand-up paddleboard world champion in Surf Snowdonia’s café. Head-high waves surge past our table every couple of minutes; first one way then the other.\nread more: The UK's best new family attractions Casper continues: “Surfing as an Olympic sport has always been a problem because most countries don’t have waves of the quality and consistency we require for a contest.”\nNow able to guarantee identical waves at the press of a button, the ISA this month posted its application for surfing to feature in the 2020 Tokyo Olympics. During a surf contest the atmosphere on a beach is amazing, Casper adds. “Can you imagine what it would be like in this sort of gladiatorial arena?”\nActually, I can. As we talk, professional surfers Alan Stokes and Hawaiian Kalani Robb are shredding waves barely 130 feet from where we sit; it’s a spectacular sight. \nA so-so surfer on the wrong side of 40, I hope for no spectators when I finally paddle out. (I didn’t really need to paddle; the lagoon never gets much beyond waist-deep.) Casper had described the advanced wave as “awesome”; it had “real power and the speed was immense. It made my board feel so alive,” he’d said. \nAm I ready for that as well as an unfamiliar, hired board? Probably not. Nerves are indistinguishable from excitement as I sit by the central pier for my turn. With a metallic rattle, the plough groans into action and a wave builds hissing towards me. This is it. I spin the board and start to paddle. There’s just time to glance back before a wall of green water heaves beneath me, spits… then rolls away. Lesson one of Surf Snowdonia: paddle harder than usual. \nI head towards the other end of the pool in anticipation of the return wave. It curls away unridden too. I can almost hear guffaws from the café. Still, the scenery’s beautiful. If my time on the wave wasn’t limited, I might almost be able to enjoy it.\nA clatter of cable announces wave three. Again I start to paddle; further out from the pier this time and harder. The board pitches and accelerates as the wave rears. I dig deep for two more paddles, the board slips, becomes weightless, then suddenly I’m on my feet, gliding across a curvaceous wall of moving water. It’s beautiful.\nSo, does it beat the beach? Not quite. If surfing in the sea is a safari, this is a zoo. It feels tamer, safer – no bad thing for many visitors. It has its benefits for experienced surfers, too. I’ve no idea whether I rode that first wave for 10 seconds or 15. Time stopped. All I know is another wave is coming along in a minute and I want to be on it. µ", "external_links": [], "published": "2015-08-11T03:00:00.000+03:00", "crawled": "2015-08-11T21:49:56.597+03:00", "highlightTitle": ""}