{"organizations": [], "uuid": "f0f619bdb4869eb2a0b8378656c8f6ac5a6de99f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/08/17/13/2A2B51BA00000578-0-image-a-6_1439814255996.jpg", "site_section": "http://www.dailymail.co.uk/travel/articles.rss", "section_title": "Travel Articles | Mail Online", "url": "http://www.dailymail.co.uk/travel/article-3200766/An-Inspector-Calls-heavy-price-pay-stay-Vine-House-Burnham-Market-Norfolk-310-night-worth-it.html", "country": "GB", "title": "An Inspector Calls: A heavy price to pay to stay at The Vine House, Burnham Market, Norfolk (can £310 a night ever be worth it?)", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "An Inspector Calls: A heavy price to pay to stay at The Vine House, Burnham Market, Norfolk (can £310 a night ever be worth it?) | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T20:24:00.000+03:00", "replies_count": 1, "uuid": "c9327c0c0d23d88230d995645c8e5d21fbf5f9b0"}, "author": "The Inspector", "url": "http://www.dailymail.co.uk/travel/article-3200766/An-Inspector-Calls-heavy-price-pay-stay-Vine-House-Burnham-Market-Norfolk-310-night-worth-it.html#post-0", "ord_in_thread": 0, "title": "An Inspector Calls: A heavy price to pay to stay at The Vine House, Burnham Market, Norfolk (can £310 a night ever be worth it?)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1\nView\ncomments\nRating:\nWhat do you expect for a room costing £310?\nPerhaps a fully stocked mini-bar, especially when the bar and restaurant is down the road, some 100 yards away; perhaps a proper desk or at least somewhere to stand a laptop; perhaps a dimmer switch in the bathroom so you're not dazzled in the middle of the night; perhaps a light in the communal downstairs sitting room bright enough to read; a fire.\nAnd peace and quiet instead of canned music.\nGood, but worth the money? The Vine House is the stylish - but expensive - addition to The Hoste in Norfolk\nNo, we had none of the above. But then, this is pricey Burnham Market, North Norfolk's Georgian masterpiece that gets ritualistically defaced at weekends when the Range Rover brigade roars into town with Jack Wills-clad teenagers in the back and golden retrievers in the boot.\nThe Vine House is an annexe to The Hoste, which has been under new management for the past couple of years. It's a much quieter alternative to the main pub, which has morphed into a 62-room operation, buoyed by various associated businesses: holiday cottages; a converted railway station with seven further rooms; and a beauty spa.\nRELATED ARTICLES Previous 1 Next An Inspector Calls: Making a big Deal of Bear's Well - a... An Inspector Calls: 'It won't be perfect but it will be... An Inspector Calls: Wimbledon's Cannizaro House sees Hotel... An Inspector Calls: The Elephant At The Market in Newbury is... Share this article Share No wonder there are three people manning reception at weekends.\nThe best part of this expanding empire is the original old bar at the front of the Hoste, and we love the main dining room next to it, with powder blue panelled walls and impressive works by local artists. There's no faulting the food and service either - as long as you're ready to pay £50 a head for a couple of courses and one bottle of wine.\nWe wake in the morning to discover the car has a flat. Reception does a brilliant job in organising down a repair while we tuck into the breakfast buffet in the Garden Room.\nSome of us remember the Hoste Arms when it was just a simple pub. Mustn't obstruct progress and all that, but we can't help looking back with a dollop of nostalgia.\nTravel Facts: Plan your own stay at The Vine House The Vine House\nThe Green\nBurnham Market\nNorfolk\nPE31 8HD\n01328 738 777\nwww.thehoste.com\nDoubles from £175 B&B\nRating:\nRead more: Book a Luxury Spa Hotel - The Hoste, North Norfolk Coast", "external_links": ["http://dailym.ai/1WynBVC", "http://www.thehoste.com/"], "published": "2015-08-17T20:24:00.000+03:00", "crawled": "2015-08-17T15:44:16.369+03:00", "highlightTitle": ""}