{"organizations": [], "uuid": "8a1774ffc30b5b9b21df74b2064e4a0b8e90a183", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tips/5-tips-for-planning-a-fun-cruise-with-kids/ar-BBm0sR0", "country": "US", "title": "5 Tips for Planning a Fun Cruise With Kids", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "5 Tips for Planning a Fun Cruise With Kids", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "8a1774ffc30b5b9b21df74b2064e4a0b8e90a183"}, "author": "Findery", "url": "http://www.msn.com/en-us/travel/tips/5-tips-for-planning-a-fun-cruise-with-kids/ar-BBm0sR0", "ord_in_thread": 0, "title": "5 Tips for Planning a Fun Cruise With Kids", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5 Tips for Planning a Fun Cruise With Kids The Huffington Post 1 day ago Findery\n© AP Photo/Regent Seven Seas Cruises/Spine After our latest fun and relaxing cruise with our kids, I came to the realization that I wouldn't mind cruising with them at least once a year. This is our third cruise as a family, my 10th in general, and, I have to say, each year cruising together gets easier. I think it's partially because the kids are getting older and I'm getting wiser. My secret to planning a fun cruise with my boys is to board the ship with a few loose goals that we've discussed as a family before we set sail.\nFollow these tips before you set sail with your family and you'll all be sure to enjoy your onboard vacation!\n1. Keep things simple\n© Provided by The Huffington Post Simple doesn't mean doing everything yourself. If you're traveling as a couple, divide the responsibilities amongst each other. When we were new parents, my husband would ask me to pack his luggage for him. His request was quickly denied as I learned how stressful it was packing for not only myself, but for two young kids as well. Allow everyone, assuming they are old enough, to be responsible for his or her own bags.\nFor our cruise, I decided that each of us would have our own carry-on luggage and we'd merge the kids' clothes into one bag. By doing this, we avoided the wait which unavoidably happens on embarkation day when the ship is processing over 2000 pieces of luggage. It can sometimes take until after dinner before your bags arrive in your cabin.\nIf sticking solely to carry-on luggage doesn't work for you, make sure to pair that big piece with a smaller bag where you pack essentials like swimsuits, a change of clothes, and toiletries.\n2. Introduce the kids to the fun quickly\n© Provided by The Huffington Post The pool opens before the cruise sets sail, which means excited children often descend upon it in droves, ready to get the party started. This is a great opportunity for your own kids to meet new friends early.\nMy oldest son found a new buddy before the sun set. We were relieved and amazed. They negotiated a plan to meet up in the Camp Carnival teen room for some gaming and activities.\nIf your child is on the shy side, attend the Youth orientation with them. It usually takes place just after the ship sails. You can tour the facilities with your children and help them get acclimated to their new surroundings. This could be another opportunity for them to make a new friend.\nHaving a child with autism presents unique challenges for us when we cruise. We don't have the luxury of leaving him in the playroom without close supervision. However, we can sit and play with him for as long as we like. Camp Carnival allows at least one parent to accompany their child in the playroom to ensure their comfort and fun.\n3. Choose excursions as a family.\n© Provided by The Huffington Post Ask your children for their input when choosing excursions. Kids love being part of the decision-making process. It sends a message that their opinion matters just as much as mom and dad's.\nOn this last trip we decided to go snorkeling in Grand Turk. My son mapped out the game plan with us and couldn't wait to get in the water. We pointed out fish together and enjoyed some quality bonding.\n4. Be sure to slow down.\nRemember, this is a vacation. Cruises are ideal when it comes to sitting still and doing nothing. This might be a case of do as I say, not as I do. Often, in my quest to see and do as much as possible, I have a hard time following my own advice.\nHowever, I try to remind myself that my boys are simply content to play in the water. Our goal for this trip was to get in as much pool and beach time as possible. We don't get to the Caribbean as often as we'd like. Relaxing on a beach chair or frolicking in turquoise waters without a nagging need to be somewhere should not be taken lightly.\nYou're on vacation. Remember to enjoy each other.\n5. Explore onboard entertainment with your kids.\n© Provided by The Huffington Post Aside from the kids' camp and arcade, there are several other ways to \"play\" with your child on a cruise.\nIf your ship has a candy store, be a kid for a day and go on a spree. I gave each of my guys (husband included) a plastic bag to go \"shopping.\" They were given limitations as to how much candy they could get (no overflowing bags please) and had fun deciding what new things they would try.\nOnce they're pumped with sugar, take them to a game show or live music performance. On the Carnival Pride, there's always someone singing in the atrium. A few of our favorite activities were the Superhero's trivia game and karaoke.\nBefore you wind down for bed, grab some popcorn and enjoy a dive-in movie. You can watch the latest Hollywood blockbuster with your brood, either submerged in water or relaxing on a pool chair. I finally got a chance to catch \"Avengers: Age of Ultron\" and I have to say it was a treat to catch it under the glow of moonlight.\nCruises are a great way for families to slow their pace and enjoy precious time with each other. Planning a fun cruise with kids is possible. It just requires teamwork, flexibility, and ultimately, a commitment to having a good time.\n ", "external_links": ["http://www.huffingtonpost.com/?ncid=txtlnkusaolp00000618", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm0sR0%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlNDUK.img&description=Regent+Seven+Seas+Cruises+-+AP+Photo%2fRegent+Seven+Seas+Cruises%2fSpine", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm0sR0%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlNDYq.img&description=Pool-kids+-+Provided+by+The+Huffington+Post", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm0sR0%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlNOkw.img&description=suitcases+-+Provided+by+The+Huffington+Post", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm0sR0%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlNQZ3.img&description=onboard+entertainment+-+Provided+by+The+Huffington+Post", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBm0sR0%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlNOoI.img&description=Ship+-+Provided+by+The+Huffington+Post"], "published": "2015-08-22T03:00:00.000+03:00", "crawled": "2015-08-23T12:31:46.402+03:00", "highlightTitle": ""}