{"organizations": [], "uuid": "cd7e5f8b0a7dc81fd7b785d50c11b025048afd76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/d/i/g/d/image.related.StuffLandscapeSixteenByNine.620x349.16dic4.png/1439760950917.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/themes/food/71174164/Mama-Tani-This-is-no-ordinary-Dubai-cafe", "country": "AU", "title": "Mama Tani: This is no ordinary Dubai cafe", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Mama Tani: This is no ordinary Dubai cafe", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T00:35:00.000+03:00", "replies_count": 0, "uuid": "cd7e5f8b0a7dc81fd7b785d50c11b025048afd76"}, "author": "Ute Junker", "url": "http://www.stuff.co.nz/travel/themes/food/71174164/Mama-Tani-This-is-no-ordinary-Dubai-cafe", "ord_in_thread": 0, "title": "Mama Tani: This is no ordinary Dubai cafe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mama Tani: This is no ordinary Dubai cafe UTE JUNKER Last updated 09:35, August 17 2015 \nPlatter from Local Bites Cafe, Dubai. \nCiabatta and bagels, naan and pita bread. Our bread baskets have become a multicultural mash-up, so there is no reason why the next bread you sink your teeth into should not be khameer, a traditional Emirati flat bread. That is what Maitha and Omar Alshamsi, a brother and sister from Dubai, are hoping. Khameer is at the centre of their Mama Tani cafée an intriguing Dubai diner with international aspirations. \nWhen the siblings opened Mama Tani in 2013, in many ways it appeared to be just another Dubai café: sleek and shiny with snappy service. What was different was the house specialty. Traditionally, khameer is something Emiratis have enjoyed at home, not something they eat when dining out. \nMost Emiratis had never eaten khameer quite like this, however. The Alshamsis jazzed up the old favourite with an array of new stuffings, ranging from local flavours – labna, basil, walnut, black olive – to more international combinations, such as egg and cream cheese. \nFancy something sweet? The rose cream, pistachio and fig version is very Arabian Nights; alternatively, try one with strawberries, bananas, dulce de leche and almonds. \n\"We add something new to the menu every month or two,\" says Omar. \"Our menu takes a contemporary, fusion approach, but we look close to home for our ingredients. As well as mint and basil, we use local herbs such as rocca, which have a lot of health benefits. We took a lot of time to source the best local organic ingredients.\" \nPlatter from Local Bites Cafe. \nThe Alshamsis are not the only ones catering to an untapped hunger for local food. At Local Bites Café, which Emirati filmmaker Nahla Alfahad opened around the same time as Mama Tani, the usual pastas and salads have been joined on the menu by Emirati dishes. Apart from the savoury platters, her clientele has been scooping up sweet treats that include balaleet, made with vermicelli, eggs and saffron; luqaimat, fried dough balls with cardamom and saffron; and even hot milk with cumin and saffron. \nAlfahad says that these tastes of home are increasingly popular. \"Lots of people do takeaways; we also get lots of requests for platters for meetings,\" she says. \nThe Alshamsis, who trace their love of food to a childhood surrounded by champion cooks – particularly their grandmother, the eponymous Mama Tani – have also discovered that Mama Tani has struck a chord with locals. When they opened the cafe, they expected to draw a clientele of tourists keen to try local flavours in a contemporary setting, instead of the prop-laden tourist-oriented restaurants. Ad Feedback \nHowever, in a country where being modern has long been synonymous with embracing an international outlook, it seems that a new generation is rediscovering its roots. \n\"Young people are realising, 'I have a culture I can be proud of. I can be modern and Emirati',\" says Maisha Alshamsi. \nLike local designer Khalid Shafar, who designed the cafe's interiors, the Alshamsis represent a new breed of Emiratis, cosmopolitan and confident. However, they have still had to battle old mindsets. Like Alfahad, the Alshamsis have launched their cafe as a side venture, an adjunct to their professional day jobs. When the pair told their father what they were planning, his response reflected local prejudices. \nFruits from Local Bites Cafe, Dubai \n\"He said, 'You are going to go from being a lawyer to being a tea seller'?\" Maitha recalls, mimicking his horrified look. \nThe siblings encountered other challenges, most notably, going head to head with some of the world's biggest brands. \n\"Being in Dubai, we are surrounded by global brands. From day one, you have to be able to compete with Starbucks, with Costa Coffee, with Illy and Segafredo,\" says Omar Alshamsi. \"You don't get to go step by step; as soon as you are born, you have to run the marathon.\" \nIt seems they are off to a flying start, with franchise inquiries flooding in from across the Middle East. The second Mama Tani is now open in Abu Dhabi, to be followed by a third outlet in Sharjah. As Omar says, \"We are looking to create a UAE brand to export to the world.\" \nMini luqaimat from Local Bites Cafe, Dubai. \nMORE INFORMATION Mama Tani, The Town Centre, Dubai, see mamatani.com . \nLocal Bites Cafe, Jumeirah Beach Road, Dubai, search for 'Local Bites Cafe' in Facebook \nGETTING THERE Emirates flies to Dubai. \nAll passengers can enjoy the award-winning Digital Widescreen in-flight entertainment system, ice, with up to 1800 channels of the latest movies, TV shows and music from around the world, plus chef-prepared gourmet cuisine and sommelier-selected wines. Emirates offers passengers one of the most generous luggage allowances in the air, with up to 30 kilograms of checked baggage in Economy. For flight information and bookings visit your local travel agent or see emirates.com . \nSTAYING THERE Vida Downtown Dubai has an elegant mod-Arabesque design, and an in-house branch of hip Sydney eatery, Toko. Rooms from $360. See vida-hotels.com . \nThe writer travelled courtesy of Emirates Airlines and Dubai Tourism.", "external_links": [], "published": "2015-08-17T00:35:00.000+03:00", "crawled": "2015-08-17T01:00:04.471+03:00", "highlightTitle": ""}