{"organizations": [], "uuid": "1563e0b118877d83090c812f4e7034f6b30889b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/30/12932714/San Diego Film Festival_San Diego Event.jpg", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/san_diego_event/san_diego_film_festival/prweb12932714.htm", "country": "US", "title": "San Diego Hotels like Declan Suites San Diego Prepare to Guests to The San Diego Film Festival and Other Popular Events", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "San Diego Hotels like Declan Suites San Diego Prepare to Welcome Guests to The San Diego Film Festival and Other Popular Events", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "1563e0b118877d83090c812f4e7034f6b30889b1"}, "author": "Michael Hibdon", "url": "http://www.prweb.com/releases/san_diego_event/san_diego_film_festival/prweb12932714.htm", "ord_in_thread": 0, "title": "San Diego Hotels like Declan Suites San Diego Prepare to Guests to The San Diego Film Festival and Other Popular Events", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "San Diego Hotels like Declan Suites welcome guests who come to the City to attend the San Diego Film Festival, a top San Diego Event. Filmmakers and film enthusiasts will come from around the country to attend this popular 5-day September event. Declan Suites offers to welcome fall visitors. View offer details > San Diego Film Festival\nSeptember 30 through October 4, 2015\nThe San Diego Film Festival features more than 100 films. The lineup will not be announced until the beginning of September, but past years have included premieres of many films that became huge hits – both critically and at the box office. Some of the movies that premiered at past San Diego Film Festivals are Silver Linings Playbook, 12 Years a Slave, The Good Lie, Imitation Games, Whiplash, and many others.\nIn addition to the film screenings, this San Diego event also includes parties, panel discussions with industry insiders, and more. A VIP pass gives attendees the chance to enjoy it all. The VIP Pass, which costs $500, includes all screenings, panels, and parties. Special screenings not open to other attendees are also included. A Festival Pass ($255) and a Day Pass ($75) are other options. Ticket bundles and tickets to single screenings are also available.\nThe screenings and other festival events take place at various venues. Attendees don’t need to worry about driving from venue to venue as free shuttles are provided. It is important to note the time it takes to travel from one venue to another when reserving seats at screenings. Travel time can be up to 30 minutes.\nDeclan Suites is a San Diego Hotel that is located near top dining, shopping, and attractions. Those coming to the City for a San Diego event can call the hotel at 855.968.3429.\nAbout Declan Suites – A San Diego Hotel:\nBoth business and leisure travelers find the Accommodations at Declan Suites to be a perfect choice. This San Diego Hotel is an all-suite property, and the 2-room guest suites are some of the largest in the city. This is the only all-suite Hotel in Downtown San Diego.\nDeclan Suites – A San Diego Hotel is conveniently located adjacent to Symphony Hall. The luxurious Hotel is also within walking distance of some of the most popular San Diego Attractions including the San Diego Zoo and some of the city’s top Museums.\nA host of Dining and Shopping options are also available near this Downtown San Diego Hotel, but guests don’t have to leave the building when they are hungry. Declan Suites has an onsite Restaurant for those nights when guests would rather stay in and get a little work done or, perhaps, enjoy the gorgeous views of the city skyline from their Guest Suite.\nThe 24-hour fitness center, knowledgeable Concierge, and thoughtful amenities are a few of the other features that make this San Diego Hotel a top choice for business and leisure travelers.\nPlanning a visit? Choose Declan Suites. The fabulous location, well-appointed Guest Suites and exemplary service make this Downtown San Diego Hotel an ideal choice. Visit the Hotel’s Website or call 855.968.3429.\nVisit the hotel's San Diego Visitors Guide to learn about nearby dining, shopping, and attractions.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kZWNsYW5zdWl0ZXNzYW5kaWVnby5jb20v", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kZWNsYW5zdWl0ZXNzYW5kaWVnby5jb20vc2FuLWRpZWdvLXZpc2l0b3JzLWd1aWRl", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5kZWNsYW5zdWl0ZXNzYW5kaWVnby5jb20vc3BlY2lhbC1vZmZlcnM="], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T16:23:18.484+03:00", "highlightTitle": ""}