{"organizations": [], "uuid": "ec682e3ac214d7491917c421e2134375011a7ba8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/470_245/55c2a1911d00002f00143fd1.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/news.xml", "section_title": "Travel News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/woman-who-snuck-into-cockpit-isnt-a-terrorist-officials-say_55c2a042e4b0923c12bb8a2e", "country": "US", "title": "Woman Who Snuck Into Cockpit Isn't A Terrorist, Officials Say", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Woman Who Snuck Into Cockpit Isn't A Terrorist, Officials Say", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T02:55:00.000+03:00", "replies_count": 0, "uuid": "ec682e3ac214d7491917c421e2134375011a7ba8"}, "author": "Andy Campbell", "url": "http://www.huffingtonpost.com/entry/woman-who-snuck-into-cockpit-isnt-a-terrorist-officials-say_55c2a042e4b0923c12bb8a2e", "ord_in_thread": 0, "title": "Woman Who Snuck Into Cockpit Isn't A Terrorist, Officials Say", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Woman Who Snuck Into Cockpit Isn't A Terrorist, Officials Say Posted: 08/05/2015 07:55 PM EDT Tim Viser SAUGET, Ill. (AP) -- A woman talked her way past a security guard early Wednesday and entered the cockpit of a private plane at an Illinois airport before she was caught and taken to a hospital for psychiatric observation, authorities said. Police in Sauget, Illinois, say the 38-year-old St. Louis woman entered a 20-seat Global Express jet on the tarmac of the St. Louis Downtown Airport about 4 a.m. Wednesday. Detective Sergeant Vito Parisi said the woman had started driving to Lambert-St. Louis International Airport but instead wound up at the smaller air field across the Mississippi River and just east of the city. The plane, which is owned by a Hong Kong bank, had been disabled while it underwent maintenance. Local prosecutors are reviewing the incident to determine whether to file criminal charges such as trespassing or burglary. Officials don't believe that the incident was connected to terrorism, but the FBI, Department of Homeland Security and federal prosecutors are involved in the investigation, and the local fire department and a county bomb squad responded as a precaution. Parisi said the woman - who surrendered without incident after her entry on the plane was caught on airport security cameras - was familiar with airplane operations. Sauget Police Chief Patrick Delaney told the Belleville News-Democrat that the woman had packed her luggage for a short vacation. She expressed an interest in flying to both New York and China but was not a trained pilot, the chief said. The airport is owned by the Bi-State Development Agency, a two-state government entity that operates the region's light rail and commuter bus systems. Officials declined comment, but a spokeswoman said in a written statement that \"security procedures are in place to prevent unauthorized persons from accessing the ramp.\" Parisi said that he expects the security breach to prompt more rigorous oversight at the airport. \"Obviously they're going to be making some serious changes,\" he said.", "external_links": [], "published": "2015-08-06T02:55:00.000+03:00", "crawled": "2015-08-06T03:30:14.198+03:00", "highlightTitle": ""}