{"organizations": [], "uuid": "9ea8dff478311b16b31e66181ba6b315817e36b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources2.news.com.au/images/2015/08/21/1227493/785750-9ce66180-47a8-11e5-ba64-b40512aab75c.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/kogan-travel-launches-promising-australians-huge-discounts/story-fn6yjihw-1227493786616?from=public_rss", "country": "IL", "title": "Kogan wants to save you a fortune on travel", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Kogan wants to save you a fortune on travel", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T15:06:00.000+03:00", "replies_count": 0, "uuid": "9ea8dff478311b16b31e66181ba6b315817e36b2"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/kogan-travel-launches-promising-australians-huge-discounts/story-fn6yjihw-1227493786616?from=public_rss", "ord_in_thread": 0, "title": "Kogan wants to save you a fortune on travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kogan", "Ruslan Kogan"], "text": "Ruslan Kogan is the founder of Kogan.com. Source: News Limited \nAUSTRALIANS could save a fortune on travel, the founder of online retailer Kogan promised. \nMultimillionaire entrepreneur Ruslan Kogan has set his sights on challenging the tourism industry with the expansion of his brand into the travel sector. \nWith Kogan Travel, the colourful Mr Kogan said he will offer a level of savings Aussies have “never seen before”. He claimed he can offer discounts of up to 76 per cent to popular domestic and international destinations, including Fiji and Thailand. \nKogan Travel’s business model will work similar to existing group buying sites by using the power of collective bargaining to deal with airlines, hotels and tour operators. Mr Kogan claimed this was possible because of Kogan’s large customer base. \n“We’ve applied the same approach of digital efficiency that has seen us undercut the big players in the retail industry for nearly a decade,” Mr Kogan said. “Australians are some of the best travelled people in the world. While we are fortunate to be able to holiday, there’s no reason we shouldn’t get a better deal while kicking our feet up. \n“Our huge community of over two million loyal Aussies gives us huge leverage when negotiating deals with hotels and resorts.” \nMr Kogan said his expansion into the sector was because the travel industry was one of the fastest growing ecommerce categories. \nBut he will face stiff competition. He has pitched himself against the likes of major discount travel sites including LastMinute.com.au and Living Social. Ruslan Kogan at the Kogan offices in Melbourne. Picture: Jake Nowakowski Source: News Corp Australia \nA frequent flyer himself, Mr Kogan has one piece of travel advice he wants to share with all Aussies setting off on their next holiday (well, for those lucky enough to experience an airport lounge). \n“Always use the airport lounge of the home airline because it’s always better. For instance, if you’re flying Cathay Pacific from Melbourne, use the Qantas lounge. If you’re flying Qantas from Hong Kong, use the Cathay Pacific lounge.” \nNoted!", "external_links": [], "published": "2015-08-21T15:06:00.000+03:00", "crawled": "2015-08-21T15:39:37.779+03:00", "highlightTitle": ""}