{"organizations": [], "uuid": "da8be92be835e2a77275eb0be14441b9c4847821", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63103/climate-finance-readiness-africa", "country": "US", "title": "Climate finance readiness in Africa", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Climate finance readiness in Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T12:09:00.000+03:00", "replies_count": 0, "uuid": "da8be92be835e2a77275eb0be14441b9c4847821"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/63103/climate-finance-readiness-africa", "ord_in_thread": 0, "title": "Climate finance readiness in Africa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Climate finance readiness in Africa   \nAug 28, 2015 eTN   \nThe newly established Africa Climate Change Fund (ACCF) has approved its first two projects in the past month. One will support Mali with preparatory funding to advance its low-carbon, climate resilient development agenda, and the second will strengthen data and information on climate change vulnerabilities and opportunities for 54 African countries. \nA grant of USD 404,000 from the ACCF will support the government of Mali to develop strategic programmes for a climate resilient and green economy in two key sectors, to elaborate a strategy for financing its transition to green and climate resilient growth, and to attract private sector investment in this transition. It will furthermore strengthen the capacity of the Malian Agency for Environment and Sustainable Development (AEDD), the executing agency for the project, in the management of climate finance. \nThe project is aligned with the Malian Government's vision to create a green and climate resilient economy, reaffirmed by President Ibrahim Boubacar Keita in 2014 in a communiqué of the Council of Ministers. The ACCF grant is expected to be complemented by support from other funders including the Green Climate Fund's readiness programme in order to advance a coordinated, programmatic approach to preparing the ground to achieve its ambitious goals. \nAfter the approvals, Aboubacar Diabate, Director of the Malian AEDD, said, \"Our sincere thanks to the AfDB for the confidence in Mali through our agency. We are proud to be the first country chosen to receive funds from the Africa Climate Change Fund and are committed to honour the terms of the agreement. These grants will support essential activities and lay the foundation for the promotion of a green and climate-resilient economy. It will strengthen the existing strategic partnership with the AfDB, as well as improve the mobilization of climate finance on a large scale.\" \nA second grant of USD 420,000, to be executed by the AfDB, will enable up-to-date information on climate change vulnerabilities, greenhouse gas emissions, and opportunities for climate change adaptation and mitigation to be produced for 54 African countries, tailored to the specific information needs of each country. It will further develop a global platform for sharing and updating the information in the profiles, and provide training for staff of economic and planning departments in African countries to understand and apply the data. The project will equip African countries with strengthened data and capacity to strategically plan for long-term climate change interventions and to access international climate finance. \nBoth projects are aligned with the Bank's Strategy 2013-2022 which focuses on the twin objectives of inclusive and green growth across the continent, as well as with its Climate Change Action Plan 2011-2015. “The approval of the first two projects marks a significant milestone for the ACCF, which is an important instrument in helping African countries to access climate finance to enable a transition to climate-resilient, low carbon development,” said Alex Rugamba, Director of the Bank's Department of Energy, Environment and Climate Change. \nThe Bank-managed ACCF was established in April 2014 with a EUR 4.725 million contribution from Germany with the objective to scale up climate smart development in African countries by increasing the mobilization of international climate finance. It provides support for activities ranging from strengthening capacity of African institutions to access and manage climate finance, to developing impactful projects and programs that will attract climate finance from the Green Climate Fund and other sources. According to the Secretariat of the ACCF, there are a further 20 projects in the ACCF's pipeline that are currently undergoing appraisal, and there are plans attract further funding and scale the ACCF up to a multi-donor trust fund in the coming months.", "external_links": [], "published": "2015-08-28T12:09:00.000+03:00", "crawled": "2015-08-28T17:09:11.972+03:00", "highlightTitle": ""}