{"organizations": [], "uuid": "3a9f8b817e4e36a629568ac6a58ef5f8b5bc1059", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/RTEmagicC_20150821_foodlovers03.jpg.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/daniel-schlaipfer-cooking-is-like-haute-couture/", "country": "US", "title": "Daniel Schlaipfer: “Cooking is like haute-couture”Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Daniel Schlaipfer: “Cooking is like haute-couture”Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "3a9f8b817e4e36a629568ac6a58ef5f8b5bc1059"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/daniel-schlaipfer-cooking-is-like-haute-couture/", "ord_in_thread": 0, "title": "Daniel Schlaipfer: “Cooking is like haute-couture”Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Daniel Schlaipfer: “Cooking is like haute-couture” Published on : Saturday, August 22, 2015\nFrom the mountains of Bavaria to the beaches of Portugal, Daniel Schlaipfer worked in restaurants all across Europe learning the tricks of his trade, until he developed his very own cuisine, a fusion of Northern and Southern influences, which you can discover at AdLib, the Sofitel Lisbon Liberdade’s restaurant where he is now the Executive Chef.\nYou’re a German chef, living in Lisbon and cooking for international guests. What culinary experiences led you to this?\nIt all began in my home town, Garmish-Partenkirchen, which is a ski resort 70km from Munich. As you know, it’s close to Austria and we share the same taste for regional, seasonal products: mushrooms and Brussel sprouts in the winter, white asparagus and rhubarb in the spring, etc. This local cuisine, which is also what my mother cooked, has always been very important for me.\nSo much so that you decided to make a profession of it?\nYes, but the education system also played a part in my decision. In Germany, you are asked to choose a profession and must spend three years learning your trade in a company. I chose cooking. After three years, you’ve learnt the basics. If you’re still around, then you’re made for this job!\nDo reassure us, you’re not referring to the vacuum-packed meals that are currently engulfing restaurants?\nNo, not at all! (Laughs) I’m referring to a technique that allows you to cook meat perfectly with a tender, melt-in-the-mouth result. For example, instead of roasting a shoulder of lamb in the oven for two and a half hours, I cook it under vacuum at 66°C for 24 hours. This pre-cooking technique is like pasteurizing and allows you to keep the product for ten days in the fridge without losing its nutritional qualities or taste.\nWhat products and recipes have you come across in Portugal?\nMy wife is Portuguese and her grand-mother has introduced me to the country’s traditional dishes. There’s a lot of variety from North to South, but sometimes the recipes are very similar and only the name changes. For example, there’s a way of preparing rice, like in a Valencian paella, but with more liquid. Portugal is above all a treasure-trove of good produce: fruit, cured meats, unique cheeses and Atlantic seafood, such as Algarve shrimp, black mussels, sea urchins and red mullet.\nIn what way does this inspire your menu?\nI adore seafood, so my menu features the “Sea Mix”, a dish that allows guests to sample all of these products. We also serve a typical dish made of minced pork which is marinated overnight in white wine, paprika, onions and bay leaves. Then it’s fried with mushrooms, garlic and parsley and served with potatoes. I’ve also adapted a Bavarian recipe, the one with dumplings. They’re made with stale bread, milk and eggs, to which I add Portuguese Farinheira sausages. I particularly enjoy creating dishes that blend features from different cultures and techniques.\nSource:- Accor", "external_links": [], "published": "2015-08-22T03:00:00.000+03:00", "crawled": "2015-08-22T18:07:42.057+03:00", "highlightTitle": ""}