{"organizations": [], "uuid": "b4d051909fa75242dc25a0fefb281ea7b9fa7c3a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "airtravel.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/200243294-001.jpg", "site_section": "http://z.about.com/6/o/m/airtravel_t2.xml", "section_title": "About.com Air Travel: What's Hot Now", "url": "http://airtravel.about.com/od/travelplanning/tp/Want-the-Lowest-Air-Fares-These-Websites-and-Apps-Can-Help.htm", "country": "US", "title": "When is the best time to buy a plane ticket?...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "When is the best time to buy a plane ticket?...", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T14:01:00.000+03:00", "replies_count": 0, "uuid": "b4d051909fa75242dc25a0fefb281ea7b9fa7c3a"}, "author": "", "url": "http://airtravel.about.com/od/travelplanning/tp/Want-the-Lowest-Air-Fares-These-Websites-and-Apps-Can-Help.htm", "ord_in_thread": 0, "title": "When is the best time to buy a plane ticket?...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expert Videos \nAs an air travel expert, I’m always asked the question: when is the best time to buy an airline ticket? A report by Expedia and Airlines Reporting Corporation (ARC) helped answer this question in a white paper entitled Preparing for Take-Off: Air Travel Trends 2015 . And there are websites that can also help travelers know the best times to book a flight. \nThe report offered advice that some might think was vague: fares will vary on any given route and on any given day. “There are no magic algorithms for flight booking. However, a look at historical averages reveals that flight prices are traditionally driven by two distinct measures of time: day of week and number of days until the flight date,” it said. \nExpedia's analysis of its own data reveals that, by the slimmest of margins, Tuesday is holding onto its perch as the day on which air shoppers find the cheapest flights at purchase time. More important is the day of travel. \n“International travelers who are able to leave on Thursday and return on Monday will enjoy the greatest savings on average. Domestic travelers opting for a long weekend can save up to roughly 25 percent on short-haul flights when booking a Saturday departure to Tuesday return over the more expensive Sunday departure and Monday return,” said the report. \nAnalysis in the report, using data from ARC, found that on domestic routes, the lowest-priced fares should be found within 50 to 100 days of departure, while the lowest fares were found 57 days prior. “Domestic flight fares tend to remain relatively stable during that 50-to-100-day window,” it said. “For international routes, the lowest price fares are found farther in advance – between 150 and 225 days – while the lowest price found was 171 days prior to departure. For routes originating and ending in North America, customers may save anywhere from $195 to $225 when booking flights more than three weeks ahead of departure.” \nBelow is a list of websites and apps that can help predict the best time to buy a flight. Image courtesy of Hopper 1. Hopper \nThe Hopper iPhone app uses data-driven research to help travelers make better decisions about where to go, and when to fly and buy. After entering in your information, the app predicts price changes and tells you the best time to book a flight, adding it can save travelers up to 40 percent. For example, Hopper says that the best time to fly between Washington, D.C., and Fort Myers, Florida, is the first week in March, while the first week of April is more expensive. More » Image courtesy of Flyr 2. Flyr \nThis simple website asks for your origin, destination and travel dates, with the results listed by price. It also allows users to filter for departure times and by airline. Once you click on a fare, a window will show a “buy” or “wait” rating, with different predictors, along with a 7-day extended forecast that shows how the fare is likely to evolve over time. Users can check back for lower fares or sign up for a FareBeacon fare alert, which automatically notifies in the case of a shift to BUY for a specific flight. More » Image courtesy of Skyscanner 3. Skyscanner \nThis website and app allows travelers to look at fares by day, by week, by month or by year. The results are published by a chart or by calendar. Roundtrip fares between Washington, D.C., and Fort Lauderdale, Florida ranged from $137 to a high of $496. Once you choose a flight, you can book it or sign up for fare alerts in case they drop. More » \nThis website offers travelers to receive fare alerts by email when there are price changes based on city-to-city, departure city and arrival city. A recent alert told me about a $97 roundtrip fare between Boston and Baltimore on JetBlue . More » Related Articles", "external_links": [], "published": "2015-08-17T14:01:00.000+03:00", "crawled": "2015-08-17T23:14:02.010+03:00", "highlightTitle": ""}