{"organizations": ["Pearl Media", "JetBlue"], "uuid": "90c3c632d40390c58adef882bf780d01cd438b34", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.mediapost.com", "main_image": "http://s3.amazonaws.com/static.mediapost.com/publications/images/mp-logo-fb.jpg", "site_section": "http://feeds.mediapost.com/marketing-travel", "section_title": "MediaPost | Marketing: Travel", "url": "http://www.mediapost.com/publications/article/256253/making-the-virtual-real.html", "country": "US", "title": "Making The Virtual Real", "performance_score": 0, "site": "mediapost.com", "participants_count": 0, "title_full": "Making The Virtual Real", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T16:45:00.000+03:00", "replies_count": 0, "uuid": "90c3c632d40390c58adef882bf780d01cd438b34"}, "author": "", "url": "http://www.mediapost.com/publications/article/256253/making-the-virtual-real.html", "ord_in_thread": 0, "title": "Making The Virtual Real", "locations": ["Philippines", "New York", "Texas"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Josh Cohen", "Cohen", "Pearl"], "text": "Comment So you’re walking down the street and a virtual avatar JetBlue crew member in a storefront window addresses you in a very specific way — commenting on your hat, the way you walk, whatever. You have an exchange with the avatar, which turns out to be pitching for the airline. The avatar has all the attributes of a hologram/virtual being but then at the end of the exchange a live person steps out, gives you a hug and a gift certificate for a flight on JetBlue. This virtual/reality combo is a specialty of a company called Pearl Media, which puts together customized “digital vacations” for clients in a number of industries, but which has travel accounts like the Philippines and Texas tourist offices. It’s a way of combining the appeal of a virtual experience but brought to a “real world” place. Josh Cohen, who heads up Pearl Media, says his team uses “real estate” (the right locations) and technology to capture customers on their way to work, shop or wherever to spread a brand message and to increase engagement with that brand. For the JetBlue avatar in New York, Pearl built out a full production studio in space and filmed the crew member so that she would be projected onto the street as an avatar. Of course, the great thing about these situations is that they contain the seeds of viral popularity. They tend to be viewed by hundreds of thousands of potential customers — 15 million impressions for JetBlue over a period of a few weeks — partly with the aid of Pearl itself. The company makes sure that content is sent out to influencers and social media. For Texas, Pearl organized a five-month tour to major source destinations like state fairs and music festivals. A massive Texas “footprint’ was set up at those places where visitors were able to experience Texas in customized interactive kiosks that looked like passport folds. By touching their Texas “passport” to a screen, visitors could enjoy one of six different experiences: manipulating jet skis, training a dolphin, herding cattle, etc. And depending on how many experiences they completed, the visitors walked away with Texas-style gifts. Of course, the visitors provided personal data so Texas could follow up with marketing. A similar campaign was created for the Philippines where consumers could — by waving their hands in front of an interactive screen in a mall or other public place — go mountain climbing or scuba diving or rock climbing. Photos were snapped and those photos could be sent to friends as postcards. “The key,” says Cohen, “is to provide an engaging, fun experience they want to share socially. We rely on consumers to share these.” It all sounds ambitious and expensive but Cohen says campaigns can be scaled to budgets. “It’s all about inspiring somebody to take action and engage and end up with a positive feeling about the brand. “ Virtual reality through gear like Oculus headsets is gaining traction as a way to experience digital vacations but that doesn’t mean there isn’t space in between real and virtual to take a marketing stand. If you like the idea of turning ”real” estate virtual, think about this kind of campaign. It could be the best of both the real and virtual worlds. 3", "external_links": [], "published": "2015-08-17T16:45:00.000+03:00", "crawled": "2015-08-18T11:22:32.236+03:00", "highlightTitle": ""}