{"organizations": [], "uuid": "e59f06285d505de94e14b334e19631a4f0d93787", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/5/q/6/m/image.related.StuffLandscapeSixteenByNine.620x349.165pyh.png/1438646312939.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/asia/70810793/A-heart-pounding-view-of-Hong-Kong", "country": "AU", "title": "A heart-pounding view of Hong Kong", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "A heart-pounding view of Hong Kong", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T02:58:00.000+03:00", "replies_count": 0, "uuid": "e59f06285d505de94e14b334e19631a4f0d93787"}, "author": "Megan Levy", "url": "http://www.stuff.co.nz/travel/destinations/asia/70810793/A-heart-pounding-view-of-Hong-Kong", "ord_in_thread": 0, "title": "A heart-pounding view of Hong Kong", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A heart-pounding view of Hong Kong MEGAN LEVY Last updated 11:58, August 4 2015 BOBBY YIP/Reuters \nVisitors to the Victoria Peak tourist spot admire the view of Hong Kong's Central district, the territory's financial area \nYou could fork out cash for a stint in a spa and sauna during your trip to Hong Kong. Or you could simply lace up your boots and take a hike up Victoria Peak, guaranteed to leave you with a sheen on your brow more pronounced than any of the city's health resorts could deliver. \nMost visitors to Victoria Peak, one of Hong Kong's most popular tourist attractions, whiz up the 552-metre incline on the hair-raising Peak Tram to take in the vista from the highest point on Hong Kong Island. If the weather is kind, you get a sweeping view of the sprawling metropolis below, with its towering skyscrapers, ferries snaking across the harbour and the mountains and countryside stretching beyond. As the sun sets, the cityscape begins to twinkle and flash with neon in a scene even a seasoned travelled won't forget too soon. \nBut if you're athletically inclined and want to earn that view, then you can bypass the crowd and literally take the road less travelled. \nOld Peak Road begins just above the Hong Kong Zoological and Botanical Gardens and, for the vast majority of the way, is pedestrian-only. Its shaded path snakes through rich forest and, in this city of seven million souls, it can be a welcome escape from the urban throngs. \nDon't be fooled into thinking this is a stroll in the park, however. Imagine ratcheting up the incline on a treadmill to just about maximum, and then throwing in a dose of high humidity, and you've got a recipe for a heart-thumping Hong Kong experience. \nDon't do what I did and set off at 11am, unless you too would like to reach the top looking like you've just climbed out of a pool. This point is not to be understated – you will sweat, a lot. Many of the people slogging it out on the day I was there seemed to be locals, dressed in their quick-dry workout gear and getting in their daily dose of exercise. A water bottle or two is a must for this hike. \nVictoria Harbour from Victoria Peak. \nAt a quick clip it takes about 25 minutes, but you can take it at your own pace. The couple I passed, who were stopping every 10 steps or so, were a case in point. \nOnce at the top, and if you're still raring to go, there is a web of walking trails that ring the peak and deliver more stunning views. Ad Feedback \nThe easy Peak Circle Walk begins at Lugard Road, near the Peak Tower and Galleria, which is filled with shops and cafes, and even a Madam Tussauds. \nThe walk takes you down some narrow cliff-side paths that lead to Lugard Road lookout, which will give you panoramic views of Victoria Harbour. \nLugard Road then runs into Harlech Road where, again, you'll most likely encounter joggers and dog-walkers powering past. The 3.5-kilometre circuit takes a leisurely hour to walk and will spit you out where you started, \nAbout 500 metres to the north-west of the Peak Tower is the site of old governor's mountain lodge, which was burned to the ground during World War II. Its beautiful gardens still remain, however, and are less frequented by the crowds, making it a nice stroll. \nREAD MORE: 20 reasons to visit Hong Kong \nHong Kong's West Kowloon reclamation area is seen from the island's Victoria Peak. Photo: Reuters/Bobby Yip \nIf you're still itching for more, The Peak is also the start of the 50-kilometre Hong Kong Trail hike to Shek O and Big Wave Bay. It is made up of eight sections that can be tackled separately. The final section, a two-hour hike along Dragon's Back – so named because the undulating path is said to resemble that of, yes, a dragon's back – was voted the best urban hiking trail in Asia by Time Asia . The lookout on 284m-high Shek O peak provides stunning views along the coast and out to the islands. You might just be tempted to hike down to Big Wave Bay and hurl yourself into the water after that workout, or enjoy a seafood feast on the beach. You can take public transport back to the city from the end of the trail. \nIn a city perhaps better known for its designer handbags and dumplings, a simple stroll through nature can unveil a different side of Hong Kong. \nMORE INFORMATION discoverhongkong.com \nGETTING THERE Qantas and Cathay Pacific fly to Hong Kong daily. See qantas.com.au ; cathaypacific.com \nSTAYING THERE Hotel Icon, 17 Science Museum Road, Tsim Sha Tsui East, Kowloon, Hong Kong, is located in the museum district, and is close to the city's extremely efficient public transport system. Access is easy to the city's major tourist attractions. Rooms start from around $355 a night for two adults. See hotel-icon.com \nThe writer was a guest of Hotel Icon.", "external_links": [], "published": "2015-08-04T02:58:00.000+03:00", "crawled": "2015-08-05T07:05:45.793+03:00", "highlightTitle": ""}