{"organizations": [], "uuid": "d8d7d226151ec514d09b87b0ec742a42ad4aa0f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297738280829_LARGE_BOX.jpg?quality=80&stmp=1439944906858&size=100x", "site_section": "http://www.calgarysun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.calgarysun.com/2015/08/18/hobart-art-museum-has-something-to-offend-everyone", "country": "CA", "title": "Hobart art museum has something to offend everyone", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "Hobart art museum has something to offend everyone", "spam_score": 0.0, "site_type": "news", "published": "2015-08-18T22:55:00.000+03:00", "replies_count": 0, "uuid": "d8d7d226151ec514d09b87b0ec742a42ad4aa0f7"}, "author": "", "url": "http://www.calgarysun.com/2015/08/18/hobart-art-museum-has-something-to-offend-everyone", "ord_in_thread": 0, "title": "Hobart art museum has something to offend everyone", "locations": ["Hobart"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Report an error \nHOBART, Tasmania -- Multi-millionaire gambler and businessman David Walsh's Museum of Old and New Art (MONA) is the nearest thing to the lair of a Bond-movie super-villain ever likely to be open to the public. \nOpened in 2011, it occupies a privately owned peninsula reached by a dedicated high-speed catamaran service. Its unusual galleries have been cut up to 17 metres down into khaki-coloured sandstone. Entrance is via a circular glass elevator hidden inside a mansion. \nEven in Paris or London this $80-million underground art labyrinth housing a $100-million art collection would attract considerable comment, but on a sparsely populated island backwater that many \"mainland\" Australians regard as remote it has drawn attention away from almost everything else. In terms of putting the Tasmanian capital on the international art-lover's map, MONA has done for Hobart what the Guggenheim Museum did for formerly unknown Bilbao in Spain. \nWalsh has described the site as \"a subversive Disneyland,\" and while the only true link between the pieces in the collection is that he likes them, he'll admit there's a great deal of sex and death. \nInstead of exiting through the gift shop, visitors enter through a wine bar. The elevator doors open on neo-classical seating and a counter well-stocked with bottles beneath a towering wall of sandstone. \nIf much of the impressive collection beyond is rather routinely subversive, Walsh is determined to subvert even that, and question whether any of it should be taken seriously at all. \nHis view is art criticism is too often a form of self-stimulation, and he's rightly incensed by what he calls \"retro-fit.\" He hates artists who make art and then make up an explanation, curators who invent themes, and critics who see meaning in coincidence. \nThere's a free audio guide on a modified iPod Touch. Press a button and the device lists nearby works. Choose one to get a screen of basic information or another for further details. \nThese have labels such as \"Gonzo\" as in journalism, mostly commissioned from a writer deliberately ignorant of art, or contributed by Walsh himself. Many read lile the millions of blog posts, which have now made gonzo writing more common than the real thing. \nThe collection contains something to offend anyone inclined to be offended. The pieces rotate, but you may see Stephen Shanabrook's remains of a suicide bomber cast in chocolate; Julia deVille's self-explanatory Kitten Trophy Rug; Chris Ophili's famous elephant-dung-splattered Holy Virgin Mary; Greg Taylor's row of 150 different cast-from-life vaginas, and Walsh's display of the urn containing his late father's ashes. For about $75,000 you can have yours interred here, too. \nBut about 70% of the collection is antiquities, and there is much of simple, lasting beauty, including a small Roman bronze of Leda and the Swan, and a Ptolemaic statue of a falcon in carved basalt. Many of these can only be seen by peering in through small windows in two 22-metre-long rippling walls covered in 7,000 leaves of hammered gold. \nMONA's bunker architecture, its charming location and its placing together of the stimulating, the sublime and the simply specious makes it arguably the planet's most thoroughly entertaining art museum. \nNEED TO KNOW \n-- For information on the Museum of Old and New Art, see mona.net.au . \n-- For travel information, visit the Tourism Australia website at australia.com . \nMore stories at culturelocker.com \nBy adding a comment on the site, you accept our terms and conditions . Sponsored Links", "external_links": [], "published": "2015-08-18T22:55:00.000+03:00", "crawled": "2015-08-19T05:47:19.668+03:00", "highlightTitle": ""}