{"organizations": [], "uuid": "ce36d0c48452342956b78aecb121f6d91ff1ceb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03404/palio1_3404908k.jpg", "site_section": "http://www.telegraph.co.uk/travel/rss", "section_title": "Telegraph Travel", "url": "http://www.telegraph.co.uk/travel/destinations/europe/italy/10718886/The-Siena-Palio-how-to-see-the-race.html", "country": "CH", "title": "When is the Palio di Siena and how can I see it?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "When is the Palio di Siena and how can I see it?", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T19:45:00.000+03:00", "replies_count": 0, "uuid": "ce36d0c48452342956b78aecb121f6d91ff1ceb9"}, "author": "Lee Marshall", "url": "http://www.telegraph.co.uk/travel/destinations/europe/italy/10718886/The-Siena-Palio-how-to-see-the-race.html", "ord_in_thread": 0, "title": "When is the Palio di Siena and how can I see it?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Comments What is the Siena Palio? \nIt’s perhaps Italy’s most famous annual sporting event. But Siena’s Palio is as much about pageantry, civic identity and Sienese pride as it is about a bareback horse race that lasts, on average, just 75 seconds. \nHeld in honour of the Virgin Mary, the race takes place twice a year, on 2 July and 16 August. Ten of the city’s seventeen contrade , or districts, are represented by a horse and jockey in each race. The seven districts that didn’t race in the previous July or August contest compete by right, and are joined by horses from three lucky ‘repeat’ contrade, drawn by lot. \nThe race is no tourist-board invention, like some of Italy’s supposedly \"Medieval\" fairs, jousts and pageants: it has been held almost uninterruptedly in Siena’s civic hub, Piazza del Campo, since 1644 at least. And it’s certainly not staged for the benefit of visitors. In fact, the 40,000 Sienese who crowd into the Campo on race day (two-thirds of the city’s population) are largely oblivious to their 20,000 Italian and international guests. To gauge the strength of contrada loyalties, bear in mind that it is still common for ‘mixed-marriage’ couples to separate for the days leading up to and including the race if the contrada of the husband and wife both have a horse in contention. \nAll this means two things for anyone keen to observe the race. The first is that you’re guaranteed an electric atmosphere matched by few sporting events in Italy outside of football derbies. The second is that you need to plan well ahead, as nobody is going to make you a gift of a grandstand ticket. \nTo absorb the charged atmosphere, it’s worth coming to Siena at least four days before the race itself Photo: GETTY When is the Siena Palio? \nThe race takes place on July 2 and August 16. \nTo absorb the charged atmosphere, it’s worth coming to Siena at least four days before the race itself. By this time, Piazza del Campo will already have been turned into a race-track, with workmen covering the course around the outside of the scallop-shaped piazza in yellow earth and staking out the central area which is the only free vantage point. \nIn the days leading up to the Palio, you can witness la tratta (the selection of the horses, around midday on June 29 and August 13), and the six horse trials that take place from the evening of la tratta day to the morning of Palio day. To watch these, make sure you’re in the cordoned-off area in the centre of the square by 8.40am for morning trials and 7.15pm for evening trials. \nThe other great Palio tradition are the festive open-air dinners each contrada holds on the evening before the race – on July 1 and August 15 – with trestle tables running the length of the district’s main street or filling up the main piazza. There are various Siena insiders who can get you into one of these (see below for a couple of recommendations), but an alternative is just to turn up a day or so before at the HQ of your chosen contrada and ask (addresses can be found at ilpalio.org ). Typically, a dinner ticket costs around €50 a head. \nTo the despair of photographers, the race itself takes place just as the day’s light is fading, after a seemingly endless melée in which horses and riders jockey for position behind the canapa, or starter’s rope. It’s preceded by a two-hour-long procession in historical costume which evokes the glory days of the Sienese Republic in the thirteenth and fourteenth centuries, when it was the centre of the Italian banking system and had the same population as Paris. \nTo the despair of photographers, the race itself takes place just as the day’s light is fading Photo: GETTY How to visit the Palio \nThere are three ways to see the race. The easiest – and the only one if you haven’t made advance preparations – is to take up position in the cordoned-off area in the centre of the piazza, sometimes referred to by locals as il palco dei cani or ‘the dogs’ stand’. There’s no charge for this; however, if you want to grab a good viewing position, you’ll need to turn up in the morning, the earlier the better, and be prepared for a long wait. The latest you should get there is about five hours before the race - say 3.30pm for the July Palio, and 3pm for the August one, as this is when they begin to clear the racetrack. \nBe aware that there are no toilet facilities in this central section, though there are soft-drink sellers and first-aid posts. Bring plenty of water, and make sure you have hats and sun-block. Raincoats are optional; if it rains with any intensity in the hour or so before the Palio itself, the race will in any case be postponed until the following day. Given the wait, the lack of seating and pìpì-pavilions, and the crush as the square fills up, this is not a place for young kids. \nThe second possibility is to book a seat on one of the stands or palchi around the square; those closest to the mossa (the starting and finishing line) cost the most. Nothing about the Palio is straightforward, so it should come as no surprise that you can’t just turn up at the tourist office and buy a ticket. Palchi are owned and run by the bars, restaurants or shops they stand in front of – so try asking if you happen to be in Siena months before the event, or better still ask this year for next. Prices are in theory agreed with the town council, and range from around €160 to €350 per seat. \nFinally, there are the windows, or better still the balconies, of the houses and palazzos overlooking the square. The lucky (often aristocratic) owners of these can charge exorbitant prices – from €350 upwards – for the right to a viewing perch. If you’re interested, one of the Palio insiders listed below under Contacts can hook you up with the right contessa or marchese (and may be able to source stand tickets too). \nWhatever your vantage point, make sure you choose a contrada to root for – it makes the whole experience so much more fun. Once you’ve found one, and bought the appropriate scarf – readily available from souvenir stalls and shops – you’ll want to catch the priestly blessing of the horse and jockey in the official contrada church early in the afternoon of the Palio day (if the horse leaves a steaming visiting card on the church floor, it’s considered to be a good omen). And if your contrada wins, you can try crashing the victory dinner that evening. Your adoptive contradaioli are likely to be too happy, and too drunk, to resent the invasion. \nBring plenty of water, and make sure you have hats and sun-block Photo: GETTY Where to stay \nThe hotel Castel Monastero, in the hills south of Siena, offers three-night packages including access to a private window overlooking the piazza, with a buffet supper with wine - full details at castelmonastero.com. Hotel rooms in Siena’s centro storico get booked out several months in advance for the days of the Palio. Whenever you book, expect to pay around double the low-season rates. If you like to plan well ahead – for the 2015 or 2016 races, say – you may still find rooms at delicious six-room boutique gem Campo Regio Relais (25 Via della Sapienza; +39 0577 222 073; camporegio.com ; Palio-period doubles from €300 with a minimum three-night stay) or characterful historic three-star Palazzo Ravizza (Via Pian dei Mantellini 34, +39 0577 280 462; palazzoravizza.it , Palio-period doubles from €200 with a minimum three-night stay). For this year’s Palio, look outside the centre. One good tip is to base yourself near one of the stations on the little train line that winds east towards Chiusi. In the laid-back town of Sinalunga, the famed Locanda dell’Amorosa (Località L’Amorosa; +39 0577 677211; amorosa.it ; doubles for Palio period from €270 a night) is a Tuscan hamlet converted into a deliciously romantic country hotel. And in the centre of the pretty walled village of Serre di Rapolano, Palazzo Bizzarri (Via Matteotti 5; +39 348 784 8761; palazzobizzarri.it ; doubles from €85 with breakfast) is a little insider secret: a great-value B&B inside a fortified palazzo dating back to the thirteenth century, with just two guest rooms done out in a warm antique style. \nUnless you have a ticket, you need to arrive in Siena by about 3pm to have a chance of a view of the race Contacts \nAmong Siena insiders who can spring you into contrada dinners are Emily FitzRoy of high-end Italy experts Bellini Travel ( bellinitravel.com ) and Tuscan event organizer and Palio specialist Jacopo della Torre ( jacopodellatorre.com ). \nThe official Palio website (Italian only) is comune.siena.it/La-Citta/Palio . \nSiena’s main tourist information office is inside the Santa Maria della Scala complex in Piazza del Duomo (+39 0577 280551, terrasiena.it ). Read more \nDramatic images from last year's race More on Italy", "external_links": [], "published": "2015-08-11T19:45:00.000+03:00", "crawled": "2015-08-11T20:38:32.653+03:00", "highlightTitle": ""}