{"organizations": ["Way Forward Travel & Tourism"], "uuid": "63bb29408f1290c2f48c7a3afd76d56c10df4165", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.modernghana.com", "main_image": "http://img.modernghana.com/images/content/ydtg83ivv5_shutterstock_148307639.jpg", "site_section": "http://www.modernghana.com/rssfeed/news.xml?cat_id=1&gender=25", "section_title": "Travel & Tourism", "url": "http://www.modernghana.com/news/637555/1/boosting-tourist-arrivals-way-forward.html", "country": "US", "title": "Boosting Tourist Arrivals: Way Forward", "performance_score": 0, "site": "modernghana.com", "participants_count": 0, "title_full": "Boosting Tourist Arrivals: Way Forward", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T18:49:00.000+03:00", "replies_count": 0, "uuid": "63bb29408f1290c2f48c7a3afd76d56c10df4165"}, "author": "", "url": "http://www.modernghana.com/news/637555/1/boosting-tourist-arrivals-way-forward.html", "ord_in_thread": 0, "title": "Boosting Tourist Arrivals: Way Forward", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel & Tourism | 20 August 2015 16:49 CET Boosting Tourist Arrivals: Way Forward Source: Jovago.com \nRecent occurrences across the African continent have resulted in a sharp drop of tourist arrivals. The 6% decline in the tourist numbers can be credited to acts of terrorism which have occurred across the continent from the Sousse attack in Tunisia to the Garissa attack in Kenya and the Boko Haram menace in Nigeria. \nThe insecurity does not stop here but is also extended to the maintenance of state and private infrastructure - the killing of a woman at Lion Park, Johannesburg underlies not only the lack of enforcement measures for the park rules but also the poor management as an ambulance couldn’t be made immediately available. \nThe list goes on but these events not only cause panic for the locals but for foreigners as well. Jovago.com shows some interesting pointers which could boost tourist arrivals as well as render the country much more habitable for the locals. \nGovernment focus on security supported by affirmative action is important in order to ensure that both locals and foreigners are reminded that their safety is a key priority for the government. On the other hand, a nonchalant government would show no effort to alleviate the fears of its populace and ensure their safety. This would not fare well for the progress of the nation in general aspects as well as in terms of tourism which is a major source of employment for many African countries. \nAfter visible efforts on the part of the government to ensure security, the consolidation of their efforts can commence. This is seen in the case of Kenya which is undergoing its consolidation phase after the unfortunate Garissa attack. The visit of President Barack Obama, the Global Entrepreneurial Summit amongst others have gone a long way in consolidating the safety of the country in the minds of not only the locals but also for tourists and this is projected to have a positive impact on the tourist numbers. \nSetting up enforcement capacities in destinations where safety rules need to adhered to is also important in order to ensure the safety of the visitors. This would result in good reviews which would subsequently boost the attractiveness of these destinations for tourists. \nBy putting into place these measures, the decline that was witnessed in the tourist numbers is sure to be reversed and this would have a positive impact. The key aspect is to ensure sustainability for the measures to be continuously reinforced. What other measures could be enforced to boost the rate of tourist arrivals? \nAbout Jovago \nJovago.com is an online hotel booking service with offices in Lagos (Nigeria), Nairobi (Kenya), Dakar (Senegal) founded by Africa Internet Group and has MTN and Millicom as investors. Jovago.com, Africa’s No.1 booking portal, facilitates the booking process for its users to provide them with the best hotel booking experience with fast, transparent and easy-to-use services. Jovago.com has over 25,000 local hotel listings across Africa and over 200,000 hotels around the world.", "external_links": [], "published": "2015-08-20T18:49:00.000+03:00", "crawled": "2015-08-20T22:26:29.146+03:00", "highlightTitle": ""}