{"organizations": [], "uuid": "0546dcb189673f2f062618dace4667f1d7e40977", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28048-carlson-rezidor-announces-the-radisson-blu-plaza-hotel-ljubljana", "country": "US", "title": "Carlson Rezidor announces the Radisson Blu Plaza Hotel, Ljubljana", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Carlson Rezidor announces the Radisson Blu Plaza Hotel, Ljubljana", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T14:30:00.000+03:00", "replies_count": 0, "uuid": "0546dcb189673f2f062618dace4667f1d7e40977"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28048-carlson-rezidor-announces-the-radisson-blu-plaza-hotel-ljubljana", "ord_in_thread": 0, "title": "Carlson Rezidor announces the Radisson Blu Plaza Hotel, Ljubljana", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carlson Rezidor announces the Radisson Blu Plaza Hotel, Ljubljana Carlson Rezidor announces the Radisson Blu Plaza Hotel, Ljubljana Details Created   12:30 The group’s first hotel in Slovenia Carlson Rezidor, one of the most dynamic hotel groups worldwide, announces their first hotel in Slovenia – the Radisson Blu Plaza Hotel, Ljubljana. The property featuring 236 rooms is the conversion of an existing hotel and will be re-branded in late 2015. Ljubljana is the capital city of Slovenia, the 79th country Carlson Rezidor is present in. \n“We are delighted to arrive in a new country and to further expand our strong network in capital cities of Central and Eastern Europe. The Radisson Blu Plaza Hotel will be the first internationally branded upper upscale hotel in Ljubljana and add new value to the local hospitality sector”, said Wolfgang M. Neumann, President & CEO of Rezidor. “This transaction reflects our pioneering mind-set to enter new markets. Slovenia offers considerable potential for further growth of travel and tourism. We will be part of the country’s growth journey, making our contributions to the local economies and aiming to bring our core brands Radisson Blu and Park Inn by Radisson to primary and secondary locations in the country”, added Elie Younes, Executive Vice President & Chief Development Officer of Rezidor. The Radisson Blu Plaza Hotel is located 3km from Ljubljana’s centre and is part of BTC City, the most important Slovenian business, shopping, entertainment and cultural centre. Besides 236 guest rooms with signature services such as free high speed internet access it will offer an all-day-dining restaurant, a lobby bar, a top floor bar, 3 meeting rooms and 1 board room, a gym, and parking bays. Slovenia is located at the crossroads of the main European trade and cultural routes, and Ljubljana is the nation’s capital. Besides governmental business also industries like pharmaceuticals and petrochemicals, and banking & finance services mark the city. Due to its natural beauty and rich cultural heritage, Slovenia attracts a growing number of international tourists, and aims to further increase its attractiveness and competitiveness. Related articles", "external_links": [], "published": "2015-08-04T14:30:00.000+03:00", "crawled": "2015-08-04T15:11:07.556+03:00", "highlightTitle": ""}