{"organizations": [], "uuid": "99e69d14e31d29a84f586d91c631ff56a932a8b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/08/4b9a8618-4d1f-11e5-8435-225130ffceaa-1200x630.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/business/technology/review-new-phones-tablets-keep-samsung-at-android-helm/", "country": "EU", "title": "Review: New phones, tablets keep Samsung at Android helm", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Review: New phones, tablets keep Samsung at Android helm | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T00:50:00.000+03:00", "replies_count": 0, "uuid": "99e69d14e31d29a84f586d91c631ff56a932a8b5"}, "author": "ANICK JESDANUN", "url": "http://www.seattletimes.com/business/technology/review-new-phones-tablets-keep-samsung-at-android-helm/", "ord_in_thread": 0, "title": "Review: New phones, tablets keep Samsung at Android helm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Samsung’s new smartphones and tablets might not offer enough to entice current iPhone and iPad users to switch, but they keep Samsung at the head of the class among Android gadget makers.\nThe new Galaxy devices come weeks before comparable updates from Apple are expected. In a sense, if Samsung can’t beat the competition in sales, it can at least beat it to store shelves.\nSamsung has been facing competition not just from Apple but also from Android manufacturers such as Motorola and Xiaomi, which offer good-enough features while keeping prices low. Consumers will have to decide whether the premium features in the latest Samsung devices will be worth the premium price tags.\nThe Galaxy S6 Edge Plus and Note 5 phones arrived last week, while the Galaxy Tab S2 tablets come out Thursday.\nMost Read Stories Mariners fire general manager Jack Zduriencik Now comes the hard part for the Mariners: Hiring Jack Zduriencik’s replacement Mariners demote struggling catcher Mike Zunino Why Russell Wilson needs to water down his Recovery claims Animated map: How the wildfires in North Central Washington have grown over time Here’s a closer look at the devices.\nJumbo smartphones: Samsung pioneered jumbo phones with the original Note in 2011, but lost its edge after Apple came out with its own, the iPhone 6 Plus. Samsung’s new 5.7-inch phones seek to restore some of that edge.\nOf the two just introduced, the Edge Plus is likely to appeal to more people. The screen’s left and right edges are curved like a waterfall and blend into the phone’s aluminum casing. You get a better grip and a more immersive viewing experience, even from an angle.\nAs with the smaller S6 Edge phone from this spring, you can access frequent contacts and have the edge light up in a different color, depending on who’s calling. With your phone face down, you know whether the caller’s important enough to interrupt a meeting. The Edge Plus model adds quick access to frequently used apps. The side screen also displays headlines and clock functions.\nThe Note 5 model comes with a regular, flat screen and is notable mostly for its stylus. It will appeal primarily to professionals who do a lot of note-taking and messaging. You can write instead of type an email or reminder. Software converts the handwriting — even my chicken scratch — into computerized text.\nYou can jot down a note even with the screen off, so you don’t lose your train of thought in turning on the phone and opening an app first. You can also annotate documents and Web pages to share with others.\nBoth phones have great screens with vivid colors, though colors sometimes look unnatural. Faces appear too orange at times, for instance. The cameras are excellent, but have color challenges, too. Grass at a baseball game appeared yellowish rather than green. On the other hand, many people want photos to look stunning rather than accurate, judging by the popularity of Instagram filters that do just that.\nThe phones have great battery life — 13 to 15 hours of Hulu video, while the included wall charger gets you a quarter charge in 15 minutes and more than 85 percent in an hour.\nSo why don’t I believe these new phones will entice iPhone users to switch? Being just as good isn’t enough. They need to be much better, given that switching means buying new apps and learning new ways to do things. The pen and the edge screen help, but they won’t appeal to everyone.\nSamsung has a better chance at luring back some Android users — at least those willing to pay $696 to $740 for the Note 5 and about $75 more for the Edge.\nNew tablets: Compared to the original Tab S, the Tab S2 update sheds bulk and weight, akin to what Apple has done with the full-size iPad Air and Air 2. But Samsung also scaled back on some features to make that happen.\nThe $500 full-size model is now 9.7 inches rather than 10.5 inches, while the $400 mini version is 8 inches instead of 8.4 inches. Samsung also dropped the camera flash, something rare in tablets to begin with. Battery capacity is reduced, though you don’t need as much power to light up a smaller screen. In any case, the 12 to 14 hours promised for video should be enough for most flights or evenings at home.\nThe new tablets use Amoled screen technology for vivid colors. This type of screen is rare for tablets because it’s expensive. Colors are amazing when watching streaming video, as long as you overlook the occasional unnatural tone.\nOne excellent change: The dimensions are now 4:3. Android tablets, including the original Tab S, have typically used a wider, 16:10 aspect ratio, which is great for video but bad for just about everything else. The 4:3 ratio, which the iPad has long had, is better for photos, magazines and Web browsing.\nSamsung is ahead with multitasking features that let you view multiple apps side by side, though similar features are coming to the iPad soon with the iOS 9 software update.\nAgain, I don’t see Apple users switching. But just as an iPad can be a good companion for iPhone users, a Samsung tablet is great for Samsung phone owners.\nANICK JESDANUN", "external_links": [], "published": "2015-08-29T00:50:00.000+03:00", "crawled": "2015-08-29T15:28:14.297+03:00", "highlightTitle": ""}