{"organizations": [], "uuid": "b7301127327a04ca4f6c73436d58a9b1a4183e69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62470/storms-bring-rain-gusty-winds-eastern-us", "country": "US", "title": "Storms to bring rain, gusty winds to Eastern US", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Storms to bring rain, gusty winds to Eastern US", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T05:15:00.000+03:00", "replies_count": 0, "uuid": "b7301127327a04ca4f6c73436d58a9b1a4183e69"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62470/storms-bring-rain-gusty-winds-eastern-us", "ord_in_thread": 0, "title": "Storms to bring rain, gusty winds to Eastern US", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Storms to bring rain, gusty winds to Eastern US   \nAug 11, 2015 Banners   \nAs a storm system moves in from the Midwest, drenching downpours and the risk of flooding and gusty winds will increase across the Northeast and parts of the South through Tuesday. \nWhile widespread severe weather is not likely, some of the more robust storms will have the potential to be damaging and disruptive. Sporadic power outages and localized torrential rain can occur. Lansing, Michigan, received close to 3 inches of rain in as many hours on Monday midday. \nThe storms will mark the leading edge of a push of slightly cooler and significantly less humid air. \nPeople with outdoor plans ranging from baseball games and football practice to a day at the beach and construction projects could face disruptions. Sudden poor visibility can cause slow travel on area highways, while the proximity of severe thunderstorms to major airports may contribute to airline delays. \nThe risk of storms with frequent lightning strikes, blinding rain, flash flooding and strong wind gusts will stretch from the lower Great Lakes, southward through to the southern Appalachians and westward to the Ozarks during Monday afternoon and evening. \nInto Monday evening, the locally gusty storms will stretch from Detroit and Toronto to Charleston, West Virginia; Chattanooga, Tennessee; and Tulsa, Oklahoma. \nThe storms will continue to push eastward Monday night and are forecast to extend from Montreal to Washington, D.C.; Charlotte, North Carolina; Greenville, South Carolina; and Atlanta. \nDuring Tuesday, locally gusty storms may survive or re-fire from Caribou, Maine, to New York City; Norfolk, Virginia; Myrtle Beach, South Carolina. \nThe storms will also extend westward along the Gulf coast from Pensacola, Florida, to New Orleans and perhaps to part of the upper Texas coast. \nWhile not every location from southern Canada to the Southern states will get rain, the showers and thunderstorms associated with the system have the potential to snap a brief dry spell in some areas and pause building drought in others. \nIn addition to drought in parts of the Carolinas and Georgia, parts of New England and Long Island, New York are in need of rain. Rainfall in some of these areas since the start of the summer range from 30 to 60 percent of average. \nThe storm last week brought only sporadic heavy rainfall to the Carolinas and Georgia, and totally missed much of the Northeast. \nFollowing the storms and a surge of warm and humidity, a push of cooler and less humid air will make its way into much of the East by the middle of the week. \nChilly air aloft will produce extensive clouds and showers around the lower Great Lakes at midweek, while most areas can expect a return of sunshine.", "external_links": [], "published": "2015-08-11T05:15:00.000+03:00", "crawled": "2015-08-11T13:40:22.526+03:00", "highlightTitle": ""}