{"organizations": [], "uuid": "a5758a2c45b259a5a5eb198337223d74797f9d01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/download-418.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-event-news/", "section_title": "Travel Event News | Travel Technology News | Travel Industry News | Trade Shows | Travel Industry | Tourism Industry | Travel Association NewsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/how-an-86-year-old-airline-stays-relevant-with-tomorrows-business-travelers/", "country": "US", "title": "How an 86-year-old airline stays relevant with tomorrow's business travelersTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "How an 86-year-old airline stays relevant with tomorrow's business travelersTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "a5758a2c45b259a5a5eb198337223d74797f9d01"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/how-an-86-year-old-airline-stays-relevant-with-tomorrows-business-travelers/", "ord_in_thread": 0, "title": "How an 86-year-old airline stays relevant with tomorrow's business travelersTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How an 86-year-old airline stays relevant with tomorrow’s business travelers Published on : Thursday, August 27, 2015\nStarting with the fall 2015 semester, Delta Air Lines will launch alliances with nine universities across the country that go beyond traditional stadium signage to embed the airline and its employees in campus and alumni events, academics and career recruiting and counseling, all in an effort to become a lifelong travel partner to future customers.By employing a team of college seniors, Delta has gained direct insight into the needs of its next generation of customers. Students’ feedback following an eight-week intensive internship at the airline’s Atlanta headquarters formed the foundation for Delta’s groundbreaking approach to university partnerships.\n“College students are a savvy group of consumers,” said Jeff Robertson, Delta Vice President – Product Development, Sky Clubs and Marketing Communications. “By creating campus and alumni events that incorporate our people, our unmatched focus on customer service, leadership and more, we will give students and alums the opportunity to really get to know our airline. Ultimately, we believe this will position Delta as their trusted partner over a lifetime of travel.”\nDelta’s new university partners include: Duke University, The University of Florida, Indiana University, University of Michigan, Michigan State University, University of Notre Dame, The Ohio State University, Penn State University and University of Wisconsin. The airline also has existing partnerships with Boston College, Georgia Institute of Technology, University of Georgia, University of Minnesota, University of North Carolina, and Syracuse University.\n“When we met with the Delta team to explore ideas for a partnership, it quickly became clear they were thinking differently,” said Scott Correira, President of Notre Dame Sports Properties. “Delta is moving past the traditional events and logo placements and working with us to create valuable and impactful programs – to engage with students, alumni, fans and staff at a higher level than traditional partnership programs.”\nSource:- Delta Air Lines", "external_links": [], "published": "2015-08-27T03:00:00.000+03:00", "crawled": "2015-08-27T16:56:25.422+03:00", "highlightTitle": ""}