{"organizations": [], "uuid": "82e821bbd06c8921e0d94e4b7571574295edea07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-event-news/", "section_title": "TRAVEL EVENT NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/royal-jordanian-and-qatar-airways-enhance-ties-with-new-code-share-agreement/", "country": "US", "title": "Royal Jordanian and Qatar Airways enhance ties with new code share agreement", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Royal Jordanian and Qatar Airways enhance ties with new code share agreement | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "82e821bbd06c8921e0d94e4b7571574295edea07"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/royal-jordanian-and-qatar-airways-enhance-ties-with-new-code-share-agreement/", "ord_in_thread": 0, "title": "Royal Jordanian and Qatar Airways enhance ties with new code share agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Royal Jordanian and Qatar Airways enhance ties with new code share agreement Published on : Thursday, August 6, 2015\nRoyal Jordanian has further enhanced its ties with oneworld partner Qatar Airways by launching a new code share agreement that is set to further expand travel opportunities for the customers of both airlines.\nThrough the new agreement which will be activated as of August 6, 2015, RJ passengers travelling between Amman and Doha on both Royal Jordanian and Qatar Airways will benefit from the same airline code and a streamlined level of services from these oneworld partners.\nMembers of the airlines’ frequent flyer programs will also be able to collect points on each other’s flights, with this initial route paving the way for additional code share expansions in the near future between the airlines across destinations in the United States and Asia.\nRJ President/CEO Captain Haitham Misto said: “Royal Jordanian and Qatar Airways enjoy a strong relationship, and they are both keen on providing superb on-board and on-ground services. This agreement will further enhance the cooperation between our two companies, thus offering our passengers more travel options and frequencies to cities around the world.”\nQatar Airways Group Chief Executive Officer Akbar Al Baker, said: “Becoming a member of oneworld has enabled Qatar Airways to strengthen its competitive offering, while expanding travel options to passengers around the world within this leading global alliance network. The launch of this new code share agreement with our fellow oneworld member airline Royal Jordanian demonstrates this and will allow passengers to benefit from seamless journeys around the globe.”\nQatar Airways has seen rapid growth in just 18 years of operations, currently flying a modern fleet of 162 aircraft to more than 150 key business and leisure destinations across Europe, Middle East, Africa, Asia Pacific and the Americas.\nRoyal Jordanian, the national carrier of Jordan, celebrated its 50th anniversary in 2013. In the past eight years it became a public shareholding company with a vision to connect Jordan and the Levant with the world. In 2007, RJ was the first Arab carrier to join oneworld, thus any of the three global airline alliances.", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T00:40:53.551+03:00", "highlightTitle": ""}