{"organizations": [], "uuid": "8044cb5a9f1d7c849b1ee9f251ea206acf4e5000", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/6664812/franklin-inst-kciappa*1200xx2560-1440-0-240.jpg", "site_section": "http://triad.bizjournals.com/rss/feed/vertical_subtopic/64", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/philadelphia/morning_roundup/2015/08/ready-set-go-franklin-institute-to-debutnew-sports.html", "country": "US", "title": "Ready? Set. Go! Franklin Institute to debut new sports exhibit", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "Ready? Set. Go! Franklin Institute to debut new sports exhibit", "spam_score": 0.0, "site_type": "news", "published": "2015-08-10T15:21:00.000+03:00", "replies_count": 0, "uuid": "8044cb5a9f1d7c849b1ee9f251ea206acf4e5000"}, "author": "Kenneth Hilario", "url": "http://www.bizjournals.com/philadelphia/morning_roundup/2015/08/ready-set-go-franklin-institute-to-debutnew-sports.html", "ord_in_thread": 0, "title": "Ready? Set. Go! Franklin Institute to debut new sports exhibit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Franklin Institute A rendering showing the entrance to the new SportsZone exhibit. The Franklin Institute will debut a new $3.1 million permanent exhibit this year dedicated to the science of sports. The institution will open the 3,600-square-foot SportsZone exhibit on Oct. 24, replacing Sports Challenge , which had been at the institution for 15 years. Developed by Franklin Institute scientists and designers, SportsZone will feature full-body experiences combined with media, design and augmented reality to illustrate how science, technology and engineering boost an athlete’s performance. Ready? Set. Go! SportsZone is designed around the theme Ready? Set. Go! complete with the look and feel of indoor and outdoor sports facilities. Each area will address how sports connect the science of the human body, technical innovation and laws of motion. The exhibit will feature 21 interactive experiences giving visitors the chance to compete with others or improve on their own performance. Amoroso's laying off all employees Interactive highlights include: balancing daily energy needs based on activity level and basic physiology; investigating the best fluids to drink during exercise; testing the force of a direct impact on model heads with and without helmets; and using slow-motion video to analyze and improve pitching technique by comparing it to Dewey LaRosa , pitching coach of the Taney Dragons. Athletes in Action Athletes in Action , the exhibit's centerpiece, will be a 40-foot long race challenge pairing the visitor against virtual competitors, including Philadelphia Eagles wide receiver Jordan Matthews , inline speed skater Brian Talley , and Paralympic medalists Tatyana McFadden and Richard Brown . All athletes were involved in the filming and recording of the challenge during the exhibit development phase. Athletes in Action is narrated by Philadelphia Eagles radio announcer Merrill Reese . South Jersey outlet center to officially open Other local athletes featured in the exhibit include Philadelphia 76ers' Nerlens Noel and Phillies' Chase Utley. SportsZone, located on the third floor of the museum, is one of several exhibits at The Franklin Institute planned for a complete redesign and renovation. Entrance to the exhibit will be included with general admission. The $3.1 million for SportsZone was provided by lead underwriters James J. Maguire , Jr., the Maguire Foundation, and Philadelphia Insurance Companies. “It’s so important to give people the resources they need to make informed decisions,\" said Maguire, \"and The Franklin Institute can do that in a fun and engaging way.” Associate supporters are William and Laura Buck, Roberta and Ernest Scheller, Jr., and the Dow Chemical Company. The Franklin Institute last week announced it would be extending the run of its Art of the Brick traveling exhibit. The Lego-inspired exhibit will now run through Oct. 4. \nWant Philadelphia Travel news in your inbox? Sign up for our free email newsletters. Home of the Day", "external_links": [], "published": "2015-08-10T15:21:00.000+03:00", "crawled": "2015-08-10T15:48:09.168+03:00", "highlightTitle": ""}