{"organizations": [], "uuid": "ec1a26510862fd457a0818fd8d8a4e908b34dbf0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63101", "country": "US", "title": "≈", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "≈", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T12:02:00.000+03:00", "replies_count": 0, "uuid": "ec1a26510862fd457a0818fd8d8a4e908b34dbf0"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/63101", "ord_in_thread": 0, "title": "≈", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  \nAug 28, 2015 ç eTN   \nEtihad Airways, the national airline of the United Arab Emirates, has appointed Mr Lindsay White to the new position of Vice President for Australia and Asia Pacific. \nIn this role, Mr White will assume responsibility for the entire Asia Pacific region, adding China, Japan, Korea and Thailand to his current portfolio of Australia, New Zealand, Indonesia, Malaysia, Philippines, Singapore and Vietnam. \nMr White brings more than 30 years of aviation industry experience to the role, having held various senior management positions at British Airways before joining Gulf Air in 2005 as its general manager in Malaysia and Brunei. He subsequently joined Etihad Airways as its country manager in Malaysia. \nIn September 2008, Mr White relocated to Sydney to take up the role of General Manager Australia and New Zealand for Etihad Airways and, in 2012, was promoted to Vice President Asia Pacific South and Australasia. \nDanny Barranger, Senior Vice President of Global Sales, said: “This new role brings the entire Asia Pacific region into a single management focus, ensuring the alignment of our activities in a vast geographical area of increasing importance to the airline. \n“Lindsay has the depth of experience to manage an extensive portfolio of fast-growing markets and the ability to inspire culturally diverse teams to achieve commercial success.” \nMr White said: “The opportunity to expand my focus beyond the ASEAN region to North Asia is an exciting one and I am looking forward to the challenge. \n“Etihad Airways has developed an expansive network in the Asia Pacific region and I am committed to working with all of our teams and industry partners in each market to build on this success.”", "external_links": [], "published": "2015-08-28T12:02:00.000+03:00", "crawled": "2015-08-28T17:09:39.838+03:00", "highlightTitle": ""}