{"organizations": [], "uuid": "423ef7fb01c3334e36b01e91529983cf9060d6d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/13/1d/0c/chipotle.jpg", "site_section": "http://www.palmbeachpost.com/s/travel/", "section_title": "Florida Travel | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/lifestyles/food-cooking/chipotle-raises-beef-prices-due-market-demand/nnJrw/", "country": "US", "title": "Chipotle raises beef prices due to market demand", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Chipotle raises beef prices due to market demand | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T22:37:00.000+03:00", "replies_count": 0, "uuid": "423ef7fb01c3334e36b01e91529983cf9060d6d5"}, "author": "Zach Dennis", "url": "http://www.palmbeachpost.com/news/lifestyles/food-cooking/chipotle-raises-beef-prices-due-market-demand/nnJrw/", "ord_in_thread": 0, "title": "Chipotle raises beef prices due to market demand", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "They’re at it again! More price movement coming from a favorite burrito hub.\nFollowing moves in San Francisco that saw the price of all menu items going up to coincide with the city's minimum wage increase, Chipotle is ramping up their prices across the nation on beef products, Eater reported. The restaurant says this is in correlation with beef market increases and has nothing to do with labor.\nChipotle Chipotle communications director Chris Arnold said the increase is due a number of factors. \"I might note on the [San Francisco] increase that, had our overall cost structure been different there — that is to say that if our occupancy costs weren't double our national average and/or our prices not about our average — we may not have had to raise prices,\" Arnold said.\n\"The pricing model takes into consideration all of our costs — occupancy/building costs, food, labor, and the like. An increase in any of those areas isn't automatically going to necessitate a price increase; it's when the equation gets out of balance that we'll look to raise prices. Last year, for example, was the first time in three years that we raised prices in our restaurants, and that's in spite of persistent food inflation in the preceding years.\"\nThis isn’t a complete blindside for the company. It was reported in April that the company was looking to increase the price of steak and barbacoa with the company citing higher prices in avocados and dairy products the year before as a cause.\nBut, it does come a few months after the company announced it would give full benefits – such as paid time off, free tuition, and sick pay – to all employees . The raise in beef prices won't affect one big fan: Mark Rantal, who had been eating Chipotle’s burrito bowl every day for more than 100 days , always gets it made with sofritas -- which use tofu.\nRead more at Eater .\n</span", "external_links": ["http://www.eater.com/2015/8/12/9144557/chipotle-prices-beef-steak-barbacoa", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/13/1d/0c/chipotle.jpg"], "published": "2015-08-13T22:37:00.000+03:00", "crawled": "2015-08-13T22:04:44.872+03:00", "highlightTitle": ""}