{"organizations": [], "uuid": "da3d14b6b16d049ef8c46a34fafffe35b9aeee8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/NACAC-Championships-8.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/08/08/lolo-jones-team-usa-shine-at-track-and-field-championships-in-costa-rica", "country": "US", "title": "Lolo Jones, Team USA shine at track and field championships in Costa Rica", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Lolo Jones, Team USA shine at track and field championships in Costa Rica", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T05:45:00.000+03:00", "replies_count": 0, "uuid": "da3d14b6b16d049ef8c46a34fafffe35b9aeee8e"}, "author": "Michael Krumholtz", "url": "http://www.ticotimes.net/2015/08/08/lolo-jones-team-usa-shine-at-track-and-field-championships-in-costa-rica", "ord_in_thread": 0, "title": "Lolo Jones, Team USA shine at track and field championships in Costa Rica", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nTrack star Lolo Jones won the women’s 110 meter hurdles at the NACAC Championships in San José on Saturday, August 8, 2015 with a blazing run of 12.63 seconds. Alberto Font/The Tico Times \nThe United States anthem played on repeat Saturday afternoon at the National Stadium in San José as athletes from the country dominated day two of the North American, Central American and Caribbean Athletics Association ( NACAC ) Championships. \nLolo Jones, the two-time world outdoor champion, added a NACAC championship to her long list of accolades after posting a 12.63 time in the women’s 110 meter hurdles. A three-time Olympian, Jones is one of the most recognizable faces in track and field and was bombarded with autograph requests and fan photos throughout the day. Though she has her sights set on upcoming races in order to make the U.S. team for the 2016 Summer Olympics in Rio de Janeiro, the 33-year-old Jones said she wants to enjoy her stay here as much as possible. \n“I want to go see some parts of Costa Rica since it’s my first time in the country,” she said after the race. \nJones’ gold medal in the hurdles was accompanied by a silver from teammate Tenaya Jones. In the women’s 100 meter dash, Barbara Pierre and Charonda Williams led the U.S. to another first and second place finish on the podium. \nNot to be outdone, Andrew Wheating and Daniel Winn also won gold and silver medals with their dominating performances in the long-distance 1,500 meter run. \nThe U.S. also added gold medals in the women’s hammer throw, men’s long jump, and women’s 1,500 meter race, among others. \nFor Costa Rica’s part, beloved runner Nery Brenes finished second in the finals of the 400 meter dash behind Lalonde Gordon from Trinidad & Tobago. The 2008 Olympian’s time of 45.22 was a half-second slower than his preliminaries race, but still good enough to earn silver in front of his home crowd. \n“It hurts that I couldn’t win the gold but I’m happy because of the way the crowd cheered me coming out,” Brenes said. “The support of Costa Ricans means even more than earning a silver medal, so I’m very grateful to the fans that came out.” \nThe remaining finals for the 2015 NACAC Championships conclude Sunday, with events starting at 3 p.m. Alberto Font/The Tico Times Alberto Font/The Tico Times \nAndrew Wheating and Daniel Winn of the United States finished first and second in the men’s 1,500 meter final on Saturday at the NACAC Championships in Costa Rica’s National Stadium. Alberto Font/The Tico Times Alberto Font/The Tico Times Alberto Font/The Tico Times \nRachel Schneider and Shelby Houlihan finished first and second in the finals of the 1,500 meter run on Saturday, August 8, 2015 at the NACAC Championships in San José. Alberto Font/The Tico Times Alberto Font/The Tico Times Alberto Font/The Tico Times \nTwo-time world champion Lolo Jones celebrated her latest gold medal at the NACAC Championships in San José, August 8, 2015 Alberto Font/The Tico Times Alberto Font/The Tico Times Alberto Font/The Tico Times \nCosta Rican track legend Nery Brenes earned a silver medal in the men’s 400 meter dash at the NACAC Championships in San José, August 8, 2015. Alberto Font/The Tico Times", "external_links": [], "published": "2015-08-09T05:45:00.000+03:00", "crawled": "2015-08-09T07:31:45.724+03:00", "highlightTitle": ""}