{"organizations": [], "uuid": "ae9745295172f78cc640f9e79a4e5c624b6e22e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/12/westjet1.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/westjets-first-wide-body-aircraft-touches-down-today/", "country": "US", "title": "WestJet's first wide-body aircraft touches down todayTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "WestJet's first wide-body aircraft touches down todayTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "ae9745295172f78cc640f9e79a4e5c624b6e22e3"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/westjets-first-wide-body-aircraft-touches-down-today/", "ord_in_thread": 0, "title": "WestJet's first wide-body aircraft touches down todayTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WestJet’s first wide-body aircraft touches down today\nWestJet today ushers in a new era in the airline’s 19-year history with the arrival early this morning of the first of four Boeing 767-300 extended range aircraft, allowing the airline to begin serving Europe and other regions of the world from Canada on a non-stop basis. Inaugural wide-body flights will begin in early September.\n“The arrival of our first wide-body aircraft opens the next chapter in the evolution and growth of Canada’s low-fare leader,” said Bob Cummings, WestJet Executive Vice-President, Commercial. “WestJet has been liberating Canadians from the high cost of air travel since 1996, bringing low fares and friendly, caring, people-driven service to communities from coast to coast. The launch of WestJet Encore in 2013 gave Canadians in smaller centres much-needed relief from high fares and the opportunity to connect to WestJet’s ever-expanding domestic, trans-border and international networks. Shortly, with the arrival of our first wide-body aircraft as an important milestone, we will offer Canadians from cities across our network the chance to fly non-stop to Europe and other regions at prices not seen in recent memory. As we have throughout our history, we will continue to lower airfares and make travel more affordable.”\nFeaturing a new teal and blue maple leaf-themed logo that will eventually appear on all WestJet aircraft, the airline’s 767s seat 262 guests and have a range of approximately 11 hours. The aircraft will include a Plus cabin with 24 premium seats in a two-by-two configuration, hot meals and all of the other amenities associated with Plus. The main cabin has 238 seats, with two seats on either side of the aircraft and three in the middle. By next spring all four 767s will be equipped with WestJet Connect, the airline’s new inflight entertainment and wireless connectivity system.\nThe four aircraft will arrive separately over the next eight months. The aircraft that arrives today will begin service in September and operate flights between Toronto and Calgary for the next several months. With the arrival of two additional wide-bodies this fall, the 767s will be flying from Alberta to Hawaii and between Toronto and Montego Bay, Jamaica beginning in December. The fourth and final aircraft will arrive next spring just prior to the launch of WestJet’s new service to London (Gatwick) in May 2016.\nFollowing discussions over the summer with airports across the country, the airline will announce the Canadian cities from which it will operate its summer schedule, including to London, in mid-September.\nSource:- WestJet Airlines", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T16:55:29.758+03:00", "highlightTitle": ""}