{"organizations": [], "uuid": "3364ffb60890eb1e7175ce805e6264480c802eec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/08/07/Production/Daily/Style/Images/483181994.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/style/for-santorum-and-others-not-in-top-10-grin-and-bear-it-and-be-a-little-bitter/2015/08/07/c5725bee-3cc3-11e5-9c2d-ed991d848c48_story.html", "country": "US", "title": "For Santorum and others not in top 10, grin and bear it. (And be a little bitter.)", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "For Santorum and others not in top 10, grin and bear it. (And be a little bitter.) - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "3364ffb60890eb1e7175ce805e6264480c802eec"}, "author": "By Ben Terris", "url": "http://www.washingtonpost.com/lifestyle/style/for-santorum-and-others-not-in-top-10-grin-and-bear-it-and-be-a-little-bitter/2015/08/07/c5725bee-3cc3-11e5-9c2d-ed991d848c48_story.html", "ord_in_thread": 0, "title": "For Santorum and others not in top 10, grin and bear it. (And be a little bitter.)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Ben Terris August 7 at 3:21 PM Follow @bterris\nRepublican presidential candidates Louisiana Gov. Bobby Jindal, center, accompanied by, from left, former Virginia governor Jim Gilmore, Sen. Lindsey O. Graham (S.C.), former Texas governor Rick Perry and former senator Rick Santorum (Pa.), speaks during the early debate Thursday. (Andrew Harnik/Associated Press) On the morning of the big debate, Rick Santorum headed over to the five white tents where TV networks filmed their live shots, to tell anyone with a camera why he should be on the main stage.\n“I’m doing great,” he fibbed to a CBS producer, forcing a smile and clenching his fists off-camera. “I won 11 states,” he said on air, referring to his second-place finish in the 2012 Republican primaries. “People who were soaring high in the polls in August didn’t end up with any delegates in January,” he said after walking over to MSNBC. For weeks, he’s been calling the polls “arbitrary” and “irrelevant.”\nYou really can’t blame him for being upset. At 9 p.m., the most talked-about debate in recent memory kicked off the 2016 cycle, but Santorum wasn’t there. He was on the stage hours earlier with the other six basement-dwellers in the Republican field of 17. He was sharing the stage there with, among others, former Virginia governor Jim Gilmore, who like most Americans, is polling at zero percent.\nBut Santorum has been a massive underdog before, so he knew how to grin through it. After making the rounds on television, he was one of the first, if not the first, candidate to head over to the arena to check out the stage for a walk-through. It was 10 hours before the actual debate, but only six before the one he was in.\nIt must have felt, to Santorum, like the real thing. The sheer number of talking heads and candidates walking around threatened to break the record for most men wearing makeup in the history of downtown Cleveland. Hundreds of journalists had flown in from around the country (okay, mostly from Washington) and were cordoned off to one part of the arena called the “Filing” and “Spin” rooms. (There’s something remarkable about how many people will fly hundreds of miles to watch a debate on television and then walk willingly to a place with the stated purpose of people lying to you.)\n[ Carly Fiorina looks to break out after a shining performance in the undercard debate ]\nBut when the clock struck five and the camera panned across the podiums at the Quicken Loans Arena, the crowd surrounding Santorum was harder to recognize: Gov. Bobby Jindal, former governors Gilmore, George Pataki and Rick Perry, along with Sen. Lindsey O. Graham and former Hewlett-Packard chief executive Carly Fiorina. It was less like watching an actual debate, and more like watching a dress rehearsal for an “SNL” skit that wouldn’t make the final cut for the show.\nBut hey, maybe sitting at the kids table wouldn’t be so bad. How many Thanksgivings at the adults table are ruined by having to interact with that one opinionated drunk uncle saying sexist things and accusing anyone who calls him on it as being too “politically correct”? But then again, if you’re running for president, you want people who are watching to think you actually have a chance.\n“You said four years ago you weren’t ready,” the Fox News host who wasn’t Bret Baier asked Perry with the first question of the night. “Why should someone vote for you now?”\n“This week you said, ‘Margaret Thatcher was not content to manage a great nation in decline, and neither am I,’ ” the host who wasn’t Megyn Kelly said to Fiorina. “Given your current standings in the polls, is the Iron Lady comparison a stretch?”\n“Is it time for new blood?” “Your approval numbers are in the mid-30s,” “Has your moment passed?” The whole first round was just a rumination on why these folks even bothered to show up.\nWhich is too bad, really. For as unknown as this group is, they really are an impressive lot. The longest-serving governor in Texas history; a three-term governor of New York; a Virginia governor who served during 9/11; the first female head of a Fortune 20 company; and a senator with true foreign-policy chops. Isn’t it at least possible that any of these people would make a more competent president than the guy currently polling in first place?\nRick Santorum in the first of Thursday’s two debates on Fox News. (John Minchillo/AP)\nCarly Fiorina was seen as the winner of Thursday’s first debate. (Brian Snyder/Reuters) The debate itself failed to offer any of the excitement from the Trumpmania that would follow. First of all, they were performing in front of next-to-no audience at all. It’s hard to get amped up when every laugh line (Graham: “You know, when Bill Clinton says it depends on what the meaning of ‘is’ is, that means ‘is’ is whatever Bill wants it to mean”) is met with crickets. But to be honest, the candidates themselves weren’t providing much energy themselves.\nThe long-shot candidates had no reason to take shots at any of each other, realizing that all punching should be upward, so they ended up mostly just agreeing about things. Fiorina may have “won,” if you can call anything here winning, with her talk about business leadership, her relationships with foreign leaders and her trashing of Hillary Rodham Clinton. Santorum said, sure he was behind now, but not as behind as he was last election cycle at this point. (He didn’t win that time, either.) Gilmore spent most of the time telling people who he was.\nWhen the debate ended, reporters flocked to “Spin Alley,” where people held red signs bearing the candidates’ names to denote where they would go to talk about how well they are actually doing. Jindal was the first onto the floor, causing a small stampede toward a candidate who said his “backbone, bandwidth and experience” would lift him from the bottom tier.\n“That’s the reason we’re doing so well in Iowa,” he said. “We’re gaining ground there.”\nMoments later, Jindal lost half of his scrum when Fiorina popped out. “Wow, he didn’t even get 15 seconds of fame,” a grinning cameraman said as he skipped over to Fiorina.\n“Since the debate, the Google searches on you rival Donald Trump,” someone called out.\n“Well, there you go,” Fiorina said. “There you go!” (Once Trump mentioned Rosie O’Donnell, the gap widened.)\nThe award for best sport went to Graham. Yes, he’s admitted that being sent to the warm-up debate “sucks,” but he’s refused to call it by its derogatory name, the Kids Table, instead choosing to refer to it in countless tweets and sound bites as the Happy Hour Debate. As a senator, he’s used to giving speeches in front of an empty house, but he’d like to perform for a crowd next time.\n“An audience may help some,” Graham said. “I don’t know how that would work. I know the Donald would like it — the more people you see in the audience, the more you’re going to see the Donald.”\nGilmore was asked whether he thought his efforts could raise his polling into the single digits. He wasn’t sure.\nSantorum, for his part, came out and put on his happiest of faces.\n‘The fact that we got one or two questions in a debate, I consider that a plus compared to what I went through four years ago,” he said.\nAs Santorum left the building to head to another event down the road, the crowd of people trying to enter the arena had just stretched around the block.\nA smaller group of conservative activists gathered at the House of Blues bar, however, was happy to hear what he had to say.\n“How do you think you did?” a supporter asked him before he took the stage at this debate-watching party at a downtown bar.\n“I think it went well. A lot of people,” he said, referring to the number of candidates on stage.\n“That’s okay, a lot of them will be gone!”\n“Why, why, why did he get in?” Santorum wondered out loud about Pataki. “And Jim Gilmore? Why did they let him in? I think they did because they would have had to eliminate Graham and Carly. . . . One percent has been the rule. . . . They didn’t stick with their rules.”\nMaybe the polls aren’t so irrelevant after all.\nDavid Weigel contributed to this report.", "external_links": ["https://twitter.com/@bterris"], "published": "2015-08-07T03:00:00.000+03:00", "crawled": "2015-08-08T00:01:01.842+03:00", "highlightTitle": ""}