{"organizations": [], "uuid": "87c62cbe361eff3f7a964ea2be58469140eeac2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29901327/ram-truck-brand-offers-popular-ram-truck-test-drive-experience-and-raminator-monster-truck-at-2015-fifth-third-bank-michigan-state-fair", "country": "US", "title": "Ram Truck Brand Offers Popular Ram Truck Test Drive Experience and Raminator® Monster Truck at 2015 Fifth Third Bank Michigan State Fair", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Ram Truck Brand Offers Popular Ram Truck Test Drive Experience and Raminator® Monster Truck at 2015 Fifth Third Bank Michigan State Fair - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "87c62cbe361eff3f7a964ea2be58469140eeac2b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29901327/ram-truck-brand-offers-popular-ram-truck-test-drive-experience-and-raminator-monster-truck-at-2015-fifth-third-bank-michigan-state-fair", "ord_in_thread": 0, "title": "Ram Truck Brand Offers Popular Ram Truck Test Drive Experience and Raminator® Monster Truck at 2015 Fifth Third Bank Michigan State Fair", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FCA US LLC\nAUBURN HILLS, Mich. , Aug. 28, 2015 /PRNewswire/ --\nFair takes place Labor Day weekend, Sept. 4-7 , at the Suburban Collection Showplace in Novi, Mich. Ram Truck joins the state fair as presenting sponsor of a new outdoor Equine Pavilion and indoor Livestock Pavilion, honoring Michigan agriculture Michigan State Fair-goers will have the opportunity to experience a 40,000-square-foot interactive Ram Truck adventure zone at this year's expanded state fair as the popular Ram Truck Test Drive Experience comes to the fair for the first time.\nThe 2015 Fifth Third Bank Michigan State Fair takes place Friday, Sept. 4 , through Monday, Sept. 7 , at the Suburban Collection Showplace in Novi, Mich.\nAs a presenting sponsor of the new Equine Pavilion, with horse shows returning to the fair, Ram will also have the Raminator monster truck – Monster Truck Racing Association's \"Truck of the Year\" – on display, ensuring fun for the whole family.\n\"Ram is proud to be a part of this year's Michigan State Fair, a longstanding tradition that celebrates the importance of farmers and farming communities to our state,\" Jeff Hines , Director of the Great Lakes Business Center – FCA US LLC, said. \"The Ram test track is always a crowd pleaser and we welcome the opportunity to bring this exciting event to the fair so participants can experience the power and capability of Ram trucks.\"\nThe Ram Truck Test Track Experience is open from 10 a.m. to sundown on Friday, Sept. 4 through Sunday, Sept. 6 , and from 10 a.m. to 8 p.m. on Monday , Sept. 7. There is no additional fee for fair attendees to participate in the experience and those who do will receive a Ram hat.\nRam has been a long-time supporter of farmers and the American agricultural industry. Many Ram truck owners are farmers or live in farming communities. They work and live in rural America and provide vital resources to our nation. The uniquely American \"farmer spirit\" conveys the spirit of the Ram Truck brand so well. On a daily basis, both the Ram brand and the farmer value courage, dignity and setting examples through hard work.\nAbout Ram Truck Test Drive Experience\nThe Ram Truck brand test track is a 40,000-square-foot interactive adventure zone demonstrating the power and capabilities of the Ram Truck brand vehicle lineup. The Ram Truck brand test track includes obstacles that highlight the traction capabilities, ground clearance, body strength, suspension capability and ride quality of a Ram truck. Professional drivers steer attendees through the interactive course in the Ram 1500, 2500 or 3500. Key track features include a \"can't miss\" hill climb, where passengers get to experience first-hand the traction capabilities of a Ram truck while climbing the 13-foot high, 30-yard long, 30-degree iconic Ram Mountain. Riders can expect to be sitting more than 17-feet off the ground as they sit atop the Ram Mountain. The Ram test track includes a 16 x 38-foot Timber Crawl that highlights ground clearance and four-wheel-drive capability, a series of off-set steel Bumps that showcase the suspension capability and articulation, and a 30-degree Side Hill that reveals the stability and ride quality of a Ram truck.\nAbout Raminator\nThe Ram Truck brand-sponsored monster truck lineup includes Raminator and Rammunition, sponsored since 2002. The entire line of Ram monster trucks are owned and operated by the Hall Brothers Racing Team based out of Champaign, Ill. In December 2014 , Raminator and Driver Mark Hall broke the GUINNESS WORLD RECORDS® record for the Fastest Speed for a Monster Truck, hitting a record speed of 99.10 miles per hour. Raminator has been named Monster Truck Racing Association's (MTRA) \"Truck of the Year\" a record seven times, while Mark Hall , driver of Raminator, has been named MTRA \"Driver of the Year\" eight times since 1996, and Crew Chief Tim Hall has been named MTRA \"Mechanic of the Year\" five times since 2006.\nAbout the Michigan State Fair\nThe history and evolution of the Michigan State Fair and the Fifth Third Bank Michigan State Fair, a Private Entity, LLC: The original Michigan State Fair, which debuted in Detroit in 1849, was one of the first statewide fair events to take place in the United States . It moved permanently to its home at the Michigan State Fairgrounds on Woodward Avenue in 1905 and was staged there until 2009, when it was discontinued by a resolution of the state government, due to ongoing budget issues. The Michigan State Fair, LLC is now produced by a private entity, and presented with title sponsor Fifth Third Bank. The 2015 Fifth Third Bank Michigan State Fair has a deep commitment to the ongoing development and support of agriculture, small business and family entertainment, while preserving the legacy and beloved traditions of the original State Fair. For more information on the Fifth Third Bank Michigan State Fair, please visit www.MichiganStateFairLLC.com\nAbout Ram Truck Brand\nSince its launch as a stand-alone division in 2009, the Ram Truck Brand has steadily emerged as an industry leader with one goal: to build the best pickup trucks and commercial vehicles in the industry.\nCreating a distinct identity for Ram Trucks has allowed the brand to concentrate on core customers and features they find valuable. Whether focusing on a family that uses a Ram 1500 day in and day out, a hard-working Ram 3500 Heavy Duty owner or a business that depends on its Ram ProMaster commercial van every day for deliveries, Ram has the truck market covered.\nIn order to be the best, it takes a commitment to innovation, capability, efficiency and durability. Ram Truck invests substantially in its products, infusing them with great looks, refined interiors, durable engines and exclusive features that further enhance their capabilities.\nMoving into the 2016 model year, Ram continues to beat the competition in the most sought-after titles, fuel economy, payload and towing capacity:\nBest-in-class fuel economy with exclusive EcoDiesel – 29 mpg with Ram 1500 Best-in-class towing capability – 30,000 pounds with Ram 3500 Best-in-class payload – 7,390 pounds with Ram 3500 Best-in-class torque – 900 lb.-ft. with Ram 3500 equipped with Cummins Truck customers, from half-ton to commercial, have a demanding range of needs and require their vehicles to provide high levels of capability. Ram trucks are designed to deliver a total package.\nFollow Ram and FCA US news and video on:\nFCA Content On Demand (COD): www.fcacod.com\nCompany blog: http://blog.fcanorthamerica.com\nCompany website: www.fcanorthamerica.com\nMedia website: http://media.fcanorthamerica.com\nFCA360: www.fca360.com\nRam Trucks brand: www.ramtrucks.com\nRam Zone blog: www.ramzone.com\nFacebook: www.facebook.com/RamTrucks or www.facebook.com/ChryslerGroup\nFlickr: www.flickr.com/RamTrucks or www.flickr.com/ChryslerGroup\nPinterest: www.pinterest.com/ramtrucks or www.pinterest.com/FCAcorporate\nInstagram: www.instagram.com/ramtrucks or www.instagram.com/FCAcorporate\nStreetfire: www.streetfire.net/uploaded/chryslervideo.htm\nTwitter: www.twitter.com/RamTrucks or www.twitter.com/FCAcorporate\nYouTube: www.youtube.com/RamTrucks or www.youtube.com/pentastarvideo\n releases/ram-truck-brand-offers-popular-ram-truck-test-drive-experience-and-raminator-monster-truck-at-2015-fifth-third-bank-michigan-state-fair-300134476.html\n ", "external_links": ["http://www.pinterest.com/FCAcorporate/", "http://www.fcacod.com/", "http://www.pinterest.com/ramtrucks", "http://www.facebook.com/ChryslerGroup", "http://rt.prnewswire.com/rt.gif?NewsItemId=DE88696&Transmission_Id=201508280900PR_NEWS_USPR_____DE88696&DateId=20150828", "http://blog.fcanorthamerica.com/", "http://www.youtube.com/pentastarvideo", "http://www.twitter.com/FCAcorporate", "http://media.fcanorthamerica.com/", "http://www.ramtrucks.com/", "http://www.instagram.com/FCAcorporate", "http://www.prnewswire.com/news-releases/ram-truck-brand-offers-popular-ram-truck-test-drive-experience-and-raminator-monster-truck-at-2015-fifth-third-bank-michigan-state-fair-300134476.html", "http://www.michiganstatefairllc.com/", "http://www.ramzone.com/", "http://www.fcanorthamerica.com/", "http://www.xmlnews.org/ns/", "http://www.twitter.com/RamTrucks", "http://www.youtube.com/RamTrucks", "http://www.facebook.com/RamTrucks", "http://www.streetfire.net/uploaded/chryslervideo.htm", "http://www.fca360.com/", "http://www.instagram.com/ramtrucks"], "published": "2015-08-28T03:00:00.000+03:00", "crawled": "2015-08-28T19:06:57.826+03:00", "highlightTitle": ""}