{"organizations": [], "uuid": "24bb3a83afcd758678bcc3470d0973e735faf990", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297734071971_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.calgarysun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.calgarysun.com/2015/08/07/parked-vehicles-latest-nyc-lodging-choice-for-bold-cheap-tourists", "country": "CA", "title": "Parked vehicles latest NYC lodging choice for bold, cheap tourists [Photos]", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "Parked vehicles latest NYC lodging choice for bold, cheap tourists [Photos]", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T21:00:00.000+03:00", "replies_count": 0, "uuid": "24bb3a83afcd758678bcc3470d0973e735faf990"}, "author": "", "url": "http://www.calgarysun.com/2015/08/07/parked-vehicles-latest-nyc-lodging-choice-for-bold-cheap-tourists", "ord_in_thread": 0, "title": "Parked vehicles latest NYC lodging choice for bold, cheap tourists [Photos]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Verena Dobnik"], "text": "Verena Dobnik, THE ASSOCIATED PRESS First posted: Friday, August 07, 2015 12:00 PM MDT World's top quirkiest hotels Previous Next \nParked vehicles, New York City: Travellers to New York City can book a parked van for $22 a night through Airbnb and get a bed and a spectacular view of the Manhattan skyline from across the East River in Queens. (AP Photo/Richard Drew) \nHI - Ottawa Jail Hostel: Stay in North America's only jail-turned-hostel. This Ottawa, Victorian era jail gives guests the exciting, and slightly spooky, chance to sleep in a former cell, in the prison's hospital or even the governor's quarters. (Courtesy Ottawa Jail Hostel/Kim Ing Photography/Tiffany Orpana) \nDog Park Bark Inn, Idaho: This inn is in the shape of the world's largest beagle dog and is nicknamed \"Sweet Willy.\" There are multiple levels inside the inn, including space to bunk in the dog's muzzle. (Courtesy Dog Bark Park Inn) \nFree Spirit Spheres, British Columbia: A stay in a treehouse like no other! The Free Spirit Spheres in the rainforest of Vancouver Island are available for overnight stays year-round. There is a bed and space for sitting inside each sphere, as well as electricity and speakers for music. Guests rock softly with the wind in the trees during their stay. (Courtesy Tom Chudleigh/Free Spirit Spheres) \nPropeller Island City Lodge, Germany: This quirky Berlin hotel was designed by artist Lars Stroschen, who set out to create a different sensory experience in every room of Propeller Island. Feeling a bit frazzled? Book the padded room. Way in over your head? Book the upside-down space. (Courtesy Propeller-Island.com ) \nHotel de Glace, Quebec: This is North America's only ice hotel. It's located just 30 minutes from Quebec City and has drawn more than 70,000 guests a winter since opening in 2001. Ceilings in the majestic ice creation can reach six metres in height, while visitors also appreciate the ice wedding chapel and private hot tub suites. (QMI Agency/KARL TREMBLAY) \nDas Park Hotel, Austria: This pod hotel in Austria was created by designer Andreas Strauss. Strauss cleaned up discarded drainage pipes and left the individual sleeping spaces together in a park. Guests can get the door pass codes online and only have to pay what they feel their stay was worth. (Courtesy DasParkHotel.net/Dietmar Tollerian) \nJumbo Hostel, Sweden: Stockholm's Jumbo Hostel certainly lives up to its name, being a non-operational Boeing 747 converted into a 27-room hostel. There is also enough space on the plane for a bar, cafe and conference room. (Courtesy Jumbo Hostel) \nHobbit Motel, New Zealand: For fans of the Lord of the Rings novels and movies, Woodlyn Park in Otorohanga, New Zealand has just the adventure. Guests to the Hobbit Motel enjoy private baths and specially designed furniture in rooms tucked into the hilly countryside, just as you'd see in the movie. For non-Tolkien fans, Woodlyn Park also offers train, plane and Titanic themed accommodations. (Courtesy Woodlyn Park) \nCappadocia Yunak Evleri Cave Hotel, Turkey: Travellers to the ancient Turkish village of Urgup can find rest and comfort in a mountain cliff. This hotel is carved into a mountain and features six cave houses and 30 rooms dating back to the fifth and sixth centuries. (Courtesy Cappadocia Yunak Evleri Cave Hotel) \nIf you're looking for a hotel stay that's anything but ordinary, consider the world's top quirkiest hotel rooms. Holmenkollen Ski Jump, Oslo: The newest addition to Airbnb’s collection of properties is the Holmenkollen ski jump. For two nights at the end of March, the very top of Holmenkollen will be transformed into a glass-walled penthouse apartment with private rooftop terrace. The temporary Airbnb listing will be decorated with Nordic contemporary design and will boast some of the best views of Oslo, Norway, including the fjord and the snowcapped mountains surrounding the capital. The next morning, guests can check out via zipline. (Felix Odell/WENN.com) \nFloating House, London: This AirBnB house floats along London's River Thames and features a living room, two bedrooms, a bathroom and a garden. It glides past the London Eye, Houses of Parliament, Canary Wharf and Chelsea. (WENN.com) \nTravelbox: Austrian design firm Juust has launched the Travelbox, a pop-up hotel room that makes it easy for travellers to find accommodation no matter where travels may lead. The box unfolds to reveals a bed, chair, table, storage and even a bicycle. The box weighs just 132 pounds and can be transported easily by the travellers or a standard shipping company. (WENN.com)", "external_links": [], "published": "2015-08-07T21:00:00.000+03:00", "crawled": "2015-08-07T22:12:19.076+03:00", "highlightTitle": ""}