{"organizations": [], "uuid": "e3c40ef55ccbb6fb85ac1456b039cba2df088f88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28290-sky-highs-in-the-cloudforest-at-mashpi-lodge-ecuador", "country": "US", "title": "Sky highs in the cloudforest at Mashpi Lodge, Ecuador", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Sky highs in the cloudforest at Mashpi Lodge, Ecuador", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T15:45:00.000+03:00", "replies_count": 0, "uuid": "e3c40ef55ccbb6fb85ac1456b039cba2df088f88"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28290-sky-highs-in-the-cloudforest-at-mashpi-lodge-ecuador", "ord_in_thread": 0, "title": "Sky highs in the cloudforest at Mashpi Lodge, Ecuador", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sky highs in the cloudforest at Mashpi Lodge, Ecuador Sky highs in the cloudforest at Mashpi Lodge, Ecuador Details Category: Hotel   13:45 Guests of pioneering eco retreat Mashpi Lodge can now discover the Andean cloudforest in one of the most unique ways possible; flying high through the canopy. The Sky Bike is a sustainably designed, human-powered, two-seat tandem ride that zips through the treetops of Mashpi Rainforest Biodiversity Reserve near Quito in Ecuador. \nNoiseless so as not to disturb the abundant wildlife, easy-to-use, and an exhilarating experience for guests of all ages, the Sky Bike dangles in total safety from a 656-foot cable stretched between two points of the forest. The sky rider can take it at their own leisurely pace, for an unforgettable journey of discovery observing the chandelier-like tumbling leaves of the canopy, flora and fauna of the forest, and a river gorge roaring below. Wildlife is much tamer when it encounters humans in unexpected places - such as at the tops of trees - making the Sky Bike one of the most effective vehicles of exploration in the reserve. It is the end result of five prototypes designed with inspiration from an article in Popular Mechanics, reviewed by Roque Sevilla, the visionary behind Mashpi Lodge, a fervent environmentalist, orchid enthusiast and former Mayor of Quito who wishes to “share this wondrous forest with people from around the world.\" Mashpi Lodge opened in April 2012 introducing a sophisticated and strikingly-contemporary springboard for exploring its biodiverse surroundings. Whether seen from the Sky Bike or the foot trails, the wonders waiting at Mashpi Lodge will delight even the worldliest nature lover. Perched at 900m (3,116 feet) above sea level and surrounded by lower montane forest and rainforest, the Lodge is surrounded by a profusion of plant species, from ferns and bromeliads to hundreds of orchid species, many newly discovered. A staggering 400-plus species of bird - including some 36 endemics - are estimated to inhabit the forest, while monkeys, peccaries and even puma make their homes in a forest crisscrossed with waterfalls. Both the Reserve and Mashpi Lodge are deeply committed to protecting the environment and local communities in a thoughtful, sustainable and effective manner. Rates at Mashpi Lodge start from $1,437 per room per night (double occupancy), including all gourmet meals, daytime and nighttime guided explorations, specialised lectures, access to the reserve’s life centre, rain ponchos, rubber boots and transfers from/to major hotels in Quito. The transfer to Mashpi is a highlight in itself, passing near snowcapped volcanos, crossing the Equator, and includes a visit to the Tulipe archaeological site. Related articles", "external_links": [], "published": "2015-08-17T15:45:00.000+03:00", "crawled": "2015-08-17T17:03:52.463+03:00", "highlightTitle": ""}