{"organizations": [], "uuid": "99f9b9b8f1778514a60f54c3dac05699a350f2a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/20150814/c1_655844_150814145056_620x413.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/news-and-pr/655844/holmes-sweet-home", "country": "TH", "title": "Holmes sweet home", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Holmes sweet home", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T23:48:00.000+03:00", "replies_count": 0, "uuid": "99f9b9b8f1778514a60f54c3dac05699a350f2a9"}, "author": "", "url": "http://www.bangkokpost.com/travel/news-and-pr/655844/holmes-sweet-home", "ord_in_thread": 0, "title": "Holmes sweet home", "locations": ["Bangkok"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Holmes", "Wirat Korsestarkarn"], "text": "Get a clue at Bangkok's first detective-themed hotel 14 Aug 2015 at 03:48 110 viewed 0 comments NEWSPAPER SECTION: GURU | WRITER: KASIDIT SRIVILAI - + Marketer-turned-hotelier Wirat Korsestarkarn has transformed his family's four-storey shophouse, located in one of Bangkok's most bustling areas, into a spy-themed bed and breakfast that will stun visitors. \nClimb the wooden stairs that lead to the lobby of The Secret Service, and you'll be greeted by a multitude of spy devices and guns adorning the wall. In the cosy lobby, which is also a breakfast area and internet corner, your attention is drawn to the unusual, branch-like golden light fixture, which somewhat resembles a tiny version of Singapore's Skytree. \nThe Secret Service isn't the place for modern and high-tech spies, as vintage pieces seamlessly blend with the new. You will notice, for instance, old-fashioned TV sets rubbing shoulders with iMacs and old typewriters. \nThe art on the walls also lives up to The Secret Service's funky concept. Don't expect mosaics or luxurious tile -- you'll instead find CD cases covering the walls. Throughout the hallway on the second floor, the walls are decorated with vintage album covers and old film posters. \nThe mysterious guest rooms come in three types: Sidekick, Fantastic 4 and Top Secret. Sidekick (B1,000 per night) is a bunk bed room for two. Fantastic 4 (B2,000 per night) contains double bunk beds, ideal for a family, or three to four travel buddies. \nTop Secret (B2,000 per night) is the most exclusive yet most puzzling room type, at first glance resembling nothing but a tiny space with a mirrored wall. That wall, however, can be flipped, revealing an additional room containing a double bed and a large window overlooking Tanee Road. \nAlso surprising is the surgical lamp placed next to the bed. The owner said it is for spies who are injured during their missions. \nThe Secret Service is a fun and affordable new addition to Bangkok's hospitality scene. For this price range, do not expect large spaces and hi-so in-room amenities, but the hotel's clever design makes up for its lack of glitz and glamour. \nThe Secret Service is located at 113/1 Tanee Road (a three-minute walk from Khao San Road). Visit www.thesskhaosan.com or call 02-002-0711. SPICY SIDEKICK \nIf you're tired of being a spy — or are just hungry after exploring the secret spaces in your room — head to the hotel's rooftop restaurant, At-Mosphere. With a beautiful view of Wat Bowonnivet Vihara, even the most hardened secret agents will be able to momentarily forget their missions. The restaurant mostly serves full-flavoured Thai dishes, from hot to extra hot, such as the Super Soup (spicy soup with boiled chicken feet and wings) and Chili paste with minced salmon. Prepare to order a few bottles of water — even the kick from the spaghetti somehow manages to burn your tongue. Non-guests are also welcome. Tell us what you think about this article Like dislike 0 people liked / 0 people disliked it Share this article", "external_links": [], "published": "2015-08-13T23:48:00.000+03:00", "crawled": "2015-08-14T13:29:20.303+03:00", "highlightTitle": ""}