{"organizations": [], "uuid": "41d5ffc6a8fa1b9bce02124c8652725546fff7c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/7/1/m/7/image.related.StuffLandscapeSixteenByNine.620x349.1670lh.png/1438808762368.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/themes/70871237/20-Guinness-World-Record-breaking-destinations-to-visit-around-the-world", "country": "AU", "title": "20 Guinness World Record-breaking destinations to visit around the world", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "20 Guinness World Record-breaking destinations to visit around the world", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T00:06:00.000+03:00", "replies_count": 0, "uuid": "41d5ffc6a8fa1b9bce02124c8652725546fff7c2"}, "author": "TALIA AVAKIAN", "url": "http://www.stuff.co.nz/travel/themes/70871237/20-Guinness-World-Record-breaking-destinations-to-visit-around-the-world", "ord_in_thread": 0, "title": "20 Guinness World Record-breaking destinations to visit around the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "20 Guinness World Record-breaking destinations to visit around the world TALIA AVAKIAN Last updated 09:06, August 6 2015 \nLARGEST RAILWAY STATION BY NUMBER OF PLATFORMS: New York City's Grand Central Terminal, constructed from 1903 to 1913, has a total of 44 platforms. According to Guinness World Records, besides its 41 tracks upstairs and 26 downstairs, it also has a secret unused platform below the Waldorf Astoria. \nThis year marks the 60th anniversary of the Guinness World Records . \nFor years, the company has showcased amazing and quirky records set by people and places from around the world. \nFrom the world's oldest restaurant, which dates back to 1725, to the highest outdoor elevator, where you'll ascend 1070 feet (326 metres) over the mountains, here are 20 fascinating Guinness World Records set by cities, countries, and states around the world. \nWORLD'S NARROWEST STREET \nYou'd barely be able to slip through Germany's Spreuerhofstrasse street. \nLocated in Reutlingen, the thin street is only a foot wide at its narrowest point. \nFASTEST INTERNET CONNECTION \nSouth Korea has held the record for the fastest broadband service since 2011, having an average download output of 33.5 megabits per second and an average upload speed of 17 megabits per second. \n* World's first underground hot air balloon flight \nCOLDEST INHABITED PLACE \nIn the Siberian village of Oymyakon, Russia, average temperatures hover around -55.5°C in the winter and the village has seen drastic numbers as low as -67°C back in 1933. \nOLDEST NATIONAL PARK \nAmerica's Yellowstone National Park was the first place to be given the title of a national park back in 1872 by President Ulysses S Grant. Today, the park is home to stunning sites like the multi-coloured Grand Prismatic Spring. \nREAD MORE: Yellowstone, US national treasure \nOLDEST CANDY SHOP \nHead to the Oldest Sweet Shop in England, located in Yorkshire, for a selection of candies from the world's oldest shop. It opened in 1827 and serves retro candies like Sherbet Fountains and Parma Violets. See the candy store's collection of goodies . \nLARGEST INDOOR SKI RESORT \nThe world's largest indoor ski resort is located in the Mall of the Emirates in Dubai, where skiers can take advantage of the year-round snow and over 1000 feet (304 metres) of runs, tube slides that let you toboggan through the snow, and a Freestyle Zone for practicing jumps. \nTALLEST OUTDOOR ELEVATOR \nVisitors can admire the stunning formations of China's Zhangjiajie National Forest Park by ascending the 326m-high Bailong Elevator. \nREAD MORE: A day at 'Avatar' national park \nLARGEST DISCO BALL \nLast year, Bestival introduced the world's biggest disco ball - measuring 33 feet and 10 inches in diameter - to cheering crowds at the Desert Island Disco in Robin Hill County Park, Isle of Wight, England. \nOLDEST OPERATING AMUSEMENT PARK \nDenmark's Bakken, located in Klampenborg, opened in 1583 and continues to operate today. According to the park, you'll find over 150 attractions which include one of the oldest wooden roller coasters from 1932. \nSMALLEST COUNTRY \nThe State of the Vatican City, or Holy See, is considered its own country and takes the title for the world's smallest at an area of 0.44 square kilometres. \nLARGEST CAVE CASTLE \nThe Predjama Castle, located near Postojna, Slovenia, resides in the entrance of a cave system that is located halfway up a 122m cliff face. The castle was originally built in the 13th century and is a beloved attraction for visitors of the country. \nMOST ACTIVE VOLCANO \nHawaii's Kilauea volcano has been erupting continually since 1983. Its massive eruptions have made it a must-see attraction when visiting the state. \nMOST MONEY SPENT ON TOURISM \nChina set the record in 2012, spending a whopping US$102 (NZ$156.6) billion on tourism. Contenders include Germany, who spend US$83.8 billion that year, and USA, who spent US$83.5 billion. \nWORLD'S OLDEST RESTAURANT \nYou can still dine at the world's oldest restaurant - Restaurante Botín - located in Madrid, Spain. Created in 1725, it still maintains its original 18th-century interiors and firewood oven today. \nTALLEST WATER SLIDE \nThe Verrückt, located at the Schlitterbahn Water Park in Kansas City, Kansas, has a record-breaking height of 168 feet and seven inches. \nWATCH: Would you brave this terrifying free-fall drop? \nMOST EXPENSIVE CITY TO EAT IN RESTAURANTS \nBased on a survey from 10,000 people's costs of dining in 45 cities, Zagat concluded that London will cost you the most for your meal, with the average cost of a three-course meal and a glass of wine totaling US$79.66. \nLARGEST NATIONAL PARK \nThe Northeast National Park, located in Greenland, spans 971,997 square kilometres. \nDEEPEST SWIMMING POOL FOR DIVING \nY-40, located in Montegrotto Terme, Italy, is 137 feet (41 metres) deep and contains over a million gallons of thermal water. It's so deep that you have to scuba dive to reach the bottom. \nWATCH: The world's deepest pool \nTALLEST HOTEL \nDubai's JW Marriott Marquis Hotel is 1165.84 feet high and has two towers that reach 72 floors. There's a lounge bar on its top floor where you can see skyscraping views of the city.", "external_links": [], "published": "2015-08-06T00:06:00.000+03:00", "crawled": "2015-08-06T01:53:42.656+03:00", "highlightTitle": ""}