{"organizations": [], "uuid": "7a9ed1620efb91f29fc2ea80b18eb604c880ae04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29884059/india-radio-taxi-services-market-to-grow-at-over-17-through-2020-says-techsci-research", "country": "US", "title": "India Radio Taxi Services Market to Grow at Over 17% Through 2020, Says TechSci Research", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "India Radio Taxi Services Market to Grow at Over 17% Through 2020, Says TechSci Research - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "7a9ed1620efb91f29fc2ea80b18eb604c880ae04"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29884059/india-radio-taxi-services-market-to-grow-at-over-17-through-2020-says-techsci-research", "ord_in_thread": 0, "title": "India Radio Taxi Services Market to Grow at Over 17% Through 2020, Says TechSci Research", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " TechSci Research\nBURNABY, Canada , August 26, 2015 /PRNewswire/ --\nIncreasing adoption of aggregator model along with changing travellers ' lifestyle and preferences to drive radio taxi services market in India\nAccording to recently released TechSci Research report, \" India Radio Taxi Services Market Forecast & Opportunities, 2020 \" , radio taxi services market in India is forecast to grow at over 17% through 2020. The market has been witnessing robust growth over the last few years as customers are increasingly shifting from traditional taxis to radio taxis. The growing inclination of customers towards radio taxis can be attributed to various tangible and intangible offerings like booking convenience through mobile applications, air conditioning, educated and skilled drivers and operators, multiple payment options, 24×7 customer support, electronic fare meters, panic switch, GPS, etc.\n(Logo: http://photos.prnewswire.com/prnh/20140117/663730 )\nIn 2011, radio taxi companies in India started adopting the Aggregator Business Model. Since the launch of this concept in India , the radio taxi services market in the country has been witnessing tremendous growth. Currently, companies operating under aggregator model are exhibiting double digit growth, and rising adoption of this model is opening up the market for unorganized taxi operators, providing them with an option to switch to organized radio taxi services market. Major radio taxi service providers in India include ANI Technologies, Uber Technologies, Serendipity Infolabs, Meru Cabs, Carzonrent and Mega Cabs, among others. With major presence in metro cities as well as major tier-2 cities, these players are increasing focus on expanding their service network in tier-3 cities as well.\n\"Radio taxi services market offers a lucrative business opportunity in India , as a result of which a large number of investors are expressing interest in this business domain. Venture capitalists, private equity firms and angel investors, both of domestic and international origin, have made huge investments in India radio taxi services market over the last few years. Aggregator model based OLA, is the largest operator in India , having raised more than USD650 million worth of funds from investors till mid-2015.\", said Mr. Karan Chechi , Research Director with TechSci Research , a research based global management consulting firm.\n\" India Radio Taxi Services Market Forecast & Opportunities, 2020 \" has evaluated the future growth potential of India radio taxi services market, and provides statistics and information on market structure and future growth of the market. The report is intended to provide cutting-edge market intelligence and help decision makers take sound investment evaluation. Besides, the report also identifies and analyzes the emerging trends along with essential drivers, challenges and opportunities available in India radio taxi services market.\nAbout TechSci Research\nTechSci Research is a global market research and consulting company with offices in Canada , UK and India . TechSci Research provides market research consulting services in six verticals - Information Technology, Chemicals, Water & Water Recycling, Consumer Goods & Retail, Automotive and Energy & Power. The company uses proprietary innovative business model that focuses on improved productivity that also ensure the creation of high-quality reports. With more than 100 client engagements with fortune 500 clients, TechSci Research enjoys the status of a premium market research services provider in the industry.\nMedia Contact\nKen Mathews\nSales & Marketing Consultant\nContact Phone- +1 646 360 1656\nEmail- ken.mathews@techsciresearch.com\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201508267406&Transmission_Id=201508261130PR_NEWS_USPR_____enUK201508267406&DateId=20150826", "http://www.techsciresearch.com/3660", "http://photos.prnewswire.com/prnh/20140117/663730", "http://www.xmlnews.org/ns/"], "published": "2015-08-26T03:00:00.000+03:00", "crawled": "2015-08-26T20:25:00.700+03:00", "highlightTitle": ""}