{"organizations": [], "uuid": "9294f0bd2d73ea7d26da7da54eca4c5758652601", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vancouversun.com", "main_image": "http://www.vancouversun.com/cms/binary/11327157.jpg", "site_section": "http://www.breakingnews.com/feeds/rss/air-travel", "section_title": "Breaking news on air travel - breakingnews.com", "url": "http://www.vancouversun.com/business/Activist+files+emergency+help+SkyGreece+Airlines+stranded/11324320/story.html?hootPostID=7926388fc9bce80b65ee0b73513cc902", "country": "US", "title": "Activist files for emergency help for SkyGreece Airline's stranded passengers - @VancouverSun", "performance_score": 0, "site": "vancouversun.com", "participants_count": 1, "title_full": "Activist files for emergency help for SkyGreece Airline's stranded passengers - @VancouverSun", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T19:53:00.000+03:00", "replies_count": 0, "uuid": "9294f0bd2d73ea7d26da7da54eca4c5758652601"}, "author": "Rebecca Bratek", "url": "http://www.vancouversun.com/business/Activist+files+emergency+help+SkyGreece+Airlines+stranded/11324320/story.html?hootPostID=7926388fc9bce80b65ee0b73513cc902", "ord_in_thread": 0, "title": "Activist files for emergency help for SkyGreece Airline's stranded passengers - @VancouverSun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Activist files for emergency help for SkyGreece Airline's stranded passengers By Ross Marowits, The Canadian Press August 29, 2015 9:00 AM Gabor Lukacs is seen at home in Halifax on Thursday, Jan. 23, 2014. Lukacs says the Canadian Transport Agency has broad powers and should use them now to protect an estimated 1,000 passengers affected by recent flight cancellations by SkyGreece Airlines. Photograph by: Andrew Vaughan , Ottawa Citizen \nThe Canadian Transportation Agency is being asked for an emergency order to protect and compensate stranded passengers of SkyGreece Airlines, which ceased operations on Thursday after more than a week of disrupted service. \nA claim filed Friday by passenger rights advocate Gabor Lukacs says the federal agency has broad powers and should use them now to protect an estimated 1,000 passengers affected by recent flight cancellations by SkyGreece Airlines. \nLukacs is calling on the agency to order SkyGreece to rebook its stranded passengers on other airlines within 24 hours and put up $8.7 million of security to cover passenger claims. \nThe agency issued an order late Friday giving SkyGreece until 5 p.m. on Monday to file a response to Lukacs' request for an expedited process. On its website the agency said unused tickets may be eligible for refunds from travel agencies, credit card companies and travel agencies in Ontario, Quebec and British Columbia. \nQuebec's consumer protection agency said passengers from the province who purchased their flights from a licensed travel agency can be reimbursed for returning flights and costs such as accommodaton and food. It has appointed accounting firm Raymond Chabot Grant Thornton to manage such claims and help passengers return to Canada. \nMessages to SkyGreece were not returned. The company said in a news release that the flight disruption was due to technical issues and financial setbacks resulting from the Greek economic crisis that took place shortly after it launched scheduled international service in May. \n\"Unfortunately, as a result of recent technical issues, the company is now facing a system-wide, multi-day delay and significant additional expenses.\" \nThe company didn't specify what technical issues it was experiencing. However, it said that a European regulation governs the rights and method of claims for cancelled flights operated by SkyGreece Airlines SA. \nSkyGreece also called the flight cancellations a temporary situation, with operations expected to resume soon. \nThe owner of a Toronto travel agency that specializes in travel to Greece said she's struggling to help people who have called seeking one-way flights out of that country. \n\"It's pretty chaotic,\" Fotoula Kakagiannis of National Travel Service said, adding that there is limited space on the flights that are available and prices were rising. \n\"The ones that have kids all want to be back next week and that's a tough task at this point.\" \nSkyGreece initially paid for hotel rooms in Greece, but passengers were told Thursday that support would end, Kakagiannis said. \nThe airline was founded in 2012 and started operations in 2014 with one plane, which is now parked at Toronto's Pearson International Airport. \nLukacs said in his filing that SkyGreece's main asset is its only plane and passengers would be left without any remedy if the airline is allowed to dispose of the aircraft. \nSkyGreece is headquartered in Athens, Greece, a member of the European Union. But in his application to the Canadian Transportation Agency, Lukacs says the company is registered as a Quebec corporation and owned or controlled by Canadians. \nFollow @RossMarowits on Twitter.", "external_links": [], "published": "2015-08-29T19:53:00.000+03:00", "crawled": "2015-08-29T20:55:48.496+03:00", "highlightTitle": ""}