{"organizations": [], "uuid": "05a0fc494d79726e764d0e5a6dcf30ef13e6c5d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/arenas-and-conference-centres/28363-asian-bride-live-heading-to-the-nec", "country": "US", "title": "Asian Bride Live heading to the NEC", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Asian Bride Live heading to the NEC", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T12:30:00.000+03:00", "replies_count": 0, "uuid": "05a0fc494d79726e764d0e5a6dcf30ef13e6c5d2"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/arenas-and-conference-centres/28363-asian-bride-live-heading-to-the-nec", "ord_in_thread": 0, "title": "Asian Bride Live heading to the NEC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Asian Bride Live heading to the NEC Asian Bride Live heading to the NEC Details Category: Arenas and Conference Centres Created on Thursday, 20 August 2015 10:30 Chilli Mag Ltd., organiser of Asian Bride Live, has signed a deal with the National Exhibition Centre (NEC) that will see the next Midlands edition of the show held at the Birmingham venue. The hugely prestigious Asian wedding show, has previously held its Midlands edition at the NEC’s sister venue, the International Convention Centre (ICC) – both venues are part of the NEC Group. The organiser is now looking to grow and develop the show and believes the NEC can help achieve this. \nAsian Bride Live Event Director, Waleed Jahangir said: “The NEC is a great venue that offers us the flexibility to grow. Whilst we continue to have a fantastic relationship with the ICC, we have reached our capacity there, so the next natural step is to move to a bigger venue. The NEC Group is one of the world’s top venue management companies so we had no hesitation to simply move to another venue within the Group’s portfolio.” Asian Bride Live at the NEC will take place in the venue’s pavilion from 12-13 December and is expecting to see visitor numbers increase from 3,500. The Birmingham edition of Asian Bride Live has traditionally been a one day event but will now take place over two days in response to demand. Jenny Wright, NEC Business Development Executive – Exhibitions, said: “We are looking forward to welcoming Asian Bride Live to the NEC. The organisers have some great ideas of how to make use of the extra space that our venue offers and we are excited about working together to bring them to life. Visitors should expect a truly exciting and engaging event.” Over 180 exhibitors are expected at the show and three fashion shows set to run per day. Latest news", "external_links": [], "published": "2015-08-20T12:30:00.000+03:00", "crawled": "2015-08-20T12:43:08.461+03:00", "highlightTitle": ""}