{"organizations": [], "uuid": "84832498c67d35c5a850399f004cbb438beeb760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62634/kenya-golf-tourism-and-good-business", "country": "US", "title": "Kenya: Golf is tourism - and good business", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Kenya: Golf is tourism - and good business", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T02:20:00.000+03:00", "replies_count": 0, "uuid": "84832498c67d35c5a850399f004cbb438beeb760"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/62634/kenya-golf-tourism-and-good-business", "ord_in_thread": 0, "title": "Kenya: Golf is tourism - and good business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya: Golf is tourism - and good business eTN News: Original, timely global, travel, tourism, business updates - opinion included: \nBy Prof. Dr. Wolfgang H. Thome, eTN Africa Correspondent | Aug 15, 2015 Tob Cohen – Chairman Tourism Committee, Jesse Mungai, Tonney Muiruri – Picture courtesy of Tob Cohen Banners on eTN stories could be advertising \nThe Kenya Tourism Board has for some time now actively promoted golfing holidays, aiming to bring in tourists who, besides enjoying a big game safari and a beach side vacation like to play on one of the several championship courses the country offers today. Some upcountry resorts like the Aberdare Country Club and the Mount Kenya Safari Club in fact offer their guests the option to play ‘inhouse’ while city hotels and leading beach resorts have arrangements in place for guests to play at a nearby course. \nThe Kenya Golf Union has now taken their own steps to help promote Kenya as East Africa’s premier golfing destinations and inaugurated a special tourism subcommittee tasked with promoting and marketing the country to bring some 30.000 golfers into the country in the near term. \nSaid Tob Cohen in his communication to this correspondent: ‘Kenya is blessed with great golfing weather, perhaps the best in the world. Kenya has 42 good quality golf courses — from the Baobab Course at Vipingo Ridge and the Nyali Golf and Country Club at the Coast, the Windsor Golf Hotel and Country Club, Muthaiga Golf Club, Karen Country Club, Limuru Country Club, Sigona Golf Club, Nyahururu and others in Nairobi to the magnificent Great Rift Valley Golf Resort in Naivasha and the scenic Kitale Club in the north. In the mountain region, the famous Mount Kenya Safari Club features the only golf course in the world where the equator crosses. Moreover, there are more than ten golf courses developments’. \nSpeaking during the launch of the sub-committee at the KGU offices at Muthaiga in the presence of KGU chairman Anthony Muhoro, Cohen added that the committee will bring together hotels, airlines, local tour operators and corporate bodies in a joint effort to elevate the profile of Kenya golf tourism. ‘The future definitely looks bright for golf in Kenya, with the concerted efforts of both the private sector, Ministry of Tourism and KTB, Kenya is well positioned to harness the tourism potential of golf’. \nThe initiative of the Kenya Golf Union was warmly welcomed by the Kenya Tourism Board and tourism stakeholders who appreciated the support at a time when the country’s tourism recovery is going underway.", "external_links": [], "published": "2015-08-16T02:20:00.000+03:00", "crawled": "2015-08-16T04:17:13.655+03:00", "highlightTitle": ""}