{"organizations": [], "uuid": "1d604d2e2cde8fde121efb4b46bdf54c22c72870", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62215/nicaraguas-new-costa-esmeralda-airport-opens-november", "country": "US", "title": "Nicaragua's new Costa Esmeralda Airport opens in November", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Nicaragua's new Costa Esmeralda Airport opens in November", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T00:35:00.000+03:00", "replies_count": 0, "uuid": "1d604d2e2cde8fde121efb4b46bdf54c22c72870"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62215/nicaraguas-new-costa-esmeralda-airport-opens-november", "ord_in_thread": 0, "title": "Nicaragua's new Costa Esmeralda Airport opens in November", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Nicaragua's new Costa Esmeralda Airport opens in November Adv: \nAug 04, 2015 Adv: \nTOLA, Nicaragua - Corporacion del Sur, SA, a member of Pellas Development Group – developer of Nicaragua’s first luxury resort, Mukul Beach, Golf & Spa at Guacalito de la Isla – in association with the Nicaragua Tourism Board, announces the opening of Costa Esmeralda Airport. Providing direct aviation access to the Pacific Coast, the new airport is set to be a game-changer for visitors traveling to Nicaragua and is located only 15 minutes away from Mukul Beach, Golf & Spa. Commencing November 2015, the new airport will begin service for international private jets and commercial flights from both Managua’s Augusto C. Sandino International Airport and Costa Rica’s Liberia International Airport. \nCosta Esmeralda Airport allows for greater accessibility to the region and supports Nicaragua’s emerging tourism infrastructure. The airport was developed in conjunction with the Nicaraguan government and Nicaraguan entrepreneur and philanthropist Don Carlos Pellas, coming on the heels of his last investment, Guacalito de la Isla, the $250-million, 1,670-acre private beach community on Nicaragua’s Emerald Coast that is home to Mukul. \n“The arrival of Costa Esmeralda Airport will introduce the country to a global audience seeking new adventures and serve as a direct route to our majestic coast,” said Don Carlos Pellas, owner, Pellas Development Group, “It will reduce transfer time from Managua and Costa Rica, supporting Nicaragua’s flourishing tourism, which is essential to the country’s development.” \nThe single terminal airport was built on a new site five miles north of Guacalito de la Isla in the department of Rivas. The 5,000-foot runway, designed by Thomas Chastain of T.H. Chastain Engineering PLLC of New York, will accommodate ATR-42, ATR-72, Gulfstream V jets and most turboprop planes. Built by a joint venture of local Nicaraguan contractors D’Guerrero Ings, Lansa S.A. y Pavinicsa S.A., Costa Esmeralda Airport will immediately immerse travelers into the country’s enchanting coast and welcome them with a relaxed beach atmosphere reflective of Mukul’s design aesthetic. Costa Esmeralda Airport will house a Customs Department and a duty-free shop.", "external_links": [], "published": "2015-08-05T00:35:00.000+03:00", "crawled": "2015-08-05T00:52:19.394+03:00", "highlightTitle": ""}