{"organizations": [], "uuid": "674c3a925dbb191611adb037efb4e7136637a10d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/08/15/15/2B631BEC00000578-0-image-a-7_1439649788685.jpg", "site_section": "http://www.dailymail.co.uk/travel/articles.rss", "section_title": "Travel Articles | Mail Online", "url": "http://www.dailymail.co.uk/travel/article-3199141/From-ocean-swells-losing-audience-napkin-folding-class-one-journalist-turned-lecturer-smooth-journey-Baltic-cruise.html", "country": "GB", "title": "From ocean swells to losing the audience to 'a napkin-folding class:' How one journalist-turned-lecturer had a less-than-smooth journey on his Baltic cruise", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 1, "title_full": "From ocean swells to losing the audience to 'a napkin-folding class:' How one journalist-turned-lecturer had a less-than-smooth journey on his Baltic cruise | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T05:33:00.000+03:00", "replies_count": 0, "uuid": "674c3a925dbb191611adb037efb4e7136637a10d"}, "author": "Bill Hagerty For The Mail On Sunday", "url": "http://www.dailymail.co.uk/travel/article-3199141/From-ocean-swells-losing-audience-napkin-folding-class-one-journalist-turned-lecturer-smooth-journey-Baltic-cruise.html", "ord_in_thread": 0, "title": "From ocean swells to losing the audience to 'a napkin-folding class:' How one journalist-turned-lecturer had a less-than-smooth journey on his Baltic cruise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View\ncomments\nFor those 1.5 million or so Britons who take to life on the ocean waves for a holiday each year, the combination of sun and sea is a perfect recipe for relaxation. But not for me.\nA period patrolling the showbusiness beat in my journalistic career paid unexpected dividends when it eased my way to resuming a pleasant sideline in lecturing on board ships.\nTwenty years previously, courtesy of Cunard, I crossed the Atlantic half a dozen times, cruised the Mediterranean, and explored the Norwegian fjords aboard the elegant QE2, talking about various media matters and the life, times and dramatic death of tycoon Robert Maxwell.\nThe cruise took place on the sophisticated Saga Sapphire on a 16-day sojourn around the Baltic\nNow, recommended by an experienced on board speaker friend, I was invited by Saga Holidays to join the small but sophisticated Saga Sapphire on a 16-day sojourn around the Baltic.\nThis time my subject was to be my experiences with some of the world’s biggest stars: how John Wayne and I shared and demolished a bottle of tequila, and the meeting at Groucho Marx’s home when he entertained me by singing the old cockney music hall song It’s A Great Big Shame.\nSuch material would, I reasoned, enthral a Saga audience of mature years and a fondness for movie legends.\n Taking on the 'Heidi hike': Trekking from hut to hut is an... New York's autumn collection: Why you SHOULD visit the city... When the journey really IS the best part: The scenic roads... Rare photographs show the fascinating early days of London's... I had, however, failed to remember the perils of the shipboard lecturer, among which the sea and sun are paramount.\nThe slightest ocean swell sends passengers scurrying to their staterooms or, depending on their chosen method of dealing with such a crisis, to the nearest bar.\nLearning how a guest lecturer once thought Robert Mitchum was going to biff him on the nose cannot compete with a nervous stomach, especially if its owner has seen Titanic.\nAnd as for a sudden burst of sunshine, it can clear a room faster than a bored prankster shouting: ‘Man the lifeboats!’\nFor those 1.5 million or so Britons who take to life on the ocean waves for a holiday each year, the combination of sun and sea is a perfect recipe for relaxation\nHence, my anecdote of how a young Helen Mirren interrupted our lunch to visit the restaurant’s ladies’ room and purloin a couple of the establishment’s lavatory rolls hadn’t reached the point of her cheerfully confessing to me that she had done so when, following a whispered weather update at the back, half my audience filed out of the room, rubbing sun cream on their faces en route to the sunloungers on the upper decks.\nThere are other bums-on-seats handicaps to overcome too.\nAlas, there is little one can do to influence the hard-of-hearing’s collective decision to watch the presentation relayed from one static camera to the television screens in their cabins, turning up the volume and soon dozing off, therefore missing my carefully orchestrated visual effects.\nNor can one hope to survive the competition of other onboard activities – my audience figures on one voyage on the QE2 were once trounced by an instruction class in napkin-folding.\nStirred into action: Hagerty once met Former James Bond star actor Roger Moore in South Africa\nPractice makes frequent interruptions by jaded or larky passengers easier to circumnavigate, although I was stumped when, having mentioned the London borough where I had started my career in journalism, a man in the third row suddenly asked, loudly, whether I’d ever met his niece who worked there in Sainsbury’s.\nSo it’s not all plain sailing, but the compensations can be considerable.\nLecturers and partners enjoy free travel and excellent food and shipboard facilities.\nOn the Sapphire we were treated grandly by the captain and my fellow crew members.\nAnd we did meet some charming and interesting passengers – even if some were less than riveted by what Roger Moore once said to me by a swimming pool in South Africa…\nTravel Facts: Plan your own Baltic cruise Saga (0800 505030) offers a 14-night Baltic Capitals cruise departing Dover on August 4 next year from £2,938pp.\nThis includes full-board accommodation with wine, UK travel to and from Dover, gratuities, entertainment and activities, a welcome cocktail party, Captain’s dinner and visas.\nRead more: Saga Ocean Cruises - Saga Holidays", "external_links": ["http://dailym.ai/1Wu925z", "http://saga.co.uk/cruises"], "published": "2015-08-16T05:33:00.000+03:00", "crawled": "2015-08-16T01:42:54.464+03:00", "highlightTitle": ""}