{"organizations": [], "uuid": "cfa274b148ea80587946785f99b1e52c6e78c2aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62316/airport-using-twitter-keep-passengers-updated", "country": "US", "title": "Airport using Twitter to keep passengers updated", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Airport using Twitter to keep passengers updated", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T20:19:00.000+03:00", "replies_count": 0, "uuid": "cfa274b148ea80587946785f99b1e52c6e78c2aa"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62316/airport-using-twitter-keep-passengers-updated", "ord_in_thread": 0, "title": "Airport using Twitter to keep passengers updated", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airport using Twitter to keep passengers updated Adv: \nAug 06, 2015 Adv: \nVANCOUVER ISLAND, Canada - The Comox Valley Airport will use its Twitter account @FlyYQQ to keep passengers updated about any traffic delays or issues that could affect their flights from the Comox Valley Airport the day of the Comox Air Show. \n\"Twitter provides us with the means to get a message out very quickly to our passengers should the need arise,\" said Comox Valley Airport CEO Fred Bigelow. \"We invite anyone travelling out of YQQ during the Comox Air Show to follow us on Twitter to stay informed.\" \nBigelow noted that hotels, shuttle operators, taxi drivers and anyone else planning to access the terminal building during the Comox Air Show should also follow @FlyYQQ or search the hashtag #YQQAirShow on Twitter and Facebook for updates. \nThe Comox Valley Airport will continue posting important information at its website including: instructions on how to get to the airport, when to arrive for flights and how to access the terminal building during the Air Show. The airport continues to recommend that all passengers travelling during the weekend of the Comox Air Show visit the website to get the information they need about their flight. \n\"Everything you need to know is on our website including recommended flight check-in times, designated access routes to the airport and a printable access pass for your windshield to help prevent delays at traffic check points,\" explained Bigelow.", "external_links": [], "published": "2015-08-06T20:19:00.000+03:00", "crawled": "2015-08-06T20:33:33.813+03:00", "highlightTitle": ""}