{"organizations": [], "uuid": "910176455638aa908447f4440c4a24a9f630d917", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.staradvertiser.com", "main_image": "http://sa-media.s3.amazonaws.com/images/logo.jpg", "site_section": "http://www.staradvertiser.com/travel/index.rss", "section_title": "Travel", "url": "http://www.staradvertiser.com/travel/20150816_report_urges_limit_on_airline_fees.html", "country": "US", "title": "Report urges limit on airline fees", "performance_score": 0, "site": "staradvertiser.com", "participants_count": 2, "title_full": "Report urges limit on airline fees - Hawaii News - Honolulu Star-Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-08-16T09:30:00.000+03:00", "replies_count": 4, "uuid": "f8e0f9f749db78350c0114b94aee954497d02b7e"}, "author": "", "url": "http://www.staradvertiser.com/travel/20150816_report_urges_limit_on_airline_fees.html#post-0", "ord_in_thread": 0, "title": "Report urges limit on airline fees", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Eric Rose knew that he would take a financial hit when he needed to reschedule a flight home with his wife, Marci, after dropping off their son at college in Tucson. After all, he had bought two $160 nonrefundable tickets. But Rose, a partner in a Los Angeles government relations and communications firm, was caught off guard by the fine print on his American Airlines tickets that said he had to pay $400 in change fees to re-book.\n“I’m a pretty savvy consumer and I understand the English language, but this stuff is written in legalese,” he complained. “It’s mind-boggling.”\nA staff report from the Senate Commerce Committee agrees with Rose. The report, released recently, calls for a crackdown on passenger fees and recommends that airlines produce a standardized chart to disclose all extra charges, making it easier for fliers to understand what they must pay.\nAs far as change fees go, the report suggested that the charges be limited to a “reasonable amount” and be reduced or eliminated if a flier cancels with enough lead time to let the airline resell the seat.\nThe report, written by the staff of Sen. Bill Nelson, D-Fla., the ranking Democrat on the Senate Commerce Committee, noted that booking a round trip on United Airlines from Washington, D.C., to Orlando, Fla., with a stopover in Chicago produced 54 pages of rules and restrictions.\nBooking seats sooner\nThanks to growing demand for air travel, 222 million passengers are expected to fly on U.S. carriers this summer, the highest total on record.\nBut with airlines adding extra flights sparingly, vacationers are being forced to book travel plans extra early.\nAlex Cosmas, chief scientist for the McLean, Va., consultant Booz Allen Hamilton, crunched airline data to conclude that the competition for seats has pushed booking trends up by a week compared with the previous year.\nFor example, window and aisle seats, on average, are being booked three days earlier this summer than last summer, the analysis found.\nAnd the traditionally unpopular middle seats are 34 percent less likely to remain empty this summer compared with last year.\nThe good news, Cosmas said, is that travelers have become more savvy and more reliant on mobile apps and online search engines to find the best travel deals.\nHugo Martin, Los Angeles Times\n ", "external_links": [], "published": "2015-08-16T09:30:00.000+03:00", "crawled": "2015-08-18T10:24:32.248+03:00", "highlightTitle": ""}