{"organizations": ["Boeing", "Wikipedia"], "uuid": "e1fc8dbfe6ca2e376b252e8d114f28a56b93a493", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "airtravel.about.com", "main_image": "http://f.tqn.com/y/airtravel/1/S/S/O/1024px-Boeing_707-138B_Qantas_Jett_Clipper_Johnny_N707JT.jpg", "site_section": "http://z.about.com/6/o/m/airtravel_t2.xml", "section_title": "About.com Air Travel: What's Hot Now", "url": "http://airtravel.about.com/od/airlines/fl/The-Dummies-Guide-to-Boeing-Part-1.htm", "country": "US", "title": "In the first of a two-part series, we look at...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "In the first of a two-part series, we look at...", "spam_score": 0.0, "site_type": "news", "published": "2015-08-03T14:02:00.000+03:00", "replies_count": 0, "uuid": "e1fc8dbfe6ca2e376b252e8d114f28a56b93a493"}, "author": "", "url": "http://airtravel.about.com/od/airlines/fl/The-Dummies-Guide-to-Boeing-Part-1.htm", "ord_in_thread": 0, "title": "In the first of a two-part series, we look at...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Travolta"], "text": "The Dummies Guide to Boeing, Part 1 Starting the Jet Age Sign Up for our Free Newsletters Thanks, You're in! Health Tip of the Day Sign up There was an error. Please try again. Please select a newsletter. Please enter a valid email address. Did you mean ? Expert Videos John Travolta's Boeing 707 jet in the Qantas livery. Photo courtesy of Phinalanji via Wikipedia \nSeattle-based Boeing’s history goes back to its founding in 1916, a mere 13 years after the Wright Brothers’ first historic flight, making it one of the pioneers of the early days of aviation. Click here to see my post on competitor Airbus. \nThis post will jump to Boeing’s history in developing commercial jet aircraft. The jet age was almost over before it began after structural problems led to catastrophic accidents in the British-built de Havilland Comet , launched in 1952. \nBut Boeing President William Allen and his management are said to have “ bet the company” on a vision that the future of commercial aviation was jets. In 1952, the board gave the go-ahead to commit $16 million of the company’s own money to building the pioneering 367-80, nicknamed the “Dash 80.” The Dash 80 prototype led to t he four-engined commercial 707 jet and the military KC-135 tanker. In just two years, the 707 launched the commercial jet age. \nBoeing custom-designed 707 variants for different customers, including making a special long-range model for Australia’s Qantas and installing larger engines for Braniff’s high-altitude South American routes. Boeing delivered 856 Model 707s in all versions between 1957 and 1994; of these, 725, delivered between 1957 and 1978, were for commercial use. \nNext up was the three-engine 727 , launched by Boeing in December 1960. It was the first commercial airplane to break the 1,000-sales mark, but it started out as a risky proposition, designed to serve smaller airports with shorter runways than those used by the 707. \nBoeing launched the 727 with 40 orders each from launch customers United Airlines and Eastern Air Lines. The 727 had a distinctive appearance, with its rakish T-shaped tail and its trio of rear-mounted engines. \nThe first 727 rolled out on Nov. 27, 1962. However, by the time of its first flight, orders were still below the estimated break-even point of 200. Originally, Boeing planned to build 250 of the planes. However, they proved so popular (especially after the larger 727-200 model, which carried up to 189 passengers, was introduced in 1967) that a total of 1,832 were produced at the manufacturer’s Renton, Wash., plant. \nIn 1965, Boeing announced its new commercial twinjet, the 737. At a ceremony inside the manufacturer’s Thompson Site on Jan. 17, 1967, the first 737 was introduced to the world. The festivities included a christening by flight attendants representing the 17 airlines that had ordered the new plane, including Germany’s Lufthansa and United Airlines. \nOn Dec. 28, 1967, Lufthansa took delivery of the first production 737-100 model, in a ceremony at Boeing Field. The following day, United Airlines, the first domestic customer to order the 737, took delivery of the first 737-200. By 1987, the 737 was the most ordered plane in commercial history. In July 2012, the 737 became the first-ever commercial jet airplane to surpass the 10,000 orders. \nThe four-engine 747 jumbo jet — the largest civilian airplane in the world — was launched in 1965. In April 1966, Pan Am became the launch customer for the type when it ordered 25 747-100 aircraft and played a pivotal role in designing the jet. \nThe incentive for creating the giant jet came from reductions in airfares, a surge in air-passenger traffic and increasingly crowded skies. In 1990, two 747-200Bs were modified to serve as Air Force One and replaced the VC-137s (707s) that served as the presidential airplane for nearly 30 years. \nThe 747-400 rolled out in 1988, and was launched in late 2000. In November 2005, Boeing launched the 747-8 family — the 747-8 Intercontinental passenger airplane and the 747-8 Freighter. The passenger version, the Boeing 747-8 Intercontinental, serves the 400- to 500-seat market and took its first flight on March 20, 2011. Launch customer Lufthansa took delivery of the first airline Intercontinental April 25, 2012. \nOn June 28, 2014, Boeing delivered the 1,500th 747 to come off the production line to Frankfurt, Germany-based Lufthansa. The 747 is the first wide-body airplane in history to reach the 1,500 milestone. \nHistory courtesy of Boeing .", "external_links": [], "published": "2015-08-03T14:02:00.000+03:00", "crawled": "2015-08-04T03:27:12.005+03:00", "highlightTitle": ""}