{"organizations": [], "uuid": "06ab284a0a6ab7942cd215a62206b5634244819e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buyingbusinesstravel.com", "main_image": "", "site_section": "http://buyingbusinesstravel.com/rss.xml", "section_title": "Buying Business Travel", "url": "http://buyingbusinesstravel.com/feature/1524569-challenges-managing-travel-programme-smes", "country": "IE", "title": "The challenges of managing a travel programme for SMEs", "performance_score": 0, "site": "buyingbusinesstravel.com", "participants_count": 1, "title_full": "The challenges of managing a travel programme for SMEs", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T10:23:00.000+03:00", "replies_count": 0, "uuid": "06ab284a0a6ab7942cd215a62206b5634244819e"}, "author": "Martin Ferguson", "url": "http://buyingbusinesstravel.com/feature/1524569-challenges-managing-travel-programme-smes", "ord_in_thread": 0, "title": "The challenges of managing a travel programme for SMEs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The challenges of managing a travel programme for SMEs 0 comments Follow @BBT_online \nThe UK's Federation of Small Businesses (FSB) has around 200,000 members across 33 regions and 188 branches. Last year, the organisation calculates, small- and medium-sized enterprises (SMEs) employed more than 15 million people and had a combined turnover of £1.6 trillion. \nOut of the five million businesses in the UK, employing 25 million people, and with a combined turnover of more than £3.5 trillion, small firms alone accounted for 99.3 per cent of all private sector businesses, 48 per cent of private sector employment and 33 per cent of private sector turnover. So it comes as something of a surprise to learn that corporate travel savings seem to have passed them by. \n“Unfortunately, we do not currently have any travel-related member benefits and it’s not an active area of work for us,” says the FSB’s senior press officer, Jack Neill-Hall. Of course, it’s not Jack’s job to negotiate deals for his organisation’s members, but one cannot help but feel that someone is missing a trick here. More than one-third of all SMEs are involved in the wholesale and retail sectors; 18 per cent work in the construction industry; and a further 15 per cent are involved in the professional, scientific and technical sectors. \nOf course, not all those 15 million employees will be travellers. Your average shop-keeper or bricklayer probably isn’t beating a path to the local airport to ply their trade in far-flung places. \nHowever, if only 1 per cent of those employees spends no more than £100 a year on travel, that’s still £15 million. And, given the cost of, for example, train travel these days, it seems reasonable to assume that those employees who do travel spend a great deal more than that... \nWhich is precisely what the folks at FCM Travel Solutions woke up to five years ago. Originally established as the UK corporate brand of Australia’s Flight Centre Limited, the Corporate Traveller brand was created in 2010 specifically to target the SME sector. In June last year, annual turnover exceeded £200 million. Last month, if 2014 targets prove to have been met, annual turnover will have been closer to £240 million. \nNot that it is an easy ride, as Corporate Traveller area manager Donna Crompton explains. “You can have a company spending £200,000 a year, but they may only have six travellers. There’s a huge range – when you are looking at the SME market, you have companies spending anything from £50,000 a year to £2 million. You have got to be flexible because every client is very different. With SMEs you are looking at having a relationship straight away, either with the travel booker or with the purchasing department. Larger companies already have procurement people in place. With SMEs, they haven’t been told what to do, so you work with them as their procurement provider. They want someone to manage their travel and make it cost-effective, they want to be exposed to negotiated rates, but they also want to a have a hand in managing the travel.” \nTHE TECHNICAL TOUCH \nNigel Meyer, chief operating officer at Fraedom, HRG’s new baby, says that “When you are looking at SMEs, you have companie spending anything from £50,000 a year to £2 million”. \nSMEs are – from a travel management company perspective – the next big thing. “We have worked in the larger cor­porate market in the past, although we have always dealt with SMEs,” he says. “What has happened in the last ten years or so is there’s been a gradual migration away from telephone service to an online environment. We see SMEs as an oppor­tunity to further our client base.” \nThe two companies’ approaches could hardly be more different. While Corporate Traveller’s Crompton repeatedly stresses the “personal” nature of the SME busi­ness, Meyer emphasises that Fraedom is technology-driven – albeit with a highly-specialised back-up team. \n“I have worked within the travel indus­try for many years and have been with Corporate Traveller for seven, and what I like is the relationships,” Crompton insists. “You get to know the travel booker, the office manager and even the travellers. It’s very much built on relationships – you become part of their company, you aren’t just another service provider.” \nFraedom, Meyer says, is “a generic service and solution” designed for com­panies with a travel spend of up to around \n£1.5 million. “We have all the assets and at­tributes to provide a predominantly online service, but backed up with a telephone service. We give them a higher degree of visibility on spend – one of their challenges is that they often don’t know how big it is, or where the money is going.” \nLaunched on the eve of this year’s Busi­ness Travel Show, Fraedom is totally SME-specific, which means it does not translate into all markets. “We are starting in the UK, and we have been slowly ramping it up from that point and making sure we have got the proposition just right,” says Meyer. “I think our next port of call will be Australia, because that’s another market that’s suitable for this kind of operation.” Europe? “Not right now, but we will look at any opportunities.” \nSMALL BUT SUSSED \nThey may be small, but SMEs are far from naïve. “I think SMEs are quite savvy when it comes to travel,” Crompton says. “It’s not as though they come to us and ask for things they can’t have. \n“They want to have access to technol­ogy, just as much as a large company. They expect the turnaround times to be quicker. Travel is often very last-minute, and they need to know they can ring up saying: ‘I have to go to Germany’ – the account man­agers will know the traveller’s profile, they will know where in Germany he needs to be and which hotels he likes to stay in. It can be high-touch, but not in a bad way. We work in teams and each team has a portfolio of clients. We want them to come to us with their travel because ultimately we want to give them the best service we can.” \nWHEN SMEs GROW UP... \nOf course, as Fraedom clients grow, they can always migrate to HRG’s full-service offering. Is that what chief executive David Radcliffe has in mind? Meyer is non-committal. “You’ll have to ask David,” he says, before adding: “If we win a customer, and that customer grows, then of course we would seek to work with HRG to fulfil the solution behind the scenes.” \nWhich is a safety net that Corporate Traveller’s Crompton doesn’t appear to have. Asked what she likes least about the SME market, she is unequivocal. “The bit that I don’t like,” she says, “is when they get bought out by global companies – it does happen, and you can’t continue the relationship.” \nDonna, there’s a little outfit called FCM, down New Malden way. You might want to have a word. \nSME by numbers: \nACCORDING TO THE UK GOVERNMENT’S DEPARTMENT FOR BUSINESS, INNOVATION AND SKILLS (DBIS), last year marked the first time that the nation’s ‘business population’ exceeded five million private sector businesses. • Non-employing businesses – sole traders – increased by more than 7 per cent. The number of new companies with employees grew by 66,000, or 5.5 per cent. • Of 5.2 million private sector businesses registered in 2014, 99.3 per cent were classified as ‘small’, and 99.9 per cent counted as SMEs – only 0.1 per cent of UK businesses are classified as ‘large’ companies. • Small businesses account for 48 per cent of UK private sector employment, and command 33 per cent of all private sector turnover. The DBIS calculates this at £1.2 trillion. • 31,000 medium-sized businesses employed 3.1 million people –and had an annual turnover of £480 billion. • Small- and medium-sized businesses employ 15.2 million people, 60 per cent of total UK private sector employment, and have a turnover of £1.6 trillion, 47 per cent of all private sector companies’ turnover. • Across the European Union, the European Commission reckons there are some 21.6 million SMEs – defined as having fewer than 250 employees or an annual turnover of less than €50 million – employing nearly 90 million people and accounting for 28 per cent of the EU’s GDP.", "external_links": [], "published": "2015-08-15T10:23:00.000+03:00", "crawled": "2015-08-15T12:18:03.469+03:00", "highlightTitle": ""}