{"organizations": [], "uuid": "9d7168ce7d4177ee6dbaf42c77a332749c8daa4e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03394/JMCu-3765830_Fresh_3394189k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-02.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/southernengland/11776390/Julia-Margaret-Camerons-Isle-of-Wight.html", "country": "US", "title": "Julia Margaret Cameron's Isle of Wight", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Julia Margaret Cameron's Isle of Wight - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T16:00:00.000+03:00", "replies_count": 1, "uuid": "c82dc219b00fb8bf0bf72c94e01c9862ed3ffffe"}, "author": "Sophie Campbell", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/southernengland/11776390/Julia-Margaret-Camerons-Isle-of-Wight.html#post-0", "ord_in_thread": 0, "title": "Julia Margaret Cameron's Isle of Wight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "On a sunny wall inside Dimbola Lodge, the Isle of Wight home of the 19th-century photographer Julia Margaret Cameron, hangs a photograph of a child. It was unmistakably a boy, despite long, wavy hair and wide-eyed gaze. He was a local fisherman’s son, Freddy Gould, aged five or so. He looked oddly familiar. “He’s one of the 'English Blossoms’,” said Dimbola’s collections coordinator Rachel Flynn with a smile. “You’ve just seen him on the staircase.” I had. I’d assumed he was one of a pair of sisters, entwined in a blur of marguerite daisies and blown roses. He was among the cast of local characters, including several other children and Cameron’s own maids, used as models for her theatrical, intriguing portraits, many of which are on permanent display in Dimbola’s galleries. This September, an exhibition of Cameron’s work will open at the Science Museum in London to celebrate the bicentenary of her birth. Drawn from the National Photography Collection, the exhibition features the Herschel Album, a sequence of 94 images compiled by Cameron as a gift for her friend and mentor, the scientist Sir John Herschel, which include portraits of influential friends, acquaintances and family members, including Alfred Tennyson and William Holman Hunt. Then in November, Cameron’s photographs will again reach a wider audience when 100 go on show at the Victoria & Albert Museum in London, partly to celebrate the bicentenary, but also to commemorate the 150th anniversary of the V&A’s only other exhibition of her work, organised largely by its dynamic director at the time (and Cameron’s friend), Henry Cole. • Where to stay in the Isle of Wight Until then, a visit to the museum and galleries at Dimbola, especially when seen on a summer’s day, with cows grazing in the fields and the dancing sea visible from its upstairs windows, makes the perfect preamble. When the great and the good of the yachting world converge on the Isle of Wight next week for the start of Cowes Week, Freshwater Bay, on the island’s unspoilt west coast, will remain a charmingly peaceful time warp. This is where Cameron and her much older husband moved in 1860, inspired by their friend Alfred, Lord Tennyson, who lived just down the road at Farringford. It was at Dimbola that Cameron’s daughter and son-in-law gave her a present of a camera, aware of her interest in the subject and her work with photographers of the day. • The best culture holidays in Europe She began to experiment in the winter of 1863, painstakingly and with much error, mixing chemicals on glass plates to produce images using a method called the wet plate collodion process. Her models, however juvenile, often sat for hours. The first image she liked is titled, charmingly, “Annie. My First Success”. None of Cameron’s cameras survives, but at Dimbola they have a couple of similar models: hulking varnished boxes with glass backs, leather bellows for focus and lenses set in brass, like telescopes. There are numerous prints and a cabinet of originals, regularly revolved from the collection. One has neat black ink at the bottom: “From life, registered photographer,” then “Copyright” with Cameron’s signature. “Oh, she kept tabs on things from quite early on,” said Rachel. “She was aware of the value of her work.” This makes Cameron even more fascinating: not only was her photography unconventional, but she was entirely confident in her own abilities as an artist. Dimbola itself is also significant. Cameron was Indian-born, well connected in the colonies and in England. The house, two cottages joined by a central tower, was made for entertaining. The coal store doubled as a dark room and a chicken house as her studio or “glass house”. Friends such as Tennyson, G  F Watts, Alice Liddell and Ellen Terry modelled for her, just like Freddy and co. • Enter Telegraph Travel's photography competition Most of her work was portraiture. She left no images of the house, refused to photograph “carriage people” and rarely captured landscapes, though she may have photographed Shanklin Chine, a gorge on the far side of the island, bursting with foliage and a tourist attraction from the 18th century until today. She had a friend living by the Chine and a copy of the image is on show there. Back in the gallery, Jane Tugwell from Market Harborough has come to see the house, leaving her family at the seaside. “I saw some of her prints for sale in a newspaper about 40 years ago,” she explained. “I was only about 18 and I was fascinated by them. I’ve still got a couple. This has been really quite emotional.” Today, the building is much loved, if slightly shabby, surviving on income from visitors, its café and a busy events programme. It’s on the unspoilt West Wight coast, with fine walks along the cliffs and up Tennyson Down just nearby. You could even take a camera. Dimbola Museum & Galleries (01983 756814; dimbola.co.uk ), run by the Julia Margaret Cameron Trust, opens daily 10am to 5pm April to September (winter 10am to 4pm, check website for days). Gift Aid £5 adults, £4.50 concessions, £2 under-18s and £12 families. Under-5s free.  Shanklin Chine (01983 866432; shanklinchine.co.uk ) opens daily 10am to 4pm April to November and until 10pm May to September, with illuminations. Julia Margaret Cameron: Influence and Intimacy is at the Science Museum from September 24 to March 28 2016 (0870 870 4868; museum.org.uk ). Julia Margaret Cameron at the Victoria & Albert Museum (020 7942 2000; vam.ac.uk ) runs from November 28 to February 21 2016. Admission to both is free. Sophie Campbell travelled from Portsmouth to Ryde with Hovertravel (08434 878887; hovertravel.co.uk ); a day return costs £18.50. For more information on the Isle of Wight, see visitisleofwight.co.uk and telegraph.co.uk/isleofwighthotels . Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-08-02T16:00:00.000+03:00", "crawled": "2015-08-02T12:55:30.969+03:00", "highlightTitle": ""}