{"organizations": [], "uuid": "179aa6f8eec0c670c1e13f7151931a02de2e9961", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/05/49/fd/19d7d45616354ae885553697048ed4cb-4ffd9058998c40e5982ff5de53688c0b-0.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/international/experts-start-examining-wing-piece-that-may-be-fro/nnDGC/", "country": "US", "title": "Differing messages on 777 part frustrate Flight 370 families", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Differing messages on 777 part frustrate Flight 370 families | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T11:56:00.000+03:00", "replies_count": 0, "uuid": "179aa6f8eec0c670c1e13f7151931a02de2e9961"}, "author": "EILEEN NG", "url": "http://www.ajc.com/ap/ap/international/experts-start-examining-wing-piece-that-may-be-fro/nnDGC/", "ord_in_thread": 0, "title": "Differing messages on 777 part frustrate Flight 370 families", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Malaysian government was certain: The airplane part found on an Indian Ocean island came from Malaysia Airlines Flight 370. Investigators in France weren't so sure quite yet.\nAnd those differing approaches created confusion and anguish Thursday for the families of those aboard the ill-fated flight.\n\"From our first observation, the color tone and all maintenance records that we have, we know,\" Malaysian Transport Minister Liow Tiong Lai said. \"Our records show that it's the same as MH370.\"\nMalaysia's Department of Civil Aviation Director General Azharuddin Abdul Rahman, second left, arrives at the Direction Generale de l'Armement (DGA) facilities in Balma, near Toulouse, south-western France, Wednesday, Aug. 5, 2015 to start to examine an airplane wing fragment that many people believe could offer the first tangible clue into the fate of the missing Malaysia Airlines Flight 370. Malaysia Airlines Flight 370 vanished in March 2014 while flying from Kuala Lumpur to Beijing with 239 people aboard. (AP Photo/Bob Edme) He added that there are \"many other technical details that I do not have to reveal\" that confirm the part is from Flight 370.\nMalaysian Prime Minister Najib Razak announced early Thursday that the piece of debris, known as a flaperon, came from the doomed aircraft, but authorities in France, the U.S. and Australia have stopped short of full confirmation.\nThe dissonant comments infuriated many relatives of the 239 people on board the plane, who have waited more than 500 days for concrete clues into the fate of their loved ones. Dai Shuqin, the sister of a passenger, was among about a dozen Chinese relatives who held a demonstration outside Malaysia Airlines' offices in Beijing.\nMalaysia's Department of Civil Aviation Director General Azharuddin Abdul Rahman, arrives at the Direction Generale de l'Armement (DGA) facilities in Balma, near Toulouse, south-western France, Wednesday, Aug. 5, 2015 to start to examine an airplane wing fragment that many people believe could offer the first tangible clue into the fate of the missing Malaysia Airlines Flight 370. Malaysia Airlines Flight 370 vanished in March 2014 while flying from Kuala Lumpur to Beijing with 239 people aboard. (AP Photo/Bob Edme) \"France is being cautious about it, but Malaysia is desperate to put an end to this case and run away from all responsibilities,\" she said.\nLiow said differences with other countries amounted to \"a choice of words.\"\nHe also said more debris has been found on Reunion Island and was sent to local authorities for French investigators to examine. However, the Paris prosecutor's office, which is spearheading a French legal inquiry into the crash, denied that investigators had any new debris, and multiple French officials involved in the investigation in Reunion and in Paris said they also were unaware of a new discovery.\nJacquita Gomes, 53, holds a portrait of her husband, Patrick Gomes, 56, the in-flight supervisor on the ill fated flight MH370, in their home outside Kuala Lumpur, Malaysia on Wednesday, Aug. 5, 2015. (AP Photo/Joshua Paul) The officials requested anonymity, because they did not want to appear critical of the Malaysian investigation, but those contradictory statements about new debris threw more confusion over an investigation that has often seemed inconsistent, to the dismay of families of those lost.\nLiow said a Malaysian team found the objects, including a window and some aluminum foil, but an aide to the minister later said it was \"window material\" rather than a window that was recovered.\n\"I can only ascertain that it's plane debris,\" Liow said. \"I cannot confirm that it's from MH370.\"\nMalaysian Prime Minister Najib Razak, center, speaks at a special press conference announcing the findings for the ill fated flight MH370 in Kuala Lumpur, Malaysia on Thursday, Aug. 6, 2015. (AP Photo/Vincent Thian) France said it is deploying a search plane, helicopters and boats around Reunion in hopes of spotting more debris that might be from Flight 370.\nIn an announcement late Thursday, the government said it understands the pain of families who lost loved ones, \"for whom this discovery has awakened the hope of shedding light on the circumstances of the disappearance of flight MH370.\"\nFrench officials have said no other airplane debris has been found.\nMalaysian Prime Minister Najib Razak, center, speaks at a special press conference announcing the findings for the ill fated flight MH370 in Kuala Lumpur, Malaysia on Thursday, Aug. 6, 2015. (AP Photo/Vincent Thian) The disappearance of the Boeing 777 jetliner while on a flight from Kuala Lumpur to Beijing on March 8, 2014, has been one of the biggest mysteries in aviation history. Officials believe it crashed in the southern Indian Ocean, killing all aboard, but the wreckage and the cause remain elusive.\n\"It is with a very heavy heart that I must tell you that an international team of experts has conclusively confirmed that the aircraft debris found on Reunion Island is indeed MH370,\" Najib told reporters.\nBut at a news conference in Paris, Deputy Prosecutor Serge Mackowiak said only that \"the very strong conjectures are to be confirmed by complementary analysis that will begin tomorrow morning.\"\nThe children of Patrick Gomes, in flight supervisor of missing Malaysia Airlines Flight 370: Davina Gomes, 27, left; Nicolette Gomes, 30, right; and Michelle Gomes, 24, bottom; pose for a photo showing the tattooed initials of their parents' names at their parents' home outside Kuala Lumpur, Malaysia on Wednesday, Aug. 5, 2015. The tattoo, which they had done to commemorate their parents' anniversary in June 2014, are the initials of their parent's first name, Patrick and Jacquita. Malaysia's prime minister says experts in France have determined that a barnacle-encrusted airplane wing fragment came from Malaysia Airlines Flight 370, which disappeared more than a year ago with 239 people aboard. (AP Photo/Joshua Paul) The Australian government, which leads the seabed search for wreckage west of Australia, was also less certain than Malaysia, saying only that \"based on high probability, it is MH370.\"\nHowever, Australian Transport Minister Warren Truss said Australia respected Malaysia's right to make that call, given that it is in charge of the investigation.\n\"Of course, there is still some I's not dotted and T's not crossed. There is still a very small element of doubt,\" Truss said.\nNicolette Gomes, daughter of Patrick Gomes, in flight supervisor of Malaysia Airlines Flight 370, poses for a portrait with her painting of the ill fated plane in Gomes's house outside Kuala Lumpur, Malaysia, as families waited for news on Wednesday, Aug. 5, 2015. French and Malaysian experts on Wednesday began examining an airplane wing fragment that could offer the first tangible clue about the fate of Malaysia Airlines Flight 370, which vanished more than a year ago with 239 people aboard. (AP Photo/Joshua Paul) Many Flight 370 families said they were fed up with the mixed messages.\n\"Why the hell do you have one confirm and one not?\" said Sara Weeks, the sister of New Zealander Paul Weeks, who was on board. \"Why not wait and get everybody on the same page so the families don't need to go through this turmoil?\"\nA U.S. official familiar with the investigation said the flaperon clearly is from a Boeing 777. However, a team of experts in France examining the part hadn't yet found anything linking it specifically to the missing plane, the official said, speaking on condition of anonymity because there was no authorization to talk publicly about the case.\nMalaysian Prime Minister Najib Razak, center, gestures before speaking at a special press conference announcing the findings for the ill fated flight MH370 in Kuala Lumpur, Malaysia, early Thursday, Aug. 6, 2015. Experts have confirmed that the debris found on Reunion Island last week was that of Malaysian Airlines flight 370 that went missing last year, Malaysia's prime minister said early Thursday. (AP Photo/Vincent Thian) No other 777s or flaperons are known to be missing, but the U.S. and Boeing team members are trying \"to be precise,\" the official said.\nAustralia, which sent an official to France to help examine the flaperon, has said the find will not affect its sonar search of a 120,000-square-kilometer (46,000-square- mile) expanse of seabed more than 4,000 kilometers (2,500 miles) east of Reunion Island.\nThat search, which began in October, has covered almost half that area without finding any clues.\nMalaysian Prime Minister Najib Razak, gestures before speaking at a special press conference announcing the findings for the ill fated flight MH370 in Kuala Lumpur, Malaysia, early Thursday, Aug. 6, 2015. Experts have confirmed that the debris found on Reunion Island last week was that of Malaysian Airlines flight 370 that went missing last year, Malaysia's prime minister said early Thursday. (AP Photo/Vincent Thian) Australian Prime Minister Tony Abbott told Melbourne Radio 3AW that the apparent discovery of Flight 370 wreckage \"does seem very consistent with the search pattern that we've been using for the last few months.\"\n\"Let's hope we can turn something up,\" he said.\nIt is not known why Flight 370 — less than an hour into its journey — turned back from its original flight path and headed in an opposite direction before turning again and flying south over the Indian Ocean for hours.\nFamily members of the missing on Malaysia Airlines Flight 370, Jacquita Gomes, wife of Patrick Gomes, in flight supervisor, and Melanie Antonio, wife of Andrew Nari, chief steward, check a mobile phone in Gomes's house outside Kuala Lumpur, Malaysia, as they wait for further news on Wednesday, Aug. 5, 2015. French and Malaysian experts on Wednesday began examining an airplane wing fragment that could offer the first tangible clue about the fate of Malaysia Airlines Flight 370, which vanished more than a year ago with 239 people aboard. (AP Photo/Joshua Paul) A six-week air and sea search covering 4.6 million square kilometers (1.8 million square miles) of the southern Indian Ocean surface last year failed to find any trace of the jetliner. The Reunion Island debris would support the working theory that the jet went down in the Indian Ocean and the debris was carried west by the current.\nMalaysian officials have said the plane's movements were consistent with deliberate actions by someone on the plane, suggesting someone in the cockpit intentionally flew the aircraft off course.\n___\nFamily members of the missing on Malaysia Airlines Flight 370, from left to right: Lee Khim Fatt, husband of Foong Wai Yueng, flight attendant; Choi Loong Chow, husband of Goh Sock Lay, chief stewardess; Jacquita Gomes, wife of Patrick Gomes, in flight supervisor; and Melanie Antonio, wife to Andrew Nari, chief steward; and Nicolette Gomes, daughter of Patrick Gomes, check their mobile devices in Gomes's house outside Kuala Lumpur, Malaysia, as they wait for further news on Wednesday, Aug. 5, 2015. French and Malaysian experts on Wednesday began examining an airplane wing fragment that could offer the first tangible clue about the fate of Malaysia Airlines Flight 370, which vanished more than a year ago with 239 people aboard. (AP Photo/Joshua Paul) Associated Press writers Kristen Gelineau in Sydney, Paul Joshua in Kuala Lumpur, Lori Hinnant in Paris, Joan Lowy in Washington, Rod McGuirk in Canberra, Australia, Nick Perry in Wellington, New Zealand, and Isolda Morillo and Aritz Parra in Beijing contributed to this report.\nFamily members of the missing on Malaysia Airlines Flight 370, from left to right: Lee Khim Fatt, husband of Foong Wai Yueng, flight attendant; Choi Loong Chow, husband of Goh Sock Lay, chief stewardess; Jacquita Gomes, wife of Patrick Gomes, in flight supervisor; and Melanie Antonio, wife to Andrew Nari, chief steward; check their mobile devices in Gomes's house outside Kuala Lumpur, Malaysia, as they wait for further news on Wednesday, Aug. 5, 2015. French and Malaysian experts on Wednesday began examining an airplane wing fragment that could offer the first tangible clue about the fate of Malaysia Airlines Flight 370, which vanished more than a year ago with 239 people aboard. (AP Photo/Joshua Paul) Malaysian Prime Minister Najib Razak, center, arrives for a special press conference announcing the findings for the ill fated flight MH370 in Kuala Lumpur, Malaysia on Thursday, Aug. 6, 2015. Experts have confirmed that the debris found on Reunion Island last week was that of Malaysian Airlines flight 370 that went missing last year, Malaysia's prime minister said Wednesday. (AP Photo/Vincent Thian) Paris deputy Prosecutor Serge Mackowiak speaks during a press conference at the Court in Paris, France, Wednesday, Aug. 5, 2015. After the examination of an airplane wing fragment that many people believe could offer the first tangible clue into the fate of the missing Malaysia Airlines Flight 370, experts have confirmed that the debris found on Reunion Island last week was that of Malaysian Airlines flight 370 that went missing last year. (AP Photo/Kamil Zihnioglu) Malaysian Prime Minister Najib Razak, speaks at a special press conference announcing the findings for the ill fated flight MH370 in Kuala Lumpur, Malaysia, early Thursday, Aug. 6, 2015. Experts have confirmed that the debris found on Reunion Island last week was that of Malaysian Airlines flight 370 that went missing last year, Malaysia's prime minister said early Thursday. (AP Photo/Vincent Thian) Malaysian Prime Minister Najib Razak, center, speaks at a special press conference announcing the findings for the ill fated flight MH370 in Kuala Lumpur, Malaysia, early Thursday, Aug. 6, 2015. Experts have confirmed that the debris found on Reunion Island last week was that of Malaysian Airlines flight 370 that went missing last year, Malaysia's prime minister said early Thursday. (AP Photo/Vincent Thian) Graphic shows location of island of Reunion.; 1c x 3 inches; 46.5 mm x 76 mm; FILE - In this July 29, 2015 file photo, French police officers inspect a piece of debris from a plane in Saint-Andre, Reunion Island. Confirmation that a wing flap found on an island in the western Indian Ocean is part of Malaysia Airlines Flight 370 would add a critical piece to the puzzle of the Boeing 777’s disappearance 17 months ago. Malaysian Prime Minister Najib Razak delivered that confirmation Thursday, Aug. 6, 2015 though French, U.S. and Australian investigators stopped just short of that, saying the part is from a 777 and acknowledging that Flight 370 is the only 777 missing. Examination of the part is continuing. (AP Photo/Lucas Marie, File) A family member of a passenger aboard Malaysia Airlines Flight 370 rests his head in his hands as he protests with other family members outside the company's offices in Beijing, Thursday, Aug. 6, 2015. About a dozen Chinese relatives of passengers protested outside the Malaysia Airlines offices in Beijing on Thursday. Families aching for closure after their relatives disappeared aboard Malaysia Airlines Flight 370 last year vented their deep frustration Thursday at conflicting signals from Malaysia and France over whether the finding of a plane part had been confirmed. (AP Photo/Mark Schiefelbein) A family member of a passenger aboard Malaysia Airlines Flight 370 demonstrates outside the company's offices in Beijing, Thursday, Aug. 6, 2015. Families aching for closure after their relatives disappeared aboard Malaysia Airlines Flight 370 last year vented deep frustration Thursday at conflicting signals from Malaysia and France over whether the finding of a plane part had been confirmed. (AP Photo/Mark Schiefelbein) Zhang, no first name given, whose daughter was aboard Malaysia Airlines Flight 370, is watched by Chinese policemen as he talks on a cellphone while wearing a sign that says \"Chairman Xi can help us, the country can help us! The families will certainly have good news!\" as he stands outside the company's offices in Beijing, Thursday, Aug. 6, 2015. About a dozen Chinese relatives of passengers protested outside the Malaysia Airlines offices in Beijing on Thursday. Families aching for closure after their relatives disappeared aboard Malaysia Airlines Flight 370 last year vented their deep frustration Thursday at conflicting signals from Malaysia and France over whether the finding of a plane part had been confirmed. (AP Photo/Mark Schiefelbein) Family members of passengers aboard the missing Malaysia Airlines Flight 370 hold signs as they protest outside the company's offices in Beijing, Thursday, Aug. 6, 2015. About a dozen Chinese relatives of passengers protested outside the Malaysia Airlines offices in Beijing on Thursday. Families aching for closure after their relatives disappeared aboard the aircraft last year vented their deep frustration Thursday at conflicting signals from Malaysia and France over whether the finding of a plane part had been confirmed. (AP Photo/Mark Schiefelbein) Chinese police officers keep journalists away as family members of passengers aboard the missing Malaysia Airlines Flight 370 try to gain access to the company's offices in Beijing, Thursday, Aug. 6, 2015. About a dozen Chinese relatives of passengers protested outside the Malaysia Airlines offices in Beijing on Thursday. Families aching for closure after their relatives disappeared aboard the aircraft last year vented their deep frustration Thursday at conflicting signals from Malaysia and France over whether the finding of a plane part had been confirmed. (AP Photo/Mark Schiefelbein) Zhang Meiling, second from right, whose daughter and son-in-law were passengers on Malaysia Airlines Flight 370, gestures while speaking to journalists outside of the company's offices in Beijing, Thursday, Aug. 6, 2015. About a dozen Chinese relatives of passengers protested outside the Malaysia Airlines offices in Beijing on Thursday. Families aching for closure after their relatives disappeared aboard Malaysia Airlines Flight 370 last year vented deep frustration Thursday at conflicting signals from Malaysia and France over whether the finding of a plane part had been confirmed. (AP Photo/Mark Schiefelbein) Family members of passengers aboard the missing Malaysia Airlines Flight 370 hold signs as they protest outside the company's offices in Beijing, Thursday, Aug. 6, 2015. About a dozen Chinese relatives of passengers protested outside the Malaysia Airlines offices in Beijing on Thursday. Families aching for closure after their relatives disappeared aboard the aircraft last year vented their deep frustration Thursday at conflicting signals from Malaysia and France over whether the finding of a plane part had been confirmed. (AP Photo/Mark Schiefelbein) Malaysian Transport Minister Liow Tong Lai speaks during a press conference on the missing Malaysia Airlines Flight MH370 in Putrajaya, Malaysia Thursday, Aug. 6, 2015. Malaysia's transport minister says a Malaysian team at the French territory of Reunion Island has collected other plane debris including a window and some aluminum foil. But Liow says he cannot confirm they belong to Flight 370, which went missing on March 8, 2014 with 239 people on board. \"I can only ascertain that it's plane debris.\" (AP Photo) Malaysian Transport Minister Liow Tong Lai speaks during a press conference on the missing Malaysia Airlines Flight MH370 in Putrajaya, Malaysia Thursday, Aug. 6, 2015. Malaysia's transport minister says a Malaysian team at the French territory of Reunion Island has collected other plane debris including a window and some aluminum foil. But Liow says he cannot confirm they belong to Flight 370, which went missing on March 8, 2014 with 239 people on board. \"I can only ascertain that it's plane debris.\" (AP Photo) Bao Lanfang, second from right, whose daughter-in-law, son, and granddaughter were aboard Malaysia Airlines Flight 370, kneels in grief while speaking to journalists outside the company's offices in Beijing, Thursday, Aug. 6, 2015. About a dozen Chinese relatives of passengers of flight MH370 protested outside the Malaysia Airlines offices in Beijing on Thursday. (AP Photo/Mark Schiefelbein) In this image provided by the University of Western Australia on July 31, 2015, depicts how computer modeling was used in mid-2014 to show how debris from Malaysia Airlines Flight 370 might have drifted over time. Scientists at the University of Western Australia say the discovery of the wing fragment on Reunion Island fits in with their predictions. A piece of a wing found washed up on Reunion Island last week is from Malaysia Airlines Flight 370 that vanished last year, Malaysia's prime minister announced Thursday, Aug. 6, 2015, saying he hoped the news ends the \"unspeakable\" uncertainty of the passengers' families. (University of Western Australia via AP) Zhang Yongli, whose daughter was aboard Malaysia Airlines Flight 370 that went missing on March 8, 2014, stands with a picture of China's President Xi Jinping outside of the Malaysia Airlines office in Beijing, Thursday, Aug. 6, 2015. About a dozen Chinese relatives of passengers protested outside the Malaysia Airlines offices in Beijing on Thursday. (AP Photo/Andy Wong) People walk on the beach of Saint-Andre, Reunion Island, in the hope of finding more plane debris, Thursday, Aug 6, 2015. Malaysian Prime Minister Najib Razak announced on Aug. 6 the washed-up debris was part of the wreckage of the missing Malaysian Airlines flight MH370. (AP Photo/Fabrice Wislez) The beach of Saint-Andre, Reunion Island, Thursday, Aug 6, 2015. Malaysian Prime Minister Najib Razak announced on Aug. 6 the washed-up debris was part of the wreckage of the missing Malaysian Airlines flight MH370. (AP Photo/Fabrice Wislez) An unidentified man walks on the beach of Saint-Andre, Reunion Island, in the hope of finding more plane debris, Thursday, Aug 6, 2015. Malaysian Prime Minister Najib Razak announced on Aug. 6 the washed-up debris was part of the wreckage of the missing Malaysian Airlines flight MH370. (AP Photo/Fabrice Wislez) Workers for an association responsible for maintaining paths to Jamaica Beach from being overgrown by shrubs, search the beach for possible additional airplane debris near the shore where an airplane wing part was washed up, on the beach of Saint-Andre, Reunion Island, Thursday, Aug 6, 2015. Malaysian Prime Minister Najib Razak announced on Aug. 6 the washed-up debris was part of the wreckage of the missing Malaysian Airlines flight MH370. (AP Photo/Fabrice Wislez)", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/c9/6e/19d7d45616354ae885553697048ed4cb-1de3413d516248d9897cf48a6bad5927-11.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/c6/7c/19d7d45616354ae885553697048ed4cb-a5f532a2d97d4e5a9810755a04f47fdf-1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/59/b1/19d7d45616354ae885553697048ed4cb-4ffd9058998c40e5982ff5de53688c0b-2.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/15/e1/19d7d45616354ae885553697048ed4cb-a5f532a2d97d4e5a9810755a04f47fdf-5.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/28/f8/19d7d45616354ae885553697048ed4cb-f328f7e4bc5e44eea6fb50134bdd5ab8-1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/80/91/19d7d45616354ae885553697048ed4cb-09b2eb7df53c4c17933a0c3f3f7e7b8d-12.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/7d/ae/19d7d45616354ae885553697048ed4cb-eee0f911b7f448839145fe4b203262f4-3.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/f4/e8/19d7d45616354ae885553697048ed4cb-53617deb4cf24c138806d7c22ccfa670-7.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/7c/fa/19d7d45616354ae885553697048ed4cb-9c9bbb96df564bbdbf07cd0b3d96d3d2-1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/96/b0/19d7d45616354ae885553697048ed4cb-53617deb4cf24c138806d7c22ccfa670-6.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/5d/ff/19d7d45616354ae885553697048ed4cb-52520118edae4f2bad82aafbefb1d115-2.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/d0/68/19d7d45616354ae885553697048ed4cb-53617deb4cf24c138806d7c22ccfa670-3.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/27/b9/19d7d45616354ae885553697048ed4cb-4ffd9058998c40e5982ff5de53688c0b-1_1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/d4/ac/19d7d45616354ae885553697048ed4cb-a5f532a2d97d4e5a9810755a04f47fdf-6.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/54/1e/19d7d45616354ae885553697048ed4cb-9c9bbb96df564bbdbf07cd0b3d96d3d2-13.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/bb/48/19d7d45616354ae885553697048ed4cb-1de3413d516248d9897cf48a6bad5927-3.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/ba/04/19d7d45616354ae885553697048ed4cb-eee0f911b7f448839145fe4b203262f4-1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/e7/f8/19d7d45616354ae885553697048ed4cb-1de3413d516248d9897cf48a6bad5927-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/c6/3c/19d7d45616354ae885553697048ed4cb-5d66fe66ee964eb3b8290d7b7911efbe-7.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/34/ca/19d7d45616354ae885553697048ed4cb-eee0f911b7f448839145fe4b203262f4-0_1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/d7/00/19d7d45616354ae885553697048ed4cb-53617deb4cf24c138806d7c22ccfa670-4.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/d5/63/19d7d45616354ae885553697048ed4cb-a5f532a2d97d4e5a9810755a04f47fdf-0.jpg", "http://media.cmgdigital.com/shared/img/photos/2015/08/05/d5/90/19d7d45616354ae885553697048ed4cb-1de3413d516248d9897cf48a6bad5927-13.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/52/99/19d7d45616354ae885553697048ed4cb-52520118edae4f2bad82aafbefb1d115-16.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/84/b7/19d7d45616354ae885553697048ed4cb-52520118edae4f2bad82aafbefb1d115-3.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/f4/6d/19d7d45616354ae885553697048ed4cb-53617deb4cf24c138806d7c22ccfa670-9.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/15/35/19d7d45616354ae885553697048ed4cb-53617deb4cf24c138806d7c22ccfa670-8.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/49/fd/19d7d45616354ae885553697048ed4cb-4ffd9058998c40e5982ff5de53688c0b-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/12/47/19d7d45616354ae885553697048ed4cb-1de3413d516248d9897cf48a6bad5927-12.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/64/bb/19d7d45616354ae885553697048ed4cb-52520118edae4f2bad82aafbefb1d115-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/8f/00/19d7d45616354ae885553697048ed4cb-eee0f911b7f448839145fe4b203262f4-5.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/2c/c2/19d7d45616354ae885553697048ed4cb-5d66fe66ee964eb3b8290d7b7911efbe-8.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/05/da/1f/19d7d45616354ae885553697048ed4cb-eee0f911b7f448839145fe4b203262f4-4.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/06/d7/17/19d7d45616354ae885553697048ed4cb-53617deb4cf24c138806d7c22ccfa670-0.jpg"], "published": "2015-08-06T11:56:00.000+03:00", "crawled": "2015-08-06T23:34:01.780+03:00", "highlightTitle": ""}