{"organizations": ["Aberdeen"], "uuid": "28df014e197f97e4ddd5b362b748848c5e56c3cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gofrance.about.com", "main_image": "http://f.tqn.com/y/gofrance/1/S/a/X/1st-class-new-TGV.jpg", "site_section": "http://z.about.com/6/g/gofrance/b/index.rdf", "section_title": "About France Travel", "url": "http://gofrance.about.com/od/trains/fl/How-to-get-from-London-the-UK-and-Paris-to-Dijon-by-train-car-and-flight.htm", "country": "US", "title": "How to get from London, the UK and Paris to Dijon by train, car, and flight", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "How to get from London, the UK and Paris to Dijon by train, car, and flight", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T19:29:00.000+03:00", "replies_count": 0, "uuid": "28df014e197f97e4ddd5b362b748848c5e56c3cf"}, "author": "", "url": "http://gofrance.about.com/od/trains/fl/How-to-get-from-London-the-UK-and-Paris-to-Dijon-by-train-car-and-flight.htm", "ord_in_thread": 0, "title": "How to get from London, the UK and Paris to Dijon by train, car, and flight", "locations": ["Airport", "Belfast", "Paris", "UK", "Glasgow", "Edinburgh", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There are flights from the UK to Dijon from London city Airport, Aberdeen, Belfast, Glasgow and Edinburgh. There are flights to Dijon from Paris and other major cities.Dijon Airport is around 7 kms (4.5 miles) from Dijon city center by road. Paris to Dijon by train \nTGV express trains direct to Dijon leave regularly from Paris Gare de Lyon (20 boulevard Diderot, Paris 12) all through the day taking from 1 hr 35 minutes. \nMetro lines to and from Gare de Lyon Ligne 1 – La Defence to Chateau de Vincennes Ligne 14 – Saint Lazare to Bibliotheque Francois Mitterand \nDijon Ville Station is on Av Foch, with connections into the center on tram B. Connections to Dijon-Ville Station \nTGV trains to Dijon-Ville train station Paris to Dijon in 1 hr 35 mins. Strasbourg to Dijon in 1 hr 50 mins. \nTER trains to Dijon-Ville train station Beaune in 25 mins Besancon to Dijon in 1 hour Bourg-en-Bresse in 1 hr 45 mins Châlon-sur-Seine in 40 mins Laroche-Migennes in 1 hr 30 mins Lyon in 2 hrs 10 mins Mâcon in 1 hr 10 mins Nevers in 2 hrs 20 mins Nuits St-George in 20 mins Reims in 3 hrs 20 mins Tonnerre in 1 1h Troyes in 2hrs 10 mins \nBooking Train Travel in France From the UK, book on Rail Europe From the UK book on voyages-sncf (formerly Rail Europe) Paris to Dijon by car \nThe distance from Paris to Dijon is around 312 km (193 miles) and the journey takes a bit over 3 hours depending on your speed. Getting from London to Paris By train (Eurostar) Eurostar between London, Paris and Lille By bus/coach Eurolines offers a cheap service from London, Gillingham, Canterbury, Folkestone and Dover to Paris Charles de Gaulle Airport and Paris Gallieni. Six coaches a day; 2 overnight; journey time is 7 hours. The Eurolines stop is at the Paris Gallieni Coach Station, 28 ave du General de Gaulle, just by the Gallieni metro station near the Porte de Bagnolet (Metro line 3, final stop).", "external_links": [], "published": "2015-08-27T19:29:00.000+03:00", "crawled": "2015-08-28T04:15:48.816+03:00", "highlightTitle": ""}