{"organizations": [], "uuid": "caa0715a0c621f6743e47ee88806e0f5f105b110", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww3.hdnux.com/photos/40/23/72/8470190/5/rawImage.jpg", "site_section": "http://www.seattlepi.com/lifestyle/travel/", "section_title": "Travel: Air, Land and Sea Guides and Resources - seattlepi.com", "url": "http://www.seattlepi.com/news/article/Hunting-for-Hemingway-in-Yellowstone-country-6446182.php", "country": "US", "title": "Hunting for Hemingway in Yellowstone country", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Hunting for Hemingway in Yellowstone country - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "caa0715a0c621f6743e47ee88806e0f5f105b110"}, "author": "GAIL SCHONTZLER", "url": "http://www.seattlepi.com/news/article/Hunting-for-Hemingway-in-Yellowstone-country-6446182.php", "ord_in_thread": 0, "title": "Hunting for Hemingway in Yellowstone country", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BOZEMAN, Mont. (AP) — Ernest Hemingway first arrived at the Clarks Fork River valley on July 13, 1931, bouncing along Yellowstone National Park's gravel roads in a Ford Model A roadster until he reached one of the wildest places in America.\nHemingway was 31, looking for a place to hunt, fish and write, looking to get away from Key West's heat and anyone who fawned over the best-selling author of \"The Sun Also Rises\" and \"A Farewell to Arms.\" He was seeking something wilder and more adventurous than the Sheridan area he'd visited in 1928 on his first trip to Wyoming.\nHe found what he was looking for near Cooke City, Montana, an old mining town at Yellowstone's northeast entrance. It was a rough and tumble place where bootleg whiskey - \"Red Lodge's finest product,\" he'd wryly call it - came in over the Beartooths by mule.\nTwelve miles from town down a sketchy dirt road, just across the border into Wyoming, Hemingway and his second wife, Pauline, drove over the Clarks Fork on a rickety plank bridge to the L Bar T Ranch .\n\"Hunting in the mts. is more damned fun than anything you can imagine,\" Hemingway wrote from the ranch to his buddy Henry \"Mike\" Strater on Sept. 10, 1930.\n\"I saw 12 mt. sheep a week ago. I can guaranty you shots at elk, deer, bear, and Big horn sheep - wonderful rainbow trout fishing - I caught 28 yest aft . all on fly. ... I wish the hell you'd come. This is the most beautiful country you ever saw.\"\nThe dude ranch owned by Lawrence and Olive Nordquist was a rustic paradise, framed by spectacular Pilot and Index peaks and the Absaroka Mountains. Ranch hands knew a lot about wilderness and little about famous writers.\n\"Am going damned well on my book,\" Hemingway wrote Strater. At the ranch over the decade, he would write parts of \" Death in the Afternoon,\" ''To Have and Have Not\" and \"For Whom the Bell Tolls.\"\nHere the future winner of the Pulitzer and Nobel prizes for literature would spend five late summers and early falls (in 1930, 1932, 1936, 1938 and 1939), until his marriage to Pauline collapsed as he pursued new adventures with Martha Gellhorn.\nYet compared to the writer's more famous haunts - Paris and Pamplona, Key West and Cuba - Hemingway's connection to Yellowstone country and the role it played in his life and writing are little known, even by many locals.\n\"You hear so many stories,\" said the clerk at the Silver Gate General Store. \"You don't know what's true.\"\n\"It is a bit of a mystery,\" agreed Patrick Hemingway , 87, sole survivor of the writer's three sons. After a career guiding big game safaris in Africa, Patrick settled years ago in Bozeman. For last month's reissue of \"Green Hills of Africa,\" Patrick wrote some personal memoirs. He also remembers the L Bar T Ranch well.\n\"Both my older brother Jack and I spent summers there,\" Patrick said. \"It was a nice time for a young boy. I learned to ride and also to shoot. I have fond memories of going on a pack trip. I guess I was around 7 or 8.\"\nHis dad and the others rode off to hunt grizzly bears - they would shoot an old horse as bait and wait for it to \"put out\" and start to smell. Young Patrick stayed in camp with Leland Stanford \"Chub\" Weaver, camp cook, guide and Patrick's godfather. The boy was having difficulty in school learning to read.\n\"He more or less got me reading,\" Patrick said.\nThe boy learned to bait fish with grasshoppers, catch cutthroats and ride a \"terrible\" horse named Pinkie, who dumped him on the ground.\nPatrick said perhaps his dad's Yellowstone connection was eclipsed by his later move to Sun Valley, Idaho. The L Bar T Ranch had no resort promoting itself, no movie stars posing with the writer for photographers.\n\"It is funny it isn't as well known,\" Patrick said. \"Actually he did spend more time big game hunting at Cooke City than he ever did at Sun Valley. He had trophies of mountain sheep, elk and bear.\n\"My dad loved big game hunting and most of the big game hunting he did was in Africa and around Cooke City.\"\nIs the ranch still there? Yes, Patrick said, though it's no longer a dude ranch, sold decades ago to two families that used to come out from Chicago.\nHe said his dad wrote a lot of \"For Whom the Bell Tolls\" at the ranch.\n\"I always say it is Hemingway's Western,\" Patrick said. \"All the things about how the snow makes tracking easy, that was . all knowledge he picked up at Cooke City.\"\nCRAZY CREEK\nWe hiked up Crazy Creek Cascade to eat bread and cheese on the granite boulders and cast a few flies in a tributary of the Clarks Fork.\nHunting for traces of Hemingway, husband Keith and I had driven from Bozeman into Yellowstone Park, past herds of bison and antelope, past lupine, arnica and fireweed, on the same route the writer traveled 85 years before.\nWe stopped at the historic Cooke City General Store, where Hemingway posted letters to his New York editor Max Perkins , and drove 12 miles beyond on the Beartooth Highway. The highway opened in 1936, prompting Hemingway to complain it brought in more people and ruined the fishing.\nKeith had tied three of Hemingway's favorite flies - a bee-imitation McGinty, a Coch-y-bondhu and a Woodcock and Green. He caught 10 small but eager rainbows on a dry fly version of the Coch-y-bondu, one every few casts.\nPilot and Index peaks still dominate the valley, the rushing Clarks Fork River still glints in the sun. But landowners have plastered the area around Crazy Creek Campground with \"Keep Out\" and \"Criminal Trespassing\" signs, even where the topo map shows the public owns the land. Unlike in Montana, the streambed is not public. Welcome to modern-day Wyoming.\nThe private road to the Nordquist Ranch - owned, according to tax records, by heirs to a founder of Quaker Oats - is gated and locked.\nSo we bushwhacked over a sagebrush hillside on public land to get just a glimpse of the L Bar T. It was a bit of a eureka moment for me, tempered by the stunning beauty of the peaks, forests and river.\nWe could see that the owners have kept the chink-log cabins and the ranch looking pristine.\nHere, Hemingway stayed with his wife and sons in a two-bedroom cabin, nearest the river, with a cold shower. As biographer Michael Reynolds recounted in \"Hemingway in the 1930s,\" his routine was early breakfast, writing all morning, fishing after lunch, supper in the lodge with the Nordquists and ranch guests, \"and whiskey afterward in the heavy chairs around the fireplace.\"\nHere, Hemingway rode out one day to Crandall Creek to hunt bears, got thrown by his horse and suffered a deep cut in his chin. He had to drive 50 miles on terrible roads to Cody, where Dr. Trueblood, a former veterinarian, stitched up his face.\nHere, Hemingway once rode up to a high mountain lake and threw into the water the Smith and Wesson Civil War pistol his father had used to kill himself. Tom Weaver , Chub's son, recounted his dad's story in the 1999 KUSM documentary \"Paradise and Purgatory: Hemingway at the L Bar T and St. V's.\" Hemingway retold the pistol story in \"For Whom the Bell Tolls,\" through the voice of his hero Robert Jordan , a fictional Spanish professor from Red Lodge, Montana.\nHere in the summer of 1932, Hemingway wrote by hand a 24-page manuscript for a short story, \"The Light of the World,\" which would sell at Christie's New York auction house in 2000 for $127,000.\nAnd it was from here that Hemingway started driving in November 1930, heading back to Billings with writer John Dos Passos , camping on the way at Mammoth before crashing and overturning the Ford near Laurel. Bright lights of an oncoming car were blamed, though it was said later that bourbon was involved.\nHemingway fractured his right arm, his writing arm, so badly that he spent seven painful weeks at St. Vincent's Hospital recovering from surgery. Dr. Louis Allard famously used kangaroo tendon to bind the bone together. That Billings experience would inspire the short story, \"The Gambler, the Nun and the Radio.\"\nIn 1939, Hemingway wrote a short reminiscence, \"The Clark's Fork Valley, Wyoming,\" which appeared in Vogue magazine. He recalled scrambling on rockslides of Pilot Peak to hunt sheep, seeing grizzlies crash in the forest, hearing elk bugling and the elk he \"refused to shoot, and you were pleased about every one of them.\" He ended the piece simply: \"It's a good country.\"\n'A MAN OF THE WORLD'\nChris Warren has made following Hemingway's trail something of a quest.\nLiving in Cooke City for 22 years, Warren met his wife and raised his kids there, owned a coffee shop and tended bar. He had a lot of time in the long winters to read.\nWarren stumbled into the discovery that Hemingway's adventures in the West all seemed to have happened within 20 miles of Cooke City.\n\"This is a huge and really neglected part of his biography, and it had pretty profound influence on his work,\" Warren said.\nPassionate about the subject, Warren is writing a book on Hemingway in Yellowstone. He said he'd started out skeptical of the writer with the macho, womanizing reputation, but reading Hemingway's writings won him over.\nLast summer Warren launched Hemingway's Yellowstone guided tours, which he had hoped to expand this summer, until a family medical emergency required moving to Portland, Oregon. He's uncertain whether the tours will resume next summer.\nIn Silver Gate, we stopped at the pine-log Range Riders Lodge, built in 1937 right after the Beartooth Highway opened, one of the places where Hemingway used to sit at the bar, Warren said. It was empty of guests the morning we arrived, but manager Maddie Young let us look around the small Hemingway exhibit that Warren had created in the southwest corner room.\nHere was Hemingway on the 1952 cover of Life magazine, a vintage Royal typewriter, and lots of images of Hemingway: smiling with young Patrick atop a dead bear, showing off his catch of trout, wearing a heavy beard and chaps on a cabin porch at the L Bar T, grinning with friends.\n\"This wasn't just a place he went to write,\" Warren said. \"It was a big part of his life, his family life.\"\nWarren said Hemingway should be judged by his writing, not by the caricature he has become in Woody Allen movies or the cartoon-like \"most interesting man in the world\" of TV commercials.\nOne of Hemingway's last short stories, \"A Man of the World,\" takes place in Cooke City, renamed Jessup in the piece. The action takes place in two bars, The Pilot and The Index.\nIt's a story about Blindy, whose eyes were gouged out by Willie in a fight so vicious that Willie's face is disfigured in some horrible way, left to the reader's imagination. Willie is a recluse, but Blindy still goes out to bars and tries to bum drinks and have fun. Blindy says Willie will never be \"a man of the world.\"\nIt seemed to me a gruesome story, a picture of how lawless Cooke City was in the 1930s. Warren saw something deeper, an allegory, with a theme akin to that of \"The Old Man and the Sea.\"\nLife is going to leave you wounded and broken. Yet it's not the injuries that define you, it's how you deal with them, Warren said. That's not macho, he said, but insight from \"a deeply sensitive place.\"\nErnest Hemingway was a man of the world.\n\"He had a very full life,\" son Patrick said. \"I think he was very much aware that it was a fantastic experience to be alive and to go through a life.\n\"Always, one thing he always said, was, 'Your one and only life.'\"\n___\nInformation from: Bozeman Daily Chronicle, http://www.bozemandailychronicle.com", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-08-15T03:00:00.000+03:00", "crawled": "2015-08-16T07:22:58.563+03:00", "highlightTitle": ""}