{"organizations": [], "uuid": "7db6d452275e9be4dd5b5dedd7c9cb68ce8a0381", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/g/0/e/d/image.related.StuffLandscapeSixteenByNine.620x349.16g05b.png/1440025545395.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/usa/71290559/Vans-and-taxis-are-the-latest-lodging-option-for-budget-travellers-in-New-York", "country": "AU", "title": "Vans and taxis are the latest lodging option for budget travellers in New York", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Vans and taxis are the latest lodging option for budget travellers in New York", "spam_score": 0.0, "site_type": "news", "published": "2015-08-20T01:53:00.000+03:00", "replies_count": 0, "uuid": "7db6d452275e9be4dd5b5dedd7c9cb68ce8a0381"}, "author": "Verena Dobnik", "url": "http://www.stuff.co.nz/travel/destinations/usa/71290559/Vans-and-taxis-are-the-latest-lodging-option-for-budget-travellers-in-New-York", "ord_in_thread": 0, "title": "Vans and taxis are the latest lodging option for budget travellers in New York", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vans and taxis are the latest lodging option for budget travellers in New York VERENA DOBNIK Last updated 10:53, August 20 2015 Airbnb \nBooking a parked van for the night provides an option for adventurous, budget-minded visitors to NYC. \nThere's no electricity, no running water, no bathroom. \nBut travellers to New York City bold enough to book a parked van for about US$22 (NZ$33) a night through Airbnb do get a real bed and a spectacular view of the Manhattan skyline from across the East River in Queens. \n\"If you want a New York adventure, this is it. Great location, great view,\" says Rapha Schaele, a 23-year-old student from Freiburg, Germany, who recently stayed in the van with two friends for four days. \nWhile parked vehicles make up a tiny fraction of the thousands of Airbnb private accommodation listings in New York City - just three vans, a converted yellow taxi and two campers - they provide an option for adventurous, budget-minded visitors seeking a place to rest their heads for far less than the US$200-and-up most hotels charge. \n\"The money is perfect,\" says Clemens Spath, 24, among the German trio who stayed in the 7.25 square metres van down by the river. They did complain, however, that the battery-powered fan was not enough to cool them on a sweltering night and mosquitoes got in through an open window. \nFor now, all the New York City listings on Airbnb for parked vehicles come from one owner, Jonathan Powley, a 35-year-old standup comedian and former hotel concierge who has been renting his vehicles for six months and does his best to anticipate every question. \nIs it legal? Police say that as long as it is legally parked, there's no problem sleeping in a vehicle on the street. \nIs it safe? There have been no problems thus far with those staying in Powley's vehicles, all parked in Queens' Long Island City, a gentrifying neighbourhood of former industrial warehouses and new condo towers. \nEvery day, Powley cleans his four-wheeled hotel rooms, changes the sheets and puts out flowers for new guests. He arranges with several neighbourhood coffee shops for guests to get free snacks and use the restrooms. And he directs them to a nearby public pool to shower, a practice he encourages. \nPowley goes the distance for special details: For one couple celebrating their 40th anniversary in one of his vans, he bought red rose petals to create a heart waiting for them on their bed. Ad Feedback \nEarlier this month, a couple who live in Brooklyn put down US$39 for a night in Powley's minivan taxi, decorated with yellow-and-black bedding, yellow towels and fresh bananas. The Atlanta natives were moving into a sublet and just needed to crash somewhere for one night. \nTheir black Labrador was happy curling up on the floor while they soaked up the shimmering views of the United Nations and the Empire State Building. \n\"It's pretty much the best spot to have a tiny little staycation,\" says Tabitha Akins, a fashion stylist. \nSuch listings are catching on in other places. Along Portugal's Costa da Prata, a converted truck comes with a wood-burning stove and an outdoor picnic table for about $105 a night. In London, a VW van with two bedrooms and a kitchen - but no toilet - can be had for about $303. \nWhile Powley hopes to eventually make some money on his steadily booked listings in New York, he's barely breaking even for now. \n\"I'm not doing it for the money. I love meeting travellers from all over the world,\" he says. \"I had a Spanish painter who had stayed at a Times Square hotel, and he told me he liked my van better.\" - AP", "external_links": [], "published": "2015-08-20T01:53:00.000+03:00", "crawled": "2015-08-20T06:47:58.613+03:00", "highlightTitle": ""}