{"organizations": [], "uuid": "45d3c0e06e5fd9131c1549552dfa4f59a3e555be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/jets-at-gate-766x250.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/egypts-airports-prepare-for-growth-with-sita-technology/", "country": "US", "title": "Egypt's airports prepare for growth with SITA technologyTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Egypt's airports prepare for growth with SITA technologyTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "45d3c0e06e5fd9131c1549552dfa4f59a3e555be"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/egypts-airports-prepare-for-growth-with-sita-technology/", "ord_in_thread": 0, "title": "Egypt's airports prepare for growth with SITA technologyTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Egypt’s airports prepare for growth with SITA technology Published\nThe Egyptian Airports Company (EAC) has announced that it has chosen SITA as its technology partner for its airport IT modernization program at five of the largest airports it manages across Egypt. EAC is using a combination of SITA airport technologies to improve the passenger experience and increase efficiency across all these airports.\nThe five airports being upgraded include Sharm El Sheikh International, Luxor International and Aswan International. Over 10.5 million passengers go through the airports each year, with passenger numbers expected to grow annually by an average of 14%.\nGeneral and Pilot Adel Abdel Aziz Mahgoub, Chairman and CEO of EAC, said: “More and more passengers are going through our airports each year, so it is essential we have the very best technology in place to ensure we continue providing great service. SITA’s IT solutions enable us to have the foundation of business efficiency which underpins our service.\n“Specifically, we are enhancing the passenger experience with new self-service opportunities and the latest baggage solutions, and using SITA’s world-class airport management system to manage flights, gates, baggage and most importantly – our people – more efficiently. Both passengers and airlines will benefit from the various efficiencies and faster aircraft turnarounds that SITA’s technology will deliver.”\nEAC is using SITA’s airport management systems, which are used by over 150 airports worldwide, to balance operational efficiency with business results. The airport operational database and resource manager will provide EAC with an integrated view of operations and present active dashboards to monitor and manage both flights and resources.\nWith a focus on irregularities, the operations team can manage resources to reduce costs and improve both turnaround times and on-time performance. SITA’s departure control system also allows the operations team to do check-in and boarding for charter flights in the same way as scheduled flights so that EAC can optimize the use of both human and fixed resources.\nHani El-Assaad, SITA President, Middle East, India and Africa, said: “Everything we do is driven by the dual objectives of improving the passenger experience and increasing operational efficiency for airports. The Egyptian Airport Company has a high proportion of tourist traffic, which provides challenges, in particular the management of seasonal peaks and troughs. It is important to have the right resources for the peaks without having expensive redundant capacity during the troughs. SITA’s technology provides the business intelligence to manage airports as efficiently as possible.”\nOne additional area of attention for the airport company is baggage. It has chosen SITA BagManager, which uniquely incorporates reconciliation, tracking, tracing and messaging, to ensure comprehensive and efficient baggage management. SITA BagManager will help EAC improve the handling of the five million bags it processes each year, reducing the number of mishandled bags. It will also boost security and cut costs.\nEl-Assaad continued: “It is not just about providing technology for the operations at each airport. SITA’s technology now connects all five airports to the Central Command Centre at the EAC headquarters, so the central operations team has an integrated and complete overview of operations. This integration of data to provide a single view of operations is vital to use resources most efficiently at all times and across all airports.”\nThe six year, multi-million dollar deal covers Sharm El Sheikh International Airport, Borg El Arab International Airport, Luxor International Airport, Aswan International Airport and Abu Simble International Airport. SITA’s technology will ensure these airports are future-proofed for growth.\nSource:- SITA", "external_links": [], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T16:16:52.409+03:00", "highlightTitle": ""}