{"organizations": [], "uuid": "c3cf2c78f593f8acf935a339883f0e9c7c34b780", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150820161633-airline-twitter-promo-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/08/21/travel/airline-twitter-personalities/index.html", "country": "US", "title": "The strange personalities of airlines on Twitter", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "The strange personalities of airlines on Twitter - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T00:44:00.000+03:00", "replies_count": 0, "uuid": "c3cf2c78f593f8acf935a339883f0e9c7c34b780"}, "author": "Corinne Purtill, for CNN", "url": "http://edition.cnn.com/2015/08/21/travel/airline-twitter-personalities/index.html", "ord_in_thread": 0, "title": "The strange personalities of airlines on Twitter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) Airline Twitter feeds are the digital equivalent of an airport customer service counter.\nThere is anger. Despair. Grudging acceptance of mildly satisfactory compensation.\nThe feeds are an endless litany of air travel woes: complaints about surly gate agents, photos of damaged luggage, desperate pleas to hold a gate so a traveler can make their connection.\nIn an age when customer service takes place in public view -- and one bad response can ricochet around the globe in seconds -- handling customers' emotional baggage in 140 characters or less is no small feat.\nWith complaints shifting to social media instead of offline help desks, keeping up with requests is the job of specialized teams who work 24/7 to field problems, complaints, questions and even the occasional compliment.\nAs with other customer service venues, dissatisfaction and impatience tend to dominate customers' tweets. (The exception to this is Delta, whose relentlessly cheerful and oddly flirtatious feed is unusually lacking in negative queries.)\nAirlines adopt several personas when it comes to dealing with customers via Twitter. Sometimes they have the calm, soothing presence of a crisis hotline operator:\n@tlankk We're sensing that you're upset. Please see the agent in the Baggage office to see what can be done.\n— American Airlines (@AmericanAir) July 16, 2015 Or a therapist.\n@AmericanAir to start, don't cancel a flight and give me only 20 minutes to figure out how to rebook it before my other flight left\n— Ann-Marie Alcántara (@itstheannmarie) August 7, 2015 In the face of opposition they can be impressively unhelpful . . .\n@easyJet my friend is not able to print his boarding pass we can not make head nor tail of what to do, flies tomorrow can you call us\n— Daniel O'Connell (@dan_o_1989) July 16, 2015 @easyJet that's not the issue he can't even get the boarding pass its like it doesn't exist despite having all his details\n— Daniel O'Connell (@dan_o_1989) July 16, 2015 . . . and resolutely immune to sarcasm.\n@Vivski_L We're glad your trip is all booked now, Viv! We can't wait to see you.\n— American Airlines (@AmericanAir) July 16, 2015 When praised -- which is rare -- their elation is touching.\n@gatesscholar Hi Daniel, Glad to hear that! Thanks for your feedback, it's always good to hear this from our customers! ^Justine\n— easyJet (@easyJet) August 7, 2015 \"Developing our voice in social media environments is more of an art than a science,\" says Jennifer Dohm, a spokeswoman for United Airlines.\nThe company is investing more heavily in social media, Dohm says, as customers increasingly turn to public forums like Facebook or Twitter to seek help and air complaints.\nUnited and other airlines contacted for this story say they aim to respond to all comments and queries that come in via social media channels.\n\"We don't distinguish between comments,\" Dohm says. \"If a customer reaches out to have a conversation, positive or negative, we're happy to do so.\"\nUnited found itself on the end of a very public furious tweet in May 2014, when recording artist will.i.am tweeted that he'd been barred from the airline's lounge.\n#unitedAIRLINES is the worse. Im a member & I have my card to prove it. but they tell me my card is fake & kick me out the lounge #ouch\n— will.i.am (@iamwill) May 10, 2014 The company later said his ticket didn't grant him access to that particular lounge, but by that time, supportive followers had already piled on.\nAs in will.i.am's case, representatives often discreetly direct the conversation away from public view, inviting them to directly message them to avoid posting personal information or flight details.\n\"We encourage our customer service representatives to be conversational, approachable, and that it's OK to have a little fun when appropriate,\" says Jonathan Pierce, director of social media for American Airlines. \"Striking the right tone is about reading the signals in the conversation.\"\nSometimes, that conversation goes terribly, terribly wrong.\nThe mother of all airline-related tweet catastrophes occurred on April 14, 2014, when a disgruntled passenger tweeted US Airways about a disrupted spring break trip.\n\"We don't like to hear this, Alex,\" US Airways replied. \"Please provide feedback to our customer relations team here.\"\n'Honest mistake'\nAttached was a pornographic photograph of a woman using a model Boeing 777 for a purpose for which it was not intended.\nThe tweet was live for 22 minutes, long enough to go viral and inspire countless comebacks. (\"Charging $60 to check bags is still the grossest thing US Airways has ever done,\" TV writer Vanessa Ramos tweeted in response.)\nA US Airways representative said at the time that the tweet was an \"honest mistake.\" Someone had earlier tweeted the photo to the airline's account, and in the process of flagging it as inappropriate, an employee inadvertently copied the URL to the passenger's reply.\n\"We learned lessons from that incident that have enhanced many aspects of our social media operations,\" was all Pierce would say when asked about the tweet's legacy.\nThe incident happened in the middle of US Airways's ongoing merger with American Airlines, which now handles both companies' Twitter accounts.\nAre there any other notable moments in their social media history? Pierce would rather not say.\n\"We have many memorable conversations, but as each customer has unique circumstances and requests, would prefer not to call any out.\"", "external_links": ["https://twitter.com/dan_o_1989/status/621772306659078144", "https://twitter.com/tlankk", "https://twitter.com/gatesscholar", "https://twitter.com/dan_o_1989/status/621759086137319424", "https://twitter.com/Delta/status/623547020331098112", "https://twitter.com/AmericanAir/status/621780283222806528", "http://flightclub.jalopnik.com/will-i-am-doesnt-understand-how-airports-work-booted-f-1575236141", "https://twitter.com/iamwill/status/465062912264896512", "https://twitter.com/itstheannmarie/status/629650619196772352", "https://twitter.com/Delta/status/629666461246713856", "https://twitter.com/hashtag/unitedAIRLINES?src=hash", "https://twitter.com/easyJet/status/629634359872589824", "https://twitter.com/AmericanAir", "https://twitter.com/AmericanAir/status/621787213555105792", "https://twitter.com/easyJet", "https://twitter.com/Vivski_L", "https://twitter.com/hashtag/ouch?src=hash"], "published": "2015-08-21T00:44:00.000+03:00", "crawled": "2015-08-21T12:46:12.770+03:00", "highlightTitle": ""}