{"organizations": [], "uuid": "6f4088d889020e6f53ef62f1923ef8449e782b4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03404/woman-stretching-h_3404250a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-14.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/lifestyle/geberit-aquaclean/11795709/exercise-at-home.html", "country": "US", "title": "Exercise at home: why leave home to get fit?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Exercise at home: why leave home to get fit? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T23:14:00.000+03:00", "replies_count": 0, "uuid": "6f4088d889020e6f53ef62f1923ef8449e782b4f"}, "author": "Claire Coleman", "url": "http://www.telegraph.co.uk/sponsored/lifestyle/geberit-aquaclean/11795709/exercise-at-home.html", "ord_in_thread": 0, "title": "Exercise at home: why leave home to get fit?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Discover more about the Geberit range » When life gets busy, one of the first things to fall by the wayside is often exercise. Who has time to go for a swim or a session in the gym when your boss is expecting you to work late, there’s a mountain of washing to get through and the house is a tip? On the rare occasions that you manage to carve out a spare hour for yourself, if you’re not spending it sleeping, you would probably rather spend it with family or friends than surrounded by sweaty strangers. But the fact is that exercise is essential to all aspects of our well-being. Regular exercise is associated with a diminished risk of a number of conditions including cancer, heart disease, dementia, stroke, type 2 diabetes, depression, obesity and high blood pressure. Plus, as you get older, certain types of exercise can help improve your core stability and your flexibility, enabling you to stay mobile and active for longer. And while evidence suggests that to lose weight you need to adjust your diet as well, exercise is also important for maintaining a healthy weight and creating body definition. Government guidelines suggest that adults should aim to be active daily, doing at least 2.5 hours of moderate intensity activity (brisk walking or cycling – anything that makes you warmer and slightly out of breath) in bouts of 10 minutes or more, every week. That’s just half an hour a day, five days a week – and when it comes to investing in your well-being, lack of time is no excuse – especially when you’ve got a gym on your doorstep. An efficient 20-minute workout you do every day is far better than an hour’s exercise you do weekly or when you feel like it “There are plenty of exercise options that mean you don’t even have to leave the house,” says Janey Holliday, personal trainer and founder of online lifestyle-coaching company Making Things Easy. “From online boot camps and free fitness videos on the internet, to DVDs that, if you don’t want to buy, you can hire from your local library. An efficient 20-minute workout you do every day is far better than an hour’s exercise you do weekly or when you feel like it.” Once you’ve found a home workout you like, staying motivated can sometimes prove tricky. Start by scheduling your workouts. Think about when you can make the time – whether it’s before work or after you get home, between putting the children to bed and having dinner – whenever works for you. But make sure you write it in your diary and keep the appointment. Some people find working out with a friend or neighbour helpful. If you don’t have anyone nearby who is keen, find an online community that will support you. Also think about downloading an app that will help you track your progress – setting and reaching goals is a proven way to keep you motivated. Janey also recommends transforming your home environment to help keep you focused. “Images and Quote: s stuck on your fridge or on your wardrobe, or even a vision board in your hallway, are great ways to help you stay motivated,” she says. “Music always helps too – if you’re feeling low or lacking energy, put on your favourite music or create a playlist that makes you feel upbeat and up for it.” Once fitness becomes part of your daily routine, you’ll soon feel and see the benefits – and that should be all the motivation you need to keep it up. Exercise: top tips for success Personal trainer Janey Holliday reveals how she works exercise into her everyday life: • Move to music In my house we always empty the dishwasher dancing to Billie Jean or tidy up the toys while blasting our other favourite tunes. • Keep your fitness gear handy I have a basket of equipment that can be pulled out at any time: skipping ropes, free weights, resistance bands for adults and tennis rackets or footballs for the kids. • Have fun with it If you have children, it helps to find creative ways to get the whole family moving. Switch off the TV and gadgets, and make camps, play games or build an obstacle course in your back garden. • Get some rest A good night’s sleep is crucial following an active, healthy day. Geberit knows that well-being starts at home It’s easy to make small life changes to improve your health and happiness – and that includes investing in your bathroom. The new Geberit AquaClean Mera shower toilet provides a complete cleaning and hygiene solution. With unique features including a built-in revitalising shower spray, warm-water system, separate lady wash, dryer, odour extraction and automatic lid, it provides a clean and fresh feeling every time. • Visit the Geberit Facebook or Twitter page for more information on AquaClean products", "external_links": [], "published": "2015-08-14T23:14:00.000+03:00", "crawled": "2015-08-14T18:26:53.883+03:00", "highlightTitle": ""}