{"organizations": [], "uuid": "994793090e46126c7d2879ee92e5492b98fdc76e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/etc/designs/ffx/nz/stuff/social-media-logos/stuff-180x180.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/themes/71336705/Top-travel-photos-of-the-week", "country": "AU", "title": "Top travel photos of the week", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 0, "title_full": "Top travel photos of the week", "spam_score": 0.0, "site_type": "news", "published": "2015-08-21T04:16:00.000+03:00", "replies_count": 0, "uuid": "994793090e46126c7d2879ee92e5492b98fdc76e"}, "author": "", "url": "http://www.stuff.co.nz/travel/themes/71336705/Top-travel-photos-of-the-week", "ord_in_thread": 0, "title": "Top travel photos of the week", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["ANDREW KELLY Charles McQuillan", "Wray Buda Mendes MIKE BLAKE", "JAYANTA DEY ALBERT GEA", "WOLFGANG RATTAY", "JOHN VIZCAINO ALI HASHISHO ALI HASHISHO"], "text": "Top travel photos of the week Last updated 13:16, August 21 2015 AJAY VERMA WOLFGANG RATTAY LUKAS BARTH Ulet Ifansasti Ed Wray Buda Mendes MIKE BLAKE CHINA STRINGER NETWORK ANDREW KELLY ANDREW KELLY Charles McQuillan RICARDO MORAES JOHN VIZCAINO ALI HASHISHO ALI HASHISHO PILAR OLIVARES PILAR OLIVARES DANISH SIDDIQUI JAYANTA DEY ALBERT GEA \nTraditionally dressed girls play on swings during the Teej festival in Chandigarh, India. Teej falls in the Hindu month of Shrawan (July-August) and welcomes the advent of the monsoon. \nA climber tackles a via ferrata as she walks over a rope bridge at the Dragon's Wall high above Moon lake (Mondsee) near the western Austrian city of Salzburg. Through the wooden planks of the bridge, climbers can look more than 300m into the deep under their feet. \nModels wear traditional Bavarian costumes as they hold the official Oktoberfest beer mug during a presentation in Munich, Germany. Millions of beer drinkers from around the world are expected to attend the 182nd Oktoberfest beer festival, which opens on September 19, 2015. \nIndonesian men compete for a ball as they play mud soccer during the 70th Indonesia National Independence day celebration in Yogyakarta, Indonesia. Indonesia became an independent nation on August 17, 1945, having previously been under Dutch rule. \nIndonesian men in teams of four try to climb to the top of a greased pole called a panjat pinang in order to get to the prizes tied to the top in Jakarta, Indonesia. Cities and villages across Indonesia celebrated the country's 70th anniversary of Independence with traditional games, music and flag raising ceremonies. \nIvan Kljakovic of Croatia sails in the Finn class on the Niteroi course during the International Sailing Regatta - Aquece Rio Test Event for the Rio 2016 Olympics in Rio de Janeiro, Brazil. \nA couple and their dog sit at the beach to watch the sun set as a heatwave begins to subside in Cardiff, California. \nPeople crowd on a beach to escape the summer heat on a hazy day in Dalian, Liaoning province, China. \nDavid Free of Harlem practices calisthenics under flying kites at Coney Island Beach in Brooklyn, New York. Higher than average temperatures are expected in New York City for much of next week, according to local meteorologists. \nA man and woman kiss on the beach at Coney Island Beach in Brooklyn, New York. \nA Game of Thrones tourist dressed in costume walks along a beech tree lined road known locally as The Dark Hedges in Belfast, Northern Ireland. Due to the popularity of the series, various locations highlighted on screen have become tourist attractions around the province. \nPeople sit on a bench on the sidewalk at Copacabana Beach in Rio de Janeiro, Brazil. \nA man attends the \"Rock al Parque\" music festival in Bogota, Colombia. About 420,000 people are expected to attend the free three-day festival in Bogota, according to a festival official. \nPeople enjoy the warm weather on a beach in Naqoura, southern Lebanon. \nPeople enjoy the warm weather on a beach in Naqoura, southern Lebanon. \nA guest cleans the inside of a sleeping pod at the Skylodge Adventure Suites in the Sacred Valley in Cuzco, Peru. Tourists who take on the arduous climb up the steep cliff face are rewarded for their efforts by being able to spend the night in transparent mountaintop sleeping pods. To reach the pods, visitors need to climb 400 metres of via ferrata (a steel cable and rungs) up the valley side or hike an intrepid trail through zip lines. \nA guide waits for guests above the sleeping pod at the Skylodge Adventure Suites in the Sacred Valley in Cuzco, Peru. \nA devotee dressed as Hindu Lord Shiva waits to participate in a parade during \"Kumbh Mela\" or the Pitcher Festival in Trimbakeshwar, India. The Kumbh Mela takes place four times every 12 years at four different river bank locations in India. \nKanwarias or devotees of the Hindu god Shiva offer prayers and pour sacred water on an idol of god Shiva outside a temple in Agartala, India. \nPeople cool off at Sant Sebastia beach in Barcelona, Spain. 1 of 20 \nHere is our round up of the top travel photos from around the world. \nDo you have a favourite? Let us know in the comments.", "external_links": [], "published": "2015-08-21T04:16:00.000+03:00", "crawled": "2015-08-21T04:46:15.585+03:00", "highlightTitle": ""}