{"organizations": [], "uuid": "78888868440a401f55ebdbb45d67bab5dabd5d47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28217-motel-one-amsterdam-now-open", "country": "US", "title": "Motel One Amsterdam now open", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Motel One Amsterdam now open", "spam_score": 0.0, "site_type": "news", "published": "2015-08-12T17:45:00.000+03:00", "replies_count": 0, "uuid": "78888868440a401f55ebdbb45d67bab5dabd5d47"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28217-motel-one-amsterdam-now-open", "ord_in_thread": 0, "title": "Motel One Amsterdam now open", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Motel One Amsterdam now open Motel One Amsterdam now open Details   15:45 Rooms start at just €69 Motel One opened the doors to its first hotel in Amsterdam on the 6th August, bringing its 320 budget design hotel rooms and excellent service to the heart of the city. Motel One Amsterdam is located opposite Amsterdam RAI Exhibition and Conference Centre and close to excellent transport links via bus, train and tram, making it the ideal base for business and leisure visitors alike. \nBusiness visitors will find the hotel’s convenient location, easy transport links, free Wi-Fi, iPads (available in reception) and mobile desks in each room, ideal for any work trip. For those visiting Amsterdam for leisure, the hotel is the perfect base from which to explore the city, with the Van Gogh Museum, De Oude Kerk (the old Church), Rijksmuseum and Amstelpark just a short journey away. To ensure Motel One offers customers a unique travel experience, each hotel’s design is influenced by its city’s culture and history. Amsterdam’s famous bicycles, flowers (particularly tulips) and architecture have all been incorporated into Motel One Amsterdam, proving an atmosphere that is fitting for this beautiful city. Pedal away in the One Lounge… The One Lounge design focus is on Amsterdam’s most used means of transport, city bikes! The area features two impressive art installations that have been built out of old bicycle components. This theme continues up to the first floor, with a wall of bike carriers that invites guests to leave greetings and notes on small cards. It’s all about the tulips… The Netherlands and Amsterdam are synonymous with tulip fields and during spring the landscape consists of glorious pink, yellow and red blossoms. This famous symbol of the city is beautifully presented in the One Lounge which features a photo collection of tulips, a bespoke rug from renowned Spanish label GAN, tulip coloured and shaped chairs by Fritz Hansen and a stunning glass lamp by Bocci, which also provides a fascinating hanging garden over the large dining table. Mesmerizing architecture… The beauty of Dutch architecture also shines through in the One Lounge with a custom-made partition that resembles the different window shapes of the city’s buildings, while the bar’s counter has a beautiful 7 metre long collage of the houses visitors will discover lining the canals. The beauty of Motel One Amsterdam spills out onto the pavement with a charming and playful array of chairs by the exclusive Italian label Moroso. Guests can sit back and relax after a busy day exploring the city. Motel One’s ethos is ‘great design for little money’ with 100% Egyptian cotton bed sheets, Loewe flat screen TVs and exclusive Artemide Tolomeo lighting in each Motel One Amsterdam room, guests are sure to find the quality and service they are looking for at the prices they dream of. Related articles", "external_links": [], "published": "2015-08-12T17:45:00.000+03:00", "crawled": "2015-08-12T17:57:49.580+03:00", "highlightTitle": ""}