{"organizations": [], "uuid": "263313eb2f6d83be3b699f155db4338e404860bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/08/Seaborne-Airlines.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/seaborne-airlines-supports-31st-annual-chili-cook-off-community-fundraiser/", "country": "US", "title": "Seaborne Airlines Supports 31st Annual Chili Cook Off Community FundraiserTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Seaborne Airlines Supports 31st Annual Chili Cook Off Community FundraiserTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "263313eb2f6d83be3b699f155db4338e404860bd"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/seaborne-airlines-supports-31st-annual-chili-cook-off-community-fundraiser/", "ord_in_thread": 0, "title": "Seaborne Airlines Supports 31st Annual Chili Cook Off Community FundraiserTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seaborne Airlines Supports 31st Annual Chili Cook Off Community Fundraiser Published\nOn Sunday, August 16th at Brewers Beach on St. Thomas, over 75 local chili teams will create vegetarian and beef chili from scratch to be judged and awarded “Best of VI.” Festivities begin at 11 am. Seaborne Airlines is pleased to announce their sponsorship of the 31st Annual Texas Society of the Virgin Islands Chili Cook Off Community Fundraiser. For over 20 years, Seaborne has committed to inspiring and investing in the U.S.V.I. this event is one of many that supports vital organizations within the Territory.\nAll proceeds from the event are donated to local charities, including Dial-A-Ride, Family Resource Center, Queen Louise Home for the Aged, St. Thomas Rescue, St. Thomas Sail and Power Squadron, and others. In addition, two $1,000 scholarships to the University of the Virgin Islands are awarded to local students. For more details on participation, please go to 31st Annual Texas Society Chili Cook Off Event page on Facebook.\n“We take pride in supporting almost 300 local organizations focused on the most prevalent needs of our island communities, “said Mora Scotland, Sales Manager of USVI and BVI Region, “We believe this commitment to help enrich and expand the lives of our neighbors makes the USVI a better place to live for all.”\nSeaborne’s mission is to join our customers and local community organizations in serving the U.S.V.I. by bringing the Caribbean closer. Through it’s soon to be 17 destinations, multiple daily flights between St. Croix and St. Thomas, Seaborne celebrates the diversity and culture of the islands by supporting a wide range of organizations. From the St. Croix Youth Soccer Association, United Jazz Foundation Mentorship Program, and USVI business promotion through the Annual Hotel and Tourism Symposium, Seaborne connects the communities.\n“The USVI Hotel & Tourism Association has had a long standing partnership with Seaborne Airlines. They are the premium sponsor of our annual Destination Symposium providing the round trip airfare for our OTA partners to ensure they explore all the Virgin Islands during the event. They have also been a long time sponsor of our annual employee recognition event The Tommy Star Awards. We very much value their continuous sponsorship to ensure our events are successful.”\nSource:- Seaborne Airlines", "external_links": [], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-14T16:18:08.456+03:00", "highlightTitle": ""}