{"organizations": [], "uuid": "6a78faa6b3b9be420c0c47567eca4fe980247ea5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29803221/united-airlines-scholarship-fund-distributes-more-than-1-million-to-kick-start-the-school-year", "country": "US", "title": "United Airlines Scholarship Fund Distributes More Than $1 Million to Kick Start the School Year", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "United Airlines Scholarship Fund Distributes More Than $1 Million to Kick Start the School Year - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "6a78faa6b3b9be420c0c47567eca4fe980247ea5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29803221/united-airlines-scholarship-fund-distributes-more-than-1-million-to-kick-start-the-school-year", "ord_in_thread": 0, "title": "United Airlines Scholarship Fund Distributes More Than $1 Million to Kick Start the School Year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " United Airlines\nCHICAGO , Aug. 17, United Airlines continues its investment in the education and development of hundreds of undergraduate and graduate students by awarding more than $1 million in scholarships to its employees and their families through the United Scholarship Fund (USF).\nA company-sponsored charity, the USF has awarded more than 750 scholarships for the 2015-2016 school year – more than 250 of them to new recipients – based on several factors, including financial need, academic standing, community involvement and leadership ability. This year's recipients live in four countries and seventeen states within the United States .\n\"Every year, the United Scholarship Fund enables us to invest in our employees' lives by giving them and their loved ones an opportunity to finish or further their educations,\" said Donna Towle , United's vice president of operations engagement and leadership. \"We congratulate this year's scholarship winners and thank each of our employees and business partners who generously contribute to the USF year after year.\"\nThe USF is a private, nonprofit charity that supports the educational pursuits of employees and their dependents. Students have the opportunity to apply for a one-time scholarship of $1,000 or a $1,500 award renewable for up to five years, including one year of graduate school after completing a bachelor's degree.\nSince its creation in 2002, the USF has contributed more than $9 million in scholarships to nearly 2,700 recipients. During the past three years, the charity has provided over $1 million annually in academic awards through employee contributions and fundraising efforts.\nAbout United\nUnited Airlines and United Express operate an average of nearly 5,000 flights a day to 362 airports across six continents. In 2014, United and United Express operated nearly two million flights carrying 138 million customers. United is proud to have the world's most comprehensive route network, including U.S. mainland hubs in Chicago , Denver , Houston , Los Angeles , New York / Newark , San Francisco and Washington, D.C. United operates nearly 700 mainline aircraft, and this year, the airline anticipates taking delivery of 34 new Boeing aircraft, including the 787-9 and the 737-900ER. United is also welcoming 49 new Embraer E175 aircraft to United Express. The airline is a founding member of Star Alliance , which provides service to 192 countries via 28 member airlines. More than 84,000 United employees reside in every U.S. state and in countries around the world. For more information, visit united.com , follow @United on Twitter or connect on Facebook. The common stock of United's parent, United Continental Holdings, Inc., is traded on the NYSE under the symbol UAL.\nLogo - http://photos.prnewswire.com/prnh/20130404/MM89155LOGO\n releases/united-airlines-scholarship-fund-distributes-more-than-1-million-to-kick-start-the-school-year-300129263.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://united.com/", "http://www.prnewswire.com/news-releases/united-airlines-scholarship-fund-distributes-more-than-1-million-to-kick-start-the-school-year-300129263.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG80748&Transmission_Id=201508171130PR_NEWS_USPR_____CG80748&DateId=20150817", "http://photos.prnewswire.com/prnvar/20130404/MM89155LOGO", "http://photos.prnewswire.com/prnh/20130404/MM89155LOGO"], "published": "2015-08-17T03:00:00.000+03:00", "crawled": "2015-08-17T18:37:39.839+03:00", "highlightTitle": ""}