{"organizations": [], "uuid": "17d5bef93de004f940930d02ef0e9c6aa2789897", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62284/loews-coronado-bay-resort-welcomes-new-managing-director", "country": "US", "title": "Loews Coronado Bay Resort welcomes new managing director", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Loews Coronado Bay Resort welcomes new managing director", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:54:00.000+03:00", "replies_count": 0, "uuid": "17d5bef93de004f940930d02ef0e9c6aa2789897"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62284/loews-coronado-bay-resort-welcomes-new-managing-director", "ord_in_thread": 0, "title": "Loews Coronado Bay Resort welcomes new managing director", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Loews Coronado Bay Resort welcomes new managing director Adv: Loews Coronado Bay Resort Adv: \nSAN DIEGO, CA – Loews Hotels & Resorts announces the appointment of Sean Clancy as managing director of Loews Coronado Bay Resort. \nClancy brings more than 22 years of hospitality-industry experience to his new role, having most recently served as managing director of Loews Philadelphia Hotel. \nClancy began his career with Loews Hotels & Resorts in 2012 as hotel manager for the Loews Miami Beach Hotel in Florida. Prior to Loews, he held senior level leadership positions with The Ritz-Carlton Hotel Company and Waldorf Astoria Hotels and Resorts, including executive assignments at the Arizona Biltmore Resort and the Boca Raton Resort & Club. \nAt Loews Coronado Bay Resort, Clancy will be responsible for overseeing the general operations of the 439-room resort, as well as its five restaurants and lounges, the full service Sea Spa, and premier conference facilities. \n“We are delighted to have Sean Clancy join the Loews Coronado Bay Resort team,” said John Arnett, vice president of operations, Loews Hotels & Resorts. “Sean has demonstrated himself as an exceptional leader within our growing brands, and we’re thrilled to introduce him to our guests and team members in San Diego.” \nDuring his tenure as managing director of Loews Philadelphia Hotel he led a substantial property renovation and the hotel received notable property accolades including Loews Hotels & Resorts’ prestigious Hotel of the Year. \n“It’s a great honor to join the team at Loews Coronado Bay Resort, one of the premier luxury destination resorts in Southern California,” said Clancy. “I’m looking forward to working alongside our team members to deliver an outstanding experience to every guest who visits our island oasis.”", "external_links": [], "published": "2015-08-06T03:54:00.000+03:00", "crawled": "2015-08-06T04:16:13.962+03:00", "highlightTitle": ""}