{"organizations": [], "uuid": "b959651ef2ccc19dee85084bb75da588a2f6160a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.com", "main_image": "http://ichef.bbci.co.uk/wwfeatures/624_351/images/live/p0/2s/xt/p02sxt0p.jpg", "site_section": "http://www.bbc.com/travel/feed.rss", "section_title": "BBC Travel", "url": "http://www.bbc.com/travel/story/20150601-saving-the-rarest-canids-on-earth?ocid=global_travel_rss", "country": "GB", "title": "Saving the rarest canids on Earth", "performance_score": 1, "site": "bbc.com", "participants_count": 0, "title_full": "Saving the rarest canids on Earth", "spam_score": 0.0, "site_type": "news", "published": "2015-08-17T15:09:00.000+03:00", "replies_count": 0, "uuid": "b959651ef2ccc19dee85084bb75da588a2f6160a"}, "author": "", "url": "http://www.bbc.com/travel/story/20150601-saving-the-rarest-canids-on-earth?ocid=global_travel_rss", "ord_in_thread": 0, "title": "Saving the rarest canids on Earth", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Robin Cherry"], "text": "National Parks Saving the rarest canids on Earth This Ethiopian hotspot is home to more native species – including the rare Ethiopian wolf – than any other area of comparable size on the planet. By Robin Cherry 17 August 2015 \nAs the crow flies, Bale Mountain National Park lies 400km southeast of the Ethiopian capital of Addis Ababa – but I wasn’t a crow. Our trip took nine bone-rattling, heart-stopping hours, navigating crowded dusty village roads and dodging people, cows, goats, dogs, donkeys and potholes. \nI was headed with my driver Daniel to Bale Mountain Lodge , a new concession that the Ethiopian government granted to British military officer Guy Levene and his wife, Yvonne, in September 2014, in the hope of using conservation and tourism to save the 2,200sqkm park from the very real threats of deforestation and illegal squatters. View image of The journey to Bale Mountain Lodge (Credit: Credit: Pamela Robbie) \nBale Mountain National Park is a source of beauty and wonder, but its importance is much more than skin deep. On Unesco’s World Heritage Tentative List , its spectacularly diverse landscape is home to the world’s largest genetic stock of Ethiopia’s prized wild coffee (essential for developing new bean varieties), as well as 40% of the country’s medicinal plants. It also has more native species – including the rare Ethiopian wolf and more than 300 species of birds – than any other area of comparable size on the planet. On top of all that, Bale Mountain is home to the country’s largest cloud forest, whose wetlands serve as a catch basin that supplies water to 12 million people in the arid lowlands of Ethiopia, Kenya and Somalia. View image of A view of Bale Mountain National Park (Credit: Credit: Pamela Robbie) \nBut having been ineffectively managed for years, all this is in danger of disappearing. As Ethiopia’s population exploded over the past 10 years, due to high fertility rates and the availability of arable land, illegal settlers flocked to Bale Mountain National Park, bringing their cattle with them. Unlike the dusty national parks of neighbouring Kenya, the land here is fertile and the settlers are farming, pasturing and logging – as well as overgrazing the land and illegally harvesting wood for fuel. The settlers also bring their dogs, which both crossbreed with the Ethiopian wolves and threaten them with rabies. \nBefore the lodge opened, accommodations in the park had been basic at best and squalid at worst. Visitors could set up their own tents and camp, but those who preferred light, power and heating were out of luck. The new lodge hopes to attract more affluent visitors to the area, and the Levenes have committed to donating a percentage of the profits to park protection, including locating and prosecuting squatters. \nAfter six hours of driving through the Great Rift Valley – the vast trench that runs all the way from Syria to Mozambique – we finally reached the park headquarters in Dinsho, which was still almost three hours from the lodge. A herd of mountain nyala (a kind of antelope) stopped and stared at us, motionless, before they came to their senses and gracefully bounded off across expansive grasslands dotted with Africa’s ubiquitous flat-topped acacia trees. With only 2,500 still in existence, the mountain nyala is Ethiopia’s most wanted. Yet despite its endangered status, for a trophy fee of $15,000, you can personally bring those found outside the park’s protection one step closer to extinction. \nAscending, the savannah gave way to the lush juniper woodlands, flecked with yellow accents of the flowers of the St John’s Wort bush. Swaggering baboons challenged Daniel for the right of way, and the temperature dropped as we climbed up to the Sanetti plateau, an ashy lunar landscape perched at a lung-busting altitude of 4,000m. \nWe looked down on cottony cumulous clouds, stunning against the azure sky. Almost at once, Daniel spotted a lone Ethiopian wolf in the distance. For the rarest canids on Earth, these wolves are surprisingly easy to spot, as vegetation is sparse but for the occasional flower-spiked giant lobelia. There are only 450 Ethiopian wolves still on the planet; 50% of them live on this plateau and the rest reside in five other Afro-Alpine regions elsewhere in Ethiopia. The lissome, long-limbed wolves live in family packs, cuddling together to keep warm when the temperature dips below freezing, as it does often. During the day, they set off alone to hunt for prey. View image of Giant Iobelias in the park (Credit: Credit: MG Therin Weise/Getty) \nThe wolves’ prey of choice is the giant mole rat, a pudgy rodent whose eyes have migrated to the top of its head, like furry little beacons. The mole rat, endemic only to Bale Mountain and another park species that’s threatened, burrows just under the surface of the plateau, popping up and down like a live-action game of Whack-a-Mole – or, perhaps, given the wolves proclivity, Snack-a-Mole. \nAs we descended from the plateau into the verdant Harenna Forest, Africa’s third largest wood, and pulled onto the dusty road that led to the lodge, a family of warthogs darted in front of us, the tiny doe-eyed piglets scrambling to keep up with their parents. \nNestled unobtrusively into the landscape at the (relatively) lung-friendly elevation of 2,377m was a traditional Ethiopian tukul -style building (a round structure with straw bale walls and a cone-shaped thatched roof). However, despite appearances, the eco-friendly lodge has been uniquely designed to minimize environmental impact. View image of Inside a traditional Ethiopian tukul-style building (Credit: Credit: Pamela Robbie) \nIts electric power is generated by a micro-hydropower plant located in the nearby Shawe river, while its water is drawn from the river and purified using sand filtration. A final UV filtration allows water to be drunk straight from the tap, eliminating the need for plastic water bottles. Solid waste is processed through a Biogas unit and transformed into cooking fuel. The Levenes also provide free accommodation, food, office space and internet access for international research teams to work on conservation projects in the park. This level of environmental commitment is unique for Ethiopia, and the Levenes hope it will provide a useful model for other lodges seeking to practice sustainable tourism. View image of Into the verdant Harenna Forest (Credit: Credit: Pamela Robbie) \nIts 11 rooms are located in disabled-accessible stone-built suites adjoining the lodge and in freestanding cottages, called menyettabets in Amharic, surrounded by forest. Disabled-accessible accommodations are far from the norm in Africa, but the Levene’s son, Max, was left paralyzed after a freak rugby accident, and it was important to them that he and other less mobile guests feel welcome. Max himself road-tested and approved the rooms. \nMy menyettabet was decorated with red, white and black Ethiopian textiles and colourful woven rugs. The bed sat up against a stone wall, facing a private balcony where I enjoyed a cup of tea each morning as the sun rose over a jagged peak in the distance. At night, I lay in bed warmed by the wood burning stove and mesmerised by the ceiling’s concentric circles of thatch. \nI spent three days exploring the park with Daniel and the lodge’s resident naturalist, James Kuria Ndung’u. Ndung’u is a Kenyan ornithologist who, when he’s not leading guests around the park, bands birds to track their migratory patterns. He could identify birds I couldn’t even see, and pointed out plants and flowers barely visible to the naked eye. He also photographs illegal settlements for the authorities, who have started to crack down. View image of A bee pollinating park flowers (Credit: Credit: Roberto Schmidt/Getty) \nOne night we ate dinner with an English couple. The husband was a retired ornithology professor from the University of Cardiff. When he and Ndung’u got talking, the conversation was a blur of weavers, babblers and larks — until their voices become hushed at the mention of Ethiopia’s most prized avifauna: the rare and endangered Ruspoli’s Turaco, a striking green-and-crimson bird with a blond spiky punk hairdo. The bird was first collected in the 1890s by Prince Ruspoli, an Italian explorer who was killed in an encounter with an elephant and didn’t leave any notes about the location of his collection. \nDespite rumours that it had been seen in the park, I didn’t see a Ruspoli’s Turaco. But I did see – because Ndung’u pointed it out – a rare Bale monkey, a primate that survives almost entirely on bamboo (most monkeys, I learn, are “adaptable generalists”, or omnivores). Ndung’u also told me he might have discovered a new snake species believed to be an endemic black morph variety new to science. I don’t see one of those either – and that was fine with me. \nOn my last night, a shiver ran through me as I gazed up at the impossibly starry sky. The temperature had started its descent to freezing. I imagined the Ethiopian wolves curling up together for a warm night’s sleep and wished upon 1,000 stars that they and their descendants would be able to roam across this vital and stunning landscape forever. \nWhere do you rank in our tribe of worldly readers? Answer these questions to get a sense. Follow BBC Travel", "external_links": [], "published": "2015-08-17T15:09:00.000+03:00", "crawled": "2015-08-17T07:24:39.927+03:00", "highlightTitle": ""}