{"organizations": [], "uuid": "a1fd6bdd39f4a47267f05db689f35b7a4ab9e5d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2015/7/30/1438253024346/9f8cc3be-991f-4d47-9a2c-bcc9ef131519-2060x1236.jpeg", "site_section": "http://www.theguardian.com/travel", "section_title": "Travel news, travel guides and reviews | The Guardian", "url": "http://www.theguardian.com/travel/2015/aug/01/farmhouse-bolthole-mackworth-derby-hotel-review", "country": "GB", "title": "The Farmhouse at Mackworth, Derby: hotel review", "performance_score": 0, "site": "theguardian.com", "participants_count": 7, "title_full": "The Farmhouse at Mackworth, Derby: hotel review | Travel | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T15:00:00.000+03:00", "replies_count": 7, "uuid": "42d7ce801bc535e9ec22abea316d7529c01865d3"}, "author": "Rachel Dixon", "url": "http://www.theguardian.com/travel/2015/aug/01/farmhouse-bolthole-mackworth-derby-hotel-review#post-0", "ord_in_thread": 0, "title": "The Farmhouse at Mackworth, Derby: hotel review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "T he Mackworth hotel, just outside Derby, has long been a destination venue – for funerals. It is handy for Markeaton Crematorium, and used to be suitably sombre. The last time I was here was for my grandmother’s wake.\nWhat a difference a refurb makes! The rebranded Farmhouse at Mackworth, now owned by Marston’s Revere Pub Company, is almost unrecognisable. My friend and I arrived late on Friday night and were almost deafened by club classics booming around the bar. We retreated to the library – which has books suspended from the ceiling – for a nightcap, curling up in cosy chairs as far from a speaker as possible.\nRelated: Great city walks: Derby\nUpstairs, we discovered that the 10 rooms have a (mercifully subtle) Animal Farm theme, presumably a nod to the building’s 18th-century farmhouse origins (though somewhat missing the point of the novel). Our room, Boxer, has a few drawings of horses on the wall. I assume Muriel has goats and Napoleon, the suite, pigs. The room has nice touches, including bare-bulb lamps and an exposed-brick wall, and there’s a sitting area between bedroom and bathroom. But the latter has, disappointingly, an over-bath shower rather than a walk-in one – perhaps the space would have been be better used for a bigger bathroom. Glimpses of the more functional former hotel occasionally peep out through the cracks (metaphorically speaking – the paintwork was immaculate), but overall, the physical makeover seems a resounding success.\nFacebook Twitter Pinterest A hotel is more than the sum of its designer parts, though, and in other ways the Farmhouse fell short. Staff were friendly, but a little artless: the waitress looked blank when I ordered omelette Arnold Bennett from the short, appealing breakfast menu, and it took half an hour to arrive. In the meantime, I nipped upstairs to get my phone, and found our room being cleaned, at 9.30am, before we’d even used the towels.\nRelated: UK days out with myths and legends\nAfter breakfast, we hopped on the bus that stops right outside and went into town. The hotel is on the road that connects Derby (two miles away) and Ashbourne (eight miles). We whizzed around the sights: Derby Art Gallery with its Joseph Wrights, the Silk Mill (the world’s first factory), the Quad arts centre, Sadler Gate for shopping, Friargate for drinks.\nBack at the hotel that evening, the bar was full of people dressed up and having a good time. The refurb has made the most of the sprawling space: barn doors lead to nooks and crannies; there are exposed beams, fireplaces and modern, mismatched furniture. My champagne cocktail was brilliantly boozy – the barmen are generous with the brandy. The open-plan restaurant looked great too, with big sash windows overlooking the grounds, red chairs, yellow banquettes and a huge central log-burner – but the music was loud enough to wake the dead. We had to ask them to turn it down. Twice.\nFacebook Twitter Pinterest Farmhouse at Mackworth, Derby Starters (seared squid and chorizo hash) were perfectly pleasant, but main-course lamb and steak from the charcoal oven were sensational. They weren’t cheap: at £19-27 for a steak, this is a special-occasion restaurant. Sadly, we were too full to try the intriguing “crispy fried ice-cream”.\nAs well as birthday parties and anniversaries, the hotel is targeting the wedding market. A separate building, the Folly, has its own entrance and terrace and is licensed to perform ceremonies. The library can also be hired out for private parties; one was being set up as we left on Sunday.\nBefore checking out, I invited my sister over for coffee and a second opinion. She was as astonished as me at the transformation, and equally impressed. But she didn’t get that coffee - the staff had gone awol and I couldn’t risk a repeat of the long drawn-out breakfast; I had a train to catch.\nIf it irons out the service glitches and sorts out the soundtrack – which needs to be not just quieter, but better – this could be a fantastic hotel. Even now, it is a great alternative to a city-centre stay, and an impressive venue for a celebration. Mourners, however, may want to look elsewhere.\n• Accommodation was provided by The Farmhouse at Mackworth, 60 Ashbourne Road, Derby, 01332 824324, thefarmouseatmackworth.com . Doubles from £95 with continental breakfast. Rail travel from London to Derby was provided by East Midlands Trains\nAsk a local Kathy Frain, marketing manager, Derby Quad arts centre\nThe Abbey Inn • Pub crawl\nStart at Cathedral Green in central Derby and walk along the river, past the Silk Mill museum , stopping at the Silk Mill pub . Carry on to the Furnace Inn , then head across Darley Park to finish at the historic Abbey Inn .\n• Restaurant\nThere’s a choice of more than 25 burgers at The Forge off Sadler Gate – or you can create your own. Wash it down with a choice of craft beers in the suntrap of a garden out the back.\n• Day trip\nTake the A6 towards Matlock and head up to Stanton Moor (past Birchover) for bracken, heather, fantastic views and our atmospheric bronze age stones, the Nine Ladies .", "external_links": ["http://www.pinterest.com/pin/create/button/?description=The+Farmhouse+at+Mackworth%2C+Derby%3A+hotel+review&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Faug%2F01%2Ffarmhouse-bolthole-mackworth-derby-hotel-review&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F30%2F1438253071102%2F261f377d-061f-4387-b1ee-6864c5323b0d-2060x1373.jpeg", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4b5ca%2Fsfb%23img-3&ref=responsive", "http://www.derbyquad.co.uk/", "http://eastmidlandstrains.co.uk/", "https://twitter.com/intent/tweet?text=The+Farmhouse+at+Mackworth%2C+Derby%3A+hotel+review&url=http%3A%2F%2Fgu.com%2Fp%2F4b5ca%2Fstw%23img-3", "https://twitter.com/intent/tweet?text=The+Farmhouse+at+Mackworth%2C+Derby%3A+hotel+review&url=http%3A%2F%2Fgu.com%2Fp%2F4b5ca%2Fstw%23img-2", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4b5ca%2Fsfb%23img-2&ref=responsive", "http://www.derbymuseums.org/thesilkmill/", "http://www.abbeyinnderby.co.uk/", "http://www.forgederby.com/", "http://www.thesilkmillderby.co.uk/", "https://www.facebook.com/FurnaceInn?rf=124003337741858", "http://www.english-heritage.org.uk/visit/places/nine-ladies-stone-circle/", "http://www.pinterest.com/pin/create/button/?description=The+Farmhouse+at+Mackworth%2C+Derby%3A+hotel+review&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Faug%2F01%2Ffarmhouse-bolthole-mackworth-derby-hotel-review&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F30%2F1438253129212%2F427e56ef-12c8-4188-bd2b-4af4fccdb528-2060x1373.jpeg", "http://thefarmhouseatmackworth.com/"], "published": "2015-08-01T15:00:00.000+03:00", "crawled": "2015-08-02T01:20:50.539+03:00", "highlightTitle": ""}