{"organizations": [], "uuid": "ed455ca567e8fbfaca42dd454619d97cb5c512b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/images6-300x147.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/thai-confident-visitor-numbers-to-cross-target-of-28-8-million/", "country": "US", "title": "Thai Confident Visitor Numbers To Cross Target of 28.8 MillionTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Thai Confident Visitor Numbers To Cross Target of 28.8 MillionTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "ed455ca567e8fbfaca42dd454619d97cb5c512b8"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/thai-confident-visitor-numbers-to-cross-target-of-28-8-million/", "ord_in_thread": 0, "title": "Thai Confident Visitor Numbers To Cross Target of 28.8 MillionTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thai Confident Visitor Numbers To Cross Target of 28.8 Million Published on : Thursday, August 13, 2015\nThe Thai government is confident that the number of visitors to the country will exceed its target of 28.8 million this year as the country has already welcomed 17.5 million visitors from January to July, Thai News Agency (TNA) reported.\nMore Chinese nationals are also expected to arrive during the National Day Golden Week holiday in China, Deputy Governor spokesman Sansern Kaewkamnerd said.\nHe said that Thailand earned 818.44 billion baht (100 baht = RM11.3) from the tourism industry from January to July.\nHe said the authorities expected that throughout this year 29 million-30 million travellers would visit Thailand, exceeding the target of 28.8 million visitors and that national income from tourism should rise from 1.4 trillion baht as earlier anticipated to 1.6-1.8 trillion baht.\n“On the long holidays from Oct 1 to 7 to celebrate the Chinese “Golden Week” National Day, the number of visitors to Thailand should soar from 500,000-600,000 to 800,000-900,000 a month.\n“Baht appreciation also easily convinces travellers to come to Thailand. Due to the recovery of the US economy, the number of American visitors to Thailand should increase from 700,000 to 1,200,000 yearly. They usually stay in Thailand for 14-15 days and generate income for Thailand and Thai travel operators,” Maj Gen Sansern said.\nHe also said that Thai tourists made 139 million local trips in the first seven months of this year and generated tourism-related income worth 400 billion baht compared with the yearly income target of 800 billion baht.\nTo reach the target, he urged Thai travelers to visit local destinations and exercise their tax deduction rights with up to 15,000 baht of their traveling expenses until this year’s end.\nMaj Gen Sansern also encouraged government agencies and local administration organisations to hold seminars and inspection trips in the country to stimulate the national economy.", "external_links": [], "published": "2015-08-13T03:00:00.000+03:00", "crawled": "2015-08-14T06:10:38.359+03:00", "highlightTitle": ""}