{"organizations": [], "uuid": "9b2fdf8a6f553b3ae98a6c6d8f6352d4851edf72", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/never-displayed-photos-letters-from-ny-museum-tell-of-louis-armstrongs-new-orleans-life-320419642.html", "country": "US", "title": "Never-displayed photos, letters from NY museum tell of Louis Armstrong's New Orleans life", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Never-displayed photos, letters from NY museum tell of Louis Armstrong's New Orleans life - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-08-02T13:05:00.000+03:00", "replies_count": 0, "uuid": "9b2fdf8a6f553b3ae98a6c6d8f6352d4851edf72"}, "author": "Janet McConnaughey, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/never-displayed-photos-letters-from-ny-museum-tell-of-louis-armstrongs-new-orleans-life-320419642.html", "ord_in_thread": 0, "title": "Never-displayed photos, letters from NY museum tell of Louis Armstrong's New Orleans life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS - A century after the teenage Louis Armstrong's first pro gig at a honky-tonk, an exhibit about the jazz singer and trumpeter's complicated relationship with his hometown is opening in a state museum in New Orleans' French Quarter.\nThey include photographs of notebook pages in which Armstrong tells of a racist radio announcer who refused to introduce him in 1931, during his first trip back to New Orleans since he left for Chicago's music world in 1922.\nArmstrong wrote that when his manager told him about the refusal, he told the band, \"Give me a big chord.\" That got the crowd into their seats, he wrote, and when he stepped from the bandstand onto the floor, he got a 10-minute ovation.\nThe radio announcer was flabbergasted, Armstrong wrote, adding, \"Of course he was fired the minute the show was over.\"\nPapers, photos and recordings from the Louis Armstrong House in New York make up most of the exhibit, which fills two rooms in the Old U.S. Mint, across the hall from rooms with other musicians' instruments, including Fats Domino's white Steinway grand piano. The exhibit opened Wednesday as part of the Satchmo Summerfest music festival and runs through January.\nMany of the 80 photographs, letters, private recordings and other artifacts have never been displayed, said Jennifer M. Walden, spokeswoman for the New York museum. It has very limited display space, so they've been kept in the archives at the City University of New York, she said.\nOne is a 1952 letter in which Armstrong describes the thrilling experience of being king of the Zulu Social Aid and Pleasure Club in its parade three years earlier. Other African-Americans roundly criticized Armstrong for that appearance because the Zulu parade krewe's makeup harkens back to minstrel blackface.\nThere's also documentation about 10 years during which Armstrong stayed out of Louisiana because state laws made it illegal for his two white players to perform with their black band members.\nThe battered, misshapen cornet that Armstrong played at the Colored Waifs' Home — an orphanage to which he was sentenced after being arrested for shooting a gun to celebrate the new year in 1912 — and his gleaming gold last trumpet hold the floor in the exhibit's second room.\nArmstrong wrote in his 1950s autobiography, \"Satchmo: My Life in New Orleans,\" that he earned money as a child by singing tenor in a street quartet. He was on one of those excursions when he was arrested for shooting blanks from a revolver to celebrate the new year and was sent to the Colored Waifs' Home — where, he wrote in that book and often said, he first learned to play cornet.\nHe changed that story two years before his death, said Ricky Riccardi, Armstrong House archivist and exhibition curator along with Brynn White, also of Armstrong House.\nArmstrong wrote in 1969 that he worked as a child for the Karnofsky family, which owned a junk shop, doing numerous jobs that included blowing a toy tin horn to attract attention to its cart. When he saw a $5 cornet in a pawn shop, the family helped him buy it.\n\"People thought that it was my first horn that was given to me at the Colored Waifs ... But it wasn't,\" Armstrong wrote in one of the handwritten passages shown at the museum. The short memoir was published in 1999 as part of the book \"Louis Armstrong In His Own Words,\" Riccardi said.\nRiccardi said it is likely that Armstrong had played cornet a little when he went to the waifs' home and improved immensely with regular lessons there. Armstrong was 14 when he left that early form of juvenile detention, eventually returning to his mother's home in a tough neighbourhood known as the Battlefield.\nAccording to his autobiography, a friend there told Armstrong that a honky-tonk owner wanted a good cornet player: \"All you have to do is put on your long pants and play the blues for the whores that hustle all night.\"\n___\nOnline:\nhttps://www.louisarmstronghouse.org/\nhttp://louisianastatemuseum.org/\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-08-02T13:05:00.000+03:00", "crawled": "2015-08-02T22:27:05.027+03:00", "highlightTitle": ""}