{"organizations": [], "uuid": "3505fd0d19c6de23c8edacc6ec82aa29c5f554b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63008/el-nino-rains-threaten-tourism-eastern-african-states", "country": "US", "title": "El Nino rains threaten tourism in Eastern African states", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "El Nino rains threaten tourism in Eastern African states", "spam_score": 0.0, "site_type": "news", "published": "2015-08-26T03:43:00.000+03:00", "replies_count": 0, "uuid": "3505fd0d19c6de23c8edacc6ec82aa29c5f554b2"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63008/el-nino-rains-threaten-tourism-eastern-african-states", "ord_in_thread": 0, "title": "El Nino rains threaten tourism in Eastern African states", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "El Nino rains threaten tourism in Eastern African states   \nBy Apolinari Tairo, eTN Tanzania Correspondent | Aug 26, 2015 eTN   \nTANZANIA (eTN) - Weather and meteorological scientists in East Africa warned about possible heavy rains to hit this part of Africa next month. The scientists who are meeting in Tanzania’s capital city of Dar es Salaam have warned of possible El Nino rains and have warned residents and travelers booked to visit this part of Africa to be vigilant as these heavy downpours will destroy the communications network. \nTanzania Meteorological Agency (TMA) Chief Executive Officer Dr. Agnes Kijazi said the El Nino weather phenomenon was due to warming of the Pacific Ocean and is to affect the Eastern African region in September. She said a weather forecast had indicated a possible El Nino phenomenon. \nWeather scientists are participating at the two-day 41st Greater Horn of Africa Regional Climate Outlook Forum (CHACOF-41), that brought together weather experts from 11 countries in the Greater Horn of Africa (GHA), a region extending from Ethiopia to Tanzania, bordering the Indian Ocean coast. \nThe experts are planning and developing a joint consensus on the regional climate outlook for September to December 2015, the period which in this part of Africa experiences short rains. \nThey are meeting together discussing the theme, “The Provision of climate early warning for early action regarding expected 2015 El Nino impacts.” \nThe Kenya Meteorological Department has issued a warning to the Kenyan people, saying it was waiting to receive more reports of weather forecasts from scientists meeting in Tanzania. \nEl Nino hit East Africa in 1997 causing heavy rains, floods, as well as cholera and malaria outbreaks, while roads across the region were cut-off by heavy floods. \nTanzania had most of its roads leading to wildlife parks damaged, while airports were closed for landing and taking off for several hours. \nWeather experts have advised the Tanzanian government to take serious caution to avoid losses in transport and communication infrastructure which are poorly developed. Most roads in Tanzania are not paved to sustain heavy rains, while some paved roads are of poor standard. \nDar es Salaam airport, the main air connecting point in Tanzania, is poorly equipped with adequate facilities to control heavy rains and air traffic, and also to smoothly facilitate boarding and landing of passengers.", "external_links": [], "published": "2015-08-26T03:43:00.000+03:00", "crawled": "2015-08-26T05:25:05.177+03:00", "highlightTitle": ""}