{"organizations": [], "uuid": "0d3658794ea8703dc50dd4ad91494498fac1d6cf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29923024/team-penske-and-hertz-announce-special-paint-scheme-for-darlington-race", "country": "US", "title": "Team Penske And Hertz Announce Special Paint Scheme For Darlington Race", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Team Penske And Hertz Announce Special Paint Scheme For Darlington Race - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "0d3658794ea8703dc50dd4ad91494498fac1d6cf"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29923024/team-penske-and-hertz-announce-special-paint-scheme-for-darlington-race", "ord_in_thread": 0, "title": "Team Penske And Hertz Announce Special Paint Scheme For Darlington Race", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Hertz Corporation\nCompany Will Celebrate 1960s Shelby GT350H \"Rent-A-Racer\" Program\nMOORESVILLE, N.C. , Aug. 31, Team Penske and Hertz will debut a new livery on the No. 22 Ford Mustang driven by Joey Logano for the upcoming NASCAR Xfinity Series (NXS) event at Darlington Raceway on Saturday, Sept. 5 . As part of the overall throwback weekend at Darlington Raceway, the car's new paint scheme will be an ode to the famed Hertz / Shelby GT350H \"Rent-A-Racer\" program from the 1960s and will feature a black scheme with gold racing stripes.\nNearly 50 years ago, Carroll Shelby and The Hertz Corporation devised a popular plan to help get select high-performance, special-edition Shelby Mustangs into the hands of rental customers who also happened to be car enthusiasts. Ford supplied the new Mustangs with V-8 engines and mostly automatic transmissions while Shelby added extra performance and style, and Hertz gave the public access to the kind of unique driving experience that one would normally only find on a racetrack. Today, the story of the Shelby/Hertz \"Rent-A-Racer\" is legendary, and existing Shelby GT350H Mustangs are among the most sought-after collector cars in the world.\n\"We are excited to commemorate the famed Hertz/Shelby 'Rent-A-Racer' program that introduced car enthusiasts to the iconic Shelby Mustang five decades ago and is the forerunner to Hertz's Adrenaline collection of high-performance vehicles today,\" said Bob Stuart , Executive Vice President, Global Sales. \"Together with Team Penske, we will be honoring our unique history with Carroll Shelby while celebrating the legacy of the Ford Mustang driving experience.\"\nTeam Penske and Hertz have a successful history of collaborating on special paint schemes. In 2013, Logano drove a special-look No. 22 Mustang at New Hampshire Motor Speedway painted to mirror the limited-edition Hertz Penske GT that was debuted that same year and available from the Hertz Adrenaline Collection, similar to the \"Rent-A-Racer\" program.\n\"I'm pretty excited to run this special Hertz paint scheme,\" said Logano, a four-time NXS winner this season – his most recent coming at Watkins Glen International on August 8 as part of a weekend sweep that also saw Logano win the NASCAR Sprint Cup Series (NSCS) race on Sunday. \"Anytime you can get behind the wheel of a car that has a new look to it, people take notice. And the Hertz Rent-A-Racer car just looks fast. I think it will stand out, especially among all the cars that will have really cool throwback paint schemes that weekend in Darlington.\"\nDarlington is celebrating its race weekend with a retro feel across the board – including a special pre-race concert, unique logos, throwback souvenirs and more. A number of teams in both the NASCAR Sprint Cup Series and NASCAR Xfinity Series will run throwback paint schemes throughout the weekend.\nLogano has earned 25-career NXS victories, including one at Darlington in 2012. In eight races this season, Logano has won four times and finished in the top-five on six occasions. He's also earned four poles, giving him 30 in his career and moving him to second on the all-time NXS pole winners list. In addition to his success in the XFINITY Series this season, Logano has also earned three NSCS wins in 2015 and sits second in the point standings.\nThe NASCAR XFINITY Series VFW Sport Clips Help A Hero 200 will take place on Saturday, Sept. 5 at 3:30 pm ET . The race will be broadcast on NBC, with radio coverage on the Motor Racing Network and SiriusXM NASCAR Channel 90.\nAbout Team Penske\nTeam Penske is one of the most successful teams in the history of professional sports. Competing in a variety of disciplines, cars owned and prepared by Penske Racing have produced more than 400 major race wins, over 450 pole positions and 27 National Championships. The team has also earned 16 Indianapolis 500 victories in its storied history. Team Penske was also recently recognized by the Sports Business Journal as a finalist for the publication's prestigious annual Professional Sports Team of the Year award. For more information about Team Penske, please visit www.teampenske.com .\nAbout Hertz\nHertz operates the Hertz, Dollar, Thrifty and Firefly car rental brands in more than 10,300 corporate and licensee locations throughout approximately 150 countries in North America , Europe , Latin America , Asia , Australia , Africa , the Middle East and New Zealand . Hertz is the largest worldwide airport general use car rental company with more than 1,600 airport locations in the U.S. and more than 1,300 airport locations internationally. Product and service initiatives such as Hertz Gold Plus Rewards, NeverLost®, Carfirmations, Mobile Wi-Fi and unique vehicles offered through the Adrenaline, Dream, Green and Prestige Collections set Hertz apart from the competition. Additionally, Hertz owns the vehicle leasing and fleet management leader Donlen Corporation and sells vehicles through its Rent2Buy program. The Company also owns Hertz Equipment Rental Corporation (\"HERC\"), one of the largest equipment rental businesses with more than 350 locations worldwide offering a diverse line of equipment and tools for rent and sale. HERC primarily serves the construction, industrial, oil, gas, entertainment and government sectors. For more information about Hertz, visit: www.hertz.com .\nPhoto - http://photos.prnewswire.com/prnh/20150831/262227\nPhoto - http://photos.prnewswire.com/prnh/20150831/262228\nLogo - http://photos.prnewswire.com/prnh/20130620/NY35609LOGO\n releases/team-penske-and-hertz-announce-special-paint-scheme-for-darlington-race-300135261.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/team-penske-and-hertz-announce-special-paint-scheme-for-darlington-race-300135261.html", "http://photos.prnewswire.com/prnh/20150831/262228", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20150831/262227", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY90157&Transmission_Id=201508311127PR_NEWS_USPR_____NY90157&DateId=20150831", "http://www.hertz.com/", "https://photos.prnewswire.com/prnvar/20150831/262227", "http://www.penskeracing.com/", "https://photos.prnewswire.com/prnvar/20150831/262228", "http://photos.prnewswire.com/prnvar/20130620/NY35609LOGO", "http://photos.prnewswire.com/prnh/20130620/NY35609LOGO"], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-08-31T19:40:08.119+03:00", "highlightTitle": ""}