{"organizations": ["Hindustan Times"], "uuid": "6d8a77697a491ac1438bfe079930b50b48d22867", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/8/f5a374f2-c5f8-46d3-bbdd-0b1bf79641daMediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-ArtNews", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/art/new-apps-helping-tibetans-stay-connected-with-their-culture/article1-1378173.aspx", "country": "US", "title": "New apps helping Tibetans stay connected with their culture", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "New apps helping Tibetans stay connected with their culture", "spam_score": 0.0, "site_type": "news", "published": "2015-08-09T12:01:00.000+03:00", "replies_count": 0, "uuid": "6d8a77697a491ac1438bfe079930b50b48d22867"}, "author": "", "url": "http://www.hindustantimes.com/art/new-apps-helping-tibetans-stay-connected-with-their-culture/article1-1378173.aspx", "ord_in_thread": 0, "title": "New apps helping Tibetans stay connected with their culture", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Reetika Revathy Subramanian"], "text": "Reetika Revathy Subramanian, Hindustan Times | Updated: Aug 09, 2015 14:38 IST Delhi-based Dhondup Passang (in white) with the co-founders of Tibetan Kids, an app that helps teach the language to children living in exile. (HT Photo/ Saumya Khandelwal) \nEvery afternoon, the balcony of her home in Lhasa would turn into a battlefield as Tenzin Lhundup's grandparents played fierce games of Sho over cups of hot butter tea. She would play referee, mediating during the inevitable claims of cheating. \nThat was 15 years ago. Lhundup, 33, now plays the traditional Tibetan boardgame on a smartphone app in her new home, in Himachal Pradesh, the Indian base of Tibetans in exile. \n\"It feels different, but it makes me feel deeply connected to my grandparents, who are still back home in Tibet,\" she says. \nSho is among a bouquet of new apps helping Tibetans in exile stay connected with their culture through language, games and music. \nTibetan Kid, launched in July, helps children learn Tibetan through interactive games, animation, music and trivia; the year-old Tibetan Alphabet App is helping youngsters and even the middle-aged learn Tibetan through quizzes, practice pads and a voice segment on pronunciation; and Sho, launched in 2013, is helping new generations discover a traditional game. \nSimilarly, traditional Tibetan music, prayers and even recipes are available on apps such as Tibetan Picture Dictionary, launched this year; 21 Tara Prayer App, launched last year; and Tibetan Music Videos, launched in 2012. \nThere's also YakChat, launched in 2013 as an alternative to the Chinese WeChat, which offers messaging services in Tibetan and has become particularly popular among activists. And Tibetan News App, launched in 2012, which provides regular news updates. \n\"Technology has grown to become a very powerful medium to help preserve and document Tibetan literature and culture,\" says app developer Tashi Nangchen, 42, founder of 21 Tara Prayer, Tibetan Music Videos and Tibetan Picture Dictionary. \"It keeps the community together.\" \nThis is particularly significant for a community that has been scattered around the world ever since 1959, when the Tibetan spiritual and political leader, the Dalai Lama, fled to India following a failed uprising against Chinese occupation. In the mid-1980s, a second wave of Tibetans followed. Now, in the face of an onslaught of Mandarin-medium schools and Han Chinese immigrants back home, the apps are a new generation's way of keeping a culture alive in exile. \nTibetan Kid, for instance, was created by Delhi-based app developer and Tibetan in exile Dhondup Passang, 27, with three friends. \"Our aim is to reach out to children born in exile,\" he says. \"It is really important for them to know our native language.\" \nThe apps' creators say the response to their initiatives has been heartening, suggesting that their mission in creating them - of preserving and promoting Tibetan culture - is being met. Tibetan Kid was downloaded more than 500 times in the first week after its launch. Sho has been downloaded more than 10,000 times. \n\"I believe that our culture is in danger,\" says Tenzin Tselha, 26, programme director at Students for a Free Tibet - India, who uses the Tibetan Alphabet App. \"Using technology in order to preserve our own culture is a form of creative resistance to oppression. While the struggle remains the same, the forms of expression have changed with time.\" Tags", "external_links": [], "published": "2015-08-09T12:01:00.000+03:00", "crawled": "2015-08-09T19:40:28.722+03:00", "highlightTitle": ""}