{"organizations": [], "uuid": "fa2bf3ad11ffedbc60c4928b99f2c94b34e7c7df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tips/6-easy-ways-to-avoid-fraud-abroad/ar-BBlq9Ar", "country": "US", "title": "6 Easy Ways to Avoid Fraud Abroad", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "6 Easy Ways to Avoid Fraud Abroad", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "fa2bf3ad11ffedbc60c4928b99f2c94b34e7c7df"}, "author": "Justin Grudzien , Orbitz.com", "url": "http://www.msn.com/en-us/travel/tips/6-easy-ways-to-avoid-fraud-abroad/ar-BBlq9Ar", "ord_in_thread": 0, "title": "6 Easy Ways to Avoid Fraud Abroad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "6 Easy Ways to Avoid Fraud Abroad The Huffington Post 5 hrs ago Justin Grudzien , Orbitz.com\n© AP Photo/Daniel Ochoa de Olza Travel should be about fun, sun and relaxation, not worrying about where your credit card info or personal identity might end up. The only risks you should be taking on vacation involve a second--or maybe third--round of margaritas poolside. Here's how to protect yourself and keep your identity safe, according to Justin Grudzien, Chief Information Security Officer at Orbitz Worldwide.\n1. Don't brag on social media... until you're back.\nThis is going to be unpopular, but don't tell all your Facebook, Twitter and Instagram followers that you're going on this great trip to Paris and will be gone all week. There used to be a website called PleaseRobMe.com. It effectively mined data from social media and told you when people would be away from their home for a while. It's likely that sites like this still exist, but don't stop posting altogether -- you also don't want to suggest that you're gone by not posting anything at all. Once you're back, those travel photos are fair game; post all you want!\n2. Take only what you need on vacation.\n© Tanya Constantine/Blend Images/Corbis The number one thing to protect is your passport or ID. I only travel with one piece of identity, and leave things like medical and social security cards at home. That way, should something get stolen, the damage is as limited as possible. Also, I bring two credit cards: one that I use, and another that I keep locked in the hotel safe, just in case I lose the other one or it gets stolen.\n3. Avoid the scan scam.\nMost passports these days are RFID-enabled, which helps you get through customs faster. But these can be easily scanned from afar without you noticing. Luckily, there are certain kinds of secure holders that will protect your documents from this, so I definitely recommend getting one of those. I would also keep such documents on your person at all times.\n4. Help your credit card companies help you.\n© OJO Images/REX Inform your credit card companies if you're traveling internationally. First and foremost, call your credit card companies. All of them. Credit card companies have fraud systems, and they monitor your spending patterns. So if you're traveling internationally, credit card companies need to know -- if they start to see transactions in, say, London, they might shut you down. And that could be a major burden on you.\n5. Wear it well.\nBe aware of your surroundings, and keep your important documents in your front pockets instead of back pockets, since it's a lot harder to get something out of a front pocket without you noticing. The same goes for purses -- try to always carry something with a cross-body strap, and to keep your purse in front of you. And keep everything else that you don't need locked in the hotel safe.\n6. Keep an eye on your accounts.\n© Helen King/Corbis All the big credit-monitoring companies -- Experian, Transunion, Equifax -- have three-in-one credit monitoring. Sign up for one of these to get alerts, and keep an eye on major changes to your balances, or any accounts in your name that may spring up once you've returned home. And, of course, call your bank to let them know you're back and to keep an eye out for any suspicious foreign charges.\n ", "external_links": ["http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBlq9Ar%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlpWGN.img&description=Woman+packing+suitcase+on+bed+-+Tanya+Constantine%2fBlend+Images%2fCorbis", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBlq9Ar%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlpWJv.img&description=Businessman+handing+waitress+credit+card+in+restaurant+-+OJO+Images%2fREX", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBlq9Ar%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlq4ln.img&description=Tourists+-+AP+Photo%2fDaniel+Ochoa+de+Olza", "http://www.huffingtonpost.com/?ncid=txtlnkusaolp00000618", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fBBlq9Ar%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fBBlq4tP.img&description=Businessman+checks+text+messages+on+cell+phone+-+Helen+King%2fCorbis"], "published": "2015-08-05T03:00:00.000+03:00", "crawled": "2015-08-05T20:59:55.452+03:00", "highlightTitle": ""}