{"organizations": ["Fayetteville", "Fayetteville Area Convention & Visitors Bureau"], "uuid": "e2e799f5aa35186ee4ddb21e62e781ae2ede7a3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/337000?filename=337000.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/08/05/758092/10144803/en/Legions-of-Special-Guests-Highlight-The-Fayetteville-ComicCon-October-17.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "Legions of Special Guests Highlight The Fayetteville ComicCon October 17", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Legions of Special Guests Highlight The Fayetteville ComicCon October 17", "spam_score": 0.0, "site_type": "news", "published": "2015-08-05T16:06:00.000+03:00", "replies_count": 0, "uuid": "e2e799f5aa35186ee4ddb21e62e781ae2ede7a3f"}, "author": "", "url": "http://globenewswire.com/news-release/2015/08/05/758092/10144803/en/Legions-of-Special-Guests-Highlight-The-Fayetteville-ComicCon-October-17.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "Legions of Special Guests Highlight The Fayetteville ComicCon October 17", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Legions of Special Guests Highlight The Fayetteville ComicCon October 17 ET | Source: Fayetteville Area Convention & Visitors Bureau photo-release \nFAYETTEVILLE, N.C., Aug. 5,   The Walking Dead, a legion of comic book creators, vampire artists and the area's leading nerds, geeks, fanboys and fangirls will be converging on Fayetteville's Crown Expo Center for the Fayetteville Comic Con on Saturday, October 17. The first annual event will include two cosplay contests; video game, Magic the Gathering, and Yu-Gi-Oh tournaments; Geek Trivia Contests; panel discussions and a special martial arts demonstration comparing the martial arts of the movies to the real-life styles. According to show organizers, the Fayetteville Comic Con will be fitting in more events in one day then found in many two or three-day conventions. There will be lots of guests signing autographs and interacting with their fans, including: \n- At least five actors seen on The Walking Dead, including Santiago Cirilo, who played Julio on Season Four, and Andrew Jenkins, who played the Gas Mask Zombie (and actually has his own action figure!) - Batman and Star Trek writer Mike W. Barr from Ohio, making his first appearance in the Carolinas. - Vampirella, Conan and Avengers artist Rudy Nebres, from New Jersey who is also making his first appearance in the Carolinas. - Georgia resident Wayne Vansant, a Vietnam-era Navy Vet who has drawn Savage Tales and 'Nam for Marvel Comics and is well known for his realistic portrayals of war. - And dozens of other comic book artists and writers, plus a surprise guest or two. We even expect appearances from Scooby Doo's Mystery Machine and KITT from Knight Rider! Fans are welcome to come as themselves, but organizers are expecting hundreds of attendees to dress as their favorite superhero, Star Wars or anime character, or -- who knows what? Cosplay Guest of Honor Mikomi Chan from Virginia will help judge our two cosplay contests. The Junior Division Competition is for those age 15 and under and everyone 16 and over will complete in the Senior Division. Prizes include gift certificates and trophies for the juniors and cash prizes for the older competitors, plus a special prize for the best Active Military costume. Admission is only $10 in advance, $12 at the door, with discounts to Active Military. Children 10 and under are admitted free with a paying adult. Tickets are available at the Crown Center Box Office and Dragon's Lair Comic Book Store on Yadkin Road. For more information on Fayetteville ComicCon, call the convention organizers at 910-316-7251 or go to www.fayettevillecomiccon.com . Need a hotel room? Looking for a great place to have dinner after the show? www.VisitFayettevilleNC.com has information on hotels, restaurants and more. Tweet This: #WalkingDead actors, Star Trek writer highlights of first #Fayetteville ComicCon Oct 17 at @CrownComplexNC . Learn more: http://bit.ly/1ONFTMV Pictures for Promotional Use: http://bit.ly/1ONFjPe ABOUT THE FACVB The FACVB is a private, not-for-profit organization responsible for positioning Fayetteville/Cumberland County as a destination for conventions, sporting events and individual travel. For additional information, visit www.VisitFayettevilleNC.com or call 1-888-98-HEROES. Fayetteville/Cumberland County is the America's first military sanctuary. \nA photo accompanying this release is available at: Melody Foote Fayetteville Area Convention & Visitors Bureau 245 Person Street Fayetteville, NC 28301 Related Articles", "external_links": [], "published": "2015-08-05T16:06:00.000+03:00", "crawled": "2015-08-05T16:31:01.573+03:00", "highlightTitle": ""}