{"organizations": [], "uuid": "5d069f76b4374a7ed3e4ebe804aa1e3cb97b7fb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/08/9954275ed4bc4e5c89191da574b7b2a9-1200x630.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/nation-world/state-of-emergency-declared-in-florida-tropical-storm-nears/", "country": "EU", "title": "Florida keeps eye on Tropical Storm Erika, could hit Monday", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Florida keeps eye on Tropical Storm Erika, could hit Monday | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T15:00:00.000+03:00", "replies_count": 0, "uuid": "5d069f76b4374a7ed3e4ebe804aa1e3cb97b7fb2"}, "author": "TAMARA LUSH", "url": "http://www.seattletimes.com/nation-world/state-of-emergency-declared-in-florida-tropical-storm-nears/", "ord_in_thread": 0, "title": "Florida keeps eye on Tropical Storm Erika, could hit Monday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ST. PETERSBURG, Fla. — All of Florida is carefully watching Tropical Storm Erika as the disorganized system makes its way over Hispaniola.\nForecasters at the National Hurricane Center in Miami said that as of 11 a.m. Friday, the forecast showed the storm hitting the state Monday. The forecast path has Erika skirting the state’s Gulf Coast and then moving up Florida’s spine north of Tampa.\nThe next 24 hours will be critical in the storm’s development, hurricane center meteorologist James Franklin said.\n“The trend is for a gradual lessening,” he said. “Yesterday we were talking about a hurricane; today we’re talking about a tropical storm.”\nMost Read Stories Mariners fire general manager Jack Zduriencik Now comes the hard part for the Mariners: Hiring Jack Zduriencik’s replacement Mariners demote struggling catcher Mike Zunino Why Russell Wilson needs to water down his Recovery claims Animated map: How the wildfires in North Central Washington have grown over time There’s still uncertainty in the track because Hispaniola’s mountains could disrupt or break up the storm. And it is too early to tell whether the storm will bring flooding to areas of the Tampa Bay region that experienced problems in recent weeks due to heavy rain, Hurricane center spokesman Dennis Feltgen said.\n“It’s way too early to tell how much rainfall we’ll see in Florida,” Feltgen said.\nFeltgen said that the entire state of Florida, along with parts of Georgia and South Carolina, could see heavy rain in the coming days.\nSome rain would be welcome in South Florida, where there’s been a drought. But Feltgen said that a lot of rain all at once in a dry area would also cause problems.\nIn the Tampa Bay area, counties that were hit hard by recent rainstorms are watching the storm carefully. Pasco County received record levels of rain in July and August — and it wasn’t even from a tropical storm or hurricane. FEMA is still doing damage assessments there, and a few dozen homes were destroyed.\nMeanwhile, emergency managers aren’t taking any chances. Several counties around the state opened sandbag filling stations for residents worried about flooding.\nFlorida Gov. Rick Scott said Friday that Tropical Storm Erika poses a “severe threat to the entire state” and declared a state of emergency.\nScott made his declaration shortly after forecasters adjusted the trajectory of the storm to show that it’s predicted to strike the southern tip of the state and then traverse northward.\nThe declaration ahead of time gives wide latitude to Scott and other state officials to prepare for the storm. The order calls for the activation of the National Guard and gives authorities the ability to waive tolls and rules to allow emergency crews and vehicles to move throughout the state.\nA hurricane hasn’t hit Florida in 10 years. The latest forecasts show that Erika will remain a tropical storm when it makes landfall.\nScott said this week that the state has been fortunate in recent years, but he urged Floridians to watch the news and prepare for the worst. Some parts of the state are still recovering from heavy rains that caused flooding this summer.\nOn Friday, Erika lashed Puerto Rico with wind and rain and had killed at least four people. The storm was about 90 miles east-southeast of Santo Domingo, Dominican Republic, and was moving west at 17 mph with maximum sustained winds of 50 mph.\n___\nAssociated Press reporters Tony Winton contributed from Miami and Gary Fineout from Tallahassee.\n___\nFollow Tamara Lush on Twitter at http://twitter.com/tamaralush\nTAMARA LUSH", "external_links": ["http://twitter.com/tamaralush"], "published": "2015-08-28T15:00:00.000+03:00", "crawled": "2015-08-29T15:33:46.759+03:00", "highlightTitle": ""}