{"organizations": [], "uuid": "a1082f9128d7076f42da69702c71a03050b691dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/08/19/12/2B3EBEEE00000578-0-image-a-12_1439982475703.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3203310/Magaluf-crime-gang-arrested-swindling-drunk-tourists-320k-cloning-bank-cards.html", "country": "GB", "title": "Magaluf crime gang arrested for 'swindling drunk tourists out of £320k'", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Magaluf crime gang arrested for 'swindling drunk tourists out of £320k' | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T21:05:00.000+03:00", "replies_count": 1, "uuid": "a1c5b83068cd21a3944b06e91bace7f52e43b5b1"}, "author": "John Hutchinson for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3203310/Magaluf-crime-gang-arrested-swindling-drunk-tourists-320k-cloning-bank-cards.html#post-0", "ord_in_thread": 0, "title": "Magaluf crime gang arrested for 'swindling drunk tourists out of £320k'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "40 shares 1\nView\ncomments\nA criminal gang who preyed on drunk tourists by cloning their bank cards at the holiday resort of Magaluf have been arrested by Spanish police.\nHolidaymakers were conned out of thousands of euros after the gang stole their credit card numbers.\nThe ring would steal the codes of the credit cards of customers of bars on the beach resort in Majorca, which is known for its excesses of alcohol and sex, and sometimes clone the cards, the interior ministry said.\nParty time: In just a few hours, the streets will be packed with holidaymakers making the most of drinks deals\nThe main victims were tourists from Britain and Scandinavia 'who were intoxicated, since in this state it is easier to trick them to obtain the security codes of the cards or to carry out a series of charges of a high amount,' it said in a statement.\n'The amount swindled amounts to over 45,000 euros (£320,000), although it is suspected that it could be higher since many victims have not filed a complaint,' it added.\n Next Silent baggage carousels, seats covered in dust... and the... Stunning mountains, lush rainforests and iconic landmarks:... Incredible pictures of the world's most breathtaking... Deadly jellyfish with tentacles the length of FIVE London... 40 shares Police detained four men and 16 women as part of their operation, which involved searches of four bars in Majorca, including two owned by the suspected leader of the ring.\nMagaluf, where some 85 per cent of holidaymakers are British or Irish nationals, made global headlines last year after a video showing a young woman performing oral sex on several men on the dance floor of a nightclub went viral.\nThe group were able to target drunk or incapacitated tourists and steal or clone their cards\nLocal authorities subsequently introduced new rules regulating pub crawls and have also banned 'balconing' - jumping from one apartment balcony to another or into a swimming pool - after several deaths in recent years.\nLast week two British police officers joined their Spanish counterparts in patrolling the streets of Magaluf in a bid to tackle disorderly British holidaymakers.\nBRITISH POLICE PATROLLING THE STREETS OF MAGALUF British police officers have started patrolling the streets of Magaluf as part of a two-week trial to help Spanish authorities deal with victims and offenders from the UK.\nThe two West Midlands Police officers stopped to speak to passers-by as they strolled through the popular party resort while revellers were seen sleeping off their hangovers nearby.\nIn just a few hours, the same streets will be packed with holidaymakers - including hundreds of Britons - taking advantage of cheap drink deals offered by dozens of bars and clubs.\nOn the beat: Two West Midlands Police officers are seen strolling along the quiet streets of the Spanish resort\nThe sergeant and the constable will work alongside officers from the Guardia Civil in Majorca before moving on to Ibiza for the second part of the scheme.\nLong popular with British tourists, the resort has struggled to deal with a recent increase in drunken and violent behaviour.\nBut a former policeman who spent the night in the resort of said he questioned whether the British officers, could be effective there, given that they will have no powers of arrest.\nBacking: A group of British holidaymakers said they thought sending the officers was a good idea\nMark Williams-Thomas said he believes that only a zero tolerance policy from the resort's bars and a more visible Spanish police presence on the streets will quell disorderly behaviour.\nHe added that he was worried for the safety of female revellers.\nSpeaking to This Morning , he warned that 'having no power,' will mean British police can do little to arrest the drunken antics.\n'I spent a night there, and got to bed about three o'clock, and it was a really different atmosphere, at times it was frightening,' he told the ITV programme. 'I was worried for the young women here, and there are very few police around.\n'British police have said they are sending two officers out, but we must remember that they have no power out here, so it's down to the Spanish police.'\nRead more: This Morning", "external_links": ["http://dailym.ai/1WEulS6", "http://www.itv.com/thismorning"], "published": "2015-08-19T21:05:00.000+03:00", "crawled": "2015-08-20T05:14:29.680+03:00", "highlightTitle": ""}