{"organizations": [], "uuid": "bdaeb6991f6dcf94051dd6242429c561c98e22d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/scotland/28056-studies-continue-to-show-that-sustainability-standards-have-measurable-positive-impact-on-performance", "country": "US", "title": "Studies continue to show that sustainability standards have measurable positive impact on performance", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Studies continue to show that sustainability standards have measurable positive impact on performance", "spam_score": 0.0, "site_type": "news", "published": "2015-08-04T17:15:00.000+03:00", "replies_count": 0, "uuid": "bdaeb6991f6dcf94051dd6242429c561c98e22d8"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/scotland/28056-studies-continue-to-show-that-sustainability-standards-have-measurable-positive-impact-on-performance", "ord_in_thread": 0, "title": "Studies continue to show that sustainability standards have measurable positive impact on performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Studies continue to show that sustainability standards have measurable positive impact on performance Studies continue to show that sustainability standards have measurable positive impact on performance Details Category: Scotland   15:15 Global ethical finance leaders to discuss the potential of ESG as a part of a global fiduciary standard The Global Ethical Finance Forum (GEFF), the much-awaited gathering of the global responsible finance and investments industry, has formally announced that this September it will play host to discussions on mainstreaming sustainability-focused investment practices. Global experts from key organizations such as Nordea Asset Management, Standard Life Investments, MSCI, and Arabesque Asset Management will demonstrate how incorporating environmental, social and governance (ESG) into investment practices can potentially improve performance while at the same time benefiting society at large. \nThe evolution of sustainability-focused investment practices has proceeded much more rapidly since the financial crisis upended financial markets and exposed the cost of unethical and socially detrimental business practices. During the same period, research into the financial impact of a sustainability focus has shifted dramatically. Previously, the key was identifying whether bringing values to finance—be it socially responsible or sustainability-focused—harms company performance. These days, discussions are more oriented around how these can proactively enhance performance. Research performed by the University of Oxford and Arabesque Asset Management looked at 190 empirical research studies. 90% of the studies found that “sound sustainability standards lower the cost of capital”; whereas 88% found that solid ESG practices translated into “better operational performance of firms”. This better operational performance also leads to better stock performance, suggesting that not only does ESG have benefits for firm performance, it is recognized in market valuations as well. Further studies delve deeper into the impact of applying ESG metrics to investment strategy. A 2014 analysis from Calvert Investments looks into the effectiveness of incorporating non-financial factors related to ESG and found that not only do better rated companies on ESG metrics have better stock performance, the best performing stocks are for a basket of companies whose ESG metrics have improved the most. But Calvert did not stop with equities. In a separate analysis released at the end of 2014, they looked at individual ESG factors on fixed income investments. The greatest impact was from consideration of environmental and social factors. At GEFF 2015, leaders from both emerging and developed markets will showcase thought leadership and case studies. Participating at the historic forum will be Andreas Feiner, founder of Arabesque Asset Management, which co-authored the study with University of Oxford. He will discuss the importance of ESG factors to both implementing responsible investment ideas in practice but in delivering the highest risk-adjusted returns. Beyond the appeal of responsible investing as representing doing the ‘right thing’ for all stakeholders, the discussion will cover the question of whether the use of ESG should not just be encouraged but should be required for investment professionals bound by the fiduciary standard. The forum includes a panel on convergence across the ethical finance industry headed by Nadia Laine, Vice President, Head of Screening, MSCI with Sasja Beslik, Head of Responsible Investments, Nordea Asset Management, Hasan AlJabri, CEO, SEDCO Capital and Chairman, Sedco Capital Luxembourg, and Amanda Young, Head of Responsible Investment, Standard Life Investments. Furthermore, ESG screens and risk mitigation will be discussed in detail by panelists such as Edward Mason, Head of Responsible Investment, Church Commissioners for England, Andreas Feiner, Founding Partner and Head of Values-Based Research of Arabesque Asset Management, Martina Macpherson, Managing Partner, SI Partners - Oekom research UK and Brandon Davies, Independent Non-executive Director, Lintel Bank Ltd. Speaking in advance of the Forum, Edward Mason stated: \"At the Church Commissioners we believe that the way in which we invest is part of the witness and mission of the Church of England. At GEFF I'll present our comprehensive approach to responsible investment which has consistently delivered strong investment returns in a way that is in line with our values.\" GEFF 2015 will take place on the 1st and 2nd of September at the historic Balmoral Hotel in downtown Edinburgh, one of Europe’s cultural and literary capitals. Related articles Get hooked on the all new fishing programme at John O’Groats, Natural Retreats Summer is in full swing. Schools are out, temperatures are high and Natural Retreats have cast a whole new array of fishing adventures to em...", "external_links": [], "published": "2015-08-04T17:15:00.000+03:00", "crawled": "2015-08-04T17:16:28.786+03:00", "highlightTitle": ""}