{"organizations": [], "uuid": "d1562bc159f93ef1373f7a92c1613dad61abaca0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeasteurope.about.com", "main_image": "http://f.tqn.com/y/goeasteurope/1/S/9/c/-/-/Dubrovnik_Rooftops.jpg", "site_section": "http://z.about.com/6/o/m/goeasteurope_t2.xml", "section_title": "About.com Eastern Europe Travel: What's Hot Now", "url": "http://goeasteurope.about.com/od/seasona7/fl/Croatia-in-Autumn.htm", "country": "US", "title": "Warm Weather Lingers for Travelers to Croatia...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Warm Weather Lingers for Travelers to Croatia...", "spam_score": 0.0, "site_type": "news", "published": "2015-08-29T14:07:00.000+03:00", "replies_count": 0, "uuid": "d1562bc159f93ef1373f7a92c1613dad61abaca0"}, "author": "", "url": "http://goeasteurope.about.com/od/seasona7/fl/Croatia-in-Autumn.htm", "ord_in_thread": 0, "title": "Warm Weather Lingers for Travelers to Croatia...", "locations": ["Croatia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Les Haines"], "text": "Dubrovnik Rooftops. CC BY Les Haines \nCroatia is an excellent destination for autumn travelers. With its southern latitude and numerous attractions, a visit in September, October, or November is sure to be memorable. Weather \nWeather in Croatia varies depending upon whether you are in the north of the country or the south, on the coast or inland. For example, one major northern hub, Rijeka, sees average lows in September of around 60 degrees and highs in the 70s, but in November, lows can be around in the 40s with highs only in the 50s. Meanwhile, Dubrovnik , to the south, sees much warmer temperatures: highs in the 80s and lows in the 60s in September; lows in the high 50s and in the 70s in October; and lows in the 50s and highs in the 60s in November. Zagreb , Croatia’s inland capital, however, sees averages for this time of year that are similar to countries occupying more northern zones: lows in the lower 40s and highs in the upper 60s in September; lows in the 40s and highs in the 60s in October, and lows in the 30s and highs in the 40s in November. \nSticking to the coast may afford the least necessity to pack a wide variety of clothing, even if you are traveling from the Istrian region—which butts up against Slovenia’s short coastline—or to the popular resort and port city of Dubrovnik, the old city of which is Croatia’s biggest draw. Best options include clothing that will keep you dry, but not overly warm, and that can be layered to give you the most choices when enjoying sights, restaurant terraces, or walks along the beach. Events \nVarious annual events take place all throughout Croatia. See what’s on in the cities you plan to visit if you are interested in taking in local celebrations of culture, history, and talent. \nIn September, head to Pula for a well-established bass and dubstep festival called Outlook. While in Split , take advantage of the city’s yearly film festival to enjoy local and international films. Korčula welcomes the Korkyra Baroque Festival during this month, and Varaždin also has a Festival of Baroque Music. \nIn October, Zagreb celebrates its International Chamber Music Festival. In Istria, two seasonal food-themed festivals take place: one celebrating truffles and one celebrating chestnuts—sample these delicacies during this month as well as dishes made from them. And all over Croatia, October 18 th is International Cravat Day, marking Croatia’s invention of this important wardrobe accessory. \nThe Gastro Table Event in late October or early November allows visitors to Dubrovnik to sample a wide array of dishes from local chefs and their restaurants, who set up their tables along the Stradun. Hundreds of cities participate in Theater Night during this month, in which free and low-cost performances attract curious audience members. St. Martin’s Day is marked with the tasting of new wine in the northern, inland region of Croatia, and many restaurants have special offerings to pair with this annual event. Planning for Fall Travel \nMany people complain about Croatia’s crowds during summer. Though it gets overlooked by American travelers, Europeans have long been using Croatia as a dedicated vacation destination, and so its coastal cities and islands do see an influx of visitors wishing to take advantage of the waters of the Adriatic Sea and the sunshine of the coast. However, crowds die down during the fall season, meaning that visiting Dubrovnik or stopping by towns with Greek and Roman ruins is more pleasurable than they would be during the high season. However, it is still prudent to plan well ahead and make sure that you have rooms booked—smaller destinations have fewer options where hotels are concerned and popular destinations may have full hotels due to events or conferences. Related Articles", "external_links": [], "published": "2015-08-29T14:07:00.000+03:00", "crawled": "2015-08-30T03:53:37.748+03:00", "highlightTitle": ""}