{"organizations": [], "uuid": "3c3ee494e4c803accdf615fa3994e904c1c2ea23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goaustralia.about.com", "main_image": "http://f.tqn.com/y/goaustralia/1/S/n/3/1/Trinette-Reed.jpg", "site_section": "http://z.about.com/6/o/m/goaustralia_t2.xml", "section_title": "About.com Australia Travel: What's Hot Now", "url": "http://goaustralia.about.com/od/wheretostay/fl/The-little-known-secret-luxury-Australian-hotels-dont-want-you-to-know.htm", "country": "US", "title": "The little-known secret luxury Australian...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "The little-known secret luxury Australian...", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T14:08:00.000+03:00", "replies_count": 0, "uuid": "3c3ee494e4c803accdf615fa3994e904c1c2ea23"}, "author": "", "url": "http://goaustralia.about.com/od/wheretostay/fl/The-little-known-secret-luxury-Australian-hotels-dont-want-you-to-know.htm", "ord_in_thread": 0, "title": "The little-known secret luxury Australian...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Articles and Resources Trinette Reed/Getty Images \nI stumbled upon a secret a number of years ago that literally transformed my travel experience – and I’m keen as mustard to share it with the world, as it can have a huge positive impact on your hotel stay! \nIt adds so much value to your trip and yet, hotels seem almost reluctant to let you know about this fantastic service. So what is it that I’m referring to? \nI first learnt about the magic of the Executive Club when I got engaged many years ago, which my now-husband had arranged at a beautiful five-star hotel in Sydney, Australia . \nFor such a fancy affair, he booked into the fanciest suite he could find, which happened to come with an Executive Club swipe card. We had no idea what that meant at the time… But once that world was unlocked for us, we’ve never looked back! \n\nWhat is the Executive Club? \nThe Executive Club is the VIP lounge found in virtually all five-star hotels and resorts across Australia (and indeed, throughout the world). It gives hotel guests access to all manner of luxurious extras, including food and drinks, clothes pressing and even concierge services. \nOstensibly designed for the corporate set, the Executive Club offers a range of valuable benefits that usually include: Breakfast – either served in the executive club lounge, or in the hotel’s general buffet breakfast restaurant. Afternoon/high tea – two hours’ worth of cakes, sandwiches and other treats served with tea and coffee in the afternoon. Evening drinks – two hours’ worth of alcohol beverages (including wines, beers and house spirits) served with a selection of canapés. In this traveller’s experience, the canapés on offer during this spread can often substitute for dinner. Other benefits including light pressing or dry cleaning of garments, express check out, internet access, boardroom/meeting room facilities and more. \n\nHow much can you expect to pay? \nIt all sounds fabulous so far, am I right? And I bet you’re thinking it’s also fabulously expensive. But this is where savvy travellers can really squeeze a lot of value out of their hotel stay. \nI take my role as an Australian travel writer very seriously (yes, it’s a tough job, but someone’s got to do it…) and to that end, I’ve stayed at my fair share of five-star hotels over the years. \nWe have actually learnt that it’s a very cost-effective way to experience luxurious surroundings with delicious meals included, without breaking the bank. \nTake my recent jaunt at the Intercontinental Hotel at Sanctuary Cove on the Gold Coast, for example. \nWe booked a beautiful Executive Club suite overlooking the lagoon pool at the standard rate of $350, for our family of four: two adults and two small children, both aged under five. \nUpon checking in at 2pm, we instantly indulged in an afternoon of high tea, which included smoked salmon sandwiches, egg and lettuce wraps, scones with fresh jam and cream, and a platter of tasty cakes and treats. We were also served unlimited tea, coffee and soft drinks. \nNow, to book in for high tea at the hotel’s café would have set us back $45 per person. We were given high tea for three (we figured the children could share a serve!), giving our afternoon treat a value of $135. \n\nThe savings start to add up… \nLater that evening, we indulged in the drinks and canapés; kids aren’t permitted in the executive lounge after 5pm to ensure the enjoyment of other guests, so we pottered around in the bar area and travelled back and forth to the lounge for food and drinks. \nObviously, travelling with our kids meant we couldn’t indulge quite as much as we would have liked at the bar! But, we still managed a couple of glasses of wine each, lemonade and juice for the girls, and several plates of food including lobster spring rolls, pumpkin arancini balls, potato and sundried tomato salad, marinated roast vegetables, cheese and crackers and more. \nNeedless to say, it was more than enough food to satisfy all four of us for our evening meal. If I had to put a dollar value of it, we probably ate and drank our way through around $70 worth of drinks and savouries that night (although if we had a babysitting and weren’t restricted at the bar, that tab could have easily doubled!) \nThe following morning, we checked in for breakfast at the beautiful Cove Café, which serves limitless helpings of eggs, pancakes, waffles, yoghurt, toast and anything else your heart desires for your first meal of the day. Breakfast is usually $39 per adult, so we saved another $78 here, as it was included in our Club room rate. \nHow much value did we receive in total? \nHigh tea savings = $135 \nBuffet breakfast value = $78 \nTotal = $283. \nWe paid $350 for the room, and received $283 in value – without even accounting for our gorgeous accommodation. I don’t know any other hotels on the Gold Coast where you can book in for $67 per night, let alone five star hotels! \nSo next time you’re planning your accommodation, ask about the hotel’s executive or club rooms. You can often upgrade a pre-existing booking for as little as $100 per night, and benefits generally far outweigh the costs. Related Articles", "external_links": [], "published": "2015-08-11T14:08:00.000+03:00", "crawled": "2015-08-11T16:47:37.688+03:00", "highlightTitle": ""}