{"organizations": [], "uuid": "eb8e6e9d2487610179098d34b3a0f97893ffaca0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/5491231/allegent-air-niagara-falls*1200xx2700-1519-0-141.jpg", "site_section": "http://dayton.bizjournals.com/rss/feed/vertical_subtopic/65", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/kansascity/news/2015/08/11/kci-lands-new-airline-service-with-allegiant-air.html", "country": "US", "title": "KCI lands new airline service with Allegiant Air", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "KCI lands new airline service with Allegiant Air", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T18:31:00.000+03:00", "replies_count": 0, "uuid": "eb8e6e9d2487610179098d34b3a0f97893ffaca0"}, "author": "Austin Alonzo", "url": "http://www.bizjournals.com/kansascity/news/2015/08/11/kci-lands-new-airline-service-with-allegiant-air.html", "ord_in_thread": 0, "title": "KCI lands new airline service with Allegiant Air", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Allegiant Air, which has quickly grown to serve more than 100 destinations around the… more Allegiant Air is the newest airline to chart a course for Kansas City. On Tuesday, Allegiant Air announced it will start nonstop service from Kansas City to Orlando, Southwest Florida and Tampa in mid-November. The Las Vegas-based low-cost airline is operated by Allegiant Travel Co. (Nasdaq: ALGT). Starting Nov. 12, Allegiant, formerly known as WestJet Express, will fly from Kansas City International Airport (Code: MCI) to St. Pete–Clearwater International Airport (Code: PIE) near Tampa. Starting Nov. 13, it will fly from Kansas City to Punta Gorda Airport (Code: PGD) near Punta Gorda, Fla., and Orlando Sanford International Airport (Code: SFB) in Sanford, Fla. All flights will be twice a week. Specific days and times of the flights were not disclosed in the release. It said flight information could be found on the company's website . Mark VanLoh , director of aviation for the Kansas City Aviation Department, said the decision is a testament to the strength of the Kansas City region. \"From the theme parks in central Florida to the award-winning beaches in Clearwater to Marco Island, the flights and vacation packages that Allegiant will offer to these three Florida destinations will certainly draw new passengers through our airport,\" VanLoh said in a release. Allegiant, founded in 1998, has quickly grown to serve more than 100 destinations around the country. The airline focuses on providing low-cost flights out of under-served airports to leisure destinations. \nWant Kansas City Travel news in your inbox? Sign up for our free email newsletters. Home of the Day", "external_links": [], "published": "2015-08-11T18:31:00.000+03:00", "crawled": "2015-08-11T18:57:58.549+03:00", "highlightTitle": ""}