{"organizations": [], "uuid": "1b16ee243eb18616e8266644bbf93929a8e0f52b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28503-the-appointment-group-australia-launches-tag-film-and-media", "country": "US", "title": "The Appointment Group Australia launches TAG Film and Media", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "The Appointment Group Australia launches TAG Film and Media", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T17:45:00.000+03:00", "replies_count": 0, "uuid": "1b16ee243eb18616e8266644bbf93929a8e0f52b"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28503-the-appointment-group-australia-launches-tag-film-and-media", "ord_in_thread": 0, "title": "The Appointment Group Australia launches TAG Film and Media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Appointment Group Australia launches TAG Film and Media The Appointment Group Australia launches TAG Film and Media Details Category: Hotel   15:45 The Appointment Group (TAG) has today announced the launch of its Film and Media division in Australia. TAG will be offering the Australasian market a first class service alongside its already established brands since opening its operation in Melbourne in January 2014 and Sydney later the same year. \nThis new division will give Film and Media clients access to special fares and hotel rates available only to those in the entertainment sector as well as TAG’s other negotiated fares and hotel rates worldwide. Film and Media clients will also have access to the 24 hour in-house emergency support, a service which is invaluable to an industry that never sleeps. TAG’s reputation for excellence has been built up from providing travel and logistics services to some of the highest profile entertainment professionals over the past 25 years. With a strong network of Film & Media clients already working with TAG, the new division, TAG Global Film & Media, enables us to provide our clients with a brand they can identify as a market leading specialist in this field. We believe this is a natural expansion for TAG and further emphasises us as the leading TMC across all entertainment sectors. Alli Pratt will be heading up TAG Film & Media in Australia. Alli has been working in the Entertainment sector for the past 20 years in travel, both in the UK and Australia. Over the years she has worked on numerous high-profile international projects and has been the Travel Manager for a large scale travel TV production company with extremely intricate itineraries. Her experience of Film & Media travel is second to none. Shane Barr, Managing Director - The Appointment Group Australia comments: “We are very excited about the official launch of TAG Film & Media here in Australia. With Alli leading the way and providing her expertise and knowledge, we’re very much looking forward to the division being a great success.” Related articles", "external_links": [], "published": "2015-08-27T17:45:00.000+03:00", "crawled": "2015-08-27T18:06:37.806+03:00", "highlightTitle": ""}