{"organizations": [], "uuid": "9eca214751ffce5a401992c7e6c75b2041fd26fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29786897/bitauto-announces-chief-financial-officer-andy-zhang-to-assume-additional-role-of-chief-operating-officer", "country": "US", "title": "Bitauto Announces Chief Financial Officer Andy Zhang to Assume Additional Role of Chief Operating Officer", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Bitauto Announces Chief Financial Officer Andy Zhang to Assume Additional Role of Chief Operating Officer - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-08-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "9eca214751ffce5a401992c7e6c75b2041fd26fc"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29786897/bitauto-announces-chief-financial-officer-andy-zhang-to-assume-additional-role-of-chief-operating-officer", "ord_in_thread": 0, "title": "Bitauto Announces Chief Financial Officer Andy Zhang to Assume Additional Role of Chief Operating Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Bitauto\nBEIJING , Aug. 14, 2015 /PRNewswire/ -- Bitauto Holdings Limited (\"Bitauto\" or the \"Company\") (NYSE: BITA), a leading provider of internet content and marketing services for China's fast-growing automotive industry, today announced the appointment of Mr. Andy Zhang to the position of chief operating officer in addition to his role as the Company's chief financial officer. In his expanded role, Mr. Zhang will take on additional responsibility for the Company's new business initiatives.\nMr. William Li , chief executive officer and chairman of Bitauto commented, \"We are delighted to announce that Andy will take on the additional role of chief operating officer. Since joining in 2006, Andy has been instrumental to Bitauto's success, and in his expanded role we look forward to benefiting further from his background and deep understanding of China's automotive industry.\"\nMr. Zhang has served as Bitauto's chief financial officer since 2009 and was the Company's vice president of finance from 2006 to 2009. Prior to joining Bitauto, Mr. Zhang also worked at Ernst & Young LLP and PricewaterhouseCoopers LLP from 2000 to 2004. Mr. Zhang received both of his Bachelor's degrees in Finance and Accounting from New York University , and is a certified public accountant in the state of New York.\nAbout Bitauto Holdings Limited\nBitauto Holdings Limited (NYSE: BITA) is a leading provider of internet content and marketing services for China's fast-growing automotive industry. Bitauto manages its businesses in three segments: its advertising business, EP platform business, and digital marketing solutions business.\nBitauto's advertising business offers a variety of advertising services mainly to automakers through its bitauto.com and taoche.com websites, which provide consumers with up-to-date automobile pricing and promotional information, specifications, reviews and consumer feedback. Bitauto's EP platform business provides web-based and mobile-based integrated digital marketing solutions to automobile customers in China . The platform enables dealer customers to create their own online showrooms, list pricing and promotional information, provide dealer contact information, place advertisements and manage customer relationships to help them reach a broad set of purchase-minded customers and effectively market their automobiles to consumers online. In 2014, the platform began providing automobile customers with additional transaction services, including automobile transaction, customer relationship management and automotive financing services, which are intended to optimize the automobile purchase experience and facilitate completion of transactions. Bitauto's digital marketing solutions business provides automakers with one-stop digital marketing solutions, including website creation and maintenance, online public relations, online marketing campaigns and advertising agent services.\nFor more information, please visit ir.bitauto.com .\nFor investor and media inquiries, please contact:\nChina\nIR Department\nBitauto Holdings Limited\nTel: +86-10-6849-2145\nir@bitauto.com\n releases/bitauto-announces-chief-financial-officer-andy-zhang-to-assume-additional-role-of-chief-operating-officer-300128670.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/bitauto-announces-chief-financial-officer-andy-zhang-to-assume-additional-role-of-chief-operating-officer-300128670.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=CN79733&Transmission_Id=201508140815PR_NEWS_USPR_____CN79733&DateId=20150814", "http://www.xmlnews.org/ns/", "http://ir.bitauto.com/"], "published": "2015-08-14T03:00:00.000+03:00", "crawled": "2015-08-16T14:59:12.190+03:00", "highlightTitle": ""}