{"organizations": [], "uuid": "93d7727c268960e0811ec1ab418bada0989f1607", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/travel-and-hospitality-industries-continually-evolving-322577141.html", "country": "US", "title": "Travel and hospitality industries continually evolving", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Travel and hospitality industries continually evolving - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-08-22T06:00:00.000+03:00", "replies_count": 0, "uuid": "93d7727c268960e0811ec1ab418bada0989f1607"}, "author": "Ron Pradinuk", "url": "http://www.winnipegfreepress.com/travel/travel-and-hospitality-industries-continually-evolving-322577141.html", "ord_in_thread": 0, "title": "Travel and hospitality industries continually evolving", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At the W hotel in Taipei, one of the feature cocktails is called the Woobar, made with vodka, Grand Marnier, and juices topped with honey.\nGuests in New York's upscale Waldorf Astoria often end the day with their Wax Poetic cocktail, made with Zabrowka bison grass vodka and honey syrup.\nAgree to reuse your room towels at the Mandarin Oriental property in Paris and you'll be rewarded with a jar of the fresh honey to take home with you.\nWhy the sudden interest in this extra sweet service?\nIt's been well publicized bee populations have been shrinking, believed to be caused by pesticide poisoning on farmlands. While this ensures better crops, other food sources and flowering plants that count on bee pollination are no longer thriving as they had in the past. As part of a commitment to get involved in turning around this trend, hotel brands around the world have become part of an important effort to address this eco-challenge.\nCanada's own Fairmont Waterfront in Vancouver has more than 500,000 honeybees on its third-floor terrace.\nLess than five kilometres from Buckingham Palace, the bees from the St. Ermin's Hotel apiaries gather nectar from more than 50 different plants.\nSo far, most of the hotels that have initiated bee protection programs are luxury properties. They tend to keep the harvested product for in-house food and beverage use. But, it is a trend catching support of the public and chefs, who seem to love cooking with this unique fresh product.\n\nItalian cruise line, Italian food\nOne of the complaints often heard from cruise passengers when they sail around exotic locations is while the on-board dining is almost always of the highest quality, the cuisine of the countries they visit are seldom on the menu.\nWhile owned by the large Carnival Cruise Corporation, the Costa Cruise division sails mainly as an Italian line. Most of the public is aware of the line only from the negative publicity it received when the Concordia hit a reef off the Italian shores a few years ago.\nBut, it is a quality line now in the process of reaching deeper into its Italian roots by building upon the country's reputation for fine dining.\nCosta has retained the services of Michelin-star chef Favio Cucchelli to introduce more authentic Italian cuisine into the sailings with a broad range of Italian dishes on both the lunch and dinner menus. Dishes from the various regions of Italy will be featured. From Sicily, a fillet of spatula will be served with sweet and sour red onion, raisins and Sicilian caponata. From the Lazio region, a rigatoni pasta dish will be punctuated with jowl bacon and Roman Pecoriano cheese cream to perk up the taste buds.\nWhile this is the direction the Costa line is taking, most other cruise lines are also finding new ways to satisfy the frequent (and new) cruisers' desire to have more interesting dining options. It is part of the cruising culture. Work up an appetite during the long days of shore excursions, return for a bit of relaxation, and then prepare for a sumptuous meal that keeps conversations lively around the dinner table.\n\nYou don't want to be eating this\nWith the sun destination booking season ready to move into full swing, Mexican authorities are working overtime to ensure the seaweed recently washed ashore along the Caribbean coast is cleaned up before the first wave of winter tourists arrive.\nThe problem is apparently caused by algae growing in the Sargasso Sea, a warm body of water in the middle of the North Atlantic Ocean.\nI had never heard of this seaweed before, but the people around Cancun, Playa del Carmen, and Cozumel certainly have. It gathers in mounds along the beaches and tends to inhibit the looks of the beaches more than cause other problems. About 5,000 temporary workers have been hired to make sure the beaches are back to pristine shape before the first planeload of Canadian and international visitors arrive.\n\nCanadian dollar attracting tourists\nWith a currency exchange rate seemingly sinking by the week, we may be not as enthusiastic to head south as we once were, but it is proving to be a boon for Canadian tourism.\nDestination Canada reports in May we had an increase of eight per cent in tourist visits over the same period last year. Significant numbers are coming from the United States.\nVisitors from overseas are also on the rise with increases of 16 and 17 per cent respectively from Japan and Germany. While the growth numbers may not be as high, most of our target market countries have delivered well this year. It may not be a banner year yet, but finally our tourist industry is experiencing growth.\n\nIf you have travel questions or comments send them to pradinukr@shaw.ca", "external_links": [], "published": "2015-08-22T06:00:00.000+03:00", "crawled": "2015-08-22T19:44:01.657+03:00", "highlightTitle": ""}