{"organizations": [], "uuid": "f4ef5b5de45834b11bfe7fb2e298fc7c0c1c2a21", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wcax.com", "main_image": "http://WCAX.images.worldnow.com/images/8520085_G.jpg", "site_section": "http://www.wcax.com/category/54431/travel-centers", "section_title": "Travel Centers - WCAX.COM Local Vermont News, Weather and Sports-", "url": "http://www.wcax.com/story/29741953/vt-leaders-react-to-barre-murder-berlin-deaths", "country": "US", "title": "Vt. leaders react to Barre murder, Berlin deaths", "performance_score": 0, "site": "wcax.com", "participants_count": 1, "title_full": "Vt. leaders react to Barre murder, Berlin deaths - WCAX.COM Local Vermont News, Weather and Sports-", "spam_score": 0.0, "site_type": "news", "published": "2015-08-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "f4ef5b5de45834b11bfe7fb2e298fc7c0c1c2a21"}, "author": "Anson Tebbetts", "url": "http://www.wcax.com/story/29741953/vt-leaders-react-to-barre-murder-berlin-deaths", "ord_in_thread": 0, "title": "Vt. leaders react to Barre murder, Berlin deaths", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BARRE, Vt. - Two towns, two crimes scenes. One at a new office building in Barre City where the mission is to help children. But Friday night, a social worker was gunned down as she left work.\nActing Governor Phil Scott can't understand the violence. He called the killing in Barre City an assassination.\n\"That is alarming, especially for this region. And there are a lot of people affected by this one way or another,\" said Scott, R-Vermont.\nIn Scott's hometown of Berlin, the focus is on three people found dead in a white farmhouse.\nThe deaths promoted the Gov. Peter Shumlin, D-Vermont, to cut short his summer vacation and return to Vermont to manage the events that have rocked this state.\nShumlin issued this statement:\n\"The Vermont State Police are working collaboratively with the Barre and Berlin police and the investigation remains ongoing. Vermonters should know that there is no indication of a broader threat at this time to state employees or the general public. The tragedy that has gripped our state over the past 20 hours is immense. In the coming days we will need to pull together as a state to come to terms with these heinous events. My heart goes out to all the families, friends, and loved ones who have been affected by these tragedies.\"\nMonday, many of those who are charged with helping families will face another challenge. Do they feel safe?\n\"This is something that is a change in the culture throughout the United States and we have seen it day in and day out in the United States, so it's touching Vermont in some way,\" Scott said. \"Again, we feel as we are above that in some way, but we have to be realistic and be concerned about that.\"\nSen. Bernie Sanders, I-Vermont, issued the following statement:\n\"Today is tragic day for Vermont. In the past 24 hours, a public servant was murdered and three other Vermonters were killed in circumstances that are not yet clear. My thoughts and prayers are with the victims' families and friends. As is always the case, I know Vermonters will rally together in the aftermath of this horrible tragedy because that is what we do in a crisis. I have contacted Gov. Shumlin and I am confident there will be a full investigation into what happened and why.\"\nRelated Stories:\n3 women found dead in Berlin related to Barre shooting suspect\nSurveillance video may show deadly Barre shooting\nVt. DCF worker shot and killed in Barre", "external_links": [], "published": "2015-08-08T03:00:00.000+03:00", "crawled": "2015-08-09T03:03:09.745+03:00", "highlightTitle": ""}