{"organizations": [], "uuid": "78053a9bfda35660720aea56fb29dabf7bda8098", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "//i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2015/8/7/1438957276967/Peter-Bradshaw-camping-010.jpg?w=1200&amp;q=85&amp;auto=format&amp;sharp=10&amp;s=6ffd5581075bc6408f465b39973d33bf", "site_section": "http://www.theguardian.com/travel/all", "section_title": "Travel | The Guardian", "url": "http://www.theguardian.com/lifeandstyle/2015/aug/07/a-film-critics-camping-debut-where-are-the-sporks", "country": "GB", "title": "A film critic’s camping debut: ‘Where are the sporks?’ | Life and style", "performance_score": 0, "site": "theguardian.com", "participants_count": 10, "title_full": "A film critic’s camping debut: ‘Where are the sporks?’ | Life and style | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-08-07T23:45:00.000+03:00", "replies_count": 9, "uuid": "bbb7c1b1c8f22b749c69c1d71a7c4d9bb2d5dad2"}, "author": "Peter Bradshaw", "url": "http://www.theguardian.com/lifeandstyle/2015/aug/07/a-film-critics-camping-debut-where-are-the-sporks#post-0", "ord_in_thread": 0, "title": "A film critic’s camping debut: ‘Where are the sporks?’ | Life and style", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "O ur 10-year-old son Dominic has been nagging us to take him on the annual group camping weekend in Ivinghoe Beacon, in the Chiltern Hills, organised by more outdoorsy families in his class. I have always treated this ridiculous idea with the same astonishment and disapproval as Dominic’s periodic demands for an iguana, which would supposedly live in his bedroom in its own large climate-controlled virarium. No! No way! Forget it! We do not own a tent or a sleeping bag, moreover neither my wife nor I can drive. And I am, in the immortal words of Woody Allen “at two with nature”. Sleeping in a tent? No bathroom? No fluffy white towels? No chocolate mint on my pillow, no warm building made of bricks and mortar? You have got to be kidding.\nMy memories of camping holidays are a succession of caravan trips when I was a teenager, which were fun, although I have had no desire to repeat the experience, still less downgrade it to shivering in some rain-lashed nylon tent.\nBut Dominic kept on and on, piteously claiming that he was being left out of all the fun. And we gave in and said yes, finally mollified by the fact that there would be a “pre-pitched” tent for us. But this would not be “glamping”. It would be unglamp. Instantly, I regretted this decision. My wife Caroline took charge of the whole operation and our visits to the camping shop for gear were like a nightmare: a keen assistant showed us Primus stoves and head torches. I tried out a sleeping bag on the floor, then and there, like a huge, nervous silkworm. The only purchase ideas I myself had were a charger pack for my iPhone and a special lighter for the stove I got from a legal-high accessories shop in Soho.\nFriday night arrived. We travelled in a sub-minibus size taxi all the way from London, an 80-minute journey about which I felt defiantly unashamed. Our assembled stuff totalled eight bags. Everyone else was driving, weren’t they?\nWe stumbled into a huge field filled with the cars and tents of strangers, whose existence we instantly feared and resented. Our tent looked … well, the brutal reality reasserted itself. It looked like a tent. An empty canvas space with three sort of inflatable beds. No inflatable minibar or inflatable trouser-press. We started to unpack all our stuff and assemble the stove and nifty collapsible kettle, and set out the mugs. I found myself saying things like: “Could you pass me that spork?” and “I think I’ll use a spork for my sausage” and “Oh Jesus, where are the sporks?” The first night, after a tasty group meal of fish and chips, I accidentally threw away the sporks in the bin by the grim loo and shower blocks and Caroline had to root around get them out.\nDominic ran off to play with all his friends, whose parents we know well and who were cheerfully welcoming and entirely at home in tents far more lived in, bigger and more sophisticated than ours. Their stoves were like sleek black units with two rings, like a DJ’s decks. Dominic would be off for hours at a time, and the interesting thing about family camping is that the children assert their independence and individuality, while the parents sort of rediscover theirs.\nPeter Bradshaw on a family holiday in 1970. One thing about camping that I can never get my head round is guy ropes. I’m used to buildings that you can walk out of and then round the side, as close to the wall as you like – without tripping up like a total prat. Having to step over guy ropes seems to me quite as objectionable as having to go round them. They create an evil disturbance in the ground’s forcefield, like landmines from some forgotten civil war. Inevitably, I did trip over one and felt at once idiotic and selfish, as if I was going to pull down the tent of some proper grownup camper’s tent.\nOver the fish and chips with all the other parents and kids that night, I relaxed. A bit. Then it came to bedtime. I didn’t know that you are supposed to wear all your outdoor clothes in your sleeping bag, along with three jumpers, socks and a woolly hat. Nobody explained. So I was freezing cold. Any time I was drifting off to sleep, a tiny movement would create a new leak of freezing air into my bag which felt like an icicle-jab. And there was that weird experience of hearing voices outside your tent, so close they sound like they are inside your head. Around 3am, I heard: “Shirley? Shirley? What are you doing, Shirley?” – as crisp and clear as if from a digital radio pressed to my ear.\nThe next morning it was a visit to the grim shower. What a leveller. You drag yourself there in your outdoor clothes-plus-jammies-plus-flipflops combo with washbag and a towel either flung over your shoulder or your forearm like a wine-waiter — a horribly infantilising desexing look. It makes everyone, of whatever age, look an 11-year-old hospital patient.\nBut we were past the worst. We’d sort of done it. The rest of the day was spent hanging out, sunbathing, walking. I got a horribly unbecoming brick-red sunburn. We gobbled mint-cake atop Ivinghoe Beacon. And I had to admit it: as a family, we bonded.\nWhen we all left, it was in a mood of exhaustion, satisfaction and mild hungover tristesse which I suspect is what everyone feels at the end of every group camping weekend. We climbed into our cab heading back for London, perfectly happy. It was great for us as a family, yes, yes, all right. But now I’d like a weekend trip to a luxury hotel in Antibes for comparison’s sake.", "external_links": [], "published": "2015-08-07T23:45:00.000+03:00", "crawled": "2015-08-07T19:38:51.479+03:00", "highlightTitle": ""}