{"organizations": [], "uuid": "3ff52f9092e89f0f8615261f3cb6074c58ceebee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62758/aviation-leaders-meet-develop-training-standards-plane-technicia", "country": "US", "title": "Aviation leaders meet to develop training standards for plane technicians", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Aviation leaders meet to develop training standards for plane technicians", "spam_score": 0.0, "site_type": "news", "published": "2015-08-19T03:25:00.000+03:00", "replies_count": 0, "uuid": "3ff52f9092e89f0f8615261f3cb6074c58ceebee"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62758/aviation-leaders-meet-develop-training-standards-plane-technicia", "ord_in_thread": 0, "title": "Aviation leaders meet to develop training standards for plane technicians", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aviation leaders meet to develop training standards for plane technicians   19, 2015 eTN   \nKANSAS CITY, MO - On Wednesday, a group of aerospace and aviation experts will launch an effort to create global training standards for technicians and other industry workers. The group meets at the Kansas City Marriott Downtown. This is the first new committee launched this year by ASTM International, one of the world's largest standards development organizations. \nCalled Committee F46 on Aerospace Personnel, the group aims to create consensus-driven standards that will help workers gain skills that adapt to new technologies and other advancements. The group also hopes that their efforts will strengthen the pipeline of workers due to the industry's aging workforce and the growing demand for air travel. Boeing, for example, recently announced that over the next 20 years, global aviation will add 38,000 planes requiring 600,000 more technicians. \nThe committee consists of a cross-section of industry, including manufacturers, suppliers, nonprofits, training institutes, governments and others. They are particularly interested in addressing the need for high-skilled workers in areas such as aircraft assembly, avionics, IT systems, repair stations and more. \nThe group's chairman, Sam Haycraft, a technician who founded jet-maintenance company West Star Aviation, says, \"Training standards need to reflect what technology is today, not what it was 40 or 50 years ago.\" \nThe committee – whose meeting coincides with National General Aviation Maintenance and Manufacturing Week – will develop standards that define core competencies, providing a baseline for education, testing and certification requirements. These standards will help employers by providing a uniform expectation of knowledge and skills while also supporting broader efforts to attract and retain workers. \nJim Sparks, an aviation maintenance professional on the committee, cites the U.S. Federal Aviation Administration's Next Generation Air Transportation System (NextGen) initiative as an example of why the group's work is crucial. He says, \"It has become increasingly critical for knowledge and skill standards to evolve in step with the rapid advancement in the aviation industry. Training, education and certification need to keep up.\" \nAlready, ASTM International has developed many standards in areas such as airplanes and jet fuel. In 2013, the National Center for Aerospace and Transportation Technologies became part of ASTM, providing a significant boost to ASTM's portfolio of personnel certification programs. \nHelping our world work better \nOver 12,000 ASTM standards operate globally. Defined and set by us, they improve the lives of millions every day. Combined with our innovative business services, they enhance performance and help everyone have confidence in the things they buy and use – from the toy in a child's hand to the aircraft overhead. \nWorking across borders, disciplines, and industries we harness the expertise of over 30,000 members to create consensus and improve performance in manufacturing and materials, products and processes, systems and services. Understanding commercial needs and consumer priorities, we touch every part of everyday life: helping our world work better.", "external_links": [], "published": "2015-08-19T03:25:00.000+03:00", "crawled": "2015-08-19T05:14:23.029+03:00", "highlightTitle": ""}