{"organizations": [], "uuid": "82b066b6292acee3428cf1750c98178e48752f68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/awards/28523-solihull-hotel-wins-global-award", "country": "US", "title": "Solihull hotel wins global award", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Solihull hotel wins global award", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T16:30:00.000+03:00", "replies_count": 0, "uuid": "82b066b6292acee3428cf1750c98178e48752f68"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/awards/28523-solihull-hotel-wins-global-award", "ord_in_thread": 0, "title": "Solihull hotel wins global award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Solihull hotel wins global award Solihull hotel wins global award Details Category: Awards Created   14:30 A leading Solihull hotel has won an international award for the high quality of its venue and customer service. The four-star Hogarths Hotel & Restaurant in Four Ashes Road, Dorridge, has been named the Best Luxury Hotel in the Midlands and the Consumer’s Choice Best Fine Dining for its Brasserie at the Global Product & Services Awards 2015. The awards, presented by the Corporate Vision Group, recognise the innovative efforts of staff which benefit their customers and make a difference in their industry. \nThe venue has grown over the last 11 years from a bed and breakfast to a 49-bedroom luxury hotel with conference facilities for up to 700 delegates, landscaped gardens, a lake and a private island. Steven Quick, the hotel’s general manager, said the award was testimony to the hard work and dedication of owners Helena and Andy Hogarth as well as the staff who place customer service at the heart of everything. “To be recognised globally as the Best Luxury Hotel in the Midlands as well as to receive an award for Best Fine Dining in our Brasserie is fantastic,” he said. “This success is another highlight of an amazing few years for Hogarths and is a reward for the hard work that the entire team has put into delivering excellent hospitality as well as the high standards of training that we invest in. “We pride ourselves on providing exceptional customer service whether guests are staying overnight, visiting for dinner, holding their wedding or visiting for a conference. “This is the cornerstone of all our services at Hogarths Hotel & Restaurant whether someone is visiting for the first time or are regulars. “As a small independent hotel operator we face tough competition in this region from national and international groups so this emphasises the high standard of care and thought which Helena and Andy Hogarth have put into refurbishing the hotel and improving its grounds. “Adding Hogarths Stone Manor Hotel in Stone near Kidderminster to our group in February this year has been a major success and we are keen to continue growing. “This news follows a number of awards that the hotel and the group have either won or been shortlisted for this year – and we are not stopping yet!”Pictured From the left, Hogarths Hotel & Restaurant’s general manager Steven Quick, reception manager Sarah Rotton, head chef Alex Alexandrov and restaurant manager Ellie Beattie with the international award from the Global Product & Services Awards 2015 Related articles", "external_links": [], "published": "2015-08-28T16:30:00.000+03:00", "crawled": "2015-08-28T17:48:26.339+03:00", "highlightTitle": ""}