{"organizations": [], "uuid": "315a431188d35ba08c1d6237c680f4825fe66b77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/06/Ryanair-Launched-an-enhanced-Groups-travel.jpeg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/ryanair-launches-new-daily-service-from-london-stansted-to-sofia/", "country": "US", "title": "Ryanair Launches new daily service from London Stansted to SofiaTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Ryanair Launches new daily service from London Stansted to SofiaTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "315a431188d35ba08c1d6237c680f4825fe66b77"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/ryanair-launches-new-daily-service-from-london-stansted-to-sofia/", "ord_in_thread": 0, "title": "Ryanair Launches new daily service from London Stansted to SofiaTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ryanair Launches new daily service from London Stansted to Sofia\nRyanair, announced it will launch a new daily service from London Stansted to Sofia, beginning in May 2016, which will go on sale from September. Sofia will be Ryanair’s second Bulgarian airport, following Plovdiv (which has a 4 times weekly service to London Stansted), and is another key primary airport, as Ryanair continues to expand Europe’s largest route network.\nRyanair celebrated its new London Stansted to Sofia service by releasing 100,000 seats for sale across its European network, at prices from £19.99 for travel in September and October. These low fare seats are available for booking until midnight Monday (10 Aug).\nRyanair’s Robin Kiely said:\n“Ryanair is pleased to announce a new daily London Stansted to Sofia route beginning May 2016, which will go on sale on www.ryanair.com in September. Sofia is another key capital city airport and our second in Bulgaria, as we continue to grow Europe’s largest route network, with more routes and flights and improved schedules.\nUK consumers already choose Ryanair for our low fares, industry leading customer service and great route choice. Now they can also book their flights even earlier on our improved website and app, carry a free small 2nd carry-on bag, enjoy allocated seats, avail of our new Family Extra and Business Plus services, and use their personal electronic devices at all stages of their flight, as Ryanair continues to deliver so much more than just the lowest fares – with much more to come.\nTo celebrate our new London Stansted to Sofia service, we are releasing 100,000 seats for sale across our European network from £19.99 for travel in September and October, which are available for booking until midnight Monday (10 Aug). Since these low amazing prices will be snapped up quickly, customers should log onto www.ryanair.com and avoid missing out.”", "external_links": [], "published": "2015-08-06T03:00:00.000+03:00", "crawled": "2015-08-06T21:19:39.840+03:00", "highlightTitle": ""}