{"organizations": [], "uuid": "17ac47b008ed91837120c0d7639120e23e804897", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/k/b/y/9/image.related.StuffLandscapeSixteenByNine.620x349.16kbpl.png/1440626115188.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/middle-east/71492169/The-old-US-embassy-museum-in-Tehran-Inside-the-US-den-of-espionage", "country": "AU", "title": "The old US embassy, museum in Tehran: Inside the 'US den of espionage'", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "The old US embassy, museum in Tehran: Inside the 'US den of espionage'", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T00:55:00.000+03:00", "replies_count": 0, "uuid": "17ac47b008ed91837120c0d7639120e23e804897"}, "author": "Sandra Hall", "url": "http://www.stuff.co.nz/travel/destinations/middle-east/71492169/The-old-US-embassy-museum-in-Tehran-Inside-the-US-den-of-espionage", "ord_in_thread": 0, "title": "The old US embassy, museum in Tehran: Inside the 'US den of espionage'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The old US embassy, museum in Tehran: Inside the 'US den of espionage' SANDRA HALL Last updated 09:55, August 27 2015 MORTEZA NIKOUBAZL/REUTERS \nAn Iranian cleric walks past a mural on the wall of the former US embassy in Tehran. \nIn Tehran, the abandoned US embassy has been turned into a museum that is rarely open to the public. But we're in luck, and treated to a tour with a young guide who loses no opportunity to expound on the sins of what is now known as the \"US den of espionage\". \nIt's a ghostly place, both forlorn and bleakly comic. The printers, shredders and encrypting machines have the dusty, derelict look of objects stuck in limbo. They're not old enough to be called antiques, but so hopelessly outmoded that they've become clunky symbols of a technological era so much less sophisticated than our own. They evoke thoughts of Ben Affleck's 2012 movie, Argo , which gave us Hollywood's view of the Iranian hostage crisis. It captured the frantic scramble to destroy the embassy's cache of classified documents before it was stormed in 1979 by a horde of angry students, who called themselves the Muslim Student Followers of the Imam's Line. \nA glass case contains photographs of the embassy staff on \"conquering day\", as the museum calls it. With hands on heads, a group is being led from the building. And alongside the image is a note conveying the heart-warming news that \"ladies and darks\" were released. \nWe now move on to the room where the shredding machines are kept. And here, again, are reminders of Argo and its scenes of the Iranians' attempts to put some of the shredded documents back together. Some, we're told, were completely destroyed but \"Imam's follower students\" managed to \"recycle\" others so that they could be read. \nA man walks past an Iranian version of the Statue of Liberty in front of the main building of the former US embassy in Tehran. Photo: RAHEB HOMAVANDI/REUTERS \nEn route to the encrypting machines, we pause to study a bizarre mock-up of an embassy meeting with a trio of waxy-looking mannequins standing in for the American officials. One stares at us glassily, his blonde wig standing on end as if still stiff from some long-ago windstorm. \nThese days, the embassy building is part of a training centre for the Revolutionary Guard; anti-American slogans are everywhere, along with elaborate wall murals. One depicts the Statue of Liberty with teeth bared in a wolfish snarl. Another has an Iranian soldier standing on a tattered US flag while an Iranian one flutters above him. On the pavement outside are drawings with lightning bolts slicing through the Star of David and the US flag's stars and bars. \nA woman walks past an anti US mural. Photo: RAHEB HOMAVANDI/REUTERS Ad Feedback \nA stone sculpture by the front door has another Statue of Liberty – a stone sculpture with a set of prison bars carved into its torso. And there are more wall murals, with teetering New York skyscrapers and smoke belching out of Uncle Sam's topper. \nWe've had some warning of all this. On the way to the embassy we pass two multi-storey buildings with skilfully executed paintings covering two entire walls. One has a US flag with a set of skulls where the stars should be and \"Down with the USA\" printed across the stripes. Another is a photo-realist portrait of Obama sharing a moment with the man said to have assassinated Hussein, the third Shia imam – one of the most revered figures in Shia history – in the year 680. \nREAD MORE: Cambodia's chilling house of terror, and why you must visit \nAll are in stark contrast to the friendliness that has greeted the Americans in our group in most of the places we've been. \nWhen we get to the Forgery Room, we find labels outlining the CIA's work in forging the passports of other countries, Australia among them, for entry into various parts of the Middle East. Then comes the Eavesdropping and Coding Room. Here, we're informed by more labels, \"phonelines relating to politicians, militaries, religious leaders\" were tapped and the results encoded. \nA man walks past an anti-US mural inside the former US Embassy in Tehran. Photo: RAHEB HOMAVANDI/REUTERS \nThen it's on to the inner sanctum – the sealed room from which messages were sent from the embassy to Washington. \nFinally, on the way out, we pass another glass case, containing a sobering sign headed, \"Students' Decision for Conquering Spying Nest\". There are three key reasons: the part the embassy played in encouraging anarchy and division; the need to prevent a coup d'etat like the one in 1953 when the CIA and MI6 engineered the overthrow of the elected prime minister, Dr Mohammad Mosaddeq, who wanted to nationalise the country's oil industry; and, possibly the most important, the US decision to give sanctuary to the Shah instead of returning him to revolutionary Iran for trial. We've been fully briefed. \nMORE INFORMATION iranembassy.org.au \nGETTING THERE Several major airlines operate flights toTehran. You can also fly into Shiraz via Dubai and Bahrain. Emirates has a connecting flight with Gulf Air. See emirates.com . \nAllow plenty of time to obtain a tourist visa. The application form can be downloaded from the embassy website or contact a travel agent. Some work with agencies who facilitate visa delivery. \nThe British company, Political Tours, also organises tours to Iran. They can sometimes facilitate visits to the US embassy. See politicaltours.com . \nSTAYING THERE Grand Hotel Ferdowsi​ in Tehran has double rooms starting at ($230). The hotel is close to the main museums as well as being within walkable distance of the market. Rooms are comfortable, with Wi-Fi. Decor, however, is exotic verging on bizarre. See ferdowsihotel.com . \nThe luxurious Abbasi Hotel has double rooms from $247 a night. Isfahan's​ most luxurious hotel, it began life 300 years ago as a caravanserai. Set around beautifully landscaped gardens with a traditional teahouse. See abbasihotel.ir . \nDINING THERE Haft Khan Restaurant Complex, Quran Blvd, Shiraz; see haftkhanco.com . \nCoffee Shop and Veggie​ Restaurant of Iranian Artists' Forum, Artists' Park, Park-e Honar, Mousavi Street. Combine lunch here with a visit to the contemporary galleries in the Artists' Park. \nSEE + DO It's possible to travel around the country by bus. There is a large bus network operating services between the main cities. \nWomen travellers are required to adopt the hijab, which means covering the hair, at least in part, and wearing trousers with long shirts or jackets. \nIn the Isfahan market in Tehran, buy hand-painted miniatures and watch the currency trading at the outdoor exchange at the market entrance. \nOgle the Iranian crown jewels, held in the National Jewelry​ Treasury in the vaults of the Central Bank, on FerdowsiAvenue, Tehran. \nSupplement a trip to Persepolis​ with a visit to the National Museum of Iran, which has carvings, pottery and stone sculptures excavated from some of the country's most important sites, including Persepolis. See nationalmuseumofiran.ir \nThe writer travelled at her own expense.", "external_links": [], "published": "2015-08-27T00:55:00.000+03:00", "crawled": "2015-08-27T02:10:30.102+03:00", "highlightTitle": ""}