{"organizations": ["MMM Corones", "CNN"], "uuid": "08c73f1457dee645c6c8a622f0c3a66a2ada4347", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150807174312-corones-tease-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_travel.rss", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/08/10/architecture/gallery/corones-messner-museum/index.html?eref=rss_travel", "country": "US", "title": "The museum carved into a mountain", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "The museum carved into a mountain", "spam_score": 0.0, "site_type": "news", "published": "2015-08-11T14:28:00.000+03:00", "replies_count": 0, "uuid": "08c73f1457dee645c6c8a622f0c3a66a2ada4347"}, "author": "", "url": "http://edition.cnn.com/2015/08/10/architecture/gallery/corones-messner-museum/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "The museum carved into a mountain", "locations": ["Italian Alps", "Mount Kronplatz", "Mount Everest", "Brixen", "Zillertal Alps", "Bressanone", "South Tyrol", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ripa", "Reinhold Messner", "Juval", "Jacopo Prisco", "Messner", "Zaha Hadid"], "text": "By Jacopo Prisco , for CNN Updated 1538 GMT (2238 HKT) August 10, 2015 11 photos: Sitting at the top of Mount Kronplatz, on of the most popular ski resorts in the Italian Alps, the MMM Corones is no ordinary museum.Designed by star architect Zaha Hadid , it is the brainchild of renowned mountaineer Reinhold Messner , the first man to complete the ascent of Mount Everest without supplemental oxygen.Inaugurated in July, the Corones -- the Latin word for \"crown\" that is also the Italian name of the mountain -- offers stunning views of the surrounding Dolomites and is dedicated to traditional alpinism. Hide Caption 1 of 11 11 photos: The museum is built 2,275 meters (7,460 feet) above sea level, and is partially submerged by the mountaintop.\"This project is about what happens when men and mountains meet,\" Reinhold Messner told CNN. \"I'm using it to express all my knowledge on mountains and reveal that mountaineering has been part of the European culture for 250 years.\" Hide Caption 2 of 11 11 photos: This is the sixth and last museum that Messner has opened in South Tyrol. The previous five -- called Firmian , Ortles , Dolomites , Juval and Ripa , explored the themes of rock, ice, holy mountains, and mountains and people. The names are all preceded by the acronym \"MMM\", which stands for \"Messner Mountain Museum.\"Built on several levels, the construction has a small footprint -- about 1,000 square meters or 11,000 square feet. Its design allows for a constant temperature level in both summer and winter, making it remarkably energy-efficient. Hide Caption 3 of 11 11 photos: Messner used a simple sketch to indicate his requirements to Zaha Hadid: \"She knew that there was a necessity to build a museum that was under the earth, with two huge windows in certain directions and a balcony,\" he said. \"The rest is hers. She had the idea to design it like a waterfall in the mountain and it became an extraordinary project.\" Hide Caption 4 of 11 11 photos: At the lowest floor, visitors pass by glass-enclosed viewing windows and arrive at a terrace from which they can enjoy a 240-degree panorama, spanning from the Zillertal Alps to the Ortles-Ortler to the Dolomites. Hide Caption 5 of 11 11 photos: To complete the construction, about 4,000 cubic meters (140,000 cubic feet) of earth have been removed from the top of Mount Kronplatz.The three large elements that protrude from the mountain itself are made of glass-reinforced fibre concrete. Hide Caption 6 of 11 11 photos: Zaha Hadid explains the principles of her design with these words: \"The idea is that visitors can descend into the mountain to explore its caverns and grottos, before emerging through the mountain wall on the other side, out onto the terrace overhanging the valley far below with its spectacular, panoramic views.\" Hide Caption 7 of 11 11 photos: \"The orientation of the windows was crucial, because I used the mountains outside of the museum to tell a story inside,\" Messner told CNN. Hide Caption 8 of 11 11 photos: \"In my museum, I'm a storyteller,\" Messner said, \"It's not an art museum nor a museum of natural sciences. We are telling stories about mountains and men.\" Hide Caption 9 of 11 11 photos: Reinhold Messner, pictured here during the inauguration of the MMM Corones, was born in Brixen (Bressanone), Italy, in 1944.He holds the distinction of being the first climber to have captured all 14 \"eight-thousanders\", the peaks over 8,000 meters above sea level.He refers to his mountain-themed museum chain as \"my 15th eight-thousander.\" Hide Caption 10 of 11 11 photos: The interior structure reveals a series of staircases that are designed \"like waterfalls in a mountain stream,\" to connect the exhibition spaces over three levels.The museum is open to visitors every day betwen 10am and 4pm. Hide Caption 11 of 11 The recently inaugurated MMM Corones is a new museum about mountain culture that majestically sits atop Mount Kronplatz in South Tyrol, Italy. Browse through the gallery to see all the images. More from Architecture", "external_links": [], "published": "2015-08-11T14:28:00.000+03:00", "crawled": "2015-08-11T15:27:18.292+03:00", "highlightTitle": ""}