{"organizations": [], "uuid": "aa43c10391fdac267a4f97b0e9b73e2aa8382542", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03419/George_Kruis_3419833k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-08-26.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sport/rugbyunion/international/england/11825962/Rugby-World-Cup-2015-George-Kruis-to-be-named-in-Stuart-Lancasters-England-squad-ahead-of-Dave-Attwood.html", "country": "US", "title": "Rugby World Cup 2015: George Kruis to be named in Stuart Lancaster's England squad ahead of Dave Attwood", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Rugby World Cup 2015: George Kruis to be named in Stuart Lancaster's England squad ahead of Dave Attwood - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-08-27T00:37:00.000+03:00", "replies_count": 0, "uuid": "aa43c10391fdac267a4f97b0e9b73e2aa8382542"}, "author": "Gavin Mairs , Rugby News Correspondent", "url": "http://www.telegraph.co.uk/sport/rugbyunion/international/england/11825962/Rugby-World-Cup-2015-George-Kruis-to-be-named-in-Stuart-Lancasters-England-squad-ahead-of-Dave-Attwood.html", "ord_in_thread": 0, "title": "Rugby World Cup 2015: George Kruis to be named in Stuart Lancaster's England squad ahead of Dave Attwood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "George Kruis, the Saracens lock, will be named as the fourth lock in England’s 31-man squad, edging out his Bath counter-part Dave Attwood, Telegraph Sport understands. • Cipriani left out of England's 31-man squad by coach Lancaster Kruis, who made his debut as a replacement off the bench against New Zealand last November, is expected to be named along with Courtney Lawes, Joe Launchbury and Geoff Parling as the fourth lock when England head coach Stuart Lancaster announces his squad on Thursday. • Pick England's Rugby World Cup squad Kruis, 25 was one of the stand-out forwards for England during the Six Nations campaign, seizing his opportunity following injuries to Lawes (ankle) and Launchbury (neck) and formed a formidable partnership with Bath lock Attwood. The 2015 Rugby World Cup begins in Kruis appears to have clinched his place after playing 80 minutes in the first World Cup warm-up match against France that culminated in a 19-14 victory at Twickenham. Attwood, 28, who is the more experienced of the pair with 21 caps, replaced Parling off the bench in that match and was given a second opportunity to press his claims with another cameo off the bench in last Saturday’s 25-20 defeat by France in Paris, when the England pack were outgunned by Les Bleus’ first choice eight. Kruis is expected to be named ahead of Dave Attwood It is thought to be have a close call between the two but Kruis’ mobility and edge at the breakdown are thought to have done enough to win a place. Alex Corbisiero, who has returned to fitness after suffering sciatic pain meanwhile is expected to miss out to Kieran Brookes as the fifth prop. Danny Cipriani, the Sale Sharks fly-half, has also been left out of Lancaster’s squad. • How Telegraph readers reacted to Cipriani's axing The 27 year-old has failed to make the cut despite an impressive try-scoring cameo in the 25-20 defeat by France in Paris on Saturday night. Danny Cipriani has been overlooked by Stuart Lancaster for his World Cup squad England head coach Stuart Lancaster is poised to name full-backs Mike Brown and Alex Goode as his two full-backs, where Cipriani had been providing cover, with George Ford and Owen Farrell to be named as the two fly-halves. Cipriani had received a swell of support on social media ahead of the decision, with supporters naming him their official man-of-the-match on a competition on the RFU Twitter feed on Saturday. Cipriani today used his Facebook page to thanks those who had backed him, although he did not infer whether or not he had made the final squad. Can't tell you how much the support means to me. We all go through our journey in life and learn lessons. I know I've... Posted by Danny Cipriani on Wednesday, 26 August 2015 “Can't tell you how much the support means to me. We all go through our journey in life and learn lessons. I know I've made mistakes some criticised rightly or wrongly. Just a quick thanx to all the nice messages. Really appreciate it.' In response to a comment asking if he already knew whether he was in the squad, he continued: 'Won't find out till this evening/tomorrow morning. Just a message to say thank you for the support.' Telegraphsportpage Follow @telegraphsport", "external_links": [], "published": "2015-08-27T00:37:00.000+03:00", "crawled": "2015-08-27T23:17:11.264+03:00", "highlightTitle": ""}