{"organizations": [], "uuid": "b1a82163a45b0b223c0e48bb4946e0a76fd28b12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03361/brinks-1_3361422k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-03.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/uknews/crime/11716085/Fools-gold-time-to-look-again-at-the-curse-of-Brinks-Mat.html", "country": "US", "title": "Fools gold: time to look again at the curse of Brink's-Mat", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Fools gold: time to look again at the curse of Brink's-Mat - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T21:47:00.000+03:00", "replies_count": 0, "uuid": "b1a82163a45b0b223c0e48bb4946e0a76fd28b12"}, "author": "Joe Shute", "url": "http://www.telegraph.co.uk/news/uknews/crime/11716085/Fools-gold-time-to-look-again-at-the-curse-of-Brinks-Mat.html", "ord_in_thread": 0, "title": "Fools gold: time to look again at the curse of Brink's-Mat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The first man jailed for his part in the Brink’s-Mat heist was sent down to the cells with a chilling threat ringing in his ears. Anthony Black, the brother-in-law of veteran south London robber Brian “The Colonel” Robinson, was the inside man during the notorious warehouse robbery at Heathrow Airport in 1983 which has endured in criminal folklore. Black worked as a security guard at the depot and just before dawn on a freezing November morning opened the front door to Robinson and five fellow robbers. The gang were expecting £3 million in cash and valuables but that was a wild underestimate. Instead, after forcing their way into the vault by dousing Black’s fellow security guards in petrol and threatening to set them ablaze, they came across three tonnes of gold bullion. They escaped with £26 million in loot in a battered transit van so loaded down that its chassis nearly scraped along the floor. Detectives quickly made the family connection between Black and Robinson and the following February the man nicknamed the “Golden Mole” by the tabloids was sentenced to six years at the Old Bailey. “In custody you will be segregated at all times and you and your family will forever be fugitives from those you so stupidly and wickedly helped,” Judge David Tudor Price told Black during sentencing. “Never again will your life be safe.” It proved a prescient warning. This week, John “Goldfinger” Palmer became the eighth person with close links to the robbery to fall victim to what is now known as the “curse of Brink’s-Mat”. The body of the 64-year-old underworld figure who was tried and acquitted over melting down gold bars stolen in the heist, was found in the garden of his rural Essex mansion. He had been shot in the chest in a murder police sources say bear all the hallmarks of a professional hit. “Fool’s Gold”, was how the Brink’s-Mat millions came to later be ruefully referred to the pubs along the Old Kent Road when the murders started happening in the Nineties. Even 30 years on it casts a shadow over those who touched it. Roy Ramm, ex Met Police commander who negotiated for return of Brink's-Mat gold Photo: Daniel Jones Roy Ramm knows Goldfinger, and those implicated in the Brink’s-Mat heist better than most. The ex-commander of specialist operations at the Metropolitan Police coordinated a team of detectives investigating Palmer and testified against him during a court case in 2001 which led to him being jailed for eight years for swindling 20,000 people in Britain’s biggest timeshare fraud. Throughout the Nineties, Ramm also personally negotiated to try and secure the return of the gold with two of the jailed Brink’s-Mat ringleaders Brian Robinson and Micky McAvoy inside maximum security Leicester Prison – and their accomplices on the outside at Scotland Yard and, bizarrely, at the bar of the National Theatre on South Bank. Ultimately, it was to no avail. As much as 70 per cent of the haul has never been traced and is still deemed to be sloshing around London’s criminal underworld and property market today. Large sums were supposedly invested in the Docklands boom of the Eighties and Nineties. A portion was even used to buy a section of Cheltenham Ladies’ College which was then converted and sold off into flats. The gang, unused to handling bullion, recruited a network of underworld accomplices to melt it down into scrap. It is said if you have bought a gold necklace made since 1993, chances are it will be from Brink’s-Mat. For Ramm, who still has one of the stolen Brink’s-Mat £50 notes later recovered by police framed at home, the latest murder means it is time to re-open the investigation as a cold case. “Over the years these various murders have been investigated by different officers and different forces. Getting them all together and looking at all those cases you might start to learn an enormous amount about the criminal network that grew through Brink’s-Mat. “I don’t think we genuinely know enough about what happened to the gold. The criminal connections are extraordinary and a review into the whole history may be very enlightening. I think that money has provided pensions for a lot of criminals and funded a lot of criminal activity.” Ramm also has a personal stake in the case. His friend and fellow officer John Fardham was the first death connected to the robbery. In 1985 he was stabbed to death by Kenneth Noye, a vicious criminal recruited by the gang for his smelting links during a surveillance operation in his garden. At the resulting trial, the jury found Noye not guilty of murder on the grounds of self defence. He was later convicted of a separate murder and is currently serving a life sentence. Ramm trained as a junior detective constable alongside Fordham and describes him as “an absolute star”. “We couldn’t believe it at first. When we heard the nature of his killing we were just staggered. For decades there has been a determination that investigations would always be pursued because of what happened to John. Because of him there has always been a desire to get to the bottom of what really happened at Brink’s-Mat.” John \"Goldfinger\" Palmer with his former wife Marine in 1987 As has been pointed out in recent days, John Palmer was a man with a lot of enemies. Aside from his alleged link to the Brink’s-Mat millions, the semi-literate former market trader and scrap dealer masterminded a violent timeshare empire in Tenerife using baseball-bat wielding thugs to beat rivals into submission. At the height of his notoriety he occupied 105th on the Sunday Times Rich List, a position shared with the Queen and it was a wealth he was keen to flaunt. Aside from the playboy accoutrements of a Learjet, pair of helicopters and extensive classic car collection, Palmer owned a £6 million yacht called the Brave Goose of Essex. On dry land he was not quite so courageous and often wore body armour beneath his flash suits. Supposedly everyone from the Russian mob to al Qaeda linked Lebanese businessmen were after his blood, while detectives are also investigating whether or not his death could be linked to the recent £10 million Hatton Garden safe deposit heist. (Clockwise from top left) Brink's-Mat accomplices Solly Nahome, Brian Perry and George Francis and Kenneth Noye The last living members of the Brink’s-Mat gang have made similar enemies, not least among the underworld figures recruited to help them dispose of it. Ramm says the criminal network involved stretched from Tower Bridge down into Kent – an area where the Metropolitan Police diverted a huge amount of resources. John O’Connor, a retired Flying Squad commander, worked in the area at the same time and recalls armed robbery being like a “cottage industry”. “These people were a pick and mix gang of heavy thugs,” he says. “They’re all thieves and vagabonds. They don’t trust each other except they know they won’t grass each other up. You’re dealing with people who are intrinsically dishonest; it’s not surprising it’s a hotbed for revenge and murder. They would be better off if that gold bullion was never there. It was too much and became a burden in its own right.” The murder of John Palmer extinguishes another name connected to the gold. But whoever may have pulled the trigger – the Brink’s-Mat curse lives on. Follow @telegraphnews", "external_links": [], "published": "2015-07-03T21:47:00.000+03:00", "crawled": "2015-07-04T20:42:26.000+03:00", "highlightTitle": ""}