{"organizations": [], "uuid": "a39b41b73aa655a6e5e938d586e93dcf5aeff3fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03389/GolferSummary_3389478k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/china-watch/sport/11764538/beijing-boy-zhu-he-youngest-golfer-china.html", "country": "US", "title": "Zhu He: Budding Beijing golfer, 7, hits hole in one", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Zhu He: Budding Beijing golfer, 7, hits hole in one - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T08:49:00.000+03:00", "replies_count": 0, "uuid": "a39b41b73aa655a6e5e938d586e93dcf5aeff3fc"}, "author": "Liu Zhihua", "url": "http://www.telegraph.co.uk/sponsored/china-watch/sport/11764538/beijing-boy-zhu-he-youngest-golfer-china.html", "ord_in_thread": 0, "title": "Zhu He: Budding Beijing golfer, 7, hits hole in one", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More Chinese news and features at telegraph.co.uk/chinawatch At only 7 years of age, Zhu He already has a collection of golf trophies, has played on courses in China and the United States and has hit a hole-in-one . Since teeing off in his first youth tournament in 2012, the Beijing primary school student has regularly been the youngest player at regional, national and international competitions. “He just enjoys playing. He doesn’t care about winning or losing,” said his father, Zhu Zhizhen, who recalled that his son had remained perfectly calm after hitting his first hole-in-one last year during a warm-up for the US Kids Golf World Championship in North Carolina. I’m not anxious about whether he will go pro. I just want to make sure he can enjoy the game “I’m not anxious about whether he will go on to be a pro. I just want to make sure he can enjoy the game,” added the surgeon, who despite his busy schedule said he makes time to accompany his son on the course as often as possible. Zhu He is the latest in a line of young Chinese golfers who have drawn attention at home and abroad. Guan Tianlang , 16, and 19-year-old Li Haotong have both been tipped as future stars after impressing at international tournaments. Guan, from the southern city of Guangzhou, became the youngest player ever to make the cut at a major when he competed in the 2013 Masters, while Li, number 135 in the world, is China’s highestranked player. Dr Zhu said he had suspected his son would be a good golfer because he and his wife had discovered they would be parents after completing a round of 18 holes. He first placed a plastic toy club in his son’s hands at just 11 months old and started to teach him how to play when he turned 1. Using toys and household items, he turned the family’s living room into a miniature course. During the Chinese New Year holidays, Dr Zhu said he would also hang red envelopes containing money — a traditional gift — along the makeshift course. If Zhu He could hit them with a golf ball, he was allowed to keep the money. The young player made his debut on a full-size course when he was 3 and a year later was completing games of nine holes. At the time, junior golf contests were rare in China, and Dr Zhu said even today there were fewer than 10 widely recognised events. In 2013, Zhu He went to play in the United States and won his first trophy. His father said the trip also marked the first time his son had cried after posting a disappointing score. “Ultimately, we play for fun. I just want him to learn how to be a better person through playing golf,” he said, adding that he believes golf teaches discipline and instils a strong work ethic. I don’t have much time for sport because I need to study ... I need brains to play golf better Dr Zhu has been sharing his son’s progress on social media, including on Sina Weibo, a Twitter-like website where he had almost 2,000 followers, and instant messenger app WeChat. “Apart from golf, I like football, basketball and swimming. But I don’t have much time for sport because I need to study,” said Zhu He. “I want to study hard because I need brains to play golf better.” READ MORE: • Teenager skates into NHL history books • A traditional art form takes off as economic lifeline for Chinese town • Mayor does best to make it better • Milan Expo: volunteers learn and teach in a cultural melting pot • Chasing the Tinseltown dream This article was originally produced and published by China Daily . • Read more about Chinese sport at China Watch", "external_links": [], "published": "2015-07-28T08:49:00.000+03:00", "crawled": "2015-07-28T06:06:06.350+03:00", "highlightTitle": ""}