{"organizations": [], "uuid": "f4d7e3d608eb32eb205ee2ab28d84bb75a257b49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.style.com", "main_image": "http://media.style.com/image/slideshows/culture/style-map/2015/7/13-lokal-wear/590/885/11379939_852401154814230_1330249308_n.jpg", "site_section": "http://www.style.com/culture", "section_title": "Culture - Art, Entertainment, Travel - Style.com", "url": "http://www.style.com/culture/style-map/2015/lokalwear-jewelry", "country": "US", "title": "Lokalwear Jewelry - Brazil", "performance_score": 0, "site": "style.com", "participants_count": 1, "title_full": "Lokalwear Jewelry - Brazil", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T02:32:00.000+03:00", "replies_count": 0, "uuid": "f4d7e3d608eb32eb205ee2ab28d84bb75a257b49"}, "author": "Jorge Grimberg", "url": "http://www.style.com/culture/style-map/2015/lokalwear-jewelry", "ord_in_thread": 0, "title": "Lokalwear Jewelry - Brazil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photo: Courtesy of Lokalwear\nAfter 10 years of living in Hungary, Brazilian designer Bruna Seve Patkó moved back to her native Rio de Janeiro to develop a line of accessories that mixes the heritage of two extremely different cultures. Using the most surprising materials, such as cow’s bone, Lokalwear has both an edgy and traditional feel. I had a chat with the designer to find out more about her creative craft.\nYour story is so unique. Tell me about the beginning.\nAfter living in Florence and New York, I moved to Budapest to live with my Hungarian boyfriend around five years ago. Back then, I didn’t know a lot about Central and Eastern Europe. Its rich, colorful folk designs with lace and embroideries came as a surprise, especially when contrasted with the architectural sophistication and history of Hungary. It was then that it all began. I got to see the local folk art for the first time through souvenirs. I realized that local designers didn’t value the use of typical crafts. It was the starting point for my concept of the brand. I think being Brazilian stimulated my curiosity, urging me to see things with an open mind.\nPhoto: Courtesy of Lokalwear\nYour pieces have a crafted sophistication. What is your design process?\nThe development process is always evolving. But the starting point essentially comes either from the raw material itself—which was the case with the Richelieu Lace collection and the Pantanal “Ivory” collection, in which we used raw materials, lace, and cow’s bone in a deconstructed manner and applied it differently—or from the actual traditional patterns, which was the case with the Hungarian Matyó collection, in which I honed in on the patterns, redesign, and recontextualization and used a totally different material for the production, distancing the original from the final designed pieces. The idea is to play with contrasts so as to generate a surprise factor while still referring to the origin. I focus on combining craft techniques with design, thus making the pieces modern yet authentic. We work with local artisans, local small family businesses, and local alternative labor in the assembling of our wares.\nWhat materials do you use?\nCurrently, we are focusing on three different collections made of three distinct materials. We have the lace and metal combination, polystyrene (which is lightweight and versatile), and cow’s bone, which is our newest addition.\nCan we find your collections outside of Brazil?\nYes, in the U.S., we are currently stocked at Aerin in Southampton, New York; at the Shop Latitude website; and in Budapest at the Four Seasons Hotel. We also sell worldwide through our website, www.lokalwear.com .\nPhoto: Courtesy of Lokalwear", "external_links": ["https://www.facebook.com/sharer/sharer.php", "http://www.lokalwear.com/"], "published": "2015-07-14T02:32:00.000+03:00", "crawled": "2015-07-14T00:29:32.000+03:00", "highlightTitle": ""}