{"organizations": [], "uuid": "9c799bbfb7256ec0095f0fda00e04496fe2f719a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/dcx/2015/07/09/1083968.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/in-thailand/618140/sweet-smells-of-rural-england", "country": "TH", "title": "Sweet smells of rural England", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Sweet smells of rural England", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T23:29:00.000+03:00", "replies_count": 0, "uuid": "9c799bbfb7256ec0095f0fda00e04496fe2f719a"}, "author": "", "url": "http://www.bangkokpost.com/travel/in-thailand/618140/sweet-smells-of-rural-england", "ord_in_thread": 0, "title": "Sweet smells of rural England", "locations": ["Thailand", "England", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel > In Thailand Sweet smells of rural England Lavender fields are just one of the highlights in the charming and picturesque Cotswolds, only a short trip from London 9 Jul 2015 at 03:29 253 viewed 0 comments NEWSPAPER SECTION: LIFE | WRITER: KARNJANA KARNJANATAWE - + Lavender in full bloom turns farmland in the Cotswolds, northwest of London, into purple fields. \nAbout two hours drive from London, one can enjoy the lavender fields in the Cotswolds. \nSurprisingly, I couldn't smell it until I bent down and my nose was close to the plant. Some say the sweet fragrance is strongest in the mornings. \nThe lavender field I visited is the family-run Cotswold Lavender, which took root in 2000. Today the farm has more than 35 different varieties spanning more than 227, rai or 36 hectares, with shades ranging from pale purple and soft blue to vivid violet, depending on the type of lavender. \nThe farm has a small gift shop and a tearoom offering drinks, pastries and ice cream made of lavender. \nMy hot lavender tea was made with dried flowers, and soothed and relaxed me. However, someone else complained that the tea reminded him of lavender mosquito repellent. \nBroadway Tower is not far from the Cotswold Lavender farm. Built in the 18th century, it is regarded as an iconic building in the Cotswolds. Many films and TV programmes have been shot at the tower, such as Sherlock Holmes and Interceptor . \nThe Broadway Tower is about 20m high and stands atop Fish Hill, 312m above sea level, overlooking the village of Broadway. This three-storey tower was a retreat for arts and crafts movement members. Today the tower houses photo exhibitions about how the place was in the past. \nSharing the fence of the tower is a Deer Park where visitors can see herds of red deer while strolling around the tower. There is also a cosy restaurant near the car park area. \nAnother must see for visitors to the Cotswolds is Bourton-on-the-Water. The village name made me blink twice with astonishment. And as the name suggests, the River Windrush passes through the centre of the village. Along one side of the river bank are handsome stone houses — some converted to restaurants — cozy coffee shops or museums while on another side are public parks and the village main road lined up with more stone houses, some of which are shops. \nOnce I stepped off our van next to the river, I went directly to a bench next to the river. I felt like I didn't want to go anywhere else as I felt the cool breeze and mild sunlight. Not far from me two children enjoyed splashing water at each other while some visitors took off their shoes and rested their feet in the cold water. \nI took out my sandwich from my bag and enjoyed the view. Wild ducks swam in the river and looked for food. Some visitors tossed tiny pieces of baguette to feed the ducks. They quickly ate every piece that dropped on the water while doves tried to get some when the wind blew some pieces to the ground. \nVisitors can walk along the bank of the River Windrush or walk inside the village. There are tourist attractions including a bird zoo, a miniature village, motoring museum and pottery factory. Although I had a short stop at the village, it was a really great resting place. The Cotswolds has another highlight. About 22km south of the village is Bibury, known as one of the most beautiful villages in England. \n\"We call it the Hobbit house,\" said my guide, adding that the picturesque place made people think of the Hobbit village in the movie. \nIn fact, there is not a single home built with a round-shape door like those houses we saw in The Hobbit and The Lord Of The Rings trilogy series. Those old stone houses line a small hilly road known as Arlington Row. The cottages were built in 1380 as monastic wool stores and converted into weavers' cottages in the 17th century, according to England's National Trust, which helps maintain properties in this scenic village. People still live in the village so some houses have signs warning tourists that they are private properties. Also in the village is a trout farm. \nBefore returning to London, visitors may stop at Bicester Village, a large shopping outlet at Bicester. My guide said the outlet was popular among foreign visitors, including Thais looking for special offers for luxurious and brand name clothes, bags, fashion items, gifts or souvenirs. \nBut for those who do not much like shopping like me, they can visit the town (the town map can be obtained at the Information Centre at Bicester Village). The map presents 18 attractions which can be covered by foot within a couple hours such as St Edburg's Church and historic houses. \nFor me the town highlight is the market square which has been used as the commercial heart of the town since 1239. Those stalls lined along Sheep Street were used as an area for a livestock market in the 18th century, but today it is a large outdoor shopping centre. \nNumerous products can be found such as fresh vegetables and fruits, flowers, home-made cheese, bakeries and clothes. There are also restaurants, cafés and tea shops along the street. One can finish the walking route without breaking sweat. \nA one-day trip outside London is worth a try. The Cotswolds can give visitors another side of English charm. \nCotswold Lavender is open daily during summer, which is until Aug 9. It is open 10am-5pm. The entrance fee is £2.50 (about 135 baht) for adults and £1.50 (81 baht) for children under 16 years old. Visit www.cotswoldlavender.co.uk. \nFor the Cotswolds, visit www.the-cotswolds.org and www.cotswolds.info. \nFor Bicester Village, visit www.bicestervillage.com. \nBroadway Tower. \nCottages lined along Arlington Row in Bibury. Tell us what you think about this article Like dislike 0 people liked / 0 people disliked it Share this article", "external_links": [], "published": "2015-07-08T23:29:00.000+03:00", "crawled": "2015-07-10T03:22:01.000+03:00", "highlightTitle": ""}