{"organizations": [], "uuid": "bff7bcb21e1e2f47f5a8e96a8435e20944b72d5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/Jordan_battling_to_rejuvenate_tourism_sector-ZAWYA20150722062509/", "country": "AE", "title": "Jordan battling to rejuvenate tourism sector", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Jordan battling to rejuvenate tourism sector", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T09:34:00.000+03:00", "replies_count": 0, "uuid": "bff7bcb21e1e2f47f5a8e96a8435e20944b72d5d"}, "author": "", "url": "http://www.zawya.com/story/Jordan_battling_to_rejuvenate_tourism_sector-ZAWYA20150722062509/", "ord_in_thread": 0, "title": "Jordan battling to rejuvenate tourism sector", "locations": ["AMMAN", "Jordan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AMMAN -- Natural wonders it has in abundance, but natural resources are lacking. \nAnd now one of Jordan's main money earners -- tourism -- is being killed off by regional conflicts. \nA haven of peace surrounded by war, Jordan is turning to contingency measures to try to revive its tourism industry which is suffering because of the raging violence in its neighbours Iraq and Syria. Tourism in 2014 contributed 14 per cent of the Kingdom's gross domestic product, to the tune of $4.4 billion, the second highest earner after remittances from expatriates.\nBut the flow of tourism revenue is becoming a trickle. \"For three days I haven't had a tourist come in here,\" said 30-year-old Mohammed of his souvenir shop in central Amman.\n\"Things are slowing down, and each year seems to be worse than the last.\" \nThe Kingdom has no shortage of acclaimed wonders, both natural and man-made. \nIts rose-red, rock-hewn city of Petra, some 235km south of Amman, is one of the New Seven Wonders of the World, and the Greco-Roman ruins at Jerash, 48km north of the capital, are among the region's most impressive. \nThe desert at Wadi Rum and the Dead Sea have always figured high on the list of the country's natural attractions. \nUntil recent years, such sites attracted hundreds of thousands of Western tourists on the trail of the first great civilisations. \nBut now they are devoid of visitors, frightened off by regional unrest in the wake of the 2011 Arab Spring that swept across the Middle East and North Africa. \nHotels close up shop \nIn those four years, the number of people who visit Petra every year has nearly halved -- from just under a million in 2010 to around 600,000 last year. Ten hotels there have had to shut their doors. \nAnd revenue from tourism was down 15 per cent during the first four months of 2015 compared to the same period last year, falling to $1.5 billion. \nTourism Minister Nayef Al Fayez attributed the fall to \"the absence among visitors of visibility on the situation in Jordan\". \nJordan Tourism Board Managing Director Abed Al Razzaq Arabiyat has now come up with an emergency plan aimed at raising Jordan's international profile and \"getting out of this situation\". \n\"There's no magic wand we can wave to fix things in a few weeks,\" Fayez told AFP. \n\"But we have put in place an ambitious plan targeting in particular the countries of the Gulf\" such as Saudi Arabia and the United Arab Emirates. \nNew markets including Turkey and the Far East will also be approached, among them China, Japan and South Korea, with the hope of seeing positive results \"from next year\". \nThere is also a rethink on diversifying the actual product and boosting services such as medical tourism. \nAccording to Private Hospitals Association President Fawzi Hammouri, \"Jordan has become the prime medical destination in the Middle East and North Africa,\" with 250,000 foreign patients treated in 2014. \nSome Jordanians in the industry believe the authorities are not doing enough, however. \nTravel agent Salama Khattar deplores what he called the absence of a \"clear and ambitious programme of work\" to relaunch tourism. \n\"We have made no profits since 2011. We are paying the overheads out of our own pockets,\" he said. \nIn the past four years, Khattar's agency, which brings tourist groups from Belgium, France, Norway and Sweden, has seen its business cut in half. \nJulien, a young French tourist visiting the towering Roman theatre dominating the centre of Amman, said he had no regrets about coming. \n\"A great stay, and no sense of feeling insecure despite a few initial reservations linked to the current trouble,\" he said. \n© Jordan Times 2015", "external_links": [], "published": "2015-07-22T09:34:00.000+03:00", "crawled": "2015-07-22T12:56:44.573+03:00", "highlightTitle": ""}