{"organizations": [], "uuid": "a046c5095e83785968d61b7069a6963893b925ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03388/wagah-india-pakist_3388748k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-27.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/asia/11765264/Just-Back-a-statue-for-naughty-monks-in-Sicily.html", "country": "US", "title": "Just Back: a statue for naughty monks in Sicily", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Just Back: a statue for naughty monks in Sicily - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T01:49:00.000+03:00", "replies_count": 1, "uuid": "b0946df461e16cda0112c3c035bde134032be779"}, "author": "Helen Pritchard", "url": "http://www.telegraph.co.uk/travel/destinations/asia/11765264/Just-Back-a-statue-for-naughty-monks-in-Sicily.html#post-0", "ord_in_thread": 0, "title": "Just Back: a statue for naughty monks in Sicily", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Only India could turn the simple act of lowering the national flag into a theatrical event, complete with spectator stands, a giant video screen for spillover crowds and a man in a white Slazenger tracksuit signalling the audience to cheer and chant “Hindustan” on command. Welcome to the Wagah border – the only road border crossing between Amritsar (India) and Lahore (Pakistan) where men march in three-quarter pants to the same drum, and punch theatrical fists in the air like it was a declaration of war, Cartoon Network style. All high jinks aside, this is a serious border. India and Pakistan are enemies. This is contested territory. India before partition. Punjab before Pakistan. But none of this seems to matter for the 30 minutes the Indian army parades, demonstrating its impressive musical timing more than its combative might and skill. The show has been described as a Monty Python spoof, and rightly so. Picture John Cleese with a tan doing high kicks, Basil Fawlty style. • India travel guide An elephant in the streets of Amritsar, India (Getty Images) Except in this episode, Basil fashions a fan hat out of a restaurant serviette using some rudimentary folding techniques he picked up from Manuel. And Manuel has shrunk Basil’s pants in the dryer, which he disguises by wearing white spats that meet his trousers halfway up the calf. The daily show takes place on both sides of the border gate, but you only get to see the Pakistani soldiers once the gate has opened and a handshake has been effected for the crowd. Before that it’s all Jack Russell-type mock aggression on the Indian side, as one soldier after the next marches up to the gate (to a drum beat) where he gets to perform the ritual high-kicking and air-fist punching at his opponent on the other side, before he returns to the loud embrace of the boisterous crowd. • India and the world's largest free lunch When the gates finally open the soldiers play their role to perfection, ruffling their cockerel hat feathers and occasionally stroking their moustaches between drums beats. It’s all perfectly coordinated and timed to mimic, or perhaps mock, the opponents’ movements. In the rare instances when someone offers an extra double-fisted air punch you get the feeling they might be working off script or playing a version of “rock paper scissors”. A mosque in Lahore, Pakistan at sunset (Alamy) India has the crowd advantage, even though Lahore is 15 miles from the border and Amritsar 20 miles away. But who visits Lahore? Amritsar already attracts thousands of devotees and visitors to the beautiful Golden Temple so it’s easy to understand why border bravado has become a regular sideshow for visitors looking for some sunset entertainment. • Are we wrong about Pakistan? Enter the next round  Email your entry, in 500 words (with the text in the body of the email), to justback@telegraph.co.uk by midnight on Tuesday July 28. For terms and conditions, see telegraph.co.uk/justback . The winner will receive £200 in the currency of their choice from the Post Office. Click here for more information and full terms and conditions The Post Office is the UK’s largest travel money provider. It offers more than 70 currencies with 0% commission. Customers can buy selected currencies over the counter at 8,000 branches and all currencies can be ordered for next-day delivery at 11,500 branches. Orders can also be placed online at postoffice.co.uk . Telegraphtravel Follow @telegraphtravel Telegraph Travel Collection»", "external_links": [], "published": "2015-07-28T01:49:00.000+03:00", "crawled": "2015-07-27T21:32:54.864+03:00", "highlightTitle": ""}