{"organizations": [], "uuid": "915519af089c776ac296daf312b663e5d4fa5d1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/w/j/4/p/image.related.StuffLandscapeSixteenByNine.620x349.15wj01.png/1437362983963.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/pacific-islands/70381873/Solomon-Islands-travel-guide-20-reasons-to-visit", "country": "AU", "title": "Solomon Islands travel guide: 20 reasons to visit", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Solomon Islands travel guide: 20 reasons to visit", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T06:29:00.000+03:00", "replies_count": 0, "uuid": "915519af089c776ac296daf312b663e5d4fa5d1d"}, "author": "Mal Chenu", "url": "http://www.stuff.co.nz/travel/destinations/pacific-islands/70381873/Solomon-Islands-travel-guide-20-reasons-to-visit", "ord_in_thread": 0, "title": "Solomon Islands travel guide: 20 reasons to visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Solomon Islands travel guide: 20 reasons to visit MAL CHENU Last updated 05:00, July 21 2015 Kirkland Photography \nA sandspit in Marau Sound, Guadalcanal Province. \nThe Western world has made little impression on this unspoilt South Pacific paradise. \n1 SEE: NO MAKE-UP \nSolomon Islanders like to say, \"we don't put on make-up\". This thinly veiled dig at other South Pacific destinations means they are proud of the natural beauty of the place and see no need to westernise it to attract visitors. The Solomons is comprised of 992 islands (about 150 inhabited) divided into nine provinces, and is one of the Pacific's last unspoilt destinations. Think coral reef-rimmed lagoons, sandy beaches, tropical jungle, rainforests, waterfalls, volcanoes and Melanesian hospitality au naturel. See visitsolomons.com.sb . \n2 SPEAK: PIJIN \n\"Welkam to the Hapi islands\". The greeting in phonetic Pijin often comes with a lei and coconut water. Pijin and English are the common lingoes but there are about 70 other languages still in use. Tank iu tumas (thank you too much) is a good phrase to know. On one island we met a fellow called Nudagus, so named because he was the second Gus (another Gus) to work there. In some villages you may have the local dialect translated in Pijin and then into English and back again. You'll work it out, \"no wariwari\" (no worries). See visitsolomons.com.sb \n3 SEE: AERIAL VIEWS \nAn aerial shot during a domestic flight. Photo: Solomon Islands Visitors Board \nSolomon Airlines operates Dash 8s, Twin Otters and Islander aircraft to ferry people throughout the country, and the views are spectacular. Grab a window seat and see tropical cloud banks and fat rainbows reflected back off tranquil lagoon-mirrors below. Little green islands are haloed by snowy surf, and the varying depths of island inlets present a striking azure palette. See flysolomons.com . \n4 STAY: FATBOYS RESORT Ad Feedback \nCuriously named for Joe, the Fat Boy from Dickens' The Pickwick Papers , this secluded resort in a peaceful turquoise lagoon in the Western Province offers good food, friendly service, amazing views and an ideal base from which to explore the region. The bar and restaurant bure is over the lagoon, where their three pet black-tip reef sharks are fed daily. Tours include snorkelling, local villages and a traditional lunch on a deserted atoll. See solomonislandsfatboys.com ; mysolomons.com . \n5 SEE: BOBOE COMMUNITY, WESTERN PROVINCE \nConch shells sound the alarm as our boat approaches and young warriors emerge from behind trees and huts, screaming and waving spears and banging shields, their black skin darkened further by caked mud. A spear flies over our heads. Only the chief can call them off. He eventually arrives and the boy-warriors retreat, now giggling and smiling. This traditional \"welkam\" is followed by authentic displays of cooking, crafts and a sumptuous lunch of reef fish, root vegetables, seaweed and dried banana. See visitsolomons.com.sb. \n6 SEE: TRADITIONAL VILLAGES \nThe Boboe community is just one example of the raw, remote and real village experiences in the Solomons. There is a national commitment to preserve the traditional customary lifestyles, or \"kastom\", of the people who live away from the cities. It may be considered impolite to just drop in, so escorted tours are encouraged. The Solomon Islands Visitors Bureau can provide advice on where and when to visit, or even stay. See visitsolomons.com.sb. \n7 DO: CALL AN EEL, VISIT A SKULL, THROW A SPEAR \nYou can call and handfeed eels in the traditional village of Biche​ on Gatokae Island, or visit Skull Island on Vona Vona Lagoon near Munda on New Georgia Island to view the skulls of venerated chiefs and their vanquished foes. Non-head-hunting-related cultural festivals include the Shell Money Festival on Malaita in August, the Wagasia​ Spear Throwing and Yam Harvest on Makira​ in June, and the Banana Festival on Makira in August. See visitsolomons.com.sb. \n8 DO: SCUBA \nThe Solomons boasts some of the best diving in the world, with soft and hard corals, precipitous drop-offs, wartime wrecks and abundant fish life, including eels, sharks, turtles, dolphins and dugongs. The area between Honiara and the Florida Islands has so many sunken WWII ships and aircraft it is called Iron Bottom Sound. Hook up with experienced dive masters at Bilikiki Cruises in Honiara and Dive Gizo in Gizo. Day trips or live-aboard tours available. See bilikiki.com ; divegizo.com . \n9 DO: SNORKELLING \nYou don't have to scuba to enjoy the Solomons' underwater wonderland – just grab a mask and dive in off the beach or a jetty. You will be greeted by excellent visibility and curious, colourful sea life such as pipefish, manta rays, reef sharks and clown fish lurking in the anemones. Some WWII planes and shipwrecks are close enough to the surface to be viewed by snorkellers. See visitsolomons.com.sb . \n10 DO: SURFING \nThe best conditions are between October and April. There are breaks to suit all levels and some are yet to be named. The island of Santa Isabelhas a 260-kilometre, north-facing coastline, headlined by the break at Papatura Island Retreat. The reef surfing at Pailongge​ near Gizo in Western Province can get hollow in big swells, while Skull Island – a two-hour boat trip from Munda, New Georgia or 20 minutes from Zipola Habu Resort on Lola Island – offers the longest right-hander in the Solomons. See surfsolomons.com . \n11 STAY: TAVANIPUPU \nThe lodge and private beach where Catherine, Duchess of Cambridge and Prince William, Duke of Cambridge spent the night on the island of Tuvanipupu. Photo: Getty Images \nTranslated as \"Bay of Triggerfish\", this resort was visited by the Duke and Duchess of Cambridge in 2012 and is claimed by the locals as the place of conception of Prince George. Admittedly, every stop on the young Royals' South Pacific itinerary makes the same claim, but this remote private island resort is perhaps the finest and most romantic in the Solomons. Located in Marau Sound – a 25-minute flight from Honiara - Tavanipupu boasts cavernous bungalows, manicured lawns, superb snorkelling, excellent food and fishing, diving, cycling and village tours. See tavanipupu.com . \n12 SEE: DOLPHINS \nOn a visit to the Western Province our small boat was surrounded by an estimated 200 dolphins, and we are told this is not unusual. The pod played with us for about 20 minutes before continuing on its way, leaving huge smiles in its wake. The Solomon Islands Visitors Board won't guarantee repeat performances but if you get lucky, an encounter such as this will be the experience of a lifetime. See visitsolomons.com.sb. \n13 STAY & EAT: HONIARA'S BEST HOTELS \nThe Solomon Kitano Mendana Hotel and the Heritage Park Hotel are next to each other on Mendana Avenue, across the road from the National Museum. Both hotels are 3.5-4 star by Australian standards, and are clean, well-maintained and centrally located. They both offer a range of suites, many with ocean views, swimming pools, and very nice restaurants and terrace dining options. The Mendana's Japanese restaurant Hakubai is the only authentic Japanese in the country; its Saturday night buffets are very popular. See kitanomendana.com ; heritageparkhotel.com.sb ; mysolomons.com . \n14 SEE: WORLD WAR II SITES \nThe open air war museum at Guadalcanal. Photo: Solomon Islands Visitors Board \nWar tourism is huge here, and up on Skyline Ridge near Honiara, the Guadalcanal American Memorial details the horrific and heroic story of the bloody six-month Solomons campaign, etched into red marble pillars. A similar Japanese memorial on Mount Austen is just as poignant. The Vilu War Museum - in a cleared meadow an hour's drive west of Honiara – is the final resting (and rusting) place of several World War II aircraft, artillery and other wreckage. See visitsolomons.com.sb/world-war-two . \n15 BUY: NGUZU NGUZUS​ \nStone and wood carvings – or illustrations – of these terrifying and beautiful traditional figures are available in villages, souvenir shops and roadside craft stalls. Originally mounted on canoe prows to provide supernatural protection during expeditions, nguzu nguzus are busts with large heads, long protruding jaws and circular ear ornaments. They also have small arms that clutch a head (for war) or a bird (for peace) beneath the jaw. Be the first in your street to own a nguzu nguzu. \n16 BUY: OTHER CULTURAL SOUVENIRS \nIf nguzu nguzus aren't your cup of tea, there are plenty of other traditional and unique Solomon Islands arts and crafts. Handsome wooden carvings with pearl inlays are typical, along with fishing equipment, weapons, circular shell currency carved from fossilised shells, and skull boxes. Yep, the art of skull box design is still alive and well – usually in the form of a small house, but also often carved in the shape of a mako shark. \n17 SEE: NATIONAL MUSEUM AND CULTURAL CENTRE \nLocated on the main road through Honiara opposite the Mendana Hotel, this well-maintained museum lacks funding but not dedication. The intriguing exhibits include old photos, traditional dress, currency, weaponry and war relics. There's also an impressive gift shop selling art and crafts, weapons, jewellery, fishing implements, skull boxes, nguzu nguzus and shell currency. Genuine artefacts at very reasonable prices. Cash only. \n18 SEE: BIRDWATCHING \nTwitchers will love the birdwatching on Rennell, Makira, Isabel, Malaita and Kolombangara Islands, among others. Kolombangara, in particular, has a unique biodiversity and the largest conservation area in the Solomon Islands. Imbu Rano Lodge sits on a ridge at an elevation of 370 metres overlooking two mile-high mountains and is an excellent base for trekkers keen on exploring the high altitude wonders. Sleep on the deck and wake to sound of the birdlife and mist-shrouded mountains. See kolombangara.org ; birdquest-tours.com ; sicklebillsafaris.com . \n19 DO: CHEW A BETEL NUT \nThe red-stained teeth and gums of those who partake is a little off-putting but the nuts are a cultural staple of the Solomons, and are offered to guests and used in traditional ceremonies. The produce markets are full of them, arranged – and fetching different prices – by size and quality. Often combined with powdered lime made from burnt coral carried in a small bamboo cylinder and pepper leaves, chewing the mixture causes a mild euphoric sensation and heightened alertness. Apparently. \n20 DO: GO TO CHURCH \nAbout 95 per cent of the population of the Solomon Islands is Christian and attending church is considered an obligation. Sermons can be a bit fire-and-brimstone but the singing is loud, proud and sonorous. At small village chapels you may hear hymns performed in a local dialect, Pijin and English. It doesn't matter whether or not you understand the lyrics, just sit back and enjoy the soaring, passionate harmonies. \nThe writer travelled as a guest of Solomon Islands Visitor Bureau and Solomon Airlines.", "external_links": [], "published": "2015-07-20T06:29:00.000+03:00", "crawled": "2015-07-21T01:29:24.919+03:00", "highlightTitle": ""}