{"organizations": [], "uuid": "478250b328a2cc50c60cf4a3f67162304af6115b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-5530052e/turbine/chi-default-open-graph-ct-logo/", "site_section": "http://www.chicagotribune.com/lifestyles/travel/", "section_title": "Travel - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/travel/lifestyles/travel/sns-201506301130--tms--travelpkctnxf-b20150630-20150630-column.html", "country": "US", "title": "Seniors on the Go: Mastering the hostile airport", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Seniors on the Go: Mastering the hostile airport - Chicago Tribune", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T06:30:00.000+03:00", "replies_count": 0, "uuid": "478250b328a2cc50c60cf4a3f67162304af6115b"}, "author": "Ed Perkins", "url": "http://www.chicagotribune.com/lifestyles/travel/lifestyles/travel/sns-201506301130--tms--travelpkctnxf-b20150630-20150630-column.html", "ord_in_thread": 0, "title": "Seniors on the Go: Mastering the hostile airport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Hostile environment!\" Early on in our travels together, my wife identified the typical big airport as a hostile environment. That was some 45 years ago, and the situation hasn't gotten much better. I rediscovered that last week at the Baltimore airport (BWI), on my return from a consumer conference in Washington. The first thing I saw on entering the terminal building was one of those long \"snake\" lines that zigzag back and forth between lines of what I think of as \"crime scene tape.\" It was, of course, densely packed with travelers who inched along, back and forth, about 20 minutes before reaching the check-in counter. After that, there was another maze to get through security. By the time all that was finally behind me, five hours in a coach seat didn't seem quite as daunting as I originally viewed it -- although, to be fair, five hours in one of today's minuscule coach seats remains \"cruel and unusual punishment\" when the plane is full. Fortunately, you can overcome problems, but some remedies require that you throw money at them.\nWhat's There. This column was triggered by a press release from TripAdvisor announcing \"dedicated airport pages,\" with the first set covering Singapore's top-rated Changi Airport. How good are the restaurants? The shops? The airport hotels in the vicinity? The first posting looks promising. It covers 16 airport area hotels plus 125 places to eat and 122 \"things to do\" in the airport. Hotels within three miles of the airport range from two at less than $100 (US) to the 4-1/2-dot Crowne Plaza at around $240. One useful factoid is the availability of a hotel located inside security in the terminal -- a great service for travelers with long layovers who don't want to go in and out of security. Presumably, TripAdvisor will roll other airports soon. Overall, the new compilations should be a big help to lots of travelers.\nc Comments Got something to say? Start the conversation and be the first to comment. Add a comment 0 To and From Town. Among the dozens of airport-oriented apps, my favorite remains Salk International's Airport Transit Guide. Since its earliest print incarnation, this guide has helped vast numbers of travelers decide their best get-to-town options when they arrive at an unfamiliar airport. It's now available only as an app, for either Apple or Android phones and tablets. You can buy ($4.99) and download it from salkinternational.com, iTunes, play.google.com/store/apps, or amazon.com. It currently covers more than 460 airports around the world. My only complaint is that it isn't available for Kindle or online.\nBeating the TSA Line. You can sometimes ease your passage through security by signing up for TSA's pre-check program. You go through an interview and thorough screening, and once you pass, you get a known traveler number, which you enter into the frequent flyer profile on any airline you use, and from then on the airline automatically notes \"pre check\" on your boarding pass. Pre-check provides access to expedited security lines at some airports. In my experience, I've found that pre-check usually works where it's available, but it isn't available at some airports where you'd expect it -- such as BWI. You pay a nonrefundable application fee of $85 for a five-year eligibility; other trusted traveler programs, such as Global Entry, include pre-check.\nBeating the Customs/Immigration Line. I've returned from four international trips over the last two years, and Global Entry works! Stick your passport into a slot, put your hand on a print reader, punch in answers to a few questions, and you get a piece of paper that lets you sail past all those lines and counters. The application process is similar to pre-check; the five-year cost is $100, and it includes pre-check. Global Entry is available at 58 airports, include most pre-clearance airports. Check it out at cbp.gov/global-entry.\nBeating the Airline Lines. This one is a bit tougher: The easiest way is to earn exalted frequent flyer status. Failing that, some airlines allow you to buy into premium lanes by upgrading to the extra-leg room seats. On Southwest, you can bump yourself into the \"A\" boarding group by paying, which might look good if you have a high boarding number that almost guarantees you'll be in a middle seat.\n(Send e-mail to Ed Perkins at eperkins(at)mind.net. Perkins' new book for small business and independent professionals, \"Business Travel When It's Your Money,\" is now available through http://www.mybusinesstravel.com or http://www.amazon.com )\n(c) 2015 TRIBUNE CONTENT AGENCY, LLC.\n ", "external_links": [], "published": "2015-07-01T06:30:00.000+03:00", "crawled": "2015-07-02T15:29:40.000+03:00", "highlightTitle": ""}