{"organizations": [], "uuid": "fd09c25ace3fac4c90c738058b13568500511cb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61679/global-leaders-discuss-ebola-s-effect-african-tourism", "country": "US", "title": "Global leaders discuss Ebola’s effect on African tourism", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Global leaders discuss Ebola’s effect on African tourism", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T03:56:00.000+03:00", "replies_count": 0, "uuid": "fd09c25ace3fac4c90c738058b13568500511cb5"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61679/global-leaders-discuss-ebola-s-effect-african-tourism", "ord_in_thread": 0, "title": "Global leaders discuss Ebola’s effect on African tourism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Global leaders discuss Ebola’s effect on African tourism Adv: \nBy Apolinari Tairo, eTN Tanzania Correspondent | Jul 22, 2015 Adv: \nGlobal leaders met in Geneva last week to discuss the effects of the Ebola outbreak in Africa and steps currently being undertaken to control the disease which had threatened tourists and other travelers from visiting this tourist rich continent. \nThe Ebola outbreak in Africa had negatively affected African tourism last year, reducing the number of tourists from other continents who had booked safari holidays on the continent by half, the leaders noted. \nThe just-ended meeting in Geneva which was chaired by the President of Tanzania, Jakaya Kikwete, had attracted health experts and diplomats from African countries affected by the Ebola outbreak and which hit three West African countries towards the end of 2013 and so far killed 11,000 people in those countries, throwing the world into shock and panic. \nThe meeting that was organized by the United Nations High Level Panel on Global Response to Health Crises had given a ray of hope to travelers looking to visit Africa for holidays, business meetings, and social interactions. \nReports from Geneva said a panel of diplomats and health experts gave feedback to countries that contributed to the fight against the Ebola disease in Guinea, Liberia, and Sierra Leone. These included 21 countries that cooperated to control the Ebola outbreak in West Africa. \nKey partners and donor countries on the frontline to control the disease are the United States, Germany, the United Kingdom, The Netherlands, Finland, Federation, Norway, China, Korea, Japan, Belgium, India, Switzerland, Canada, Brazil, Denmark, Russia, Israel, te African Development Bank, the African Union, and the World Bank. \nPresident Kikwete, who is the Chairman of the United Nations High Level Panel on Global Response to Health Crises, has led a series of meetings whose work has received support from those countries that contributed to controlling the Ebola disease outbreak. The countries that are supporting the work executed by the panel at the meeting include Venezuela and the European Union. \nThe panel use lessons learned from the response to the outbreak of the Ebola disease to provide recommendations on how the world can manage future health crises. \nThe Ebola outbreak was reported to hit Africa in 1976, the first time in the Democratic Republic Congo (DRC), which was then called Zaire. \nThe six-member panel was appointed in April this year by UN Secretary General Ban Ki-moon and started holding meetings in May at the UN Headquarters in New York. \nPresident Kikwete and members of the panel have received an opportunity to listen to the former World Health Organization (WHO) Director for Africa, Dr. Luis Gome Sambo from Angola, who talked about the history of how the African WHO office located in Brazzaville, Republic of Congo, responded to the Ebola outbreak. \nThe panel also heard from the new WHO Director for Africa, Dr. Matshidizo Rebecca Moeti, who talked through a teleconference video from Brazzaville, as well as the Rwanda Minister of Health, Agness Binagwaho. \nThe Ebola outbreak was reported in Guinea, Liberia, and Sierra Leone in 2013 and 2015 and had put off thousands of tourists who had planned trips to Africa. \nThe three West African countries account for less than one percent of international tourism arrivals to Sub-Saharan countries, but fears about the virus had impacted countries thousands of miles away from the epicenter that had no cases of Ebola. \nThe Hotels Association of Tanzania noted that in October 2014 a business decline by 30 percent to 40 percent was reported, and bookings for 2015 were down by 50 percent. \nThe Africa tourism industry is currently experiencing severe repercussions across the continent through economic losses, canceled flights and bookings, closed borders, and negative perceptions. These impacts reach far beyond the borders of the countries affected. \nResponding to Ebola crisis, the Africa Travel Association (ATA) had expressed its deep concern over the disease outbreak and its far-reaching effects, as well as related perceptions on the travel and tourism sector in Africa. \nStanding as the leading global trade association promoting travel and tourism to Africa and strengthening intra-Africa partnerships for the sector, ATA officials said the association acknowledges the immense size of the continent and encouraged tourists to continue to travel to the vast majority of the countries that remain safe. \n“Despite these challenges, ATA remains optimistic about travel and tourism to the African continent. In 2013, Africa welcomed over 65 million visitors, consistently increasing its share in the global travel marketplace,” read the ATA statement. \nWith a landmass of 30.2 million square kilometers and 54 independent countries, the African continent is the world’s most dynamic travel destination for tourists seeking adventure, exceptional cultural exchange and heritage tours, diverse culinary experiences, unparalleled safari and wildlife opportunities, first-class beaches, and a wealth of investment opportunities. \nIn pursuit of its mission, ATA believes that tourism is a powerful tool for promoting economic growth, job creation, investment, and cultural exchange in Africa. \nEstablished in 1975, ATA serves both the public and private sectors of the international travel and tourism industry. The association (ATA) will hold its 40th Annual World Congress in Nairobi, Kenya, from November 9 to 14 this year and which is expected to attract about 300 tourist and travel trade players from the United States and other key tourist markets across the world.", "external_links": [], "published": "2015-07-22T03:56:00.000+03:00", "crawled": "2015-07-22T07:00:36.879+03:00", "highlightTitle": ""}