{"organizations": [], "uuid": "a0917771fae889a1eb8833c8ea203ff17a46a8f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03384/rage2_3384749a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-23.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/travelnews/11757486/Man-restrained-with-seltbelts-and-tape-on-Siberia-Airlines-flight.html", "country": "US", "title": "Man restrained with seltbelts and tape on Siberia Airlines flight", "performance_score": 6, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Man restrained with seltbelts and tape on Siberia Airlines flight - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T17:57:00.000+03:00", "replies_count": 1, "uuid": "c705ed4f96575e6cb507a5d0b33238c7f7e0d1a3"}, "author": "Oliver Smith", "url": "http://www.telegraph.co.uk/travel/travelnews/11757486/Man-restrained-with-seltbelts-and-tape-on-Siberia-Airlines-flight.html#post-0", "ord_in_thread": 0, "title": "Man restrained with seltbelts and tape on Siberia Airlines flight", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An unruly passenger appears to have taken air rage to new heights, if these photos are anything to go by. An incident on board Siberia Airlines Flight 546 from Hong Kong to Vladivostok on Monday ended with him restrained in the aisle using a combination of seatbelts and tape. Unruly fliers are dealt with quickly and severely in Russia The man was allegedly drunk and abusive to other passengers, according to Vostok Media , prompting several others on board to take fairly forceful action. As a YouTube video of the incident shows, he was shoved to the floor by a fellow flier before a handful of others appeared to kick and punch him. The video has been viewed more than 445,000 times since it was uploaded on July 20. The man was detained by local police upon arrival in Vladivostock, the report adds. The Civil Aviation Authority recently warned that air rage was a growing problem , with the number of incidents on British airlines rising from 114 last year – up from 85 in 2013 and 47 in 2012. It called on airport bars and duty free shops to limit the sale of alcohol in a bid to tackle the issue. Eight strange cases of air rage Noodle rage Apparently unhappy with her seating arrangements, a Chinese passenger berated a crew member before throwing hot noodles at her on an Air Asia flight between Bangkok and Nanjing last year . A cup of hot noodles were thrown at a flight attendant in one incident Nut rage The daughter of a Korean Air exec caused a stir last year after she demanded that an air steward be removed from a plane for offering her nuts without a plate. Knee rage Reclining seat etiquette became a hot topic recently, due to a string of rows caused by a simple but devious device – the Knee Defender. The innocuous-looking lumps of plastic can be used by air passengers to preserve leg space preventing the seat in front from reclining. Its use led the diversion of a United Airlines flight last August . Then, a week later, an American Airlines flight was diverted after another row. Pyjama rage The little extras are what you pay for in first class – but there is a point when you can get too hung up on your entitlements. Two Qantas passengers, in August 2012, decided they would rather miss their flight than suffer the indignity of business class pyjamas. Expecting to be able to snuggle up in first-class nightwear, the A380 had in fact run out of XL-sized clothes. The pair were offered business-class PJs in the right size but refused them and disembarked, causing a 30-minute delay. Wine rage Gerard Depardieu, the actor, apologised in 2011 for urinating into a bottle - and the floor - during a flight. The Frenchman was caught short on a flight to Dublin, and could not go to the toilet as the seatbelt sign was on. He tried to relieve himself as discreetly as possible, but Dublin-based City Jet said the plane was grounded for two hours while staff cleaned the carpet. • The worst cases of celebrity air rage Gerard Depardieu has had more than his fair share of controversy Naked rage Staff on the runway at Manchester Airport were treated to a shocking sight in October 2013, when a passenger decided to completely disrobe on the tarmac. The 52-year-old allegedly challenging the captain to a fight and urinating against a wall before taking his clothes off. Police said he was dry tasered and arrested on suspicion of being drunk and disorderly. Toddler rage Two-year-olds can be hard to placate at the best of times. But one temper tantrum was so great that her whole family ended up being removed from a JetBlue flight to Boston in March 2012. The parents of the girl had been unable to get her to put her seatbelt on and so they were told to leave for safety reasons. Barking rage A Russian artist pleaded guilty to assault after a bout of air rage that ended with her punching and kicking flight attendants while barking like a dog . She also, according to court documents, attempted to bite attendants who were trying to restrain her on a United Airlines flight in 2009. Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-07-23T17:57:00.000+03:00", "crawled": "2015-07-23T15:55:57.374+03:00", "highlightTitle": ""}