{"organizations": [], "uuid": "67dc89c1c59364fdd3688aa8db39cc0c390a0d91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61479/proposed-tsa-revenue-diversion-called-unfair-burden-overtaxed-ai", "country": "US", "title": "Proposed TSA revenue diversion called unfair burden for overtaxed airline passengers", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Proposed TSA revenue diversion called unfair burden for overtaxed airline passengers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T02:15:00.000+03:00", "replies_count": 0, "uuid": "67dc89c1c59364fdd3688aa8db39cc0c390a0d91"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61479/proposed-tsa-revenue-diversion-called-unfair-burden-overtaxed-ai", "ord_in_thread": 0, "title": "Proposed TSA revenue diversion called unfair burden for overtaxed airline passengers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Proposed TSA revenue diversion called unfair burden for overtaxed airline passengers Adv: \nJul 15, 2015 Adv: \nWASHINGTON, DC - Airlines for America (A4A), the industry trade association for the leading US airlines, today objected to a House plan that calls for diverting funds that airline passengers pay for Transportation Security Administration (TSA) fees to pay for the highway trust fund. \nAs part of the Offsets in the Highway and Transportation Funding Act, the House plan calls for using portions of revenue assumed to be collected from TSA fees in years 2024 and 2025 to offset government costs for a highway fix this year. \n“It is disingenuous at best to take funds that airline passengers are paying, presumably for their safety and security, and use them to pay for highways,” said Nicholas E. Calio, A4A president and CEO. “This plan proposes to use tomorrow’s dollars to pay for today’s problem and do so on the backs of airline passengers who are being asked to fund everything from the national debt to the highways. This plan is a road to nowhere for passengers and eventually will lead to fee increases if the fees airlines and their customers already are paying today are diverted to other uses.” \nCalio noted that airline customers are already paying more than their fair share in taxes, as a $300 domestic one-stop roundtrip ticket can include more than $61 in taxes.", "external_links": [], "published": "2015-07-16T02:15:00.000+03:00", "crawled": "2015-07-16T02:58:21.000+03:00", "highlightTitle": ""}