{"organizations": [], "uuid": "47a0f7803de3ea8b93add5b17d68ccc4fdfd637f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03389/sailing-holiday_3389897a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-31.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/why-not/11767931/learn-to-sail.html", "country": "US", "title": "Learn to sail by taking a sailing holiday", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Learn to sail by taking a sailing holiday - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T21:41:00.000+03:00", "replies_count": 0, "uuid": "47a0f7803de3ea8b93add5b17d68ccc4fdfd637f"}, "author": "Adrian Monti", "url": "http://www.telegraph.co.uk/sponsored/why-not/11767931/learn-to-sail.html", "ord_in_thread": 0, "title": "Learn to sail by taking a sailing holiday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "#WhyNot get moving and go sailing? If you thought that sailing holidays were only for families with sea salt running through their veins, it might be time to broaden your horizons. Sailing is an extremely healthy way of spending a week or two of your summer holidays. It’s active, stimulating and relaxing, all at the same time – and it can be a good bonding experience for the whole family. You can’t, however, just turn up and sail a yacht without any previous experience. You’re going to need to invest some time learning how to do it. One option is to learn to sail before you go on holiday. If you choose this route, your first port of call should be the Royal Yachting Association (RYA). It oversees more than 100 different practical and theory training courses to make you competent at sea. The courses are held at 2,200 training centres dotted around the UK as well as overseas, and are often linked to local sailing clubs. If you’re not sure you have any sea legs at all, you can take part in a taster session laid on by the RYA or an individual club. No-one’s going to ask you to scrape the barnacles off the bottom of the hull, but you do need to be fairly active between lounging around on deck The two-day RYA Start Yachting course is a good introduction and will teach you the basics even if you’re not sure what the “pointy end” of a boat is called. From then on you can work your way through successive courses which vary in price depending where and when you do them. If your aim is to skipper your own boat, most companies will ask for a “Day Skipper” qualification before letting you loose on the high seas. You’ll already need some yachting experience, basic skills and theory knowledge before you go on this practical course, which takes around five days, so you need to factor this into your schedule. If you can’t wait that long – or would rather practise on the Med than the chilly Channel – you can learn to sail on holiday. For instance, on a Neilson Stay and Sail package, you can spend the first week learning the ropes and the second in charge of your own yacht in a flotilla. Another alternative is Sunsail’s Flotilla Hero package, which involves chartering a boat with a skipper, who will teach you on board. No-one’s going to ask you to scrape the barnacles off the bottom of the hull, but you do need to be fairly active between lounging around on deck. And of course, once the sun has passed over the yardarm, you’ll hopefully be doing that with a drink in your hand. ADVERTISEMENT The joy of movement Whether you’re pushing your body to its limits or just enjoying the great outdoors, trying new activities can sometimes lead to aches and pains. Voltarol relieves pain at its source and reduces inflammation, which speeds up recovery — so you can enjoy moving again. Visit www.voltarol.co.uk/keep-moving to find out how Voltarol can help you enjoy the freedom of movement in your life. Voltarol® Pain-eze emulgel® for the relief of pain and inflammation. Contains diclofenac diethylammonium. Always read the label.", "external_links": [], "published": "2015-07-31T21:41:00.000+03:00", "crawled": "2015-07-31T16:26:18.438+03:00", "highlightTitle": ""}