{"organizations": ["Hindustan Times"], "uuid": "3f7748bd80488328d0c13cc38a5316e9b81acc00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/7/5c177f83-879f-45e0-9e8c-65a7be89748fMediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Sexandrelationships", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/sexandrelationships/here-s-how-to-deal-with-people-who-just-don-t-listen/article1-1368169.aspx", "country": "US", "title": "Here's how to deal with people who just don't listen", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Here's how to deal with people who just don't listen", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T15:55:00.000+03:00", "replies_count": 0, "uuid": "3f7748bd80488328d0c13cc38a5316e9b81acc00"}, "author": "", "url": "http://www.hindustantimes.com/sexandrelationships/here-s-how-to-deal-with-people-who-just-don-t-listen/article1-1368169.aspx", "ord_in_thread": 0, "title": "Here's how to deal with people who just don't listen", "locations": ["New Delhi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sonal Kalra"], "text": "Sonal Kalra, Hindustan Times , New Delhi | Updated: Jul 12, 2015 10:46 IST Some people just won't listen. So just put your legs up and chill. \nHello there. Kya aap kisi ko ek hi baat repeat karte karte sun ke pak chuke hain? Kya aap apni baat ka cheenti jitna bhi asar na hota dekh kar thak chuke hain? Give me a full-of-depression high-five and join an asylum. Because I might have to, very soon. I don’t know if there is a medical name for this disease but I have been saying the same thing — in a polite, preaching, encouraging, threatening, pleading tone — to some people for their own good, but they JUST DON’T LISTEN. The irony is that some of those people only suggested this topic to me. It’s like, ‘Why don’t you write on people like us? Hum toh sudharenge nahi, maybe you can give some calmness tips to yourself and others, to deal with it. I think mere toh chehre ke features mein hi kahin ‘idiot’ word chhapa hai. Anyway, I’m sure you, too, have such people in your life – husband, wife, kid, girlfriend, boyfriend, just friend, brother, sister, colleague, maid – you name it, for whom the fathers of Hindi language coined a beautiful term — dheeth. Since this is a posh column and I’m a sophisticated English writer, let’s just act a bit fancy and call dheeth people DP for now. You see, we all have one, or if we are God’s lucky child, more than one DP around us. They come in all ages, shapes, sizes or gender, and are mercilessly implanted in our lives in a way that we have to deal with them almost every waking day. Your DP could be the husband who leaves the bathroom floor wet and the toilet seat up daily, while mine could be a co-worker who turns up late for work every single day. Your DP could be a best friend who always forgets to call up when he’s safely reached home drunk after a party, while mine could be a driver who refuses to hold the steering because he has to fold both his hands while passing by each of the 542 temples that are on the way from home to office. Talking of my driver, he would qualify to be at least a state minister with independent charge if there ever were a government of DPs. He would confidently turn the car in every direction while being totally clueless about directions, but absolutely refuse to seek directions from a bystander. Till I point a gun on the back of his head and make him stop and ask, that is. Karna padta hai ji, every DP has their own mode of treatment. I’m hoping that at least one of the 542 Gods would cure him someday, but if only wishes were horses. Anyway, before I get too random and turn into a DP myself, which, by the way, I already am in several respects, let us look at how to retain your Zen (I mean complete calmness, Einstein, not your Khataara that perhaps even Maruti doesn’t make now), if you have someone in your life who refuses to listen and change his/her habit despite being told hazaar times. Be clear, and precise Ambiguous communication can never achieve a firm outcome. Most of us lack the ability to say what we want clearly and firmly, without beating about the bush or repeating the same thing so many times that the listener gets irritated and loses focus. If you don’t like a habit of someone close to you, and it’s becoming a constant cause of stress, say so in polite, but fewer words. And there better be a call for action in what you say. I mean suggest a solution, don’t simply nag or criticise. Shun the sarcasm A study by the National University of Timbektoo says that the more personal insults or taanas you fling at a person, the lesser are his or her chances of improving in life. You will turn a DP into a maha DP if you’ll be sarcastic instead of trying to make a valid case for why you want something changed. Chaddha ji’s wife hates the fact that he leaves the toothpaste tube open on the wash basin, daily after brushing his teeth. Everyday at 8am, Mrs Chawla who lives four houses down the street can also hear her say, ‘Aapki mummy ne kuchh sikhaaya nahi aapko?’. I have some basic objections to this. One, it can’t be that Chaddha ji brushes his teeth every morning. The deep shade of the colour yellow defies it. Second, how would it help to drag his poor mother into the tube of toothpaste everyday. If anything, it can take the argument in some other direction altogether. Golden rule: Avoid taane, tab hum maane. See the other side Yaar dekho, no matter how convinced you may be that you are right in wanting whatever you do, there’s always another side to it. Always. Because God has made people to be different, they all see the world differently. To you, a house is perfectly kept only when it is spick and span with everything in its place; to your teenager, a room spells attitude only when it’s messy and unkempt. It’s much like what I call a blue-green debate. There’s a certain shade of colour which some people very confidently call blue, and some others lay a bet that it is green. Then there’s a third category of geniuses who enter and confuse further by declaring it to be bluish green or greenish blue.And oh! I’m not even going up to the category of those who utter terms like teal, turquoise, sea-green because I will lock them up in an asylum someday. But the point is, we always see things from our own eyes. For no other reason but to keep your own blood pressure in check, sometimes see it through the other person’s eyes and make peace with it. You may not get the satisfaction of being the winner in an argument, but it’ll weed out at least one DP from your life. Trust me, whether it is Facebook or life, lesser the stress of DPs, better the chances of calmness. \nSonal Kalra is a certified dheeth. She keeps saying she’s not preachy, but then goes ahead and gives so much gyaan. Mail her at sonal.kalra@­hindustantimes.com or on Facebook at facebook.com/sonalkalra13.Follow on Twitter at", "external_links": [], "published": "2015-07-11T15:55:00.000+03:00", "crawled": "2015-07-13T10:47:35.000+03:00", "highlightTitle": ""}