{"organizations": [], "uuid": "10b4ac521353ad830ee50d1c4528a1744cece22f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cheeseweb.eu", "main_image": "http://cdn1.cheeseweb.eu/wp-content/uploads/2015/07/Maison-Forte-de-Reignac.jpg", "site_section": "http://feeds.cheeseweb.eu/cheeseweb-eu", "section_title": "Slow Travel in Europe and Beyond | CheeseWeb", "url": "http://cheeseweb.eu/2015/07/cliff-chateau-maison-forte-de-reignac-dordogne-france/", "country": "US", "title": "The Cliff Chateau, Maison Forte de Reignac, in Dordogne, France", "performance_score": 0, "site": "cheeseweb.eu", "participants_count": 1, "title_full": "The Cliff Chateau, Maison Forte de Reignac, in Dordogne, France", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T08:15:00.000+03:00", "replies_count": 0, "uuid": "10b4ac521353ad830ee50d1c4528a1744cece22f"}, "author": "Andrew", "url": "http://cheeseweb.eu/2015/07/cliff-chateau-maison-forte-de-reignac-dordogne-france/", "ord_in_thread": 0, "title": "The Cliff Chateau, Maison Forte de Reignac, in Dordogne, France", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Aquitaine, France » The Cliff Chateau, Maison Forte de Reignac, in Dordogne, France The Cliff Chateau, Maison Forte de Reignac, in Dordogne, France By andrew - July 10, 2015 \nThe Maison Forte de Reignac, in Dordogne, France is one of the most unique châteaux we’ve ever visited – it’s carved out of a cliff! \nFor millions of years, the Dordogne River has carved a path from the Massif Central to the Garonne River near Bordeaux. In 2012, the entire Dordogne basin was classified by UNESCO as a Biosphere Reserve, making it the biggest Biosphere Reserve in France and second biggest in Europe. This classification aims to put measures in place to ensure the area is managed in a sustainable way now and in the future. This is good for the plants and animals as well as the 1.2 million people living in the reserve. \nOne of the most impressive features, along this 483km river, is the limestone cliffs, in and around the medieval town of Sarlat-la-Canéda, in the department of Dordogne. Here, the river has carved numerous caves, ledges, and gorges out of the soft stone; features exploited by man for millennia as shelter and protection. It reminds me of the troglodyte homes in Provence. The Maison Forte de Reignac looks normal (but impressive) at first glance. \nThe Maison Forte de Reignac (Fortified House of Reignac) is a unique and spectacular example of how the limestone caves were adapted. From the front, the cliff appears to shelter a manor house, built of stone blocks. But the building lacks depth, disappearing into the cliff and merging with the rock. It is as if a cliff was dropped on top of an existing home, leaving just the façade standing. Wait… did a cliff fall on the chateau?? \nDordogne is home to 1500+ castles, many built during the 15th and 16th century. Centrally located, the region found itself, a little like Belgium, between warring factions: the English and the French during the Hundred Years’ War; the Protestants and the Catholics during the Wars of Religion. The limestone caves and cliffs along the Dordogne River were natural defensive positions and became home to numerous castles, chateaux, and other defensive buildings. \nCarved out of the limestone during this period, the Maison Forte de Reignac, now a Classified Historic Monument, is one such defensive building. Driving along the road below the chateau, you may only catch a glimpse of the building. At first glance, from the outside, it looks like a fairly normal, older stone house. It’s a bit bigger than most houses, showing three stories of windows, but it doesn’t look unusual. However, something isn’t quite right. After a second glance, longer this time, you will notice how the chateau merges with the cliff. Even the tiled roof appears to have been swallowed by the rocks. The balcony offers a view of the surrounding landscape and the chateau’s ‘roof’ \nAlthough the current building is over four centuries old, the cliff’s caves have a much longer history. During 50 years of archaeological research, it was discovered the caves were occupied for at least 20,000 years. The UNESCO listed paintings in Lascaux, just down the road, date from this same period. It’s incredible to think how much history is in this one area! \nWalking up the steep path from the parking lot, all I could see was the façade of the building and some other constructions further up the cliff face. Entering the chateau, I was thrown back in time. The façade masks the full size of the building. There are numerous rooms, most built from original caves which have been adapted, enlarged, or created. There is a kitchen, large state rooms, bedrooms, a dungeon, storerooms, and more. Each room is decorated with period furniture, making it one of the most authentic chateaux/castles I’ve visited. Being built out of the rock, I loved the quirks, such as the stairs and the chimney. It is fascinating to see how the caves were adapted to fit human needs. The kitchen dug from the cliff stays cool year-round The former storage area is now a museum of findings at the chateau \nOf course, it is more than a house, it is a fortified house. The building is architected so it can be defended by the family. For example, each window on the façade has a hole beneath it, (called a loophole) which allows someone to fire at an attacker without exposing themselves. The balcony offered a great defensive point Even the sitting room has views over the valley \nAbove the building, niches in the cliff were fortified to provide additional defensive points. Finally, if the main defences failed and the house was taken by an attacker, the family could flee higher up the cliff into other caves that were more easily defended. From the upper levels, there is a terrific view of the valley, but mind your footing as it isn’t very flat. The huge fireplace was the main heat source for the entire chateau The formal dining room centres around the fire The quirky stairs are carved from the cliff \nDuring the visit there are plenty of stories about the use of the site and some of the former occupants. Each room has information posted about the room or the decorations. All the information posted around the site is in French but the reception desk does provide copies translated into various languages. Even without the explanations the site is fascinating. This bedroom for the ‘staff’ wasn’t so inviting However, the ‘Lady of the House’ got to sleep here \nAt the end of the visit there is a small exhibit on torture and capital punishment. It is not for the faint-hearted. I have read about a lot of inhumane things but many of the tortures described are hard to contemplate. It is incredible the kind of pain and suffering humans have caused each other in the past and still today. I recommend visiting but don’t feel you have to look at it all. \nThe visit of the Maison Forte de Reignac takes about an hour and it is well worth the time. The site’s web page calls itself the ‘most secret, strange, and mysterious “chateau”’ and I agree. It is one of the best examples of a cliff castle in France and, with the period furniture, it really feels like you’ve stepped back in time. I also liked being able to walk around the rooms. Frequently rooms in Chateaus are cordoned off so you feel like you are being guided through a museum. Here you were free to wander through each room and explore as much as you like. This is definitely one of my top visits in France. \nMaison Forte de Reignac 24620 Tursac, France \nHave you visited any cliff castles or other cliff dwellings? What should we add to our list to visit? Share your ideas below in the comments.", "external_links": [], "published": "2015-07-10T08:15:00.000+03:00", "crawled": "2015-07-11T02:47:01.000+03:00", "highlightTitle": ""}