{"organizations": [], "uuid": "2b34e9170d1483eff41e5a867460d9125682c5f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/unnamed-22.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/conrad-macao-receives-two-glasses-recognition-for-its-superior-wine-quality/", "country": "US", "title": "Dynasty 8 Awarded ‘Two Wine Glasses’ at the 2015 China’s Wine List of the Year AwardsTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Dynasty 8 Awarded ‘Two Wine Glasses’ at the 2015 China’s Wine List of the Year AwardsTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "2b34e9170d1483eff41e5a867460d9125682c5f3"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/conrad-macao-receives-two-glasses-recognition-for-its-superior-wine-quality/", "ord_in_thread": 0, "title": "Dynasty 8 Awarded ‘Two Wine Glasses’ at the 2015 China’s Wine List of the Year AwardsTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Conrad Macao receives Two Glasses recognition for its superior wine quality Published on : Thursday, July 9, 2015\nConrad Macao’s signature Chinese restaurant Dynasty 8 has been awarded ‘Two Wine Glasses’ at the 2015 China’s Wine List of the Year Awards for the second year in a row. Receiving Two Glasses means that the restaurant’s wine list is recognised as ‘Highly Recommended’ based upon a number of criteria.\nThe Wine List of the Year Awards were originally established by Tucker Seabrook in Australia in 1994 and are now the premier national awards for wine lists in that country. The awards have been invaluable in recognising and rewarding the country’s finest wine lists whilst building rapport and brand loyalty between supporting producers, wineries, importers, and distributors and their on-trade market. The primary objective of the awards is to help raise the public’s interest in fine wine generally, and to improve their appreciation of the participating establishments.\nThe founders of the awards were so impressed with the quality of the wine lists that already existed in China they felt that they should be recognised along with the talents of the sommeliers that were managing them. By doing so they felt that the awards could help serve both as a motivator and a guide to drive further development of many wine lists across greater China’s hospitality and tourism industries.\nAs a result in 2011, the Wine List of the Year Awards Founder was asked by representatives from China’s hospitality, tourism Industry and government to bring the Wine List of the Year Awards to China and in 2012 China’s Wine List of the Year Awards were launched at the 2012 China Sommelier Competition in Shanghai.\nNow one of the most anticipated events on the industry calendar, these prestigious awards have been instrumental in significantly lifting the standard of the nation’s Wine Lists whilst at the same time recognising and rewarding the talents of many of the nation’s best sommeliers.\nSource:-Conrad Macao\nRelated Posts 40% reduction in room rates in Grand Hyatt Taipei in July and August Express your love this Valentine’s Day at Calabash Cove Resort & Spa Melia Hotels International becomes a partner of the World Community Grid, initiative sponsored by IBM TripAdvisor touches mark of 100 million downloads for free app for iPhone and Android Jumeirah Creekside Hotel raises the bar on sustainability standards", "external_links": [], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-10T02:12:12.000+03:00", "highlightTitle": ""}