{"organizations": [], "uuid": "2c31c8690c3d2cc3ffabcd3f24807930dfb25fba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55ae8e901800003d003766e6.jpeg?cache=aAUYaEo1iE", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/news.xml", "section_title": "Travel News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/swiss-airlines-priestmangoode-cabin-design_55ae4fbde4b0a9b9485275bb", "country": "US", "title": "Swiss Airlines' New Cabin Design Needs To Happen Everywhere, Right Now", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Swiss Airlines' New Cabin Design Needs To Happen Everywhere, Right Now", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T00:21:00.000+03:00", "replies_count": 0, "uuid": "2c31c8690c3d2cc3ffabcd3f24807930dfb25fba"}, "author": "James Cave", "url": "http://www.huffingtonpost.com/entry/swiss-airlines-priestmangoode-cabin-design_55ae4fbde4b0a9b9485275bb", "ord_in_thread": 0, "title": "Swiss Airlines' New Cabin Design Needs To Happen Everywhere, Right Now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Swiss Airlines' New Cabin Design Needs To Happen Everywhere, Right Now James Cave Staff Writer, Lifestyle, The Huffington Post Posted: 07/21/2015 \nWhy can't all airplane cabins get the Swiss treatment? \nAfter the Internet panicked over a design that makes passengers face each other in a sardines-like, shoulder-to-shoulder seating situation , this spacious new concept should elicit a collective sigh. \nThe breathtaking cabin below was created for Swiss International Airlines's new fleet of 777-300ER planes by Priestmangoode , a British design and brand consultancy firm. Courtesy Priestmangoode \n\"We wanted to pick up the cultural significances\" of Switzerland, said Nigel Goode, a director at Priestmangoode and a leader on the project. \nEuropean travelers want a more open cabin that also gives them some privacy, he said, so he and his team focused on elements that give the passenger flexibility in succinct, Swiss fashion. Courtesy Priestmangoode \nSeats in the economy class are upholstered in cream-colored fabrics and wood paneling continues throughout; passengers are assisted by a self-service kiosk and mobile charging stations. \nBusiness class seats are more like little cubicles, with headphone hangers and straps for storing books, magazines and beverages. \nBut the first class design is what we think of when we picture flying in style. \nIn addition to a 32-inch flat screen TV, seats here recline into a six-and-a-half-foot bed. A retractable partition gives passengers three privacy options, and a personal wardrobe with doors that can be pulled together fully encloses the passenger as if they were riding in a train car. Courtesy Priestmangoode \n\"One of the things I get a big kick out of when other people see the design is that they'll say it looks so Swiss,\" Goode told The Huffington Post. \"You can sit in the seat and everything lines up and it’s quite precise.\" \nSwiss ordered an update to six of its Boeing 777-300ERs , and Goode said they'll be in use starting in January 2016. \nSwiss says its Boeing 777s hold about 330 passengers, and will be used for \"ultra long routes,\" or connections including San Francisco, Los Angeles, Sao Paulo and Bangkok. \nWhile this makes us want to book a trip to Switzerland immediately, Goode said there's hope for passengers on U.S.-based airlines. Priestmangoode is working with United Airlines to improve their cabins, and Goode said he sees American companies starting to take notice of the finer details. \nIn the U.S., Goode said, \"There tends to be more interest in the business, premium and economy areas, rather than first [class] itself. We’re working on a project that looks at this level of detail throughout the cabin, [such as] quality of finishes and attention to detail.\" \nWe can hardly wait.", "external_links": [], "published": "2015-07-22T00:21:00.000+03:00", "crawled": "2015-07-22T00:46:48.256+03:00", "highlightTitle": ""}