{"organizations": [], "uuid": "6362a93ba55a2a98f6940711da9b31443e8b8740", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03321/five-a-side-footba_3321311a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-03.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/why-not/11636417/play-five-a-side-football.html", "country": "US", "title": "Five-a-side football: play a smaller version of the beautiful game", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Five-a-side football: play a smaller version of the beautiful game - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T17:19:00.000+03:00", "replies_count": 0, "uuid": "6362a93ba55a2a98f6940711da9b31443e8b8740"}, "author": "Tim Adler", "url": "http://www.telegraph.co.uk/sponsored/why-not/11636417/play-five-a-side-football.html", "ord_in_thread": 0, "title": "Five-a-side football: play a smaller version of the beautiful game", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "#WhyNot get moving by playing a game of 5 a side football? Every week 1.5 million adults embrace their inner Cristiano Ronaldo or Wayne Rooney by playing five-a-side football. A faster, simpler version of traditional soccer, five-a-side is gaining in popularity: according to the FA, there are 30,000 leagues in the UK. Prince William is probably its highest-profile enthusiast, famously playing in Battersea Park just days before the royal wedding. You'll soon be bonding over your first win and rehashing your embarrassing shanks over a post-game pint Fitness benefits include cardiovascular – all that running – plus flexibility and coordination. And of course it’s a great way to keep up with your mates. One of the biggest attractions of five-a-side compared to traditional football is that it is easier to organise. Most people play in work or friendly teams at one of the many purpose-built indoor soccer centres around the country. And websites such as 5aside can help you work out the logistics. You can enter on your own and get placed in a team - a brilliant way to make some new friends and expand your social circle. But if you’ve got a few football-loving mates (or even casual acquaintances), why not put the extra effort in and pull your own team together? Ask your brother, your old uni pals, your neighbour, even that guy from work whom you don’t know very well but seems a bit sporty. Before you know, you’ll all be bonding over your first win and rehashing your embarrassing shanks over a post-game pint. Nick Frith, league manager at 5aside.org, says: “It’s a faster game that needs less time commitment from you as an individual player. Plus you can start playing straight away.” No waiting for ages on the sideline, then, limbering up in the hope of eventually coming on as a substitute. The number of people playing five-a-side appears to be on the increase. Nilesh Pandit, senior manager of Play Five a Side , says: “It’s a great way for people to blow off steam after work and it’s a fun way to work out.” According to the Sport England Active People Survey, overall 2.7 million people play football in parks or indoors once a month, while 1.9 million lace up their boots each week. And 8.2 million people play football at least once during the year, according to FA Insight data – including everything from affiliated leagues to a casual Sunday-morning kickabout in the local park. Why not join them? ADVERTISEMENT The joy of movement Whether you’re pushing your body to its limits or just enjoying the great outdoors, trying new activities can sometimes lead to aches and pains. Voltarol relieves pain at its source and reduces inflammation, which speeds up recovery — so you can enjoy moving again. Visit www.voltarol.co.uk/keep-moving to find out how Voltarol can help you enjoy the freedom of movement in your life. Voltarol® Pain-eze emulgel® for the relief of pain and inflammation. Contains diclofenac diethylammonium. Always read the label.", "external_links": [], "published": "2015-07-03T17:19:00.000+03:00", "crawled": "2015-07-03T11:44:42.000+03:00", "highlightTitle": ""}