{"organizations": [], "uuid": "e76cc3522feac1273d98a3965ad74dce32c88ceb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61346/top-mexican-drug-lord-escapes-most-secure-prison-again", "country": "US", "title": "Top Mexican drug lord escapes \"most secure\" prison. Again", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Top Mexican drug lord escapes \"most secure\" prison. Again", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T21:40:00.000+03:00", "replies_count": 0, "uuid": "e76cc3522feac1273d98a3965ad74dce32c88ceb"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61346/top-mexican-drug-lord-escapes-most-secure-prison-again", "ord_in_thread": 0, "title": "Top Mexican drug lord escapes \"most secure\" prison. Again", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top Mexican drug lord escapes \"most secure\" prison. Again Adv: Mexican drug lord Joaquin \"El Chapo\" Guzman escapes from maximum-security prison Adv: \nMEXICO CITY, Mexico - Mexican drug lord Joaquin \"El Chapo\" Guzman has escaped from a maximum-security prison outside Mexico City, authorities said Sunday, a second jail break in 14 years that deals an embarrassing blow to the government. \nThe kingpin was last spotted by security cameras in the shower area of the Altiplano prison, 90 kilometres (55 miles) west of the capital, on Saturday night before disappearing, the National Security Commission said. \nAn alarm was issued after \"he was not visible\" for a while and \"the escape of Guzman was confirmed,\" the commission said in a statement. \n\"An operation to locate him was deployed in the area and on roads of neighbouring states,\" it said, adding that flights were suspended at the nearby Toluca airport. \nThe Altiplano prison houses the country's most notorious drug lords, murderers and kidnappers. \nThe security commission did not have more details about the escape, and scheduled a press conference for Sunday morning. \nGuzman's first break from prison was in 2001, when he slipped past authorities by hiding in a laundry cart. \nMarines finally recaptured Guzman in February 2014 in a pre-dawn raid in a condo in Mazatlan, a Pacific resort in Sinaloa state. \nGuzman, 58, whose Sinaloa cartel shipped narcotics across the globe, was considered the world's most wanted drug lord. His second escape is sure to embarrass the administration of President Enrique Pena Nieto, who was flying to France for a state visit when Guzman fled. \nPena Nieto's government had won praise for capturing the powerful kingpin, a diminutive but feared man whose nickname means \"Shorty.\" \nAfter his capture, the government had paraded Guzman in front of television cameras, showing the mustachioed mafia boss being frogmarched by two marines in front of television cameras before taking him to prison. \n'Public Enemy Number One' \nGuzman's Sinaloa cartel's empire stretches along Mexico's Pacific coast and deals drugs to the United States and as far as Europe and Asia. \nBefore his last capture, the United States had offered a $5 million reward for information leading to his arrest, while the city of Chicago declared him \"Public Enemy Number One,\" joining American gangster Al Capone as the only criminal to ever get the moniker. \nHe used to be on Forbes magazine's list of billionaires until the US publication said in 2013 that it could not verify his wealth and that it believed he was increasingly spending his fortune on protection. His cartel became entangled in brutal turf wars against the paramilitary-like Zetas cartel and other gangs for years. \nMore than 80,000 people have been killed in drug violence in Mexico since 2006. The drug war began to escalate after former president Felipe Calderon sent the army and navy to rein in the cartels in 2006, a deployment that analysts say exacerbated the violence. \nMore than 10,000 were killed in Ciudad Juarez alone in violence attributed to battles between Sinaloa and Juarez cartel members for supremacy in the key drug corridor at the border with the US state of Texas.", "external_links": [], "published": "2015-07-12T21:40:00.000+03:00", "crawled": "2015-07-12T21:53:41.000+03:00", "highlightTitle": ""}