{"organizations": [], "uuid": "3bdcdad18ed9ad5843de3b204c42a3cc96e3473d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content4.video.news.com.au/foxsports/prod/archive/2015/07/10/FSD_100715_NRL_BENNETT_ON_SMITH_AND_MCKINNON.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/travel/australia/victoria", "section_title": "Victoria | Travel Victoria | Melbourne Travel and VIC Holidays | The Advertiser", "url": "http://www.adelaidenow.com.au/sport/nrl/chasing-the-headlines-on-alex-mckinnon-and-cameron-smith-60-minutes-has-devastated-two-families/story-fniabkse-1227437071001", "country": "US", "title": "60 Minutes: Alex McKinnon and Cameron Smith, 60 Minutes has devastated two families |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 28, "title_full": "60 Minutes: Alex McKinnon and Cameron Smith, 60 Minutes has devastated two families | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T08:55:00.000+03:00", "replies_count": 30, "uuid": "fe70727d7cb3ddc465b9d39a79a7e98b7a615c06"}, "author": "REBECCA WILSON", "url": "http://www.adelaidenow.com.au/sport/nrl/chasing-the-headlines-on-alex-mckinnon-and-cameron-smith-60-minutes-has-devastated-two-families/story-fniabkse-1227437071001#post-0", "ord_in_thread": 0, "title": "60 Minutes: Alex McKinnon and Cameron Smith, 60 Minutes has devastated two families |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ONE of the most irresponsible pieces of journalism ever to have aired on the 60 Minutes program has left two men shattered, two families devastated and both unnecessarily defending themselves in the light of a dreadful human tragedy.\nWhile the program that aired on 60 Minutes promised to deliver us an incredible story of fairytale proportions around Alex McKinnon and his beautiful partner, Teigan, one ill-judged segment took the headlines and destroyed what should have been a story of love conquering all.\nAustralian, Queensland and Melbourne Storm captain Cameron Smith has had the very fabric of his character thrown into question because of the now well-documented segment. He was accused of blatantly disregarding the welfare of McKinnon and then, worst of all, for refusing to reach out to the player or the family in the weeks ensuing that terrible, unfortunate tackle.\nNRL SACKING: NRL’s lord of the rings sacked\nOUT: Smith withdraws from chance to respond to McKinnon\nON THE MEND: Rebuilt Lewis makes his milestone\nKENTY: Queensland performance one of the best ever\nNRL round 18: Clash of the hyphens\nMOVING ON: Robinson backs Pearce to rebound\nCameron Smith has come through an extraordinarily testing week. Source: Getty Images\nSmith was given no right of reply until a day after the program when 60 Minutes producers realised: 1) their gross oversight had given them a headline but caused huge human collateral damage and 2) that a Smith interview would perpetuate the ratings success of the night before. They were told in no uncertain terms to get knotted.\nSmith’s wife is said to be devastated and the Australian captain, after a week that should have been his career pinnacle, is left a shaken, rattled mess.\nSmith has been heavily criticised in the media for refusing to comment on the program since the report was aired. He himself, not his family and not his management, decided to say nothing in the lead up to Origin because he did not want a brilliant team preparation ruined by a single man’s torment.\nMcKinnon himself has lost friends from the 60 Minutes program. That insensitive remark was ridiculous and wrong but the fact is that there are no winners when a program sacrifices integrity for a ratings grab.\nThat any of us has been asked to take sides in this is plainly wrong and immoral. When sensationalism gets in the way of the truth, the damage to all sides is enormous and public opinion falls victim to a lack of facts.\nWhere was the veteran Liz Hayes, the reporter on the story, when the producers handed her a script that unravelled McKinnon and subsequently Smith?\n60 Minutes got it very, very badly wrong. In trying to play the blame game, the program’s producers chose to ignore facts that could have been cleared up with a phone call.\nDid 60 Minutes misrepresent the events as they happened on the field? Source: Getty Images\nIn an email trail that I have seen that stretches over three months between the Storm, the Knights and the McKinnon family, it is very clear that Smith attempted to visit McKinnon in hospital within 24 hours of the accident.\nFor weeks and weeks after McKinnon returned to Sydney and then to Newcastle for his rehabilitation, Smith and the Storm offered help, raised money, and above all, the Storm captain continued to try to visit McKinnon. He was met with a no each time, and understood the sensitivities so did not chose to push too hard.\nThere was naturally high emotion, anger and grief involved here, stuff that was so hard for the McKinnon family to handle that they chose to do it in their own way. The Storm would not be part of the process, they decided, and that was that.\nDragging up a conversation Smith had with the referee six seconds after the tackle, editing it so heavily that it ignores that Smith was silent for a full eight minutes while McKinnon underwent treatment on the field, was grossly unfair to each of the parties concerned.\nThose discussions with referees happen in each game, every weekend.\nA lookback on the week that was in Rugby League 1:34 Play video\nRugby League: State of Origin is over for another year and for the Blues they couldn't be happier to see the back of it. Lets look back on a forgettable week for New South Wales fans.\nFox Sports 10 Jul 2015 Sport/NRL Nobody was to know as Smith rankled over details with the referee that McKinnon was so critically injured. The man who captains his team in a tough, professional manner was just doing his job.\nThis is the same bloke who every league player will tell you is the man who does more for player welfare than most others, the bloke who you count on for help and advice when things go pear-shaped and the man many see as being a league leader when his career is over.\nSmith has become a fall guy for a program that did not think watching Teigan Power’s overwhelming love for McKinnon would be quite enough for a story that had already been largely told before.\nAnyone watching it will tell you the Smith segment jarred with the tone of the rest of the program — a punch in your face after the caress of a love story that is helping to heal the broken hearted McKinnon and his family.\nToday Smith still finds he is unable to speak about Sunday night. He is a man of action, not words. There are no winners here and the sleepless guys should not be McKinnon or Smith.\nThey should be the faceless men producers who did not think before they pulled out the wrecking ball.\nSome in the media have used the penalty count to deflect attention from the Blues’ defeat. Source: Getty Images\nDON’T BLAME THE REFS\nBLAMING the referees for a 50-point drubbing is what anyone not from NSW has come to expect. Some of the stuff said has been laughable.\nThe most eloquent critic of the NSW performance was former Origin star Craig Gower on Sky News on Thursday night.\nHe said the Queensland performance was the greatest he has ever witnessed, from any team, anywhere, in his life.\nHis most interesting point was that the Blues were simply not prepared for what they found at Suncorp Stadium — a team of legends out to prove a point in the harshest possible way.\nSo all of that preparation, all of that talk and the pumping up of young forwards like Dave Klemmer and Aaron Woods was premature for an outfit that is still a rung below the Maroons’ consistently high standards.\nThe senior forwards were woeful and the cantankerous behaviour of the entire forward pack when the chips were down warrants a savage review. Club coaches must be fuming they’ve lost three blokes to suspension off the back of it.\nIt might be time, too, that the NSWRL had a look at the role of Bob Fulton, who has been front and centre of the NSW team for 10 years for one series win.\nNO LOVE FOR NICK\nFINALLY, to all who wrote to me about Nick Kyrgios — the biggest brat to ever grace a tennis court — it seems there is a torrent of malice coming his way from the Australian public, appalled that we could breed such a rude, boorish, disrespectful young man.\nGiven that he has admitted that he doesn’t even love the game, perhaps we might be spared more than a couple of years of the big cringe every time he plays.\nOriginally published as How could 60 Minutes get it so wrong?", "external_links": ["http://dailytelegraph.com.au/sport/nrl/maroons-skipper-cameron-smith-to-finally-speak-out-on-alex-mckinnon-controversy/story-fnp0lyn3-1227435908854", "http://resources2.news.com.au/images/2015/07/10/1227437/070362-30d1d736-26c9-11e5-9249-f9ea34ff76a1.jpg", "http://cdn.newsapi.com.au/image/v1/external?url=http://content4.video.news.com.au/foxsports/prod/archive/2015/07/10/FSD_100715_NRL_WEEK_IN_LEAGUE_PKG.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://www.dailytelegraph.com.au/sport/nrl/state-of-origin-2015-maroons-blue-murder-one-of-the-greatest-performances-in-league-history/story-fnp0lyn3-1227437164018", "http://www.dailytelegraph.com.au/sport/nrl/mitchell-pearce-to-rebound-from-origin-disappointment-says-roosters-coach-trent-robinson/story-fni3gn3s-1227437236515", "http://www.dailytelegraph.com.au/sport/nrl/chasing-the-headlines-on-alex-mckinnon-and-cameron-smith-60-minutes-has-devastated-two-families/story-fni3fh9n-1227437071001", "http://www.dailytelegraph.com.au/sport/nrl/nrl-end-jeweller-allan-zreiks-contract-to-make-premiership-rings/story-fnp0lyn3-1227437262078", "http://resources2.news.com.au/images/2015/07/10/1227437/070310-9047eb84-26c8-11e5-9249-f9ea34ff76a1.jpg", "http://www.dailytelegraph.com.au/sport/nrl/luke-lewis-will-put-multiple-injuries-and-surgeries-behind-him-to-run-out-for-his-250th-nrl-game/story-fni3gol8-1227437096303", "http://resources3.news.com.au/images/2015/07/10/1227437/070975-06bb0996-26c8-11e5-9249-f9ea34ff76a1.jpg", "http://www.dailytelegraph.com.au/sport/nrl/panthers-v-roosters-star-fullbacks-roger-tuivasa-sheck-and-dallin-watene-zelezniak-ready-to-face-off/story-fnp0lyn3-1227437166447"], "published": "2015-07-11T08:55:00.000+03:00", "crawled": "2015-07-11T13:52:23.000+03:00", "highlightTitle": ""}