{"organizations": [], "uuid": "85a625cd094cc345480375819ca9c87137f77985", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/20150730/c1_639084_150730075843_620x413.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/in-thailand/639084/blissful-unspoilt-serenity", "country": "TH", "title": "Blissful, unspoilt serenity", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Blissful, unspoilt serenity", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T23:28:00.000+03:00", "replies_count": 0, "uuid": "85a625cd094cc345480375819ca9c87137f77985"}, "author": "", "url": "http://www.bangkokpost.com/travel/in-thailand/639084/blissful-unspoilt-serenity", "ord_in_thread": 0, "title": "Blissful, unspoilt serenity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Prachaup Khiri Khan"], "text": "Bo Nok beach in Prachaup Khiri Khan remains relatively undeveloped, but that could soon change 30 Jul 2015 at 03:28 264 viewed 0 comments NEWSPAPER SECTION: LIFE | WRITER: KARNJANA KARNJANATAWE \nView of Ao Noi from a hilltop in Bo Nok. - + The morning breeze blows continuously at the long beach of Bo Nok in Prachaup Khiri Khan. Purple flowers dance in the wind while the waves break quietly on the beach. \nAbout 40 minutes drive to the south of busy Hua Hin beach, Bo Nok is like another world. There are no high rise hotels and condominiums on the beachfront area. The sand is soft although it's not as white as the beach in Hua Hin. The long coastline of Bo Nok is quiet and there are no vendors selling som tum , grilled seafood or anyone offering traditional Thai massage. No one will approach you to have a horse ride nor are there operators of banana boats and jet skis along the shore. \nBo Nok is a place where you can find solitude and stay still as there is nothing much to do here. The serenity is a key magnet for hotel developers. \nThe general beauty and peacefulness of the location was the main reason that about a decade ago X2 Kui Buri was opened on the beachfront area of Bo Nok, according to Bespoke Hotel Management Asia CEO Anthony McDonald, who founded X2 Resorts. \nAnother reason was the cheap price of land. \n\"We were able to design and build a resort that you could never do in Hua Hin where land prices were five to 20 times more expensive\", he said. \nBo Nok was a town that travellers only passed through to go further south, and the sea there might not be as attractive as neighbouring beaches like Hua Hin or Pran Buri, said Udomsuk Nimcean, general manager of two boutique resorts in Bo Nok under the Vartika brand. It was a challenge to turn the weak points into a strength, he said. \nThe first hotel, which opened five years ago, was Vartika Resovilla Kuiburi. Located on 2.5 rai of beachfront land, the resort offers 23 rooms. Business gradually picked up so Vartika Adventure Retreatic Resort was opened on another 11 rai plot of land this year. The second resort offers 41 rooms and is about 800m from the first one. The total investment in both resorts was about 450 million baht. \n\"The occupancy rate is better year on year,\" he said. Bo Nok is a preferred vacation for those who want to look for an alternative to the crowded beaches of Cha am, Hua Hin and Pran Buri. \n\"Our facilities can also serve every kind of traveller, ranging from honeymoon couples to families, the disabled and those on company retreats,\" he said. \nMore hotel investors have gradually opened their establishments along the beach of Bo Nok. Choices of room at present start from 800 baht to more than 20,000 baht a night. \nThe old image of the community dividing into two groups of supporters and protesters against the coal-fired power plant disappeared after the project was revoked in 2003, eight years after the Bo Nok community joined forces to stand against the government. \nI still remember the first time I visited Bo Nok 13 years ago. Humble huts and a restaurant, Krua Chom Wan, were the community meeting point for activists and locals protesting against the power plant project. The bungalow service, which was priced at 500 baht a night, was run by the late Charoen Wat-aksorn who used to lead Rak Thong Thin Bo Nok (Bo Nok Conservation Group). The place today is being refurbished, but the Krua Chom Wan restaurant owned by his wife Korn-uma Pongnoi is still open Fridays to Sundays. \nFor many visitors, Krua Chom Wan is a landmark of Bo Nok. Some see it as a benchmark for people power while others, who might not be aware of its history, visit for the fresh and delicious seafood. Bo Nok is one spot along the Gulf of Thailand where visitors can try their luck in taking a fishing boat to see Bryde's whales. Locals also spot dolphins from time to time. \nBo Nok beach is a magnet for property investors and speculators, and this has prompted concern from the local community. \nKorn-uma, the chairperson of Bo Nok Conservation Group, said that local people want to keep nature at Bo Nok as it should be. \n\"We are a small-scale fishing community. If all beachfront areas are occupied by hotels and resorts, fishermen will not be able to dock their boats in front of the beach area,\" she said. The piece of land that the community wants to preserve is the 931.3 rai plot in the Khlong Chai Thong public area. \n\"The public land has a 4km-long, beautiful beach, mangrove forest and marshy land that can be developed as an ecotourism destination and a learning centre,\" she said, adding that sea turtles used to lay their eggs on the beach. \nSince last year, locals joined hands with the Tambon Administrative Organisation of Bo Nok to draft a plan to promote ecotourism. However, the Prachuap Khiri Khan governor wants to build a university there. \nLocals have protested against the plan for months and it is still ongoing. \nWhile tourism and development are turning the tide for unspoilt Bo Nok, migrating birds hunt for food along the shoreline and ghost crabs move quickly back to their holes. Fish are still plentiful while waves slowly curl and hit the shore. \nNo one can tell if Bo Nok will remain an alternative destination for sustainable tourism or if it will turn into a mass tourism destination like Hua Hin. Only time will tell. \nMudskippers are found along the mangrove shores. \nA hoopoe looking for food. \nFishing boats at Khlong Klieo. \nMangroves make up part of the Khlong Chai Thong public land. Tell us what you think about this article Like dislike 4 people liked / 0 people disliked it Share this article", "external_links": [], "published": "2015-07-29T23:28:00.000+03:00", "crawled": "2015-07-30T08:16:50.038+03:00", "highlightTitle": ""}