{"organizations": [], "uuid": "716446717cf958a10cbb1f287d6979e1334d1de0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094277338/Newly-released-market-study-Consumer-Foodservice-By-Location-in-the-Czech-Republic?src=RSS", "country": "", "title": "Newly released market study Consumer Foodservice By Location in the Czech Republic", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Newly released market study Consumer Foodservice By Location in the Czech Republic | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "716446717cf958a10cbb1f287d6979e1334d1de0"}, "author": "Press", "url": "http://www.menafn.com/1094277338/Newly-released-market-study-Consumer-Foodservice-By-Location-in-the-Czech-Republic?src=RSS", "ord_in_thread": 0, "title": "Newly released market study Consumer Foodservice By Location in the Czech Republic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Consumer foodservice through standalone posted a 2% decline in current value terms in 2014. Due to increasing saturation of the Czech market leading consumer foodservice operators continued to search for new profitable locations and/or expand to micro-regions within the country in 2014. Even though standalone locations remain the most popular they lost ground due to changing strategies of expansion to mainly travel retail and leisure.\nEuromonitor International's Consumer Foodservice by Location in Czech Republic report offers a comprehensive guide to the size and shape of the market at a national level. It provides foodservice sales the number of outlets and the number of transactions by sector allowing you to identify the foodservice sectors driving growth. It identifies the leading companies the leading brands and offers strategic analysis of key factors influencing the market - be they eating habits lifestyle changes tourism spending or legislative issues. Forecasts to 2019 illustrate how the market is set to change.\nFull Report Details at\n - \nProduct Coverage:Consumer Foodservice Through Leisure Consumer Foodservice Through Lodging Consumer Foodservice Through Retail Consumer Foodservice Through Standalone Consumer Foodservice Through Travel.\nData Coverage:market sizes (historic and forecasts) company shares brand shares and distribution data.\nReasons to Get this Report\n * Get a detailed picture of the Consumer Foodservice by Location market;\n * Pinpoint growth sectors and identify factors driving change;\n * Understand the competitive environment the market's major players and leading brands;\n * Use five-year forecasts to assess how the market is predicted to develop.\nEuromonitor International has over 40 years' experience of publishing market research reports business reference books and online information systems. With offices in London Chicago Singapore Shanghai Vilnius Dubai Cape Town Santiago Sydney Tokyo and Bangalore and a network of over 800 analysts worldwide Euromonitor International has a unique capability to develop reliable information resources to help drive informed strategic planning.\nPartial Table of Contents:\nCONSUMER FOODSERVICE BY LOCATION IN THE CZECH REPUBLIC\nEuromonitor International\nJune 2015\nLIST OF CONTENTS AND TABLES\nHeadlines\nTrends\nCompetitive Landscape\nProspects\nCategory Data\nTable 1 Consumer Foodservice by Location: Units/Outlets 2009-2014\nTable 2 Sales in Consumer Foodservice by Location: Number of Transactions 2009-2014\nTable 3 Sales in Consumer Foodservice by Location: Foodservice Value 2009-2014\nTable 4 Consumer Foodservice by Location: % Units/Outlets Growth 2009-2014\nTable 5 Sales in Consumer Foodservice by Location: % Transaction Growth 2009-2014\nTable 6 Sales in Consumer Foodservice by Location: % Foodservice Value Growth 2009-2014\nTable 7 Consumer Foodservice through Standalone: Units/Outlets 2009-2014\nTable 8 Sales in Consumer Foodservice through Standalone: Number of Transactions 2009-2014\nTable 9 Sales in Consumer Foodservice through Standalone: Foodservice Value 2009-2014\nTable 10 Consumer Foodservice through Standalone: % Units/Outlets Growth 2009-2014\nTable 11 Sales in Consumer Foodservice through Standalone: % Transaction Growth 2009-2014\nTable 12 Sales in Consumer Foodservice through Standalone: % Foodservice Value Growth 2009-2014\nTable 13 Consumer Foodservice through Leisure: Units/Outlets 2009-2014\nTable 14 Sales in Consumer Foodservice through Leisure: Number of Transactions 2009-2014\nTable 15 Sales in Consumer Foodservice through Leisure: Foodservice Value 2009-2014\nTable 16 Consumer Foodservice through Leisure: % Units/Outlets Growth 2009-2014\nTable 17 Sales in Consumer Foodservice through Leisure: % Transaction Growth 2009-2014\nTable 18 Sales in Consumer Foodservice through Leisure: % Foodservice Value Growth 2009-2014\nTable 19 Consumer Foodservice through Retail: Units/Outlets 2009-2014\nTable 20 Sales in Consumer Foodservice through Retail: Number of Transactions 2009-2014\nTable 21 Sales in Consumer Foodservice through Retail: Foodservice Value 2009-2014\nTable 22 Consumer Foodservice through Retail: % Units/Outlets Growth 2009-2014\nTable 23 Sales in Consumer Foodservice through Retail: % Transaction Growth 2009-2014\nTable 24 Sales in Consumer Foodservice through Retail: % Foodservice Value Growth 2009-2014\nTable 25 Consumer Foodservice through Lodging: Units/Outlets 2009-2014\nTable 26 Sales in Consumer Foodservice through Lodging: Number of Transactions 2009-2014\nTable 27 Sales in Consumer Foodservice through Lodging: Foodservice Value 2009-2014\nTable 28 Consumer Foodservice through Lodging: % Units/Outlets Growth 2009-2014\nTable 29 Sales in Consumer Foodservice through Lodging: % Transaction Growth 2009-2014\nTable 30 Sales in Consumer Foodservice through Lodging: % Foodservice Value Growth 2009-2014\nTable 31 Consumer Foodservice through Travel: Units/Outlets 2009-2014\nTable 32 Sales in Consumer Foodservice through Travel: Number of Transactions 2009-2014\nTable 33 Sales in Consumer Foodservice through Travel: Foodservice Value 2009-2014\nTable 34 Consumer Foodservice through Travel: % Units/Outlets Growth 2009-2014\nTable 35 Sales in Consumer Foodservice through Travel: % Transaction Growth 2009-2014\nTable 36 Sales in Consumer Foodservice through Travel: % Foodservice Value Growth 2009-2014\nTable 37 Forecast Consumer Foodservice by Location: Units/Outlets 2014-2019\nTable 38 Forecast Sales in Consumer Foodservice by Location: Number of Transactions 2014-2019\nTable 39 Forecast Sales in Consumer Foodservice by Location: Foodservice Value 2014-2019\nTable 40 Forecast Consumer Foodservice by Location: % Units/Outlets Growth 2014-2019\nTable 41 Forecast Sales in Consumer Foodservice by Location: % Transaction Growth 2014-2019\nTable 42 Forecast Sales in Consumer Foodservice by Location: % Foodservice Value Growth 2014-2019\nTable 43 Forecast Consumer Foodservice through Standalone: Units/Outlets 2014-2019\nTable 44 Forecast Sales in Consumer Foodservice through Standalone: Number of Transactions 2014-2019\nTable 45 Forecast Sales in Consumer Foodservice through Standalone: Foodservice Value 2014-2019\nTable 46 Forecast Consumer Foodservice through Standalone: % Units/Outlets Growth 2014-2019\nTable 47 Forecast Sales in Consumer Foodservice through Standalone: % Transaction Growth 2014-2019\nFull Table of Contents is available at:\n-- \nAbout Fast Market Research\nFast Market Research is a leading distributor of market research and business information. Representing the world's top research publishers and analysts we provide quick and easy access to the best competitive intelligence available.  Our unbiased expert staff is always available to help you find the right research to fit your requirements and your budget.\nFor more information about these or related research reports please visit our website at or call us at 1.800.844.8156 (1.413.485.7001 Int'l)\n \n\n\nAbout PRBuzz.com \nPRBuzz.com is a press release distribution service that distributes press releases to online news sites and blogs to help customers with search engine optimization and create buzz about their web site, news or business.", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-12T18:08:34.000+03:00", "highlightTitle": ""}