{"organizations": [], "uuid": "ecb653360f66fdd44f12c09e257269ad78a133cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gosouthamerica.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/200243294-001.jpg", "site_section": "http://z.about.com/6/g/gosouthamerica/b/index.rdf", "section_title": "About South America Travel", "url": "http://gosouthamerica.about.com/od/topdestgalapagos/fl/10-Awesome-Animals-to-See-in-the-Galapagos.htm", "country": "US", "title": "10 Awesome Animals to See in the Galapagos", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "10 Awesome Animals to See in the Galapagos", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T02:58:00.000+03:00", "replies_count": 0, "uuid": "ecb653360f66fdd44f12c09e257269ad78a133cc"}, "author": "", "url": "http://gosouthamerica.about.com/od/topdestgalapagos/fl/10-Awesome-Animals-to-See-in-the-Galapagos.htm", "ord_in_thread": 0, "title": "10 Awesome Animals to See in the Galapagos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Articles and Resources Blue Footed Boobies. BaconIsMagic \nEvery trip through the Galapagos Islands is different, depending on routes and seasons, but there is no shortage of amazing wildlife to see throughout the year. \nBelow are ten amazing animals that you can encounter on an adventure in the islands. Some of these animals you will see as you take a guided nature walk, some you can spot from the deck of your ship and for others, you’ll need to grab a snorkel and mask. \nGalapagos Penguin \nYou can spot penguins throughout the islands, but the majority of the penguins are found on Fernandina and Isabela Islands to the West. The Galapagos penguins are the rarest of all penguin species and feed on the small fish near the shoreline. These unique animals are fun to snorkel with or to watch preening on nearby rocks. \nGiant Galapagos Tortoise \nThe Giant Tortoise is the largest living species of tortoise and an iconic symbol of the Galapagos. With a lifespan of on average 100 years, these are also the longest living animals. They are herbivores, eating mainly cactus pads, grasses and fruits. \nSea Lion \nThe sea lion is the most common mammal in the Galapagos and snorkeling with them is the highlight for many visitors. They are curious animals, so as you float by they will come inches away from your snorkel mask, blow bubbles in your face and joyfully do somersaults around you. \nMarine Iguana \nThese iguanas are the world’s only oceangoing lizard and it’s fascinating to see iguanas, typically land animals, be great swimmers underwater. As you snorkel, you can watch them feed off of the algae and effortlessly dive up to 90 feet deep. Also, marine iguanas have long, sharp claws that give them the ability to hold onto rocks along the shore without being pulled away by the waves. They are unable to digest the salt water so they have developed glands that remove the salt through a shooting spray that usually lands on their heads. \nSea Turtle \nYou will find the Galapagos Sea Turtle, an endangered species, slowly swimming around seaweed beds, enjoying the sea grass and algae. They spend their time mainly in the water, but come on land to lay their eggs. The Galapagos National Park closes sections of the beach during nesting season for these animals so the tourists do not disturb the area. \nFlightless Cormorant \nOver time, the Galapagos Flightless Cormorants adapted to the terrain and instead of flying, became efficient swimmers. These cormorants have dense body feathers to protect their bodies from the water and to improve buoyancy. Since they don’t need to go far for their food and have no natural land-based predators, they were able to adapt to hunt for their food by propelling through the water by quickly kicking their legs. \nBlue-Footed Boobies \nBlue Footed Boobies are known for their courtship display where the birds lift their feet and wave them in the air making them appear to be dancing around each other. The name “booby” comes from the Spanish word bobo, which means “clown” or “fool”. The blue feet of the Blue Footed Booby can be used to cover its chicks and keep them warm. \nWhale Shark \nWhale sharks are the largest fish and shark in the world with a mouth opening of five feet wide. They are gentle giants that feed on plankton and usually travel alone, but they are known to congregate in large groups near areas where there is a high amount of plankton available. Between June and September whale sharks are usually seen near Darwin Island and Wolf Island. \nLeatherback Turtle \nLeatherback turtles are the largest sea turtle and one of the most migratory, crossing both the Atlantic and Pacific Oceans. They consume large numbers of jellyfish that help to keep populations of these organisms in control. Leatherbacks can dive to depths of 4,200 feet, deeper than any other turtle, and can stay down for up to 85 minutes. \nDarwin’s Finches \nDarwin’s Finches refers to 15 different species of small birds, each displaying a similar body type and similar coloring, but with markedly different beaks. Each species has a different size and shape beak, as they are highly adapted to different food sources. The birds vary in size with the smallest being the warbler-finches and the largest the vegetarian finch. \nAn award-winning leader in sustainable travel, Ecoventura offers an adventure cruising experience aboard its fleet of expedition yachts. Two unique seven-night itineraries depart every Sunday, visiting more than a dozen exclusive visitor sites in the Galapagos National Park for up close experiences with wildlife, many endemic to the archipelago.", "external_links": [], "published": "2015-07-18T02:58:00.000+03:00", "crawled": "2015-07-18T11:38:27.000+03:00", "highlightTitle": ""}