{"organizations": [], "uuid": "9e5c675c375d642b6c0089500fb3165f5b9ff1cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61036/some-entertainment-sharm-el-sheik-hotel-employee-points-fake-gun", "country": "US", "title": "Some \"entertainment\" - Sharm El Sheik hotel employee points fake gun at tourists", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Some \"entertainment\" - Sharm El Sheik hotel employee points fake gun at tourists", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T05:46:00.000+03:00", "replies_count": 0, "uuid": "9e5c675c375d642b6c0089500fb3165f5b9ff1cc"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61036/some-entertainment-sharm-el-sheik-hotel-employee-points-fake-gun", "ord_in_thread": 0, "title": "Some \"entertainment\" - Sharm El Sheik hotel employee points fake gun at tourists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE LIST: 5 Star Rated by eTN Readers - and not for sale! Hotels - Airlines - CVBs - Destinations - people Some \"entertainment\" - Sharm El Sheik hotel employee points fake gun at tourists Adv: \nJul 04, 2015 A member of staff at a hotel in Sharm El Sheikh, Egypt, points fake gun to a tourist's head Adv: \nSHARM EL SHEIK, Egypt - British tourists have told of their shock after a hotel employee at a popular destination in Egypt pointed a fake gun at holidaymakers' heads the day after the Tunisia terror attacks. \nPictures show the man, a member of staff at a hotel in Sharm el-Sheikh, dressed up in a tuxedo and running down the beach with an imitation revolver. \nThe worker, believed to be part of the hotel's entertainment team, can then be seen leaning over a man on a sun lounger and pretending to hold him at gunpoint. \nPaul Dodkin, 53, from Epsom, Surrey, said he was 'disgusted' when he first spotted the man performing the routine last Saturday. \nIt was just one day after 38 people, a majority of them British, were massacred as they lay on a beach in Sousse, Tunisia. \nMr Dodkin said he and several other British tourists brought it up with staff at Domina Coral Bay Hotel in Sharm El Sheik, but to his shock, the same procedure was repeated less than a week later. \nMr Dodkin spotted the man running towards him and took the photos on Friday, just before Britain held a minute's silence to remember those killed on the beach at Sousse. \nAlthough the photographs were taken during the employee's second appearance, Mr Dodkin says that he performed the same routine days earlier, believed to be made out to look like a James Bond skit. \nMr Dodkin, who is still in Egypt on holiday with his son, booked through British agency VeryCheapHolidays, who are investigating the matter. \nMeanwhile, security has been tightened at Egypt's holiday resorts with extra armed guards protecting Sharm El Sheikh and Hurghada in the wake of the massacre in Tunisia. \nThe rise of ISIS in Egypt has put the country's holiday resorts - where 900,000 Brits holiday every year - on high alert with armed guards on patrol around the beach and hotels. \nTourism earns Egypt £3.7billion a year and Tunisia admitted that last week's atrocity in Sousse had cost the country at least £330million in cancelled bookings. \nThe Foreign Office has confirmed that 'enhanced security measures are in place to protect the Sharm el-Sheikh and Hurghada [across the Read Sea] resort areas'. \nOf the 38 holidaymakers who were killed by Seifeddine Rezgui when he opened fire in the resort of Sousse last Friday 30 were British. Three Irish nationals, two Germans, one Belgian, one Portuguese and one Russian were among the dead.", "external_links": [], "published": "2015-07-04T05:46:00.000+03:00", "crawled": "2015-07-04T07:14:04.000+03:00", "highlightTitle": ""}