{"organizations": [], "uuid": "2199379e0f9dd8dbff4b4f2172dbb7b77f304edf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61931/business-travelers-driving-online-retail-high-value-goods", "country": "US", "title": "Business travelers driving online retail for high value goods", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Business travelers driving online retail for high value goods", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:47:00.000+03:00", "replies_count": 0, "uuid": "2199379e0f9dd8dbff4b4f2172dbb7b77f304edf"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61931/business-travelers-driving-online-retail-high-value-goods", "ord_in_thread": 0, "title": "Business travelers driving online retail for high value goods", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business travelers driving online retail for high value goods Adv: \nJul 28, 2015 Adv: \nMOUNTAIN VIEW, CA - New research reveals that three in four business travelers do more than half of their shopping online and are three-and-a-half times as likely to have spent over $1,000 online in the past six months, compared to non-travelers. The study by ADARA, the leader in leveraging global travel data to drive future business performance, demonstrates business traveler preferences for high value items including consumer electronics, personal insurance and electric or hybrid vehicles. \nBusiness travelers are frequently on the move and as a result, they are much more reliant on connected devices and engaging with online content than the average population. More than eight in 10 business travelers rely on their smartphone (85%) and tablet (89%) to complete purchase activity, and the time spent online on mobile devices is 40 percent higher than the general population. \nBusiness travelers heavily rely on online media to make purchase decisions, and the study shows that they ultimately conduct more research before booking flights or hotels than the average consumer. Elizabeth Harz, president of media, ADARA explains, \"Business travelers are a desirable audience for marketers looking to promote higher-value products. They are twice as likely to earn salaries over $100,000 and use online media significantly more to make purchase decisions, compared to the average consumer. Having a clear understanding of how and when to engage business travelers with online content can yield significant impact for marketers.\" \nBusiness travelers are in the market to switch financial products and favor credit card rewards. \nApproximately one-third (30%) of business travelers will consider switching their bank in the next year compared to fourteen percent and three percent of leisure travelers and non-travelers, respectively. In addition, business travelers are four times more likely (81%) to use mobile devices for online banking than non-travelers (21%). \nRegarding personal insurance, business travelers are twice as likely to have life insurance (77%) compared to non-travelers (41%), and 30 percent plan to switch their home insurance in the near future, compared to only one percent of non-travelers. \nCredit card rewards are appealing to the U.S. business traveler community, as nearly eight in 10 cite this as a main factor influencing a purchase decision. Consequently, this group is twice as likely as non-travelers to own a premium credit card. \n40 percent of business travelers identify as early tech adopters. \nElectronic goods are a leading purchase category for business travelers; two in three (62%) spend money on technology products, compared to only 35 percent of non-travelers. \nFor example, 69 percent of business travelers own a tablet and 35 percent own a Smart TV, compared to only 28 percent and 10 percent of non-travelers, respectively. \nBusiness travelers are five times more likely than the average non-traveler to own a car worth more than $35,000. \nAutomotive marketing is heavily biased toward key audience segments, and not surprisingly, those who are considering purchasing a vehicle. For business travelers, buying a new car is high on their list of priorities; two in three (62%) are looking to purchase a new vehicle within the next year. This compares to only 39 percent of leisure travelers and 12 percent of non-travelers. Additionally, one in five business travelers plan to buy an electric vehicle and one in three plan to purchase a hybrid vehicle. \nOne in five own a sports car or coupe (20%) compared to 16 percent of leisure travelers and 10 percent of non-travelers. Eleven percent own a convertible, compared to only three percent of non-travelers. These figures should help steer luxury car manufacturers to focus more attention and marketing campaigns on business travelers. \nUltimately, the research from ADARA proves that business travelers are an affluent, tech-savvy and loyal audience, and should be considered in a brand's overall marketing strategy.", "external_links": [], "published": "2015-07-28T19:47:00.000+03:00", "crawled": "2015-07-28T22:27:08.854+03:00", "highlightTitle": ""}