{"organizations": [], "uuid": "c49c66a6af7a7e910791ef081d09b9d76cefdfca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/910f2ded0d665ce287daaa281c01eef77ca61588/c=0-53-3297-1915&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/07/15/USATODAY/USATODAY/635725481756408020-AP-Free-Rooms-Tax.jpg", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/travel/advice/2015/07/15/jdpower-hotel-satisfaction-survey/30158491/", "country": "US", "title": "J.D. Power ranks hotel brands for guest satisfaction", "performance_score": 0, "site": "usatoday.com", "participants_count": 2, "title_full": "J.D. Power ranks hotel brands for guest satisfaction", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T17:12:00.000+03:00", "replies_count": 1, "uuid": "e68fc86e3a0fd9759d595332b28d46de1c6655f9"}, "author": "Nancy Trejos , USA TODAY", "url": "http://www.usatoday.com/story/travel/advice/2015/07/15/jdpower-hotel-satisfaction-survey/30158491/#post-0", "ord_in_thread": 0, "title": "J.D. Power ranks hotel brands for guest satisfaction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ritz-Carlton earned the highest customer satisfaction score in the luxury hotels category. (Photo: Marvin Fong, AP)\n11 CONNECT 17 TWEET 9 LINKEDIN 1 COMMENT EMAIL MORE Travelers are more satisfied than ever with their hotels just as the number of complaints has dropped significantly, a new study released today shows.\nOverall satisfaction in hotels in 2015 reached a score of 804, up 20 points from last year, according to J.D. Power and Associates' 19th annual survey of North American hotel guests. It's the first time satisfaction has surpassed the 800-point mark on the 1,000-point scale.\nAt the same time, there was a 20% reduction in the number of guests who reported a problem during their stay. It was the lowest rate of complaints since 2006.\nThe survey is based on responses gathered between June 2014 and May 2015 from more than 62,000 guests in Canada and the United States. The guests stayed at a hotel in North America between May 2014 and May 2015.\nAmong the factors taken into consideration were the reservations and the check-in/check-out experience, food and beverage options, hotel services and facilities, and costs and fees.\nHotels of all price points were examined including luxury, extended stay, and budget.\nThe survey found that employee demeanor has a significant impact on how satisfied guests are. The average number of problems experienced when a staff member greeted guests with a smile \"all the time\" dropped 50%, compared to when they were smiled at only \"sometimes.\"\nRick Garlick, global travel and hospitality practice lead at J.D. Power, says hotels can improve satisfaction by better focusing on guests' needs.\nGuests who believed that hotel employees anticipated their needs had a satisfaction rate of 912 vs. a rate of 602 among those who felt their needs were neglected.\nThe study also shows that guests are more loyal when they walk away from their stay \"delighted.\" Among those who were delighted, 80% said they \"definitely will\" recommend the hotel to a friend, relative or colleague. And 66% said they would stay again. Only 4% of those who were disappointed said they would return.\n\"Hotels that proactively meet guest needs have the ability to create a positive guest experience,\" Garlick says. \"Hotel staff members need to maintain a proper balance between proactively addressing needs and responding to problems effectively. Doing so can help guests feel good about their selection of the hotel brand and increase the likelihood they will return for another stay or recommend it to others.\"\nThose travelers who picked hotels based primarily on price were less satisfied than those who researched a property to make sure it would meet their needs.\nSome hotel brands have earned the highest satisfaction rates for multiple years.\nMicrotel Inn & Suites by Wyndham was the top choice among the economy/budget segments for the third consecutive year.\nHomewood Suites by Hilton had the highest rate for upper extended stay properties for a third consecutive year.\nCandlewood Suites earned the highest marks among extended stay brands for a second straight year.\nAnd Drury Hotels, previously the highest-ranking brand in the midscale category for nine straight years, earned top honors in the upper midscale segment.\nHere is the full list of hotel brands with the highest guest-satisfaction scores, by category:\nLuxury: The Ritz-Carlton Upper Upscale: Omni Hotels & Resorts Upscale: Hyatt Place Upper Midscale: Drury Hotels Midscale: Wingate by Wyndham Economy/Budget: Microtel Inn & Suites by Wyndham Upper Extended Stay: Homewood Suites by Hilton Extended Stay: Candlewood Suites 11 CONNECT 17 TWEET 9 LINKEDIN 1 //usat.ly/1IZZNVl TOP VIDEOS", "external_links": ["http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1IZZNVl&mini=true", "http://www.gannett-cdn.com/-mm-/4fe6cbe6318b990624cb35ccc9eba0191a63f519/c=66-0-3110-2289&r=x404&c=534x401/local/-/media/2015/07/15/USATODAY/USATODAY/635725481756408020-AP-Free-Rooms-Tax.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1IZZNVl&text=J.D.%20Power%20ranks%20hotel%20brands%20for%20guest%20satisfaction&via=usatoday", "http://usat.ly/1IZZNVl", "http://www.gannett-cdn.com/media/2015/07/15/USATODAY/USATODAY/635725481756408020-AP-Free-Rooms-Tax.jpg"], "published": "2015-07-15T17:12:00.000+03:00", "crawled": "2015-07-15T19:41:45.000+03:00", "highlightTitle": ""}