{"organizations": [], "uuid": "837c2cece93aea1eabf86bffe26be1f97ca3792f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "TRAVEL DESTINATION NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/revealing-new-documentary-on-cuba-airs-august-9th-as-u-s-begins-normalization-with-island-neighbor/", "country": "US", "title": "Revealing new documentary on Cuba Airs August 9th as U.S. begins normalization with island neighbor", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Revealing new documentary on Cuba Airs August 9th as U.S. begins normalization with island neighbor | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "837c2cece93aea1eabf86bffe26be1f97ca3792f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/revealing-new-documentary-on-cuba-airs-august-9th-as-u-s-begins-normalization-with-island-neighbor/", "ord_in_thread": 0, "title": "Revealing new documentary on Cuba Airs August 9th as U.S. begins normalization with island neighbor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Revealing new documentary on Cuba Airs August 9th as U.S. begins normalization with island neighbor Published on : Thursday, July 30, 2015\nAs the United States and Cuba move toward normal relations for the first time in more than 54 years, a remarkable documentary film profiles a unique collection of people who are pushing the boundaries and “Reinventing Cuba.”\nThe one hour documentary film, “Reinventing Cuba,” goes beyond the stereotypes – beyond cigars and salsa, beyond mojitos and Malecón, beyond antique American cars and decaying architecture to reveal an extraordinary nation eager to embrace change.\nCorrespondent Gerry Hadden – a long time Cuba watcher – takes viewers on a personal journey. He meets little league sluggers defying the odds and dreaming of the majors; doctors and medical researchers saving lives; hustlers finding ways around limited internet connections; artists and designers at the height of creativity; and black marketeers selling a vital entertainment and information device called “the package.”\nCut off from America by decades of hostility, living in conditions of scarcity and political restrictions, the Cubans emerge here as a people making something out of nothing with whatever is at hand.\nHadden portrays vibrant, hopeful, and resourceful characters facing enormous challenges in today’s Cuba. He reveals an often overlooked, burgeoning, middle class that is at the forefront of what will likely be Cuba’s future as it moves into a new era.\n“Reinventing Cuba” has its first airing Sunday August 9 th , a few days before John Kerry becomes the first U-S Secretary of State to visit Havana in 60 years.\nThe documentary is directed by Humberto Duran ; filmed by Amando Guerra and Josep Alfero . It is produced by the North American production center of China Central Television. Executive Producers are Ma Jing , Mei Yan and Guo Chun .\n“Reinventing Cuba” can be seen August 9 th at 7pm US eastern time, nationally on Dish Network Channel 279 and on the ‘CCTV News’ channels in New York , Washington D.C., and Los Angeles.\nTime Warner 221 and Verizon FiOS 277 in New York .\nComcast 273, Cox 472, RCN 32, Verizon FiOS 458 in Washington D.C.\nTime Warner 155 and Charter 562 in Los Angeles .", "external_links": [], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-31T18:23:22.853+03:00", "highlightTitle": ""}