{"organizations": [], "uuid": "ee12c9bd9eb9d72f66b303bf421285cb6e159979", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/07/02/Others/Images/2015-07-02/BOP-2015-BJM13521435869070.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel: Travel News, Guides, Deals, Hotels, Vacation Ideas &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/style/at-the-national-building-museum-its-all-beach-balls-no-water/2015/07/02/afcbeee2-20dd-11e5-aeb9-a411a84c9d55_story.html", "country": "US", "title": "At the National Building Museum’s beach, you’ll have a ball — or a million of them", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "At the National Building Museum’s beach, you’ll have a ball — or a million of them - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee12c9bd9eb9d72f66b303bf421285cb6e159979"}, "author": "By Maura Judkis", "url": "http://www.washingtonpost.com/lifestyle/style/at-the-national-building-museum-its-all-beach-balls-no-water/2015/07/02/afcbeee2-20dd-11e5-aeb9-a411a84c9d55_story.html", "ord_in_thread": 0, "title": "At the National Building Museum’s beach, you’ll have a ball — or a million of them", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Maura Judkis July 2 at 6:37 PM Follow @MauraJudkis Washington Post reporter Maura Judkis dives into the bubbly waters of “The Beach,” an exhibit at the National Building Museum. (McKenna Ewen/The Washington Post) If you close your eyes and concentrate, and if the people flopping around you flop in a particular rhythm, the nearly 1 million translucent plastic balls in the National Building Museum’s summer installation, “ The Beach ,” sound almost sort of exactly like waves crashing against the shore.\nBut open your eyes and here you are, in the white cube art-gallery version of a McDonald’s PlayPlace. The monochromatic elevated room in the museum’s Great Hall offers kids and adults a gently sloping “shoreline” studded with white beach chairs and umbrellas, a boardwalk-style snack stand, and an ocean of tennis ball-sized spheres, best entered via a running cannonball off the pier. It opens to the public July 4.\nDesigned by Snarkitecture, a Brooklyn design studio consisting of founders Alex Mustonen and Daniel Arsham, “The Beach” is the museum’s follow-up to last summer’s Bjarke Ingels Group-designed maze, and the designer mini-golf course from the summer before. It’s an immersive experience that can be appreciated in ways both highbrow and low.\nFor the latter: Yep, it’s a 10,000-square-foot playpen.\nIt’s a place to take the kids when it’s raining and you’ve already seen “ Inside Out ” twice; where you can lounge in a beach chair and let them blissfully pummel each other with plastic balls despite the posted notice, certain to be ignored: “The beach balls are for swimming only. They are not for throwing.” No one has to wear sunscreen, or shake sand out of their shorts, or worry about jellyfish. Not to mention sharks.\nSarah Smith, 4, experiences a 10,000 sq-foot indoor \"beach\" in the National Building Museum. The \"ocean\" includes nearly one million recyclable, translucent plastic balls. (Bonnie Jo Mount/The Washington Post) “In some ways, it is what it is – it’s a place that’s full of balls that you can swim around and jump around in,” Mustonen said, as he floated near a circular island in the middle of his ocean. “But we’re really asking people to sort of consider it more as a place for contemplation and relaxation.”\nContemplate your childhood. Chances are, you haven’t been in a ball pit in, oh, several decades, and you’ve forgotten both its pleasures and its perils: The effortless floating, the thrill of being off-balance, the inevitable static-electricity hair. The balls force you to adopt an ungainly crawl, just like a kid.\n“You can’t really walk through them, you can’t really stand in them,” Mustonen said.\nThe difference between the way adults and children experience architecture was something Snarkitecture considered in the design.\n“For instance, a table is not a table” to a child, Mustonen said. “It’s an overhead structure that you walk under. Or a ramp becomes a playscape. The way that kids are more readily interested, or intuitively engage with and sort of misuse their surroundings, are things that we’re interested in inviting a wider audience to do.”\nRelaxation might be a tall order. Germophobes may take some small comfort in the fact that the balls are all made with an antimicrobial substance, and that the exhibit is sprayed down with cleaning solution daily. The balls are soft — comfortable, even — but when there are lots of people rustling around in them, it might take some vigilance to avoid getting elbowed. Will there be an adult swim? One hopes.\nA \"sea\" of journalists swim during a press preview of the exhibition. (Bonnie Jo Mount/The Washington Post) “I’m not big on crowded beaches, so maybe it’s like, a morning kind of thing,” Mustonen said. “Go on a weekday morning so you can have the experience of having the place to yourself for a minute.”\nIt’s all rendered in pristine white. (Here’s some snark: How white is it going to look after 1,000 people and a few dropped ice cream sandwiches?) The only things getting in the way are the National Building Museum’s grand columns, in a yellow faux marble, which interrupt the sightline. Swim past them, and you’ll see yourself reflected in a mirror meant to emulate the horizon.\n“There’s all these little references that are in here” — to McDonald’s, boardwalks, and other Americana — “and they’ve all been sort of abstracted or tweaked. In this case, it’s removing the color, and it’s also increasing the scale,” Mustonen said. “All these manipulations or alterations are designed to sort of change your perception and understanding of the environment.”\nNot coincidentally, the monochrome environs are also a perfect photo op. Expect many, many selfies to be taken at this beach. As with so many participatory exhibits, it’s possible that a certain demographic will experience it less as a tactile piece of art than as an elaborate Instagram souvenir.\nBut just as at the real beach, it can be dangerous to take your phone into the water. The balls keep people afloat, but small items sink quickly. Marketing and communications manager Emma Filar said that the museum anticipates a robust lost and found — and a windfall in loose change.\n“We’ll make a few bucks that way,” she said.", "external_links": ["http://www.nbm.org/exhibitions-collections/exhibitions/the-beach.html", "http://s3.amazonaws.com/posttv-thumbnails-prod/thumbnails/5595b79ee4b082c8417f49ae/thumb.jpg", "https://twitter.com/@MauraJudkis"], "published": "2015-07-02T03:00:00.000+03:00", "crawled": "2015-07-03T02:50:27.000+03:00", "highlightTitle": ""}