{"organizations": [], "uuid": "2cf19b4d180131aee20cee7a66eba6ca6accc1d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/04/pata.png", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/horwath-htl-pata-announce-partnership-pata-investment-forum/", "country": "US", "title": "Horwath HTL and PATA Announce Partnership for PATA Investment ForumTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Horwath HTL and PATA Announce Partnership for PATA Investment ForumTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "2cf19b4d180131aee20cee7a66eba6ca6accc1d3"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/horwath-htl-pata-announce-partnership-pata-investment-forum/", "ord_in_thread": 0, "title": "Horwath HTL and PATA Announce Partnership for PATA Investment ForumTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Horwath HTL and PATA announces partnership for PATA Investment Forum\nThe Pacific Asia Travel Association (PATA) and hospitality consulting firm, Horwath HTL, announced a joint partnership for the organisation of the PATA Investment Forum taking place prior to PATA Travel Mart 2015, in Bangalore, India, on Monday, September 7, 2015 from 1400-1730 hrs.\nMario Hardy, CEO, PATA, said, “The state of Karnataka and the city of Bangalore have much to offer tourists, with its rich heritage and culture. There is tremendous potential for the responsible development of tourism in the state, which can be achieved with the right investments in place. The PATA Investment Forum will allow travel and tourism professionals in the state the opportunity to learn how to unlock this potential.”\nThe PATA Investment Forum will focus on two specific areas, government and policy, and commercial and private, allowing delegates to gain greater insights and knowledge to grow their business.\nVijay Thacker, Director, Horwath HTL India, said, “We are delighted to associate with PATA to create a special discussion forum on investment and development opportunities for the India market. The presence of government and private sector players at the Forum will enable an open discussion towards resolving development issues.”\nFor 37 years, PATA Travel Mart has offered delegates the opportunity to do business, network, and learn, through a variety of dynamic programs and platforms. The event showcases the latest travel products and services, bringing together hundreds of international industry buyers and sellers.\nSource:-PATA\nRelated Posts San francisco travel achieves leed gold certification PATA Visitor Arrival Forecasts: Arrivals Well on Track with Forecasts Country-specific economic trends to effect business travel in 2014 ITB Berlin: Cross-border cooperation on the Danube National Restaurant Association Commends House Ways & Means Passage of Anti-Hunger Measure", "external_links": [], "published": "2015-07-14T03:00:00.000+03:00", "crawled": "2015-07-15T20:13:40.000+03:00", "highlightTitle": ""}