{"organizations": ["Postmedia Network First"], "uuid": "a26427708080dce03a1b7527f3710fc478008dd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ottawasun.com", "main_image": "http://storage.ottawasun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297724176752_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.ottawasun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.ottawasun.com/2015/07/14/top-summer-travel-deals---2015", "country": "CA", "title": "Top summer travel deals - 2015 [Photos]", "performance_score": 0, "site": "ottawasun.com", "participants_count": 0, "title_full": "Top summer travel deals - 2015 [Photos]", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T15:00:00.000+03:00", "replies_count": 0, "uuid": "a26427708080dce03a1b7527f3710fc478008dd5"}, "author": "", "url": "http://www.ottawasun.com/2015/07/14/top-summer-travel-deals---2015", "ord_in_thread": 0, "title": "Top summer travel deals - 2015 [Photos]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nicole Feenstra"], "text": "By Nicole Feenstra , Postmedia Network First posted: Friday, July 17, 2015 08:00 AM EDT Top summer travel deals - 2015 Previous Next \nThe summer travel season is here, but that doesn't mean your family needs to spend a lot to have a memorable vacation. We list our 10 favourite travel deals and packages across North America, perfect for families looking to escape this season. Montreal: Escape to Quebec this summer with a stay at the centrally-located Le Centre Sheraton Montreal. The hotel is offering a special Family Fun package this summer, which lets guests enjoy two free tickets for children 12 and under -- with the purchase of one regular-priced adult ticket -- to attractions like the Biodome and Montreal Science Centre. The package also features an in-room movie per night and welcome snack. Rates start at $179 per night. See sheratoncentremontreal.com for more details and book with code OFFERS. (Courtesy Starwood Hotels & Resorts) \nNiagara-on-the-Lake, Ont.: Take an escape to Ontario wine country. The Niagara Wine Escapes package from Marriott Fallsview Hotel & Spa includes one or two nights accommodations, two VIP wine tasting passes at Jackson Triggs and Inniskillin wineries, a $40 dinner voucher and buffet breakfast for two. Rates start at $189 per night. The package is available throughout the summer. See marriott.com for more details. (Courtesy Jackson Triggs) \nLas Vegas: Book your Sin City vacation on Vegas.com before Aug. 4, 2015 and save $100 instantly. This deal is only available to Canadians flying into Las Vegas with WestJet who book an air and hotel package with a stay at any Caesars Entertainment property. Participating hotels include Caesars Palace, Planet Hollywood and Flamingo. Enter code WESTJET when booking your air and hotel package on Vegas.com. (Fotolia) \nToronto: Get in the spirit of Toronto's 2015 Pan Am and Parapan Games with the InterContinental Toronto Centre. The hotel's Pan Am/Parapan Am Games package, available through Aug. 31, 2015, features accommodations for two and welcome bag that features a Pan Am water bottle, TTC day pass, Vitamin water and Spa InterContinental spa dollars. Rates start at $249 per night. See torontocentre.intercontinental.com for more information. (Courtesy InterContinental Toronto Centre) \nVancouver: Go on a sightseeing adventure of the Vancouver Inner Harbour with Sea Vancouver and the Westin Bayshore hotel. This thrilling package includes accommodations at the picturesque Westin Bayshore and a 90-minute waterfront sightseeing tour. The skipper aboard Sea Vancouver's vessel will pick guests up right at the marina connected to the hotel. Package available until Oct. 15, 2015. See westinbayshore.com for full details or book with code SEAVAN. (Courtesy Brian Caissie/Sea Vancouver) \nAlberta: Hit the greens this summer! The Canadian Rockies Golf group is offering the Playin’ & Savin’ in the Canadian Rockies package, with four nights and three rounds of golf at some of Alberta's most stunning properties. Guests get their choice of tee time at the Fairmont Banff Springs, the Fairmont Jasper Park Lodge, Canmore Golf & Curling Club and other participating courses, plus accommodations at the Fairmont Banff Springs, Rimrock Resort Hotel or Blackstone Mountain Lodge. Your choice of adventure -- Banff Gondola Ride, Banff Lake Cruise, Glacier Adventure or Glacier Skywalk -- after your round of golf is also included. Rates start at $1,249. See canadianrockiesgolf.net for full details. (Courtesy Canadian Rockies Golf) \nVictoria: Head to the British Columbia capital and explore all the attractions the city has to offer. The Inn at Laurel Point wants to help you do just that this summer with the Key to the City program. This discount card provides deals at a number of locally-owned, independent businesses (just like the Inn at Laurel Point itself), from 10% off whale watching tours to 20% off at the Royal BC Museum. The Key to the City is available until Sept. 30, 2015 to any guests checking in to the Inn at Laurel Point. For full details and a list of participating businesses, see laurelpoint.com. (Courtesy Inn at Laurel Point) \nNew York City: Summer is wedding season and there's no more exciting city to celebrate your nuptials in than the Big Apple. The Gansevoort Meatpacking NYC and Gansevoort Park Avenue NYC are offering two packages for brides-and-grooms-to-be: the Bachelorette’s Best Man and Bachelor Pad Weekend. The Bachelorette’s Best Man package includes discounts on a 'manservant' who will cater to the bride and her bridesmaids' every whim. Accommodations and complimentary champagne are also included with this package. This package is available until Aug. 31, 2015. Meanwhile, the Bachelor Pad Weekend package includes night club VIP passes, late check-out, a 'Groom-to-be-Kit' and a 60-minute massage. This package is available until Dec. 30, 2015. Rates start at $1,050 at Gansevoort Park Avenue NYC and $1,150 at Gansevoort Meatpacking NYC. For more details on both packages, see gansevoorthotelgroup.com. (Courtesy Gansevoort) \nOrlando: Experience fun in the dark at the Hilton Orlando, which promises a number of exciting family activities through Labour Day, with the added bonus of special nightly accommodation rates of $109. Enjoy Glow Game activities like a nine-hole glow-in-the-dark putting course, LED-powered basketball, water games and more. For full details, see thehiltonorlando.com. (Courtesy Hilton) \nUtah: Is ABC's The Bachelorette your summer guilty pleasure? Live the romance this summer at Park City's Montage Deer Valley - a property actually featured in the current season of the show! In week nine, the show whisks bachelorette Kaitlyn and her two remaining suitors to Montage Deer Valley for family meetings and the hotel is celebrating with the ultra-sweet Romance Rendezvous package. This package includes deluxe accommodations, rose petal turndown, chocolate-covered strawberries and dinner for two at the resort’s fine dining restaurant. See montagehotels.com for full details and book with code RR. (Courtesy Montage Deer Valley)", "external_links": [], "published": "2015-07-17T15:00:00.000+03:00", "crawled": "2015-07-17T16:08:53.000+03:00", "highlightTitle": ""}