{"organizations": ["Apex Air Team", "VistaJet"], "uuid": "6af2a4599eeaa62f6a3d6652b2a6298e3571d8a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://www.marketwire.com/library/MwGo/2015/7/21/11G048218/VistaJet_International-618226798799.jpg", "site_section": "http://www.marketwire.com/rss/mwTravelandHospitality.xml", "section_title": "Marketwired - Travel and Hospitality", "url": "http://www.marketwired.com/press-release/vistajet-and-apex-air-team-to-offer-domestic-flights-in-china-2040081.htm", "country": "CA", "title": "VistaJet and Apex Air Team to Offer Domestic Flights in China", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "VistaJet and Apex Air Team to Offer Domestic Flights in China", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T04:30:00.000+03:00", "replies_count": 0, "uuid": "6af2a4599eeaa62f6a3d6652b2a6298e3571d8a6"}, "author": "", "url": "http://www.marketwired.com/press-release/vistajet-and-apex-air-team-to-offer-domestic-flights-in-china-2040081.htm", "ord_in_thread": 0, "title": "VistaJet and Apex Air Team to Offer Domestic Flights in China", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 20, 2015 21:30 ET VistaJet and Apex Air Team to Offer Domestic Flights in China \nFirst China Registered Aircraft, a Challenger 850, Now at Apex Air's Base in Nantong \nSHANGHAI, CHINA --(Marketwired - July 20, 2015) - VistaJet, the global leader in premium long-range private jet travel, announced that Apex Air, a Civil Aviation Administration of China (CAAC) authorized business jet operator will manage and operate a China based fleet of aircraft for VistaJet's Flight Solution Program. VistaJet is poised to offer point-to-point service within China as soon as third quarter 2015 with the first Chinese registered aircraft, a Bombardier 1 Challenger 850 1 . Chinese customers will also have access to VistaJet's fleet of over 50 large-cabin, long-range Bombardier Challenger and Global aircraft when travelling on international flights. \n\"VistaJet has been operating international flights in and out of China for many years. Adding domestic flights through our partnership with Apex Air extends our service area to include one of private aviation's most exciting new markets,\" said Thomas Flohr, Founder and Chairman, VistaJet. \"China is an important growth market for VistaJet and we expect it to be among the fastest growing regions for our product offering over the next few years. We are already seeing demand for our domestic service which is scheduled to begin in next months,\" Continued Mr. Flohr. \n\"VistaJet's cooperative partnership with Apex Air is key to growing our business in the region. Their management team are aviation pioneers in China, having accumulated years of first hand experience running commercial operations in the country. They share VistaJet's entrepreneurial spirit and drive for excellence. We are delighted to share this achievement with Apex Air, who have been integral in helping us become the first global private aviation company to offer large-cabin business aircraft for operation in China,\" continued Mr. Flohr. \n\"The entire team at Apex Air is proud to celebrate this milestone with VistaJet. Our dedicated and experienced team is committed to delivering a seamless VistaJet flight experience to customers in China. We look forward to providing the highest level of service and attention to detail that VistaJet passengers enjoy worldwide,\" said Mr. Dan Ho, Chairman of Apex Air. \nAbout VistaJet : Founded in 2004 by Thomas Flohr, VistaJet has established itself as the global leader in premium long-range private jet travel by consistently providing excellent service and unrivalled quality to its fast growing clientele, connecting them to every corner of the world with point-to-point coverage. VistaJet operates a young fleet -- total fleet average age is under two years -- of over 50 Bombardier 1 Global 1 and Challenger 1 business aircraft and offers the industry's largest service area, covering all major markets. The Company's unique and successful business model provides all the benefits of owning a personal jet without the responsibilities or asset risk of ownership. Strong and resilient revenue growth, an expanding margin and a sophisticated fleet financing structure are among the drivers for VistaJet to consistently outperform the market in this high-growth segment of the private aviation industry. \nIn May 2015, VistaJet successfully raised the first ever senior unsecured bond by a private aviation company, valued at US $300 million, due to the strength of its finances, depth of its executive team's experience in the industry and unique premium service offering. \nVistaJet operates under the unique vision of Founder and Chairman Thomas Flohr, an exceptionally qualified senior management team and over 600 aviation professionals working from VistaJet offices around the world. \nVistaJet aircraft have to date visited over 180 countries, landed at 1,320 airports worldwide, logged over 70,000 flights and carried over 165,000 passengers. News and information are available at www.vistajet.com . \nAbout Apex Air : Established in July 2014, Apex Air is a Civil Aviation Administration of China (CAAC) authorized A-category CCAR-135 business jet operator, mainly engaged in business flights, charter, flight rental, air tours and flying clubs. Apex has a solid strength in airline hosting with Nantong, Jiangsu Province as its main operating bases, targeted to the customers mainly in North region, Yangtze River Delta region and Pearl River Delta region of China. Apex Air owns a private MRO (Maintenance, Repair and Overhaul) specializing in maintenance of general aviation and business aircraft. The maintenance support and facilities ensure all flight operations in China run smoothly. \nThe company's flight instructors have decades of experience operating various aircraft types on international and regional routes. All dispatchers are dispatch license holders authorized by the CAAC, with years of experience in flight planning and ground handling services. \nAbout Thomas Flohr, Chairman and Founder : Thomas Flohr founded VistaJet in 2004 and remains its sole shareholder. Under his leadership VistaJet has become the global market leader in business aviation. \nThomas holds a Diploma in Business and Political Science from Ludwig-Maximilian University in Munich, starting his career with computing and finance company Comdisco, a leading provider in the IT financing sector as in 1985. He was appointed European president in 1995, and was subsequently made President of Comdisco (finance) worldwide in 1997. He later acquired Comdisco Switzerland and Germany -- now Comprendium Investment SA, which he subsequently sold. \nFor over ten years Thomas Flohr has grown VistaJet from 3 jets operating in Austria to over 50 jets flying in every major continent. \n1 Either registered or unregistered trademarks of Bombardier Inc. or its subsidiaries. Contact Information", "external_links": [], "published": "2015-07-21T04:30:00.000+03:00", "crawled": "2015-07-21T05:35:18.146+03:00", "highlightTitle": ""}