{"organizations": [], "uuid": "38942f68335fe1b3f2befdd027ba00e0bf19b223", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/The-Caramels.jpg", "site_section": "http://www.ticotimes.net/categories/topics/restaurants", "section_title": "Dining and Nightlife Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/24/im-gonna-find-some-girls-and-were-gonna-rock-meet-the-caramels", "country": "US", "title": "'I'm gonna find some girls, and we're gonna rock' – Meet The Caramels", "performance_score": 0, "site": "ticotimes.net", "participants_count": 2, "title_full": "'I'm gonna find some girls, and we're gonna rock' – Meet The Caramels -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T16:20:00.000+03:00", "replies_count": 1, "uuid": "38942f68335fe1b3f2befdd027ba00e0bf19b223"}, "author": "Amanda Zuniga", "url": "http://www.ticotimes.net/2015/07/24/im-gonna-find-some-girls-and-were-gonna-rock-meet-the-caramels", "ord_in_thread": 0, "title": "'I'm gonna find some girls, and we're gonna rock' – Meet The Caramels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "“The Caramels” might have a sweet name, but there’s nothing docile about their music. The five women who make up this new Costa Rican rock band have become stage-name sisters, sharing the same dulcet apellido : singer Lucía Caramel (18), guitarists Ivannia Caramel (21) and Valeria Caramel (25), Alexa Caramel (20) on bass and Christina Caramel (28) on drums. The band came to life in 2013 when Ivannia was inspired to create an all-women band to spread rock legacy. The Tico Times caught up with the group to talk about their two-year history, their upcoming projects, and how their musical ‘experiment’ has exceed their expectations.\nTT: How did “The Caramels” come to be?\nIvannia: It was more sort of an experiment. I never imagined it would go this far. I thought, “I’m gonna find some girls, and we’re gonna rock.” Since the beginning we’ve wanted to play our original music, but, as with everything, you have to start at the beginning, so at first we played covers from our favorite rock bands. With the passage of time we’ve started writing our own music.\nWhere did your name come from?\nWe’ve always wanted to make things different, you know, to really make a difference. So, we had the idea of giving out caramels after our concerts. Then, we thought, OH! “The Caramels” it would be a representative name for the band, and it sounds funny and feminine.\nWhat have the past two years been like?\nWell, we’ve had several members since it started. Lucía and I are the ones who have stayed since the very beginning. It has been quite difficult to get a solid group together. At first, it is always about trying and failing over and over. That’s why we decided to start playing only covers before writing our own original songs. This is the first time the band is really solid; we are all committed to the band. That’s also why we’re now releasing original songs and our first video, “Rocking Girls.”\nWhat are your main influences in your music, not only in the covers you play but also in your original work?\nThe music we play is rock, in all its variations. To be more specific, 80’s rock like Joan Jett, Queen, Kiss, Metallica and AC/DC. Our main influences are definitely classic rock and glam rock.\nIn writing [our own music], it is the same: we make our music based on what we like. At the moment, Lucia and I are the ones who have written songs, but the idea is that we all participate and make our music all together. We have four original songs right now. In addition to “Rocking Girls,” the songs are “Stepping Out,” “Scream of Denial” and “One More Time.”\nTell me about “Rocking Girls,” your first video.\nThe process of making it has been really difficult. We have been trying to do it for a long time, but it is a hard task. A friend of us came and told us he was going to help us; he said, “You have two weeks to be ready to shoot it.” So we did it.\nWith this video, we wanted to do something simple but professional at the same time. We chose “Rocking Girls” because it is like our calling card; it’s the perfect song to people to get to know us. It’s really representative of the group. We want to release an E.P. once we have six original songs. If we write more, we will release an album.\nWhich are the influences each one of you brings to the band?\nIvannia: I really like jazz and blues. I’d say that’s my little personal touch. For example, if we are playing a traditional rock song, I try to add something different, more like me: some different chords, or something to make a mark on the song.\nChristina: I’m the one who has more “heavy” likes, so I’ve try to add that kind of touch to our music and also the covers. We don’t play them exactly the way they are. We also add our style to them, and mine is that, the heavy music.\nValeria: I’m like a mixture of Christina and Ivannia. I listen all kind of music. My major influences are progressive rock and jazz. I always try to make up melodies which actually say something, transmit the message.\nAlexa: I love rock, all its variations. I’m always looking for ideas we all can use. What I enjoy the most about playing in concerts is that you don’t just go and play and that’s all. I always try to transmit my love for music, and it’s great to see the public enjoying the music along with me.\nWhere can your fans find more information?\nMainly on our Facebook page or YouTube channel. We also have Instagram, Twitter and our website .\nTake a look at the band’s new video, “Rocking Girls,” below – or check them out tonight (July 24) at MundoLoco El Chante, San Pedro, San José. 9:30 p.m. ₡3,000 ($6). More info at 2253-4125.", "external_links": ["https://www.youtube.com/embed/BXbrMWwhDQY?feature=oembed", "http://www.thecaramels.com/", "https://www.facebook.com/thecaramels"], "published": "2015-07-24T16:20:00.000+03:00", "crawled": "2015-07-25T13:25:56.139+03:00", "highlightTitle": ""}