{"organizations": [], "uuid": "ae4f2634ec9a685eb6448bef82749f46c4613070", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/02/Denver-International-Airport-CEO-Kim-Day.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/tripadvisor-announces-top-10-burger-restaurants-america/", "country": "US", "title": "Denver International Airport passenger traffic increased in May 2015", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Denver International Airport passenger traffic increased in May 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T08:11:00.000+03:00", "replies_count": 0, "uuid": "c5f3f03547eb648ed7a88e69116208ae25c7457d"}, "author": "Alok", "url": "http://www.travelandtourworld.com/news/article/denver-international-airport-passenger-traffic-increased-may-2015/", "ord_in_thread": 0, "title": "Denver International Airport passenger traffic increased in May 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  AIRLINE NEWS » Denver International Airport passenger traffic increased in May 2015 Denver International Airport passenger traffic increased in May 2015 Published on : Thursday, July 2, 2015 \nDenver International Airport (DIA)’s international passenger traffic increased with 183,627 passengers in May 2015 compared to 182,691 passengers the prior year. United Airlines, Southwest Airlines, British Airways, Icelandair and Volaris each had strong international increases. \n\nOverall passenger traffic declined slightly by 0.7 percent from May 2014 with 4,532,025 passengers in May 2015. The decline was primarily due to a 41-percent decrease in seat capacity by Frontier this May compared to last May. United Airlines’ passenger traffic increased over five percent, with a four percent capacity increase, while Southwest Airlines’ passengers increased by over 15 percent, with a nearly 12 percent capacity increase. Additionally, Spirit Airlines, American Airlines and Delta had increases in passengers for May. \n\n“We are continuing to see strong passenger growth from the majority of the airlines at Denver International Airport,” said DIA CEO Kim Day. “In particular, United and Southwest continue to show trend setting passenger growth, and the summer is off to a healthy start.” \nAdditionally, mail, freight and express cargo operations handled 43,627,958 pounds of cargo, a 4-percent increase in May compared to the same month last year. United Airlines, Southwest Airlines and Lufthansa increased their cargo, while FedEx and UPS had slight decreases. This was the highest cargo total for the month of May since 2011. Year-to-date cargo totals over 223 million pounds, which is nearly a 10-percent increase over the same period in 2014.", "external_links": [], "published": "2015-07-02T08:11:00.000+03:00", "crawled": "2015-07-02T08:24:19.000+03:00", "highlightTitle": ""}