{"organizations": [], "uuid": "6de53f366b494fdbce5296d340c1a1261ad952af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/x/z/2/l/image.related.StuffLandscapeSixteenByNine.620x349.15xz1s.png/1437528165263.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/usa/70449328/Virgin-Hotel-Chicago-review-Endearing-quirks-and-cool-sass", "country": "AU", "title": "Virgin Hotel, Chicago, review: Endearing quirks and cool sass", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Virgin Hotel, Chicago, review: Endearing quirks and cool sass", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T04:22:00.000+03:00", "replies_count": 0, "uuid": "6de53f366b494fdbce5296d340c1a1261ad952af"}, "author": "David Whitley", "url": "http://www.stuff.co.nz/travel/destinations/usa/70449328/Virgin-Hotel-Chicago-review-Endearing-quirks-and-cool-sass", "ord_in_thread": 0, "title": "Virgin Hotel, Chicago, review: Endearing quirks and cool sass", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Virgin Hotel, Chicago, review: Endearing quirks and cool sass DAVID WHITLEY Last updated 13:22, July 22 2015 \nThe roof-top bar is a popular spot. \nThe first in the planned chain of Virgin Hotels has the happiest happy hour you can find. \nTHE PLACE \nThe Virgin Hotel, Chicago \nTHE LOCATION \nAt the northern end of Chicago's equivalent of the CBD – the Loop – the hotel is a few steps away from the river, within easy reach of numerous public transport stops. The Lake/ Clark stop for the blue line going to the airport is a handy three blocks away – so no need for a taxi. \nEntry is through the bathroom and into the bedroom. Photo: Virgin Hotel Chicago \nTHE SPACE \nRichard Branson has dipped his fingers into yet another pie, this time attempting to bring the Virgin touch to the hotel scene. This converted bank building in Chicago is the first in a mooted chain, and brings in equal parts endearing quirks and knowingly cool sass. An \"ambassador\" in a bright red dress greets new arrivals, famous paintings are recreated with cuddly toys above the reception desk, and ceramic dogs stand guard outside the pet-friendly rooms. \nAt the weekend, long queues form outside to get into the L-shaped rooftop bar, which has lavish city views, while the downstairs coffee shop morphs into a wine bar at night. Ad Feedback \nTHE KIT \nIt's possible to download the hotel's app which allows you to check in via mobile phone, then control the room temperature and order room service from it. Quite why this is better or quicker than doing things the normal way is difficult to fathom. Otherwise, there's very little tech for tech's sake. The internet is free (though not as fast as breathlessly boasted) and requires no password faff, while there's a glorious abundance of plug sockets for travellers toting multiple devices. \nTHE ROOM \nThe fairly spacious room has an unusual layout, with the first half being bathroom, desk and wardrobe, and a sliding door separating off the bed. It works though. There's a very conscious play for the female traveller, which is most notable in that first area – with a large vanity, brightly lit mirrors and a bench inside the shower for leg-shaving. \nThere's plenty of room to make a dramatic entrance. \nCOMFORT \nThere are plenty of clever touches elsewhere, too. The rug on the wooden floor is splashed with images of London buses and Tube signs; the rubber sheep in the shower raises a smile; the bedheads are couch-shaped for added comfort sitting up with a laptop; the kettle comes with proper Yorkshire tea rather than the filth US hotels usually inflict. Turndown service is mercifully on request only – so there's no door-banging while you're getting dressed. \nFOOD \nMiss Ricky's All-American Diner on the ground floor is snazzed-up bog standard Americana, but serves reasonably priced burgers, steak frites and breakfasts. Much more fun is the Commons Club on the second floor, which is open plan but cleverly divided into sections with distinct personalities. The massive semi-circular couch at the back seems designed for hanging with an entourage, while the library-esque section next to it has books such as The Joy of Swearing and risque board games to explore. There are some decently priced mains – a $25 Asian paella or $26 scallops with fava beans – but the emphasis is on snacking and sharing. The $13 pork belly tacos with tamarind, radish, cilantro​ and lime are tremendous. \nSTEPPING OUT \nTheatreland is a block away on State Street, the Chicago River is just to the north and the Magnificent Mile shopping strip starts there on Michigan Avenue. Most of the city's architectural landmarks are within easy walking distance – as is the ostentatiously art-filled Millennium Park. \nThe street frontage is easy to spot. \nTHE VERDICT \nThe Virgin gets the basics right in spades, but it's also superbly located, great fun, and surprisingly well priced. The only fault – noise from the El train as it rattles past at night – is not the hotel's doing, and earplugs are provided. Two extras – a mini bar with items priced at street prices and the social hour with free drinks in the Commons Club between 6pm and 7pm – elevate it to a level above merely very good. Especially for the sociable solo traveller. \nHIGHLIGHT \nAsking which free drinks the room key entitles you to during Happy Hour, and being told all of them. \nLOWLIGHT \nLight sleepers really aren't going to enjoy the noise of the \"L\" train rattling past. \nESSENTIALS \nKing rooms start at $245 in winter and $350 U in the summer peak season. 203 N Wabash Avenue, Chicago. See virginhotels.com . \nThe writer was a guest of Virgin Hotels and Choose Chicago ( ChooseChicago.com ).", "external_links": [], "published": "2015-07-22T04:22:00.000+03:00", "crawled": "2015-07-23T08:51:12.549+03:00", "highlightTitle": ""}