{"organizations": [], "uuid": "acdc3a5da5974a8c9d77334dffae6fbb9250484d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/5yM28wdjquTsilcfHTOgC25iDrCwEt6y/promo260156830&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/travel/australia/nsw-act", "section_title": "NSW and ACT | Sydney Travel and NSW Holidays | ACT Travel Holidays | The Advertiser", "url": "http://www.adelaidenow.com.au/news/south-australia/sa-unemployment-rate-now-82-per-cent-a-15-year-high/story-fni6uo1m-1227435004822", "country": "US", "title": "SA unemployment rate now 8.2 per cent — a 15-year high | The", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 5, "title_full": "SA unemployment rate now 8.2 per cent — a 15-year high | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T20:33:00.000+03:00", "replies_count": 4, "uuid": "7e01ed03a9c7f2a08f49e5810f7ca5adfa2bad26"}, "author": "Jackson Gothe-Snape", "url": "http://www.adelaidenow.com.au/news/south-australia/sa-unemployment-rate-now-82-per-cent-a-15-year-high/story-fni6uo1m-1227435004822#post-0", "ord_in_thread": 0, "title": "SA unemployment rate now 8.2 per cent — a 15-year high | The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SOUTH Australia’s jobs catastrophe has become a “human crisis” according to the state’s foremost business representative.\nAnd the staggering speed of the downturn has shocked even the state’s economic experts.\nAs SA’s unemployment rate moved past 8 per cent in June for the first time in 15 years, Business SA CEO Nigel McBride said “we can’t rationalise it or justify it, we just have to deal with it on the facts.”\n“This isn’t just an economic crisis, it’s a human crisis and the impact of this right across the state is starting to be felt,” he said.\n“Sadly we don’t see any reason why this is going to turn around.”\nSA’s unemployment rate rose to 8.2 per cent in June, as the state continues to shed thousands of jobs.\nABS data out this morning shows a drop of almost 6000 jobs in one month.\nState Employment Minister Gail Gago issued a statement following the announcement (read in full below).\nShe said the deterioration was a “real concern” and “as we move from a reliance on traditional manufacturing industries – coupled with collapsing commodities prices – we see South Australian unemployment rates really struggling.”\nBHP Billiton to cut 140 jobs in SA 1:15 Play video 40 jobs at BHP Billiton in Adelaide will be cut following a review of support functions within the company.\nSky News 25 Jun 2015 Business It is becoming obvious that the employment crisis is here to stay, with the trend rate — which smoothes out month to month volatility — rising to 7.8 per cent.\nThe last time unemployment was as high in SA as it is now was the year 2000.\nAssociate Professor John Spoehr from the University of Adelaide said the result was particularly bad for men.\n“In my view this is a male unemployment crisis,” he said.\nThe number of men employed in the state dropped by more than 8000 in June.\n“It’s been brewing for a while but now it’s obvious that we are in the midst of a male unemployment crisis that will get much worse as the effects of the auto closure and downturn in construction impact over the next year or so,” Prof Spoehr said.\nAnd the speed of the downturn - a full percentage point drop to the unemployment rate in just two months - has come as a shock.\n“I didn’t expect it to hit as hard as this as early as it has,” he said.\n“It’s even surprised me.”\nSouth Australia’s unemployment rate is now 1.7 percentage points higher than any other state or territory as Tasmania’s rate eased in June to 6.5 per cent.\nIn comparison the national unemployment rate increased just 0.1 percentage points to 6 per cent, and was steady on trend.\nMr McBride said the outlook was particularly bad for parts of regional South Australia such as Port Pirie or Port Augusta, which already face double digit unemployment.\n“We’re seeing a situation where there’s a human cost,” he said.\n“We’re seeing it in mental health, we’re seeing it in drug abuse and ice, we’re seeing it across the board that there’s no incentive for businesses to hire, to train.”\nSouth Australian Centre for Economic Studies deputy director Steve Whetton said “it’s not a story of jobs disappearing, it’s much more a story of people entering in the labour force.”\nHe noted that jobs have grown faster than employment so far this year, and the rise in unemployment was due to a rise in the number of people looking for work - which is usually positive for the economy.\n“It’s obviously not great for the people who are trying to find work but it suggests the problems aren’t as bad from the point of view of the state,” he said.\n“It’s a better reason to have a high unemployment rate.”\nFull Statement from Employment Minister Gail Gago\nSOUTH Australia’s headline unemployment rate for June is 8.2 per cent, according to new Labour Force figures from the Australian Bureau of Statistics.\nThe national unemployment rate increased to 6 per cent.\n“It’s a real concern to see a further deterioration in unemployment rates around the nation, particularly with South Australia’s rate increasing to 8.2 per cent,” Employment Minister Gail Gago said.\n“As we move from a reliance on traditional manufacturing industries – coupled with collapsing commodities prices – we see South Australian unemployment rates really struggling.\n“This is not helped by the Federal Government’s withdrawal of support for our auto manufacturing and navy shipbuilding industries, not to mention severe Federal Budget cuts in\nthe health and education sectors.\n“The State Government will continue to work with business and industry to support employment growth and skill training in a transitioning economy so all South Australians have the chance to find work,” Ms Gago said.\nToday’s ABS figures show that South Australia recorded its highest level of employment and highest participation rate in two years.\nMs Gago said South Australians were actively participating in the job market and reaffirmed the need for bold action to create jobs.\n“As the Premier has stated, we need to focus on transitioning South Australia from the old economy to the new economy, creating jobs for future generations of South Australians.\n“That is exactly why our 2015-16 State Budget has allocated almost $985 million to support job\ncreation, through reforming the tax system and investing in new and growth industries.\n“The ABS figures show our participation rate has been increasing for 6 consecutive months,\nand June’s rate of 62.5 per cent is the highest since July 2013.\n“We also have marked the highest level of employment in two years.\n“Total employment in the State has been rising for six consecutive months, for a total increase of 6,100, or 1,000 jobs a month,” Ms Gago said.\nThe 2015/16 State Budget focusses on job creation and includes:\nBUSINESS tax cuts of $670 million including the abolishment of stamp duty on commercial property transactions, making South Australia the best place in the nation to do business;\nSTIMULUS for new industries of $315 million to grow the jobs of the future, including tourism and international education; and\nA TOTAL infrastructure spend of $10.8 billion supporting an average of more than 4650 jobs per year including upgrades to schools, hospitals and a new Adelaide Festival Plaza.\nLast week also saw a $180 million per annum saving for business with the WorkCover levy slashed from an average of 2.75% to 1.95%.\n“There are signs that the State’s economy is strengthening, including improving business confidence over the last two quarters and increases over the past year to high levels for retail sales, investment, housing construction and minerals and petroleum exploration expenditure.\n“Our Budget forecasts South Australia returning to a long-term employment growth rate of 1.0 to 1.25 per cent for the next four years.”\nRecent job losses in SA\nArrium Mining: 580\nSantos: 500 (nationally)\nHolden: 270\nBHP: 230 since February, plus potentially 130 contractors\nArnotts: 120\nUnited Dairy Power: 100\nAldinga Turkeys: 79\nLeane Electrical: 40\nHills: 35\nPenrice: 95\nOZ Minerals: 80\nMurray Zircon’s Mindarie mine: 36\nJob losses to come\nAlinta Energy: 440\nHolden: 1260\nArrium Mining: More TBA\nMAP - The Jobs Crisis Sweeping SA", "external_links": ["http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/xyb3d1dTrsxRVf54QqD0F4zipVWeSe4Z/promo259495599&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "https://a.tiles.mapbox.com/v4/grebarila.me74mncg/attribution,zoompan,zoomwheel,geocoder,share.html?access_token=pk.eyJ1IjoiZ3JlYmFyaWxhIiwiYSI6IjIzMDYyNDYxMWJjZjIyNDgyZjAzNDY1MmExYzU1Yjg3In0.9m6ykjvLJ7wrZfssS5-lkQ"], "published": "2015-07-09T20:33:00.000+03:00", "crawled": "2015-07-09T06:27:21.000+03:00", "highlightTitle": ""}