{"organizations": [], "uuid": "2eaf482266ae56e58d1b265bb448257d2644e65a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/10/09/2A667EE300000578-0-image-a-8_1436518598936.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3155950/Say-cheese-Japan-s-Mount-Fuji-gets-Wi-Fi-hikers-check-weather-information-tourists-upload-selfies-faster.html", "country": "GB", "title": "Say cheese! Japan's Mount Fuji gets Wi-Fi so hikers can check weather information and tourists can upload selfies faster", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Say cheese! Japan's Mount Fuji gets Wi-Fi so hikers can check weather information and tourists can upload selfies faster | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T17:46:00.000+03:00", "replies_count": 1, "uuid": "9242438919e5652a28034ff9c11c6b8e350ea44e"}, "author": "Clare Vooght For Mailonline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3155950/Say-cheese-Japan-s-Mount-Fuji-gets-Wi-Fi-hikers-check-weather-information-tourists-upload-selfies-faster.html#post-0", "ord_in_thread": 0, "title": "Say cheese! Japan's Mount Fuji gets Wi-Fi so hikers can check weather information and tourists can upload selfies faster", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5 shares 1\nView\ncomments\nJapan's tallest peak, the majestic Mount Fuji, will soon have free Wi-Fi for all hikers, as both a tourism push and a safety measure.\nThe 12,389ft volcano lies on the border between Yamanashi and Shizuoka.\nTheir tourism boards are hoping the move will encourage people to share their images and experiences via social media.\nFree Wi-Fi will arrive on Mount Fuji for hikers as part of a tourism push - and to ensure that people can access weather information in order to stay safe on the 12,389ft volcano, Japan's tallest peak\nWith eight hotspots on the mountain, the Wi-Fi will also enable hikers to find weather information and to ensure they can communicate and stay safe on the mountain, reports Time .\nEach year around 300,000 people climb the active volcano, which last erupted more than 300 years ago, but every year people get injured on its rough terrain.\nRELATED ARTICLES Previous 1 2 Next Broadband that REALLY flies! Virgin America's new Wi-Fi will... A league of their drone: From a cathedral soaring above the... A bird's-eye view! Pilots reveal the world's most beautiful... Passenger's fury after being hit with travel website's... Foul-mouthed English tourist guide who called woman a 'Welsh... Return of the pier: Three of the UK's most iconic... How typical! Incredible footage captures vulnerable crab... The government hopes the service, provided by Japanese communications giant NTT Telecom Inc, will help people communicate with emergency services in areas without mobile phone signal, and allow them to stay updated with any changes in the weather.\nThe hotspots will be installed in cottages, a resort and on the climbers' summit, and will be ready by the end of this summer. The service will be available for 72 hours after users first log in.\nThe Japanese government hopes that the free Wi-Fi, which will arrive by the end of this summer, will encourage visitors to the peak to share their experiences and photos on social media\nThe wireless internet hotspots, provided by Japanese communications giant NTT Telecom Inc, will be installed in cottages, a resort and at the climbers' summit\nMount Fuji isn't the first peak to receive free Wi-Fi services: Mount Everest has had wireless internet 17,000ft up at its base camp since 2010. The North Pole has also had wireless access to internet since 2005.\nVirgin America also announced an upgraded Wi-Fi system yesterday, which will be fast enough to allow passengers on its flights to stream YouTube and Netflix.\nThe Mount Everest base camp at 17,000ft up has has wireless internet since 2010\nJapan's tourism industry is once again experiencing a boom, thanks to the cheap yen and easier tourist visa applications, while the government is pushing technology in tourist areas in the run up to the Tokyo Olympic Games in 2020.\nForeign visitors exceeded 10 million for the first time in 2013 and visitor numbers rose to 13.4 million last year. The government is hoping to have 20 million by 2020.\nRead more: Mount Fuji, Japan's Tallest Mountain, Will Soon Have Wi-Fi Virgin America's new Wi-Fi will be fast enough to stream Netflix | Daily Mail Online", "external_links": ["http://dailym.ai/1D4W4PN", "http://time.com/3948985/mount-fuji-japan-wifi/"], "published": "2015-07-10T17:46:00.000+03:00", "crawled": "2015-07-10T13:54:11.000+03:00", "highlightTitle": ""}