{"organizations": [], "uuid": "a5395027f3fa7c296edaed98a3fb71aa89018f91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://www.telegraph.co.uk/template/ver1-0/i/telegraphFacebook.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-17.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/finance/investor/11304170/FAQs.html", "country": "US", "title": "Telegraph Investor FAQs: frequently asked questions", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Telegraph Investor FAQs: frequently asked questions - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T20:39:00.000+03:00", "replies_count": 0, "uuid": "a5395027f3fa7c296edaed98a3fb71aa89018f91"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/finance/investor/11304170/FAQs.html", "ord_in_thread": 0, "title": "Telegraph Investor FAQs: frequently asked questions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A) ABOUT TELEGRAPH INVESTOR Why did the Telegraph decide to introduce a DIY Investment service? There has been a huge growth in the ‘DIY investment’ market in recent years and we know that using an investment platform, where funds and shares can be held together, is an increasingly popular option for Telegraph readers. The Telegraph has a long history of producing award-winning personal finance and investment coverage so launching Telegraph Investor was a natural next step in providing our readers with a valuable service that helps them make the most of their money. Why did the Telegraph choose Interactive Investor – what criteria did Telegraph use to make this decision? The Telegraph undertook an extensive research and selection process to choose the right partner for Telegraph Investor. Interactive Investor is one of the UK’s leading online execution-only broking companies and prides itself on being a consumer champion. It was their commitment and approach to customer service and fully transparent pricing that set Interactive Investor apart from other investment platforms. For customers who are not subscribers to Telegraph do you anticipate running offers for them in future? Yes, quite possibly. We want to encourage all Telegraph readers to use this service and will look to offer excellent offers. At present we are only running with the subscriber offer. How does the Telegraph Investor service relate to the paper/online content if at all? Telegraph's editorial content is totally independent of any commercial partnership / advertising that is promoted in-paper and online. Who holds my personal data? Telegraph Media Group holds your personal data, for further details please visit telegraph.co.uk/privacy B) ABOUT INTERACTIVE INVESTOR Who is Interactive Investor? Interactive Investor (II) launched in 1995 and is now an award-winning, online investment service that provides retail investors with unbiased financial information, together with the tools and trading platform they need to make confident and informed investment decisions. II is at the forefront of offering quality financial information and trading services and prides itself on delivering first-rate customer service, fair and transparent pricing and market-leading content – all of which are supported by a high-quality, experienced contact centre and a robust and scalable trading platform. Find out more about Interactive Investor at http://www.iii.co.uk/. Who owns Interactive Investor? Interactive Investor is privately owned by Interactive Investor plc and is not listed on any exchange. The Group also owns Moneywise Publishing Limited, a company that publishes consumer finance titles Moneywise and Money Observer magazines and their websites: • moneywise.co.uk • moneyobserver.com II also operates a sister website shareprice.co.uk which specialises in the mobile delivery of real-time share price and trading. Interactive Investor plc and its group of companies are registered in England and Wales (registered number 3699618) and is governed by the Companies Act 2006. It is required to submit audited financial accounts each year by independent accountants. Can I get advice from Interactive Investor? No you cannot get advice from II. II is an execution-only broker, offering a comprehensive range of financial services. Customers can choose from investment options including Share and Fund dealing, SIPP, ISA and Junior ISA – II don’t have a GIA General Investment Account (GIA)s, an extensive research range, investment filters and a selection of ready-made investment options. How big is Interactive Investor? II has in excess of £2bn of Assets under Administration. It is one of the UK’s leading investment and trading websites, II has 1.5 million unique users pa who contribute to one of the most engaged and active investor communities in the country; over 600,000 posts are made each year on the site's discussion boards. Is my portfolio of investments safe? The security of your financial assets and your account is of the utmost importance to us. II is regulated by the Financial Conduct Authority (FCA), FRN 190551, and all our systems and practices not only meet industry requirements but in addition, we have further security procedures of our own, so you can be confident of our commitment to the safety and security of your account and investments at all times. You can find full details of how II keeps personal information and investments protected in the security centre on http://www.iii.co.uk/security. Find out more about Interactive Investor at http://www.iii.co.uk/. Am I covered by the Financial Services Compensation Scheme (FSCS)? Your assets are covered by the FSCS in the event of any default by Interactive Investor Trading Limited. Your stock is covered to a maximum amount of £50,000. Cash is covered to a maximum £85,000. C) ABOUT THE TELEGRAPH INVESTOR SERVICE What accounts can I open with Telegraph Investor? General Investment Account (GIA), ISA and SIPP JISA accounts are not currently supported What investments can I make? You can invest in equities, funds and other advanced products Over 4,000 funds to chose from. Which markets can I trade on? The UK and the following international markets US: NYSE, NASDAQ, NYSE + all main markets 14:30 - 21:00 Canada: TSX and TSXV 14:30 - 21:00 Germany: XETRA 08:00 - 16:30 Italy: MTAA & XMIL Milan 08:00 - 16:25 France XPAR Paris 08:00 - 16:30 Netherlands XAMS Amsterdam 08:00 - 16:30 Belgium XBRU Brussels 08:00 - 16:30 Is the service available on mobile? Not currently but we plan to introduce a Telegraph mobile app for iOS and Android smartphones and tablets in due course. What do I pay for? What is the pricing? If you open an account with Telegraph Investor you will pay - Annual fees capped at £300 pa - 0.3% pa annual fees on the value of holdings up to the cap of £300 - £10 per equity trade - £0 ( zero) – per fund trade - £1.50 per Regular Investment (RI) - Minimum annual fee of £20 - Annual SIPP fee £80 + VAT When are the annual fees charged? The fees are charged quarterly based on an individual’s portfolio valuation at the end of January, April, July and October up to the cap of £300pa. The maximum quarterly fee charged would therefore be £75 per quarter. Fees are collected from the General Investment Account. Will the annual SIPP fee be included within the £300 cap for fees? Yes the SIPP fee will be included within the capped annual fee. For example assuming a customer had a portfolio over £1 across their trading, ISA, or SIPP accounts they will be charged an annual fee of £300, made up of £80 for the up front annual SIPP fee and £220 for fees on other holdings. The VAT on the SIPP fee is outside of the £300 cap. Who manages the Telegraph Investor SIPP? The Telegraph Investor SIPP is provided and managed by The Lifetime Sipp Company. If I need help with my new account who do I contact? You can email: investorsupport@investor.telegraph.co.uk You can ring: 0845 200 5345 between 7.45am-9pm Monday to Friday. Return to Home Page The Telegraph Investor £10 to trade shares and no charge to buy & sell funds Open an account »", "external_links": ["http://www.iii.co.uk/security.", "http://www.iii.co.uk/."], "published": "2015-07-17T20:39:00.000+03:00", "crawled": "2015-07-17T20:12:13.000+03:00", "highlightTitle": ""}