{"organizations": [], "uuid": "79781ec4c14f7aab0cc2aa4818bd5c5d38472927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.northjersey.com", "main_image": "http://www.northjersey.com/designimages/NorthJerseyFacebook_377x196.jpg", "site_section": "http://www.northjersey.com/sports/rec-and-travel-sports", "section_title": "Rec and Travel Sports - NorthJersey.com", "url": "http://www.northjersey.com/news/bergen-freeholders-ok-tedesco-s-picks-1.1367271?page=all", "country": "US", "title": "Bergen freeholders approve Tedesco picks - News", "performance_score": 0, "site": "northjersey.com", "participants_count": 1, "title_full": "Bergen freeholders approve Tedesco picks - News - NorthJersey.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T09:21:00.000+03:00", "replies_count": 0, "uuid": "79781ec4c14f7aab0cc2aa4818bd5c5d38472927"}, "author": "JOHN C. ENSSLIN", "url": "http://www.northjersey.com/news/bergen-freeholders-ok-tedesco-s-picks-1.1367271?page=all", "ord_in_thread": 0, "title": "Bergen freeholders approve Tedesco picks - News", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Bergen County freeholders on Wednesday approved the appointments of three department heads nominated by County Executive James Tedesco, including two who are holdovers from the previous administration.\nBy a unanimous vote, the board approved Ralph Rivera Jr. as director of the Department of Law and Public Safety, and the reappointment of Nancy Mangieri as director of the Department of Health Services.\nRivera had been a police director in Trenton, and he also was Bergen County undersheriff from 2005 to 2010.\nMangieri was first appointed in 2011 when Republicans controlled county government and Kathleen Donovan was executive. She previously worked as a public health nurse for Keller Army Community Hospital at West Point.\nThe board also voted to approve the reappointment of Jane C. Linter as director of the Department of Human Services. Linter, a former Donovan ally who served on her transition team, had been demoted by her administration in April 2014. Tedesco, a Democrat, defeated Donovan in November.\nWednesday’s vote came almost a one year after the Democratic-controlled Freeholder Board voted along party lines to overturn Linter’s demotion and order her reinstated.\n\"It’s incredible,\" Linter said of her reappointment prior to the vote. \"I’m very, very elated that Mr. Tedesco reappointed me.\"\nThe board voted 5-0 to approve all three appointments with Freeholders Maura DeNicola and Tracy Zur absent.\nDeNicola said before the meeting that she planned to recuse herself from the vote because she previously had been named as a potential witness in a lawsuit Linter had filed against the county, seeking to contest her demotion.\nLinter contended in her lawsuit that she was wrongfully demoted because she had complained about the way in which one of her subordinates was replaced.\nOfficials in the Donovan administration countered that there had been complaints within the department about Linter’s management style. They also contended that Linter had allowed a family friend and non-county employee to train with a county vehicle to obtain a license. Linter disputed that claim.\nZur praised all three appointees in the freeholder’s work session.\n\"They have been so responsive to us and I know as they continue that they are going to be responsive to their departments,\" Zur said.", "external_links": [], "published": "2015-07-02T09:21:00.000+03:00", "crawled": "2015-07-02T14:13:44.000+03:00", "highlightTitle": ""}