{"organizations": [], "uuid": "08c4803bd12d2084d3f6edecdf831fe7753f3621", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150722Gardeningminerals-2.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/07/19/5-health-boosting-ways-to-improve-your-gardens-soil", "country": "US", "title": "5 health-boosting ways to improve your garden's soil", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "5 health-boosting ways to improve your garden's soil", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T21:48:00.000+03:00", "replies_count": 0, "uuid": "08c4803bd12d2084d3f6edecdf831fe7753f3621"}, "author": "Katherine Stanley", "url": "http://www.ticotimes.net/2015/07/19/5-health-boosting-ways-to-improve-your-gardens-soil", "ord_in_thread": 0, "title": "5 health-boosting ways to improve your garden's soil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Good health starts from the ground up. Ed Bernhardt/The Tico Times \nSee also: Versatile superfood thrives in tropical climate \nThere’s a lot of truth in the phrase “healthy soils create healthy people.” In our modern world, most of the soils we use for agriculture are seriously deficient in the minerals that plants and people need for good health. Poor agricultural practices have had a tremendous toll on our precious soils: each year, staggering amounts of soil are lost as runoff into our rivers and streams. \nAs our soils decline in fertility, more and more chemical fertilizers and pesticides are needed to grow crops to feed our population. The end result? Food crops that are nutritionally inferior and laced with chemical residues. \nA growing number of concerned farmers and gardeners are changing the way we work with the soil to grow our food. We are now returning to a natural approach to return the gift of soil fertility to the land. It’s often referred to as “remineralizing the Earth.” Here are some simple ways to remineralize your garden’s soil for healthy plants and optimal health. \n1. Make your own compost fertilizer from organic materials from the kitchen, grass clippings, leaves and certain animal manures from chickens, goats, cows and horses. When the pile is ready, it looks and smells like mountain soil. Worm composting is another option that gardeners use to produce nutrient-rich fertilizer for the plants. \n2. Limestone powder is another valuable addition to your compost and soils. Dolomite limestone is high in calcium, magnesium and trace minerals. It helps to raise the alkalinity of acidic tropical soils, and it’s found in leading ag-supply stores as carbonato de calcio. \n3. Ashes can be a useful addition which contain potassium and trace minerals, so save those ashes from the campfire and fireplace to recycle into your garden’s soil. What’s more, ground charcoal has been found to create a matrix for the microbiological community in the soil. It also purifies the soil and acts to hold nutrients until plants can utilize it. When straining ashes you can collect and pulverize the charcoal pieces to add to your compost. This is often called biochar or terra preta. \n4. Rock dust is a new product that’s available in most construction supply stores around the country. Called polvo de piedra , it comes from the large rock crushers that produce gravel. The strained powder is loaded with trace minerals for your plants. It’s easy to apply rock dust, limestone and ashes around your trees and ornamentals. Apply small amounts to your compost and soil periodically, instead of large doses which can actually hinder the growth of plants. \n5. Ocean water can also be a valuable source of micronutrients and microbes that are beneficial for your soil. Use only 3 oz. of seawater to 1 gallon of fresh water; apply this to your compost or around your trees and ornaments several times a year. Collect ocean water in clean coastal areas. Another gift from the ocean, seaweed extract, can be useful as a foliar spray for your plants and contains many important nutrients that plants can absorb through their leaves. It’s available a leading ag-supply stores as extracto de alga marina. This product is particularly useful for patios and balconies with limited space. \nBest wishes to our gardeners in Costa Rica. \nRead more of Ed Bernhardt’s monthly Home Gardening columns here . \nFor more information on tropical gardening – naturally – visit Ed at http://thenewdawncenter.info/blog.html or contact him at the newdawncenter@yahoo.com.", "external_links": [], "published": "2015-07-19T21:48:00.000+03:00", "crawled": "2015-07-19T22:09:36.877+03:00", "highlightTitle": ""}