{"organizations": [], "uuid": "4829dfd1047df72bf80cccbfa0e9dc1eaab0f341", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/cd/resizer/2.0/FIT_TO_WIDTH-w514/49b5db3e339f030948f4af14abbe05a32beaec46.jpg", "site_section": "https://www.yahoo.com/travel/rss", "section_title": "Yahoo Travel", "url": "https://www.yahoo.com/travel/9-terrifying-things-that-will-make-you-think-twice-124648809152.html?src=rss", "country": "US", "title": "9 Terrifying Things That Will Make You Rethink Flying", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "9 Terrifying Things That Will Make You Rethink Flying", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T10:30:00.000+03:00", "replies_count": 0, "uuid": "4829dfd1047df72bf80cccbfa0e9dc1eaab0f341"}, "author": "", "url": "https://www.yahoo.com/travel/9-terrifying-things-that-will-make-you-think-twice-124648809152.html?src=rss", "ord_in_thread": 0, "title": "9 Terrifying Things That Will Make You Rethink Flying", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sid Lipsey"], "text": "  9 Terrifying Things That Will Make You Rethink Flying Sid Lipsey July 22, 2015 \nYou may seriously question getting on a ever plane again. (Photo by Corbis. Design by Erik Mace for Yahoo Travel) \nWell, that doesn’t inspire confidence. \nReports that an air traffic controller was found drunk on the job at Springdale Municipal Airport in Arkansas are sparking everything from disbelief to laughs to references to the 1980s comedy Airplane (“Looks like I picked the wrong week to quit drinkin’,” says a air traffic control character). But for some of us, a bizarre story like this is inspiring a more serious reaction — terror. We’re wondering anew just what the heck we’re getting ourselves into when we get on a plane. \nRelated: On-Duty Air Traffic Controller Found Passed-Out Drunk \nYes, we all know that, while airplanes are extremely safe, in extremely rare cases things can go wrong. And we all have a pretty good idea of what some of those things are. What’s really scary, though, is the stuff we really don’t consider — like wasted air traffic controllers, for instance. Knowing that kind of potential even exists in the world is just one more thing we have to push out of our minds the next time we get on a plane. Here are nine more things that’ll make you think twice about flying: \n1. Laser pointers flash-blinding the pilot \nThey’re not just for playing with cats anymore: Laser pointers are becoming a serious matter for flights. (Photo: iStock) \nLaser pointers are not only extremely annoying in the wrong hands; they’re also a potential danger to flights, and they’re becoming a problem. The FAA says incidents of people aiming laser pointers at planes have increased tenfold since 2006. The danger is that high-powered lasers can incapacitate pilots during those crucial moments of takeoff and landing. It’s scary to think that the same idiots who drive you crazy in movie theaters and concerts can actually endanger our flights. \n2. Pilots messing around in the cockpit when they should be flying \nIn-flight diversions got these pilots in trouble. (Photo: Vicky Xipolitakis) \nA force potentially more dangerous than laser pointers — a sexy passenger. Two pilots for an Argentinian airline were fired last month for taking selfies with a Playboy model in the cockpit midflight (this mirrors an incident last December when a Mexican airline fired a pilot who’d reportedly invited two young actresses into the cockpit during a flight). Airlines tend to frown upon distractions in the cockpit, and well-endowed Playboy models definitely qualify. Hey, guys: Eyes up front! \n3. Pilots taking selfies midflight \nIn its investigation, Quartz found pilots taking pictures during crucial moments like takeoff and landing. (Photo: Quartz/Instagram) \nThe website Quartz recently did a study showing an increasing number of pilot Instagram accounts devoted to in-flight photos, including selfies. There were even pics taken during takeoffs and landings, when federal rules require a sterile cockpit where pilots can’t say or do anything that doesn’t have anything to do with the plane’s operation. Selfies have been linked to at least one fatal crash , so maybe when they’re flying a plane, pilots should give the duckface a rest. \n4. Air traffic controllers and pilots who hate each other \nVideo: Good Morning America/Yahoo \nIn July of last year, an air traffic controller and a Delta pilot got into a bit of a tiff over the radio after the pilot apparently landed on the wrong runway, with the pilot repeatedly accusing the air traffic controller of having an “attitude.” Things got so heated, the pilot of another plane got on and told the other pilot to simmer down; “Settle down, Captain Happy,” the peacemaking pilot said. With the crowded skies and the near-misses we see over airports, do we really want to see a pilot and air traffic controller snipping at each other like they’re the final two suitors on The Bachelorette ? Absolutely not. What we do want to see: a pilot really named “Captain Happy.” \n5. Pilots and co-pilots who hate each other \nYou could cut the tension in here with a knife. (Photo: iStock) \nA pilot getting into a jawing match with an air traffic controller over the radio is one thing, but an in-flight brawl? Back in April, two Air India pilots reportedly came to blows in the cockpit. According to India’s News Nation , the co-pilot took umbrage when the captain asked him to jot down some pre-takeoff figures. According to the report, the co-pilot responded by beating up the captain (presumably, some variation of “No, you take down the pre-takeoff figures!” was shouted). \n6. Guns and accidental gunfire in the cockpit \nTwo things you don’t want to hear in a cockpit: “Oops” and “Bang!” (Photo: iStock) \nIn 2008, a US Airways pilot on a flight from Denver to Charlotte accidentally discharged his .40-caliber pistol in the cockpit as he tried to stow it upon landing. No one was hurt, and the plane landed safely ( the pilot was reinstated after an 18-month suspension). A “this is your captain shooting” announcement doesn’t exactly fill passengers with confidence. \n7. Pilots sometimes get lost \n“I knew I shoulda taken that left turn at Albuquerque … !” (Photo: iStock) \nPilots don’t have the benefit of Google Maps or landmarks like Starbucks to help them navigate. Still, we don’t expect them to get lost. Last year, pilots with a Canadian airline, First Air, got lost over the barrens of the Canadian Arctic , veering 150 miles off course at one point. Also last year, a Southwest Airlines flight actually landed at the wrong Missouri airport , missing its intended destination, Branson Airport, and instead landing at a much smaller airport six miles away. No one was hurt in either incident. But it doesn’t inspire confidence when you look at the flight information at the gate and under “Destination” there’s a question mark. \n8. Planes are slowly cracking up \nThe fuselage that cracked midflight on a Southwest plane in 2011. (Photo: NTSB/ YouTube ) \nThe act of landing and taking off again puts pressure on a plane’s aluminum fuselage as it pressurizes and depressurizes. Over time, it’s not uncommon for cracks to appear on the fuselage of older planes. Airlines using these planes often inspect them for cracks, but every now and then one becomes noticeable, as it did back in 2011 when a 1.5 meter gash opened up on a 15-year-old Southwest Boeing 737–300 during a flight over Arizona. No one was hurt. \n9. Wildlife can stop your flight \nA fish like this one actually ended a flight. (Photo: Thinkstock) \nYou may have heard of bird strikes wreaking havoc on planes (the most famous example was the “Miracle on the Hudson” flight in New York). Last year, a National Oceanic and Atmospheric Administration Gulfstream plane was hit by a sheepshead during takeoff . The fish was actually the intended meal of a bird that had almost collided with the airplane; investigators believe the bird may have dropped the fish as it flew to avoid the plane. Hearing the “thud” during takeoff, pilots assumed they’d hit the bird and aborted. It wasn’t until they were back on the ground that they realized it was a fish that had ended their flight. It might surprise you that fish can cause so much trouble on a plane — unless you’ve seen Airplane . \nLet Yahoo Travel inspire you every day. Hang out with us on Facebook , Twitter , Instagram , and Pinterest . Watch Yahoo Travel’s original series, “ A Broad Abroad .” Read More", "external_links": [], "published": "2015-07-22T10:30:00.000+03:00", "crawled": "2015-07-22T18:55:16.132+03:00", "highlightTitle": ""}