{"organizations": [], "uuid": "bba3f4ffc6b61bf45a26bffcaefc652d21ee6910", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.style.com", "main_image": "http://media.style.com/image/slideshows/editors/steff-yotka/2015/7-july/02-magic-mike-xxl/1330/520/magic-mike-xxl-feature-article-F.jpg", "site_section": "http://www.style.com/culture", "section_title": "Culture - Art, Entertainment, Travel - Style.com", "url": "http://www.style.com/culture/entertainment/2015/magic-mike-xxl-costumes", "country": "US", "title": "Magic Mike XXL Costumes - Male Stripper Outfits, Channing Tatum", "performance_score": 0, "site": "style.com", "participants_count": 1, "title_full": "Magic Mike XXL Costumes - Male Stripper Outfits, Channing Tatum", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T23:15:00.000+03:00", "replies_count": 0, "uuid": "bba3f4ffc6b61bf45a26bffcaefc652d21ee6910"}, "author": "Steff Yotka", "url": "http://www.style.com/culture/entertainment/2015/magic-mike-xxl-costumes", "ord_in_thread": 0, "title": "Magic Mike XXL Costumes - Male Stripper Outfits, Channing Tatum", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One important lesson this editor learned while watching Magic Mike : A stripper is only as good as his routines. In Magic Mike XXL , those routines come with their fair share of panache, courtesy of costumes designed by Christopher Peterson. XXL and the original film, Peterson has plenty of experience in the wardrobes of hot guys paid to take it off. With the Spring ’16 men’s runways awash with sheerness and nudity, we were eager to catch up with Peterson and learn about his approach to designing garments intended to reveal the male physique. Below, he extolls the virtues of sleeveless tees and Swarovski embellishment, while pondering the ever-so-important question: “To thong or not to thong?”\nFor a movie where the main characters are naked or next-to-naked a majority of the time, how do you even begin to approach designing the clothes they actually wear?\nThat’s everybody’s joke. “ Magic Mike ? What clothes are there in Magic Mike ?” [ laughs ] I go back to what I said the first time around: Without clothing to take off, as a stripper, you don’t have an act. Granted, they get out of their clothes very quickly, but this is the way I look at character work on any of the films I work on: It starts with the script and folds in the director’s ideas, the writer’s ideas, and the actors’ ideas. Then it’s down to the costume designer to put all those ideas together in a physical way on a rack and present it to an actor. So we stand there in front of the mirror until we finally hit on it, and at that point you just quietly wheel away all of the other options, knowing that you found it.\nHow did you differentiate the characters’ costumes and aesthetics?\nThe guys are all so different. The thing that they all have in common is that they’re all these incredible specimens of the male figure [ laughs ], but personality-wise, interest-wise, and physically, they’re all so, so different. That’s a real starting point for what clothes wind up on the rack. That in addition to character. With this film, because there were six great-looking guys, I had what I call a Sex and the City problem because Pat Field had four women to dress, and they all needed to look great, and they all had to have their own character. One person would not wear the thing that another character wears. With men’s clothing, you kind of have a lot more limited toolbox than with women’s. With men, you’re given jeans, shorts, tank tops, and T-shirts…there’s not as big a range of things to play with. We found an iconic look for each of the characters and played with variations and themes throughout the whole film, not taking them too far away from what we had discovered. The other thing that’s interesting is: Because the guys are so well known and so well known in so many different roles, you really do want to take them to a place that the audience hasn’t seen them go to visually, without going too far into caricature.\nJoe Manganiello\nPhoto: Courtesy of Warner Bros. Entertainment Inc. and Ratpac-Dune Entertainment LLC\nSince their clothes come off pretty quickly, how important are the accessories to these characters?\nThe accessories are crucial, especially with the very limited field of clothing that you have for the men. I had a couple of really great partnerships on the job. One was with Melin hats. They provided several of the hats—one in particular that Channing [Tatum] wore for his final dance number. Without that hat, you don’t have the kind of street look that we were looking for. You have to have that hat. M. Cohen had a couple of great pieces that I loved—they provided all of Matt [Bomer]’s jewelry and modified things for me. Swarovski agreed to participate in the film. We put all the guys in these gray-and-black Everlast robes that were encrusted with Swarovski metallic crystals. We made some outlandish choices here and there—it was fun.\nHow much did you have to mentally prep the actors for the fittings?\nIt’s so much fun to dress these guys. On the first film, everyone came in and I had to give them the speech: “OK, you have to get waxed, and you have to get spray tanned.” They all did it, of course, for the first film, but they were sort of like, “Really?” This time they came in fully prepped, ready to go, spray tanned, and waxed—they all had the language down. And before they ever came into their first fitting, they were all into their workout routines, deep into them, so they came in looking phenomenal. By the time we started shooting, it was like walking among gods. Whereas on the first movie, it was about easing our way into it, this time it was like, “Are we doing thongs or are we doing boy shorts?”\nThongs or boy shorts, that is the question.\nThere was a big discussion about “to thong or not to thong” on this one, because one of the ideas of the story is that this is the guys’ last ride, and right after this happens they’re all going to quit stripping and go on to these professions that they’re been dreaming about doing all these years. There was this moment where we weren’t going to do thongs, and I started thinking about it: The thong is such an odd garment. On the one hand, it’s really the visual property of warriors and gladiators. That loincloth-like piece has been around since the dawn of time in various forms, but somewhere in the ’80s, somebody decided—and I think it was International Male , I’m not sure!—that this was a good idea. Once the male stripper emerged in the late ’70s and in the ’80s the Chippendales became popular, it really took off. It’s just such an odd garment. We almost didn’t do it this time because we wanted to show a progression of time and of slightly more sophistication to the routines. But in the end, we had this powwow—and I think that Chan was going to tweet about it, I’m not sure if he ever did—when we decided to go with the thongs.\nChanning Tatum\nPhoto: Courtesy of Warner Bros. Entertainment Inc. and Ratpac-Dune Entertainment LLC\nWe’re all very grateful.\nAmerica, you’re welcome. World, you’re welcome! [ laughs ] A company named Pistol Pete made all of the thongs for me, as they did in the first one. They’re pretty crucial in getting it right because they have a lot of knowledge about how these things fit. You’d be surprised about how tricky it is to get someone in a thong to begin with, but then to get it to fit properly. They really were instrumental in helping me get the look right.\nHow much does the fact that the characters are male strippers inform their off-duty wardrobes?\nLet me tell you something: The job description was not to cover these guys up. Not literally, but no one is paying me to put a long-sleeve shirt, trousers, a cardigan, and a coat on Channing Tatum. [ laughs ] That’s part of what makes the first and the second movie so sexy is that strippers make their living with their bodies, they take care of them, and that’s their bread and butter, and there are certain things about the way they dress that are pretty distinct. It’s very body conscious. Now, almost three years later, I’ve met almost every troupe of male strippers in the country and it’s always the same thing: not a sleeve in sight. Every day I was cutting a sleeve off of something. There was a box at the back of my truck, which I kept, that was just filled with sleeves that had been cut off. This is the funny thing, too. I had a couple fittings with Joe [Manganiello], who I think has the lowest sleeve count in the movie. Because of Joe’s size it was very tricky to do any of this unless it was on Joe’s body, so there were several mornings where I would knock on Joe’s trailer and say, “OK, we need to cut the sleeve off of this one now.” The discards are all in this box, which I have kept. [ laughs ] I don’t know, maybe I’ll make a Magic Mike quilt out of it someday!\nWere there any looks that didn’t make it into the final film?\nLooking back at the Magic Mike version 1.0 fittings, just to remind myself of all the things that we explored with the guys the first time around, they are some of the funniest photos of all time. One thing that we tried for the first movie that never made the cut: I put Alex Pettyfer in this adult-sized footed pajama with ducks on it. One of his strip routines might have been that. [ laughs ]\nIn addition to meeting with real strippers and doing research in clubs, what were the other references you looked at?\nStrippers—because they’re making their money on their bodies—and their moves and those other things, too, that maybe are not fit for Style.com [ laughs ], they’re very body conscious. Most of the strippers that I have met are not necessarily fashionable. The thing about this job is that I could cut armholes into a Hefty bag and put it on Joe Manganiello and still look like a genius because these guys are so insanely hot. There’s a lot of character to the clothing in the film and I love each and every one of the choices that we made with the guys, but to me it’s so much more about character in this film than it is about fashion or trends. The thing that I would say about most strippers is that it’s a little off-trend. Other than visiting strip clubs, documentary photography is a great start. Going to actual strip clubs is the best research, though, looking at the real deal. It’s great seeing Magic Mike XXL take place backstage at the big stripper convention that is the finale of the film, and you see all of these guys rehearsing their acts in the background. For that scene we brought in the LaBare boys, which Joe has directed a documentary about, who are real strippers. There were some strippers that came in from Atlanta, some came in from Texas. It was the real deal backstage.\nJada Pinkett Smith\nPhoto: Courtesy of Warner Bros. Entertainment Inc. and Ratpac-Dune Entertainment LLC\nWhat was your approach to dressing the women in the film?\nI am president of the Jada Pinkett Smith fan club. There’s something to figuring out how this character, the owner of a combination male and female strip club, would dress. She’s part-hostess, part-owner, part-emcee. We wanted her look to have, not an androgynous feel, but to not be based on a specifically male or female archetype. We wanted to find a way for it to be a combination. I started thinking about the Saint Laurent Le Smoking in the ’70s, and then I started thinking about disco and found this amazing picture of Donna Summer. We wound up building two tuxedos for her—one was white with black satin trimming and the other was a blush wool with tailored pink satin lapels and a stripe down the sides. Leonard Logsdail, an absolutely genius tailor in New York City, I brought the sketches to him and he said, “I don’t normally do women,” and I said, “I think that’s good in this case because I don’t want it to look like a traditional women’s suit. I want to ride that line.” He brought in these incredibly tailored, well-made pieces. James Coviello made me these beautiful fedoras for her to wear as well. During the fitting we decided that there shouldn’t be a shirt, so we fitted the vest a little tighter, so it’s not a tuxedo in the traditional sense. It’s incredibly sexy.\nElizabeth Banks is another fearless, sexy, smart actress, and I had done a couple of films with her. She plays this approaching/getting out-of-the-business former stripper who now runs this Myrtle Beach stripper convention every year. Her look was very tight, very loud, and obviously sexy. At one point she’s in this gold Herve Leger dress—she looks like an awards statuette when the lights hit her and her very high platforms. With both her and Jada, there’s a lot of character in the clothing.", "external_links": [], "published": "2015-07-02T23:15:00.000+03:00", "crawled": "2015-07-02T18:24:34.000+03:00", "highlightTitle": ""}