{"organizations": [], "uuid": "ef2091e9896c7e72da571ec8335ee10406c70057", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/united-says-pilot-was-wrong-to-throw-bullets-in-trash-bin-then-flush-them-down-planes-toilet-312997821.html", "country": "US", "title": "United says pilot was wrong to throw bullets in trash bin, then flush them down plane's toilet", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "United says pilot was wrong to throw bullets in trash bin, then flush them down plane's toilet - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T18:49:00.000+03:00", "replies_count": 0, "uuid": "ef2091e9896c7e72da571ec8335ee10406c70057"}, "author": "David Koenig, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/united-says-pilot-was-wrong-to-throw-bullets-in-trash-bin-then-flush-them-down-planes-toilet-312997821.html", "ord_in_thread": 0, "title": "United says pilot was wrong to throw bullets in trash bin, then flush them down plane's toilet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DALLAS - A United Airlines captain threw bullets in a trash bin accessible to passengers and later flushed them down a toilet on board a flight that he was piloting to Germany.\nA United spokeswoman said Thursday that the pilot should not have thrown the bullets in the toilet. She said the pilot hasn't been fired but that the incident is still under investigation.\nAirline spokeswoman Karen May said the pilot is allowed to carry a gun on domestic flights under a post-9-11 federal program intended to make planes harder to hijack. She said the pilot dumped the bullets in a waste bin then in a toilet after realizing he had them in his bag on a June 23 flight from Houston to Munich. Germany has strict gun laws.\n\"He did incorrectly dispose of the ammunition,\" May said, \"but it is likely that the pilot is not going to face any criminal charges.\"\nThe Transportation Security Administration and Federal Aviation Administration did not immediately respond to requests for comment.\nUnited declined to name the pilot. He is likely to be very experienced — it takes many years of seniority for pilots to become captains on international flights for major U.S. airlines.\nMay said the pilot was still employed by United, but she declined to say whether he had been grounded.\n\"We are investigating,\" she said. \"I can't give any details about his status other than he is still with us.\"\nThe incident was first reported by The Aviation Herald, which said that a flight attendant looking for a passenger's missing ring found 10 bullets in a waste bin and alerted the captain. He flushed the bullets down the toilet and alerted German authorities when he realized that the flight attendant would report the incident, according to the Herald.\nAfter landing in Munich, the plane taxied to a remote area where passengers got off and the waste tanks were emptied to find the bullets.\n ", "external_links": [], "published": "2015-07-09T18:49:00.000+03:00", "crawled": "2015-07-09T23:55:05.000+03:00", "highlightTitle": ""}