{"organizations": ["Catering Committee", "MCCI", "Saudi Food and Drug Authority", "Makkah Chamber of Commerce and Industry", "Ministry of Haj"], "uuid": "c81cfc02aa23a17d2cb18e6d0b4fdd4c25a3382c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/Unified_system_for_foreign_Haj_pilgrims_ready-ZAWYA20150705033954/", "country": "AE", "title": "Unified system for foreign Haj pilgrims ready", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Unified system for foreign Haj pilgrims ready", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T09:32:00.000+03:00", "replies_count": 0, "uuid": "c81cfc02aa23a17d2cb18e6d0b4fdd4c25a3382c"}, "author": "", "url": "http://www.zawya.com/story/Unified_system_for_foreign_Haj_pilgrims_ready-ZAWYA20150705033954/", "ord_in_thread": 0, "title": "Unified system for foreign Haj pilgrims ready", "locations": ["MAKKAH", "Makkah", "Muscat Airport"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Al-Shareef", "Haj", "Al-Sharif", "Shaaban", "Hussein Bin Nasser Al-Shareef", "Al-Harthi"], "text": "Muscat Airport facelift plan on track MAKKAH - The Ministry of Haj has completed all requirements for a unified system for foreign pilgrims for the upcoming Haj season. Hussein Bin Nasser Al-Shareef, undersecretary of the Ministry of Haj, said the ministry has merged various establishments functioning under the supervision of the ministry into a new unified system, which is capable of linking up with other agencies and departments.In a meeting with the Makkah Chamber of Commerce and Industry (MCCI), Al-Shareef said as of next year a schedule will be drawn up for catering companies. The plan stresses the importance of signing contracts well in advance with companies providing services to pilgrims. According to Al-Sharif, all contracts must be signed by the end of Shaaban so that companies can make necessary preparations in a timely and organized manner. Al-Shareef said the Ministry of Haj will inform all companies and those concerned with the mechanism of the system to register early so that they are able to complete all relevant preparations.About the lack of actual statistics on the number of catering companies and establishments in Makkah, Al-Shareef said the ministry is focusing its efforts on the quality of services provided and not the number of companies providing them.Shaker Al-Harthi, chairman of the nutrition and catering committee at the MCCI, said only a few cases of food poisoning were reported during Haj, which he blamed on street hawkers.\"The food provided by street hawkers lacks the standards and specifications that all the concerned authorities are keen to achieve,\" he said.Al-Harthi stressed the importance of the partnership between the Nutrition and Catering Committee at the MCCI, Saudi Food and Drug Authority (SFDA) and the ministries of municipal and rural affairs, commerce and industry and Haj in consolidating efforts to ensure the safety of the food products provided to pilgrims and Umrah performers during the Haj and Umrah seasons.\"There is a shortage of specialist units and laboratories that are concerned with food quality and standards. We are striving to work in this direction with the Saudi Standards Organization so as to benefit from its staff and their expertise in this field.\"© The Saudi Gazette 2015", "external_links": [], "published": "2015-07-05T09:32:00.000+03:00", "crawled": "2015-07-05T10:57:58.000+03:00", "highlightTitle": ""}