{"organizations": ["BA", "Airbus"], "uuid": "65f53a9c4492f39fedc3ac124534bb0b550a37ba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/airbus-plans-upgraded-a380/4697900.article", "country": "GB", "title": "Airbus plans upgraded A380", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Airbus plans upgraded A380", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T12:31:00.000+03:00", "replies_count": 0, "uuid": "65f53a9c4492f39fedc3ac124534bb0b550a37ba"}, "author": "", "url": "http://www.ttgdigital.com/news/airbus-plans-upgraded-a380/4697900.article", "ord_in_thread": 0, "title": "Airbus plans upgraded A380", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airbus is planning an upgraded version of its A380 despite sales of the original model continuing to flag. BA welcomed Airbus’s A380 ‘superjumbo’ to its fleet in July 2013 \nIn an interview with The Sunday Times, the aircraft builder’s president and chief executive Fabrice Brégier said the new A380neo will cost up to $3 billion to develop. \nHowever, he argued with more and more people taking to the skies while airports are often limited for space, the demand for larger aircraft will only grow. \nBrégier added: “We will move to the A380neo type. You can say that. Absolutely. We will need it between 2020 and 2025. \n“The air passenger market is doubling every 15 years. Airlines can’t simply rely on flying more planes more often. We have to have larger aircraft. \n“How can you imagine crowded Heathrow in 2030 without the A380? This is the same for New York, Washington, Los Angeles, Frankfurt and China in a few years.” \nHe said although the new A380 will be the same size as the current one, new wings and more powerful engines would mean it could lift a fuselage four metres longer with space for up to 700 seats. \nHe added: “I cannot tell you if it will be stretched or not. We will not do it for one airline, however big. It will depend on more orders. We’re supposed to make money, you know.” \nMeanwhile, Brégier is working on improving the company’s finances following poor sales of the original A380. \nThe airline has hoped to sell 50 a year but is barely making it to 25 which it requires to break even. There are currently enough orders to keep production running until the end of the decade. \nBrégier is planning on introducing other smaller aircraft including an A330 with lean-burn engines due at the end of 2017 and for which there are already 145 orders while a new version of the A320 small jet will arrive at the end of the year.", "external_links": [], "published": "2015-07-20T12:31:00.000+03:00", "crawled": "2015-07-21T16:36:27.099+03:00", "highlightTitle": ""}