{"organizations": [], "uuid": "c20cbfc615ec3d4baea8df45d269c2721c4c1d7e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/27/10/2AC8465500000578-0-image-a-16_1437990699609.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3175836/Would-pay-26-bottle-water-Hotel-Northern-Ireland-launches-new-drinks-menu-served-water-butler.html", "country": "GB", "title": "Would you pay £26 for a bottle of water? Hotel in Northern Ireland launches new drinks menu to be served by a 'water butler'", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 11, "title_full": "Would you pay £26 for a bottle of water? Hotel in Northern Ireland launches new drinks menu to be served by a 'water butler' | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T18:43:00.000+03:00", "replies_count": 11, "uuid": "241fcd7920989957ac30bff7f815cf25cf853113"}, "author": "John Hutchinson for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3175836/Would-pay-26-bottle-water-Hotel-Northern-Ireland-launches-new-drinks-menu-served-water-butler.html#post-0", "ord_in_thread": 0, "title": "Would you pay £26 for a bottle of water? Hotel in Northern Ireland launches new drinks menu to be served by a 'water butler'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "9 shares 52\nView\ncomments\nThe five-star Merchant Hotel in Belfast last week announced a new dedicated water menu, with the most expensive bottle costing £26.45 (€37).\nThe Northern Irish property has also revealed plans to employ 'water butlers' in the move which has been ridiculed online.\nAnd although the hotel has reminded guests that tap water will still be available should guests prefer not to splash out, the plans have been derided on social media.\nGavin Carroll (left) general manager of The Merchant Hotel in Belfast and Michael Tanousis managing director of Aqua Amore at the launch of the five-star hotel's new water menu that is stirring much debate\nThe launch of the new water menu at The Merchant Hotel did not go down so well in all quarters\nIt seems the the idea of an expert in water has provoked much debate.\nAlex Goldberg wrote on Twitter how a 'water sommelier' made him angry, while Adam Elliott Segal described it as 'the stupidest job in the world.'\nIn response to the hotel posting the launch on Twitter, one user described the menu as 'very disappointing.'\n Next Why this is fast becoming THE place to stay in Barcelona:... Make it a grape escape! Round-the-world tour of iconic... A visit to Gone With The Wind's 'aged grandmothers': Soaking... Wild Honeybush for Winnie the Pooh's favourite spot and Big... Meanwhile another bar in the city, The Hudson Bar, has launched its very own tongue-in-cheek water menu, seemingly in response to the Merchant Hotel's launch.\nTheir water 'prices' ranging from free tap water, to €20 deluxe version, titled 'The card I'm gonna use for this? I've signed it with a crayon.'\nThe company introduced their menu on Facebook, writing: 'We'd hate to get left behind on this newest innovation in beverage retailing so here's our brand new water list! Conveniently arranged by your own personal level of daftness.'\nThe menu was posted on the Hudson's Facebook page, where it has received over 1,000 likes.\nThe Hudson Bar in Belfast came up with their own witty water menu, seemingly in response to the Merchant's new launch\nAnother Twitter user, Alex Goldberg, was left angered by the Northern Irish hotel's menu\nThe launch of the menu was described as 'very disappointing' as the pricing continues to stir debate\nThe priciest product among 13 bottled waters on offer at the Merchant Hotel is sourced from glacial walls in the Canadian Arctic. For a 750ml bottle, diners will need to stump up £26.45.\nThe lowest cost item on the list is not quite so hard on the wallet, at £4.95.\nThe Merchant, which has insisted a glass of 'Belfast water' from the tap will still be free of charge, has appointed two 'water butlers' to help guests choose the product that is apparently right for their palate.\nThe waters are being supplied by Aqua Amore, a specialist in sourcing premium waters from around the world.\nThis user speculated as to why the bottles of water are so expensive at the five-star hotel\nGillian Campbell believes buying a bottle of wine may actually come in cheaper than water\nManagement at The Merchant Hotel in Belfast are not expecting everyone to pay the prices for water\nTHE MERCHANT'S DELUXE WATER MENU Iceberg, Still: Canadian Arctic Ice shelf Newfoundland – £26.45\nFiji, Still: Fiji Islands Rainforest – £5.50\nChanteldon, Sparkling: France – £8.45\nBasalt, Sparkling: Faroe Islands Suouroy – £5.45\nVeen, Still: Finland Konisaajo – £7.95\nSaint Geron, Sparkling: France Auvergne – £7.85\nSNO Glacial, Still: Iceland – £7.15\nFuiggi Italy, Still: Frosinone – £11.50\nDe l’Aubier Maple Sap Water: Canada – £15.50\nVichy Catalan, Sparkling: Spain Girona – £6.45\nWhitehole Springs, Still: UK Mendip Hills Somerset – £4.95\nSpeyside, Sparkling: Scotland Glenlivet Estate – £4.95\nBorjomi, Sparkling: Georgia – £13.95\nMichael Tanousis, Aqua Amore's managing director, defended the cost of the top-end products as he attended the menu launch. He highlighted the complex process of extracting the water from the glaciers.\n'We live in a sophisticated society which gives people the opportunity to spend their money as they see fit,' he said.\nMr Tanousis said diners at a five-star restaurant wanted to indulge in different experiences to those on offer at other food outlets.\nAnd he stressed the Merchant was not expecting everyone to buy the most expensive water.\n'But the fact they do have products that are certainly exclusive or rare demonstrates their intention to offer customers the ability to experience something they wouldn't commonly find,' he said.\nGavin Carroll, general manager of the Merchant, said: 'Just like wine, the location where water is produced will impact on its taste and flavour.\n'Whilst experts can differentiate between the mineral content and PH balance of different types of water, discerning consumers are also increasingly demanding a wider choice of waters.\n'The ethos behind the new water menu is to allow our guests to have the chance and choice to curate their own bespoke food and beverage experience.\n'Of course, we know these luxury waters won't be to everyone's taste and new menu will be offered as an additional option to our current water menu that includes local Irish brands and for those that don't want to splash out on water, we can still offer a glass of 'Belfast water', free of charge.'", "external_links": ["http://dailym.ai/1GTPfB8"], "published": "2015-07-27T18:43:00.000+03:00", "crawled": "2015-07-27T14:40:23.753+03:00", "highlightTitle": ""}