{"organizations": [], "uuid": "79beaa79bda2e61d1c801231b7a1c87b7c23c192", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buyingbusinesstravel.com", "main_image": "", "site_section": "http://buyingbusinesstravel.com/rss.xml", "section_title": "Buying Business Travel", "url": "http://buyingbusinesstravel.com/news/1624449-technology-helping-transform-buyers%E2%80%99-roles-within-organisations", "country": "IE", "title": "Buyers roles changing as focus on technology shifts", "performance_score": 0, "site": "buyingbusinesstravel.com", "participants_count": 1, "title_full": "Buyers roles changing as focus on technology shifts", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T14:59:00.000+03:00", "replies_count": 0, "uuid": "79beaa79bda2e61d1c801231b7a1c87b7c23c192"}, "author": "tom newcombe", "url": "http://buyingbusinesstravel.com/news/1624449-technology-helping-transform-buyers%E2%80%99-roles-within-organisations", "ord_in_thread": 0, "title": "Buyers roles changing as focus on technology shifts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Follow @thomasnewcombe \nMobility, virtual payments and data are transforming travel manager’s roles within organisations, according to a study from GBTA . \nThe report showed changing technologies are helping buyers take a more strategic and important position within their companies, with 61 per cent stating that evaluating and applying technology solutions is “very important” to their role. \nThe GBTA study sponsored by Sabre, Travel Manager 2020 , surveyed more than 230 travel managers to better understand their key responsibilities and how technology has changed their role now and in the future. \nSome 86 per cent of travel buyers involved in the study reported having responsibilities related to selecting or implementing technology, such as online booking tools, mobile solutions or other travel technology software. \nDue to technological advances, the vast majority 84 per cent of travel managers foresee their role becoming more strategic in the next three to five years than it is today with mobile technology, virtual payments and data collection and analysis all predicted to be a much higher priority in the near future. \nTravel Managers also report that they place high value on having accurate, holistic travel data, which helps them to more easily demonstrate the value their program brings to the company. \nHowever, the report showed the increase in technology doesn’t come without challenges – one third said they find it challenging to keep up with the latest developments and only 39 per cent believe business and technology are aligned within their company. \n“We were very excited to partner with GBTA on this research. This is an important topic within the industry and builds on our research project last year,” said Sabre VP of corporate solutions Yannis Karmis. \n“We are committed to helping travel managers be successful in their roles and are making an investment in our technology to not only help them today but as their role evolves.”", "external_links": [], "published": "2015-07-16T14:59:00.000+03:00", "crawled": "2015-07-16T15:28:07.000+03:00", "highlightTitle": ""}