{"organizations": [], "uuid": "45c9fcbbc981d73b36182806db525e8b44ba3b44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/238748?filename=238748.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/07/24/754978/10143111/en/Insight-Vacations-Announces-First-Ever-Online-Retail-Store.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "Insight Vacations Announces First Ever Online Retail Store", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Insight Vacations Announces First Ever Online Retail Store", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T20:52:00.000+03:00", "replies_count": 0, "uuid": "45c9fcbbc981d73b36182806db525e8b44ba3b44"}, "author": "", "url": "http://globenewswire.com/news-release/2015/07/24/754978/10143111/en/Insight-Vacations-Announces-First-Ever-Online-Retail-Store.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "Insight Vacations Announces First Ever Online Retail Store", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Insight Vacations Announces First Ever Online Retail Store ~ Insight Travel Gear will be offering a one-stop shop for travelers featuring top name brands ~ July 24, 2015 13:52 ET | Source: Insight Vacations \nDELRAY BEACH, FL, July 24,   Insight Vacations ® , the leader of premium and luxury escorted journeys is excited to announce the official launch of their first ever online retail store, Insight Travel Gear with their e-commerce partner, New Headings . The online store will be offering a convenient one-stop shop for guests and provide them a seamless travel experience which will help them prepare for their trip of a lifetime. Insight Travel Gear will be featuring top name brands with quality apparel and accessories including Patagonia , Eagle Creek , Columbia and Tilley Hats . In the Signature Collection section, travelers will be able to commemorate their journey with branded Insight Vacations merchandise including custom embroidery. Guests can shop by destination reflecting the award-winning brand's handcrafted itineraries including Europe, India, Asia, North Africa, Eastern Mediterranean and the Americas to ensure that they can travel in comfort and style. The online store's customer representatives are knowledgeable, well-traveled, friendly and will be handling all product queries, transactions and shipping orders. \"As we continue to innovate and expand our product portfolio, we are pleased to offer our guests the opportunity to purchase travel gear and accessories conveniently online,\" said John Boulding, Global CEO, Insight Vacations . \"Our retail products will be delivered to their homes just in time for their unforgettable journey.\" For more information, please visit us at www.insightvacations.com , and join the conversation using the hashtag #InsightMoments on Facebook and Twitter . For reservations, contact your favorite travel agent or call Insight Vacations at (888) 680-1241. \nAbout Insight Vacations For more than 35 years, Insight Vacations ® has been designing the world's finest escorted travel itineraries. Insight offers 113 journeys to more countries across Europe than any other operator and provides the same legendary service across North America, India, Bhutan, Nepal, Morocco, Egypt and Israel. Insight guests enjoy The Art of Touring in Style ® with business-class legroom aboard customized luxury coaches, intimate groups of just 40 travelers and the services of an experienced Tour Director who acts as \"traveling concierge.\" Each expertly planned itinerary includes a range of Signature Events for a unique and authentic look into the history and culture of each destination. Throughout their trip, guests will stay in handpicked hotels that are centrally or scenically located and have the perfect balance of guided and independent exploration. About The TreadRight Foundation Created as a joint initiative between The Travel Corporation 's family of brands, The TreadRight Foundation is a not-for-profit that works to help ensure the environment and communities we visit remain vibrant and preserved for generations to come. To date, TreadRight has supported more than 35 sustainable tourism projects worldwide. The foundation's guiding principle is to encourage sustainable tourism development through conservation, leadership and support for communities. TreadRight's past project partners include WWF, Conservation International and The National Trust in the UK. Current initiatives include sponsoring the National Geographic Society's inaugural \"World Legacy Awards,\" helping to combat wildlife crime with WildAid, and empowering individuals with the Alliance for Artisan Enterprise. To learn more about our past and current work at TreadRight, please visit us at TreadRight.org . Media Contacts: Susan Chou Public Relations Coordinator Susan.Chou(at)TravCorpUSA.com Twitter: @Susan_TravCorp Arnelle Kendall Vice President of Public Relations Arnelle.Kendall(at)TravCorpUSA.com Twitter: @ArnelleKendall The Travel Corporation Public Relations Office 636 East Atlantic Avenue Suite 203 Delray Beach, FL 33483 561.330.0850 Related Articles", "external_links": [], "published": "2015-07-24T20:52:00.000+03:00", "crawled": "2015-07-24T21:32:28.743+03:00", "highlightTitle": ""}