{"organizations": [], "uuid": "e7493d4c931964f3cdbbf2387f5a2e5a65285b78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61379/us-travel-leaders-decry-airline-capacity-cuts-amid-soaring-profi", "country": "US", "title": "US travel leaders decry airline capacity cuts amid soaring profits", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "US travel leaders decry airline capacity cuts amid soaring profits", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T21:21:00.000+03:00", "replies_count": 0, "uuid": "e7493d4c931964f3cdbbf2387f5a2e5a65285b78"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61379/us-travel-leaders-decry-airline-capacity-cuts-amid-soaring-profi", "ord_in_thread": 0, "title": "US travel leaders decry airline capacity cuts amid soaring profits", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US travel leaders decry airline capacity cuts amid soaring profits Adv: \nJul 13, 2015 Adv: \nWASHINGTON, DC - US Travel Association President and CEO Roger Dow reacted to American Airlines' announcement that it will slow its intended growth in total seat capacity—news that sent its shares four percent higher by Friday's trading close—while at the same time reporting first-quarter profits that doubled last year's: \n\"It's depressing that actions that show disdain for travelers are the ones deemed to be the best business practices. The real irony is that American says it's cutting seats because of softening demand—which we've been worried was inevitable all along because surveys show U.S. travelers would almost rather have a root canal than fly commercial. \n\"The untold story is that inaction in Washington is driving these decisions in the board room. This happens in the airline industry because major carriers are allowed to dominate routes and individual markets, keeping competitors out and enabling them to set prices with little or no downward pressure. \n\"We need an airport financing model that allows airports to expand and let new carriers bid for service. Congress could get us there if it would just listen to common sense: a cut in airline ticket taxes coupled with a boost in the cap on the Passenger Facility Charge user fee would pave the way for the terminal upgrades that airlines have lobbied hard against expressly because they would help bring new competition. \n\"Until Washington creates the circumstances in which 'capacity discipline' is not the profit-making virtue for airlines that it currently is, speculators will continue to reward them for it, which is harmful to an American economy and way of life that is deeply intertwined with travel.\"", "external_links": [], "published": "2015-07-13T21:21:00.000+03:00", "crawled": "2015-07-13T22:03:34.000+03:00", "highlightTitle": ""}