{"organizations": [], "uuid": "7f093e8361f6638a6cd4f592d723b8ff6bf2c568", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150706Osa1Mariosmaller.jpg", "site_section": "http://www.ticotimes.net/categories/topics/travel", "section_title": "Travel and Tourism Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/06/let-osa-grow-green-balancing-conservation-empowerment-and-entrepreneurship", "country": "US", "title": "Let Osa grow green: Balancing conservation, empowerment and entrepreneurship", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Let Osa grow green: Balancing conservation, empowerment and entrepreneurship -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T01:45:00.000+03:00", "replies_count": 0, "uuid": "7f093e8361f6638a6cd4f592d723b8ff6bf2c568"}, "author": "Randall Trejos", "url": "http://www.ticotimes.net/2015/07/06/let-osa-grow-green-balancing-conservation-empowerment-and-entrepreneurship", "ord_in_thread": 0, "title": "Let Osa grow green: Balancing conservation, empowerment and entrepreneurship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "See also: Innovation is the new black – 3 pitfalls for businesses to avoid\nAlthough we arrive more than fashionably late, Mario Torres welcomes us to his finca with the warmth you can only find when you’re far enough from a city. Seven years ago, Mario moved to the Osa Peninsula from the province of Limón with high hopes for a new start, but while the Southern Zone region is one of the most beautiful natural destinations in Costa Rica, times have been tough.\nEfforts to preserve this natural wonder span 40 years, since Corcovado National Park was created in 1975. However, protecting nature, while a noble cause, cannot be done without taking into account the people that live off the land. Just as in any ecosystem, when you remove one piece (in this case, the right to exploit the resources), the whole system is thrown off balance.\nThe recent Osa Trails graduation.\nCourtesy Fabiola Kano\n“I remember when they told us we had to leave,” says Eida Fletes, remembering the moment in 1976 when several families had to be relocated due to the creation of the National Park. “My father was a hunter, and between the meat he brought home and what we could grow in the field, we made our livelihood, but now it was forbidden.”\nThis would be the beginning of decades of tension between the goal of preserving nature, and locals’ need to earn a living. While it was now illegal, many would choose to survive by doing the things they had done all their lives: hunt, mine for gold, cut down trees.\n“It is not that we don’t care for the environment. It’s just that this is how what we have always earned a living,” says Johnny Rodríguez, a former hunter.\nIn case you haven’t heard, the Osa Peninsula is considered the most biologically intense place on earth . According to data from the National Conservation System ( SINAC ), Corcovado National Park alone received 48,000 visitors last year alone. This affluence, however, has not necessarily benefited local communities. Due in part to the remoteness of the place and in part to the lack of infrastructure, most tourists stay at one of the medium-sized hotels, leaving only to go to the park. They thereby miss out on the cultural component of the region and deprive the locals of a environmentally friendly source of income.\nEnter rural tourism . Increasing in popularity across the globe, rural tourism allows visitors to experience the lifestyle, culture and cuisine of local people, enabling those residents to benefit from tourism without having to make huge investments. Although this type of tourist knows he’s not headed to a resort and spa, it is always a challenge to make the expectations of both parties meet, and create a rewarding experience for all.\nThis managing of expectations and experience design is where a project called Osa Trails, or Caminos de Osa , has done its magic. An initiative of several public and private organizations including the Costa Rica U.S.A. Foundation for Development ( CRUSA ), Stanford University’s Osa-Golfito Initiative ( INOGO ), Responsible Business for All ( RBA ) and SINAC, Caminos de Osa is betting on collaboration to pull off a feat no one else has yet accomplished: the delicate balancing act of natural conservation, community empowerment and economic development. Through its bottom-up approach, the program trains local entrepreneurs, supports them through mentorship, connects them with tour operators and helps them organize themselves to strengthen their bonds as a way to make their micro-business grow.\nThe support and the sense of community that Osa Trails has generated are what inspired Mario to completely renovate his property. With his own hands, he has turned his former home into a guesthouse with three rooms, built a small butterfly farm, and created an hour-long hiking path complete with signs. The scene is breathtaking; you can see Corcovado from Mario’s backyard.\nOf course, a project as ambitious as Osa Trails could only come to life by bringing many actors together. Tour operators train the entrepreneurs in customer service, basic amenities and signage; students from Universidad Veritas help them design their menus and the layout of their cabins; seasoned entrepreneurs mentor them, and staff members from RBA hold workshops on personal growth, teamwork and leadership.\nMario looks out at Corcovado. Randall Trejos/The Tico Times\n“The students helped me with the decoration of the cabinas, and now I’m even learning English to communicate better with tourists,” says Marylin Calderón, who owns and manages Cabinas Lapamar, a three-cabin hostel in Playa Blanca, along with her dad.\n“We had closed the place down, but we recently reopened and are already seeing the difference,” Marylin adds, while her father cuts the lawn with a lawn mower that looks straight out of a museum. “When we are full, I send the tourists to my neighbor, and she does the same for us.”\nMore than just sparking entrepreneurship and community bonds, Osa Trails is sparking hope. In their recent graduation, 23 local entrepreneurs were recognized for finishing the yearlong program. The group ranged from the owners of small family restaurants, or sodas, to a former gold prospector turned tour guide. At the ceremony, they were recognized and praised for their efforts by the many attendees, including Costa Rican Vice-President Ana Helena Chacón. Emotions were high and some of the graduates were even in tears; this was the most anyone had cared about their well-being in a long time.\nThe last thing we did before leaving was visit Mario’s place. The guesthouse is a little rough around the edges and the trails lack security handrails you might find at a National Park, but it doesn’t matter; you’ll never walk through that forest without him. This is what the experience is all about. As you explore one of the most beautiful natural landscapes in the world, you are connecting with him at a very personal level; he tells you his story with no scripts, and with a humility that disarms you.\nYou let go of the fact that the mosquito nets don’t match and that the term “fully-equipped kitchen” has a broad definition at Mario’s. You let it go because you know all of this is the product of his effort, his hard work and his hope, and somehow you are now part of it. You let it go because the house, the trail, the butterfly farm, humble as they are, show the glow of something that has been made with heart.\nFor more information about any of the Osa Trails entrepreneurs, visit the project website or write info@grupo-RBA.com .\nRead more “Doing Business columns” here .\nRandall Trejos works as a business developer, helping startups and medium-sized companies grow. He’s the co-director of the Founder Institute in Costa Rica and a strategy consultant at Grupo Impulso . You can follow his blog La Catapulta or contact him through LinkedIn . Stay tuned for the next edition of “Doing Business,” published twice-monthly.", "external_links": ["http://www.tomeimpulso.com/", "http://www.crusa.cr/", "http://www.earthtimes.org/conservation/osa-peninsular-the-biologically-intense-place-earth/2020/", "http://www.sinac.go.cr/Paginas/Inicio.aspx", "https://cr.linkedin.com/in/randalltrejos", "http://fi.co/?target=san_jose", "https://en.wikipedia.org/wiki/Corcovado_National_Park", "https://en.wikipedia.org/wiki/Rural_tourism", "http://enlacatapulta.wordpress.com/"], "published": "2015-07-07T01:45:00.000+03:00", "crawled": "2015-07-06T23:41:18.000+03:00", "highlightTitle": ""}