{"organizations": [], "uuid": "406df2c91a5da69dbfe47d1b5f5b552979e7487b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theplanetd.com", "main_image": "http://theplanetd.com/images/tofino.jpg", "site_section": "http://theplanetd.com/feed", "section_title": "The Planet D: Adventure Travel Blog", "url": "http://theplanetd.com/tofino-and-ucluelet-british-columbia-canada/", "country": "", "title": "Tofino and Ucluelet: Canadian West Coast Wonders", "performance_score": 0, "site": "theplanetd.com", "participants_count": 1, "title_full": "Tofino and Ucluelet: Canadian West Coast Wonders", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T15:22:00.000+03:00", "replies_count": 0, "uuid": "406df2c91a5da69dbfe47d1b5f5b552979e7487b"}, "author": "Dave and Deb", "url": "http://theplanetd.com/tofino-and-ucluelet-british-columbia-canada/", "ord_in_thread": 0, "title": "Tofino and Ucluelet: Canadian West Coast Wonders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted By Dave and Deb • No Comments » • Canada , Guest Posts \nIt’s known as the Great White North, but Canada is home to natural beauty markedly different from the snow drifts and icicles outsiders so often associate with this vast country. \nIn Tofino and Ucluelet, side-by-side towns on the edge of Vancouver Island, British Columbia, natural treasures are abound. Old-growth rainforests and dramatic coastlines hugged by beaches feel like the end of the earth, soothing and invigorating every traveller fortunate enough to explore them. Rainforests and Beaches of Tofino and Ucluelet \nHere’s where you can find some of them: The Wild Pacific Trail \nA dream for nature lovers and hikers, Ucluelet’s rugged coastline offers a trail through a forest of old-growth spruce and cedar trees, and viewpoints with spectacular panoramas of the Pacific Ocean, Barkley Sound and the Broken Group Islands. Add the serenade of the ocean waves crashing against the rocks below and the Wild Pacific Trail melts every worry away. The Wild Pacific Trail of Tofino Schooner Cove \nIn Tofino on the north end of Pacific Rim National Park, wooden boardwalks and stairs wind through ancient, moss-covered cedar and hemlock trees, dipping through valleys and over babbling brooks. The 2 km path eventually opens onto a secluded bay and rocky outcrop, the end to a profoundly rejuvenating journey. As the “lungs of the earth”, rainforests provide us with much-needed oxygen — and it’s hard to imagine it gets much purer than this. The Beaches \nTofino’s beaches are a different breed from the tropical skies, palm trees and white powder sands of the Caribbean, but they are magical — and, for some, even healing. Surfers chase the west coast waves (the town enjoys the status of Canada’s surfing capital); non-surfers walk the ethereal stretches of sand against the lull of the tide while searching for sea life. \nBut the beaches are at their most beautiful when the sun rises and falls. An Escape to Nature \nEvery now and then, we can all use an escape from the urban jungle and noise of everyday life, a moment to reconnect with our natural surroundings — and ourselves. In west coast Canada, Tofino and Ucluelet are exactly the places to do just that. \nHelen Suk is a travel writer and photographer based in Toronto. A passionate explorer, she covers both her backyard and far-flung destinations, from the Galapagos Islands to the African bush. Her experiences are shared on her blog (recently featured by National Geographic Traveller, UK), Not Without My Passport , with the goal of inspiring others to seek new experiences and see the world in a different way. \nFollower her on Instagram (for iPhone-only photos), Facebook , Twitter , Google+ or Pinterest .", "external_links": [], "published": "2015-07-10T15:22:00.000+03:00", "crawled": "2015-07-10T17:45:07.000+03:00", "highlightTitle": ""}