{"organizations": [], "uuid": "d0267a8b25fa0743e7f6bc34eb2f83e5874d99a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61609/timbuktu-mausoleums-destroyed-islamic-extremists-restored", "country": "US", "title": "Timbuktu mausoleums destroyed by Islamic extremists restored", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Timbuktu mausoleums destroyed by Islamic extremists restored", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T05:30:00.000+03:00", "replies_count": 0, "uuid": "d0267a8b25fa0743e7f6bc34eb2f83e5874d99a6"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61609/timbuktu-mausoleums-destroyed-islamic-extremists-restored", "ord_in_thread": 0, "title": "Timbuktu mausoleums destroyed by Islamic extremists restored", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Timbuktu mausoleums destroyed by Islamic extremists restored Adv: \nJul 20, 2015 Adv: \nTIMBUKTU, Mali - Fourteen mausoleums in Mali's northern city of Timbuktu that were destroyed by Islamic extremists have been restored by the United Nations. \nUNESCO's director general and Mali's cultural minister inaugurated the reconstructed mausoleums Saturday in this desert city that was a major center of learning and trade in the Middle Ages. \n\"We celebrate a day that turns a page in our dark history. The reconstruction of these mausoleums helps us forget those moments of desolation,\" said the mayor of Timbuktu Halle Ousmane. \nThe entire city of Timbuktu is listed as a World Heritage Site by UNESCO. At the peak of its influence in the 15th and 16th centuries, Timbuktu counted 180 schools and universities which received thousands of students from all over the Muslim world. \nIslamic radicals who overran Timbuktu in 2012 destroyed 14 of the city's 16 mausoleums, one-room structures that house the tombs of the city's great thinkers, according to their harsh interpretation of the religion. \nThe mausoleums were left barely more than heaps of mud, reminders of the brutal rule of the extremists, who imposed an extreme version of Islamic law on this fabled city, forcing women to wear veils, banning music and carrying out executions and public whippings. \nThe jihadis were driven out after nearly a year by a French military intervention. \nThe reconstruction of the mausoleums took more than a year and cost about $500,000, UNESCO said as part of a series of projects in Timbuktu being carried out by UNESCO. \n\"We have kept our promise, this is why we are here to say no to extremism, and yes to peace, development and at the same time pay homage to the Timbuktu community,\" said UNESCO's director-general Irina Bokova, speaking alongside Culture Minister N'diaye Ramatoulaye Diallo.", "external_links": [], "published": "2015-07-20T05:30:00.000+03:00", "crawled": "2015-07-20T12:14:56.699+03:00", "highlightTitle": ""}