{"organizations": [], "uuid": "a7dc1cdf9a059eb59d40035dae3d66eafade5a92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/27954-fifteen-year-high-for-hotel-occupancy-in-manchester-city-centre", "country": "US", "title": "Fifteen year high for hotel occupancy in Manchester city centre", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Fifteen year high for hotel occupancy in Manchester city centre", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T18:45:00.000+03:00", "replies_count": 0, "uuid": "a7dc1cdf9a059eb59d40035dae3d66eafade5a92"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/27954-fifteen-year-high-for-hotel-occupancy-in-manchester-city-centre", "ord_in_thread": 0, "title": "Fifteen year high for hotel occupancy in Manchester city centre", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fifteen year high for hotel occupancy in Manchester city centre Fifteen year high for hotel occupancy in Manchester city centre Details Category: Agency & Association   16:45 New hotel occupancy data – supplied by STR Global, Ltd and released today by Marketing Manchester – demonstrates that Manchester city centre hotels have achieved their best half year results on record. Manchester city centre attained an average occupancy rate of 78% from January to June, which shows a significant increase on the 75% reached in the first six months of 2014 and surpasses the previous peak of 76%, attained in 2007. \nGreater Manchester also performed well as average occupancy reached 77% indicating the peak is not solely limited to the city centre. June was a particularly strong month for Greater Manchester, achieving occupancy rates of 81%. City centre rates were also at 81%; only the third time monthly city centre occupancy rates have exceeded 80% since records began in 2000. A 98% occupancy rate in the city centre was reached on two week-nights during the month. Tuesday 23 June saw Emirates Old Trafford host the Twenty20 cricket match between England and New Zealand while Wednesday 24 June saw Taylor Swift perform at Manchester Arena. In addition, business tourism played an integral role on these dates as Manchester Central hosted the Chartered Institute of Housing conference from 23-25 June, attracting over 7,000 visits and Manchester Town Hall hosted the OECD LEED Forum on Wednesday 24. Nick Brooks-Sykes, director of tourism at Marketing Manchester, said: “2014 was an exceptional year for Greater Manchester’s hotel industry and it is pleasing to see that level of achievement being carried forward in to the first half of 2015. Occupancy rates reaching a fifteen year high are clear evidence of the current vitality of our tourism industry. “Greater Manchester continues to invest in a varied programme of world class events, ranging from international sporting displays to global music stars, and the region’s hotel industry has benefited considerably. We fully expect this positive trend to continue in to the second half of the year as the calendar is filled with significant tourism developments. The Manchester International Festival made a successful return earlier this month; Manchester Pride’s 25th anniversary will take place in August; the Rugby World Cup comes to Manchester in October; and the famous Manchester Christmas Markets will be arriving once again in November. “The value of business tourism to the hotel industry also cannot be underestimated. Weekday occupancy rates have remained strong with a peak of 98%, which highlights the weight of conferences and meetings on the area. The large numbers of visiting delegates assist in providing a higher baseline during the week, which would generally be much quieter for visitors. “There are, in fact, a number of high-profile international conferences scheduled for the remainder of the year, especially during August which is traditionally a quieter month for business tourism. SER 2015, the 6th World Congress on Ecological Restoration and CASE Europe 2015, Europe's largest gathering of advancement professionals from schools, colleges, universities and cultural bodies are just to two of five major conferences expected to bring approximately 5,000 delegates to the region in total in August.” Related articles", "external_links": [], "published": "2015-07-29T18:45:00.000+03:00", "crawled": "2015-07-29T18:57:27.151+03:00", "highlightTitle": ""}