{"organizations": [], "uuid": "ab3add8b8b005617dfb62b8e793f1a4aa8e0d4c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources2.news.com.au/images/2015/07/08/1227433/786482-6bf2cf88-252e-11e5-a1dc-713890f6a5ce.jpg", "site_section": "http://www.adelaidenow.com.au/travel/world/asia", "section_title": "Asia | Asian Holidays and World Travel | The Advertiser", "url": "http://www.adelaidenow.com.au/sport/afl/crows-will-play-as-walsh-would-have-wanted-says-veteran-midfielder-scott-thompson/story-fnia3xzy-1227433786508", "country": "US", "title": "Crows will play as Walsh would have wanted, says veteran midfielder Scott Thompson | The", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 3, "title_full": "Crows will play as Walsh would have wanted, says veteran midfielder Scott Thompson | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T22:17:00.000+03:00", "replies_count": 2, "uuid": "b7b59abef318d7eff8d4a86d7b7360967a463b23"}, "author": "RICHARD EARLE", "url": "http://www.adelaidenow.com.au/sport/afl/crows-will-play-as-walsh-would-have-wanted-says-veteran-midfielder-scott-thompson/story-fnia3xzy-1227433786508#post-0", "ord_in_thread": 0, "title": "Crows will play as Walsh would have wanted, says veteran midfielder Scott Thompson | The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "VETERAN Crows midfielder Scott Thompson has vowed his team will front up, attack and win against West Coast at Subiaco on Saturday — just as late coach Phil Walsh would have wanted.\nSpeaking publicly for the first time since the Phil Walsh tragedy, evergreen champion Thompson said playing would be part of the healing process as the Crows come to grips with the death of their mentor just five days ago.\nWhile Adelaide’s clash with Geelong was cancelled last Sunday, Thompson said none of the Crows squad had expressed a desire to miss the Perth road trip.\n“I am actually now, after the weekend’s gone, looking forward to sticking tight with the team again. It is a day-by-day thing but we are looking forward to attacking West Coast on Saturday night and we will put 22 blokes out who will give it a red-hot crack,” said 32-year-old Thompson.\nCrows, fans fly as one\nAdelaide today completed a second, white hot session on the track this week under interim boss Scott Camporeale and new director of football John Worsfold.\nWalsh’s proteges are hellbent on honouring his “elite standards” and “team first” mantras.\n“We will have Scott Camporeale in charge and he will continue to drive what Phil was driving with elite standards,” said Thompson, Adelaide’s elder statesman, with 274 games since 2001.\n“To have John Worsfold on board — we are thankful to him for giving up his time in the second half of the season.”\nAround 1500 fans watched Adelaide’s open training session at Football Park today in an emotional union of the club, players and loyal fans.\n“It was fantastic to see some many supporters come out and see us today, the amount of love and support we have seen from the whole football community, supporters and fans has been overwhelming for everyone,” said Thompson.\nWhile Adelaide, now with a 7-5-1 win-loss-draw record, is determined to uphold the vision of Walsh, Thompson said there was a new “perspective” at West Lakes.\n“Footy gets pushed aside when things like this happen,” said Thompson.", "external_links": [], "published": "2015-07-08T22:17:00.000+03:00", "crawled": "2015-07-08T20:11:14.000+03:00", "highlightTitle": ""}