{"organizations": [], "uuid": "ecc7a8eb7a06d94496f5985d414b0caf8026ee6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/duty-free-hunter.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-technology-news/", "section_title": "Travel Technology news | Travel and Tour World | Online technology news | distributive system | mobile application |travel trade professionalsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/duty-free-hunter-revolutionizes-airport-shopping/", "country": "US", "title": "Duty Free Hunter revolutionizes airport shopping - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Duty Free Hunter revolutionizes airport shopping - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ecc7a8eb7a06d94496f5985d414b0caf8026ee6d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/duty-free-hunter-revolutionizes-airport-shopping/", "ord_in_thread": 0, "title": "Duty Free Hunter revolutionizes airport shopping - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Duty Free Hunter revolutionizes airport shopping Published on : Wednesday, July 8, 2015\nIntroducing Duty Free Hunter – www.dutyfreehunter.com is the first Global Hub for the Global Shopper – providing travellers around the world with a single place to match their next trip to the duty free and luxury shopping on offer in the world’s airports and onboard airlines.\nBuilt with the help of the major airports, duty free retailers, airlines and travel organisations Duty Free Hunter offers travellers a stylish, accurate and free means to find out what shopping is on offer along their whole route – on departure, inflight and on arrival.\nIn addition, the Duty Free Hunter blog www.dutyfreehunter.com/blog carries news on the latest store openings, exclusive product launches, events and competitions, promotions and special offers running in duty free shops around the world.\nDuty Free Hunter is a truly ground-breaking service for travellers looking to do their duty free shopping at airports and inflight. For the first time we have married global air schedules against the most comprehensive list of duty free and other airport stores providing a one-stop place for travellers to plan and prepare their duty free shopping journey.\nClearly having the most accurate and up to date information on the airlines and airports that transport passengers is essential. To this end we have partnered with the world’s leading flight schedule authority, Innovata, to ensure we know exactly who flies where.\nEqually important is the database of stores operating inside each terminal at every airport. Here our own specialist database of the duty free and travel retail industry, The Decision Makers, has led the way. Alma Media, owner of Duty Free Hunter, has been at the heart of the duty free business for over 25 years and taking that knowledge has created a global registry of the shops and retailers who are serving travellers in the ground and in the air as they travel.\nSHOPPING THE WORLD OF TRAVEL RETAIL:\nThe duty free industry is something of a business phenomenon. In just 60 or so years the business has spread from the very first shop at Ireland’s Shannon Airport to a global industry with total sales in excess of US$65bn, there are now duty free stores beyond the airport too with downtown, border stores, ferry and cruise terminals all taking advantage of low or no sales tax opportunities to sell to travellers away from their own countries.\nThis development has gone hand in hand with the huge increases in the number of air passengers – something like 5bn journeys will be made by air this year and at least half will involve international passengers and therefore offer the chance to enjoy duty-free shopping to the full. This ongoing boom has meant a constant need for airports to expand and improve to handle the numbers and needs of the modern passenger – and retail had now become an essential part of any new or redeveloped terminal project.\nAt the forefront are the international hubs with London Heathrow, Dubai International, Hong Kong International, Paris Charles De Gaulle and Singapore Changi as the top 5 in terms of traffic (2013 figures). Partnering with the airports are the major duty-free retailers, companies such as DFS, Dufry, LS Travel Retail (Aelia), Lotte Duty Free, Heinemann Duty Free, World Duty Free, Nuance, Shilla Duty Free, Duty Free Americas and Aer Rianta run multiple stores in locations across the globe. In addition, some retailers stick to a single location, for example Dubai Duty Free and Qatar Duty Free.\nAs terminals have expanded so has the retail mix and now you will find individual boutiques for the world’s finest luxury brands such as Chanel, Burberry, Louis Vuitton, Dior, Estee Lauder, MAC cosmetics, Victoria’s Secret, Lancome run their own stores in major airports around the world.\nDuty Free Hunter’s database covers all these stores and boutiques around the world. Our team keep a constant watch for changes and update the database on a constant basis.\nRelated Posts Antalya Gazipasa Airport opens new terminal building TripAdvisor touches mark of 100 million downloads for free app for iPhone and Android Austrian Airlines Financial Results as at 30 September 2013: Positive result gives optimism for break-even in 2013 BOC Aviation Marks 20th Year With Record Net Profit in 2013 Lufthansa Group increases result in core business", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-08T10:05:14.000+03:00", "highlightTitle": ""}