{"organizations": [], "uuid": "bdcac2f5466d0025d41659433f50bd943727ea1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/7/781fc76f-3827-4ff3-b83a-8adb4f27ff20MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Wellness", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/wellness/really-smartphones-can-impact-your-learning-ability/article1-1367425.aspx", "country": "US", "title": "Really! Smartphones can impact your learning ability", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Really! Smartphones can impact your learning ability", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T12:48:00.000+03:00", "replies_count": 0, "uuid": "bdcac2f5466d0025d41659433f50bd943727ea1c"}, "author": "", "url": "http://www.hindustantimes.com/wellness/really-smartphones-can-impact-your-learning-ability/article1-1367425.aspx", "ord_in_thread": 0, "title": "Really! Smartphones can impact your learning ability", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated: Jul 09, 2015 15:46 IST Excess smartphone use can also dampen your creativity. (Shutterstock photo) \nPrevious studies have provided ample evidence that when smartphones are used with specific learning objects in mind, they can significantly enhance the learning experience. \nHowever, a recent study clearly demonstrates that simply providing access to a smartphone, without specific directed learning activities, may actually be detrimental to the overall learning process. \nThe research shows the self-rated impact of smartphones among the users. \n\"Smartphone technology is penetrating world markets and becoming abundant in most college settings,\" said Philip Kortum, assistant professor of psychology at Rice University in Houston and the study's co-author. \n\"We were interested to see how students with no prior experience using smartphones thought they impacted their education,\" said Kortum. \nThe research shows that while users initially believed the mobile devices would improve their ability to perform well with homework and tests and ultimately get better grades, the opposite was reported at the end of the study. \nThe longitudinal study from 2010 to 2011 focused on 24 first-time smartphone users at a major research university in Texas. \nPrior to the study, the participants were given no training on smartphone use and were asked to answer several questions about how they thought a smartphone would impact their school-related tasks. \nThe students then received smartphones, and their phone use was monitored during the following year. At the end of the study, the students answered the same questions. \nThe research appeared in the British Journal of Educational Technology. Tags", "external_links": [], "published": "2015-07-09T12:48:00.000+03:00", "crawled": "2015-07-09T17:55:30.000+03:00", "highlightTitle": ""}