{"organizations": [], "uuid": "7989147c658a92aa06988f6525abfb2c0de8508e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thecultureist.com", "main_image": "http://www.thecultureist.com/wp-content/uploads/2015/05/shutterstock_169567691-e1431615465780.jpg", "site_section": "http://feeds.feedburner.com/culture-ist", "section_title": "The Culture-ist - An online travel & culture magazine for the socially conscious citizen", "url": "http://www.thecultureist.com/2015/07/29/discover-your-local-used-book-store/", "country": "US", "title": "Discover Your Local Used Book Store", "performance_score": 0, "site": "thecultureist.com", "participants_count": 1, "title_full": "Discover Your Local Used Book Store", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T21:40:00.000+03:00", "replies_count": 0, "uuid": "7989147c658a92aa06988f6525abfb2c0de8508e"}, "author": "Annemarie Tompsen", "url": "http://www.thecultureist.com/2015/07/29/discover-your-local-used-book-store/", "ord_in_thread": 0, "title": "Discover Your Local Used Book Store", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Discover Your Local Used Book Store July 29, 2015 by Annemarie Tompsen Leave a Comment By Annemarie Tompsen \nIn middle school my required summer reading list included the book Black Boy by Richard Wright. A procrastinator, I waited until the last minute to reserve a copy at my local library. By the time July came, all copies were taken but salvation was found in a small used bookstore at 1099 Bridgeport Ave, Milford, CT. My mother and I found the book with the help of Penny Valentin, the store owner, but we were soon entranced by the dozens of other great discoveries just waiting to be found. Ever since, I’ve been visiting used bookstores. \nUsed bookstores can carry thousands of both hard cover and soft cover books ranging from romance novels to self-help. Many of these titles have seen multiple owners while some have been read only once. You never know what you’ll find, but the used bookstore is a treasure waiting to be discovered. Here are a few reasons why your local used bookstore is worth a gander. You’ll Save Money \nLike any used or discounted store, your local bookstore provides a product at a cheaper price. Many favorite titles can be found at nearly half the cost. Prices are often determined by print date, book condition and material. If you’re looking for a good read for cheap, used bookstores are a great alternative. Some stores even carry textbooks, which for college students is a helpful money saver. If you are interested in donating your used books, many stores will also offer discounts or store credit in exchange for your used titles. It’s a Great Way to Put Down Technology and Rediscover Reading \nAs a society we’re hypnotized by the growing vortex of tablets, smartphones and computers. We struggle to pull away from technology, especially during the colder seasons. Holding a print book is a nice break from a thin hard tablet or any other electronic device. Consider putting down your smartphone and venturing out to your local used bookstore. You’ll Help the Environment and Your Local Community \nAccording to the United States Environmental Protection Agency, the U.S. publishes more than two million books every year, contributing to a use of about 69 million tons of paper and paperboard. Donating your used books to a local bookstore is an easy way to help recycle while simultaneously increasing literary interest. Buying from local bookstores also helps your community flourish economically. Aside from supporting small business owners and saving money, you’ll also help combat against the monopolization of the book industry by companies like Amazon, currently the top online bookseller. It’s a Fun Way to Find Nostalgic Reads \nWe never quite forget the books we read growing up. Book series like Harry Potter , Nancy Drew and Goosebumps are books we look for and always seem to be hankering to re-read. A used bookstore is a great place to look for old books. Dozens of hidden gems for all ages can be found in varying conditions and genres. \nWhether you’re seeking a quick read, a textbook or a nostalgic collectable, your local used bookstore is a must-see. Many of them are in the smallest corners of town, concealed in unsuspecting strip malls or small houses, but this is what makes the book shopping experience unique. With the support of a strong reader’s community, print books can survive and used books stand as a symbol. About the Writer \nAnnemarie Tompsen currently studies Publishing and Writing at Emerson College, where she also works part time at the Lacerte Family Writing & Academic Resource Center. A New Englander at heart, she’s recently moved to the Boston area from the small coastal town of Milford, CT. In her spare time she frequents local Boston coffee shops and has taken an interest in finding the diviest diners around. With the summer approaching she looks forward to exploring Boston and traveling along the coast any chance she can. Annemarie hopes to use her love for the written word to pursue a profession in the publishing industry and to further develop her writing career. Follow her on twitter .", "external_links": [], "published": "2015-07-29T21:40:00.000+03:00", "crawled": "2015-07-30T09:30:29.790+03:00", "highlightTitle": ""}