{"organizations": [], "uuid": "9e2aad8880f8896ed828ac3e4454ec6219e844b6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "airtravel.about.com", "main_image": "http://f.tqn.com/y/airtravel/1/S/g/G/80489114_HighRes.jpg", "site_section": "http://airtravel.about.com/od/travelindustrynews", "section_title": "Air Travel Tips and Advice", "url": "http://airtravel.about.com/od/serviceissues/fl/AirHelp-Gets-Travelers-the-Compensation-They-Deserve.htm", "country": "US", "title": "AirHelp Gets Travelers the Compensation They Deserve", "performance_score": 0, "site": "about.com", "participants_count": 1, "title_full": "AirHelp Gets Travelers the Compensation They Deserve", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "9e2aad8880f8896ed828ac3e4454ec6219e844b6"}, "author": "By Benet Wilson", "url": "http://airtravel.about.com/od/serviceissues/fl/AirHelp-Gets-Travelers-the-Compensation-They-Deserve.htm", "ord_in_thread": 0, "title": "AirHelp Gets Travelers the Compensation They Deserve", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Image Source/Photodisc/Getty Images In April 2011, rules created by the U.S. Department of Transportation to protect and compensate travelers went into effect. Those rules included requiring airlines to reimburse passengers for bag fees if their bags are lost, provide consumers involuntarily bumped from flights with greater compensation, disclose hidden fees and expanded prohibitions on U.S. airlines operating domestic flights from allowing an aircraft to remain on the tarmac for more than three hours, with exceptions for safety, security and air traffic control related-reasons.\nBut most travelers don’t know that they can be financially compensated for any of the above items. And the ones who do don’t want to go through the hassle to get their compensation. That’s where UK-based AirHelp , an online service, comes in.\nThe company, formed in April 2013, found that 98 percent of eligible passengers never apply for flight compensation, piling up to billions of dollars a year. Travelers go to the AirHelp website, which ask five simple questions to find out if they are eligible for flight compensation:\nType of disruption (delayed, cancelled, or bumped) Departure and arrival airport Did you have any stops Flight details (flight number and date) Passenger information (email and booking reference) If they are, AirHelp will pursue the claim, asking only 25 percent of the value of successfully received claims. The company is the brainchild of Henrik Zillmer. “AirHelp was started because I was traveling a lot and inevitably I experienced delays and cancellations all the time,” he said.\n“I tried to figure out my rights and what compensation I was owed, since it was costing me a great deal of time and money.”\nZillmer found that in order to claim compensation, travelers have to go through a maze of documents, and chances are that claim will get rejected, not to mention the many times no response is received. “It took me over three months and lots of time to receive compensation. I thought, if I am experiencing this, well then other passengers might be in the same situation,” he said.\nAirHelp found that nearly four million U.S. passengers a year are eligible for compensation. “For U.S. domestic flights, over half a million passengers were bumped in 2013. Of those, approximately 10 percent were involuntarily bumped,” said Zillmer.\n“The relatively low number of involuntary bumpings leads AirHelp to believe that U.S. passengers aren't aware that they can receive up to $1,300 if their flight is oversold.,\" said Zillmer. \"The message is that flight passengers should think twice before accepting miles or vouchers, [because] they could be entitled to a much greater compensation.”\nSince its launch in Europe, AirHelp has helped tens of thousands of passengers and processed claims for more than $4 million in total, said Zillmer.\nFiling a claim is simple. A traveler goes to the AirHelp website, or download the app for iOS or Android . Click “start claim” and enter in the flight details. The claim will automatically be validated and AirHelp will inform you of what amount you could be eligible for.\n“Then just lean back and let AirHelp fight for your rightful compensation. We take care of everything until the money is in your account,” said Zillmer. “The average claim will take six to eight weeks, but sometimes there will be a need to take legal action, which can prolong the timeframe.”\nShare ", "external_links": ["http://f.tqn.com/y/airtravel/1/W/g/G/80489114_HighRes.jpg", "https://itunes.apple.com/us/app/airhelp/id698136946?mt&#61;8", "http://f.tqn.com/y/airtravel/1/S/g/G/80489114_HighRes.jpg", "https://play.google.com/store/apps/details?id&#61;eu.airhelp.mobile&hl&#61;da"], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-08T19:36:20.000+03:00", "highlightTitle": ""}