{"organizations": [], "uuid": "a612451bd7996faab40e73117c48952d4da234fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://www.seattlepi.com/lifestyle/travel/", "section_title": "Travel: Air, Land and Sea Guides and Resources - seattlepi.com", "url": "http://www.seattlepi.com/news/article/Buffett-s-firm-s-RV-maker-pays-5M-for-6376162.php", "country": "US", "title": "Buffett's firm's RV maker pays $5M for mishandling recalls", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Buffett's firm's RV maker pays $5M for mishandling recalls - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "a612451bd7996faab40e73117c48952d4da234fc"}, "author": "JOSH FUNK", "url": "http://www.seattlepi.com/news/article/Buffett-s-firm-s-RV-maker-pays-5M-for-6376162.php", "ord_in_thread": 0, "title": "Buffett's firm's RV maker pays $5M for mishandling recalls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "OMAHA, Neb. (AP) — Berkshire Hathaway's RV maker, Forest River, has agreed to pay at least $5 million and reform its practices because regulators say it mishandled safety concerns.\nThe company based in Elkhart, Indiana, will pay up to $30 million in additional fines if regulators find any additional violations in the next three years. The federal Transportation Department announced the agreement with Forest River on Thursday.\nForest River said it has been working with officials to correct the problems since it was notified. The company will also draft a set of guidelines for the RV industry and promote them as part of the agreement.\nRegulators said Forest River was slow to report some required data and failed to swiftly launch two safety recalls after problems were found in nearly 1,000 of its camper trailers.\nIn the recalls, Forest River initially failed to order recalls immediately and instead just sent safety bulletins to its dealers about the problems. The company also failed to report everything to regulators as quickly as the law requires once it knew about problems.\nThe agreement also calls for Forest River to hire an independent expert to audit its safety practices.\n\"Safety is a critical shared responsibility, and when manufacturers fail to meet their responsibility, the Department will enforce the law,\" Transportation Secretary Anthony Foxx said.\nForest River is owned by Warren Buffett 's Omaha, Nebraska-based conglomerate. Berkshire Hathaway owns nearly 90 different subsidiaries, including clothing, furniture and jewelry firms. It also has major investments in such companies as Coca-Cola Co. and Wells Fargo & Co.\nIn addition to the sanctions against Forest River, the Transportation Department announced a similar agreement with Spartan Motors, a Charlotte, Michigan-based firm that makes heavy-duty vehicle chassis and emergency-response vehicles.\nSpartan agreed to pay a $1 million penalty and invest up to $3 million in improvements. If additional violations are found, Spartan could be required to pay an additional $5 million.\nSpartan CEO Daryl Adams said he's not aware of any injuries or deaths associated with this issue, but the company regrets its past shortcomings.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-10T11:17:59.000+03:00", "highlightTitle": ""}