{"organizations": [], "uuid": "a49eecd3b991796e8ce07f4be84f4d4adf06c6e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/lifestyle/travel-tourism/", "section_title": "Travel News:Travel and Tourism,Latest Travel News,Tourism News Today,Latest Travel News Articles | The Financial Express", "url": "http://www.financialexpress.com/article/markets/indian-markets/manpasand-beverages-shares-edge-higher-after-tumbling-9-on-debut/98286", "country": "IE", "title": "Manpasand Beverages shares edge higher after tumbling 9% on debut", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Manpasand Beverages shares edge higher after tumbling 9% on debut | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T08:09:00.000+03:00", "replies_count": 0, "uuid": "a49eecd3b991796e8ce07f4be84f4d4adf06c6e5"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/indian-markets/manpasand-beverages-shares-edge-higher-after-tumbling-9-on-debut/98286", "ord_in_thread": 0, "title": "Manpasand Beverages shares edge higher after tumbling 9% on debut", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Manpasand Beverages ended positive on its stock market debut after a weak start on Thursday morning. The scrip closed at Rs 326.85, up Rs 6.85 or 2.14% from its issue price of Rs 320.\nShares opened 9% lower at 291 on the BSE and slipped to an intraday low of R286 apiece before ending higher. In contrast, the Sensex declined 0.41% in a volatile trade on Thursday whereas the BSE FMCG index lost 0.6%.\nDealers said there was hectic activity in the debutant’s shares given the underlying volatility in secondary markets. More than 64.5 lakh Manpasand shares exchanged hands on the BSE and NSE combined.\nDhirendra Singh, MD, Mansapasand Beverages attributed the initial slump in the stock to volatile markets and was hopeful that the stock would do well in the days to come.\nExperts said the listing day gain, albeit marginal compared with some of the recent IPOs, is a positive sign for the primary markets as more than three dozen companies are set to tap capital markets over the next two-three quarters.\nManpasand Beverages is a Gujarat-based FMCG company that produces various fruit drinks including “Mango Sip”.\nThe public issue of Manpasand Beverages – managed by Kotak Investment Banking, IIFL, and ICICI Securities – , was subscribed 1.4 times during the three-day book building process. The overall issue — taking into account the pre-IPO placement — was subscribed 1.23 times, stock exchange data showed.\nThe company will raise at least Rs 400 crore from the issue to set up a new manufacturing facility in Haryana. Apart from building a new facility, the company plans to utilise the IPO proceeds towards setting-up of a corporate office at Vadodara, modernization of existing facilities in Vadodara and Varanasi, repayment of loans and other general corporate purposes.\nThe Vadodara-based company had raised R180 crore through allotment of shares to anchor investors in a Pre-IPO offering. Eleven institutions including Amundi Funds, BNP Paribas, Goldman Sachs India Fund, Birla Sun Life Insurance and ICICI Prudential Life Insurance were allotted shares at a price of Rs 320 apiece.\n 10, 2015 12:09 am", "external_links": [], "published": "2015-07-10T08:09:00.000+03:00", "crawled": "2015-07-10T04:37:50.000+03:00", "highlightTitle": ""}