{"organizations": [], "uuid": "756fea1b3e0dda1c5f050bd23b3558e844d8b5ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03373/train-trans_3373287k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-13.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/journeysbyrail/11735471/Rail-travel-Around-the-world-in-80-trains.html", "country": "US", "title": "Rail travel: Around the world in 80 trains", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Rail travel: Around the world in 80 trains - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T17:33:00.000+03:00", "replies_count": 1, "uuid": "b1838d6af4660a682015a5c89a76bc1b1469f8b6"}, "author": "Monisha Rajesh", "url": "http://www.telegraph.co.uk/travel/journeysbyrail/11735471/Rail-travel-Around-the-world-in-80-trains.html#post-0", "ord_in_thread": 0, "title": "Rail travel: Around the world in 80 trains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Shortly before half past six, the Regionale creaked and began to inch away from Platform 10 at Milano Centrale. The station’s arched ceiling slid back like a sunroof, allowing a blaze of orange light to ignite the carriage. Wet with sweat, I peeled myself off the seat and tugged down the window as fellow passengers pulled open doors, wiped their foreheads and fanned themselves with copies of Metro. Within a few minutes the train had gained pace, and a steady blast of air was beginning to make the ride more comfortable when a grand Frecciarossa high-speed train slammed past in the opposite direction, making our flimsy regional train rattle in its wake. It would be two hours to Verona, so I picked up my Kindle on which Tim Parks was teaching me about the fiddles and frustrations of the country’s railways in his book Italian Ways. I soon put it down again and stared out at the vineyards rolling past the window, the bushes glowing in that wonderful evening light that Italy laps up and in which it basks. • 27 reasons trains are better than planes In suitably reflective mode, I conceded that I was obsessed with trains. Five years ago I stepped off the Charminar Express in Chennai and marked my 80th train journey around India. Armed with nothing but a 90-day rail pass, an outdated map, and extraordinary naivety, I had travelled 24,855 miles – the circumference of the Earth – reaching the southern, western, northern and easternmost extremities of India’s railways. Leaning out of doorways, perching on steps and sleeping in the odd linen cupboard, I covered the length and breadth of the country in four months and was drawn into its warm embrace by the whole railway family – from her royal highness the Deccan Queen and the sleek and chic Durontos, to the puffing and panting toy trains and thundering Rajdhanis. I hung from the badly behaved Mumbai commuters, had sweet dreams in the Indian Maharaja’s double bed, and witnessed orthopaedic surgery on the world’s first hospital train. But it was through the cast of characters who wandered the aisles, snored in the bunk above me or chatted by my side that I came to understand how the railways had earned the nickname “The Lifeline of a Nation”. Milan's Central Station Photo: AP/FOTOLIA A little secret: when I first arrived in India, I didn’t care for trains. They were simply the cheapest and most practical way to travel (my rail pass cost £350 for 90 days, the same price as a first-class return from London King’s Cross to Edinburgh Waverley – and that price included sleeper services and most of my hot meals). But when I was back home in London writing my book, something changed: I found that I was magnetised by the sound of wheels on steel. Scrolling through television channels, I’d perk up like a meerkat at any programme about trains; at night, the distant hoot of the overland service through Finchley and Frognal felt like the mother ship calling me home. So, a few weeks ago I left my job, packed my bag and boarded the 14:31 from London St Pancras to Paris Gare du Nord. Having travelled around India in 80 trains, the most obvious, albeit daunting, next step was to take on the world. Unlike Phileas Fogg and Passepartout (from whom I stole my idea) I don’t have a bet to win: the journey is not a race. • The world's scariest train rides I’ve never understood the bizarre need to complete a route in the fastest time possible. Why waste an opportunity to absorb all that a place and its people have to offer by shooting in and out? I could travel around the world in 10 trains; I could do it in a hundred if I wanted to. Eighty, I thought, was a nice round number that would make the journey a challenge – but not an impossibility. In the coming months, having already travelled extensively in Europe, I’ll make my way to Moscow via Riga for the big one (although I plan to take the trans-Mongolian, dipping south at Lake Baikal to Ulan Bator and on to Beijing, rather than the trans-Siberian). I have sketched out various journeys in Asia – through Vietnam, Thailand, Malaysia and Japan – followed by a route across North America, from the Rocky Mountains to the deserts of Arizona. I will obviously have to “cheat” and fly across the Pacific Ocean. Victoria Station in Mumbai Photo: AP/FOTOLIA Much of the trip remains open: I want there to be spontaneity. But the penultimate leg of the trip should take me winding across China and on to the ancient route of the silk traders through Kazakhstan, Uzbekistan and Turkmenistan. Visas permitting, I will return to Europe through Iran and Turkey, and would like to conclude the trip with the Venice to London route. And I will be sending regular dispatches to the Discover section of The Sunday Telegraph. Why do all this by train? For me, flying is expensive and boring, while car journeys are cramped and tedious. Trains, on the other hand, take the traveller into the nooks and crannies of a country and into the heart of its people. They are a microcosm of society, embodying literal class division: in India I could eat hot cornflakes with the ambassador to The Hague in a first-class carriage, then 36 carriages along, sit on wooden slats sharing pears in paper bags with a farmer from Gujarat. On trains I feel free: if I’m late, I can always catch another – and I can carry as much luggage as I like, with liquids in opaque bags. I can eat my own sandwiches, go for a wander, even move seats should I object to my companion. • The world's best rail journeys: in pictures When I set off , my goal was to spend the next 10 months finding out whether the charm and character of India’s railways extends around the rest of the world. Our British trains have lost the sparkle and spirit of their heyday, reduced to little more than a tired, delayed, grossly expensive form of transport for jaded commuters. But perhaps the glory of rail travel survives in other countries and undoubtedly there are pockets of the world where trains continue to play a vital role in enabling communities to survive and countries to thrive. With a one-month second-class Eurail pass in hand, I began my journey through Europe. From Paris I snaked down to Limoges and Clermont-Ferrand, weaving between forests and trundling over rivers tumbling through the Massif Central to Béziers, before curling down to Barcelona and blasting across to Madrid on the high-speed Ave opposite Rosita and Emily, two sleeping pensioners whose mouths had dropped open so far I could see the black plastic on their false teeth. Shah-I-Zinda memorial complex, Samarkand, Uzbekistan Photo: AP/FOTOLIA From Madrid I sat upright overnight to Lisbon, arriving with a sense of awe and a cricked neck, then circled the Douro Valley and back across Spain, hugging the coastline to Cannes, and spending the last week hopping between Milan, Verona, Florence and Rome . A Eurail pass is worth it if you’re planning a series of long-distance journeys: it pays for itself in five or six train rides. And if you have a fixed itinerary, reservations can be made anywhere from 90 days in advance. But it has its restrictions. I don’t like rigid plans and my best moments have come through serendipitous encounters with other travellers dishing out advice and redirecting me at a moment’s notice. I don’t know what I’m doing next week, let alone in 90 days’ time – and I wouldn’t want it any other way. With a rail pass, though, this presents a few problems. • Overnight sleeper trains: 10 of the best trips At Milano Centrale I met Marie, a 50-year-old designer from New Zealand. She and I struck up a friendship through a session of mutual sighing and eye-rolling at the inability of Italians to form a queue – a queue, by the way, for a ticket to get into a second queue, so you can then sort out your pre-bought ticket. That’s Italy for you. I like it, though, because it’s as close as I have come to anything vaguely resembling the insanity of Indian Railways in terms of bureaucracy. Marie pushed her sunglasses on to her head and pulled a face: “You think a rail pass gives you freedom, but actually it’s the opposite. When you make a booking you have to stick to it or you end up queuing forever to change your booking and only get some of the money refunded.” Portugal's Duoro Valley Photo: AP/FOTOLIA And that’s if you’re lucky. Trenitalia agents in Florence refused to change tickets I’d booked two days earlier in Monaco by SNCF, which refused to amend a booking made two days before that in Valencia by RENFE. Each insisted the other was responsible for voiding the tickets that were no longer needed and that any refunds had to be requested by post. Needless to say, I’ve racked up a fortune on reservation fees, ranging from €5 for a seat from Avignon to Cannes, to €35 for a high-speed service from Mannheim to Prague. Owing to temporary track replacement and repairs, there were no trains between Munich and Prague when I wanted to do that journey , forcing travellers on to a five-hour-long coach journey – my idea of hell. • Africa by train: the continent's best rail journeys So I took an unplanned and long-winded route via Mannheim and, just before midnight, boarded the 10-hour overnight service to Prague. It was the first sleeper service of my journey, and I cleaned my teeth, picked my way back to my bunk and slid into my sleeper sheet, plumping my fleece into a pillow. My companion flipped off the switch and wriggled around below for a few minutes until his even breathing told me he was asleep. I lay blinking at the ceiling. As the air conditioner hummed and the train relaxed into a gentle rock, a familiar feeling came over me. It was the unmistakable feeling of coming home. In addition to Monisha’s columns on Telegraph Travel, you can follow her journey on 80trains.com and on twitter @monisha_rajesh Around India in 80 Trains by Monisha Rajesh is published by Nicholas Brealey Publishing (£10.99). To order your copy for £9.9 plus p&p call 0844 871 1514 or visit books.telegraph.co.uk A one-month continuous Interrail Global Pass costs €626 in second class ( interrail.eu ) Essentials Railbookers (020 3327 2467 ; railbookers.com ) Independent rail specialists which, in addition to putting together itineraries, can also arrange accommodation along the way. Great Rail Journeys (01904 734500; greatrail.com ) Offers guided tours by rail worldwide, including a number in Britain utilising heritage trains and routes. Belmond (0845 0772 222; belmond.com ) Upmarket tours by private trains such as the Northern Belle and British Pullman. Ffestiniog Travel (01766 772030; ffestiniogtravel.com ) offers up to 30 escorted rail tours a year. Profits help support the Ffestiniog and Welsh Highland Railways. Planet Rail (01347 811810; planetrail.co.uk ) organises first-class railway holidays in Europe (and on the Golden Eagle Trans-Siberian Express). Most of its holidays are tailor-made. maninseat 61 ( seat61.com ) An authoritative site on almost all aspects of rail travel – at home and abroad. Follow @telegraphtravel", "external_links": [], "published": "2015-07-13T17:33:00.000+03:00", "crawled": "2015-07-13T16:37:47.000+03:00", "highlightTitle": ""}