{"organizations": [], "uuid": "0df96edb245821aa31b5829ca0d359383cbd2f2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/30/11/2AF5DE6900000578-0-image-a-81_1438252916992.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3179777/British-tourist-suffers-injuries-plunging-20-feet-Magaluf-hotel-balcony.html", "country": "GB", "title": "British tourist suffers serious injuries after plunging 20 feet from Magaluf hotel balcony", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "British tourist suffers serious injuries after plunging 20 feet from Magaluf hotel balcony | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T19:27:00.000+03:00", "replies_count": 1, "uuid": "336e6149748b630b988c088f6985717e89a6d711"}, "author": "Becky Pemberton For Mailonline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3179777/British-tourist-suffers-injuries-plunging-20-feet-Magaluf-hotel-balcony.html#post-0", "ord_in_thread": 0, "title": "British tourist suffers serious injuries after plunging 20 feet from Magaluf hotel balcony", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "46 shares 1\nView\ncomments\nA young British holidaymaker was taken to hospital after falling from a hotel terrace in Magaluf.\nAdam George Francis, 20, plunged more than 20 feet at the four-star Sol Wave House Hotel on the island's south coast just after 4am on Wednesday.\nThe tourist suffered a serious arm injury and multiple bruising during the fall.\nAdam George Francis, 20, plunged more than 20 feet from his hotel balcony in Magaluf just after 4am on Wednesday\nA spokesperson for Meliá Hotels International, the company that operate the Sol Hotels, said: 'The Sol Wave House hotel has never had a case of 'balconing' nor a similar accident.\n'The customer was attended eagerly after the accident, thanks to the rapid reaction of the hotel's security team, who immediately called for the ambulance.\n'He has already been released from the hospital and left the hotel, with some broken bones, bruises and injuries.'\n Next British teenager suffers serious head injuries after falling... The party's over: Police in Magaluf ordered to punish... Hours after Magaluf brings in new drinking laws, British... British tourist, 36, dies after suffering severe head... 46 shares 'Regarding the accident itself it seems the client tried to jump the railing around the deck-lounge (a huge solarium terrace on the first floor) after mistaking it with the access to his room, also located in the first floor, but at 30 metres distance from the railing.\n'After losing his balance, he fell to the ground floor's terrace, about five metres below.'\nThe police confirmed that no-one else was involved with the incident.\nLucky to be alive: Jenna McAlpine, 21, suffered head injuries, a broken arm and nose, and a fractured hip after her fall from a balcony in Magaluf\nOn the mend: Miss McAlpine took to Facebook just a few hours after the accident, saying: 'Managed to topple over the balcony. Broke my arm and nose and fractured my hip'\nHarry Carter, 18, fell from his balcony at Club B in Magaluf on July 16, and Jenna McAlpine had the same fate at the hotel in June\nEarlier this month a similar incident occurred in the area when Harry Carter, 18, toppled from a third-floor balcony at the Club B Hotel.\nHe was rushed to hospital with head injuries and a broken arm. Police sources said eye-witnesses had told them the holidaymaker was trying to climb from one outside balcony to another with a drink in his hand when he fell.\nScots tourist Jenna McAlpine, 21, injured herself in a fall last month in the same hotel.\nShe broke her hip, arm and nose falling from a first-floor balcony at the Club B Hotel on June 9 just hours after flying to Majorca.\nWhen Miss McAlpine updated her Facebook page with a photograph of her injuries she commented: 'So first few hours in Maga wasn't a success... So lucky to be alive.'\nBrunette Miss McAlpine, who arrived in Majorca the day of her accident, was treated by paramedics after falling from the Club B Hotel (pictured) in the centre of Magaluf\nA ban on night-time street drinking and changes to controversial pub crawls have been introduced in Magaluf\nIn addition to this, Ian Frankland, 36, from Doncaster, south Yorks, plunged nearly 20 feet down a flight of stairs inside a bar on the Punta Ballena strip.\nTragically, there have been far more serious incidents at the popular resort.\nBrit holidaymaker Jamie Todd, 20, was found drowned on a beach near Magaluf last month.\nHe disappeared from a group of six friends from Southampton, after a night out in the rowdy resort.\nOn May 2 a British man died in Magaluf after falling from a 13th floor balcony.\nHe was later named as expat Robert Fielding, 58, who lived on the island with his wife and child. Police said at the time they were treating his death as suicide.\nOfficials have now implemented a €1,500 penalty for those caught jumping from hotel balconies into swimming pools\nNew regulations were brought in earlier this year in a bid to reduce the number of holiday accidents.\nVictims could face fines of £1,000 if it is proved they were climbing between balconies.\nAs well as this, there is a £1,000 penalty for urinating in the street, £360 for going topless and sex games and drinking in the street are now prohibited from 10pm to 8am.", "external_links": ["http://dailym.ai/1Mzrdn7"], "published": "2015-07-30T19:27:00.000+03:00", "crawled": "2015-07-30T21:59:56.933+03:00", "highlightTitle": ""}