{"organizations": [], "uuid": "a0b219bab18b27979b8d7846f1915fee278350e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/a7335faa-2410-11e5-aaf4-cae02da47a87-1020x718.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/opinion/seattle-weather-is-an-early-peek-at-the-future/", "country": "EU", "title": "Seattle weather is an early peek at the future", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Seattle weather is an early peek at the future | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T01:27:00.000+03:00", "replies_count": 0, "uuid": "a0b219bab18b27979b8d7846f1915fee278350e9"}, "author": "Timothy Egan", "url": "http://www.seattletimes.com/opinion/seattle-weather-is-an-early-peek-at-the-future/", "ord_in_thread": 0, "title": "Seattle weather is an early peek at the future", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oh, the ceaseless Seattle sun. June just set another record — the hottest ever recorded in this city, closing out the warmest first half of a year.\nSeattle is farther north than Maine and Montreal, and yet, over the past month or so, it’s been hotter here than in Athens, Rome or Los Angeles on many a day. We had eight days at 85 degrees or higher in June. On Sunday, east of the Cascade Mountains, it hit 113 degrees in Walla Walla.\nLondon and Paris, two cities with a climate similar to Seattle’s, both set heat records this week — 98, the hottest July day in British history, and 103.5 in the City of Light.\nAs a native Seattleite, I’ve always wondered what it would be like to live in a place where it’s sunny every day. Now that I’m experiencing something close to that, I feel out of sorts in a strange land. Wildfires burn today in the Olympic Mountains west of Seattle, a forest zone that is typically one of the rainiest places on earth.\n Sure, my backyard grapes, my tomatoes, my Meyer lemons and my rosemary plants love it. This is Sicily in Seattle, with nearly 16 hours of daylight. June, known for its cloudy gloom, was “probably the sunniest month in Northwest history,” wrote University of Washington atmospheric scientist Cliff Mass on his weather blog.\nThe experts, Mass among them, do not think the broiling of the Pacific Northwest can be attributed to climate change. Rather, they credit a huge dome of high pressure to the west and warm ocean temperatures. But they say that what we’ve experienced over the past 16 months is an indication of what this part of the world will be like after the Earth has warmed by several degrees.\nSo, what’s not to like?\nFor starters, brown does not fit an emerald city. Not just every homeowner’s lawn, now the color of a baked potato, but alpine meadows, fields and deciduous trees that have given up for the year, shedding potato-chip crisp leaves as if it were October.\nAs anyone in California could say, get used to it. Or get a fake lawn. Or grow cactus plants. Summers in the Northwest are usually dry, mild and humidity-free — this is just an extreme version. Stop complaining.\nIn the withering heat, I can still look south and see the glaciers of Mount Rainier, holding the frozen legacy of winters long past. Water, as snow or ice, is not just the master architect of the Northwest but the main reason the islands, the mountains, the forests of this place are so beautiful.\nTake away the snow and change happens quickly. Salmon need cold water. Cherries, apples, peaches, wine grapes — all of which the Northwest grows in abundance — need that snowmelt as well. In mid-May, a statewide drought emergency was declared, after the snowpack in the Cascades was measured at its lowest level in 64 years.\nAhead, we could face major wildfires, in places where 500-year-old trees are draped with tendrils of green. Salmon-spawning rivers could be shallow and warm in early fall — lethal to this region’s iconic symbol.\nHere, at least, it’s fish and trees that are stressed. Elsewhere, it’s people. More than 1,000 people died in Pakistan last month in one of the deadliest heat waves in history.\nAll of this has made me curse Sen. James Inhofe, R-Okla., who calls the global scientific consensus on climate change “the greatest hoax.” And sadly, it matters what he says, because Inhofe chairs the Senate committee in charge of doing something about climate change. As such, he’s determined to prevent the world’s second biggest producer of carbon dioxide — the United States — from doing anything.\nInhofe is famous for bringing a snowball to the floor of the Senate to prove his point. What he proved is that there are Labradors with more common sense than a senator with a peanut for a brain.\nAt the other end of the spectrum is Pope Francis. In his recent encyclical on climate change, he made a plea to our better angels, a plea to take “care of our common home.” It’s a nice sentiment, but with people like Inhofe guiding U.S. policy, altruism alone will never work.\nWe need to act out of self-interest, as well. I love my little patch of the planet. Love the glaciers in August, the rivers at full flush, carpets of evergreen trees and a predominant breeze from Puget Sound that provides natural air-conditioning for more than 3 million people in the Seattle area.\nWe may lose this. The current heat is a precursor, an early peek at a scary tomorrow. Inhofe’s ignorance could have a direct effect on the place we leave our grandchildren.\nBefore giving in to a future in which the Pacific Northwest bakes, burns and shrivels, we have to defend the natural world — place by place.", "external_links": [], "published": "2015-07-07T01:27:00.000+03:00", "crawled": "2015-07-07T19:28:43.000+03:00", "highlightTitle": ""}