{"organizations": [], "uuid": "0b8a6b738498e3b0a2134ab65bb9c16d075f3a18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/13/10/2A7DBECD00000578-0-image-a-21_1436779439087.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3159039/She-s-101-year-old-woman-breaks-world-record-oldest-abseiler-roping-one-Britain-s-tallest-buildings.html", "country": "GB", "title": "Doris Long, 101, breaks her own abseiling world record at Spinnaker Tower", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 5, "title_full": "Doris Long, 101, breaks her own abseiling world record at Spinnaker Tower | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T18:10:00.000+03:00", "replies_count": 4, "uuid": "1aea515b3cb7b2e75bed9276c94092d34ec991d5"}, "author": "John Hutchinson for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3159039/She-s-101-year-old-woman-breaks-world-record-oldest-abseiler-roping-one-Britain-s-tallest-buildings.html#post-0", "ord_in_thread": 0, "title": "Doris Long, 101, breaks her own abseiling world record at Spinnaker Tower", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View\ncomments\nA 101-year-old woman has proved that age is just a number after breaking her own world record as the oldest abseiler.\nDoris Long once again conquered 560ft-high Spinnaker Tower in Portsmouth, Britain's tallest building outside of London.\nWind and rain did not deter Ms Long, who has been honoured with an MBE for her charity fundraising for a local charity.\nScroll down for video\nDoris Long completed her 16th successful abseil on Britain's tallest building outside of London\nThe Spinnaker Tower stands at 560ft tall, but proved no problem for 101-year-old Doris Long who scaled 310ft of the behemoth\nMs Long decended 310ft down the popular tourist attraction. She last performed the feat on her 100th birthday in May 2014.\nThe pensioner, nicknamed Daring Doris, who has previously abseiled alongside new Top Gear host Chris Evans, took up the challenge to raise money for the Rowans Hospice in Waterlooville.\nMs Long, who first abseiled at the age of 85, said: 'I don't feel afraid and never have, I just have a placid nature.'\n London's iconic Lanesborough hotel set to officially reopen... We'll drink to that! In-flight 'Air Hook' gadget eliminates... Relaxation taken to another level: The 'Hydro Hammock' is a... Rule, Britannia! Largest cruise ship ever built for UK... The centenarian, who is 5ft tall and weighs eight stone, added: 'I have a look down at the crowd, I am normally looking to see how the other person is getting on.'\nMs Long, who has a daughter, three grandchildren, seven great-grandchildren and two great great grandchildren, received cheers and applause from the crowds below as a band played The Proclaimers' hit I'm Gonna Be (500 Miles) as she reached the bottom of the tower.\n101 Doris Long breaks her own abseiling world record! The pensioner admitted the wind and rain made the descent somewhat tricky\nShe last performed the feat scaling the Spinnaker Tower on her 100th birthday in May 2014\nAfter the abseil, she said: 'It was very hard work, much harder than last year. It was so windy I swung about a bit but oh yes, I enjoyed it, I feel it's well worth it.\n'My legs ache like anything and my right arm where I hold the rope and my hair is all sticking out.'\nMs Long added that she was 'living in hope' to be able to repeat the challenge next year when she will be 102.\nMother-of-two Jennie Watson, 42, from Locks Heath, who completed the abseil earlier in the day, said: 'I am amazed, I think she's amazing, a real inspiration.\n'You have to be quite agile to get the ropes down but it's the bravery more than anything. How she does it, I have no idea.'\nFresh after completing the challenge, Ms Long's thoughts are turning towards doing it when she's 102\nThe 101-year-old raises money for her local charity, the Rowans Hospice in Waterlooville\nThe pensioner has been described as an 'inspiration' by those who work for the hospice\nKaren Kay, events fundraiser at the Rowans Hospice, said: 'Doris is an amazing lady and a huge inspiration. She has been abseiling for The Rowans Hospice for more than 10 years now and has raised over £11,000.\n'We can't thank her enough for supporting local hospice care. Everyone at The Rowans Hospice wishes Doris all the best for this epic challenge.'\nBRITAIN'S TALLEST BUILDINGS The Shard, London - 1,016ft\nOne Canada Square, London - 771ft\nHeron Tower, London - 755ft\nLeadenhall Building, London - 737ft\nHSBC Tower, London - 656ft\nCitigroup Centre, London - 656ft\nTower 42, London - 600ft\nSt George Wharf Tower, London - 594ft\nThe Gherkin, London - 591ft\nSpinnaker Tower, Portsmouth - 560ft\nMs Long, from Hayling Island, who hopes to raise £1,000, wrote on her JustGiving page: 'I first started abseiling at 85 years old and this will be my 16th abseil for the Hospice.\n'The Rowans Hospice is my local hospice and all the care is given completely free of charge. Please help me to continue their wonderful care and support for patients with life-limiting illnesses and their families.'\nThe tower opened to the public in October 2005 and forms a central part of the regeneration of Portmouth's quays.\nThe tower has three viewing platforms and a glass walkway where visitors can test their nerve.\nVisitors can see the Isle of Wight and Southampton from the viewing platform.\nTo sponsor Doris Long, visit www.justgiving.com/DorisLong101.", "external_links": ["http://dailym.ai/1JdBEWW"], "published": "2015-07-13T18:10:00.000+03:00", "crawled": "2015-07-13T14:28:50.000+03:00", "highlightTitle": ""}