{"organizations": [], "uuid": "f6a6a0125c67405dd5667f28b114ba777219b9e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/while-utah-mormons-celebrate-pioneer-day-counter-culture-pie-and-beer-day-gains-traction-318502061.html", "country": "US", "title": "While Utah Mormons celebrate Pioneer Day, counter-culture 'Pie and Beer Day' gains traction", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "While Utah Mormons celebrate Pioneer Day, counter-culture 'Pie and Beer Day' gains traction - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T21:55:00.000+03:00", "replies_count": 0, "uuid": "f6a6a0125c67405dd5667f28b114ba777219b9e8"}, "author": "Brady McCombs, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/while-utah-mormons-celebrate-pioneer-day-counter-culture-pie-and-beer-day-gains-traction-318502061.html", "ord_in_thread": 0, "title": "While Utah Mormons celebrate Pioneer Day, counter-culture 'Pie and Beer Day' gains traction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SALT LAKE CITY - Most people are gathering Friday in Utah to celebrate the state's Mormon heritage at Pioneer Day parades featuring floats, carriages and women in prairie dresses. But many non-Mormons will be enjoying an increasingly popular counter-holiday with a playful name: Pie and Beer Day.\nA few gathered on patios and lawns near the parade route in Salt Lake City, sipping beer and munching on pies in a nod to the roots of the faux holiday that began 10 to 15 years ago.\nOthers are going to bars and pubs for one of a growing number of events seizing on the popularity.\n\"It's saying: 'We're going to take your holiday and celebrate it our way,'\" said Daniel Baker, a 25-year-old former Mormon who went to the Epic Brewery for beer and pie Friday. \"If you get the day off, why not have a holiday to celebrate?\"\nMany businesses and government offices close for the state holiday, which celebrates the date in 1847 when Mormon pioneers ended their treacherous journey from Illinois and discovered the Salt Lake Valley.\nPioneer Day is so big, locals often refer to it as \"the holiday.\"\nIn downtown Salt Lake City, hundreds of Mormon families sat along a parade route underneath canopies, drinking juice and soda and cheering as horse-drawn carriages and floats commemorated the pioneers' journey.\nThe alcohol-infused alternative celebration was created by people who aren't part of the state's predominant religion and were looking for something else to do with their day off, said Mike Riedel, author of the Utah Beer Blog.\nHe said Pie and Beer Day pokes fun at the Mormon celebration, but is done in a good-natured way that doesn't create tension with The Church of Jesus Christ of Latter-day Saints. The faith's members account for an estimated two-thirds of the state's 2.9 million residents.\nSpokesman Eric Hawkins said the church chooses not to comment on the faux holiday. But few Mormons seem to mind, instead focusing on their own celebrations honouring the sacrifices of those who made the dangerous trek in search of religious freedom.\n\"To each person his own,\" said Chris Chandler, 42, a Mormon father of seven from Cedar Hills. \"As long as it doesn't infringe on my rights and how I want to live my life, do whatever you want.\"\nPie and Beer Day's origin is hazy, but it seems to have started at least a decade ago, Riedel said. It stayed mostly under the radar, celebrated in backyards, until an explosion in the past couple of years fueled by social media, he said.\nNow, the festivities include events hosted by bars and increasingly sophisticated pie and beer pairings.\nFor example, the Beer Bar in Salt Lake City, owned by actor Ty Burrell of ABC's Modern Family, is hosting a fundraiser with local radio station KRCL that features beers from local breweries paired with pies from local bakeries. Pairings include a Utah apricot with almond cream pie with an apricot IPA beer, and a habanero citrus flan with a farmhouse ale beer.\nLeslie Sutter, owner of the Shooting Star Saloon bar in the mountain town of Huntsville, was among the first people to celebrate Pie and Beer Day when she lived in a house off the Salt Lake City parade route 15 years ago.\nShe and her neighbours became agitated by the traffic and early arriving revelers who woke them. When they heard about the counter holiday, it was a perfect fit.\n\"I couldn't leave my house, so we would sit there, drink beer and say hi to all the parade-goers,\" Sutter said.\nThat's what Karen and James Concannon did Friday with a few friends at their house along the parade route.\nThe Maryland couple moved to Utah two years ago and like most outsiders, were taken aback by Pioneer Day's popularity. They decided to join the excitement rather than fight it.\n\"If you don't get out and have fun with people, you're going to be sitting inside and shaking your fist at strangers,\" said Karen Concannon, who now loves the parade.\n\"Only in Salt Lake City can you have something like this,\" she said. \"In any other place, it would just turn into drunken debauchery.\"\n ", "external_links": [], "published": "2015-07-24T21:55:00.000+03:00", "crawled": "2015-07-25T05:59:44.090+03:00", "highlightTitle": ""}