{"organizations": [], "uuid": "5983fd7135dca582bfc0c7dc0cb82bb88e76df38", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03381/sunnyu-marmaris-AP_3381759k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-20.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/travelnews/11751256/Eight-year-euro-high-boosts-Britons-holiday-spending-power.html", "country": "US", "title": "Eight-year euro high boosts Britons' holiday spending power", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Eight-year euro high boosts Britons' holiday spending power - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T00:47:00.000+03:00", "replies_count": 1, "uuid": "b49bf053a778a9057d567474adbf95e2d6b36f9c"}, "author": "Aliza Dee", "url": "http://www.telegraph.co.uk/travel/travelnews/11751256/Eight-year-euro-high-boosts-Britons-holiday-spending-power.html#post-0", "ord_in_thread": 0, "title": "Eight-year euro high boosts Britons' holiday spending power", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "British holidaymakers are reaping the benefits of a strong sterling this summer as the pound reaches an eight-year high against the euro, but new data has shown that holiday savings are not limited to the Eurozone. Research conducted by the Post Office for its annual Family Holiday Report shows that the cost of holidaying in beach resorts in places such as Turkey or Bulgaria , where prices are down on last year, is less than their Eurozone counterparts, even considering the strong pound. • Sterling surge: 10 destinations to have a cheaper holiday Last week, the pound hit an eight-year high against the euro , in part thanks to signs that the Bank of England could raise interest rates sooner than expected. Against the Turkish lira, the value of sterling is up 20 per cent on 2014, resulting in an extra £83 for every £500 changed at the Post Office. • The world's cheapest countries to visit Sunny Beach, Bulgaria Photo: Fotolia/AP According to the latest research, in the Eurozone prices fell most substantially in resorts such as Majorca (15.7 per cent), Sliema (16.3 per cent) and Paphos (25.7 per cent). It also showed that children prove the largest bank-breaker with three quarters of parents admitting to their purses feeling the pinch of little fingers. For parents likely to give in to an angelic face, holidaying in Turkey or Bulgaria proves cheaper for poolside purchases. With prices in Marmaris, Turkey, down by 5.6 per cent on last year, the resort was found to be the cheapest option included in the research. • Holidaying on the Black Sea, beyond the all-inclusive eyesores Sunny Beach in Bulgaria was the second cheapest destination when it came to in-resort costs, even though prices had only decreased 0.4 per cent from last summer. A like-for-like package in Corfu was revealed to cost 32.9 per cent more. Refreshments, based on buying two Coca-Colas and two ice creams a day for a week, will set you back just £24.64 in Sunny Beach, whereas it would quickly add up to an extravagant £60 in the south of France. Sorrento in southern Italy Photo: Fotolia/AP Tasty treats are scandalously cheap in Sunny Beach, where a bottle of Coca-Cola costs a meagre 78p. A family meal out in Bulgaria is also less than £29, whereas in Sorrento, Italy, it is a staggering £73.53. Those looking to laze on a beach should head to the Costa del Sol over Sorrento with sun-lounger rentals for a family of four at just £7.36 as opposed to £35. Meanwhile activity-loving families will find outings cheaper in Turkey or Italy, at around £35 for a family ticket to a water park, than the south of France at over £70. • Turkey: a summer holiday guide The cost of holidaying in Eurozone countries is down from 2015; on average by 7 per cent in Greece, 16.3 per cent in Malta, and 25.7 per cent in Cyprus. It appears that concerns over Grexit and economic instability within the Eurozone have had little effect on the pricing of popular holiday purchases. The tendency for higher prices in the Eurozone means that even the current weakness of the euro has not brought budget bargains to luxury resorts. Penny watchers should steer well away from destinations like Nice with a family ticket to a water park costing £18.38 and a sun-lounger £8.82. Follow @telegraphtravel", "external_links": [], "published": "2015-07-21T00:47:00.000+03:00", "crawled": "2015-07-21T09:09:20.020+03:00", "highlightTitle": ""}