{"organizations": [], "uuid": "15d72c0c76e970631d438fe2447690f489af348d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03363/Hotel-Saratoga_3363206k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-14.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/hotels/11715537/Top-10-the-best-Havana-hotels.html", "country": "US", "title": "Top 10: the best Havana hotels", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Top 10: the best Havana hotels - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T02:04:00.000+03:00", "replies_count": 0, "uuid": "15d72c0c76e970631d438fe2447690f489af348d"}, "author": "Clare Boobyer", "url": "http://www.telegraph.co.uk/travel/hotels/11715537/Top-10-the-best-Havana-hotels.html", "ord_in_thread": 0, "title": "Top 10: the best Havana hotels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spanish poet Federico García Quote: : “If ever I get lost… look for me in Cuba.” This beautiful island, one of the largest in the Caribbean, has long attracted bohemian types drawn to its grand architecture and seductive beaches. Havana, Cuba's capital, remains hypnotic and its hotel accommodation is a myriad delight of converted baroque palaces, modern high-rises, seaside crash pads and historic piles. Tourism to the country is steadily on the increase and looks set to rise with Barack Obama's announcement earlier this year of an easing of relations between the USA and Cuba. For now the country remains largely unchanged and still offers an escape from the Western world. But international hotel chains are circling: the Kempinski group plans to open Hotel Manzana de Gómez on Parque Central in 2016. Go now to explore this largely unspoilt corner of the Caribbean. Hotel Terral, Havana Named after the evening ocean breeze, Terral, this modern hotel has a prime spot on the Malecón seaside highway. The 14 rooms, all with a maritime theme and daubed in silver and blues, have ocean views. The waterfront dining room serves up one of Havana’s best unlimited breakfast buffets (CUC$10 (£6). Or enjoy breakfast in bed at no extra cost. Double rooms from CUC$135 (£87). For more information, see: 00 53 7860 2100; habaguanex.cu Hotel Saratoga, Havana The Saratoga, the city's most sumptuous bolt-hole, sits on the fringes of Old Havana. The rooftop pool is the perfect spot for views of the Capitol building, baroque Grand Theatre, and the Atlantic ocean. Rooms are plush with velvet furnishings, mosaic-tiled bathrooms, and framed contemporary art. Double rooms from CUC$246 (£158). For more information, see: 00 53 7868 1000; hotel-saratoga.com Hotel Riviera, Havana Meyer Lansky’s swanky shimmering pleasure palace, built in 1957, has fabulous views of the Atlantic Ocean. Although the lobby has been altered, the Fifties carnivalesque murals, feathery lights, and bronze candelabras in the L’aiglon restaurant are still there for the wonderment of diners, as is the coffin-shaped pool and original Fifties diving board. You’ll want one of the remodelled rooms in royal blue and silver with imitation Fifites furniture, restored original lamps, and rainshower bathrooms in replica Fifties pastel yellow and pink tiles. The original cabaret, the Copa Room, now features the slick dance show, Havana Queens. Doubles rooms from CUC$90 (£58). For more information, see: 00 53 7836 4051; gran-caribe.cu Hotel Raquel, Havana An art nouveau jewel in the heart of Old Havana with a fanciful baroque facade and lobby studded with a forest of pale pink Corinthian columns. The Raquel is known as the Jewish hotel and Jewish symbols are incorporated into the restaurant mampara doors by the artist Rosa María de la Terga. Don't miss the tangerine and white curved skylight by the same artist. Double rooms from CUC$150 (£96). For more information, see: 00 53 7860 8280; habaguanex.ohc.cu Hotel Iberostar Parque Central, Havana Straddling two blocks, this grand hotel sits in the heart of the city facing Parque Central and the Prado promenade. Its two alfresco rooftop pools and poolside cocktail service are big attractions; the pool on top of the main building is more thoughtfully designed than the newer Torre wing. Opt for the Torre tower for sylish rooms in smart dark-wood rooms with natty, striped fabrics. The lobby bar under a huge atrium is a great people-watching spot. Double rooms from CUC$280 (£180). For more information, see: 00 53 7860 6627; iberostar.com Hotel Nacional, Havana The Hotel Nacional, dating from the Thirties and the Grande Dame of the city's hotels, has a commanding position on a bluff overlooking the ocean. The hotel has played host to world presidents and international glitterati. Rooms have been remodelled in golds and maroons and the hallowed halls endow a sense of grandeur. Opt for an executive room for an upgraded breakfast. After wandering through the dazzling Moorish-tiled lobby, settle down for an aged rum on the alfresco terrace while listening to the Cuban melodies of a live band. Double rooms from CUC$180 (£116). For more information, see: 00 53 7836 3564; hotelnacionaldecuba.com Hotel Tejadillo, Havana A small historic mansion with illuminating mediopuntos (coloured half-moon windows), the Tejadillo boasts one of the best hotel locations in the city for sightseers. Its bar, with tables and chairs spilling out on to the cobblestones, faces one side of the Cuban Baroque cathedral, and it’s a short amble to the handsome cathedral square, a modern art gallery, and Hemingway’s drinking haunt, La Bodeguita del Medio. The best rooms have balconies facing a overlooking a quiet street. Double rooms from CUC$135 (£87). For more information, see: 00 53 7863 7283; habaguanex.ohc.cu Hotel Capri, Havana The Capri, built in 1956 with mafia money, was the third mob palace erected before Fidel Castro toppled Fulgencio Batista in 1959. To tap into the Fifties vibe, you’ll want one of the junior suites with its imitation Fifties furniture, charcoal grey suede sofas, and Fifties monochrome photographs. The rooftop pool has been remodelled - dubbed the ‘Cabaña in the Sky’ in its heyday - but sundowners with those spell-binding views of the artsy Vedado neighbourhood’s villas and skyscrapers are still de rigeur. Double rooms from CUC$150 (£96). For more information, see: 0053 7839 7200; nh-hotels.com Hotel Conde de Villanueva, Havana The lofty Hotel Conde de Villanueva is a rambling old mansion studded with stunning mediopuntos on one of Old Havana’s beautifully manicured streets. The 1864 pile with peacocks in its leafy patio is a renowned haven for smokers; the enormous master suite even features its own humidor. The real treat is on the mezzanine: climb the wooden stairs to the cigar bunker where a sommelier and cigar roller with a combined 50 years’ experience will help you navigate your way through Cuba’s world-class smokes. Doubles rooms from CUC$135 (£87). For more information, see: 00 53 7862 9293; habaguanex.ohc.cu Meliá Cohiba, Havana Behind the ugly mid-Nineties exterior is a trusted modern hotel - with its marble lobby decked in extraordinary floral artistry - and with some of the city’s top rooms and services to match. Opt for a junior suite (rooms ending with 21) where the warm interiors are complemented by silver and mustard threads. The panoramic views of the cityscape, sea and Malecón are best enjoyed from a whirlpool tub. A private elevator takes guests down to one of Havana’s loveliest pools, lined with Balinese sunbeds. Double rooms from CUC$300 (£193). For more information, see: 00 53 7833 3636; meliacuba.com Follow @telegraphtravel", "external_links": [], "published": "2015-07-15T02:04:00.000+03:00", "crawled": "2015-07-14T21:39:10.000+03:00", "highlightTitle": ""}