{"organizations": [], "uuid": "972a4bef4860c6f17ec7868a2c6afe96d411257b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27680-stephen-usher-returns-to-industry", "country": "US", "title": "Stephen Usher returns to industry", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Stephen Usher returns to industry", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T13:45:00.000+03:00", "replies_count": 0, "uuid": "972a4bef4860c6f17ec7868a2c6afe96d411257b"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27680-stephen-usher-returns-to-industry", "ord_in_thread": 0, "title": "Stephen Usher returns to industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stephen Usher returns to industry Stephen Usher returns to industry Details Category: Appointments   11:45 Meeting & Events agency Conference Care has appointed Stephen Usher in the newly created position of Head of Finance. He will be based at the company’s Coventry head office, and will have overall responsibility for the whole financial operation. His previous roles include working for Aubrey Allen, Trinity Event Solutions, and his own agency House of Usher. Usher was also Chair of the HBAA in 2010 and has held senior Board positions with the industry association, including several years as Treasurer. \nUsher said “I have always respected Chris and Andrew and I am now delighted to join the award winning team at Conference Care. With almost twenty years’ experience in event agencies I am looking forward to working with the team and giving a fresh approach to the finance department. Conference Care has an impressive portfolio of clients, an amazing knowledgeable team, and has developed cutting edge technology, I can’t wait to start working with them and develop effective accounting solutions.” Chris Peacock, Director commented “Stephen brings with him a wealth of relevant experience and an in-depth understanding of today’s market. As a growing company, the time is right for us to add a senior management position in finance, which will improve our overall offering and allow the Directors more scope to strategically develop Conference Care, our products and our services. Stephen is a respected and trusted figure in the events industry, and will prove to be a huge asset.” Related articles", "external_links": [], "published": "2015-07-13T13:45:00.000+03:00", "crawled": "2015-07-13T16:02:08.000+03:00", "highlightTitle": ""}