{"organizations": [], "uuid": "9ead4c74d36ddf0f668e9774ef71603926114263", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03277/google_3277450k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-30.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/technology/google/11036257/Telegraph-stories-affected-by-EU-right-to-be-forgotten.html", "country": "US", "title": "Telegraph stories affected by EU 'right to be forgotten'", "performance_score": 10, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Telegraph stories affected by EU 'right to be forgotten' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T21:41:00.000+03:00", "replies_count": 0, "uuid": "9ead4c74d36ddf0f668e9774ef71603926114263"}, "author": "Rhiannon Williams", "url": "http://www.telegraph.co.uk/technology/google/11036257/Telegraph-stories-affected-by-EU-right-to-be-forgotten.html", "ord_in_thread": 0, "title": "Telegraph stories affected by EU 'right to be forgotten'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The European Court of Justice ruled in May 2014 that Google must remove links to any content that is \"inadequate, irrelevant or no longer relevant” or face a fine. The content itself is not deleted, but Google will not list it in search results. A leading solicitor warns that this could “stifle free speech”. Users searching for the related topic on google.co.uk will see a message that says: “Some results may have been removed under data protection law in Europe” at the bottom of the page. However, those visiting the American site google.com will be unaffected, even if they reside in the UK. Over 250,000 requests have been made in total to the search engine asking for links to information be removed from Google's European site branches. While Google does not disclose the identity of the complainant, applications must supply identity verification to prove the links relate either to themselves, or that they have the legal authority to act on the claimant’s behalf. In July last year the House of Lords's EU Committee published a report claiming that the EU's Right to be Forgotten is “unworkable and wrong”, and that it is based on out-dated principles. “We do not believe that individuals should have a right to have links to accurate and lawfully available information about them removed, simply because they do not like what is said,” it said. But David Smith, deputy commissioner and director of data protection for the Information Commissioner's Office (ICO), hit back and claimed that the criticism was misplaced , \"as the initial stages of its implementation have already shown\". Full list: Telegraph content removed from Google search results • A story about a British former convent girl who was jailed in France for running a ring of 600 call girls throughout Europe in 2003. Police were tipped-off about Margaret MacDonald’s operation by a former colleague following an argument. A second article, entitled The vice queen of Windsor , detailing MacDonald's arrest and the allegations made against her, has also had its link removed. • An article from 2008 about a former Harrow pupil, Alex Fiallos, who returned to his halls of residence after a night out drinking and drove his £4,000 car around the grounds at speeds of 30mph before crashing . He eventually collided with a set of steps in a scene reminiscent of the 1969 cult classic movie starring Michael Caine. His parents had given him the silver Mini just the day before. • A story which includes a section taken from the rambling \"war plan\" of Anders Behring Breivik to massacre 100 people . • A story from 2009 on our property page documenting how Paul and Fiona Godwin-Brown and their two boys Tom and Charlie gave up pressured London life and moved into a rolling Devon valley. Google started adhering to the judgment in May 2014 • A news story from 2003 on former president of the Law Society, Robert Sayer, being accused of inventing a phantom identity in order to have his former deputy expelled from the profession . • Two stories from 2010 relating to football referee Dougie McDonald coming under scrutiny for a penalty decision in a Celtic v Dundee United match, and subsequently resigning . Both links were subsequently reinstated by Google. • Four images - which are actually two unique images, each hosted twice as separate copies on the Telegraph website - relating to Max Mosley's 2008 sex scandal. ( First image , second image ) • Two 2001 stories reporting that three men had appeared in court after being arrested when explosives were found in a Dublin apartment. The three men had been seen looking at something in a car, then refused to stop when police later attempted to pull them over. Inside the car were balaclavas and plastic boxes with switches attached to them, which “could be used as incendiary devices”. Follow-up searches of a number of homes found explosives and similar equipment to that found in the car. • The link to an article from 2001 about a newspaper sales director who “terrorised” a shopkeeper and his wife in an incident before a football game was removed after Google received a request under the EU’s “right to be forgotten”. Patrick McVeigh, who was 30 at the time and earning more than £40,000 a year at Yorkshire Post newspapers, was heading for a football game at Leeds United with his brother Terence and a group of friends when he stopped to steal beer from a newsagent. His brother was also seen removing a security camera. • An article from 2000 detailing the jailing of a butcher who threatened to send his estranged wife's wealthy parents videos of her participating in group sex, which he filmed. Julian St Quinton was sentenced to two and a half years imprisonment for blackmail and nine months for indecent assault. • A 17 year-old being issued with a three-year Asbo for being held responsible for almost 40 per cent of the crime in a single town. Kyle Ivison, aged 17 at the time, was held responsible for a crimewave of more than 120 offences in the town of Clitheroe, Lancs. • Dr Edward Erin was jailed for six years in 2009 for attempting to spike his pregnant mistress' drinks with drugs to cause her to miscarry their son. The link concerned was an article detailing an email Erin sent to a colleague following his arrest in February 2008 . • An article concerning a vicar who resigned after villagers accused him of standing naked at a vicarage window , swearing at children and staggering around drunkenly. • A pensioner's body lay undiscovered in her home in Norwich for up to six months before it was discovered by police in August 2011. Norfolk Coroner William Armstrong described the case as \"deeply disturbing\". EU 'right to be forgotten': one year on Do negative reviews have a right to be forgotten by Google? EU wants 'right to be forgotten' ruling to extend worldwide • Tim Blackstone, a former porn star and brother of Baroness Blackstone, was found guilty of two counts of insider trading in 2003 . • An army captain who accused her commanding officer of labelling her a \"blonde bimbo\" had her claim dismissed by an employment tribunal in 2002. • Mark Wilson, a Scottish man, was jailed for life in 2002 for strangling his wife with a tartan tie and hiding her body under their bed for a week. • Two 2002 articles relating to the same story on how a Rolls-Royce driver ' pulled a gun on Mayfair cabbie ' in 2002 and was subsequently jailed for four months. • A woman claimed gynaecologist Darwish Hasan Darwish raped her after putting her in a 'deep hypnotic state', causing her to become pregnant with his daughter. Darwish, who was already serving a six-year sentence for indecently assaulting 10 other patients, was acquitted of rape during a court case in 2001 . • Three young men ' from respectable families ' were cleared of plotting to rape a Cambridge University graduate in 2001. Links to an earlier article in which one of the accused, Andrew Udenze, said the student ' agreed to have sex ' minutes after getting into a car with him and four other strangers have also been taken down. • A British grandmother left her husband after 38 years to marry a 22-year-old Moroccan she met on the internet , who was refused a visa by the Home Office three times • A former advertising executive with Saatchi & Saatchi who left his family for a younger colleague was jailed for six months in 2000 . After the younger woman left him, he was arrested and charged with harassment over bombarding her with phone calls, e-mails and letters. • A hotel manager hid £58,000 in stolen cash taken from her employers and recently married couples in bags and boxes under her bed, Newcastle Crown Court heard in 2002. She was jailed for nine months. • A pilot was killed during a fundraising flight for his village church in Dorset during 2009. • Google has also taken down a link to an online dating profile for user Thom109 on Telegraph Dating. • A homosexual vicar fled his parish after a campaign of blackmail and intimidation in 2000. • An \"eccentric\" sixth-former with a fascination for chemistry sparked a full-scale alert in 2005 after police found a cache of bomb-making chemicals in his bedroom. • Mother of two Teresa McKenzie was found unanimously not guilty of seven charges made against her by a 16 year-old male pupil, who alleged the pair had a 10-month relationship. • A \"dapper\" diamond thief killed his wife before hanging himself at their home in one of London's most affluent postcodes in 2013. • A divorced businessman won a legal battle against his former wife in 2002, entitling him to an equal share of their £2.5 million fortune . • Back-office bank worker Adam Lancelot was prosecuted for fraudulently receiving benefits while being paid £300 a day in the City during 2012. • British backpacker Alfred Alexandros Mill Saunders, 20, was arrested on suspicion of murdering a woman in a frenzied, drug-fuelled knife attack in Central America in 2012. • A former headmaster spat in a school governor's face a decade after a row over scrapping \"elitist A levels\" in 2008. • A 2002 article detailing how Britain's Jewish community staged a 30,000 person-strong demonstration in Trafalgar Square to show support for Israel. • \"Absolute English gent\" Hugh Taylor undertook a legal fight against Theresa Hamer over the return of some paving stones from a property Mr Taylor bought from Mrs Hamer for £3.5 million in 2002. Mrs Hamer removed the paving from a 282 square yard piazza on the property when she moved out, prompting Mr Taylor to appeal for the return of the \"irreplaceable\" stones. • A 2004 article about the disappearance of 16 year-old Charlotte Pinkney from Ilfracombe, Devon. The teenager's body was never found, and scaffolder Nick Rose was found guilty of her murder and jailed for life the following year. • A company director killed himself while on Skype to his partner in 2011. Adrian Rowland was on a business assignment in India when he cut his own throat on camera while talking with his distraught partner in the UK. • An article detailing how an RAF pilot was accused of sexually assaulting a female junior officer after creeping into her bedroom following a champagne party, a court martial heard in 2005. The link to a second article following his unanimous acquittal a week later has also been removed. • A 2006 article detailing how an illegal immigrant was allowed by the Court of Appeal to stay in Britain because deporting her would breach her right to a family life with another woman . • A 2003 article about people under 30 suffering strokes . • Secretary Laura Cook kicked a fellow train passenger in the face with her stiletto following an argument. Ian Garven was attacked by Ms Cook and her boyfriend Nicholas Rogers after he asked Rogers to take his feet off the train seat. The pair were ordered to complete 80 hours' unpaid work, pay £200 compensation and £250 prosecution costs in 2008. • Celebrities were apparently reluctant to be seen with party organiser Nicholas Meikle , who was implicated in the alleged gang rape of a young woman by a group of men including Premiership footballers in 2003. Meikle was later cleared of any criminal wrongdoing. • The boyfriend of Art Malik's daughter was found dead in a swimming pool at the actor's home in 2002. • Mark Bruton-Young, 36, an architect, allegedly murdered his daughter , Harriet, after he resented the intrusion of the “unplanned” baby into his married life, Bristol Crown Court heard in 2011. He was later cleared. • A Brazilian woman who claimed she lost her unborn twins in a knife attack by neo-Nazis was not pregnant and probably carved the initials of Switzerland's main right-wing party into her own skin, Swiss investigators said in 2009. • A Spanish court ordered an investigation into allegations that Saudi billionaire prince Alwaleed bin Talal raped a model on a yacht in Ibiza in 2008 be temporarily halted in 2012. • A head teacher of a sixth form college in Somerset wrote to students in 2010 asking them to support a member of staff who was preparing for a sex change. • Selina Hakki was convicted of using rohypnol to drug wealthy-appearing men in order to rob them in 2004. She was sentenced to five years. • An Oxford graduate who was among seven British tourists killed in a Nepal plane crash had been taking a final break before starting as an associate at a top City law firm in 2012. • A sinister message was left on the mobile phone of a wealthy company director days after he was found shot dead in an orchard , an inquest heard in 2008. • A businesswoman sacked after a night entertaining clients ended in spectacular embarrassment had her hopes of a compensation payout boosted by a tribunal ruling in 2012. • A policeman's daughter who willingly took part in sex and bondage with a former boyfriend made a false rape claim against him the next morning, a court heard in 2009. Links to a secondary article detailing the woman's jailing for two years have also been taken down. • The principal guest conductor for the English Chamber Orchestra Roy Goodman pled guilty to being in charge of a yacht while under the influence in 2004. Harbour officials saw him staggering on the deck of his new seven-metre yacht, RoyAnna, and urinating into the sea after it had run aground in one of Europe's busiest shipping lanes. • Nadia Almada's entry in a Telegraph article of Big Brother's most annoying housemates in 2011, in which she was described as \" an annoying, unbearable nag \". • A law student was convicted of killing and burying in concrete his controlling father who wanted him to study at the Sorbonne in Paris instead of living with his girlfriend in London in 2010. • The younger sister of a schoolgirl who was raped and murdered by a serial sex offender leapt to her death from a multi-storey car park four days before her 16th birthday in 2009. • A death announcement . • A 2003 article detailing how the Roman Catholic Church reached a £15,000 out-of-court settlement with a former boy scout who claimed he was abused by Fr John Tolkien, the son of J R R Tolkien, the Lord of The Rings author. • A 2012 article about 27-year-old Ben Ogden, who was killed in a plane crash in Nepal with six fellow British travellers. • A computer hacker shut down America's biggest port when he took revenge on an internet chatroom user who had insulted his girlfriend, a court was told in 2003. A briefer version of the article has also been requested for removal. • A woman planning a new life in Spain was knifed to death by an ex-lover who she had told police was stalking her, a court heard in 2010 . • A 2003 column by Jenny McCartney speculating whether men, including actor Hugh Grant, said they wanted children purely to bed women . • A senior manager at a leading London law firm who wanted to work part-time, including half a day a week from home, after having a baby won her claim for unfair dismissal in 2005. • City trader Asif Turabali Mohamedali, who confided in his boss that he felt suicidal, was told: “Tough luck, dude - pull yourself together,” an employment tribunal heard in 2012. • A senior Goldman Sachs banker went on holiday with his wife and five children to Bermuda and hoped to arrange for his mistress and her children to stay at a nearby hotel on the island at the same time, a court was told in 2004 . • An article detailing how a British man was jailed for 25 years in Costa Rica for stabbing to death a Czech student at a remote jungle eco-farm in 2013. Google also removed links to three images related to the story, found here , here and here . Numerous links to other articles, including the shock of the man's family , and how he was initially held in custody , have also been removed. • A policeman who was a former British international runner announced his intention to sue ;Lancashire police for racial discrimination after the force spent three years and an estimated £450,000 investigating allegations that he overcharged his expenses by £90 in 2006. • A detective who sparked an armed seige inside a police station after allegedly threatening to kill a colleague appeared in court in 2010. • A 2004 article by Jenny McCartney about Frank Oz's remake of The Stepford Wives . • A 2009 slideshow entitled Root Ginger: a study of red hair by photographer Jenny Wicks . • A Muslim teenager made up a rape story to cover her shame after losing her virginity to a married doctor, a court was told in 2003. • A solicitor breached insider trading laws when he tipped off his father-in-law that his company was about to about be taken over by Motorola so the pair could make a £50,000 profit from buying and selling shares, a court was told in 2009. The link to a related article of nine examples of the FSA's convictions for insider trading, including this case , has also been removed. • A 2011 liveblog of a Cricket World Cup match between India and England, manned by Rod Gilmour and Jonathan Liew. • An article recounting the story of a Kosovo-born Muslim and her fight against deportation from Holland, written in 2006. • An 2014 interview with a British mother of twins, whose estranged husband was awarded full custody of the children by an Austrian family court, despite social workers' recommendations she be granted sole custody due to his violent and unpredictable behaviour. • A maid who claimed she had been beaten and kept as a slave by her employers faced prosecution after an employment tribunal ruled she invented the abuse in 2010. • A glamour model and reality TV star who told police her Blackberry had been stolen after she left it at the gym was spared jail in 2010. • An 2005 article and related image regarding how a murdered heiress had called off her wedding a fortnight previously. • Two primary school teachers were cautioned for branding an eight-year-old pupil a \"chav\" on Facebook in 2008. • A leading researcher into heart disease escaped jail in 2004 after a court heard that he slapped his fiancée and broke a hotel deputy manager's arm in a drunken rage on the eve of his wedding. • A banker was one of the chief organisers of the drinking ban protest on the London Underground which descended into violence in 2008. • A director was jailed for eight years in 2006 for stealing more than £34m from Izodia, a one time dotcom boom company that became a cash shell. • A feature exploring the anatomy of a £34m theft from 2007 , surrounding the arrest of Dr Gerald Smith. • A leading psychologist tried to kiss a male colleague at a dinner and then tried to stroke another man's thigh in front of his bemused wife, a hearing was told in 2010. • An article from 2004 about overly pushy parents accompanying their children to university . • A yachtsman who was overpowered and tied up by two friends during a storm in the Bay of Biscay had \"lost it\" after several days without eating or sleeping properly, Spanish police said in 2004. The link to a related brief news story explaining how no further action was to be taken against the trio has also been removed . • An article relating to the fallout between former Environment Secretary Caroline Spelman and her teenage son's desire to become a body-builder from 2012. • A policeman whose assault on a man was filmed by CCTV cameras was jailed for 21 months in May 2003 . • Two articles from August 2014 and November 2014 about how a laywer-turned-sailor claimed sexual discrimination and harassment against organisers of gruelling race but had her case thrown out. • A former care assistant in an old people's home was jailed in 2004 for helping her lover to rob elderly women. @telegraph", "external_links": [], "published": "2015-07-30T21:41:00.000+03:00", "crawled": "2015-07-30T22:42:46.257+03:00", "highlightTitle": ""}