{"organizations": ["Navy"], "uuid": "ceba7d393796ecb0ef51ded25672ab5de657d294", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2014/08/21/cc/0a/WHIO_Facebook_Icon.png", "site_section": "http://www.whio.com/feeds/categories/travel/", "section_title": "News | Travel", "url": "http://www.whio.com/feed/travel/navy-seals-museum-in-fort-pierce-tribute-for/fCFH2t/", "country": "US", "title": "Navy SEALs Museum in Fort Pierce: Tribute for Secret Soldiers", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "Navy SEALs Museum in Fort Pierce: Tribute for Secret Soldiers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T11:56:00.000+03:00", "replies_count": 0, "uuid": "ceba7d393796ecb0ef51ded25672ab5de657d294"}, "author": "", "url": "http://www.whio.com/feed/travel/navy-seals-museum-in-fort-pierce-tribute-for/fCFH2t/", "ord_in_thread": 0, "title": "Navy SEALs Museum in Fort Pierce: Tribute for Secret Soldiers", "locations": ["Fort Pierce"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated: 11:30 a.m. Thursday, July 16, 2015 | Posted: 4:56 a.m. Thursday, July 16, 2015 Navy SEALs Museum in Fort Pierce: Tribute for Secret Soldiers In Partnership with VisitFlorida.com \nInside the National Navy UDT-SEAL Museum in Fort Pierce is an unassuming, glass-topped display case, containing just a small sampling from the hundreds of letters received here since Special Operation Forces killed Osama bin Laden during Operation Neptune Spear.\"I am truly thankful to live in a country that is home to the most remarkable team of liberty defenders the globe has ever seen,\" one letter reads. Says another, simpler and repetitive, but no less eloquent: \"Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. A grateful citizen.\" The SEALs, one of the nation's most secretive military units, are uncharacteristically high-profile these days, thanks to some very public events -- and to Hollywood SEALS rescued Capt. Richard Phillips of the cargo ship Maersk Alabama from Somali pirates in 2009. The Tom Hanks movie based on those events, Captain Phillips , played to great reviews in theaters. \nSEALS also took out terrorist No. 1 Bin Laden in May of 2011. A year later, the award-winning Zero Dark Thirty chronicled the hunt for the al-Qaeda leader and his death at the hands of SEALS. \nSo, the letters pour in. The number of visitors, from the United States and around the globe, has mushroomed. Donations are up.\"It's been like tourist season all summer,\" said Andy Brady, the museum's community outreach specialist. \"Attendance has doubled.\" Naval Combat Demolition Units (NCDU) and Underwater Demolition Teams (UDT) – the forerunners to the SEALs – began training in Fort Pierce in 1943, in anticipation of the Normandy Invasion. Roughly 3,000 men trained on the beaches here, honed into tip-top physical condition and armed with intelligence-gathering and demolition skills. Then, as now, those who hope to join the SEALs have to endure some of the most rigorous training ever devised. Of all those recruited, only a few make it. C.H. \"Chuck\" Thiess, now a docent at the museum, trained men in the early 1950s – in physical fitness, swimming, diving and the newfangled underwater breathing gear.\"Since 1945, some 48,000 men have been in training. But only 8,000 made it,\" Thiess said. \"And it's even harder today. They're the most elite outfit in the world.\" When the Fort Pierce facility closed in 1946, the Navy moved training for its newly modern warriors – who've been known variously as Naval Combat Demolition Units and Underwater Demolition Teams – to Virginia and, later, to California. SEALs forebears saw service again in the Korean War, adding inland raids against railroads, bridges and tunnels to their repertoire. In 1962, they got their current designation – SEALs, which stands for Sea, Air and Land teams. It was during the Vietnam years that they peaked into the ultimate commandos, the first units in for the most dangerous assignments, conducting guerrilla warfare, carrying out lightning raids and gathering intelligence. In the 1980s, a group of Navy veterans began gathering artifacts from UDT and SEAL team members. In November 1985, they opened this 3,500-square-foot museum, staffed primarily by volunteer veterans and funded with private donations, admission fees and souvenir sales. Inside, the museum are videos, weapons, documents and other artifacts that chronicle the storied history of the elite units, from inception to present. A souvenir shop, with watches, knives, shirts, caps and other items, does brisk business. An 8,400-square-foot expansion was completed in 2011. Currently, it displays a patrol boat, a piece of steel from the World Trade Center and the artwork of Joshua Harris, a SEAL who died in Afghanistan in 2008. The addition houses items from 9/11 onward, including exhibits detailing the SEALs canine units, said Lisa Fulton, office manager. Outside, patrol boats, submarines so basic they'll induce shudders, displays of the beach barriers the UDTs had to dismantle, a helicopter and training space capsules offer up-close education. Here, too, housed in the addition, is the actual lifeboat from the Maersk Alabama . From the deck of a heaving military ship, SEALs marksmen needed but three shots at this orange vessel to kill – simultaneously – three Somali pirates holding an American hostage. The whole museum is testament to the history of an elite group, super secret, rarely and only recently in the public eye.\"We wish none of it had been public,\" Thiess said. \"It's much easier for them to do their work without the public involved.\" But events, if only for a time, have involved the grateful public. And Thiess recognizes the value in that.\"I think the public finally appreciates and understands what these men and their families go through and have given,\" he said. Tucked into a corner of the grounds stand black granite columns, bearing hundreds of inscriptions – the names of the SEALs and those who came before them who died in service. Seventeen names, those who died in the Afghanistan helicopter shoot-down, were recently inscribed, still fresh and raw. \nFor more information about Florida’s military history, visit vivaflorida.org/Explore/Victory-Florida", "external_links": [], "published": "2015-07-16T11:56:00.000+03:00", "crawled": "2015-07-16T22:43:58.000+03:00", "highlightTitle": ""}