{"organizations": [], "uuid": "d1e9c321fa552b2eea06d4789a178649e2065afb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.metrowestdailynews.com", "main_image": "http://www.metrowestdailynews.com/storyimage/WL/20150715/ENTERTAINMENTLIFE/150717776/AR/0/AR-150717776.jpg", "site_section": "http://www.metrowestdailynews.com/entertainment/travel?template=rss&mime=xml", "section_title": "Travel - MetroWest Daily News, Framingham, MA", "url": "http://www.metrowestdailynews.com/article/20150715/ENTERTAINMENTLIFE/150717776/12311/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "TRAVEL: Nantucket offers a whale of a time", "performance_score": 0, "site": "metrowestdailynews.com", "participants_count": 1, "title_full": "TRAVEL: Nantucket offers a whale of a time", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T00:50:00.000+03:00", "replies_count": 0, "uuid": "d1e9c321fa552b2eea06d4789a178649e2065afb"}, "author": "William J. Kole/The Associated Press", "url": "http://www.metrowestdailynews.com/article/20150715/ENTERTAINMENTLIFE/150717776/12311/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "TRAVEL: Nantucket offers a whale of a time", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TRAVEL: Nantucket offers a whale of a time Comment By William J. Kole/The Associated Press   William J. Kole/The Associated Press Posted Jul. 15, 2015 at 4:49 PM Updated at 4:50 PM By William J. Kole/The Associated Press Posted Jul. 15, 2015 at 4:49 PM Updated at 4:50 PM » Social News NANTUCKET — Forget crowded Cape Cod and that other island frequented every summer by the Tourist-in-Chief. If you're looking for unspoiled ocean vistas and beaches with breathing room, hop a ferry to Nantucket, wander the cobblestone streets and drink in the views and microbrews. Nantucket tends to get overlooked in the shadow of Martha's Vineyard, President Barack Obama's go-to destination for a couple of weeks most Augusts. Here, there are no road closures or impromptu swarms of Secret Service agents commandeering golf courses and restaurants — just a little more space and a lot more charm. Nantucket means \"faraway land\" in the language of its original Wampanoag natives, but it's just 30 miles offshore — an hour's journey via high-speed ferry from the Cape. WHAT'S NEW Not much, but that's part of its allure. You won't find as many cars, fast food outlets, honky-tonk nightclubs and vanilla chain hotels on tranquil Nantucket as you will on the Vineyard or the mainland. The Nantucket Garden Conservancy leads guided tours of the island's \"secret gardens\" — beautifully manicured lawns, flowers (especially the island's signature blue hydrangeas) and shrubs on private property that gardening buffs otherwise wouldn't have a chance to enjoy: check http://www.gardenconservancy.org for the latest dates. The Dreamland Theater, built in 1832 as a Quaker meetinghouse, completed a renovation in 2012. It screens films and stage plays and hosts the Nantucket Comedy Festival, which is July 15-18; Ben Stiller summered here as a kid and sits on the board of the Nantucket Film Festival held each June. CLASSIC ATTRACTIONS Whaling lifted Nantucket to economic superpower status two centuries ago, and no visit is complete without a stop at the downtown Nantucket Whaling Museum: http://www.nha.org/sites/ . Suspended from the vaulted ceiling is the skeleton of a 46-foot sperm whale that washed ashore in 1998. Storytellers will regale you with the tale of the Essex, the doomed whaling ship that sank in the Pacific in 1820 and inspired Herman Melville's \"Moby-Dick.\" The museum also boasts one of the world's largest collections of scrimshaw, the elaborate artwork carved on whale teeth. Full disclosure: Whaling was bloody business, and the depictions of how harpoons were used to cripple and kill these magnificent creatures are not for the faint of heart. On foot, you can wander the warren of streets within walking distance of the ferry landing; they're studded with art galleries, quirky shops, restaurants and inns. Even better, explore by moped or bicycle. You can bring your own bike on the ferry for a small fee, but there are several rental shops steps from the wharf, and it's cheap: $20 for two hours, including basket and helmet. For stunning Atlantic views, follow the Milestone Road bike path due east to picturesque Siasconset, the prettiest corner of the island. Page 2 of 2 - TIPS If you're planning a day trip, time is of the essence. Unless you're bringing a car, don't waste it on the slow ferries from Woods Hole or Hyannis, which take 2½ hours to make the crossing. Consider the high-speed passenger ferries, which are more expensive but take just an hour. Either way, during peak summer months, reservations are critical. The first ferry in is at 6:20 a.m.; the last out is at 8:45 p.m. Contact Hy-Line or Steamship Authority ( https://www.steamshipauthority.com/visitors/nantucket or https://www.hylinecruises.com/hy-line-nantucket-schedule-and-rates/ ) for detailed schedules and prices. Like any island, Nantucket can be pricey, so brace yourself for sticker shock. Stylish inns such as the historic Jared Coffin House will cater to all your creature comforts for upwards of $300 a night, but more affordable bed-and-breakfast alternatives abound. That's the advantage of a day trip: Hop an early morning ferry, rent bikes, pack a bottle of wine and a picnic lunch in your basket, and explore without worrying about your wallet. Pro tip: Cobblestones are murder on the feet, so wear comfortable shoes, not heels. And bring a windbreaker; even when it's sweltering on the mainland, the unrelenting sea breeze can make you wish you had one while dining outside at dusk. HANGING OUT Ice cream and beer make a hideous combination, but you won't want to leave the island without separately sampling the best of both. On Nantucket, that means lining up outside The Juice Bar on Broad Street — one of the first shops you'll encounter after disembarking the ferry. Don't let the name throw you: If the queue of salivating tourists and locals doesn't clue you in, the wafting aroma of homemade waffle cones will. They make their own ice cream here, including several vegan flavors. Thirsty? Take the free shuttle to Nantucket's Cisco Brewery and sample their latest beers. Cisco is best-known for its Whale's Tale Pale Ale, but you never know what kind of stunning seasonal brews you'll find on tap. Wine lovers can sip the latest vintages from the sister Nantucket Vineyards, or for something stronger, its Triple Eight Distillery. Five-star food trucks and raw bars offer freshly shucked oysters and local littleneck clams. By William J. Kole/The Associated Press   William J. Kole/The Associated Press Posted Jul. 15, 2015 at 4:49 PM Updated at 4:50 PM", "external_links": [], "published": "2015-07-16T00:50:00.000+03:00", "crawled": "2015-07-16T02:19:22.000+03:00", "highlightTitle": ""}