{"organizations": ["Willis Group Holdings"], "uuid": "fccb264f72b544080fc10b207387d53fd441a377", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_7_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13237759/1/willis-appoints-thomas-messer-as-regional-leader-of-aviation-in-latin-america.html?cm_ven=RSSFeed", "country": "US", "title": "Willis Appoints Thomas Messer As Regional Leader Of Aviation In Latin America", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Willis Appoints Thomas Messer As Regional Leader Of Aviation In Latin America", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T15:08:00.000+03:00", "replies_count": 0, "uuid": "fccb264f72b544080fc10b207387d53fd441a377"}, "author": "", "url": "http://www.thestreet.com/story/13237759/1/willis-appoints-thomas-messer-as-regional-leader-of-aviation-in-latin-america.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Willis Appoints Thomas Messer As Regional Leader Of Aviation In Latin America", "locations": ["Miami", "Latin America Willis", "Latin America", "LONDON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ed Fyfe", "Thomas", "John Rooley", "Thomas Messer", "Messer", "Willis"], "text": "Willis Appoints Thomas Messer As Regional Leader Of Aviation In Latin America By GlobeNewswire | 07/30/15 - 08:08 AM EDT Reprint LONDON, July 30, 2015 (GLOBE NEWSWIRE) -- Willis Group Holdings (NYSE:WSH), the global risk advisory, re/insurance broking and human capital and benefits firm, has today announced with immediate effect the appointment of Thomas Messer as Regional Leader of aviation in Latin America. Messer joined Willis in 2002 and has served in a variety of roles within the aerospace re/insurance market - most recently with a particular focus on clients in the Latin America region. In his new role, based in Miami, he will oversee insurance and risk management solutions for Willis clients in the region - including aerospace companies, airlines, airports and general aviation. Commenting on Messer's appointments, John Rooley, global CEO of Willis's aerospace business, said: \"Latin America is hugely exciting. All parts of it have seen a surge in economic growth over the past two decades and it is currently one of the top performing economic regions in the world. Our clients in Latin America are increasingly looking for more sophisticated risk management solutions. Thomas, with the support of Willis's local offices and our global risk and insurance capabilities, will focus on servicing our clients in the region - particularly large corporate accounts.\"Ed Fyfe, leader of Willis's large account practice in Latin America, commented: \"Companies who are confident in their risk management capabilities have the self-assurance to be more enterprising and seize the opportunities in a rapidly expanding market. While innovative risk transfer solutions can help improve resilience, new and emerging analytics can improve forecasting and risk assessments, helping companies make more informed decisions about how they treat risk. To capture the opportunities that this dynamic and exciting region has to offer, companies need to partner with experts who can help them manage today's risks and build resilience in their organisations to withstand tomorrow's unexpected shocks.\" 1 of 2", "external_links": [], "published": "2015-07-30T15:08:00.000+03:00", "crawled": "2015-07-30T15:26:44.703+03:00", "highlightTitle": ""}