{"organizations": [], "uuid": "f9c4fea02adb414f6349ff71c1342b513cae0f80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/news/spanish-museums-invite-blind-to-touch-masterpieces/ar-AAd5nj9", "country": "US", "title": "Spanish museums invite blind to touch masterpieces", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Spanish museums invite blind to touch masterpieces", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "f9c4fea02adb414f6349ff71c1342b513cae0f80"}, "author": "Daniel Silva", "url": "http://www.msn.com/en-us/travel/news/spanish-museums-invite-blind-to-touch-masterpieces/ar-AAd5nj9", "ord_in_thread": 0, "title": "Spanish museums invite blind to touch masterpieces", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spanish museums invite blind to touch masterpieces AFP 22 hrs ago Daniel Silva Staff at the Prado, Spain's top art museum, usually prevent visitors from touching its priceless treasures.\nBut on a recent morning, with their blessing, Jose Pedro Gonzalez, 56, slowly ran his fingers over a copy of one of 15th century master Diego de Velazquez's most famous paintings, \"Apollo in the Forge of Vulcan\".\nHis hands ran back and forth over the depiction of the god Apollo wearing a laurel crown, tracing the edges of the garment.\n\"There are many things that you can discover and that you love discovering,\" said Gonzalez, who has been blind since the age of 14.\nThe painting is one of six copies of works by masters such as El Greco and Francisco Goya specially created for the museum's first ever exhibition for the blind.\nThey use a relief painting technique that adds volume and texture to allow the blind, or those with limited vision, a chance to create a mental image of a painting by feeling it.\nWater bowls are ready for accompanying guide dogs and an audio guide advises blind visitors how to best explore the paintings through touch.\n\"This is a brilliant exhibition. The only way the blind have had to access paintings is through explanations from another person,\" said Gonzalez, who has visited the \"Touching the Prado\" show several times since it opened in January.\n- Small enough to feel all over -\nMuseums in other nations have used the same technique to reproduce works for the blind but their copies were smaller and only in black-and-white, said the curator of the Prado exhibition, Fernando Perez Suescun.\nThe copies in the Prado exhibition have the same proportions as the originals but are smaller to allow blind guests to touch and feel their way through the entire surface.\nThe museum selected works that are representative of its vast collection and whose details could be highlighted by adding volume.\n\"It is hard for a blind person to build a mental image of what these works are like so we looked for paintings that provided information but were clear,\" Suescun said.\nThe Prado plans to take the paintings on tour to other Spanish cities once its Madrid run ends on October 18.\nThe exhibition is part of a growing effort by Spanish museums to make their collections accessible to the visually impaired with help from Spain's powerful national organisation for the blind, known by its acronym ONCE.\n- Taj Mahal, Kremlin replicas -\nThe nearby Reina Sofia modern art museum, home to Pablo Picasso's masterpiece \"Guernica\", too allows blind guests to touch some of its sculptures while Madrid's Costume Museum has set up a permanent exhibition of original dresses, including an 18th century gown, that can be felt.\nONCE, which runs a popular daily lottery in Spain that employs over 20,000 blind or disabled lottery vendors, advises the museums on how to improve visits for the blind.\n\"All of this helps not only blind people, but also anyone with any type of disability,\" said the head of ONCE's leisure and sports programmes, Angel Luis Gomez Blazquez.\nONCE's own museum in Madrid displays 34 models of world landmarks such as the Eiffel Tower, the Taj Mahal and the Kremlin, that the blind can touch.\nA restorer visits the museum every Monday to repair any damage done to the models.\nBlind people sometimes come to touch models of places they are about to visit or of buildings they saw before they lost their vision, the museum's guide, Estrella Cela, said.\n\"It can also serve for that, to remember things that you already know,\" said Cela, 59, who has worked at the museum since shortly after it opened at the end of 1992 and is blind herself.\n- 'Hands teach a lot' -\nElisabeth Axel, the president and founder of Art Beyond Sight, a New York-based non-profit organisation specialising in museum access for the blind, said more museums around the world were making their collections accessible to the blind.\n\"We are seeing that museums are truly outreaching and inviting in all audiences with multi-sensory exhibitions,\" she added.\nThe Metropolitan Museum of Art in New York, which organises an array of activities for blind visitors including guided tours, drawing classes and workshops where they can feel sculptures, is a leader in this area, she said.\n\"Touching, smelling, listening, are very important. As I lack sight I have to complement this with my remaining senses and your hands teach you a lot,\" said Jose Luis Andres, 55, who lost his sight eight years ago, as he felt a dress at Madrid's Costume Museum.\n ", "external_links": ["http://nyti.ms/1fG8B7v&quot;,&quot;durationSecs&quot;:123,&quot;playbackUrl&quot;:&quot;http://www.msn.com/en-us/travel/news/the-new-york-times-if-marble-could-talk/vi-AAcYib5&quot;,&quot;providerId&quot;:&quot;NYT_100000003799355&quot;,&quot;sourceFriendly&quot;:&quot;The", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAcT0D6.img&quot;}},{&quot;csId&quot;:&quot;AA1jP16&quot;,&quot;description&quot;:&quot;From", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAda3MT.img&quot;}},{&quot;csId&quot;:&quot;BBkkIUP&quot;,&quot;description&quot;:&quot;Over", "http://img.s-msn.com/tenant/amp/entityid/BB74fLs.img&quot;,&quot;title&quot;:&quot;Elisabeth", "http://b.scorecardresearch.com/b?&quot;,&quot;Category&quot;:&quot;travelnews&quot;},&quot;Mute&quot;:&quot;true&quot;,&quot;HomePageLink&quot;:&quot;//www.msn.com/en-us&quot;,&quot;GeofenceUseSps&quot;:&quot;false&quot;,&quot;GeofenceEnabled&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:&quot;true&quot;,&quot;AutoPlay&quot;:true,&quot;Mute&quot;:true,&quot;SwfCacheRefreshTime&quot;:86400,&quot;AdConfig&quot;:{&quot;FWFlashProfile&quot;:&quot;188286:MSN_US_AS3_LIVE&quot;,&quot;FWHtml5Profile&quot;:&quot;188286:MSN_HTML5_Live&qu", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAd90Za.img&quot;}}", "http://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAcY2Dk.img&quot;}}", "http://img.s-msn.com/tenant/amp/entityid/BBkyIp2.img&quot;,&quot;title&quot;:&quot;Bill", "http://img.s-msn.com/tenant/amp/entityid/BBAq9.img&quot;,&quot;title&quot;:&quot;The"], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-18T04:44:29.000+03:00", "highlightTitle": ""}