{"organizations": [], "uuid": "04f72e0e0f356a1dc1766af7110671defae3c5ff", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150726ChileDenigri.jpg", "site_section": "http://www.ticotimes.net/categories/chile-2", "section_title": "Chile Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/27/after-30-years-mother-hopes-for-justice-in-sons-murder-during-chilean-protest", "country": "US", "title": "After 30 years, mother hopes for justice in son's murder during Chilean protest", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "After 30 years, mother hopes for justice in son's murder during Chilean protest -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T17:20:00.000+03:00", "replies_count": 0, "uuid": "04f72e0e0f356a1dc1766af7110671defae3c5ff"}, "author": "Steve Hendrix | The Washington Post", "url": "http://www.ticotimes.net/2015/07/27/after-30-years-mother-hopes-for-justice-in-sons-murder-during-chilean-protest", "ord_in_thread": 0, "title": "After 30 years, mother hopes for justice in son's murder during Chilean protest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Update, Monday, 9:30 a.m.:\nFrom AFP: A Chilean judge on Monday ordered the arrest of five more former soldiers for allegedly burning alive a teenage photographer seized at a protest against the late dictator Augusto Pinochet in 1986.\nThe arrest orders issued by Judge Mario Carroza bring to 12 the number of former members of the military accused in the gruesome killing.\nOriginal story continues here:\nVeronica DeNegri waited almost three decades for the news she received last week at her Washington-area home: Officials in Chile were preparing to arrest the men who allegedly burned her son to death during a protest march in Santiago in 1986.\nWithin hours, she was headed back to her native country, arriving a day before seven former members of the Chilean military were taken into custody and charged in connection with her son’s murder.\n“This is just the beginning,” DeNegri said in a telephone interview from the Chilean capital, vowing to track each detail of the long-delayed legal process. “The end will come when they are sentenced to jail. I have been waiting for 29 years, I can wait a little longer.”\nFor a generation, DeNegri has been both the grieving parent and the fierce activist at the center of one of the most brutal episodes from the repressive era of Chilean dictator Augusto Pinochet.\nThe murder of 19-year-old Rodrigo Rojas DeNegri — and his mother’s ceaseless campaign to hold his killers accountable — were defining events in Washington’s tight-knit community of Chilean exiles and human rights activists.\n“When she spoke, people paid attention,” said Joe Eldridge, the campus chaplain at American University and a longtime friend of DeNegri, and a resident of Chile during the 1973 coup that brought Pinochet to power. “It affected all of us, but nobody suffered as much as Veronica.”\nDeNegri had worked with the families of the “disappeared” in Chile, and was herself imprisoned and brutally tortured by the regime in the 1970s.\nReleased after eight months and then exiled, she and her two sons settled near Dupont Circle in Northwest Washington. Eventually she found worked counseling pregnant teens and alcoholics in suburban Maryland. Telling her own story, she became increasingly active with Amnesty International and other human rights groups.\nRecommended: What Augusto Pinochet’s 1998 arrest has meant for global human rights\nVeronica DeNegri, left, Alicia Lira, and human rights lawyer Francisco Ugas leave a court in Santiago, Chile, on July 24, 2015. Judge Mario Carroza reopened the case in 2013 and ordered the arrests of the ex-officers after a military conscript, Fernando Guzmán, changed his previous testimony.\nClaudio Reyes/AFP\nBut in 1986, the Pinochet regime took another murderous swipe at DeNegri’s family. Her son Rodrigo, a student at the District’s Wilson High School and an avid photographer, returned to the country they had fled a decade earlier to reconnect with family and take photos of the continuing unrest.\nDuring a protest march, as Rodrigo wielded his Nikon, he was detained by security forces. What happened next was described in an account by David Remnick in the Washington Post Magazine:\nSoldiers would beat him with their gun butts. They would make him lie face down on the sidewalk. Then, witnesses say, a young lieutenant would drench him with gasoline, light him on fire and watch.\nRemnick wrote that “more than 5,000 people attended Rodrigo’s funeral. Mourners came with flowers, candles and signs, many of them seeing this death as an emblem of what Chile had become — a state under siege with the highest percentage of political exiles in the world.”\nIt took diplomatic pressure from the U.S. State Department before Chilean authorities would allow Veronica DeNegri into the country, just in time to spend her son’s last days with him.\n“When Rodrigo was burned, we just helped her pack her bag and she rushed down there,” said longtime friend and Washington filmmaker Aviva Kempner, her voice breaking with emotion. “And now the same thing has happened again.\n“On the one hand, you’re thrilled that these bastards finally get their due. But it just brings up all these emotions.”\nAfter her son’s death, DeNegri worked unceasingly to bring his killers to justice, joining lawyers and groups of victims’ families in Washington and Chile to pressure the government in Santiago. Years of stonewalling were followed by one dead-end investigation after another.\nMario Carroza, the latest judge to take up the case, gave DeNegri a glimmer of hope.\n“He was the first person in the legal system that showed me he was serious and committed,” DeNegri said. “The rest were all protecting the criminals.”\nDeNegri said Carroza secured a breakthrough when one of the soldiers suspected in her son’s death testified last year, breaking a decades-long pact of silence.\nOn Tuesday, Carroza charged six former officers and soldiers with killing Rodrigo and with the attempted homicide of 18-year-old Carmen Quintana, a protester who was also burned but survived with disfiguring scars. A seventh soldier was charged as an accomplice.\nDeNegri — who plans to keep advocating on behalf of political prisoners in Chile and against the pension system that pays corrupt former members of the military — said she is encouraged by the arrests in her son’s case.\nBut in Chile, she knows that justice is never assured.\n“They could replace the judge,” she said. “They have done it before.”\n© 2015 , The Washington Post", "external_links": [], "published": "2015-07-27T17:20:00.000+03:00", "crawled": "2015-07-27T20:18:20.041+03:00", "highlightTitle": ""}