{"organizations": [], "uuid": "1972dba34545585111dced2d3ed798daffd4fea1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/cyprus/27940-almyra-presents-elite-training-camps", "country": "US", "title": "Almyra presents elite training camps", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Almyra presents elite training camps", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T14:30:00.000+03:00", "replies_count": 0, "uuid": "1972dba34545585111dced2d3ed798daffd4fea1"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/cyprus/27940-almyra-presents-elite-training-camps", "ord_in_thread": 0, "title": "Almyra presents elite training camps", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Almyra presents elite training camps Almyra presents elite training camps Details Category: Cyprus   12:30 Set amidst eight acres of lush garden within earshot of the crashing Mediterranean waves, Almyra is a 189-room family-run resort located on the idyllic Cypriot coast of Paphos. Far from being a destination for sun worshippers only, the Design Hotels™ member hotel is also attracting fitness fanatics. Striking a perfect balance between boutique hotel and fitness boot camp, the property plays host to a year-round series of Triathlon Camps and Swimming Clinics. Each of the elite training sessions is led by world-class coaches and athletes. \nSwim, Bike, Run Whether looking to escape the monotony of the gym or simply to improve personal fitness, Almyra’s Triathlon Camps are the perfect way of combining a luxurious holiday with an ass-kicking training program. Hosted by long-distance triathlete and sports journalist Sean McFarlane, pro-coach Simon Brierley, and ex-champion triathlete and sports physiologist Kypros Nicolaou, the camps have been designed to build upon and refine technique with personalized training sessions. Taking place from November 2015 – April 2016, the daily activities at the camp include open water swims, extensive road cycle routes and running sessions on Cyprus’ breathtaking coastal paths and trails. Providing essential fuel for the daily exertions, Almyra’s chefs are on hand with nutritional advice and a Mediterranean menu, offering the correct balance of carbohydrates, fats and protein for optimum training. Rates start from 1190 €. Just Keep Swimming For those looking to stretch their sea legs, year-round Swimming Clinics overseen by Kypros Nicolaou provide the perfect platform. Typically comprising four sessions, guests can brush up on their strokes in the sleek elegance of Almyra’s marble-tiled Italian slate pool before discovering the key elements of open-water swimming off Paphos' coast. Through the use of video analysis and one-to-one coaching, participants are encouraged to identify flaws and improve technique under Nicolaou’s watchful eye. Prices start at 350 € per person. Situated amidst eight acres of gardens in the coastal city of Paphos, Almyra's enviable location is only the beginning of its story. Under the direction of Thanos Michaelides, the hotel has been family-run and operated since 1974. The focus here is on what Michaelides refers to as \"modern hospitality,\" with equal consideration paid to the needs of those traveling with young families and those without. Almyra’s generous guestrooms and suites provide ample space for groups and families – who will most certainly also appreciate the Almyra’s two freshwater pools, both built with Italian slate. Views of Paphos Castle from the Helios Lounge Bar compete with the beachfront Ouzeri, one of four restaurants, where diners are served traditional Greek cuisine under Cyprus’ setting sun. Surrounded by the ocean and stunning trails and paths, Almyra is the perfect training base – offering year-round golf packages, sailing classes, and biking camps, alongside the swimming clinics and seasonal triathlon coaching. Triathlon Training Camps Schedule 2015/2016 1st - 8th November 2015 Kinetic Revolution Run Camp 2015 with Simon Brierley 13th -15th November 2015 Triathlon Training Camp – Fam trip with Kypros Nicolaou 20th - 27th February 2016 Triathlon Training Camp with Sean McFarlane 25th March -3rd April 2016 Paradise Triathlon Camp 2016 with Simon Brierley Related articles", "external_links": [], "published": "2015-07-29T14:30:00.000+03:00", "crawled": "2015-07-29T14:48:34.128+03:00", "highlightTitle": ""}