{"organizations": [], "uuid": "c47744d05aaa591b9524b7cf209f93720e83c298", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 3:15 p.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_DRONE_PARK_CONSTRUCTION_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "Initial phase of drone park construction to start with fence", "performance_score": 0, "site": "ap.org", "participants_count": 1, "title_full": "Initial phase of drone park construction to start with fence", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T20:29:00.000+03:00", "replies_count": 0, "uuid": "c47744d05aaa591b9524b7cf209f93720e83c298"}, "author": "By DAVE KOLPACK", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_DRONE_PARK_CONSTRUCTION_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "Initial phase of drone park construction to start with fence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FARGO, N.D. (AP) -- The president of the company managing the nation's first unmanned aircraft business park says construction is scheduled to begin next week, though it won't be a dramatic spectacle. First up at Grand Sky is a security fence. \"It's not very glamorous and it's not going to be backhoes and bulldozers and things getting knocked down and built,\" said Thomas Swoyer Jr., president of Grand Sky Development Corp. \"But that security fence is a very symbolic element to go up because it will really define the park space and give us the ability to control our own access to it.\" Swoyer earlier this week received approval from the Grand Forks County Commission to have iconHD, a Grand Forks company, start on the 8-foot-high chain-link fence topped by three rows of barbed wire at the Grand Forks Air Force Base facility. Mike Kuntz, principal architect for ICON Architectural Group, the parent company for iconHD, said the fence is the culmination of planning that began in 2011. \"This is the first phase of a grand vision,\" he said. \"I kind of view it as this playground for modern-day toys. It's exciting.\" The 1.2-million-square-foot park has two anchor tenants, Northrop Grumman and General Atomics, both of which are major defense contractors. General Atomics also signed a tentative agreement earlier this week to establish an unmanned aerial systems training academy at Grand Sky and is negotiating details of the lease. \"The word tentative, I think, is in relation to what exactly are the businesses that General Atomics will be conducting here, not whether they're coming to Grand Forks,\" Swoyer said. Northrop Grumman and General Atomics will each have separate buildings in the park, which will have the look and feel of a campus, Swoyer said. \"Think of it like a neighborhood with different land plots,\" he said. \"Northrop Grumman wanted the model home right in front and General Atomics wants one a little farther in.\"", "external_links": [], "published": "2015-07-10T20:29:00.000+03:00", "crawled": "2015-07-11T04:46:22.000+03:00", "highlightTitle": ""}