{"organizations": [], "uuid": "ff8f08b2ad0b61e961632d1e0686ff10e5759d2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61562/indian-travel-agents-learn-south-africa", "country": "US", "title": "Indian travel agents “Learn South Africa”", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Indian travel agents “Learn South Africa”", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T03:20:00.000+03:00", "replies_count": 0, "uuid": "ff8f08b2ad0b61e961632d1e0686ff10e5759d2b"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61562/indian-travel-agents-learn-south-africa", "ord_in_thread": 0, "title": "Indian travel agents “Learn South Africa”", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indian travel agents “Learn South Africa” Adv: \nBy Anil Mathur, eTN India Correspondent | Jul 18, 2015 Adv: \nEncouraged by the response and to meet the growing demand and interest in the country, South Africa plans to enlarge its popular “Learn South Africa” training program, which is now underway in 15 cities, with a target to interact with 1,600 travel agents. \nAs many as 6 more cities, mostly Tier 2 and 3, have shown interest in having such modules, Ms. Hanneli Slabber, Country Manager for South African Tourism, said in New Delhi, India, on July 17 during the training program where the Travel Agents Association of India has been involved so that those who participate are serious in promoting South Africa. \nShe said that the average stay of Indians has gone up to 13.5 days, from 12 days, and the prospects for 2015 and beyond were bright as the visa regime is being streamlined. \nMs. Slabber admitted that 2014 had not been too good as the Ebola fear had hit arrivals, because the perception was that South Africa, being in Africa, was effected by it, although this was not the case. \nShe revealed that 60 percent of the budget for India was spent on agents’ activities, showing how serious South African Tourism is in dealing with travel agents. \nThe Meetings, Incentives, Conferences & Exhibitions (MICE) industry was also a very strong segment from India which was good for the economy. \nThe special needs of Indian tourists, including food, timings, and TV programs, were being taken care of she said, adding that Indians were shopping for designer items and for music from Senegal, in South Africa, among other things. \nNine suppliers from South Africa are visiting 15 cities in India and include representatives from Abercrombie and Kent, Tsogo Sun, Private Safari, Extraordinary, Accor Hotels, Emirates, TravCare, and South African Airways.", "external_links": [], "published": "2015-07-18T03:20:00.000+03:00", "crawled": "2015-07-18T15:32:37.000+03:00", "highlightTitle": ""}