{"organizations": ["Kent State University", "Ohio Historical"], "uuid": "1b8c073a561c8e8b4457a79ee3983bda5cd9f03e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/07/17/HISTORICAL_MARKERS.JPG.jpg", "site_section": "http://dispatch.com//content/syndication/lae_travel.xml", "section_title": "The Columbus Dispatch Travel Feed", "url": "http://www.dispatch.com/content/stories/travel/2015/07/19/1-site-locates-wide-range-of-historical-markers.html", "country": "US", "title": "Website locates wide range of historical markers", "performance_score": 0, "site": "dispatch.com", "participants_count": 0, "title_full": "Website locates wide range of historical markers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T12:00:00.000+03:00", "replies_count": 0, "uuid": "1b8c073a561c8e8b4457a79ee3983bda5cd9f03e"}, "author": "", "url": "http://www.dispatch.com/content/stories/travel/2015/07/19/1-site-locates-wide-range-of-historical-markers.html", "ord_in_thread": 0, "title": "Website locates wide range of historical markers", "locations": ["Ohio"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Duncan"], "text": "Website locates wide range of historical markers Travel View Slideshow Request to buy this photo Mark Duncan | AP file photo A student walks past an Ohio Historical marker commemorating the 1970 Kent State University shootings on the campus in Kent, Ohio. \nI love historical markers. \nThe rectangles of bronze (or aluminum, or whatever Rhode Island or Wyoming might use) provide a focused snapshot of a bite-size piece of history. Some markers are profound, such as the place where William McKinley was shot; some are less so, as in the place the first martini was mixed. \nFinding the markers always has been something of a catch-as-catch-can affair for me. A lot of times I’ll notice a marker only as I speed by on the highway. What, I wonder, did I just miss? \nNow, a solution. \nComputer programmer J.J. Prats also loves historical markers and had stopped at hundreds during his travels. \n“It was my hobby, a hobby that has gone out of control,” said Prats, who lives in suburban Washington, D.C. \nIn 2006, Prats started the Historical Marker Database website listing 179 markers that he had documented. \nToday, hmdb.org lists more than 74,000 markers. Most are in the United States, but markers from more than 40 other countries also are listed. The site lists more than the traditional plaque-on-a-post historical markers. But to qualify, the marker must be outdoors, must be permanent and must state historical or scientific facts beyond names, dates and titles. \nEach listing contains a photograph, the marker’s full text, the date it was erected, its precise location and a list of other historical markers nearby. Users can search for markers by address or GPS coordinates. \nMobile-device users can call up a list and map of the 20 closest markers at hmdb.org/mobile \nMarkers also are sorted by topic and category. \nThe biggest category, not surprisingly, is the Civil War, with more than 14,000 listed markers. Next come the categories of Settlement and Settlers and Architecture. \nThe site depends on thousands of travelers to send information about the historical markers they find, Prats said. \n“There are a lot of lists of historic markers, and a lot of inaccuracies in them,” Prats said. \nSo each marker listed at his site has been documented with a photograph and fact-checked by the site’s eight editors and 18 contributing editors, all volunteers. \nBecause of the nature of the organization, some parts of the country are less documented than others, Prats said. \n“We’ve got the coasts covered, and we’re pretty good in the Midwest. We’re still missing a lot in the rural areas of Texas, for example, and some of the smaller population states like the Dakotas. But we’re an organization of self-directed volunteers, so I can’t call someone and say ‘ Get yourself to North Dakota, pronto.'\" \nAnd the listings keep rolling in. The site is adding 100 to 200 markers each week, Prats said. \nThere is no reliable estimate, he said, of just how many historical markers are out there. He once guessed the total to be about 100,000, but he now thinks that estimate was significantly low. \nAlthough the site is a labor of love, it does take in a bit of money through advertising to help pay some of the bills, Prats said. \nGoogle also bought access to the data to include on its Field Trip mobile app, Prats said. The money went to buy a new server, which resides in the basement of a friend’s house, he said. \nMaybe someone should erect a historical marker there. \nSteve Stephens is the Dispatch travel writer. He can be reached at 614-461-5201 or by email. \nsstephens@dispatch.com", "external_links": [], "published": "2015-07-19T12:00:00.000+03:00", "crawled": "2015-07-19T13:13:28.249+03:00", "highlightTitle": ""}