{"organizations": [], "uuid": "11a9c7dcaeebeb06f7a7a674c3f2868b93d9b991", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61317/partnered-etn-airport-it-and-airport-security-2015", "country": "US", "title": "Partnered with eTN – Airport IT and Airport Security 2015", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Partnered with eTN – Airport IT and Airport Security 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T00:52:00.000+03:00", "replies_count": 0, "uuid": "11a9c7dcaeebeb06f7a7a674c3f2868b93d9b991"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61317/partnered-etn-airport-it-and-airport-security-2015", "ord_in_thread": 0, "title": "Partnered with eTN – Airport IT and Airport Security 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Partnered with eTN – Airport IT and Airport Security 2015 Adv: \nJul 10, 2015 Adv: \nInternational Airport Review’s Airport IT and Airport Security conferences will once again bring CIOs, IT Directors, Head of Operations and Security, Security Directors, Lead Security Officers, Security Managers and Security Analysts together to share and discuss their visions for the future. \nThis year’s event will also see both Airport IT and Airport Security co-locating in Barcelona, to create one fantastic exhibition space for IT and security professionals from airports and airlines to meet from around the world. \nBoth are proud to have eTurboNews as a media partner, and hopes to see this partnership grow and evolve to see future collaborations. With a shared exhibition area, Airport IT and Airport Security look forward to seeing its biggest exhibition yet. The floorplan has recently been released and already it is filling up quickly. \nAirport IT \nInternational Airport Review’s Airport IT expo will once again bring together CIOs, IT Directors, Head of Operations and Security to share and discuss their visions for the future. \nThis year’s event will also see Airport IT co-locating with the ever successful Airport Security event in Barcelona, to create one fantastic exhibition space for IT and security professionals from airports and airlines to meet from around the world. \nAirport Security \nInternational Airport Review’s Airport Security expo will bring together Security Directors, Head of Operations and Security, Lead Security Officers, Security Managers and Security Analysts to share and discuss their visions for the future. \nThis year’s event will also see Airport Security co-locating with the ever successful Airport IT event in Barcelona, to create one fantastic exhibition space for security and IT professionals from airports and airlines to meet from around the world.", "external_links": [], "published": "2015-07-11T00:52:00.000+03:00", "crawled": "2015-07-11T21:44:37.000+03:00", "highlightTitle": ""}