{"organizations": [], "uuid": "a9314b639dc28617b4d85c623a8354927d7a21c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gocalifornia.about.com", "main_image": "http://f.tqn.com/y/gocalifornia/1/S/j/u/3/1201338426_cf61dce066_o.jpg", "site_section": "http://z.about.com/6/o/m/gocalifornia_t2.xml", "section_title": "About.com California Travel: What's Hot Now", "url": "http://gocalifornia.about.com/od/casfmenu/p/stern-grove.htm", "country": "US", "title": "Guide to the Stern Grove Festival in San...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Guide to the Stern Grove Festival in San...", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T14:15:00.000+03:00", "replies_count": 0, "uuid": "a9314b639dc28617b4d85c623a8354927d7a21c1"}, "author": "", "url": "http://gocalifornia.about.com/od/casfmenu/p/stern-grove.htm", "ord_in_thread": 0, "title": "Guide to the Stern Grove Festival in San...", "locations": ["Stern Grove"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Nathan"], "text": "Expert Videos Summer Afternoon at Stern Grove. Nathan Naze/Flickr/CC BY-NC-SA 2.0 \nThe Stern Grove Festival is an admission-free performing arts series that has been held in San Francisco since 1938. The location is Sigmund Stern Grove, a beautiful outdoor amphitheater on the west side of town. \nPerformers on the 2014 schedule include Smokey Robinson, Sergio Mendes and The Zombies. The Event \nOn summer Sunday afternoons, the Stern Grove Festival features world class performances from a wide variety of performers. In the past, they have included vocalists Roberta Flack, Joan Baez and Smokey Robinson. Fusion group Tabla Beat Science recorded a live album at Stern Grove in 2002. The San Francisco Opera, Symphony and Ballet are always on the calendar, too. \nThe atmosphere is stereotypically San Francisco, with people of all kinds enjoying the music. It's all possible thanks for Rosalie M. Stern who purchased the land, gave it to the city of San Francisco and formed the non-profit Stern Grove Festival Association in 1932, specifying that the concerts should be free and the music should include varied genres and artists. Picnicking at the Stern Grove Festival \nA free concert of Stern Grove's quality draws big crowds. To get a seat in the main Concert Meadow, arrive well ahead of the start time. Many festival patrons have a picnic to pass the time with their friends. Bring your own or buy something at the Grove Cafe. \nThe Stern Grove picnic tables are nice if you don't want to sit on the lawn or lug your chairs, but their numbers are limited and they're reserved for Friends of Stern Grove (aka donors), a nice perk for supporting a good cause. Details are on their website . Likes and Dislikes \nThe Stern Grove Festival is a perennial San Francisco favorite, offering a variety of music during their season that outstrips many of California's more famous venues. \nWe rate it 4 stars out of 5 for great ambiance, an unbeatable (free) price and outstanding performance quality. We just wish it was less crowded and easier to get to from out of town. The Stern Grove Festival Venue and Crowd Factor \nThe grove in Stern Grove's name refers to the eucalyptus trees that form the natural walls for this lovely outdoor concert venue. The main Concert Meadow surrounds the stage and offers open seating on the lawn. Concert-goers can also find places to sit on the surrounding hillside under the trees. The nearby West Meadow is also available, where you can hear the music but won't be able to see the performers. \nYou'll find the concert meadow and any available spot under the trees packed with people by the time the concert starts and they stop letting people in when it reaches capacity. Get there early to find a better spot. \nYou can send someone ahead to claim your space, but be sure you can communicate with them by cell phone. Once the place gets full, they may have to come to the gate before the ushers will let you in to join them. Tips for Enjoying the Stern Grove Festival You can bring folding chairs and beach umbrellas, but high-backed chairs and the umbrellas have to come down when the concert starts. Your best bet is beach chairs and a big-brimmed hat. The Stern Grove location can be foggy and cool or hot and sunny, sometimes all in the same day. There is no shade in the Concert Meadow. Bring layers of clothing, a hat, water and plenty of sunscreen. Dogs are not allowed in the Concert Meadow (but service animals are). You can bring Fido and listen from the West Meadow, but you won't be able to see the performers. Information about restrooms and other needs are on their website . The Basics Held on summer Sunday afternoons at 2:00 p.m. but plan to arrive at least an hour ahead of time The season schedule is announced on their website in late April or early May Sigmund Stern Grove park, located at the corner of 19th Avenue and Sloat Boulevard The Stern Grove Festival is free for all, but they would appreciate a donation if you can afford it How to Get to the Stern Grove Festival \nStreet parking is very limited and there are no public parking lots nearby. Your best option is public transportation. Check the options at their website which include ways to get there by BART and city bus. If you bicycle in, they have a complimentary bike valet service.", "external_links": [], "published": "2015-07-20T14:15:00.000+03:00", "crawled": "2015-07-21T01:23:30.279+03:00", "highlightTitle": ""}