{"organizations": [], "uuid": "ee15461a696d241fd7019ff8d20423cbf727e6c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/2782404/images/o-COMPUTER-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/business-travel/feed", "section_title": "Business Travel on Huffington Post", "url": "http://www.huffingtonpost.com/brian-de-haaff/the-product-manager-vs-th_1_b_7733156.html", "country": "US", "title": "Brian de Haaff: The Product Manager vs. The Engineering Manager", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Brian de Haaff: The Product Manager vs. The Engineering Manager", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T17:49:00.000+03:00", "replies_count": 0, "uuid": "ee15461a696d241fd7019ff8d20423cbf727e6c6"}, "author": "Brian de Haaff", "url": "http://www.huffingtonpost.com/brian-de-haaff/the-product-manager-vs-th_1_b_7733156.html", "ord_in_thread": 0, "title": "Brian de Haaff: The Product Manager vs. The Engineering Manager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit I am not a smoker. But, early in my product management career my engineering management counterpart was. To find time on his fully packed calendar I would take 'virtual' smoking breaks with him and review product development status, engineering updates, and any other issues facing the development team. So, while he got his cigarette break, I got a little fresh air (standing upwind), and stole time from his calendar. \nI've been fortunate to work with some amazing engineering managers--ones who were master technologists who could also pop up and manage and inspire their teams. I've learned a great deal from technical managers and am a better strategist, product leader, and leader at Aha! because of them. \nBut I have also worked in environments where product and engineering leaders were filled with mistrust. Their interactions were nasty and email exchanges rotten. \nThis happens for lots of reasons, but it's often driven by uncertainty over roles. Roles can become blurry when the engineering manager starts dictating which features will be in the next release or the product manager oversteps and tries to provide detailed technical directions to the engineering team. For both roles to thrive and the relationship to succeed, the two team members need to play their parts with humility. \nThe product manager owns the product roadmap. He is the person responsible for defining, in detail, the 'why' and high level 'what' of the product that the engineering team will be asked to build. \nThe engineering manager is the technical lead and in many cases, visionary for the technical direction of the product. The engineering manager must help refine the 'what' and own the 'how.' And together the product and engineering manager should work together on the 'when.' \nHere are a few of the ways the roles complement one another and bring a combined strength to the product and engineering teams: \nProduct Vision vs. Technical Vision The product manager is responsible for roadmapping and product strategy. Her job is to clearly articulate the business value to the product team so they understand the intent behind the new product or product release. He owns the strategy behind the product and its roadmap and must work with engineering to build what matters. \nThe engineering manager defines and drives technical strategy and architectural vision for the product and sometimes the company. He is responsible for defining the development methodology and ensuring adoption across the engineering team and organization. The engineering manager designs appropriate solutions and recommends alternative approaches, when necessary. \nProduct Expert vs. Technical Expert The product manager is the go-to product expert on the team. He facilitates communication between the team and the stakeholders and ensures that the team is building the right product at the right time. He is also is a key resource to the rest of the non-technical organization and should be responsible for the overall success of the entire product experience. He must be the master of the product. \nThe engineering manager serves as a technical lead for technical decisions and he must stay abreast of advancements in related technologies. He manages complex technical projects and a team of engineers. In many environments, the engineering manager is willing to roll up his sleeves and code alongside his team while guiding the engineering team to grow both technically and professionally. He leads the planning, execution, and success of complex technical projects while recommending engineering best practices and assessing feasibility and ramifications of new business requirements. \nManage Indirectly vs. Manage Directly The product manager is typically seen as the CEO of the product, even though no one reports directly to her. For the product manager, this means she is responsible for making product decisions and must motivate and lead a cross-functional team of leaders from across the organization. She is responsible for delivering an entire roadmap presentation and ensuring the company can market, sell, and support it. \nThe engineering manager must not only have technical chops, but also directly manage a team of engineers. The engineering manager is responsible for supporting the professional goals and development opportunities for the entire engineering staff--including providing coaching and mentoring, one-on-one meetings and reviewing each engineer's progress. \nA great engineering manager delivers against project goals, contributes to (but does not own) product strategy and helps develop his team. \nA great product manager leads the product vision and roadmap while helping a cross-functional team be great. Working together, the product and engineering managers can create a product planning and development environment for success. \nHave you worked in partnership with a great product or engineering manager? \nFollow Brian de Haaff on Twitter: www.twitter.com/bdehaaff More:", "external_links": [], "published": "2015-07-08T17:49:00.000+03:00", "crawled": "2015-07-08T22:28:03.000+03:00", "highlightTitle": ""}