{"organizations": [], "uuid": "c95d32935989d8cd803f2fb7e6b90846405d94a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/4_-Executive-Italian-Chef-Giuseppe-Brancati.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/alto-88-invites-taste-contemporary-italian-cuisine/", "country": "US", "title": "Alto 88 invites all to taste contemporary Italian cuisine - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Alto 88 invites all to taste contemporary Italian cuisine - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "c95d32935989d8cd803f2fb7e6b90846405d94a1"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/alto-88-invites-taste-contemporary-italian-cuisine/", "ord_in_thread": 0, "title": "Alto 88 invites all to taste contemporary Italian cuisine - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alto 88 invites all to taste contemporary Italian cuisine Published on : Friday, July 10, 2015\nA new Signature Tasting Menu designed by Executive Italian Chef, Giuseppe Brancati, is now available at the contemporary yet stylish Italian restaurant, Alto 88. To showcase guests, who value top-notch Italian food, newly implemented dishes of Alto 88; the Signature Tasting Menu provides a chance for diners to experience creativity and authenticity of Italian cuisine in one go.\nSignature Tasting Menu, as implied by its name, is complied by the restaurant’s signature dishes in one menu, allowing guests to taste the different aspects of Chef’s cooking talent. Each of the marvellously designed dishes is made of particularly selected ingredients from Italy. “Ingredients are always one of the key elements of every single dish. To demonstrate the top quality of the restaurant, I always use the freshest ingredients to impress guests,” said Giuseppe. The first dish of the menu, Marinated Sicilian Red Prawn, using the freshest Sicilian Red Prawn with its sublime flavour and glorious natural colour, serving with the crunchiness of Garlic Crouton, freshness of Oyster and Salmon Caviar, together with the basil sauce, makes the dish a good start for the evening. Risotto Acquerello is one of the highlights in the menu. Acquerello is considered as one of the best superfine Carnaroli rice in the world produced by the Rondolino family, who is renowned for its rice production worldwide. Its production process of aging and refining makes the rice texture and taste unlike others. Chef cooks the rice with pigeon sauce together with sweet and sour reduction, with a hint of the tasty black truffle, turning the dish into an unbeatable one. Lamb from Pyrenees is particularly chosen for the dish Roasted Pyrenees Baby Lamb Chop. Pyrenees is well known for its many food ingredients especially lamb and cheese. Lambs from there stay on the hills with an unpolluted living environment, which makes its texture tender with prosperous flavour. Giuseppe grills the lamb chop perfectly to keep it juicy and quince with ginger sauce to balance the grease. Last but not least, the traditional Napolitan Pastiera is prepared in Chef’s own style to end the evening with sweetness. The 6-course menu is at $888 per person and $1,288 per person with sommelier choice on wine pairing with each dish.\nSignature Tasting Menu\nMarinated Sicilian Red Prawn\nGarlic Crouton, Papillion Oyster, Salmon Caviar and Basil Sauce\nBroad Beans Cream\nPecorino Cheese and Pear Ice Cream, Crunchy Parma Ham\nRisotto Acquerello\nPigeon Sauce, Sweet and Sour Reduction, Black Truffle\nMonk Fish Tail\nGazed Italian Shallot, Green and Black Olive Powder", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-10T11:29:07.000+03:00", "highlightTitle": ""}