{"organizations": [], "uuid": "a04a6106b95562313f03cdb3f3dca97d667f580c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gosouthamerica.about.com", "main_image": "http://f.tqn.com/y/gosouthamerica/1/S/X/Z/2/13528481025_c646abc891_k.jpg", "site_section": "http://z.about.com/6/g/gosouthamerica/b/index.rdf", "section_title": "About South America Travel", "url": "http://gosouthamerica.about.com/od/safetyissues/fl/7-Great-Tips-For-Traveling-with-Kids-in-South-America.htm", "country": "US", "title": "7 Great Tips For Traveling with Kids in South America", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "7 Great Tips For Traveling with Kids in South America", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T14:02:00.000+03:00", "replies_count": 0, "uuid": "a04a6106b95562313f03cdb3f3dca97d667f580c"}, "author": "", "url": "http://gosouthamerica.about.com/od/safetyissues/fl/7-Great-Tips-For-Traveling-with-Kids-in-South-America.htm", "ord_in_thread": 0, "title": "7 Great Tips For Traveling with Kids in South America", "locations": ["South America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Andre Matunobu"], "text": "(c)Andre Matunobu \nA key difference for many people who continue to travel after they have started a family is that there are a wide range of different factors that you need to consider when traveling with kids. This can range from planning for the occasional tantrum and the regular needs of children through to looking at activities that will keep the interest of children and prevent them from becoming bored. It is also wise for parents to be a little more cautious about where they travel, and to choose the right destinations, so here are some important tips if you are traveling with kids in South America. \nChoose Your Destination Carefully \nDifferent parts of South America are likely to be much more child friendly than others, so thinking about how safe a destination is and how well you can meet your kids needs as you explore is an important step before traveling. Poorer countries such as Bolivia will not have the same comforts and facilities that you will find in Buenos Aires or wealthier parts of Brazil or Chile. Don't Try to Cram in Too Much \nChildren can be prone to getting bored quite easily, but if you are trying to counter this by doing many different things, you are just as likely to make them irritable and grumpy as they become too tired. Try to find a balance where you have time to play in the park and have an ice-cream, or time to relax, as well as taking in a good range of activities during your trip. Use Public Transport to Get Around \nUsing public transport in different countries is a great way to introduce your children to different destinations, and seeing the cities and people pass by on a train or bus is a great way for them to see a new and unfamiliar place. This is usually best done outside of the rush hour, when most public transport is packed and uncomfortable, while it is also worth looking at the type of public transport you are going to use and how safe it is. Carry Plenty of Water, and Encourage Your Children to Try Local Food \nDeveloping a passion for travel is something that will give your kids a joy they can enjoy for decades to come, and trying the local cuisine and enjoying those new flavors is something you should encourage your children to do. It is also worth making sure that you have plenty of wate r and drinks with you, as many of the juices and drinks sold at street stalls can be high in sugar, and in some cases the water on offer will not be safe to drink. Discuss Activities with the Whole Family \nWhen it comes to choosing what you do in each destination, it is worth planning this with the family well in advance of arriving in South America . Try and get a balance of the activities that your children want to do and the things that you want to do. If you have teenagers, try and look for something that will engage them in the vacation too. Purchase a Child Locator \nIf you have toddlers or young children, using a tether isn't always practical, and is often likely to annoy them and make them more irritable as they can't explore as they would like to. A child locator can be clipped to them, and whenever they get out of sight you can push a button to emit a loud noise, allowing you to find your children quickly if they do get away. Stay in The Safer Areas of Each Destination \nTraveling with children will mean you have different priorities to those who are traveling solo or as a couple, and this will usually mean planning your vacations slightly differently. Try to ensure your trip is as safe as possible by knowing the different areas you are visiting, and know what parts of the town or city to avoid during your visit. Our Expert Recommends", "external_links": [], "published": "2015-07-30T14:02:00.000+03:00", "crawled": "2015-07-31T01:11:31.999+03:00", "highlightTitle": ""}