{"organizations": [], "uuid": "d77ec67ff56783d42ed357d9c07e5b29c8033f0d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/marriott-and-the-nba-announce-new-partnership-to-take-fans-aroundtheworld/", "country": "US", "title": "Marriott and The NBA Announce New Partnership to Take Fans #AroundTheWorld", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Marriott and The NBA Announce New Partnership to Take Fans #AroundTheWorld | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "d77ec67ff56783d42ed357d9c07e5b29c8033f0d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/marriott-and-the-nba-announce-new-partnership-to-take-fans-aroundtheworld/", "ord_in_thread": 0, "title": "Marriott and The NBA Announce New Partnership to Take Fans #AroundTheWorld", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marriott and The NBA Announce New Partnership to Take Fans #AroundTheWorld Published on : Thursday, July 30, 2015\nMarriott International, Inc. and the National Basketball Association (NBA) announced today a partnership that makes the global lodging company the Official Hotel of several marquee NBA events around the world, including NBA Global Games 2015-16, NBA Africa Game 2015, and NBA Canada Series 2015. Marriott is the first company to partner with the NBA across international games on five different continents.\nThe partnership tips off in Johannesburg, South Africa during NBA Africa Game 2015, the first NBA game in Africa, and includes NBA events in 11 other cities across Brazil, Canada, China, Italy, Mexico, Spain, and the UK. Together, Marriott International and the NBA will give Marriott Rewards members exclusive access to NBA games and events in these markets. The partnership will showcase Marriott’s award-winning Marriott Rewards program by bringing the excitement of the NBA directly to its 50 million strong member community.\nSpanning Marriott’s global portfolio of 19 brands, including The Ritz-Carlton, JW Marriott, Renaissance Hotels, Marriott Hotels, Protea Hotels and AC Hotels, Marriott Rewards will host a series of private meet-and-greets with NBA legends and players for its Elite members and invite fans to take a virtual trip in the #AroundTheWorld photo and social sharing experience. The first Marriott Rewards NBA legends meet-and-greet will be co-hosted by The Protea African Pride Melrose Arch Hotel in Johannesburg.\nAdditionally, Marriott Rewards members in the U.S. can look for the opportunity to enter in an upcoming sweepstakes for a once-in-a-lifetime chance to win a trip and tickets to an upcoming NBA global event.\n“Basketball is one of the most popular sports in the world, and our partnership with the NBA gives us an opportunity to tap into a passionate fan base and communicate the breadth and depth of our portfolio,” said Karin Timpone, Global Marketing Officer, Marriott International. “Similar to what we are doing with music and entertainment, our NBA partnership helps us create memorable experiences for our Rewards members and amplify the benefits of the program for both new and loyal guests.”\n“For our fans around the world, there is no opportunity more exciting than when live NBA games are played in their home countries,” said Emilio Collins, NBA Executive Vice President, Global Marketing Partnerships. “Marriott International is a renowned brand with extensive global operations, and is the ideal partner to help broaden the reach of our games and engage more fans.”\nNBA Global Games 2015-16, a series of preseason and regular-season NBA games around the world, includes a total of six NBA teams playing seven games in seven international cities. Additionally, NBA Africa Game 2015 will take place Aug. 1 at Ellis Park Arena in Johannesburg, South Africa, and the NBA Canada Series 2015 will feature a record five teams playing an all-time-high four preseason games in Montreal, Ottawa, Vancouver, and Winnipeg.\nNBA Global Event Schedule:\nNBA Africa Game 2015:\nAug. 1 – Johannesburg, South Africa NBA Canada Series 2015:\nOct. 4 – Vancouver, Canada Oct. 10 – Winnipeg, Canada Oct. 14 – Ottawa, Canada Oct. 23 – Montreal, Canada NBA Global Games 2015-16:\nOct. 6 – Milan, Italy Oct. 8 – Madrid, Spain Oct. 11 – Shenzhen, China Oct. 14 – Shanghai, China Oct. 17 – Rio, Brazil Dec. 3 – Mexico City, Mexico Jan. 14 – London, United Kingdom\nSource:- Marriott", "external_links": [], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-31T19:00:04.144+03:00", "highlightTitle": ""}