{"organizations": [], "uuid": "4eede7df801114afeb0e1625e151c9be786603c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1259", "section_title": "Travel Trade Gazette - Destinations", "url": "http://www.ttgdigital.com/toolkit/good-business-hotel-with-a-golden-touch/4697746.article", "country": "GB", "title": "Good Business: Hotel with a golden touch", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Good Business: Hotel with a golden touch", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T11:00:00.000+03:00", "replies_count": 0, "uuid": "4eede7df801114afeb0e1625e151c9be786603c4"}, "author": "", "url": "http://www.ttgdigital.com/toolkit/good-business-hotel-with-a-golden-touch/4697746.article", "ord_in_thread": 0, "title": "Good Business: Hotel with a golden touch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Save \nMimmi Hakansson, hotel manager of Sunwing Alcudia in Majorca, takes us through a day in the life of a Travelife Gold-certified hotel to reveal how it makes the grade \n﻿8am : When the guest gets out of bed, if they want the bed sheets to be changed, we ask them to remove the old sheets and place them in a basket in the bathroom, along with any towels they want changed. We were apprehensive about asking them to do this little bit of housekeeping but we’ve had lots of positive feedback from guests about this, and we’ve reduced the amount of laundry too. \n9am : In high season, we can serve up to 1,300 breakfasts daily. As much as possible, we use local suppliers for fruit and vegetables, and we buy bread in the village. We don’t use individual packages for items such as cheese, jam and butter. And we don’t buy simply based on price. We find that when we advertise the food is locally sourced, clients don’t mind paying a bit more. \n10am : To help guests plan their day, we have our own hotel app, which has all the information they need, such as menus, activity schedules and maps. We try not to give out any paper to clients, unless they don’t have a smartphone - and we find that 99% do. \n11am : We have to follow the law, which forbids the use of glass around a pool, but we don’t want to use disposable plastic so we are trialling new eco-friendly cups at the pool bar. In the kids’ club, the children take part in educational activities centred on the environment, and when they make arts and crafts, they use recycled items such as drinks cans and toilet roll holders. \n12pm : Self-catering guests can buy lunch in the hotel supermarket where we charge 10 cents per bag or €2 for a reusable shopper. \n2pm : We offer a range of sports and activities, such as free football and volleyball, to encourage guests to be fit and healthy. There are very limited areas to smoke in the resort - you can’t smoke in rooms, on balconies or by the pool, for example. We also have bikes for hire, we share the local bus timetable and we offer excursions to help guests explore the island, from bird watching in the national park to sampling local wine and cheeses. \n3pm : Three times a week we organise an activity for children called “After beach” - but inside. It helps small children spend time away from the sun, and highlights why it’s important to be aware of the dangers of too much sun. \n4pm : Once a week we offer a tour of the resort, which highlights the measures we are taking to be responsible for the benefit of our guests - for example, we take them to the cleaning department so they can see for themselves that we don’t use harsh chemicals. We find that clients are interested in what we’re doing - especially those from Nordic regions, where it is second nature. Often if we fall down in our mission to act responsibly, it’s the guests who draw our attention to it. \n6pm: We offer guests a range of meal plans, because we think it’s important they have the choice - one of those is the Sunwing package, which includes seven breakfasts, five lunches and five dinners. This gives guests two free days and two free nights to dine outside of the resort, and we will supply recommendations of local restaurants. We also place signs by the buffet telling guests to think about the consequences of filling their plates with more than they can eat - if they take food, but don’t eat it, we can only throw it away. \n10pm : When guests snuggle down, they can rest easy in the knowledge that we have donated old blankets to a local dog sanctuary so they will be having a good night’s sleep too.", "external_links": [], "published": "2015-07-02T11:00:00.000+03:00", "crawled": "2015-07-02T21:25:34.000+03:00", "highlightTitle": ""}