{"organizations": [], "uuid": "ec55c0adc8fb635294ec3adf89154c9b8eb09d1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/travel.html", "section_title": "Travel", "url": "https://www.prbuzz.com/travel/338144-ukairportcarparks-launch-a-campaign-to-teach-consumers-how-to-haggle-with-travel-agents.html", "country": "US", "title": "UKairportcarparks Launch A Campaign To Teach Consumers How To Haggle With Travel Agents", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "UKairportcarparks Launch A Campaign To Teach Consumers How To Haggle With Travel Agents", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "ec55c0adc8fb635294ec3adf89154c9b8eb09d1c"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/travel/338144-ukairportcarparks-launch-a-campaign-to-teach-consumers-how-to-haggle-with-travel-agents.html", "ord_in_thread": 0, "title": "UKairportcarparks Launch A Campaign To Teach Consumers How To Haggle With Travel Agents", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A travel expert has launched a campaign to teach people how to find better deals with travel agents by haggling. The tips are to provide consumers with ways on how to reduce the cost of a family holiday.\nSince the reduction of high street travel agents with Thomson and First Choice joining forces, travel experts have claimed the cost of a family holiday has increased. UK Airport Car Parks, which has launched a number of campaigns to help consumers bring down the cost of a holiday, has now launched a new campaign where they are teaching consumers how to haggle.\nBefore the high street travel agents merged, which includes Thomas Cook merging with the Co-Op and First Choice and Thomson merging, consumers were able to play them off against each other for a better price. However, since the reduction in high street travel agents the big names believed they had the market cornered. Now according to UK Airport Car Parks who help consumers find a better deal on airport car parking and insurance has said high street travel agents are now running scared.\nWith more choices available online with new travel agents being created, the high street travel agents are no longer confident and are now willing to once again compete against their fellow travel agents. Through the tips and advice from UK Airport Car Parks, consumers are now reporting they are saving up to five hundred pounds off a family holiday.\nThe haggling tips ( http://www.ukairportcarparks.co.uk/blog/get-a-better-holiday-deal-by-haggling ) put the consumer back in the driving seat with the travel agents, providing them with important information and tools to bring down the prices of holidays.\nChris Fryer from UK Airport Car Parks said: “Our holiday haggling tips have been a huge success, they are helping consumers save money, but the travel agents don’t like it.”\nHigh Street travel agents and online agents need to sell holidays to make a profit, and due to the wide choice available the advertised price no longer the final price.\nTo learn more about UKairportcarparks.co.uk, and how to save money on parking a car at a UK airport, please visit http://www.ukairportcarparks.co.uk/ or to read the tips on how to have cheaper holidays, please visit http://www.ukairportcarparks.co.uk/blog/get-a-better-holiday-deal-by-haggling/\nAbout UK Airport Car Parks\nUK Airport Car Parks provides car owners with a comparison site that allows them to find secure airport car parks at up to 60% cheaper than the normal price.\nMedia Contact:\nUK Airport Car Parks\nYork, YO1 9RA\n0774 059 4552\nEmail: This email address is being protected from spambots. You need JavaScript enabled to view it.\nWeb: http://www.ukairportcarparks.co.uk", "external_links": ["http://www.ukairportcarparks.co.uk/blog/get-a-better-holiday-deal-by-haggling", "http://www.ukairportcarparks.co.uk/blog/get-a-better-holiday-deal-by-haggling/", "http://www.ukairportcarparks.co.uk/"], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-17T01:41:36.000+03:00", "highlightTitle": ""}