{"organizations": ["Mantra Group Conference", "News Corp Australia", "Daily Telegraph"], "uuid": "c72e366e9101c9432aac843d9ee6ea0e1ef1d4d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/1yOGY2djohBxdQDN484A8vPIdE145Axq/3Gduepif0T1UGY8H4xMDoxOjBtO_wVGe&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-updates/paul-keating-gives-some-tough-love-to-hoteliers/story-e6frfq80-1227443279757?from=public_rss", "country": "IL", "title": "Paul Keating’s tough love to hoteliers", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Paul Keating’s tough love to hoteliers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T15:00:00.000+03:00", "replies_count": 0, "uuid": "c72e366e9101c9432aac843d9ee6ea0e1ef1d4d7"}, "author": "", "url": "http://www.news.com.au/travel/travel-updates/paul-keating-gives-some-tough-love-to-hoteliers/story-e6frfq80-1227443279757?from=public_rss", "ord_in_thread": 0, "title": "Paul Keating’s tough love to hoteliers", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Paul Keating"], "text": "A new film by Tourism Australia is set to show people the diversity of Aboriginal experiences in this country. Daily Telegraph 13 Jul 2015 News Tough love ... Paul Keating delivers a stern message to hotel managers at the Mantra Group Conference at Kingscliff Picture: Jerad Williams/News Corp Australia Source: News Corp Australia \nPAUL KEATING has delivered a trademark kick up the pants to the hotel industry warning operators they were stuck in the 80s and 90s. \nThe former Prime Minister showed he had lost none of his intellectual edge at the annual conference of Australia’s second biggest hotel group Mantra, at Kingscliff in northern New South Wales. Confronting ... Former Prime Minister Paul Keating tells it like it is at the Mantra Group Conference at Kingscliff. Picture: Jerad Williams/News Corp Australia Source: News Corp Australia \nSpeaking after Mantra Group CEO Bob East forecast earnings in excess of $80 million for the year, Mr Keating suggested it was only the weaker dollar that was helping tourism be the “rainbow in the ass” of the economy. \nHe said if operators wanted to attract a bigger share of the booming Chinese travel market, improvement was needed. \n“Chinese visitors aren’t going to come here for hotels and resorts built in the 1980s and 1990s,” said Mr Keating, a long-time supporter of a proposed six-star development at Sydney’s Barangaroo. Valuable ... Chinese tourists Caroline Ou and Pang Ting Ting take selfies on the boat trip to Green Island off Cairns. Picture: Luke Marsden/News Corp Australia Source: News Corp Australia \n“They will drift off to bigger and better things, along the lines of what’s being done in Vietnam. “We will have to lift the bar in terms of the quality of what we have to offer. This will be a challenge for the next five to seven years given incomes in China will continue to rise.” \nMr Keating suggested the issue was not only one for the tourism industry but for the whole country which he suggested, had made little progress since he left politics. \n“Australia’s living off 1980s and 1990s policy changes,” he said. \n“And now we have a political culture that has the ambition of a gnat.” \nThe world economy was also “soggy” and in a depressionary cycle, the likes of which had not been seen since the period from 1974 to 1982. \n“I think tourism is going to be an important contributor to recovery, if we set ourselves up for opportunities coming out of China,” Mr Keating said. Hard line ... The Hon. Paul Keating, Former Australian Prime Minister at Kingscliff. Picture: Jerad Williams/News Corp Australia Source: News Corp Australia \nTourism Australia Marketing Manager Lisa Ronson told the conference Chinese tourists rated Australia highly as an “aspirational” destination. \nHowever we ranked only 15th on a list of countries most visited by Chinese travellers, behind places like Hong Kong, the US, Thailand and Vietnam. \nMs Ronson also revealed how Australia’s beaches and natural attractions are not the tourist drawcard they once were. Big attraction ... The Great Barrier Reef will be a major part of a new international tourism campaign. Picture: Tourism Australia Source: Supplied \nOnline searches for our beaches declined ten per cent in the last year, and only one — Whitehaven in the Whitsundays — made TripAdvisor’s 2015 list of the world’s top 25 beaches. \nMs Ronson said a new campaign being planned by Tourism Australia for later this year would focus on the coastline and waterways, and in particular the Great Barrier Reef. \n“We’re going to invite the world over to our place for a swim,” she told delegates. \nShe stressed the importance of a strong online profile given 70 per cent of pictures on Facebook were “tourism related”. \n“That’s having a big impact on how people decide to go to locations,” said Ms Ronson.", "external_links": [], "published": "2015-07-15T15:00:00.000+03:00", "crawled": "2015-07-15T15:40:11.000+03:00", "highlightTitle": ""}