{"organizations": [], "uuid": "81236997f6885861731501b0e5ec90fccdd6722c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61773/kenya-tourism-board-cranks-activities-president-obama-visit", "country": "US", "title": "Kenya Tourism Board cranks up activities for President Obama visit", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Kenya Tourism Board cranks up activities for President Obama visit", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:39:00.000+03:00", "replies_count": 0, "uuid": "81236997f6885861731501b0e5ec90fccdd6722c"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61773/kenya-tourism-board-cranks-activities-president-obama-visit", "ord_in_thread": 0, "title": "Kenya Tourism Board cranks up activities for President Obama visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya Tourism Board cranks up activities for President Obama visit Adv: \nBy Prof. Wolfgang H. Thome, Ph.D., eTN Africa Correspondent | Jul 24, 2015 Obama and grandmother during previous Kenya visit Adv: \nWith US President Obama’s arrival now less than 24 hours away, the Kenya Tourism Board (KTB) has cranked up their activities, having been closely involved in the preparation of the visit and having all hands on deck for the next couple of days. \nWausi Walya, in charge of Corporate Communications and PR at KTB, last evening shared some insights into what role KTB has been playing in the preparation of the Global Entrepreneurship Summit - #GES2015 – while sharing a media release issued by the organization. \n“We are delighted as a destination to be home to #GES2015 and look forward to rolling out Kenya’s magic to the US President and the delegates. \n“KTB’s involvement in the preparations has been enormous with [the] KTB MD chairing the hospitality team which involves the entire reception process of all the guests at the airport to the hotels and later for the summit at the United Nations Office in Nairobi. Through representation of KTB by KTB PR in the PR and Communication planning team, we delivered 2 media FAM trips for both local and international media. The preparation hours have been long, but we look forward to the gains of the visit and summit in various ways.” \nStart quote: \nKenya’s President Welcomes GES delegates \nNairobi, July 23, 2015 \nKenya’s President Uhuru Kenyatta has outlined the importance of the Global Entrepreneurship Summit (GES) to Kenya and Africa as a whole as he welcomed the delegates. \nAddressing the public at a press conference held at State House His Excellency President Uhuru showcased the opportunities and possibilities that Kenya has to offer as the country prepares to welcome thousands of delegates as well as the President of the United States of America Barrack Obama who will attend the Summit. \n“…it is my pleasure to co-host, with President Obama of the United States of America, the Global Entrepreneurship Summit (GES) in Nairobi this weekend. It (the Summit) connects men and women of imagination and enterprise to their peers around the world. It exposes us all to new opportunities, while teaching us new answers to problems of wide concern,” said President Kenyatta. \nInaugurated in the USA five years ago GES has grown into a global gathering bringing together entrepreneurs, innovators, Government leaders and the youth among others. \nPresident Obama is expected to arrive in Kenya on Friday 24th for the Summit that is expected to attract about 1,400 participants, with a large delegation accompanying President Obama. This is the first time the Summit is being held in sub-Saharan Africa. The choice of Kenya is seen as an acknowledgement of the country’s progress and potential in the continent. \n“Kenya’s reputation for innovation and enterprise is fully deserved. It is our habit to take risks in the hope of bettering ourselves, and our country. Our innovators and entrepreneurs have certainly earned the honour of the summit. We will honour them in our turn if we welcome our guests with our customary hospitality, and if we represent our nation and our continent as well as we are able,” said President Kenyatta. \nThe impact of the Global Enterprennuershio summit on the tourism sector cannot be underestimated, this comes as a major endorsement of Kenya not just as a safe destination but as a maturing economy that many are eager to invest in. “The global exposure that Kenya will receive worldwide through this event will definitely see the destination brand equity rise. The visit lays ground for aggressive marketing strategies that the Kenya Tourism Board is planning for execution and we must not lose the opportunity to market Kenya, said Kenya Tourism Board Managing Director, Muriithi Ndegwa. \nThis comes after lifting of travel advisories thus giving impetus for aggressive marketing in Kenya’s two key traditional markets America and the UK. \nKenya has in the recent months attracted thousands of delegates from across the world as she positions herself as a major investment hub in the region. Other international meetings coming up this year include the World PR Conference in Emerging Economies, ATA, The Magical Kenya Travel EXPO and the Ministerial Conference of the World Trade organisation expected to attract thousands of delegates among others. \nEnd quote \nKenya’s tourism industry over the past two years was a mixed bag of different fortunes. While the MICE sector and business travel into Nairobi prospered and hotels enjoyed reasonable occupancy levels, in particular the Kenya coast has taken a serious hit when anti-travel advisories saw resort occupancies drop to the lowest level in decades, and dozens of hotels had to close. Nearly a dozen visits to the Kenya coast by this correspondent during that timeframe, and it should be stressed not sponsored by KTB so as to allow for an independent assessment of the situation on the ground and service levels in the resorts, revealed conclusively that there was no danger for tourists in the hotels from Malindi to Mombasa and beyond. The tourists spoken with all affirmed they felt safe and secure, enjoyed the attention of staff, the largely organic food on offer, and the attractions. \nSustained to a large degree by domestic and regional travel, coast tourism managed to survive, and the demanding expectations of local tourists kept the resorts on their toes vis-a-vis in-house entertainment and services levels. In fact, the re-opening of the Jacaranda Indian Ocean Beach Resort at Diani and the soft-opening of the Sun Africa Hotels Nyali Resort has shown renewed confidence that the downward trend has bottomed out and that indeed better times are ahead. Coinciding with the removal of sections of the anti-travel advisory by Britain and a softening of the language used has Condor, Germany’s leading holiday airline, announced the addition of a fourth flight to Mombasa and other charter airlines are eyeing a return to Kenya for the upcoming high season. \nSummits like #GES2015, with the American President as co-host and the November visit by Pope Francis will lend new momentum to tourism marketers, and the 40th anniversary congress of the Africa Travel Association, also in November, will return the spotlight to Kenya as one of the African continent’s premier safari and beach destinations. \nAt the same time, preparations are underway for an audit of Jomo Kenyatta International Airport vis-a-vis the coveted Category One status by the Federal Aviation Administration (FAA), which would finally allow for nonstop or direct flights from Nairobi to the United States, a key market for safaris to Kenya and the East African region. \nOptimism is spreading once again through the tourism industry and a successful #GES2015 Summit will no doubt help to show the world that Kenya is a safe place to visit.", "external_links": [], "published": "2015-07-24T03:39:00.000+03:00", "crawled": "2015-07-24T05:01:55.413+03:00", "highlightTitle": ""}