{"organizations": [], "uuid": "00eaa7059713577c81cff90276679ed566904249", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/holidays-in-madikeri-an-experience-not-to-forget.html", "country": "US", "title": "Holidays in Madikeri - an experience not to forget", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Holidays in Madikeri - an experience not to forget", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T09:11:00.000+03:00", "replies_count": 0, "uuid": "00eaa7059713577c81cff90276679ed566904249"}, "author": "Dimpy Roy-2015-07-09T07:11:19-0400", "url": "http://www.articlesfactory.com/articles/travel/holidays-in-madikeri-an-experience-not-to-forget.html", "ord_in_thread": 0, "title": "Holidays in Madikeri - an experience not to forget", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | July 9, 2015 \nMadikeri is a beautiful town in Karnataka. It is one of the most popular tourist destinations in south India and it is visited by hundreds of tourist year-long. The town is most popular for its untouched natural beauty, welcoming people, and the large coffee and tea plantations \n\nBestowed with rich ecology, Madikeri is a beautiful town in the Coorg region of Karnataka state. The town is most popular for being a serene place that was used as a pleasure destination since several centuries. Also known as Mercara, it is just often termed as the \"Scotland of India\" for its unspoilt, uncharted natural beauty. Perched at a height of over 1500 meters above the sea-level, the town is composed of misty hills, dense forests, heavenly waterfalls, marshlands, and grasslands. Besides, the fertile lands are capped with large estates of coffee and tea plantations and the rest are occupied by hotels, resorts, houses, and a market place. \nMadikeri is one of the most-known hill stations in South India. The Kodagu tribes were the original inhabitants and their generations lived their lives in the dense jungles of the region depending solely on the mother nature. With the beginning of the 9th century, the town started to gain prominence as it became a popular pleasure resort of the Coorg kings. The town was the heartland of its rulers that include the Gangas, the Hoysalas, and the Cholas. The Haleri kings were the last rulers of the royal dynasty who reigned the regions. The people of the town proudly called themselves as the children of Kaveri River since long. A number of tributaries of Kaveri river flow through different areas of the town. These tributaries and the river played a significant role in the lives of the local. It is the prime source of water and the locals see the river with great respect and reverence. Every year during the festival of Kaveri Sankramana people from all over India gather at Talakaveri (a locality of the town) and take a holy dip in the river banks. It is believed to be auspicious as doing so washes-off one's lifetime of sins. \nBestowed with all allures of nature, the town is a popular honeymoon destination and ideal for nature-lovers and adventure buffs. There are a couple of sightseeing places, of which the most significant ones include: Raja's Seat, Dubare Elephant Camp, Gaddige Tombs, Abbey Falls, Chelavara Falls, Omkareshwara Temple, Cauvery Nisargadhama, and Madikeri Fort. Appointing a tour guide is the best way to explore the town. Besides, some hotels in Madikeri also offer tour services. \nNot too long ago, agriculture was the prime industry in the town. There exists a long tradition of agriculture amongst the locals. It is still the prime livelihood of the town. There is even a festival based on agriculture celebrated with utmost joy. It is called Kailpodh and is celebrated on every September on the occasion of crop harvesting. The tradition includes men worshiping their agriculture tools and weapons and taking part in several sports and outdoor activities. If one is interested in experiencing the culture of Madikeri, it is the best time to be in the town. \nLodging in Madikeri comes in all budget bracket. For a budget traveller and backpacker the budget hotels in Madikeri are ideal options to pick. Besides, there are a number of cheap as well as luxury hotels in and around the region. \n  from ArticlesFactory.com ABOUT THE AUTHOR \nDimpy Roy, a travel blogger, writes about best hotels in Madikeri for frequent travelers. She writes about places to visit there, things to do, some Bangalore to Jaipur flights also.", "external_links": [], "published": "2015-07-09T09:11:00.000+03:00", "crawled": "2015-07-10T08:47:40.000+03:00", "highlightTitle": ""}