{"organizations": [], "uuid": "35ddc37b4158060d7cb2c29f2b3e8e8f75b005f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelmarketreport.com", "main_image": "", "site_section": "http://www.travelmarketreport.com/rss/articlefeed.ashx?type=0", "section_title": "Travel Market Report RSS Feed", "url": "http://www.travelmarketreport.com/articles/Faith-Based-Travel-A-Growing-Niche?articleid=15926", "country": "US", "title": "Faith-Based Travel: A Growing Niche", "performance_score": 0, "site": "travelmarketreport.com", "participants_count": 0, "title_full": "Faith-Based Travel: A Growing Niche", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "35ddc37b4158060d7cb2c29f2b3e8e8f75b005f0"}, "author": "", "url": "http://www.travelmarketreport.com/articles/Faith-Based-Travel-A-Growing-Niche?articleid=15926", "ord_in_thread": 0, "title": "Faith-Based Travel: A Growing Niche", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barbara Peterson"], "text": "Faith-Based Travel: A Growing Niche by Barbara Peterson / July 07, 2015 \nThe faith-based travel market is growing fast as more destinations and suppliers work with religious organizations to create new products, according to Pam Inman, president of the National Tour Association (NTA).Inman spoke at a recent meeting with the group’s sister organization, the Faith Travel Association (FTA) in New York City. Large groups embarking on pilgrimages or Holy Land tours are usually what come to mind where faith travel is concerned, but Inman said FTA members “are also seeing interest in smaller groups and unique experiences.”Spiritually-motivated travel – whether it’s an “Eat, Pray, Love” style journey or a meditation retreat—is also on the rise. An estimated 25% of all U.S. travelers are interested in taking a spiritual vacation, and the U.S. market is currently about 16 million strong, according to Inman.Worldwide, the figures are impressive: up to 330 million people visit key religious sites each year, according to the World Tourism Organization (WTO). And faith-based tourism contributes $50 billion to $100 billion to the global economy each year. FTA membership The FTA was created in early 2014 by NTA to promote this niche and bring together buyers and sellers actively involved in the market. The group now has about 200 members, nearly 40% of them tour operators, followed by travel agencies, which make up 23.8% of the membership. There were 43 members as of earlier this year. Destinations and suppliers, as well as faith leaders and related advisors, make up the rest the roster. To encourage travel agents to join, the FTA earlier this year added a “travel advisor” category of membership, which gives agents not just the basic individual membership benefits – like access to programs and member discounts -- but lets them create an online, searchable profile on the association’s website. In all, FTA members handle about 2.5 million travelers a year, with total annual sales averaging more than $20 million.As an example of the diversity of the group, the newest members range from the Hard Rock Café in Nashville to the Billy Graham Library in Charlotte, N.C., according to the FTA website. Church programs Some 50,000 U.S. churches have travel programs, and that includes a wide range of possibilities, such as service-based or mission trips, religious conferences, and youth group outings. Several trends cited by Inman could help members develop their faith business, including an increase in multi-faith tours to promote greater understanding among different religions.Another trend is the growing number of independent travel options that can be combined with a faith itinerary. An example: a mission trip, with pre- and post-tour packages so that participants can experience a destination in a different way. Pilgrimages continue to the biggest draw, with 87% of FTA’s members reporting interest in that type of trip, followed by leisure and mission trips. FTA members said they work with a range of faiths, including Catholic, Protestant, Jewish and Muslim groups. 0", "external_links": [], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T04:22:50.000+03:00", "highlightTitle": ""}