{"organizations": [], "uuid": "31b7ad0f3d19a9bb5c825bdec3ca1878fc3530b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources3.news.com.au/images/2015/07/03/1227426/891259-133e99ea-211d-11e5-bfd8-23d4937b5704.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/australian-holidays/australias-best-burger-spots-named/story-e6frfq89-1227426892132?from=public_rss", "country": "IL", "title": "Found: Australia’s best burgers", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Found: Australia’s best burgers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T08:57:00.000+03:00", "replies_count": 0, "uuid": "31b7ad0f3d19a9bb5c825bdec3ca1878fc3530b9"}, "author": "", "url": "http://www.news.com.au/travel/australian-holidays/australias-best-burger-spots-named/story-e6frfq89-1227426892132?from=public_rss", "ord_in_thread": 0, "title": "Found: Australia’s best burgers", "locations": ["Coolangatta", "Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What are these? Yum! Coolangatta’s Burger Lounge has the best burgers. Picture: TripAdvisor Source: Supplied \nFORGET fast food chains. A list of the best places to chomp down on a burger around the nation has been released by TripAdvisor, and it has unwrapped some hidden gastronomic gems. \nThe winner out of the lot was the Burger Lounge in the coastal Queensland town of Coolangatta, which made a whopping impression with its delicious offerings. \nIn fact, the list was dominated by the sunshine state which scored six out of the 10 spots. Shockingly, NSW, the Northern Territory, ACT and Western Australia all failed to impress, without a single mention on the list. \nYOUR SAY: Where is Australia’s best burger? Tell us below \nStandout burgers on the list include the monster 1.8 kilogram “Phat Bastard Burger” found at Long boards Laidback Eatery & Bar in Surfers Paradise, or if that doesn’t hit the spot you can snap up the Crickey’s Burger, which is made of crocodile meat, at Off The Track in Port Douglas. \nThe rankings were determined according to reviews and opinions submitted on the site, taking into account the quality, quantity and ratio of the reviews submitted over an 18-month period. \nSo here’s the full list of winners, and what visitors had to say about them. \nThe top 10 list: \n1. Burger Lounge, Coolangatta, Queensland \nHome to the best American style hamburgers in the nation, make sure you order the buffalo wings as a side. \n2. Off The Track, Port Douglas, Queensland \nIt may be off the beaten track, but it’s worth the detour, with its offerings including the Texan Burger and the Crickey’s Burger made of crocodile meat. Get off the beaten track and find some delicious rewards. Picture: TripAdvisor Source: Supplied \n3. Long boards Laidback Eatery & Bar, Surfers Paradise, Queensland \nThere are 20 burger options here including the bluntly named, giant “Phat Bastard Burger”. A huge meal at Longboards. Picture: TripAdvisor Source: Supplied \n4. The Burger Bar — Noosa, Queensland \nVegans, vegetarians and meat lovers will all be satisfied here. The Burger Bar will appeal to all. Picture: TripAdvisor Source: Supplied \n5. The Bottle of Milk — Lorne, Victoria \nLocated along the Great Ocean Road, it’s worth the stop over. Everything is so fresh, and don’t forget to try a milkshake. Fresh is best at The Bottle of Milk. Picture: TripAdvisor Source: Supplied \n6. Nosh Express, Noosa, Queensland \nThis gem is located on the popular Hastings Street in Noosa. A favourite is the New York Burger, and their salads are worth a try. \n7. Betty’s Burgers & Concrete Co. — Noosa, Queensland \nAlso found on Hastings Street, grab a classic Betty burger with Angus beef and special sauce, and leave room for a homemade desert such as waffles or apple pie. Homemade goodness at Betty’s Burgers. Picture: TripAdvisor Source: Supplied \n8. Nordburger — Norwood, South Australia \nLocated on the Parade in Adelaide, Nordburger offer’s the fusion of an America cheeseburger with a basket of Buttermilk fired chicken tenderloins. Oh, and there’s also chilli chips with beef pieces and topped with cheese. Don’t forget to order the chilli chips at Nordburger. Picture: TripAdvisor Source: Supplied \n9. Georges Hamburger Shop — Bairnsdale, Victoria \nWhile it’s not a gourmet place, Georges does good old fashion hamburgers and is loved by locals. \n10. 8bit — Melbourne, Victoria \nLocated in Footscray and themed in circa 80s arcade video games symbol, 8bit serves fine hamburgers, milkshakes fries and hotdogs. And if you’re feeling ravenous, there’s the Double Dragon which includes double beef, double cheese, double bacon, pickles, mustard, lettuce and topped with 8bit sauce. 8bit is more than a bit delicious. Picture: TripAdvisor Source: Supplied \nSo, hungry yet?", "external_links": [], "published": "2015-07-03T08:57:00.000+03:00", "crawled": "2015-07-04T01:37:03.000+03:00", "highlightTitle": ""}