{"organizations": [], "uuid": "2efcb1989f62bb0d94837be134e47900627c57db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/13268d58-2764-11e5-9d07-9c047a8d6084.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/seattle-news/environment/as-wolves-settle-in-the-states-cougars-to-pay-price/", "country": "EU", "title": "As wolves settle in, state OKs hunting more cougars", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "As wolves settle in, state OKs hunting more cougars | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T00:47:00.000+03:00", "replies_count": 0, "uuid": "2efcb1989f62bb0d94837be134e47900627c57db"}, "author": "Sandi Doughton", "url": "http://www.seattletimes.com/seattle-news/environment/as-wolves-settle-in-the-states-cougars-to-pay-price/", "ord_in_thread": 0, "title": "As wolves settle in, state OKs hunting more cougars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Conservation groups are challenging new rules that expand cougar hunting in some parts of the state, arguing that the Washington Fish and Wildlife Commission disregarded scientific studies that show increased harvests don’t reduce cougar populations and can actually lead to more conflicts between the big cats and their human neighbors.\nA petition filed June 30 by the Humane Society of the United States, Conservation Northwest and seven other groups says the commission also adopted the change with no opportunity for public comment.\nIn some areas, the new rules would nearly double the number of cougars that could be killed, said Gary Koehler, former director of carnivore research at the Washington Department of Fish and Wildlife (WDFW) and a party to the petition.\n“It’s a totally political decision,” he said. “The commission is ignoring the science.”\nMost Read Stories But Commissioner Miranda Wecker , who proposed the change, said the higher harvests won’t have a deleterious effect on cougar populations.\nThe higher quotas apply only in areas where wolves are also present and are meant to provide a kind of “relief valve” for rural communities that are now sharing their environment with two major predators, Wecker said.\n“If it just makes people feel a little better, that they are more in control … and that they have influence over management decisions that affect their lives, I think that can be a good thing,” she said, “as long as we’re protecting the state’s interest in the overall health of these (cougar) populations.”\nWashington is now home to almost 70 wolves living in 16 separate packs , mostly in the northeast corner of the state. But the return of wolves, greeted by many as an environmental-success story, has caused fear, anger and resentment among some of those who live in closest proximity to the animals and have to deal with their occasional attacks on sheep and cattle. Last week, wildlife officials confirmed that wolves killed two cows near Chewelah, in Stevens County.\n“The recovery of wolves is not a harmonious process in our state,” Wecker said. “It’s the most intense natural-resource conflict I’ve ever seen in my life.”\nAs a protected species, wolves can’t be hunted in Washington. But the hope is that allowing more cougar hunting will reduce concerns about predators in general, she added.\nThe move is not a response to a spike in problems with cougars. In fact, complaints about the animals venturing into yards or attacking pets or livestock have been declining for several years, said WDFW Assistant Director Nate Pamplin.\nTo Koehler, who was involved in much of the relevant cougar research, that makes it look as if the felines are being targeted for no legitimate reason.\n“I think the bottom line is, they couldn’t do anything to address wolves specifically, so let’s take it out on the cats,” he said.\nThe latest cougar research reaches several conclusions that seem counterintuitive and which question old approaches to predator management, Koehler explained. Studies in northeast Washington, where a temporary program allowed hunters to kill nearly a quarter of the cougars, found that the total number of animals didn’t drop, nor did the complaints.\nThat’s because the territorial cats normally space themselves across the habitat, displacing young animals and chasing out competitors, Koehler explained. But when hunters kill a lot of adults, young cougars that would have migrated out of the area simply take their place.\nAnd other research suggests that an influx of younger cougars, particularly males, can result in more conflicts with humans as the animals jockey for territory and food and venture into places adults have learned to avoid — like yards and pastures.\nThe WDFW took much of that evidence into consideration in developing its proposed cougar-hunting rules, which called for harvest levels of no more than 16 percent of local populations. “We didn’t want the harvest to exceed a point where you’re causing turmoil or disruption in the social organization of cougars,” Koehler said.\nBut the commission overrode that proposal, extending the season by one month and allowing harvest levels up to 21 percent where cougars and wolves coexist. For small areas where the old quota was four to six animals, for example, the increase could translate into the potential for nearly twice as many cougars to be shot.\n“If you’re removing two to three additional cats, you’re having a significant impact on the social structure in that area,” Koehler said.\nWDFW didn’t object to the commission’s change, Pamplin said, because its biologists believe the impact on the cougar population will be negligible. And while the evidence is solid and well-accepted that hunting is not an effective way to reduce cougar numbers, Pamplin said he and others at the agency are not as convinced that heavy hunting can increase human-cougar conflicts.\nIn the affected areas, the number of cougars that can be killed will be raised from a maximum of 85 to 110 — a difference of only 25 animals. In 2014, hunters killed 158 cougars statewide, out of an estimated population of 1,800 to 2,000 adults.\nJack Field, executive vice president of the Washington Cattlemen’s Association , said the new cougar quotas are a step toward a more holistic approach to predator management — something his group has been pushing for.\n“We can’t just let predators grow exponentially, unchecked,” he said. And it’s also important to ensure that wolves and cougars don’t collectively kill so many deer and elk that it limits opportunities for hunters, he added.\nIn response to an early outcry over the new rules, which were adopted in April, the commission has already agreed to enforce the higher quotas for only one year, instead of three years as originally planned, Wecker said. The impact of the change would then be analyzed before any decision on subsequent years.\nThe petition seeks to have the old rules reinstated immediately.\nThe commission will consider the petition during a conference call Aug. 21, which the public can listen in on. The commission can accept, reject or offer an alternative to the petition, Wecker said.\nWhatever the outcome, the commission will certainly take a closer look at the new evidence about cougars and hunting in the near future, she added.\n“We just haven’t had a chance yet to sit down with staff and discuss it.”\nStaff reporter Justin Mayo contributed to this report. Sandi Doughton: 206-464-2491 or sdoughton@seattletimes.com", "external_links": ["https://www.documentcloud.org/documents/2163787-doeshuntingreg-cougar.html", "https://www.documentcloud.org/documents/2163788-beausoleil-et-al-2013-cougar-mgmt-wsb299-2.html", "http://wdfw.wa.gov/conservation/gray_wolf/", "http://wdfw.wa.gov/about/regulations/2015/wsr_15-10-066.pdf", "http://www.washingtoncattlemen.org/", "http://wdfw.wa.gov/commission/", "https://www.documentcloud.org/documents/2163786-peeblescougarhuntingplosone.html", "http://wdfw.wa.gov/commission/meetings.html", "http://wdfw.wa.gov/living/dangerous/reports/index.php?species=&#038;county=&#038;year", "https://www.documentcloud.org/documents/2163783-hsus-et-al-rulemaking-petition-2.html", "http://wdfw.wa.gov/commission/bios/wecker.html"], "published": "2015-07-12T00:47:00.000+03:00", "crawled": "2015-07-12T06:12:07.000+03:00", "highlightTitle": ""}