{"organizations": [], "uuid": "2e47afdfdd988bb7a52053c661ca2ef14a6f41a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03383/yorkshiretea_bisho_3383513a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-24.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/sport/cricket-tea-challenge/11755187/bishop-thornton-cricket-tea.html", "country": "US", "title": "T20 victory no cakewalk for Bishop Thornton", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "T20 victory no cakewalk for Bishop Thornton - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T20:49:00.000+03:00", "replies_count": 0, "uuid": "2e47afdfdd988bb7a52053c661ca2ef14a6f41a4"}, "author": "Gareth A Davies", "url": "http://www.telegraph.co.uk/sponsored/sport/cricket-tea-challenge/11755187/bishop-thornton-cricket-tea.html", "ord_in_thread": 0, "title": "T20 victory no cakewalk for Bishop Thornton", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more about the Great Cricket Tea Challenge The cows in the fields around the cricket ground in Bishop Thornton, a small village in the Yorkshire Dales, is one reason why the club is one of the six finalists in the Yorkshire Tea Great Cricket Tea Challenge: Some of that milk is put to very good use when the cricketers stop for tea. The club’s dedicated and hard-working players brought a lot of other wonderful ingredients to the table as well when Telegraph food writer Xanthe Clay and I came to judge their cricket tea. Club chairman Julian Potter explained that it is very much a team effort when it comes to making teas. He says: “Every week each player is responsible for making enough food for two people. That way there is enough for everyone. “It is lovely to see all the home-made sandwiches, pies, cakes together to make one big delicious tea. The one thing that never changes and brings it all together is a batch of strong Yorkshire Tea, made with milk from local cows.” On Saturdays, John Atkinson, the groundsman – known as \"Baldrick\" – and his brother Martin bring milk from those cows to the ground. The club’s two teams comprise farmers, farmhands, students and schoolboys, who work all week to play on a Saturday, and in a midweek league. “We don’t have matching kits,” says Mr Potter. “Lads turn up in overalls covered in cow pat, we get laughed at, but they are strong Yorkshire lads and pull off amazing victories over huge clubs.” The facilities are sparse: there are no covers, no practice nets and the sightscreens are falling apart. But the spirit – like the tea – is strong Bishop Thornton CC had an unusual beginning 199 years ago, when a team of four took on nearby Knaresborough in November. Not surprisingly, only 45 runs were scored. The grass was so long there was an all-run six just off the square as players searched for the ball. On the day we visited, history was being repeated with a Twenty20 match against Knaresborough. The facilities are sparse: there are no covers, no practice nets and the sightscreens are falling apart. But the spirit – like the tea – is strong. Jake Atkinson, a member of the XI, whose family runs the Elite Meat shop, arrived armed with a bag of pork pies. “We don’t have a huge amount of money, or facilities,” says Mr Potter. The T20 match was a thriller. Knaresborough posted a competitive 164 for seven, and Bishop Thornton CC got there (168 for seven) with eight balls to spare. “So many of us are so busy on the farms that to be committed to cricket for a day and a half a week means you are giving time up at work,” explains Paul Sowray, a former club captain. “But we all do it because we are Yorkshiremen, we love cricket, and we are part of a great community.” Beccie Deighton, assistant brand manager at Yorkshire Tea, says: “Bishop Thornton CC stood out when selecting the final six clubs for this year’s Great Cricket Tea Challenge because of the players’ commitment to the game and to the tea, heading straight from the farm armed with milk fresh from the local cows. \"The team spirit involved is a proper way to do tea.”", "external_links": [], "published": "2015-07-24T20:49:00.000+03:00", "crawled": "2015-07-24T17:30:31.609+03:00", "highlightTitle": ""}