{"organizations": [], "uuid": "afa8e86eb3d760ed5ce46cd5746a6e72ef18bdd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/0718/20150718__franklin~p1.jpg", "site_section": "http://www.denverpost.com/travel", "section_title": "Travel - The Denver Post", "url": "http://www.denverpost.com/olympics/ci_28505425/missy-franklin-swim-her-first-major-meet-professional-at-world-championships", "country": "US", "title": "Missy Franklin to swim her first major meet as a professional at the world championships", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Missy Franklin to swim her first major meet as a professional at the world championships - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T20:01:00.000+03:00", "replies_count": 0, "uuid": "afa8e86eb3d760ed5ce46cd5746a6e72ef18bdd1"}, "author": "John Meyer", "url": "http://www.denverpost.com/olympics/ci_28505425/missy-franklin-swim-her-first-major-meet-professional-at-world-championships", "ord_in_thread": 0, "title": "Missy Franklin to swim her first major meet as a professional at the world championships", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Something about Missy Franklin seemed different to longtime club coach Todd Schmitz after she turned pro this past spring and returned to train with him in Denver after two years at the University of California.\nThe star of the 2012 Olympics still shone with the sparkling exuberance and innocence that made her America's teen darling at the London Games, where she won four gold medals, but Schmitz sensed she didn't have the same confidence in her swimming.\n\"It was real evident right away,\" Schmitz said last week.\nIt might have stemmed from her experience at the most important meet of 2014, the Pan Pacific Championships in Gold Coast, Australia, where she won only one medal (bronze) in an individual event after suffering an attack of debilitating back spasms two days before the meet. She was fortunate her back allowed her to compete at all after nearly constant emergency physical therapy.\nSchmitz sensed something was missing when he watched her perform in March at the NCAA championships, where she won three individual events and led the Cal women to the team title in her last amateur meet.\nAdvertisement \"It just wasn't the same confidence she had before,\" said Schmitz, who began coaching Franklin with the Colorado Stars when she was 7. \"Missy's never been cocky, but she's been confident, and I didn't see that, even in the NCAAs. She swam really well, but I didn't see the same kind of fire that I used to see. That's what my goal was, to rekindle that. I knew, having coached Missy so long, that if she truly is having fun and believes in herself, then the sky's the limit.\"\nFranklin leaves Tuesday for a U.S. training camp in Croatia in preparation for this year's most important meet, the FINA world championships Aug. 2-9 in Kazan, Russia. World championships take on added significance the year before an Olympics, but Franklin is guarded about her goals.\n\"I'm going to have a little bit more of an open mind than usual because of everything that's been going on the past couple months,\" Franklin said before a two-hour workout Tuesday. \"I really feel like we're doing good things here, and that I'm going to be in a really good place going in.\"\nSince the NCAA championships, Franklin turned pro, hiring WME-IMG to represent her and signing with Speedo as a major sponsor. Deciding whether to remain in California to train with her college coach, Teri McKeever, or return to Schmitz in Colorado was \"the hardest decision\" she has ever made.\nMissy Franklin trains at CCCS Swimming Pool in the Lowry neighborhood on Tuesday, July 14, 2015. Olympian Missy Franklin, who recently left college and turned pro and returned to her high school coach Todd Schmitz. ( AAron Ontiveroz, The Denver Post ) \"I had planned on staying at Cal,\" Franklin said. \"That's kind of where my life is now. That's where all my friends are. That's where Teri is. I turned professional, signed with my agent — which has been awesome — but I started to realize the kind of expectations that I was going to have on me and the kind of obligations I was going to have now as a professional athlete. After a lot of conversations and talking to a lot of people, I just felt like I was going through not just a swimming transition, but a life transition. I really felt like doing that at home, where I was surrounded by people I've been surrounded with my whole life — being back with my mom and my dad most importantly — would be the best option for me.\n\"But it's been incredibly hard, because all of my friends are out in California. It's been wonderful seeing old high school friends for the summer, so being able to spend time with them has been so special. But it's hard because I feel like I have two homes now, and I've kind of had to choose.\"\nFranklin's results at the Pan Pacs last summer were hardly her fault, but the scary incident showed her how an untimely injury can ruin a year of hard work in an instant. It was the first injury of consequence in her career.\n\"Two days before the meet started, I went to do a backstroke start and my entire spine locked up and I went into spasm,\" Franklin said. \"I couldn't get out of the pool. Two people had to lift me out. I couldn't walk. I was lying on a table for an hour at the pool, trying to figure out how on earth I was even going to get in a car to get back to the hotel. I thought I was going to have to go to a hospital. I didn't even know what was happening to my body. I couldn't move. That's just terrifying. I'm supposed to race in two days, and I can't move. How am I going to do this?\"\nShe spent most of the next 48 hours in therapy, but she needed to race if at all possible because the results of the meet would determine the U.S. team at this year's worlds.\n\"Definitely the first road bump in my career, but at the end of the day I qualified in all four events that I needed to for worlds,\" Franklin said. \"That's what matters most.\"\nFranklin has a \"huge comfort level\" with Schmitz. His first day as a Colorado Stars coach 13 years ago was her first day with the club. But their relationship is different from what it was when she left for Cal two years ago after graduating from Regis Jesuit.\n\"I really wanted him to realize, I'm not coming back as a 17-year-old,\" Franklin said, adding that Schmitz was understanding. \"I'm coming back as a 20-year-old who has experienced two years of college, who has been on her own, has really been able to develop as a woman and as a person and found this sense of independence. That means the relationship is going to be a little bit different. We really do have this partnership now, and we're really able to communicate well. He knows I know my body a lot better than I did, I know myself a lot more. He's always there to listen, and takes everything I say to heart. We're really able to work on it together.\"\nFranklin hit the peak of her training volume last week, churning out 49,000 meters (more than 30 miles) spread over nine workouts. The taper for world championships began Saturday.\n\"The goals are kind of between Missy and I,\" Schmitz said of worlds. \"Obviously to have a better performance than last summer. Just building on her confidence and getting her back into a place mentally and physically that she's strong and she believes that she's strong and she believes that she can perform. I truly believe, (if) she gets back mentally in the right spot, then physically it's going to be there.\"\nJohn Meyer: jmeyer@denverpost.com or twitter.com/johnmeyer", "external_links": ["http://extras.mnginteractive.com/live/media/site36/2015/0718/20150718__franklin~p1.jpg"], "published": "2015-07-19T20:01:00.000+03:00", "crawled": "2015-07-19T09:42:01.851+03:00", "highlightTitle": ""}