{"organizations": [], "uuid": "2839a966b1d944942a4dda5dd791d70e00371788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03351/family-nature-hike_3351792a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-24.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/why-not/11695364/family-hiking-trails-entertain-kids.html", "country": "US", "title": "Hiking trails: 12 ways to keep kids entertained", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Hiking trails: 12 ways to keep kids entertained - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T22:36:00.000+03:00", "replies_count": 0, "uuid": "2839a966b1d944942a4dda5dd791d70e00371788"}, "author": "Felix Lowe", "url": "http://www.telegraph.co.uk/sponsored/why-not/11695364/family-hiking-trails-entertain-kids.html", "ord_in_thread": 0, "title": "Hiking trails: 12 ways to keep kids entertained", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "#WhyNot get moving by going on a nature hike? Prise your kids away from the screen and go on a family ramble, because nothing quite beats spending quality time together in the great outdoors. The UK has its fair share of rolling hills, grassy meadows, jagged coastlines, parks, woods, rivers, caves, mountains and forests – all with their unique nature and wildlife that changes with each and every season. A nature walk will engage children with their natural environment and give them exercise Rain and bad weather are no excuse to stay indoors: what are wellies and waterproofs for? And if you live in a big city such as London, Manchester or Birmingham, there is no shortage of green spaces, trails and parks easily reachable by public transport. A walk on the wild side will engage your children with their natural environment and give them – and you – some exercise. All in all, it will be a great family bonding session. But even the most curious of children will need to be distracted – so here are some tips on how to keep your tearaways entertained during a nature trail. 1. Stop, look and listen How many birds can your children hear in 60 seconds? If they close their eyes, what other sounds can they hear – the running of water, wind in the leaves, tap-tapping of woodpeckers, the moo of a cow perhaps? 2. Engage all the senses It's not just looking and listening – but smelling, feeling and (within reason) tasting. Compare the aroma from crushed pine needles and torn wild garlic leaves. In the right season, you can pick blackberries and raspberries as well. And can they distinguish the feel of various tree barks? 3. Scavenger hunt Children love games and competitions, so why not give them a list of things to tick off on a checklist? Anything from feathers to four-leaf clovers, worms to snails, bird nests to rabbit holes. Either be specific or relaxed – such as something bumpy, smelly, wet, small, big, sharp, round, squishy, soft, rough, smooth... Make things more interesting by offering different points based on the likelihood of discovery. 4. Give me five As you are walking along, ask your children to name five types of tree species, furry animals, creatures with wings, types of cloud or fish. 5. Signs of wildlife While you may not be able to see squirrels, rabbits and deer all the time, you should be able at least to spot evidence of their presence. Get your children to look out for holes, nests, fur, feathers, moss, gaps in hedges, footprints in the mud, mole hills, marks on tree bark. Get them to look out for evidence of humans as well – a fun way of teaching them about the positives and negatives of man's interaction with nature. 6. ABCs Take it in turns identifying things along the trail starting with the letters of the alphabet, in order. For example: ants, bark, cows, dew, eggs... 7. 20 questions Someone chooses something they have seen and the others must guess by asking questions requiring only the answers “yes” or “no”. 8. Rainbow colours Try to identify in nature things of every colour of the rainbow. 9. Give them a camera Encouraging your children to take photos of what they see will keep them entertained and engage their creative side. And looking back at the pictures later on may make them eager to return on another walk. 10. Exploit the seasons In springtime look out for bluebells, daffodils, snowdrops and blossom; in summer, perhaps bees and roses; in autumn your children can collect conkers for a game later on; in winter there is mistletoe and holly. Make the most of these seasonal changes to keep their interest piqued. 11. Pick a leader and rotate Let each of your children lead the way for a period during the walk – the sense of empowerment will keep them excited and on their toes. 12. Never-ending story Tell a collective tale with everyone adding a fresh sentence each time. This game is probably best kept for the drive home after you have had – hopefully – a cracking countryside ramble. ADVERTISEMENT The joy of movement Whether you’re pushing your body to its limits or just enjoying the great outdoors, trying new activities can sometimes lead to aches and pains. Voltarol relieves pain at its source and reduces inflammation, which speeds up recovery — so you can enjoy moving again. Visit www.voltarol.co.uk/keep-moving to find out how Voltarol can help you enjoy the freedom of movement in your life. Voltarol® Pain-eze emulgel® for the relief of pain and inflammation. Contains diclofenac diethylammonium. Always read the label.", "external_links": [], "published": "2015-07-24T22:36:00.000+03:00", "crawled": "2015-07-24T17:25:38.340+03:00", "highlightTitle": ""}