{"organizations": [], "uuid": "6da22ba1d77cf32fa94250562473e05d7900ce06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/news/us-airline-consolidation-has-led-to-higher-fares-report/ar-AAcXXy5", "country": "US", "title": "U.S. airline consolidation has led to higher fares: report", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "U.S. airline consolidation has led to higher fares: report", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "6da22ba1d77cf32fa94250562473e05d7900ce06"}, "author": "David Koenig And Scott Mayerowitz - The Associated Press", "url": "http://www.msn.com/en-us/travel/news/us-airline-consolidation-has-led-to-higher-fares-report/ar-AAcXXy5", "ord_in_thread": 0, "title": "U.S. airline consolidation has led to higher fares: report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "U.S. airline consolidation has led to higher fares: report The Financial Times 13 hrs ago David Koenig And Scott Mayerowitz - The Associated Press\n© Provided by Financial Times DALLAS — The wave of consolidation that swept the U.S. airline industry has markedly reduced competition at many of the nation’s major airports, and passengers appear to be paying the price in higher fares and fees, an Associated Press analysis has found.\nOver the past decade, mega-mergers reduced nine large U.S. airlines to four — American, United, Delta and Southwest — with the result that travellers are increasingly finding their home airport dominated by just one or two players.\nOver the same period, domestic airfares rose faster than inflation, and analysts believe one leading factor is the decline in competitive pressure.\n“Airlines aren’t going at each other like they used to,” said Mike Boyd, an aviation consultant frequently hired by airports. “They have their turf, and they very rarely go to the mattresses with one another.”\nAt 40 of the 100 largest U.S. airports, a single airline controls a majority of the market, as measured by the number of seats for sale, up from 34 airports a decade earlier. At 93 of the top 100, one or two airlines control a majority of the seats, an increase from 78 airports, according to AP’s analysis of data from Diio, an airline-schedule tracking service.\nOverall, domestic fares climbed 5 per cent over the past 10 years, after adjusting for inflation. And that doesn’t include the $25 checked bag fee and other add-on charges that many fliers now pay.\nTo be sure, other factors have contributed to higher fares, among them a stronger economy, longer average flight distances and, for most of the past few years, some of the highest fuel prices in history. However, analysts believe consolidation freed airlines to charge more.\nThe strategy is paying off: In the past two years, U.S. airlines made a record $19.7 billion in profits, even though air travel is growing only modestly.\nThe airlines’ main trade group, Airlines for America, said the fare increases reflect stronger demand for travel and are not solely a result of the mergers. The group noted that airlines have used their profits to buy new jets and update airport facilities.\nAmerican Airlines CEO Doug Parker rejected the notion that consolidation has hurt travellers.\n“We have increased flying out of each of our hubs,” Parker said. “We want to expand. That’s good for consumers, not bad.”\nThe Justice Department notified the four largest airlines on June 30 that it is investigating whether they are colluding to drive up fares by limiting the availability of flights and seats. Those four control more than 80 per cent of the U.S. market.\n ", "external_links": ["http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAcXXy5%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAcYaas.img&description=Provided+by+Financial+Times", "http://www.ft.com/"], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T17:30:42.000+03:00", "highlightTitle": ""}