{"organizations": ["U.S. News", "Colorado Technical University", "Navy", "U.S. News & World Report", "CTU", "Best Online Programs For Veterans U.S. News & World Report Ranks Colorado Technical University", "U.S. News & World", "U.S. News & World Report Ranks Colorado Technical University"], "uuid": "1ae26c71a8cf4790bc7047a238cd30da80e3282b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_10_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13236755/1/us-news-world-report-ranks-colorado-technical-university-among-the-2015-best-online-programs-for-veterans.html?cm_ven=RSSFeed", "country": "US", "title": "U.S. News & World Report Ranks Colorado Technical University Among The 2015 Best Online Programs For Veterans", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "U.S. News & World Report Ranks Colorado Technical University Among The 2015 Best Online Programs For Veterans", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T22:00:00.000+03:00", "replies_count": 0, "uuid": "1ae26c71a8cf4790bc7047a238cd30da80e3282b"}, "author": "", "url": "http://www.thestreet.com/story/13236755/1/us-news-world-report-ranks-colorado-technical-university-among-the-2015-best-online-programs-for-veterans.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "U.S. News & World Report Ranks Colorado Technical University Among The 2015 Best Online Programs For Veterans", "locations": ["America", "Colorado Springs"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kurt Johnson"], "text": "U.S. News & World Report Ranks Colorado Technical University Among The 2015 Best Online Programs For Veterans By Business Wire | 07/29/15 - 03:00 PM EDT Reprint Colorado Technical University (CTU) is proud to announce it has been ranked by U.S. News & World Report on three 2015 Best Online Programs for Veterans lists. CTU was included in the Best Online Graduate Computer Information Technology Programs for Veterans, the Best Online Graduate Criminal Justice Programs for Veterans, and the Best Online Bachelor's Programs for Veterans lists. U.S. News released its third annual rankings of the Best Online Programs for Veterans to provide a resource for service members and veterans interested in pursuing their education online. With the number of students pursuing their higher education on the rise, online degree programs are a flexible and reputable way for military students to pursue a degree at an accredited university - like CTU. \"Service members have made incredible sacrifices for our country. With this in mind, CTU strives to provide these students with flexible, industry-relevant degree programs that fully recognize the college credit value of military experience,\" said Kurt Johnson, retired Navy officer and Director of Military Strategy and Relations at Colorado Technical University. \"Our goal is to educate military students in a flexible, technology-driven environment and enable them to thrive in the next phase of their lives.\" Competitive Standards for Selection U.S. News carefully considers several criteria in compiling the 2015 Best Online Programs for Veterans lists, including important factors for America's veterans like affordability, accessibility, and reputation. CTU, which was founded in Colorado Springs in 1965 to serve the needs of five nearby military bases, has a 50-year history of supporting America's heroes in the classroom - and the community. Today, CTU meets the modern needs of military service members, veterans, and their families with: Reduced tuition rates for active duty and spouse students, scholarships for veterans and spouse students, and waived fees for books and materials Transfer credit policies that help students earn college credit for military training and service Specially-trained admissions advisors, military education benefits specialists, and career coaches who are experienced in utilizing military benefits and transitioning to civilian work Flexible learning options so students can study online, on campus, or a combination of both Institutions included in the 2015 Best Online Programs for Veterans list also needed to be included in the top 75 percent of schools ranked in the 2015 Best Online Programs rankings. CTU was recognized for its online bachelor's degree programs and placed 18 th for master's degrees in computer information technology and 22 nd for master's degrees in criminal justice. A Recognized Military Educator When evaluating CTU's reputation, U.S. News & World Report also considered the extent to which the institution's military commitment extends beyond its student body. One such example is CTU's Annual Wounded Warrior Scholarship, now in its eighth year. The program awards fifty full-tuition scholarships to wounded service members and veterans or the spouses or caregivers of wounded soldiers. 1 of 3", "external_links": [], "published": "2015-07-29T22:00:00.000+03:00", "crawled": "2015-07-29T22:24:14.755+03:00", "highlightTitle": ""}