{"organizations": [], "uuid": "b2618cc72178df5c45bf3d98dd2f0444dd336618", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150707Pope.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/07/07/pope-urges-better-care-for-the-amazon-political-dialogue-in-ecuador", "country": "US", "title": "Pope urges better care for the Amazon, political dialogue in Ecuador", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Pope urges better care for the Amazon, political dialogue in Ecuador", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T07:32:00.000+03:00", "replies_count": 0, "uuid": "b2618cc72178df5c45bf3d98dd2f0444dd336618"}, "author": "Jill Replogle", "url": "http://www.ticotimes.net/2015/07/07/pope-urges-better-care-for-the-amazon-political-dialogue-in-ecuador", "ord_in_thread": 0, "title": "Pope urges better care for the Amazon, political dialogue in Ecuador", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pope urges better care for the Amazon, political dialogue in Ecuador Santiago Piedra Silva and Kelly Velasquez | AFP 1 hour ago From: To: \nPope Francis is greeted by a crowd as he rides through the Ecuadorean capital, Quito, on July 7, 2015. Juan Cevallos/AFP \nQUITO , Ecuador — Pope Francis called for dialogue on Tuesday in front of nearly one million people at an outdoor mass in Ecuador’s capital, before launching an appeal for better care of the Amazon. \nThe pope addressed approximately 900,000 faithful who braved the cold and rain to hear his homily in Bicentennial Park, Quito — a city recently rocked by anti-government protests. \nThe Argentine-born pontiff focused his message on “our revolution,” the need to spread the Roman Catholic faith. \n“The enormous richness of variety … moves us away from the temptation of offers that are closer to dictatorships, ideologies or sectarianism,” said Francis, the first Latin American pope. \n“Fight for inclusion at all levels,” he implored, while pleading for “dialogue” on the third day of a South American tour that will also take him to Bolivia and Paraguay. \nLater, in a meeting with social organizations — including indigenous peoples opposed to oil extraction on their lands — the pope stressed the important role the Amazon plays in the “global ecosystem” and said that its “enormous diversity” requires particular care. \n“Ecuador – together with other countries with Amazonian land — has a chance to practice the teachings of integral ecology,” he said. \nThe pope, recalling his encyclical last month which appealed for quick action against climate change, called Tuesday for the Earth to be left a better place for future generations. \n“One thing is clear, we cannot continue turning our back on reality, on our brothers, on Mother Earth,” he said during a meeting with teachers and students in northern Quito. \nEnvironmental issues have created a headache for President Rafael Correa’s eight-year-old administration, with ongoing protests by indigenous peoples over land damage that they say is due to mining and oil extraction. \nThe government has been beset by a separate set of protests in recent weeks over Correa’s socialist policies, which have angered business leaders as well as the upper and middle classes, who want him to step down. \nCorrea, an admirer of the pope, had a private meeting with Francis late Monday. The pope later said he would bless the country so that internal differences might be reconciled. \nVeiled message to Correa? \nDuring Tuesday’s mass, the pope invoked South America’s independence movements from Spain 200 years ago. \n“That cry for liberty … did not lack conviction or force, but history tells us that it was only convincing when personalism, the desire for single leaderships, were put aside,” Francis said. \nHe did not single out any country or government, in a region that has known right-wing dictatorships in the past and controversial left-wing leaders in recent years. \nBut some of the faithful saw the pope’s words as a veiled message to both the opposition and Correa, who attended the mass. \n“In an indirect way, he told the president to take into account that there are people who don’t have the same ideas as him,” said Felipe Lascano, a 22-year-old university student. \nBolivia on Wednesday \nPope Francis met with Ecuadoran bishops before the mass. \nThe pope already celebrated a huge outdoor mass with 800,000 people at a park in the coastal city of Guayaquil, where he focused on the theme of family as the heart of society. \nPoverty will also be a major topic during this South American tour by “the pope of the poor.” \nIt is the first visit by a pontiff to Ecuador in three decades. His first visit to Latin America as pope was in Brazil in 2013. \nHis current tour comes at a time when the Vatican is losing followers to protestantism in Latin America, home of many of the world’s 1.2 billion Catholics. \nThe Ecuador leg of his trip ends Wednesday with a visit to a sanctuary to the Virgin of El Quinche outside Quito before heading to Bolivia. \nHe will then travel to Paraguay on Friday where police said they would prohibit signs alluding to hot-button social issues such as abortion and gay marriage. \nAll three of the countries he is visiting are predominantly Catholic and have been marked by a long history of poverty and inequality mostly afflicting indigenous populations. \nWhen Pope John Paul II visited Ecuador in 1985, about 94 percent of the population was Catholic, compared to 80 percent today in the country of 16 million. \nThe decrease has come as evangelical churches have attracted huge numbers of followers, many of whom are indigenous people disenchanted by a lack of attention from the Catholic hierarchy.", "external_links": [], "published": "2015-07-08T07:32:00.000+03:00", "crawled": "2015-07-08T08:55:53.000+03:00", "highlightTitle": ""}