{"organizations": [], "uuid": "39dc3ecfcb112ff3f970487fa58f6388ad75631c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/Ho-Chi-Minh-City.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/waterway-tourism-become-ho-chi-minh-citys-key-tourism-product/", "country": "US", "title": "Waterway tourism to become Ho Chi Minh City's key tourism productTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Waterway tourism to become Ho Chi Minh City's key tourism productTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "39dc3ecfcb112ff3f970487fa58f6388ad75631c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/waterway-tourism-become-ho-chi-minh-citys-key-tourism-product/", "ord_in_thread": 0, "title": "Waterway tourism to become Ho Chi Minh City's key tourism productTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Waterway tourism to become Ho Chi Minh City’s key tourism product Published on : Monday, July 6, 2015\nVietnam’s Ho Chi Minh City is accelerating improvement of inland waterway facilities and related tourism service, so that waterway tourism will become the city’s key tourism product, the municipal authorities announced Friday (July 3).\nFrom now to the end of this year, Ho Chi Minh City will build and upgrade 45 wharves and waiting halls, develop 65 sites in districts which have inland waterway tourism routes, and build three community tourism sites in its rural districts.\nThe Ho Chi Minh City People’s Committee has assigned the municipal Tourism Department to foster long-range waterway tourism routes from the city to Mekong Delta provinces and Cambodia, medium-range routes from the city to its rural districts of Cu Chi and Can Gio, and short-range routes along canals.\nThe short range waterway tourism of Bach Dang-Cu Chi alone, part of longer routes to the two neighboring provinces of Binh Duong and Tay Ninh, annually receives nearly 15,000 foreign tourists, said the municipal People’s Committee.\nHo Chi Minh City welcomed nearly 2.2 million foreign visitors in the first half of this year, up 3 percent against the same period last year, the committee announced. The city plans to host 4.7 million international arrivals in 2015.\nRelated Posts Chelsea Football Club Hosts Leaders Sport Summit 2013, the world’s most Prestigious Sport Business Summit Utor hits China travel services – flights after hitting Philippines – Hongkong – Vietnam Tourism Malaysia chairman to promote MyFest 2015 in Vietnam 10,000th McDonald’s Restaurant in the Asia Pacific region opened at Vietnam Vietnam’s Ho Chi Minh City witnesses surge in foreign tourist arrivals", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T23:40:37.000+03:00", "highlightTitle": ""}