{"organizations": ["Barcelona"], "uuid": "d892ef4634820b46d54a372352ec228c218084d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-06/barcelona_gaudi_05072015.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/travel\r", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/tourism-minister-says-no-to-visitor-limit-for-overcrowded-barcelona", "country": "MY", "title": "Tourism minister says no to visitor limit for Barcelona, despite overcrowding", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Tourism minister says no to visitor limit for Barcelona, despite overcrowding", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T11:07:00.000+03:00", "replies_count": 0, "uuid": "d892ef4634820b46d54a372352ec228c218084d5"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/tourism-minister-says-no-to-visitor-limit-for-overcrowded-barcelona", "ord_in_thread": 0, "title": "Tourism minister says no to visitor limit for Barcelona, despite overcrowding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tourism minister says no to visitor limit for Barcelona, despite overcrowding Saturday July 25, 2015 Print Article \nA group of tourists watch the facade of Spanish architect Gaudi’s Sagrada Familia basilica in Barcelona June 28, 2015. — AFP pic BARCELONA, July 25 — Spain should build up its reputation as a vacation destination, tourism minister Jose Manuel Soria said, rejecting a suggestion from the mayor of Barcelona to limit the number of visitors there. \nSoria, who also oversees Spain’s industry and energy sectors, said establishing limitations on the number of people arriving in the kingdom would be like Germany curbing its automobile production. \n“What we have to do is to promote our tourism offer,” he said in a Bloomberg Television interview from his Madrid office. “We don’t think it’s a good idea to establish limits.” \nHis comments come after Barcelona Mayor Ada Colau raised the possibility of limiting the number of people coming to Spain’s most-visited city. While the proposal has not been formalised, Colau has already moved to stop new hotel licences for 2015. \nHer decree temporarily freezing new tourism accommodation investment threatens projects that were expected to begin this year. They include the conversion for hotel use of the Agbar Tower by Hyatt Hotels Corp. \nAccording to Soria, the mayor’s decision sends the wrong message as the kingdom gears up for what could be a record year for tourism, with 68 million people expected to arrive in Spain. \nBarcelona is set to receive the most visitors. Mayor Colau is backed by the anti-austerity Podemos party. \nAsked if the central government would intervene if other cities were to implement Barcelona’s idea, Soria said: “We’ll do what we have to do to incentivise tourism.” \nA spokesman for the mayor of Barcelona said the freeze on new hotel licences would not last for more than a year, and said it would provide time to study the needs of the city and would be beneficial for the tourism sector. — Bloomberg More Stories for You:", "external_links": [], "published": "2015-07-25T11:07:00.000+03:00", "crawled": "2015-07-25T15:08:33.923+03:00", "highlightTitle": ""}