{"organizations": [], "uuid": "fd117f6c069c23edaba6e47c18aec54f78d42bbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.independent.ie/incoming/article31374976.ece/ALTERNATES/h342/Eircode%20.jpg", "site_section": "http://www.herald.ie/lifestyle/travel/", "section_title": "Travel - Herald.ie", "url": "http://www.herald.ie/opinion/columnists/sinead-ryan/sinead-ryan-its-here-at-last-but-wholl-use-the-27m-eircode-system-31373894.html", "country": "", "title": "Sinead Ryan: It's here at last, but who'll use the €27m Eircode system?", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "Sinead Ryan: It's here at last, but who'll use the €27m Eircode system? - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T11:00:00.000+03:00", "replies_count": 0, "uuid": "fd117f6c069c23edaba6e47c18aec54f78d42bbe"}, "author": "Sinead Ryan", "url": "http://www.herald.ie/opinion/columnists/sinead-ryan/sinead-ryan-its-here-at-last-but-wholl-use-the-27m-eircode-system-31373894.html", "ord_in_thread": 0, "title": "Sinead Ryan: It's here at last, but who'll use the €27m Eircode system?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We've waited a decade for it, and appear to be the last remaining country in the Western world without one. 13/07/2015 (L to r) Liam Duggan Business Development Officer Eircode & Minister of Communications, Energy & Natural Resources Alex White TD during the launch of the new Eircode system at the Shelbourne Hotel, Dublin Sinead Ryan – 14 July 2015 03:00 AM\nWith great fanfare and ceremony, (oh, hold on, just a couple of blokes at a photoshoot), the brand new Eircode system has just been launched.\nFor me, this is extremely timely. I left an item of clothing in a hotel in Cork over the weekend and rang them to see if they had found it.\nThey had, and asked for my address to post it on. It's quite long (five lines), so I offered them my spanking new Eircode. \"Your what?\", they asked. \"My Eircode. Just put it on the packet and it'll get straight to me\", I offered cheerily to the receptionist who evidently thought I might have got a head start on the sherry.\nHmmm. Not a great beginning. I already had made three attempts to try and find my house which the system stubbornly refused to locate.\nYou're only allowed 15 goes a day to find people, which you have to admit is a spirited marketing ploy if you want to keep the whole thing under wraps. But on the fourth try, with a different configuration, there I was.\nStrangely, the people in the Local Property Tax office had no such difficulty; nor did Irish Water - both of whom located and charged me with astonishing dexterity.\nI tried it again with a service provider who wanted to sell me something. \"The what code? Nah, just give us the address please.\"\nSo far, so underwhelming. So, who is Eircode for and will it work? We're told it will get packages, parcels and letters to us double-quick which must make all the postmen and women around the country happy.\nEr, except they won't be using it. They have their own system, and while they'll 'support' Eircode, it turns out it's not really terribly helpful to them. Well, what about FedEx and UPS - the biggest global delivery firms on the planet? Nope, not them either. They're not mad about the set up of it, apparently. Bracing start, so.\nemergency\nBut anything that helps the emergency services must be good, right? But it seems they're not chuffed either as it doesn't link into GPS systems. Gosh, so don't reach for your seven digit code if you have a heart attack.\nWell, what if you spot some calamity on the way home from work like a fire, flood or car accident? Can you punch in the spot online and be gallantly able to give the emergency services the code?\nEr, no, sorry, because it only applies to buildings where An Post deliver. Except An Post won't be using it and the fire/flood/accident may, inconveniently, not be in an actual building.\nOh dear. Well perhaps we can take some solace from the logically intuitive and predictive nature of the codes? Afraid not. Due to inexplicable levels of complexity you will have absolutely no idea where someone lives based on the seven digit code.\nDubliners will be pleased to see their existing D and 01-24 figures maintained (apart from those in leafy D6W who staged a long war of words over the years over their special designation status and who get an entirely different code to practically everyone else in the country, D06W).\nBut for everyone else, (and I include myself here, not living in Dublin), there's a random letter, two numbers and then four other random letters and numbers.\nMine happens to start with 'A' which I'm told is a Meath designation. Well, bits of Meath. Lots of the Royal County starts with a 'C' while bits of Dun Laoghaire are 'A' also. Confused? You should be.\nQuite why we couldn't have started with the already successful and clearly obvious car registration plate system is anybody's guess.\nSome people appear to have moved townland, and even county which will no doubt provide for some diverting conversations in constituency offices.\nAnd anybody flying from Shannon Airport should not prepare to land in Co Limerick, not Co Clare, as the facility has apparently moved counties overnight.\nMaybe they took their lead from the Ryanair model of geography.\nBut above all, remember the system is entirely optional. Nobody need use it at all.\nSo, €27 million well spent then.", "external_links": ["http://www.independent.ie/incoming/article31374976.ece/3cb7a/ALTERNATES/w620/Eircode%20.jpg"], "published": "2015-07-14T11:00:00.000+03:00", "crawled": "2015-07-14T11:02:41.000+03:00", "highlightTitle": ""}