{"organizations": [], "uuid": "026bc25c1cd2b02fc77fa6dc0d52f7c9e7d82263", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27856-rosewood-hotels-resorts-appoints-menique-de-la-rosa-as-regional-spa-director-caribbean-and-spa-director-at-rosewood-little-dix-bay", "country": "US", "title": "Rosewood Hotels & Resorts appoints Menique De La Rosa as Regional Spa Director Caribbean, and Spa Director at Rosewood Little Dix Bay", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Rosewood Hotels & Resorts appoints Menique De La Rosa as Regional Spa Director Caribbean, and Spa Director at Rosewood Little Dix Bay", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T11:15:00.000+03:00", "replies_count": 0, "uuid": "026bc25c1cd2b02fc77fa6dc0d52f7c9e7d82263"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27856-rosewood-hotels-resorts-appoints-menique-de-la-rosa-as-regional-spa-director-caribbean-and-spa-director-at-rosewood-little-dix-bay", "ord_in_thread": 0, "title": "Rosewood Hotels & Resorts appoints Menique De La Rosa as Regional Spa Director Caribbean, and Spa Director at Rosewood Little Dix Bay", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Appointments Rosewood Hotels & Resorts appoints Menique De La Rosa as Regional Spa Director Caribbean, and Spa Director at Rosewood Little Dix Bay Rosewood Hotels & Resorts appoints Menique De La Rosa as Regional Spa Director Caribbean, and Spa Director at Rosewood Little Dix Bay Details Category: Appointments Created on Friday, 24 July 2015 09:15 Menique De La Rosa has been appointed regional Spa Director for Rosewood Hotels & Resorts® and Spa Director at Rosewood Little Dix Bay in Virgin Gorda, BVI – the second regional spa director for the luxury hotel group. \nAs Spa Director of the clifftop Sense Spa at Rosewood Little Dix Bay, Menique will enhance the group’s ‘A Sense of Place’ philosophy; De La Rosa has already developed new treatments inspired by the location and introduced meditation, breathing exercises and yoga practices to the spa’s tropical garden. This garden has, in turn, been planted to grow herbs and botanicals that will be harvested for use in Rosewood spa treatments. As Regional Spa Director, Menique De La Rosa will oversee high-level operations and guide the vision for Rosewood’s spas at a multitude their Caribbean properties, including Jumby Bay, a Rosewood Resort. Regarding the appointment, Managing Director of Rosewood Little Dix Bay Ed Lindsley says: “Wellness has become an integral part of today’s travel experience, and as the Sense spa brand continues to evolve, we are looking to develop new and innovative experiences for our guests. Menique has been a leader at a number of prestigious spas around the world, garnering outstanding recognition and accolades, and we look forward to collaborating with her on creating an entirely new wellness experience at all of Rosewood’s Caribbean Sense spas.” Menique De La Rosa’s appointment follows over ten years of experience in the industry. Formerly the Spa Director at Rosewood Tucker’s Point in Bermuda, Menique also enjoyed success as the Director of the Spa and Health Club at The Observatory Hotel by Orient Express in Sydney Australia. During her tenure at The Observatory Hotel, the Day Spa became Sydney’s most awarded spa. Menique brings a wealth of knowledge to her new role, supported with some innovative new ideas to help the Sense Spa at Rosewood Little Dix Bay continue to thrive. Related articles", "external_links": [], "published": "2015-07-24T11:15:00.000+03:00", "crawled": "2015-07-24T11:29:12.926+03:00", "highlightTitle": ""}