{"organizations": [], "uuid": "78843fcdb535e6c68c56024489e6edfc913ec832", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03390/winslet_3390757k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-29.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/celebritynews/11769766/Hollywood-stars-urge-Amnesty-International-not-to-decriminalise-sex-trade.html", "country": "US", "title": "Hollywood stars urge Amnesty International not to decriminalise sex trade", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Hollywood stars urge Amnesty International not to decriminalise sex trade - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T15:53:00.000+03:00", "replies_count": 0, "uuid": "78843fcdb535e6c68c56024489e6edfc913ec832"}, "author": "Victoria Ward", "url": "http://www.telegraph.co.uk/news/celebritynews/11769766/Hollywood-stars-urge-Amnesty-International-not-to-decriminalise-sex-trade.html", "ord_in_thread": 0, "title": "Hollywood stars urge Amnesty International not to decriminalise sex trade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hollywood stars including Meryl Streep, Kate Winslet and Emma Thompson have signed an open letter calling on Amnesty International reject a proposal to endorse the decriminalisation of the sex trade . The human rights group is set to review its internal policy document on sex work at a meeting in Dublin next month. But the Coalition Against Trafficking in Women (CATW) said that if the new policy was adopted, Amnesty would “in effect advocate the legalisation of pimping, brothel owning and sex buying\" that forms the basis of the lucrative global sex industry. More than 3,000 people have signed the online petition, endorsed by women’s rights campaigners, former workers in the sex trade, and celebrities such as actors Emily Blunt, Lena Dunham and Anne Hathaway. The letter, addressed to Amnesty’s secretary general, Salil Shetty; executive director Steven Hawkins, and the board of directors, says: “Every day, we combat male access to women’s bodies through power and control, from female genital mutilation to forced marriage; from domestic violence to violation of reproductive rights. The exchange of money for such access does not eliminate the violence women face in the sex trade… “Amnesty’s reputation in upholding human rights for every individual would be severely and irreparably tarnished if it adopts a policy that sides with buyers of sex, pimps and other exploiters rather than with the exploited.” Amnesty is reviewing its policy amid evidence that criminalising adults for consensual sex work can lead to greater abuse against sex workers . The charity is in the final stages of receiving feedback on the draft policy but stressed that no decision had yet been made. It said in a statement: “These violations include physical and sexual violence, arbitrary arrest and detention, extortion and harassment, forced HIV testing and medical interventions and exclusions from healthcare, housing and other social and legal benefits.\" Gloria Steinem, the veteran women’s rights campaigner, said: \"The millions who are prostituted experience trauma and shortened lives. Legalisation keeps pimps, brothel keepers, and sex-slavers in freedom and riches. Criminalisation puts the prostituted in prison.\" “What works is the ‘third way’, the Nordic model, which offers services and alternatives to prostituted people, and fines buyers and educates them to the realities of the global sex trade.\" The Nordic model, adopted by Canada, Sweden, Norway, Iceland and Northern Ireland, aims to punish and educate clients without criminalising those who have been driven into sex work . CATW said it agreed with Amnesty that sex workers should not be criminalised or brutalised by law enforcement agents and governments, but added: “However, full decriminalisation of the sex trade renders pimps ‘businesspeople’ who sell vulnerable individuals, overwhelmingly with histories of poverty, discrimination, homelessness and sexual abuse, to buyers of sex with impunity.” @telegraphnews", "external_links": [], "published": "2015-07-29T15:53:00.000+03:00", "crawled": "2015-07-30T04:09:43.370+03:00", "highlightTitle": ""}