{"organizations": [], "uuid": "ddf49819121ff298412b98bd3cdb3735bb9591a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/strong-pound-cuts-resort-costs-for-families/4697902.article", "country": "GB", "title": "Strong pound cuts resort costs for families", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Strong pound cuts resort costs for families", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T12:56:00.000+03:00", "replies_count": 0, "uuid": "ddf49819121ff298412b98bd3cdb3735bb9591a3"}, "author": "", "url": "http://www.ttgdigital.com/news/strong-pound-cuts-resort-costs-for-families/4697902.article", "ord_in_thread": 0, "title": "Strong pound cuts resort costs for families", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Strong pound cuts resort costs for families 20 July 2015 Save \nThe strength of the pound against other European currencies is helping to cut families’ costs while on their summer holiday this year. \nOverall costs for a basket of 15 common holiday items fell by 16% according to the Post Office’s annual Family Holiday Report. \nBut despite the fall in the value of the euro against the pound, the cheapest in-resort destinations were Turkey and Bulgaria, which offered better value than any resorts in the eurozone countries. \nTurkey’s affordability as a destination has been helped by a 20% rise in the value of the pound against the lira, compared to last summer. \nThe Turkish resort of Marmaris was the cheapest of the 14 destinations studied when it came to 10 beach-based items such as ice cream, sun lotion, soft drinks, sun loungers, pedalo rides and water park access, with a total bill of £66.15. \nSliema in Malta was the cheapest eurozone destination for this “Beach Barometer” basket of items with an overall cost of £74.16. While the French resort of Nice was the most expensive resort with the same items adding up to £135.09. \nThe biggest year-on-year price falls were in destinations where there had also been reductions in local prices, such as Sliema (down 16.3%), Costa Blanca (down 13.4%), Majorca (down 15.7%) and Paphos (down by 25.7%). \nThe study found that eating out was cheapest in Bulgaria’s Sunny Beach with a three-course family meal for four costing an average of £28.89, just ahead of the Costa del Sol and Portugal’s Algarve coastline. \nPost Office Travel Money’s Andrew Brown said the research also showed that three-quarters of families had broken their budget during their last summer holiday by an average of £219 – mainly due to giving in to “pester power” from their children. \n“Letting children rule the roost could wipe out the extra spending money that parents will have in their pockets this year, thanks to sterling’s gains against the euro and other European currencies,” said Brown.", "external_links": [], "published": "2015-07-20T12:56:00.000+03:00", "crawled": "2015-07-21T05:37:55.090+03:00", "highlightTitle": ""}