{"organizations": [], "uuid": "d93526f3d1133b868f8244b562a38396f1b9a060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/YyZHkzdjrQuHG83yMNxqHJcPiE4YKkEP/Vx8lr-LI9TPdNKgn4xMDoxOjBtO_wVGe&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/travel/holiday-ideas/cruises", "section_title": "Cruises | Travel Cruises and Holidays | The Advertiser", "url": "http://www.adelaidenow.com.au/entertainment/movies/oh-hell-no-we-take-you-behind-the-scenes-of-sharknado-3/story-fni0bom2-1227435285589", "country": "US", "title": "Sharknado 3 Oh Hell No, behind the scenes with Ian Ziering | The", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Sharknado 3 Oh Hell No, behind the scenes with Ian Ziering | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T21:36:00.000+03:00", "replies_count": 0, "uuid": "d93526f3d1133b868f8244b562a38396f1b9a060"}, "author": "Debbie Schipp National Sunday TV guide editor", "url": "http://www.adelaidenow.com.au/entertainment/movies/oh-hell-no-we-take-you-behind-the-scenes-of-sharknado-3/story-fni0bom2-1227435285589", "ord_in_thread": 0, "title": "Sharknado 3 Oh Hell No, behind the scenes with Ian Ziering | The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SHARKNADO star Ian Ziering sums it up best with the words: “I personally don’t know what to make of it, but I’m happy to be part of it’.\nThose crazy people behind cult hit Sharknado have released a trailer attempting to explain the success of the so-bad-it’s-good franchise ahead of it third instalment, Sharknado 3: Oh Hell No .\nIn the tradition of its less-than-subtle approach, the shameless promo titled ‘Behind the Sharks’ sees stars of the show, and those who created and watched it become a social media phenomenon, attempt to explain the success of the low-budget, far-fetched schlockbuster,\nIn case you’ve been living under a rock, Sharknado is basically killer sharks — lots of them — caught up in tornadoes, terrorising various parts of America.\nWatch the exclusive trailer for Sharknado 3 above.\nREAL SHARKNADO?: Baby shark falls from the sky\nMORE: How the Hoff got into Sharknado 3\nThey’re back ... Ziering has picked up the chainsaw again for Sharknado 3 . Picture: Supplied Source: Supplied\nLike most of their audience, the bulk of the talent is lost for words, with the promo leaving the speakers trailing off, or interrupting them mid-sentence, to cut to gratuitous, ridiculous, poorly CGI’d scenes of sharks, and cheesy lines like “holy shark’\nOf the movie franchise that Twitter built, Cassie Scerbo, who reprises her role of Nova in Sharknado 3 says the social media response was ‘more than Kimye’s wedding and Miley Cyrus at the VMAs — Sharknado is the most tweeted-about phenomenon.’.\nSharknado’s makers Syfy estimates Sharknado 2 was the most social movie on television ever, delivering one billion impressions in Twitter conversations\nIn the trailer, the US The Today Show co-hosts Matt Lauer and Savannah Guthrie relive the response to the second movie of the franchise.\nLauer and Guthrie are among a host of celebrities and actors who have signed up for cameos in the third film, which will be released on July 23 in Australia. Among the other stars lining up to add Sharknado to their CV alongside side original franchise stars Ziering and Tara Reid are David ‘The Hoff’ Hasselhoff, Bo Derek, Jerry Springer and Jackie Collins.\nWhy? You be the judge.\nOriginally published as Behind the scenes of Sharknado 3", "external_links": ["http://www.news.com.au/entertainment/movies/oh-hell-no-we-take-you-behind-the-scenes-of-sharknado-3/story-e6frfmvr-1227435285589", "http://resources2.news.com.au/images/2015/07/09/1227435/300182-c58a78da-25eb-11e5-b856-d650f72d3e25.jpg"], "published": "2015-07-09T21:36:00.000+03:00", "crawled": "2015-07-09T07:28:36.000+03:00", "highlightTitle": ""}