{"organizations": [], "uuid": "3b73abeac98e49fcda2e0de9fcdbee0bfcfd467f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/discover-the-best-of-pragues-old-town-attractions.html", "country": "US", "title": "Discover The Best Of Pragues Old Town Attractions", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Discover The Best Of Pragues Old Town Attractions", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T06:02:00.000+03:00", "replies_count": 0, "uuid": "3b73abeac98e49fcda2e0de9fcdbee0bfcfd467f"}, "author": "Lisa Jeeves-2015-07-17T04:02:51-0400", "url": "http://www.articlesfactory.com/articles/travel/discover-the-best-of-pragues-old-town-attractions.html", "ord_in_thread": 0, "title": "Discover The Best Of Pragues Old Town Attractions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | \nOne of the world’s most beautiful cities, rivalling Paris in beauty and character, Prague has a rich history that spans more than a thousand years. The city that has been a political, cultural and economic centre of Europe many times in the past is home to a number of cultural attractions – \nAptly named Old Town, you may pass by the outskirts on your Prague airport shuttle enroute to your accommodation. Ask your driver to point out some of the sites of importance, and then make sure you return on foot to explore in detail. As you will be able to see even o \nThe so-called Old Town is an attraction in itself, with its narrow cobblestoned streets radiating in all directions from the Old Town Square - the very heart of the city. A major marketplace for more than a thousand years, and a silent witness to the major events in Czech history - such as tournaments, executions, weddings, demonstrations and political meetings - Old Town Square has remained virtually untouched since the 10th century. One of the best things to do here is dine al fresco at any one of the pavement cafes lining the square. You can also take the time to leisurely take in the amazing architecture around the marketplace that has evolved over the centuries – \nFor many visitors, the gothic Old Town Hall Tower is an iconic symbol of the city. One of the country's most striking buildings, it houses an elevator that one can ride to the top for breath-taking views over Old Town Square and surrounding areas. The Old Town Hall’s reception area is where you’ \nOn the south wall of the tower is an engineering miracle that puts most of the latest technology to shame – the Astronomical Clock! For 600 years, it has been faultlessly showing not only the time and date, but also the position of the sun, phase of the moon, astronomical cycles and festivals on the Christian calendar. Make sure you’re there on the hour, when it puts on a show with the procession of the 12 Apostles with Christ at the head, and a figure of death ringing the bell. Below it are 12 medallions adorned with the \nAlso known as Our Lady Before Tyn, this beautiful cathedral with looming twin spires seen from all over the city is a majestic example of Gothic architecture. The Baroque interior contains not just the highest altar in the city, but also the tomb of Tycho Brahe, the famous astronomer. If the silhouette seems familiar, it may be because it reminds you of Sleeping Beauty’s castle – many say this was Walt Disney’ \nOld Town is a great start when it comes to discovering the gems of this amazing city. As soon as your Prague airport shuttle has delivered you to your accommodation Source: Free Articles \n\nLukas Johannes is a driver for Shuttle Direct. If you’re looking for Prague airport shuttle , Shuttle Direct provide pre-booked shuttles to major destinations all over Europe. Wherever you travel, Shuttle Direct can make sure that you don’", "external_links": [], "published": "2015-07-17T06:02:00.000+03:00", "crawled": "2015-07-17T15:41:30.000+03:00", "highlightTitle": ""}