{"organizations": [], "uuid": "31b226993e8a285eac6fe3fb40dabca9f079ec33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/4/p/2/y/n/image.related.StuffLandscapeSixteenByNine.620x349.15thxa.png/1436906377866.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/kiwi-traveller/70240510/Top-ten-tips-for-packing-light", "country": "AU", "title": "Top ten tips for packing light", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Top ten tips for packing light", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T23:39:00.000+03:00", "replies_count": 0, "uuid": "31b226993e8a285eac6fe3fb40dabca9f079ec33"}, "author": "Louise Southerden", "url": "http://www.stuff.co.nz/travel/kiwi-traveller/70240510/Top-ten-tips-for-packing-light", "ord_in_thread": 0, "title": "Top ten tips for packing light", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top ten tips for packing light LOUISE SOUTHERDEN Last updated 08:39, July 15 2015 123rf \nPlan what you'll take a few days in advance so you won't have a panic packing session the night before you leave. \nDid you hear about the globetrotting National Geographic writer who travelled the world for six weeks with no luggage? He wore a multi-pocketed vest to carry all he needed, including T-shirts and a folding keyboard for his iPhone. \nAppealing as this might be, most of us need at least one bag when we travel, if only to avoid handwashing our smalls in our hotel room's bathroom sink every night. The question is, how to keep it light? \nThere are three good reasons to be a travel minimalist. It's liberating (save on baggage fees, no more waiting at the baggage carousel), getting around is easier (no heaving a bag through the streets of a new city) and it's better for the environment (we pay for the weight we carry in emissions, and travelling with less lets us walk or use public transport). What's your top travel tip? Share your stories, photos and videos. \nBut be warned: packing light is addictive. Start this ball rolling and you'll soon be chasing it downhill weighing everything you buy, pack and use, in a quest to answer the eternal question: \"How low can those luggage scales go?\" \nNeed help? Try these light-packing tips for size: \n1. DON'T PACK AT THE LAST MINUTE \nThere's a reason most people don't pack light for every trip: it takes effort and a bit of thought. Packing at, say, midnight on departure-eve makes it even harder, because you're too tired to exercise the critical faculties that'll help you lighten your load. Start packing, or at least thinking about what to take, a few days before you leave. \n2. GO WHEEL-LESS \nWhat? Forego the greatest travel innovation of our time? The problem with wheels is that they trick us into taking more than we can carry, then justify their existence. When you have to pick up your bag, there's a built-in incentive to pack light. Going wheel-less (my favourite travel bag is a Patagonia Black Hole duffel with backpack straps) is also an advantage where footpaths are non-existent, streets are cobbled and there are lots of stairs (Exhibit A: most European train stations). \n3. DON'T ROLL YOUR CLOTHES Ad Feedback \nThis might sound like more heresy and yes, rolling your clothes does help you stuff more stuff in. That's the problem. More stuff means more weight you'll have to carry (you're trying to travel light, remember, not small), particularly when you're travelling without wheels (see above). Pack things loosely and there'll be plenty of weightless air between them. \n4. SHOP LIGHT \nOutdoor stores such as Paddy Pallin and Kathmandu and online store Lightweight Traveller (see lwtraveller.com ) are temples to the gods of lightweight clothing and gear. Shopping while travelling is trickier and can soon undo all your weight-saving work, so keep souvenirs small (magnets, say, instead of snowdomes) or budget for shipping things home. Photos make the best, and least cumbersome, mementos. \nREAD MORE", "external_links": [], "published": "2015-07-14T23:39:00.000+03:00", "crawled": "2015-07-15T00:37:36.000+03:00", "highlightTitle": ""}