{"organizations": [], "uuid": "20d23f364cc80be49413a6b649d578378436468d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://www.independent.co.uk/incoming/article10368081.ece/binary/original/finland-lake.jpg", "site_section": "http://www.independent.co.uk/travel/rss", "section_title": "- Travel RSS Feed", "url": "http://www.independent.co.uk/travel/news-and-advice/shorthaul-trips-that-are-big-on-adventure-from-finland-to-the-isles-of-scilly-10368206.html", "country": "IE", "title": "Short-haul trips that are big on adventure: From Finland to the Isles of Scilly - News & Advice", "performance_score": 0, "site": "independent.co.uk", "participants_count": 1, "title_full": "Short-haul trips that are big on adventure: From Finland to the Isles of Scilly - News & Advice - Travel - The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "20d23f364cc80be49413a6b649d578378436468d"}, "author": "Sian Lewis", "url": "http://www.independent.co.uk/travel/news-and-advice/shorthaul-trips-that-are-big-on-adventure-from-finland-to-the-isles-of-scilly-10368206.html", "ord_in_thread": 0, "title": "Short-haul trips that are big on adventure: From Finland to the Isles of Scilly - News & Advice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "An escape to sunnier climes doesn't have to come with a side serving of jetlag. From surfing and souks to secret log cabins by untouched lakes, it's also possible to find an active summer adventure at the end of a short journey (with a palatable price tag, too).\nMorocco has become a hub for surfers looking for a culture fix as well as reliable swell. Less than four hours from the UK, Agadir airport is a short drive from Taghazout, an oasis of calm on the coast. Mint Surf (00 212 6485 33504; mintsurfmorocco.co.uk ) offers week-long surf camps at chilled-out riads from £245 a week.\nThe clear blue waters along the coastline of the Maltese islands – Malta, Gozo and Comino – are perfect for diving, and just a three-hour hop from the UK. Malta's rich heritage on dry land continues beneath the waves, where alongside natural caves you'll find a sunken Second World War bomber and shipwrecks of different vintages. From warm, shallow water, perfect for beginners, to the infamous Lantern Point, a 50m dive complete with narrow chimneys and tunnels, Dive Malta (00 356 2136 9994; divemalta.com.mt ) offers all levels the chance to hunt out sites; from £27 per dive.\nIn summer, Finland (a little more than two hours from the UK) experiences almost endless daylight, giving visitors even more time to explore its pristine lakes and forests. Do as the Finns do and hole up in a log cabin by the water – there are more than 187,000 freshwater lakes in Finland. Finland Cottage Rentals (00 358 4589 55088; finlandcottagerentals.com ) offers picture-perfect cabins from €421 (£298) per week. The cabins come with wood-burning saunas, too. Finns recommend alternating between steaming and swimming sessions to stimulate the senses, and if you want to get active on the water, Wild Canoe (00 358 4001 60989; wildcanoe.com ) organises self-guided paddling trips on Lake Saimaa; from €280 (£199) per week.\nWant to go seriously short haul? A flight to the Isles of Scilly takes just 15 minutes from Land's End Airport, and a £70, one-way ticket on the Scilly Skybus plane (0173 633 4220; islesofscilly-travel.co.uk ) is worth it for the views of the beautiful archipelago.\nMore reminiscent of the Caribbean than Cornwall, Scilly makes an easy escape. Island hop, swim in the clear water, kayak around the coast or snorkel with seals, from £44 with Scilly Seal Snorkelling (0172 042 2848; scillysealsnorkelling.com ), then bed down under the stars at one of Britain's most picturesque campsites, Troytown on St Agnes (0172 042 2360; troytown.co.uk ), which offers views of the Atlantic from your pitch (from £9).", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T17:41:41.000+03:00", "highlightTitle": ""}