{"organizations": [], "uuid": "24a5fd437e1837e06ae2049e15b96f8c2238cfec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03367/Tata-comms_3367305a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/business-communication/11723481/clive-woodward-understanding-digital-technology-and-data.html", "country": "US", "title": "Sir Clive Woodward: 'Understanding digital data is key'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Sir Clive Woodward: 'Understanding digital data is key' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T18:53:00.000+03:00", "replies_count": 0, "uuid": "24a5fd437e1837e06ae2049e15b96f8c2238cfec"}, "author": "Oliver Pickup", "url": "http://www.telegraph.co.uk/sponsored/business/business-communication/11723481/clive-woodward-understanding-digital-technology-and-data.html", "ord_in_thread": 0, "title": "Sir Clive Woodward: 'Understanding digital data is key'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more on connecting your business » Sir Clive Woodward, the Rugby World Cup-winning coach, helped officially open Tata Communications’ new London office, located on the north bank of Southwark Bridge in the City, a stone’s throw from London’s bustling tech start-up scene, and – appropriately enough – he discussed how understanding technology and data was central to England’s success in 2003. “Talent alone is not enough,” the 59-year-old told the packed room at Vintners Place on Upper Thames Street. “That is the start, not the finish. The DNA of a champion is made up of many different aspects, and the ability to learn skills – being a sponge rather than a rock – is central to this. Those who have the passion to succeed can reach the top. And whoever wins in information technology tends to win.” Sir Clive Woodward meets chief executive of Tata Communications Vinod Kumar Woodward was a pioneer in using sport science some 15 years ago. It was through obtaining data on his players, as well as their opponents, that Woodward was able to lead England up the world rankings, from sixth to first place, and lift the Webb Ellis Cup for the first time. Those unwilling to evolve and use the IT software available were chopped from the squad. “You have to have a passion for knowledge to improve, and if players didn’t go home and analyse their performance, where they could better themselves, they couldn’t stay in the team,” said Woodward. “Data changed the whole sport and helped us really move forward. It also helped our leadership reach a whole new level, too.” Armed with cocktails and canapés, the latter crafted by Michelin-starred chef Joël Robuchon, 150 Tata Communications guests and staff soaked up Woodward’s words. Vinod Kumar, managing director and CEO of the company – part of the $100 billion (£64 billion) Tata group, one of the largest private sector employers in the UK – praised the speaker’s “truly inspirational” words, agreeing that “empowering players with data” helps elevate achievement. Looking out at the backdrop of Southwark Bridge, Kumar, who had flown in from Singapore to attend, continued: “It may be the quietest bridge in London, but this is the busiest office in London… at least as far as our competitors are concerned. This is probably the best office we have in the whole world.” The DNA of a champion is made up of many different aspects, and the ability to learn skills – being a sponge rather than a rock Julie Woods-Moss, Tata Communications’ chief marketing officer and CEO of Nextgen Business, added: “It's in the heart of the Square Mile, overlooking the Thames and Shakespeare’s Globe. It's wonderful to gather together all of our staff and their guests to toast this fabulous new facility. “Our new London office is a fantastic showcase of the Tata Communications branch. We have worked with one of London's top design agencies to create a dynamic, energising space that encourages collaboration and brings out the best in our teams, to innovate and to lead in the market. We are looking forward to many prosperous years in our new home.” See how you can connect your business at tatacommunications.com", "external_links": [], "published": "2015-07-09T18:53:00.000+03:00", "crawled": "2015-07-09T20:47:42.000+03:00", "highlightTitle": ""}