{"organizations": [], "uuid": "b2358a5c95a72c8de42b6482dad252af4f02f1c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canada.com", "main_image": "http://www.canada.com/cms/binary/11178431.jpg", "site_section": "http://rss.canada.com/get/?F178", "section_title": "canada.com Travel Picks", "url": "http://www.canada.com/travel/best+jazz+clubs+Paris+City+love+continues+breathe+life+into+music+born/11178414/story.html", "country": "CA", "title": "Best jazz clubs in Paris: City of love breathes life into music born in U.S.", "performance_score": 0, "site": "canada.com", "participants_count": 0, "title_full": "Best jazz clubs in Paris: City of love breathes life into music born in U.S.", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T23:22:00.000+03:00", "replies_count": 0, "uuid": "b2358a5c95a72c8de42b6482dad252af4f02f1c0"}, "author": "", "url": "http://www.canada.com/travel/best+jazz+clubs+Paris+City+love+continues+breathe+life+into+music+born/11178414/story.html", "ord_in_thread": 0, "title": "Best jazz clubs in Paris: City of love breathes life into music born in U.S.", "locations": ["Le Duc des Lombards", "America", "Paris City", "Paris", "U.S"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Charlie Watts", "Pierre Verdy", "Ben Waters", "Dave Green"], "text": "The best jazz clubs in Paris City of love continues to breathe life into music born in America Drummer Charlie Watts, bassist Dave Green and pianist Ben Waters do a sound check before a concert with their band The A, B, C, D of Boogie Woogie at Le Duc des Lombards in Paris. Photograph by: Pierre Verdy , AFP/Getty Images \nIt was after midnight at Le Duc des Lombards and the jam session was warming up. A just-assembled quartet toyed with the jazz standard Cherokee, volleying solos until the melody was barely discernible. \nUpstarts holding drumsticks and saxophone cases lined up on the stairs to rotate in. \nIn the back, European and American musicians kissed hello and slapped backs. French stars Jacky Terrasson and Stephane Belmondo stopped by after their show at Sunside while American bassist Burniss Travis stepped onstage for a song or two. In dim blue-black light, the audience was packed into banquettes and café tables, chatting throughout and applauding each solo. Outside, the streets of Chatelet were quiet and bistros locked up, but Le Duc des Lombards kept humming until 4 a.m. For proof that Paris is a jazz town, come to the Duc on a Saturday night. But dispense with nostalgic notions of Montmartre cabarets or Louis Armstrong in Paris Blues. Sure, you can hear stylish chanteuses and big bands, but the city is also a hub for contemporary jazz. Over two weeks hitting the clubs last year, I heard just about everything in that category, from bebop at L’Improviste to avant-jazz at La Java to Brazilian at the Bab-Ilo . Gypsy jazz, France’s own contribution to the genre, thrives. Unlike Americans, who largely view jazz as a relic, the French host countless festivals and are willing to shell out for tickets. The music is more popular here than in its homeland. \nListening to jazz in Paris isn’t like ordering a Big Mac or picking up some other American import. It’s experiencing a century-old part of French culture. “For me, jazz is very much linked to France, and France is linked to jazz,” says Lucie Buathier, who organizes concerts with the Paris Jazz Club, a promotional group. \nJazz is a vibrant part of the city’s nightlife, evidenced by some 600 concerts each month, far more than anywhere besides New York. \nJazz arrived in France during the First World War when James Reese Europe led an army-band tour across the country, kicking off a dance-hall craze. In the 1920s, black artists migrated to Paris, gathering in Montmartre. Dancer Josephine Baker dazzled clubgoers in Pigalle; Langston Hughes worked as a busboy nearby. The soundtrack was jazz. \nBut it was around the Second World War that jazz became embedded in the French psyche. During the war, the Vichy government banned American music, but you could still hear jazz in Paris: bands just translated titles into French. Jazz became associated with the United States, freedom and the resistance. In 1945, it was the sound of liberation. \nAs the bebop style emerged and jazz appreciation waned in North America, the music took off in France. \nTo black Americans, it was the city of Paris that equalled freedom. Finding it a welcoming refuge from the Civil Rights era, musicians such as Sidney Bechet and Bud Powell moved here. They mingled with existentialists like Jean-Paul Sartre in the jazz caves of St. Germain-des-Pres. Miles Davis fell in love with Sartre’s muse, Juliette Greco, and wrote the score for Louis Malle’s film Ascenseur pour l’echafaud. That heyday has passed, but its legacy endures. \nSome of the storied “caves” are still around and are an atmospheric place to start a jazz tour. Just off the Seine in the Latin Quarter, the Caveau de la Huchette has hosted jazz since 1946. \nPush past the drunken crowds on the street and you’ll enter a smoke-stained warren of vaulted arches and narrow stone stairways. The building, dating to the 16th century, has served as a meeting place to such secret orders as the Masons. In the 1950s and ’60s, it was a popular club for bebop, drawing Art Blakey and Lionel Hampton. \nIF YOU GO \n– Atelier Charonne : 21 Rue de Charonne; 011-33-1-40-21-83-35. Shows at 8 or 9 p.m.; there’s a drink minimum at the bar, or $39 for dinner and concert.– Bab-Ilo : 9 Rue du Baigneur; 011-33-1-42-23-99-19. Variable set times starting between 6:30 p.m. and 9:30 p.m.; cover charge $6-$11.– Le Baiser Sale : 58 Rue des Lombards; 011-33-1-42-33-37-71. Variable set times starting between 7 p.m. and 10 p.m.; cover charge $13-$28.– Cafe Universel : 267 Rue Saint-Jacques; 011-33-1-43-25-74-20. Shows at 9 p.m.; drink minimum.– Caveau de la Huchette : 5 Rue de la Huchette; 011-33-1-43-26-65-05. Shows at 9:30 p.m; cover charge $15-$17.– Le Duc des Lombards : 42 Rue des Lombards; 011-33-1-42-33-22-88. Sets at 8 p.m. and 10 p.m; cover charge $31-$34. Jam session Friday and Saturday night at midnight; no cover.– L’Improviste : 36 Quai d’Austerlitz; 011-33-6-50-32-63-54. Shows most nights at 9 p.m.; cover charge $17.– La Java : 105 Rue du Faubourg du Temple; 011-33-1-42-02-20-52. Jazz every second Monday of the month at 8:30 p.m; cover charge $11.– New Morning : 7-9 Rue des Petites Ecuries; 011-33-1-45-23-51-41. Shows at 8 or 8:30 p.m; cover charge $15-$30.–", "external_links": [], "published": "2015-06-30T23:22:00.000+03:00", "crawled": "2015-07-02T03:46:53.000+03:00", "highlightTitle": ""}