{"organizations": [], "uuid": "aa1081b99bdf1103c97598100a268420bfce60c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/27494-sands-expo-and-convention-centre-host-record-breaking-tax-free-world-association-tfwa-asia-pacific-exhibition-conference", "country": "US", "title": "Sands Expo and Convention Centre host record-breaking Tax Free World Association (TFWA) Asia Pacific Exhibition & Conference", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Sands Expo and Convention Centre host record-breaking Tax Free World Association (TFWA) Asia Pacific Exhibition & Conference", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T14:00:00.000+03:00", "replies_count": 0, "uuid": "aa1081b99bdf1103c97598100a268420bfce60c6"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/27494-sands-expo-and-convention-centre-host-record-breaking-tax-free-world-association-tfwa-asia-pacific-exhibition-conference", "ord_in_thread": 0, "title": "Sands Expo and Convention Centre host record-breaking Tax Free World Association (TFWA) Asia Pacific Exhibition & Conference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sands Expo and Convention Centre host record-breaking Tax Free World Association (TFWA) Asia Pacific Exhibition & Conference Sands Expo and Convention Centre host record-breaking Tax Free World Association (TFWA) Asia Pacific Exhibition & Conference Details Category: Venues & Events   12:00 More than 7,000 delegates from all corners of the world – including Africa, Japan, Korea, Nigeria and Mongolia – descended on Marina Bay Sands from 19 to 27 April, in a colourful and spirited gathering that marked the integrated resort’s biggest corporate event in a single congregation held to date. They represented the cream of the crop of multi-level marketing company Forever Living, and were all in Singapore for the incentive trip of their lifetime. \nHeld over 10,000 square metres of space at the Sands Expo® and Convention Centre, the annual Forever Living Global Rally saw 7,000 attendees participate in workshops, networking sessions and company rallies over nine days. The integrated resort also worked closely with the organiser on a slew of red carpet treatment for delegates, including retail and dining offers across property. One of the highlights at the Global Rally was a charity meal packing activity – a unique corporate social responsibility initiative in partnership with Marina Bay Sands. For the first time in its history, the Global Rally partners “Stop Hunger Now” to give back by packing more than 285,000 meals for the underprivileged. These meals will be delivered to International Care Ministries in Philippines and Feed the Hungry in Cambodia, as part of the 2015 World Hunger Week. Another key event held in Q2 was the inaugural Interpol World 2015. Held from 14 to 16 April, the first-to-Asia conference saw close to 8,000 government leaders, security professionals and researchers gather to discuss strategies for developing security solutions. National groups from Austria, France, Israel, Malaysia, Netherlands, Singapore and USA also showcased their countries’ best technological solutions during the three-day event, which took over five halls on basement 2 and level 1 of Sands Expo – a total of 20,500 square metres. Held in conjunction with Interpol World 2015 was the 22nd Asian Regional Conference 2015 at level 3 of Sands Expo, attended by senior law enforcement officials from across Asia Pacific. Due to the nature of both events, Marina Bay Sands worked closely with the event organiser to deploy additional security around the perimeters of the ballrooms. In May, Tax Free World Association (TFWA) Asia Pacific Exhibition & Conference returned to Marina Bay Sands for the third consecutive year with a record breaking attendance from visitors and exhibitors, making it the biggest TFWA Asia Pacific in the last 20 years. More than 2,600 people visited the show over the five-day event, which also included a Tai Chi session on Sands SkyPark at Marina Bay Sands. The exhibition & conference is set to return to the Sands Expo and Convention Centre next year, 8 to 12 May 2016. Other recent events include CommunicAsia 2015 from 2 to 5 June, which spanned all five levels of the convention centre with more than 1,800 exhibitors from 56 countries, as well as 35 international pavilions from China, Norway, Romania, South Korea and Vietnam. Taking place as soon as CommunicAsia ended was the 28th Southeast Asian (SEA) Games, and Marina Bay Sands was proud to be one of the hotels to host the historic event. Related articles", "external_links": [], "published": "2015-07-01T14:00:00.000+03:00", "crawled": "2015-07-01T14:26:00.000+03:00", "highlightTitle": ""}