{"organizations": [], "uuid": "0ea379d29547558e529e6fb58c4ddf39399038a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymercury.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/07/03/maldives-39tm8iiawdbiaqs4gk2_fct550x413x31.0_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/DailymercurycomauTravel", "section_title": "dailymercury.com.au: Travel", "url": "http://www.dailymercury.com.au/news/the-worlds-most-beautiful-beach-getaways/2694916/", "country": "AU", "title": "The world’s most beautiful beach getaways", "performance_score": 0, "site": "dailymercury.com.au", "participants_count": 0, "title_full": "The world’s most beautiful beach getaways", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T17:00:00.000+03:00", "replies_count": 0, "uuid": "0ea379d29547558e529e6fb58c4ddf39399038a6"}, "author": "", "url": "http://www.dailymercury.com.au/news/the-worlds-most-beautiful-beach-getaways/2694916/", "ord_in_thread": 0, "title": "The world’s most beautiful beach getaways", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The world’s most beautiful beach getaways 6th Jul 2015 12:00 AM Local Real Estate Cars For Sale \nBEACHES are one of the great pleasures of life - they have an incredible healing power and are perfect for a therapeutic holiday abroad. Here are our top picks. \nFIJI The island nation of Fiji possesses some of the most beautiful beaches in the world. Just two of the 332 Fijian islands contain almost ninety percent of the nation's population which means there is a lot of gorgeous, unspoilt beachside scenery to enjoy. Whatever kind of beach holiday you enjoy, you'll find the perfect getaway here. \nHAWAII From the iconic Waikiki Beach to the tucked away tranquil coves, this tropical American state is best enjoyed by lazing around on its many beaches. The towering cliff tops and dense rainforest create a stunning contrast to the turquoise waters along Hawaii's beaches. There's Tunnel Beach on Kauai, Makalawena Beach on Big Island and Kaanapali Beach on Maui. And if you want more American goodness, hope on a flight to Los Angeles to experience the beaches of southern California. \nTHAILAND Thailand's reputation for boasting a strikingly beautiful coastline precedes itself. The beaches of Thailand are one of its great attractions. After you've explored the buzzing metropolis of Bangkok, head down to the coast and relax on the golden sand. Patong has a terrific night life; otherwise the beaches on the islands of Phuket and Koh Samui are fantastic. \nAUSTRALIA With almost 36,000 kilometres of coastline on the mainland and another 24,000 kilometres of coastline around the islands, it's no wonder that Australia has some fantastic beaches. The famed Gold Coast with Surfers Paradise mixes that glorious Queensland sun with a great nightlife and an incredible stretch of sand. Caloundra and Noosa on the Sunshine Coast are terrific, but also be sure to check Cable Beach in Western Australia, Byron Bay and Whitehaven Beach in the Whitsundays. \nBALI Everybody loves the high voltage destination of Kuta with its white sand, spectacular sunsets, bargain shopping and colourful nightlife. However when you're finished playing hard, treat yourself by heading away from the popular beaches to discover some of the more tranquil beaches that Bali has to offer. These secluded spots are guaranteed to slow your step. Consider exploring Pantai Geger, Balangan Beach or Pantai Kecil, which translates to Little Beach. \nTHE MALDIVES Known for its beautiful white sand beaches and warm waters, the Maldives may be one of the world's smallest nations but it has countless marvels to offer visitors after a romantic getaway. Like a fantasy destination, there are coral reefs, ring-like atolls and bright blue lagoons that surround the 1,192 islands. Popular beaches include those on Cocoa Island, Reethi Rah Island, Baros Island and Nika Island. \nTHE CARIBBEAN Who can resist the white sand beaches of the magnificent islands that rest within the alluring waters of the Caribbean Sea? Calm blue waters, a light tropical breeze and maybe even a little reggae music in the background and life's worries and cares seem to slip away. Just add the essential cocktail with an umbrella and this tropical paradise becomes a relaxing and memorable beach holiday that is uniquely Caribbean in flavour. Perhaps unfurl your towel on Punta Cana in the Dominican Republic, White Bay in the British Virgin Islands or Crane Beach in Barbados. \nTHE COOK ISLANDS Comprising 15 islands beautifully placed between New Zealand and Hawaii, The Cook Islands archipelago features coral atolls, volcanic peaks, lush tropical forests, underwater caves and sumptuous lagoons and of course incredible beaches. Be sure to check into a resort on Rarotonga before heading across to Aitutaki - One Foot Island is particularly special. beach", "external_links": [], "published": "2015-07-05T17:00:00.000+03:00", "crawled": "2015-07-06T03:46:17.000+03:00", "highlightTitle": ""}