{"organizations": [], "uuid": "23974cf89851fb24765dcf6b63853a1710e81d88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailystar.com.lb", "main_image": "http://www.dailystar.com.lb/dailystar/Pictures/2015/07/03/432058_img650x420_img650x420_crop.jpg", "site_section": "http://www.dailystar.com.lb/Life/Travel-and-Tourism.ashx", "section_title": "Life , Travel &amp; Tourism | THE DAILY STAR ", "url": "http://www.dailystar.com.lb/Life/Lubnan/2015/Jul-03/304848-spending-the-summer-in-lebanon.ashx", "country": "US", "title": "Spending the summer in Lebanon Lubnan", "performance_score": 0, "site": "dailystar.com.lb", "participants_count": 1, "title_full": "Spending the summer in Lebanon | Life , Lubnan | THE DAILY STAR", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T08:22:00.000+03:00", "replies_count": 0, "uuid": "23974cf89851fb24765dcf6b63853a1710e81d88"}, "author": "dailystar", "url": "http://www.dailystar.com.lb/Life/Lubnan/2015/Jul-03/304848-spending-the-summer-in-lebanon.ashx", "ord_in_thread": 0, "title": "Spending the summer in Lebanon Lubnan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "B\nEIRUT: Despite the regions insecurities, Lebanon is still expecting tourism this summer, and for those visiting and locals alike there are plenty of options to visit beyond the obvious tourist attractions. The Daily Star has put together a list of five places and events to check out in Lebanon this summer.\nSoul El Akel, the food market\nSouk al-Akel (Photo courtesy of Souk al-Akel) It began a few years ago with Souk El Tayeb, the regular open-air farmers’ market found every Saturday at the Beirut Souks. Now it seems that street festivals and markets are becoming the go-to in the capital. There was Souk al-Yasmeen, the flower market in Downtown back in March. Mar Mikhael was shut down for a day to commemorate the centennial of the Armenian genocide, with live music, food and artisan stalls back in April. May saw the launch of the one-off Saifi Market, with music, food and street performers drawing in crowds to the area – not to mention various other car-free ventures in Hamra, Ashrafieh and Badaro.\nBut while most of these were one-off events, it was Souk El Akel, the food market, that proved itself to be a lasting formula. It was launched in May, as a one-off collaboration between Souk El Tayeb, NoGarlicNoOnions and Chef Wael Lazkani from Jai Beirut. The popularity of the event, however, inspired them to hold the market every Thursday, from 5 p.m. to 11 p.m.\nSouk El Akel is held in Downtown, behind the Beirut Municipality building on Youssef al-Rami street and has on average around 20 vendors, with new faces appearing every week. There is a variety of food on offer, from Lebanese to Chinese, Indonesian curries, Mexican tacos and even the mystical sushi burrito. Even better, local restaurants and large chains alike have been asked to create a unique recipe for Souk El Akel, so even if you fancy something as simple as Classic Burger, you’ll be able to get a burger not on the usual menu.\nFor the month of Ramadan the market is operating on slighter later hours, from 7 p.m. to midnight.\nTannourine’s cedars and sinkhole\nTannourine sinkhole. Lebanon’s beauty lies in its diversity, from the coastal beaches through the cities to the cedar-filled mountains there is so much variety in what you can see. A great place to visit to get a feel for the country’s mountainous north is Tannourine. Not so much a village as an area with that it contains several small Lebanese villages, Tannourine has plenty to see, with two beautiful natural wonders in its midst.\nThe Tannourine Cedars Forest Nature Reserve is one of Lebanon’s largest and densest cedar forests with 80 percent of its trees, the country’s emblem. It is also considered to be one of the most scenic, with mountainous hiking trails, grottos and rare flora to explore.\nAnother major site to visit in Tannourine is the Baatra waterfall, located in the village of Balaa just before Tannourine. It may be best to ask directions to the waterfall at the village because the turn off can be hard to find. There are two paths to take. The easiest takes to you a high vantage point to see the long, thin waterfall pouring down. The second is a rough hike down to the sinkhole, so deep you can’t see the bottom.\nHamra/Mar Mikhael’s bars\nMar Mikhael (The Daily Star/Grace Kassab) If you are looking for a night out in Beirut, a chance to mingle and meet some new faces then there are two areas guaranteed to have crowds. On the west side there is Hamra, particularly Hamra Street and its parallel Makdessi Street. Once considered losing its status as the place to head for an evening drink, Hamra has been witnessing a revival of late. Gone are the over-loud pubs with competing music and a young crowd, instead there is a more mature scene. The recently opened Courtyard, a cluster of gastropubs off Makdessi draws in a lively crowd, with some serious mixologists and live music a regular thing.\nMoving to the east, the usurper of Hamra’s crown is Mar Mikhael. As a residential neighborhood, not everyone is happy with its transformation into what is essentially a massive pub crawl, but the crowds keep coming and slew of new bars have just opened on the main road, Armenia Street. Mar Mikhael’s diversity means it is an easy place to cater to all tastes, with some upscale bars mixing with cheaper hole-in-the-wall establishments. It has also seen a boom in specialized restaurants with various outlets laying claim to Beirut’s best burger.\nThe Gärten\nThe Gärten. (Photo courtesy of The Gärten) Summer in Beirut means the opening of various outdoor venues, with one of the most popular being The Gärten by überhaus. Lebanon’s first pop-up club venue when it opened back in 2013, the nightclub occupies 1,000 square meters of space next to the Beirut Exhibition Center by Biel.\nNot your traditional club, you gain entrance via a walkway of trees to be greeted with a massive, green turfed open space, a huge rectangular bar and a curious dome structure with triangle LED lights that serves as the club’s dance floor later in the evening.\nGärten encourages its revelers to come early and spend the entire night with them. From 7-9 p.m. entrance is free and drinks are on happy hour fee. There are bean bags and chairs to lounge about, a village-like area through another path of trees with food and artisanal stalls. The club also occasionally screens films and football matches early evening.\nAfter 9 p.m. the dance floor picks up and things get a bit more expensive, entrance from 9p.m.-3 a.m. is $30 with one drink, and from 3 a.m. to close $20 with one drink.\nWith a capacity for 800 revelers on the dance floor and up to 2,000 all-in, The Gärten brings in überhaus’ usual top local and international DJs on Saturday nights, with July 4 bringing back BLOND:ISH, the Canadian producer/DJ duo of Anstascia D’Elene Corniere and Vivie-ann Bakos.\nThe public beach at Tyre\nMar Mikhael (The Daily Star/Grace Kassab) With beach clubs up and down the country charging an average of $20 and above to gain access to what many see as a public right, plenty of locals and foreigners alike will instead opt to head down south to Tyre’s public beach.\nFree to access, the public beach at Tyre is huge, spacious and, most importantly, clean with sand that opens out onto crystal-clear water. Getting there from Beirut isn’t too hard; there are direct buses to Tyre from the area by the Kuwait Embassy in the city, LL 5,000 will get you straight there. Alternatively you can head to the Cola bus station and take a bus first to Sidon, then from Sidon on to Tyre, but this will take a fair bit longer.\nOnce in Tyre, grabbing a service to take you to the beach is the easiest solution. While access to the beach is free and you are more than welcome to bring down your own food/drink for the day, for those who want there are kiosks up and down the beach that rent out beach chairs/umbrellas and have restrooms, bars and restaurants for you to partake in.\nA popular family destination, Tyre’s beach will be fairly busy during the summer months but its sand and sea are well worth visiting.\nFor fish lovers, the restaurants along the shore in Tyre also boost some of the best fish in the country.\n July 03, 2015, on page 2. Recommended Entities Tyre Beirut Sidon Tannourine Saifi Ashrafieh Artifacts Hamra street Makdessi street Armenia street Kuwait Embassy Beirut Exhibition Center People Jai Beirut Youssef Al-Rami Countries Lebanon Companies Tannourine Cedars Forest Nature Reserve Publication The Daily Star Consumer products Grace Plant Cola Religion Ramadan Advertisement", "external_links": [], "published": "2015-07-03T08:22:00.000+03:00", "crawled": "2015-07-03T03:33:02.000+03:00", "highlightTitle": ""}