{"organizations": [], "uuid": "69d92c7f78c78a7401ce4035a86e7d6587f7a5b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 4:51 p.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_VATICAN_CUBA_US_DC_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "DC stop of Pope Francis trip includes White House, Congress", "performance_score": 0, "site": "ap.org", "participants_count": 1, "title_full": "DC stop of Pope Francis trip includes White House, Congress", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T23:51:00.000+03:00", "replies_count": 0, "uuid": "69d92c7f78c78a7401ce4035a86e7d6587f7a5b4"}, "author": "By JESSICA GRESKO", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_VATICAN_CUBA_US_DC_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "DC stop of Pope Francis trip includes White House, Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Links Yesterday's Places WASHINGTON (AP) -- Pope Francis will spend 48 hours in Washington during a September visit, stopping at both the White House and Congress on his first trip to the United States as pope, the Vatican announced Tuesday. Francis will arrive in Washington from Cuba the afternoon of Sept. 22, the itinerary says. The next day, he will be welcomed at the White House by President Barack Obama and the two will meet in the Oval Office. On his third day in Washington, he will address Congress, the first time a pope has done so, before leaving that afternoon for New York. He will also visit Philadelphia before returning to Rome. \"It's an exciting time for our city and for our country,\" Cardinal Donald Wuerl, Archbishop of Washington, said at a news conference in Washington after the Vatican announced the schedule of the Roman Catholic leader. \"The Holy Father's immense popularity is something that will be reflected in his visit here. It's already being made apparent in the number of requests for information about the visit.\" Wuerl, a cardinal who helped elect Francis pope in 2013, said trip details are still being worked out. Wuerl said that the popemobile will be coming and: \"All of us who want to see him will have a chance to see him.\" The trip's Washington leg also includes visits to St. Matthew's Cathedral and the Basilica of the National Shrine of the Immaculate Conception after the White House. At the National Shrine, adjacent to The Catholic University of America, the pope will celebrate an outdoor Mass and give America a new saint by canonizing the 18th-century Spanish missionary Junipero Serra, who founded a series of missions in California. It is hoped that the site will be able to accommodate about 25,000 people. Tickets will be distributed through parishes. Large viewing screens are to be set up on the university's campus, and the Mass will be in Spanish, Francis' native language, Wuerl said. He didn't know what language the pope would use during other events in the city. At St. Matthew's Cathedral, where Wuerl spoke with reporters Tuesday, the pope will meet with U.S. bishops. The cathedral, site of the funeral for President John F. Kennedy in 1963, is also the location of the Red Mass celebrated annually before the opening of the Supreme Court's term and usually attended by a number of the justices. Wuerl said he did not know what the pope's message to Congress would be, but that he would be \"speaking as a pastor.\" Before the pope leaves Washington, he will visit a local Catholic church and meet those helped by a lunch meal program. The last pope to visit the United States was Francis' predecessor, Pope Benedict XVI, the pope emeritus, who visited Washington and New York in 2008. --- Follow Jessica Gresko at https://twitter.com/jessicagresko .", "external_links": [], "published": "2015-06-30T23:51:00.000+03:00", "crawled": "2015-07-01T04:49:26.000+03:00", "highlightTitle": ""}