{"organizations": [], "uuid": "ecac436bb51356389f2bed5bca110a86ed32da88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-technology-news/", "section_title": "TRAVEL TECHNOLOGY NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/multicom-secure-new-middle-east-business-with-afamia-tourism-llc/", "country": "US", "title": "Multicom secure new Middle East business with Afamia tourism LLC", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Multicom secure new Middle East business with Afamia tourism LLC | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "ecac436bb51356389f2bed5bca110a86ed32da88"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/multicom-secure-new-middle-east-business-with-afamia-tourism-llc/", "ord_in_thread": 0, "title": "Multicom secure new Middle East business with Afamia tourism LLC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Multicom secure new Middle East business with Afamia tourism LLC Published on : Thursday, July 23, 2015\nTravel technology specialist Multicom has secured another Middle East contract following its successful debut at the Arabian Travel Market (ATM) in Dubai.\nThe deal will see Dubai-based travel agency Afamia Tourism LLC utilise the many features and benefits of the innovative card payment facility MultiCommerce for its international business transactions.\nIt provides Afamia Tourism with the ability to eliminate their previous time consuming transaction processes at unfavourable exchange rates by switching to MultiCommerce.\nSigned in record time only days after the ATM in Dubai it is the first of a number of new business leads generated at the show with Multicom reporting they anticipate further opportunities to be closed in the coming weeks.\nThe growing demand for its travel management software and solutions generated by Multicom underpins its commitment and investment to establishing a strong presence in the Middle East market.\nThe company already supports Dubai-based South Travels who signed with Multicom last year while Rehlat Travel in Kuwait, iTrip, part of the Suadi-based travel giant Fursan Travel, and Adonis Travel of Istanbul are also recent new additions to their growing customer base in the region.\nMulticom Chief Executive John Howell said: “We’re delighted to have completed our quickest ever contract negotiation with Afamia Tourism and are confident several other deals that are in the pipeline will be signed in the very near future.\n“There is huge business potential for MultiCommerce in the region as it is a rapidly growing method of addressing global transactions at an affordable, manageable and efficient manner that was not previously available to this market\n“There is a very small number of people who can provide this facility of pre-paid cards for the travel industry in the Middle East and we are ideally placed to maximise the opportunities to grow our market share in the region.\n“We’re therefore confident that this will be the first of many new Multicom customers as we continue our ambitious growth plans across Europe and the Middle East.”\nTags: Afamia Tourism , Arabian Travel Market , Middle East , Multicom , MultiCommerce", "external_links": [], "published": "2015-07-23T03:00:00.000+03:00", "crawled": "2015-07-23T19:33:39.357+03:00", "highlightTitle": ""}