{"organizations": [], "uuid": "0e292d2f7e32ceda1fcc52281a8fd0be55e00895", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://blogs-images.forbes.com/aarontilley/files/2015/06/apple-watch-e1433461886231-1940x1090.jpg", "site_section": "http://www.forbes.com/travel/", "section_title": "Forbes - Travel Information and Travel News - Forbes.com", "url": "http://www.forbes.com/sites/aarontilley/2015/07/01/apple-watch-sales-arent-looking-so-hot/", "country": "US", "title": "Apple Watch Sales Aren't Looking So Hot", "performance_score": 3, "site": "forbes.com", "participants_count": 1, "title_full": "Apple Watch Sales Aren't Looking So Hot - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T05:59:00.000+03:00", "replies_count": 0, "uuid": "0e292d2f7e32ceda1fcc52281a8fd0be55e00895"}, "author": "Aaron Tilley", "url": "http://www.forbes.com/sites/aarontilley/2015/07/01/apple-watch-sales-arent-looking-so-hot/", "ord_in_thread": 0, "title": "Apple Watch Sales Aren't Looking So Hot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo by Chris McGrath/Getty Images)\nThe iPhone continues to sell like hot cakes — 74.5 million units in the second quarter of 2015 – but the Apple Apple Watch appears to be far away from catching up.\nPacific Crest Securities analyst Andy Hargreaves said on Wednesday that he’s trimming his estimates for Apple Watch sales. For fiscal 2015, he’s cutting sales to 10.5 million unit sales from 11 million. And for 2016 sales, Hargreaves cut his estimates from 24 million to 21 million.\n“Anecdotal evidence suggests Apple Watch demand is slowing quickly,” Hargreaves wrote in a research note to the brokerage firm’s clients. He continued, “Reviews of the device have been mixed, the fashion angle appears to be leaning a bit too much toward ‘calculator watch,’ and general consumer interest as measured by search volume is below the iPod.”\nOther Wall Street analysts are also not so confident in Apple Watch sales. In May, UBS UBS cut its Apple Watch shipment projection by 23% to 31 million. And initial interest from consumer with the Apple Watch was 20% of initial interest was with the iPhone when it first launched in 2007, UBS wrote in a note to clients.\nApple hasn’t yet disclosed any sales figures for the device.\nSales and early reviews of the Apple Watch indicate the watch has a while before it finds its footing.\nEven so, Apple doesn’t really need big Apple Watch sales numbers just quite yet with the iPhone accounting for nearly 70% of its revenue in the second quarter of this year. And iPhone sales are expected to keep growing strong. In the same Wednesday note to clients from Hargreaves, he bumped up his sales estimates for the iPhone — by 3.1% to 236 million in 2015, and by 3.8% to 218 million in 2016.\nBut maturation of the iPhone market may be close at hand. Hargreaves wrote, “We believe the majority of people earnings $15,000 a year or more in the world will own an iPhone exiting fiscal 2015. Our and Street estimates anticipate further growth in the iPhone user base going forward, which creates risk if we reach the point of complete saturation or if a competitor slows Apple’s share gains.”\nFollow me on Twitter @aatilley or send me an email: atilley@forbes.com", "external_links": ["https://twitter.com/aatilley"], "published": "2015-07-02T05:59:00.000+03:00", "crawled": "2015-07-02T05:25:17.000+03:00", "highlightTitle": ""}