{"organizations": [], "uuid": "8f357e8fdecf724f88aa52815381cdaa51ba80ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297721456094_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.torontosun.com/2015/07/07/heathrow-airports-scenic-route-shows-off-giant-metaphor-for-travel", "country": "CA", "title": "Heathrow airport's scenic route shows off giant 'metaphor for travel'", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Heathrow airport's scenic route shows off giant 'metaphor for travel'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T20:23:00.000+03:00", "replies_count": 0, "uuid": "8f357e8fdecf724f88aa52815381cdaa51ba80ea"}, "author": "", "url": "http://www.torontosun.com/2015/07/07/heathrow-airports-scenic-route-shows-off-giant-metaphor-for-travel", "ord_in_thread": 0, "title": "Heathrow airport's scenic route shows off giant 'metaphor for travel'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airports, Airlines & Security \nLONDON -- It's normally not a decision that matters very much. At an airport, do you take the elevator or escalator? \nBut at London Heathrow's newest terminal it matters a great deal if you want to see Richard Wilson's extraordinary, 78-metre-long aluminum sculpture \"Slipstream\" in all its silvery glory. \nArrive at Terminal 2 on the Underground or Heathrow Express train and you're faced with a choice: the elevator or a series of escalators to get to departures. \nIt's seemingly a no-brainer. The elevator will get you up in precisely 58 seconds, according to a sign that urges people to \"use the lifts.\" The escalators take three minutes -- an eternity, by comparison, for travellers in pre-check-in panic mode. \nThe elevator is also safer if you have heavy luggage. \nBut here's what you also need to know: only the escalators give you the full \"Slipstream\" experience. \nSuspended 18 metres above ground on four support columns, the sculpture swoops and soars and shimmers inside the terminal's hangar-sized open-air atrium. \nWhen it was unveiled in 2014 a critic for the London Guardian called it a \"sinuous metal serpent\" that resembles \"a wayward chunk ripped from a Frank Gehry building.\" Others were less kind. A writer in the London Evening Standard said it \"suggests mangled plane-crash wreckage.\" \nA year later, the work continues to evoke strong feelings. \n\"Among my airport colleagues, the general feeling is either you like it or loathe it,\" said Michela Gherardi, an Air Canada customer service representative assisting travellers in the departures hall. The airline moved its operations into Terminal 2 in June 2014 soon after the hub opened. \n\"For a lot of people, it looks too modern,\" she added. \"But I think it's awesome.\" \nThe escalators glide alongside the work -- the longest permanent sculpture in Europe -- providing an ideal moving platform from which you can inspect the rivets, marvel at the curves and wonder what the whole humongous thing is supposed to represent. \nWith the roar of aircraft from a nearby runway filling the cavernous space, it all makes for an absorbing encounter with a sculpture the size of a jumbo jet. As a bonus, you can pause at the two escalator transfer points to contemplate \"Slipstream\" more deeply, if you have the time. \nWilson has called the work \"a metaphor for travel,\" its shifting shapes capturing the flight path of an imaginary stunt plane. The renowned British artist took more than two years to make it. \nTerminal 2 is set for expansion under a contentious proposal by Heathrow to add a third runway. With the terminal already receiving 20 million passengers a year, Heathrow has billed \"Slipstream\" as one of Britain's most viewed public sculptures. \nThat may well be true, but on a day in May it seemed strangely invisible to throngs of travellers emerging from elevators and hurrying across an atrium platform to check-in counters, with few casting even a sideways glance in its direction. \nThe priority for passengers is to \"get to their flight safely and on time,\" Heathrow's media relations department said in an email, adding that for those not in a rush the escalators offer an alternative \"scenic route.\" \nSo here's a suggestion: get to the airport early. If you have a heavy bag, zoom up in the elevator and check it in. Then take the elevator back down, cross over to the escalator and enjoy the three-minute ride. The pace may be glacial, but the view is amazing. Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions and our netiquette rules . Sponsored Links", "external_links": [], "published": "2015-07-07T20:23:00.000+03:00", "crawled": "2015-07-07T23:15:48.000+03:00", "highlightTitle": ""}