{"organizations": [], "uuid": "0efd147b10d3cd8b9dbac1c76477f3ca4b203a76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/worlds-strangest-looking-airplane-closer-look-airbus-beluga-1", "country": "US", "title": "World's strangest-looking airplane? A closer look at the Airbus 'Beluga'", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "World's strangest-looking airplane? A closer look at the Airbus 'Beluga'", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T23:47:00.000+03:00", "replies_count": 0, "uuid": "0efd147b10d3cd8b9dbac1c76477f3ca4b203a76"}, "author": "senh", "url": "http://www.wopular.com/worlds-strangest-looking-airplane-closer-look-airbus-beluga-1", "ord_in_thread": 0, "title": "World's strangest-looking airplane? A closer look at the Airbus 'Beluga'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: World's strangest-looking airplane? A closer look at the Airbus 'Beluga' Journey nearly complete, a Boeing 747-400 Dreamlifter lands at Paine Field, home to Boeing's wide-body airplane factory, in December. The giant, specially modified cargo jet carries parts for the Dreamliner program. (Photo: Jeremy Dwyer-Lindgren, Special ... 07/17/2015 - 6:36 am | View Link AOPA Live This Week AOPA plans a change in course for Summit, with the big convention to be replaced by multiple regional events in years to come so we can meet you where you fly. Also this week, AOPA gets some backup in Congress on aircraft searches, we’ll take you flying ... 07/8/2015 - 1:00 pm | View Link 'Sky Whale' design brings future of flying closer Inside the world's strangest-looking airplane Equipped with ... the \"AWWA Sky Whale\" joins several other outlandish proposals for future aircraft that have cropped up in the last couple of years. Airbus predicted we'd be flying in transparent planes ... BING SEARCH: Flight simulator A flight simulator is a device that artificially re-creates aircraft flight and the environment in which it flies, for pilot training, design, or other purposes. It ... 07/17/2015 - 10:36 am | View Website International News | World News Get the latest international news and events from Asia, Europe, the Middle East, and more. See world news photos and videos at ABCNews 07/16/2015 - 6:44 pm | View Website Sonex -- The Sport Aircraft Reality Check! Sonex Aircraft, LLC is the designer and manufacturer of the Sonex and Waiex sport planes as well as the Xenos Motorglider. Sonex aircraft offer the Best Performance ... 07/16/2015 - 5:58 am | View Website World’s largest aircraft gets closer to take off | FOX31 ... LONDON — Look to the skies above London and you’ll see the usual suspects — rainclouds, planes and pigeons. But by the end of the year, you might ... 03/12/2015 - 9:57 pm | View Website World's biggest aircraft gets closer to takeoff The world's largest aircraft is also the newest. Airlander 10 is 302 feet long — large enough to hold about 14 of the first plane the Wright Brothers ...", "external_links": [], "published": "2015-07-17T23:47:00.000+03:00", "crawled": "2015-07-17T23:57:15.000+03:00", "highlightTitle": ""}