{"organizations": [], "uuid": "f122723a1a872b38cd3620b5cda154ba6b803c97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/unnamed-25.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/free-open-day-20-million-hi-tech-plantbank-australias-biggest-garden/", "country": "US", "title": "Free open day at $20 million hi-tech PlantBank in Australia's biggest gardenTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Free open day at $20 million hi-tech PlantBank in Australia's biggest gardenTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "f122723a1a872b38cd3620b5cda154ba6b803c97"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/free-open-day-20-million-hi-tech-plantbank-australias-biggest-garden/", "ord_in_thread": 0, "title": "Free open day at $20 million hi-tech PlantBank in Australia's biggest gardenTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Free entry at Macarthur’s $20 million Australian PlantBank, located in Australia’s largest botanic garden Published on : Thursday, July 16, 2015\nA free public open day at Macarthur’s $20 million Australian PlantBank, located in Australia’s largest botanic garden, will take place on Sunday, August 23, 2015.\nOpened in the Australian Botanic Garden, Mount Annan, in 2013, the Australian PlantBank was built to house seeds from all of Australia’s 25,000 native plant species in order to conserve the country’s flora for the future. The futuristic facility provides plant and seed scientists from the Royal Botanic Gardens and Domain Trust with research laboratories that specialise in horticultural research and conservation of Australian native flora. Some of the world’s ground breaking botanical research is undertaken at the Australian PlantBank in Macarthur.\nVisitors on August 23 can explore the PlantBank and join free talks with research findings and expert scientists giving valuable information on the important role plants play in our lives. A PlantBank app can also be downloaded to gain an in-depth insight into the exciting projects underway at PlantBank.\nIn the surrounding botanic gardens, visitors can bring a picnic rug, use BBQ facilities and enjoy one of Australia’s largest collections of wattle species which will be in spectacular bloom in the wattle garden on August 23. The open day will also feature art activities and entertainment as well as arts and crafts stalls, insect displays and demonstrations on plant research and conservation. Children can enjoy a range of free entertainment including face painting, seed planting and much more. A coffee cart and refreshments will also be made available.\nRelated Posts TripAdvisor touches mark of 100 million downloads for free app for iPhone and Android Chelsea Football Club Hosts Leaders Sport Summit 2013, the world’s most Prestigious Sport Business Summit Celebrate Australia Day in the Historic Macarthur Region Tourism Australia boasts 5 million Facebook page fans worldwide Tourism Shopping Reforms Come Into Effect Today", "external_links": [], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-17T20:19:42.000+03:00", "highlightTitle": ""}