{"organizations": [], "uuid": "a7d6f9740da71c0125aa4dbf34d297b50d0ed609", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/db7201989b27441ba463b036a44bb506-1020x680.jpg", "site_section": "http://seattletimes.com/rss/destinations.xml", "section_title": "The Seattle Times » Sections » Travel", "url": "http://www.seattletimes.com/nation-world/interview-suspect-in-sf-pier-attack-admits-he-shot-woman/", "country": "US", "title": "Interview: Suspect in SF pier attack admits he shot woman", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Interview: Suspect in SF pier attack admits he shot woman", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T16:57:00.000+03:00", "replies_count": 0, "uuid": "a7d6f9740da71c0125aa4dbf34d297b50d0ed609"}, "author": "The Associated Press", "url": "http://www.seattletimes.com/nation-world/interview-suspect-in-sf-pier-attack-admits-he-shot-woman/", "ord_in_thread": 0, "title": "Interview: Suspect in SF pier attack admits he shot woman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sound Transit planning heats up for light-rail expansion and public vote \n“All I want to say is that in the courts, I want them to give me the punishment I deserve and get it over with as soon as possible,” Sanchez said during the roughly 45-minute interview. \nKathryn Steinle, 32, was gunned down while out for an evening stroll at Pier 14 with her father and a family friend on Wednesday. Police said witnesses heard no argument or dispute before the shooting, suggesting it was a random attack. \nWitnesses at the popular waterfront attraction snapped photos of Sanchez immediately after the shooting, and the images helped police make the arrest while he was walking on a sidewalk a few blocks away. \nThe shooting has drawn national attention and criticism of the city’s sanctuary ordinance after federal officials revealed that Sanchez has seven felony convictions and was deported five times to his native Mexico. \nU.S. Immigration and Customs Enforcement had turned Sanchez over to authorities in San Francisco on March 26 on an outstanding drug warrant. \nThe Sheriff’s Department released Sanchez on April 15 after the San Francisco district attorney’s office declined to prosecute him for what authorities said was a decade-old marijuana possession case. \nICE spokeswoman Virginia Kice said the agency had issued a detainer for Sanchez, requesting notification of his release and that he stays in custody until immigration authorities could pick him up. The detainer was not honored, she said. \nFreya Horne, counsel for the San Francisco Sheriff’s Department, said Friday that federal detention requests are not sufficient to hold someone. Under the city’s sanctuary ordinance, people in the country illegally aren’t handed over to immigration officials unless there’s a warrant for their arrest. \nSanchez said he returned to the U.S. after being deported because he found better-paying jobs in the country than in Mexico. The Associated Press", "external_links": [], "published": "2015-07-06T16:57:00.000+03:00", "crawled": "2015-07-06T17:03:47.000+03:00", "highlightTitle": ""}