{"organizations": [], "uuid": "c7d98f8fa35d0167aa8eb152871ac5cb5528cd6d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/download-24.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tap-offers-tours-activities-new-partnership-viator/", "country": "US", "title": "TAP Offers Tours and Activities Through New Partnership with ViatorTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "TAP Offers Tours and Activities Through New Partnership with ViatorTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "c7d98f8fa35d0167aa8eb152871ac5cb5528cd6d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tap-offers-tours-activities-new-partnership-viator/", "ord_in_thread": 0, "title": "TAP Offers Tours and Activities Through New Partnership with ViatorTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TAP offers “Plan and Book” tour and activities to customers\nTAP, the leading Portuguese airline, and Viator have announced a new partnership to deliver tours and activities to the airline’s customers through website. The new partnership will enable TAP customers, through the “Plan and Book” tab on the airline’s homepage, to research and book tours, activities and attractions available in their destination.\nThe team at Viator is thrilled to be working with TAP and look forward to helping their customers discover and book the best things to – wherever they’re flying – to help them create unforgettable travel experiences. TAP joins more than 40 of the world’s leading airlines that have chosen Viator to help their customers explore their destination like an insider. Viator gives travelers who book with their airline partners, direct access to skip-the-line opportunities (perfect this time of year), VIP experiences, cultural sightseeing tours, specialized activities (including culinary tours, wine tastings and outdoor adventures) and much more. Plus, with Viator’s new Marketplace platform, the selection of things to do, and places to do them in, keeps on growing.\nHere’s a copy of the press release. Please let me know if you have any questions, and thanks for taking a look at the news. Have a wonderful afternoon!\nSource:-TAP\nRelated Posts PROMPERÚ to tap Indian travel market World-Renowned Voices Jet In For Conflict Conference New Urban Adventure in Singapore makes stopover sightseeing easy Austrian Airlines Financial Results as at 30 September 2013: Positive result gives optimism for break-even in 2013 Egypt’s tour guides’ new business: Producing opium", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-10T22:21:11.000+03:00", "highlightTitle": ""}