{"organizations": [], "uuid": "7c796f92ffbfc77019331b57df7344742079a744", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/airportairline/27497-turkish-airlines-united-states-expansion-continues-with-the-launch-of-nonstop-service-from-atlanta-to-istanbul-in-2016", "country": "US", "title": "Turkish Airlines’ United States expansion continues with the launch of nonstop service from Atlanta to Istanbul in 2016", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Turkish Airlines’ United States expansion continues with the launch of nonstop service from Atlanta to Istanbul in 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T15:30:00.000+03:00", "replies_count": 0, "uuid": "7c796f92ffbfc77019331b57df7344742079a744"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/airportairline/27497-turkish-airlines-united-states-expansion-continues-with-the-launch-of-nonstop-service-from-atlanta-to-istanbul-in-2016", "ord_in_thread": 0, "title": "Turkish Airlines’ United States expansion continues with the launch of nonstop service from Atlanta to Istanbul in 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airport & Airline Turkish Airlines’ United States expansion continues with the launch of nonstop service from Atlanta to Istanbul in 2016 Turkish Airlines’ United States expansion continues with the launch of nonstop service from Atlanta to Istanbul in 2016 Details Category: Airport & Airline   13:30 Turkish Airlines today announced the launch of a new service between Atlanta’s Hartsfield Jackson International Airport and Istanbul Atatürk Airport. The nonstop route will be the carrier’s second gateway in the Southeastern United States, following its nonstop service that is set to launch in late October from Miami International Airport. \nMomentum in the U.S. continues for the airline as Atlanta will become Turkish Airlines 9th United States gateway providing one-stop connections to over 270 destinations worldwide in 110 countries through its Istanbul hub. The city of Atlanta will also become the 13th destination in Americas for Turkish Airlines, the first airline in the world for number of countries and international destinations reached. “The opening of our Atlanta gateway means that we will now be connecting the World’s Busiest Airport to the World with only one connection,” said Ahmet Olmustur, CMO of Turkish Airlines. “We believe that the level of award-winning service and amenities we provide will continue to add a significant value to the defining of the passenger experience and what travelers have come to expect from long-haul international flights.” he added. The new daily nonstop service between Atlanta and Istanbul will launch on May 16, 2016 and be operated using the airline’s Boeing 777-300ER aircraft. Turkish Airlines hub at the Istanbul Atatürk Airport is a geographically attractive, “natural” transfer point that offers connections to over 140 cities within a 3-hour flight. The airport is also home to Turkish Airlines’ award-winning lounge, which caters to virtually every passenger need—whether it’s to sit quietly or find activities that help pass the pre-flight time. The lounge concept provides a wide range of activities and services that will bring additional satisfaction to customers with diverse requirements. Related articles", "external_links": [], "published": "2015-07-01T15:30:00.000+03:00", "crawled": "2015-07-01T15:41:42.000+03:00", "highlightTitle": ""}