{"organizations": [], "uuid": "7c9900e0adcb65f6937e81feb3f2938077c5d48e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150717Mexico.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/07/18/where-is-el-chapo-on-his-home-turf-no-ones-saying", "country": "US", "title": "Where is El Chapo? On his home turf, no one's saying", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Where is El Chapo? On his home turf, no one's saying", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T00:23:00.000+03:00", "replies_count": 0, "uuid": "7c9900e0adcb65f6937e81feb3f2938077c5d48e"}, "author": "Jill Replogle", "url": "http://www.ticotimes.net/2015/07/18/where-is-el-chapo-on-his-home-turf-no-ones-saying", "ord_in_thread": 0, "title": "Where is El Chapo? On his home turf, no one's saying", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Where is El Chapo? On his home turf, no one's saying Joshua Partlow |The Washington Post 29 mins ago From: To: \nA cemetery known for the many prominent narco-traffickers who are buried there sits on a hilltop in Santiago De Los Caballeros, Mexico, July 17, 2015. Jonathan Levinson | The Washington Post \nBADIRAGUATO, Mexico — El Chapo’s gone now, on the far side of his tunnel, a man on the lam in a wide-open world. \nBut where would he go? \nIf the past is a guide, questions about the billionaire drug baron, Joaquín “El Chapo” Guzmán, tend to find their answers in the rugged Sierra Madre mountains. In these electric-green highlands of eastern Sinaloa state, checkered with plots of marijuana and opium poppy, Guzmán was raised into his illicit profession. \nIt’s a region where peasants praise the trafficker for giving them jobs drilling post-holes and stringing wire fencing on his cattle ranches. Where residents tell tales about how his buzzing Cessnas would air-drop money into remote villages. Here, on the poorly paved, switch-backing road to Guzmán’s hometown in La Tuna, convoys of Mexican soldiers and police are now swerving around fallen boulders as their hunt for Guzmán begins anew. \n“In situations like this, people tend to be creatures of habit,” Jack Riley, the deputy administrator of the U.S. Drug Enforcement Administration, said in an interview. “If he was comfortable there and in control of the surroundings and has warning signals when the good guys are approaching, that’s probably what he’s going to do.” \n“What matters is that he’s out,” Riley said. “And we’ve got to get the cuffs back on that guy.” \nOn Saturday night, Guzmán escaped from his cell inside the Altiplano maximum security prison in Mexico state, slipping through a hole cut in the floor of his shower stall and out an underground tunnel. He was gone 18 minutes before anyone noticed his absence. He could be anywhere. \nTop Mexican security officials informed legislators on Thursday that Guzmán is likely still in the country, and may have not left the central region, where the Altiplano prison is located, according to Mexican news reports. \nMexican marines, soldiers and some 10,000 federal police officers are involved in the hunt for Guzmán, authorities said. They have set up checkpoints to search vehicles in nearly two dozen states. U.S. law enforcement officials said they would do everything in their power to help recapture Guzmán, including providing intelligence and using technology to monitor cellphones. Such phone tracking was crucial in the roundup of Guzmán’s lieutenants and bodyguards that led to his capture in a condominium in the beach town of Mazatlán in February 2014. Guzmán was known to spend time in mountain hideouts before that arrest. \nThe U.S. government had formally requested Guzmán’s extradition less than three weeks before his escape from the Altiplano prison. He faces indictment in federal courts in several American states for murder and drug trafficking. American officials had wanted to hold Guzmán so that he could not escape and so that they could gain his insights into the drug trade. But Mexican officials took it as a point of pride that their most important criminal could be held securely within their country. \nSince his embarrassing escape, Mexican authorities have vowed they will not let him go unpunished. \n“We want to be very clear: We’re going after everyone involved, we’re going after everyone who betrayed our institutions, and with them, our society,” Interior Minister Miguel Ángel Osorio Chong told reporters. “The objectives are clear: recapture this criminal and punish each and every one of his accomplices.” \nBut if Guzmán has headed back to his home region in Sinaloa, catching him will be a daunting task, given the difficult terrain, the local support for the drug lord and the astounding wealth and evasive skill of Guzmán’s inner circle. Up and down the hills are networks of spotters, often teenagers on four-wheelers. Residents tend to back Guzmán, whose business interests permeate the Sinaloa economy, from local vegetable markets to real estate to auto sales. After his arrest last year, hundreds of people marched in the state capital of Culiacan in protest. \nA girl holds her baby cousin at her family’s restaurant on in Santiago De Los Caballeros, Mexico. This area is a base of operations for El Chapo’s Sinaloa cartel and his support among the locals, combined with the area’s rugged terrain, will make capturing him a challenge should he choose to return to the area, July 17, 2015. Jonathan Levinson/The Washington Post \nPeople here are accustomed to keeping quiet, and many hesitated to even mention Guzmán’s name when a foreigner with a notebook came around asking. When they bumped into verbal dead ends, residents would refer to him as “the one frequently mentioned recently” or El Viejón, “the big old man.” \n“To judge if he’s done something bad or not, that’s God’s job,” said Esmirle Almeda Ortíz, the director of the medical clinic in Badiraguato, the seat of the municipality. \nA 46-year-old clothing-store owner who gave only her first name, Maria, noted that sales dropped off sharply after Guzmán’s arrest, as federal forces pushed deeper into the mountains. \n“Right now there’s a lot of government all around, and people don’t come down to town because they’re afraid. We’re not selling anything,” Maria said. “There’s nobody in the plaza right now. Just journalists.” \nGuzmán was “a normal guy, very good with people,” she said. “When somebody needs something, he helps them.” \nGuzmán’s home region has produced many famous narcos, as they are from illicit family businesses linked by blood ties. The traffickers include Rafael Caro Quintero, who was released from prison in 2013, despite being convicted of the killing of DEA agent Enrique “Kiki” Camarena in 1985. In the tiny roadside town of Santiago de los Caballeros, residents said the crumbling marble tomb that looks like a Roman ruin was built for their local boy, Ernesto Fonseca Carillo, a drug lord now serving his sentence in the prison where Guzmán had been held. \nIn the town shop, Francisco López Peña, 53, said Guzmán employed many residents and has a reputation for treating people well. \n“They say that jobs went away when he got arrested,” López said. \nBut not everyone was enamored of the famous outlaw. \n“For some people he’s a hero but not for me and my family,” said a man in a computer shop who asked not to be identified out of concern for his safety. “For me, a hero is someone who works day after day, under the hot sun, who has to provide for his family without many resources, that’s a hero to me. But this guy, no.” © 2015, The Washington Post", "external_links": [], "published": "2015-07-19T00:23:00.000+03:00", "crawled": "2015-07-19T00:52:49.000+03:00", "highlightTitle": ""}