{"organizations": [], "uuid": "629834940c29ef2b85813151bf4da7f3217fe0c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/07/26/travel/26BITESSUB/26BITESSUB-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT &gt; Travel", "url": "http://www.nytimes.com/2015/07/26/travel/restaurant-report-rj-lounge-and-supper-club-in-oklahoma-city.html", "country": "US", "title": "Restaurant Report: R&J Lounge and Supper Club in Oklahoma City", "performance_score": 1, "site": "nytimes.com", "participants_count": 1, "title_full": "Restaurant Report: R&J Lounge and Supper Club in Oklahoma City - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T15:51:00.000+03:00", "replies_count": 0, "uuid": "629834940c29ef2b85813151bf4da7f3217fe0c9"}, "author": "Kathryn O’shea-Evans", "url": "http://www.nytimes.com/2015/07/26/travel/restaurant-report-rj-lounge-and-supper-club-in-oklahoma-city.html", "ord_in_thread": 0, "title": "Restaurant Report: R&J Lounge and Supper Club in Oklahoma City", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " When I tugged open the door to R&J Lounge and Supper Club, a midcentury-inspired restaurant, I expected plumes of cigarette smoke to waft into the air. It’s a nonsmoking place, but looks like a set from my imagined sequel, “Goodfellas Take the Middle West” — red and gold flock wallpaper, burgundy Naugahyde booths, a neon sign out front that washes its somewhat seedy location (up an alley next to a tire dealership) in a warm fluorescent glow.\nJonathon Stranger and Russ Johnson, the owners and chefs, made a name for themselves in 2010 when they founded Ludivine, a restaurant that celebrated ingredients like roasted bone marrow and sea urchin. At their new venture, which opened in September, nostalgia is the main course. “At R&J, we just want it to feel good,” Mr. Stranger said.\nFor inspiration, the chefs combed through antique menus at the New York Public Library and ransacked their family recipe boxes. The result is edible Americana — and with apologies to Betty Crocker , it’s great. The chicken with buttermilk and dill dumplings is Mr. Stranger’s grandmother’s recipe, spiced with Aleppo pepper. The Spreads Plate comes with pimento cheese, cream cheese coated in Jezebel sauce, and a ham salad made exactly the same way as one once sold at Crescent Market, a beloved local grocer before “the Midwest got Walmart-ized,” as Mr. Stranger put it.\nWith beef stroganoff, fried catfish, and pork and beans rounding out the Hot Plates, most menu options are a far cry from healthful. But an occasional meal here is probably, as the old joke goes in this state, O.K.\nDitto the drinks menu. My virgin Mai Tai arrived in a ceramic tiki mug, topped with a cocktail umbrella. I’d wanted to try the minty Grasshopper (but also virgin) because I was driving. The throaty-voiced waitress informed me that, as an ice cream-based drink, it was premixed and “already bashed out,” a line that in itself seemed cinematic.\nR&J could feel kitschy or forced, but it doesn’t. The eclectic music selections, everything from the Scissor Sisters to Buddy Holly, help. The 1980s classic “Don’t You (Forget About Me)” was playing when we walked in. For a place intent on resurrecting food and drink vestiges of the past, it could have been an anthem.", "external_links": [], "published": "2015-07-24T15:51:00.000+03:00", "crawled": "2015-07-24T16:05:38.603+03:00", "highlightTitle": ""}