{"organizations": [], "uuid": "adef7fbbedd00a473469716e5aefc25d16553062", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rocketnews.com", "main_image": "", "site_section": "http://www.rocketnews.com/category/travel/feed/", "section_title": "» Travel", "url": "http://www.rocketnews.com/2015/07/beautiful-bermuda-10-reasons-to-book-a-trip/", "country": "US", "title": "Beautiful Bermuda: 10 reasons to book a trip", "performance_score": 0, "site": "rocketnews.com", "participants_count": 1, "title_full": "Beautiful Bermuda: 10 reasons to book a trip", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T21:54:00.000+03:00", "replies_count": 0, "uuid": "adef7fbbedd00a473469716e5aefc25d16553062"}, "author": "Editor", "url": "http://www.rocketnews.com/2015/07/beautiful-bermuda-10-reasons-to-book-a-trip/", "ord_in_thread": 0, "title": "Beautiful Bermuda: 10 reasons to book a trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted on July 15, 2015 by Editor \nSteeped in British tradition and tinged with Caribbean charm, Bermuda is a fish-hook shaped string of 181 islands, islets and rocks; most of them uninhabited and some so small there’s barely room for the birds to build their nests in the trees. Anchored in the turquoise Atlantic Ocean 650 miles east of North Carolina, temperatures rarely reach 90 degrees Fahrenheit and high season is from April to November when the weather is warmest, unlike other Caribbean islands that swarm with tourists during the cold winter months back home. Salt-in-the-air and sand-in-the-hair beaches are pink and there are more golf courses per square mile here than anywhere else in the world. Finding inspiration on the island, novelist Mark Twain said it best when he noted, “You can go to heaven if you want. I’d rather stay in Bermuda.” \nLong and shorts of it Not to be confused with cargo shorts, clam diggers or Capri pants, Bermuda’s iconic shorts are cuffed one to three inches above the knee – depends on whom you ask – and worn with dark knee socks, dressy shoes, short-sleeved shirt and dark blazer. (Photo: Bermuda Tourism Authority) \nTourists might find the sight of a businessman in pink shorts , blazer and tie amusing but as the national dress of the island, Bermuda shorts are not only worn in the boardroom but also by police officers, in the House of Assembly and by just about everybody else. Not to be confused with cargo shorts, clam diggers or Capri pants, the classic shorts are cuffed one to three inches above the knee — depends on whom you ask — and worn with dark knee socks, dressy shoes, short-sleeved shirt and dark blazer. Considered appropriate business attire for men, the iconic shorts originated with the British Army who designed them for their officers stationed in the tropics. During World War II when there was a clothing shortage on the island, two banks in Bermuda asked a local tailor to make the same shorts for their male employees. Originally stitched from itchy grey flannel, each bank employee was given two pairs of heavy grey woolen socks to complete the outfit. To make them more comfortable in the heat, the shorts were eventually made of lighter materials and today come in the colors of the rainbow. Etiquette dictates the shorts should be a different color from the blazer and worn only between April and November when it’s the warmest on the island. A straw hat is optional. If you’re looking to do as the Bermudans do, the biggest selection of shorts is at the English Sports Shop and A.S. Cooper Sons on Front Street in Hamilton. \nPretty in Pink Check out the one-mile trail that connects Horseshoe Bay to Warwick Long Bay; a quieter no-frills stretch with a jagged offshore coral island that looks like it’s floating above the water. (Photo: Bermuda Tourism Authority) \nIf pink sandy beaches are what you’re looking for, head to the south coast. Among the most photographed in the world, the sand gets its famous hue courtesy of crushed coral that, when mixed with tiny seashells, results in a pinky color. Favorite slivers include Astwood Cove that is remote enough to keep the crowds at bay and fabulous enough for weddings and John Smith’s Bay that is practically carpeted with that pretty pink sand. Family-friendly with lifeguards, water sports and a snack hut, the beach at Horseshoe Bay is a gentle crescent between craggy rock outcrops. Terrific for sand castle building, this year marks the 20th anniversary of the Bermuda Sand Sculpture Competition held this year on September 5th. Check out the one-mile trail that connects Horseshoe Bay to Warwick Long Bay; a quieter no-frills stretch with a jagged offshore coral island that looks like it’s floating above the water. On the east coast, Tobacco Bay earned its name when survivors of the seventeenth-century English sailing ship ‘Sea Venture’ discovered tobacco plants growing near the beach. The most popular strip in St. George’s, the limestone formations are eye-catchers and below the waves, parrotfish and sergeant majors are the main attractions. Blue and white sun loungers rent for USD$15.00 per day and with no undertow and a water temperature of 84 degrees, a dip is like a soak in a bathtub. \nRegal on the reefs There’s nothing quite like a Bermuda sunset over the island’s iconic pink sands. (Photo: The Reefs) \nThere are about 2,000 hotel rooms on Bermuda. You’ll find 62 of the prettiest perched on a cliff above a pink sand beach, in the pinky peach Reefs Resort . Owned by the Dodwell family for more than three decades, you can count on a warm welcome. Upscale but not stuffy, rooms and suites all feature ocean views, patios and breakfast. A freshwater infinity pool invites on a sunny afternoon, gratis watersports and tennis courts keep guests busy and for the ultimate relaxation; try a snooze in the hammock or a Lime Ginger Salt Glow at La Serena Spa with its own moon gate and stash of the exclusive Elemis of London products. For a nibble and a nosh, Afternoon tea is poured (yes, crust-less sandwiches are served), Tuesday evening is for wine tastings, grilled calamari and a ‘Coconut Colada’ with a honey and toasted coconut rim is on the menu at the open-air Coconuts with tables for two on the sand and once a week, ‘Chef’s Table’ at Aqua Terra is a seven-course feast with wines to match. \nGetting around, Bermuda style Looking to learn AND get around? Try hiring a taxi driver/tour guide like Larry Rogers. (Photo: Melanie Reffes) \nMeasuring 21-square-miles, it’s easy to get from one end of Bermuda to the other on a pink and blue Bermuda Breeze Bus (a day pass goes for USD$19.00), rented scooter (remember to scoot on the left side of the road), ferry from Hamilton, St. George and the Dockyard or you can hire a taxi driver who is also a tour guide. With about 3000 cab drivers (65,000 people live on the island), it’s no surprise 400 are licensed tour guides. This means they are certified by the Bermuda Tourism Authority and have passed an exam ensuring they know enough about the island to entertain tourists who want to learn. Larry Rogers is one of those Blue Flag guides and for USD$50.00 an hour, he’ll happily take up to four people on a tour pointing out the moon gates, pink beaches, hip happy hours and if you ask nicely, he’ll show you where actor Michael Douglas and his family lives (in one of the Ariel Sands Villas) and where former New York City Mayor Mike Bloomberg plays golf. (Mid Ocean Club). \nSwizzle and Swagger Aptly christened ‘The Rum Swizzle’, a generous mix of powerhouse rums like Goslings Black Seal, orange, lemon and pineapple juices is poured into a pitcher, strained into cocktail glasses and priced at USD$7.50 for a glass and USD$23.75 for a jug. (Photo: Melanie Reffes) \nThe oldest pub in the island, Swizzle Inn on Bailey’s Bay near the Crystal Caves opened in 1932 in a 17th century roadside house. Family-owned for generations and with a guest book that dates back to 1942, the Inn also lays claim to inventing Bermuda’s national drink. Aptly christened ‘The Rum Swizzle’, a generous mix of powerhouse rums like Goslings Black Seal, orange, lemon and pineapple juices is poured into a pitcher, strained into cocktail glasses and priced at USD$7.50 for a glass and USD$23.75 for a jug. Packing a big punch and doing their snappy slogan ‘Swizzle Inn, Swagger Out’ proud, chefs also make a mean fish sandwich like the ‘Back O’ Town’ with spicy slaw. Rustic and charming, the walls and ceiling are decorated with thousands of business cards and scribbled signatures from happy sippers. A second Swizzle is open at 87 South Road in Warwick Parish. \nFarm-to-table \nPart hippie and part farmer, Tom Wadson opened his farm in 1976 with a $5000 loan and a sense of humor. “I used the money to buy tools and a few bottles of rum” he quips as he shows tourists the greenhouse where he grows ten kinds of hydroponic lettuce. Fifty vegetable, herb and fruit crops also grow on the farm, which includes a small market that stocks goodies like locally made soap and gourmet cheese. Pigs, chickens and sheep live on the farm as do geese and ducks at Christmas and other special times of the year. Hour-long tours are offered for USD$6.00 per person with reservations needed . If you’re looking for a more extensive introduction, the new ‘ Wadson’s Farm-to-Table ‘ starts with a tour and wraps up with a sumptuous dinner prepared by The Reefs Resort Chef Doug Sisk, who cooked for Presidents George H.W. Bush and Bill Clinton and the Prime Minister of Jamaica. “This is the real deal,” the Chef tells tour-goers, “We go beyond the clichéd farm-to- table by inviting our guests to pick exactly what they’d like me to prepare for their dinner.” The tour and dinner is offered Tuesday nights at The Reefs for USD $150.00, per person. \nWalk in the park The US gave the land back to the Bermudian government in 2001 and today Cooper’s Island Nature Reserve is open to the public who come to swim, picnic, bird watch ( 600 nesting pairs of Longtails have been spotted), snorkel and do pleasantly nothing on a sunny day. (Photo: Bermuda Tourism Authority) \nOn the southeast tip of Bermuda, Cooper’s Island is a hidden gem with an intriguing past. The nature reserve with shallow water beaches, sand dunes, pine and palm trees and rocky shorelines was used in 1941 by the US Army to store ammo bunkers and underground tanks. Years later, the Air Force set up shop, as did the Navy, leaving behind an anchor that can still be seen near one of the beaches. NASA arrived in 1960 to gather tracking data from its spacecraft. Interestingly, there was a McDonald’s on the base; the one and only ever in Bermuda. Cooper’s Island was a restricted area until 1995 when the base (and McDonald’s) closed. The US gave the land back to the Bermudian government in 2001 and today Cooper’s Island Nature Reserve is open to the public who come to swim, picnic, bird watch ( 600 nesting pairs of Longtails have been spotted), snorkel and do pleasantly nothing on a sunny day. Remnants of the old bunkers and buildings remain and although there is something ghostly about them, exploring is fun even for non-history buffs. Accessible only on foot, there is no admission price, no cars or pets allowed and barely any people. Quiet beaches like Clearwater Beach Park are ideal for families and for turtle spotting; Fort Hill Bay Beach, Well Bay Beach and Turtle Bay Beach are the only beaches where the Loggerhead turtle has successfully hatched eggs in Bermuda in the 20th century. To get there, hire a taxi to the perimeter, book a boat excursion or hop bus #6 from St. George’s, walk west along Ruth’s Bay Road to Orange Hole Road and you’ll see Cooper’s Island Road. \nMoon gate magic If you’re hedging your bets, arrange a moment at one of the most photographed, the moon gate at Palm Grove Gardens. (Photo: Melanie Reffes) \nAnyone with a little romance in her (or his) soul will be fascinated by the many moon gates that dot the island. As the story goes, a Bermudian sea captain built the first moon gate in 1860 after seeing one in China. Often decorated with colorful blooms, locals believe a bright future follows couples who are photographed in front of one of the horseshoe-shaped limestone passageways or newlyweds who step through them. More local legend has it that a kiss under a moon gate brings good luck. If you’re hedging your bets, arrange a moment at one of the most photographed, the moon gate at Palm Grove Gardens. Owned by the wealthy Gibbons family whose money comes from car dealerships, banks and real estate, the gate is open to the public weekdays from Monday to Thursday and for weddings by request to the family. \nMenu medley The newest kid on the culinary block, celebrity Chef Marcus Samuelsson of New York’s Red Rooster Harlem fame has done it again in his namesake restaurant in the former ballroom at the Hamilton Princess. Chef Marcus Samuelsson is pictured. (Photo: Marcusbermuda.com) \nThe newest kid on the culinary block, celebrity Chef Marcus Samuelsson of New York’s Red Rooster Harlem fame has done it again in his namesake restaurant in the former ballroom at the Hamilton Princess. The fusion mash-up menu of British, Caribbean and Portuguese flavors start with an addictive bowl of spicy nuts, fried olives and dried cherries that pairs nicely with a Kir Kir champagne and watermelon cocktail or a Colada Colada with rum, mango, lime and mint. Move on up to Steak Frites pretty on a plate with parmesan fries, green beans and a creamy béarnaise sauce, a bowl of Bermuda onions (the flat-topped sweet kind), blackened fish with grits and pepper jam and to share; ceviche made with a local white fish called Amberjack is delectable. Skip dessert tomorrow and go for the fresh berries and sorbet. Light and airy with an open kitchen presided over by New Jersey native Chef Leo Marino, the way-too-cool hot spot hovers over the Atlantic Ocean with seating on the wraparound terrace the cherry on the cake. \nWild for Wahoo For something a little more down to earth, head to Wahoo’s Bistro on Water Street in St. George’s on the most easterly end of the island. (Photo: Melanie Reffes) \nOn the most easterly end of the island, the views from the terrace at Wahoo’s Bistro on Water Street in St. George’s are nearly as delicious as the tacos, nuggets and fish chowder made with the mildly flavored flaky wahoo white fish. Owned by Austrian expat Alfred Konrad who pays tribute to his roots with his lemony garlic wiener schnitzel, the casual eatery is an appetizing refueling pit stop after exploring the historic old town that is a UNESCO World Heritage site. \nLooking to go deep-sea fishing for some Wahoo? We know where you can find some! Click through the gallery below for some awesome shots of what you might catch.", "external_links": [], "published": "2015-07-15T21:54:00.000+03:00", "crawled": "2015-07-16T00:17:31.000+03:00", "highlightTitle": ""}