{"organizations": [], "uuid": "f4972fe725a5acb1cdbbe4f637663d828c90b19f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-07/beach_holiday_03072015.jpeg", "site_section": "http://www.themalaymailonline.com/feed/rss/travel", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/going-off-the-grid-how-to-deal-with-your-boss-emails-when-travelling", "country": "MY", "title": "Going off the grid? How to deal with your boss’ emails when travelling", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 1, "title_full": "Going off the grid? How to deal with your boss’ emails when travelling", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T05:31:00.000+03:00", "replies_count": 0, "uuid": "f4972fe725a5acb1cdbbe4f637663d828c90b19f"}, "author": "By Seth Porges", "url": "http://www.themalaymailonline.com/travel/article/going-off-the-grid-how-to-deal-with-your-boss-emails-when-travelling", "ord_in_thread": 0, "title": "Going off the grid? How to deal with your boss’ emails when travelling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Going off the grid? How to deal with your boss’ emails when travelling By Seth Porges Print Article \nSometimes, we overestimate how well technology has adapted to our work-obsessed culture. — Reuters pic NEW YORK, July 3 — Plenty of employers expect workers to make themselves available virtually all the time, especially when they’re travelling for business. Unfortunately, that expectation overestimates how well technology has adapted to our work-obsessed culture. For all the connectivity we’ve got, there are a few key moments on every business trip when “I’ll be online the whole time” is still sort of a lie. Here are tips to patch over those trouble spots and make sure that your boss’s email doesn’t coincide with you going temporarily off the grid. \nAt the hotel \nYou check into a luxury hotel, and everything seems to be perfect. Fantastically fluffy towels and bathrobe? Check. Totally necessary telephone in the bathroom? Check. Wi-Fi that’s speedy enough to live that digital nomad life and actually get work done while on the road? Ummm…. \nTo stay at hotels is to suffer through shoddy Wi-Fi. And while it’s easy to search for a property that has a pool, or a golf course, or an on-site aromatherapy spa, until you check in, it’s pretty much impossible to know if the promised Wi-Fi will speed through streamed episodes of Orange Is the New Black or choke up over a simple email. \nIf you’re on deadline, need to upload a large file, or have to make a Skype call, a weak Wi-Fi signal can leave you unable to do your job. Adding insult to injury, this shoddy Wi-Fi can be stupidly expensive — costing almost much for a single day as your home cable connection does for a month. \nOne solution that has earned a spot on my must-check list before booking a trip: Hotel WiFi Test, a new site that lets you search easily for hotels by the quality of their Wi-Fi. \n“One time I found myself staying at a five-star hotel in Shanghai with paid Wi-Fi and could not complete an important piece of work because of an unusable Internet connection,” says Yaroslav Goncharov, the site’s founder and chief executive officer. “There was simply no way to verify if a hotel had good Wi-Fi. I decided to do something about it when I had a chance.” \nUsing data crowdsourced from travellers (the site lets them test their hotel Wi-Fi speed and banks the info), the site delivers an “expected speed” for future guests. Hotel Wifi Test’s stash of rated hotels is still growing, but it covers more than 20,000 hotels in more than 500 cities. In some cities, its hotel list is fairly decent: More than 270 hotels are reviewed in New York and London. \nThis site makes painfully clear something most of us already suspected: There is almost no correlation between a hotel’s price or star rating and its Wi-Fi performance. And hotels that charge for Wi-Fi often offer service that’s inferior to what other chains offer for free. The fastest hotel Wi-Fi in New York, according to the site, is the free service found at the three-star Nyma Hotel, where the Wi-Fi clocks in at an expected speed of 71.2 mbps. For comparison, the Mark, a tony hotel on the Upper East Side, chugs along at just 1.7 mpbs, despite its five-star rating. \nWhen you’re overseas \nTime was, an international trip could turn your mobile phone into a serious liability. Forget to call ahead and line yourself up for international roaming? Don’t be surprised if you find yourself with a comically large bill. \nRemarkably, things have gotten a lot better — at least when it comes to T-Mobile and Sprint, which now offer free international data roaming in a ton of countries (more than 120 for T-Mobile, 22 for Sprint). Depending on what country you’re in, the connection could run a bit slower than the 4G you’re used to, but for basic mobile business, it should be more than enough. \nThe best part: Thanks to the mobile hot-spot functionality now available in virtually every smartphone, these roaming phones can easily extend their connection to tablets, laptops, or anything else with a thirst for Wi-Fi. Depending on your specific plan, mobile hot-spot functionality may come as an add-on that costs a bit, but the new Sprint and T-Mobile deals ensure that it’s no more expensive to use in Berlin than in Boston. \nOn the road \nOne last piece of technology worth mentioning: If you find yourself literally working while on the road — as in, from inside of an automobile — you may want to invest in a mobile signal booster. These devices, such as the well-regarded WeBoost Drive 4G-X, are wired directly into your car to take whatever weak signals you may be driving through and amplify them into something more useful. These devices run from a few hundred to move than a thousand dollars and often require a bit of installation, but if your car doubles as your office-on-wheels, it could be worth it. — Bloomberg More Stories for You:", "external_links": [], "published": "2015-07-03T05:31:00.000+03:00", "crawled": "2015-07-03T06:32:06.000+03:00", "highlightTitle": ""}