{"organizations": ["Spirit Airlines", "Spirit Airlines Encourages Travelers"], "uuid": "eff5bb41a8924eef7996d7957ef2ad5881e30b23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/297280?filename=297280.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/07/15/752443/10141881/en/Spirit-Airlines-Encourages-Travelers-to-Demand-Their-Money-Back.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "Spirit Airlines Encourages Travelers to Demand Their Money Back", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Spirit Airlines Encourages Travelers to Demand Their Money Back", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T21:48:00.000+03:00", "replies_count": 0, "uuid": "eff5bb41a8924eef7996d7957ef2ad5881e30b23"}, "author": "", "url": "http://globenewswire.com/news-release/2015/07/15/752443/10141881/en/Spirit-Airlines-Encourages-Travelers-to-Demand-Their-Money-Back.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "Spirit Airlines Encourages Travelers to Demand Their Money Back", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spirit Airlines Encourages Travelers to Demand Their Money Back Major Airlines Bundle \"Free\" Items Into Prices, But Waste Billions of Customer Dollars July 15, 2015 14:48 ET | Source: Spirit Airlines \nMIRAMAR, Fla., July 15,   For decades, the major airlines have been playing a psychological trick on their passengers. They charge people very high airfares, and then tell them they are giving away different items and services for \"free.\" In reality those airlines are forcing all of their customers to pay for those items upfront with bundled, all-inclusive fares. Spirit Airlines (NASDAQ: SAVE ) wants air travelers to know they've been bundled by other airlines and is giving travelers a way to fight back. \nEvery product or service on an airline has a built-in cost: Agents handling bags and printing boarding passes, the cost of beverages, food, and magazines and stocking these items on planes, and the extra costs in fuel for the added weight of carry-on bags and in-flight entertainment systems, just to name a few. Many consumers don't realize that airlines pass those costs on to their customers and, even if the product or service isn't used, the airline still financially benefits. \n\"Bundling is a practice that, at best, is less-than-transparent,\" said Spirit's President and CEO Ben Baldanza. \"When airlines tell their customers the item or service is free, it just isn't true. We feel air travelers should only have to pay for what they want or need – not be forced to pay for everything an airline may offer. We did the math on all those unused items and it adds up to billions of customer dollars.\" \nAt Spirit, customers pay for their seat and a personal item to get them from point A to point B. Spirit calls this their Bare Fare®. If you want other options they are available, but Spirit puts you in charge by allowing you to pay only for what you want, not what you don't. This is called Frill Control®. This unbundled approach allows Spirit customers to pay the lowest total price for air travel. According to the Department of Transportation, Spirit's fares are 40 percent less than other airlines, on average. Even after adding optional items Spirit's total price is still 30 – 35 percent lower, making Spirit the smart choice for air travel. \nTo understand the impact of airline bundling, Spirit conducted a nationwide study of air travelers regarding their most recent flight. The survey reveals that many passengers skip the complimentary services that they paid for in a bundled price. For example, one in four (25%) passengers didn't bring a \"complimentary\" carry-on bag, but likely had to pony up as much as $35 within their ticket price for that amenity. In some cases, customers lost that money because the overhead bin space was full, and they were forced to have their bag checked. With 586 million travelers on major airlines in 2014, Spirit estimates customers spent more than $5 billion on carry-on bags that they didn't use. \nIt may seem small, but the costs for those \"free\" snacks add up too. Twenty percent of passengers skipped the complimentary snacks, but may have been charged up to $3.50 for each one. That's approximately $410 million of unused snacks that airlines benefited from by charging their customers in the price of their ticket. \nTo help air travelers understand this long-held less-than-transparent practice, Spirit has introduced a vigilante lawyer team called \"The Unbundlers\" dedicated to getting air travelers their money back. The fictitious, but hilariously-truthful duo encourages travelers who have been bundled to directly calculate how much money they lost as a result of not checking a bag, passing on 'free' soda, or not using various other products and services. They can demand their money back by posting a message on Twitter to the offending airline. You can see The Unbundlers in action at www.Unbundlers.com \n\"It's a fun way to point out a serious issue,\" said Baldanza. \"At Spirit we pride ourselves on being very upfront and honest about what you get – and what you don't – when you purchase tickets on our airline. All airlines should be as transparent with their customers and should let them know exactly what they're paying for.\" \nOther results of the survey, conducted by Toluna Research for Spirit Airlines: 25% of air travelers did not bring a carry-on 20% skipped the snack (peanuts, chips, etc.) 21% said no to coffee, tea, or soda 40% didn't read the in-flight magazine 41% didn't check-in with an agent 52% didn't use WiFi (however other surveys suggest WiFi usage is below 10%) \nIt's time to take a stand against being bundled. For travelers looking for crazy low fares and great deals on vacation packages to all of Spirit's destinations they can go to www.spirit.com . \nAbout Spirit Airlines: \nSpirit Airlines (NASDAQ: SAVE ) is committed to offering the lowest total price to the places we fly, on average much lower than other airlines, on average nearly 40% less.* Our customers start with an unbundled, stripped-down Bare Fare™ and get Frill Control™ which allows them to pay only for the options they choose – like bags, seat assignments and refreshments – the things other airlines bake right into their ticket prices. We help people save money and travel more often, create new jobs and stimulate business growth in the communities we serve. With our modern and fuel-efficient all-Airbus fleet, we operate more than 360 daily flights to more than 57 destinations in the U.S., Latin America and the Caribbean. Come save with us at www.spirit.com . \n*U.S. Department of Transportation statistics \nMEDIA NOTE: Spirit aircraft photos and video b-roll are available in the press room section of spirit.com at http://www.spirit.com/Pressrelease.aspx . \nResearch Note: Spirit Airlines, in conjunction with Toluna Research, commissioned a survey of 2,093 nationally representative U.S. adults, ages 18+, on July 2, 2015 with a +/- 2% margin of error. Paul Berry 954-918-9432 En Espanol: Irisaida Mendez 954-625-4200 Related Articles", "external_links": [], "published": "2015-07-15T21:48:00.000+03:00", "crawled": "2015-07-15T23:04:23.000+03:00", "highlightTitle": ""}