{"organizations": [], "uuid": "5ae306b7f4aa9b83c9d85247d41885c5fde6ba68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03381/david_teenan_3381212a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-24.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/health/optical-express-opticians/11747011/optical-express-eye-surgeons.html", "country": "US", "title": "Putting laser eye surgeons to the test", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Putting laser eye surgeons to the test - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T01:25:00.000+03:00", "replies_count": 0, "uuid": "5ae306b7f4aa9b83c9d85247d41885c5fde6ba68"}, "author": "Helen Pickles", "url": "http://www.telegraph.co.uk/sponsored/health/optical-express-opticians/11747011/optical-express-eye-surgeons.html", "ord_in_thread": 0, "title": "Putting laser eye surgeons to the test", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Learn more about laser eye surgery » Optical Express is fastidious about numbers. Unless its ophthalmologists have carried out laser surgery a minimum of 500 times in the preceding 12 months, they are not allowed to operate on a patient without being supervised by a more experienced surgeon. \"We believe expertise and quality come from experience,\" explains David Moulsdale, the group's chairman and chief executive. Such structures have not held Optical Express back. Although not the first to perform laser eye surgery in the UK (Optical Express began offering it in 2002 and now has more than 130 clinics in the UK and Ireland), it is the country's foremost practitioner, with a 70 per cent market share. In the past 13 years, Optical Express surgeons have treated more than half a million patients, with a satisfaction rate of more than 99 per cent*. iDesign technology gives the surgeon an accurate picture of the shape and qualities of a patient’s eye so that surgery can be tailored to that person’s needs Much of that satisfaction, feels Moulsdale, is due to the group’s rigorous surgeon selection process. To be a qualified ophthalmic surgeon with refractive surgery experience is merely the basic requirement, he says. “They have to pass our assessment. As well as hours of practical experience, part of that assessment is their interaction with the patient.” Or, what’s more commonly called, “bedside manner”. As he points out, when a patient has laser eye surgery, it’s their first time. “They can be very apprehensive. Even if it’s the surgeon’s 1,000th patient, we expect them to remember it’s the patient’s first.” Additionally, surgeons are subjected to quarterly appraisals to check they’re still up to the high standards demanded, while Optical Express’s clinical and advisory boards – which include leading international figures at the forefront of laser eye surgery research – monitor and evaluate the latest international surgical techniques and technology. Surgeons, optometrists and clinical staff, at all levels, are regularly sent for training. Optical Express clinics, for example, are the only ones, aside from the celebrated Moorfields Eye Hospital and one other private clinic, to use iDesign technology in the UK. This highly advanced device monitors the way light passes through the eye’s cornea (the transparent layer that covers the front of the eye) and lens, and takes more than 1,200 measurements of the eye to give highly detailed information from which ophthalmic surgeons can decide on the best individual treatment plan for patients suitable for laser treatment. “It maps out the eye, a sort of ‘optical topography’, providing essential information about the patient's eye\" says Moulsdale, who goes on to explain that it gives the surgeon an ultra-accurate 3-dimensional picture of the shape and quality of a patient’s eye so that surgery can be minutely and precisely tailored to that person’s visual needs. “Using this technology, over 99 per cent of patients report 20/20 vision or better after surgery,” he adds. While some people might feel that, as Optical Express has so many clinics and treats so many patients this could lead to an impersonal, “factory farm” approach. Moulsdale argues the opposite: “The more patients we treat, the more experience we gain and data we collect. Our guidelines and clinical parameters are based on the patient outcomes of this huge volume of experience and data. This puts us in a unique position to provide an accurate and individualised assessment for every patient.” Although not the first to perform laser eye surgery in the UK, it is the country's foremost practitioner, with a 70 per cent market share Another part of Optical Express’s surgeon selection process is to only take on surgeons who are willing to be available to answer patients’ questions – rather than be tucked away in their ivory towers. “Anyone considering laser eye surgery should always ask their surgeon how many procedures they’ve done over the last year,” advises Moulsdale. “They should also find out how frequently they will be monitored after the surgery, and check whether it will be the surgeon or an optometrist under the surgeon’s supervision.” With Optical Express, patients are seen the following day, and then at routine appointments over the following weeks and months for up to a year. Patients are also given an out-of-hours number which will put them through directly to an optometrist or ophthalmologist. Optical Express expects prospective patients to have questions; they’re surprised if people don’t. Its free, no-obligation consultation is open to everyone. It could change your life. • Search Optical Express for more information on laser eye surgery * Survey of 252,179 patients who were asked if they would recommend laser eye surgery to family and friends; Optical Express Biostatistics Department, September 2014", "external_links": [], "published": "2015-07-25T01:25:00.000+03:00", "crawled": "2015-07-24T21:29:40.883+03:00", "highlightTitle": ""}