{"organizations": [], "uuid": "ff8029d32e5520f826785753e33fbddb29ec984b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/city-of-Arequipa-in-Peru.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/perus-arequipa-city-gears-welcome-15000-tourists/", "country": "US", "title": "Peru’s Arequipa city gears up to welcome over 15,000 touristsTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Peru’s Arequipa city gears up to welcome over 15,000 touristsTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "ff8029d32e5520f826785753e33fbddb29ec984b"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/perus-arequipa-city-gears-welcome-15000-tourists/", "ord_in_thread": 0, "title": "Peru’s Arequipa city gears up to welcome over 15,000 touristsTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Peru’s Arequipa city gears up to welcome over 15,000 tourists Published on : Monday, July 6, 2015\nThe city of Arequipa in Peru is getting ready to welcome more than 15,000 tourists during national holidays and mid-term vacations, the President of the Association of Tourism and Travel Agencies (Avit) Ana Maria Rojas informed.\nThe businesswoman did not rule out the possibility that July’s figures could increase due to visitors’ interest in knowing Arequipa’s tourist attractions such as Colca Valley, Santa Catalina Monastery, as well as downtown and countryside areas.\nDomestic tourism is more extensive than foreign tourism in this period of the year, since Peruvians take advantage of national holidays and their vacation time to travel; many of them opt to visit cities in the country’s southern region, such as Arequipa.\nArequipa’s Provincial Municipality, the Regional Management of Foreign Trade and Tourism and Avit have been working to verify the formal licensing of travel agencies with the aim of providing tourists with the necessary conditions to visit such region.\nOn Thursday (July 2), officials from the said organizations visited three travel agencies and noticed one of them did not have the operating certificate granted by the Management of Foreign Trade and Tourism.\nThe other two had placed advertisements in public areas, so the Provincial Municipality notified the owners that they had to correct such situation.\nOperations will continue over the weekend in order to disrupt informal travel agencies operating in downtown area, offering inadequate services to tourists and giving them a bad image of the city.\nArequipa currently has 75 travel agencies with the aforementioned operating certificate.\nRelated Posts New VisitScotland data reveals regional visitor trends for 2012 ‘Earn While you Learn’ Programme – India Utah lost $33 million in tourism due to shutdown PROMPERÚ to tap Indian travel market UK-based tour operator offers weekend trip to other side of planet", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T23:42:50.000+03:00", "highlightTitle": ""}