{"organizations": [], "uuid": "286967cc787dc58f2114e0414543046063dc0ff5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/20d76838-29b6-11e5-888d-b3efe2891e10-1200x1200.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/life/food-drink/as-chefs-swap-a-culinary-star-lands-on-lummi/", "country": "EU", "title": "As chefs swap, a culinary star lands on Lummi", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "As chefs swap, a culinary star lands on Lummi | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T15:00:00.000+03:00", "replies_count": 0, "uuid": "286967cc787dc58f2114e0414543046063dc0ff5"}, "author": "Bethany Jean Clement", "url": "http://www.seattletimes.com/life/food-drink/as-chefs-swap-a-culinary-star-lands-on-lummi/", "ord_in_thread": 0, "title": "As chefs swap, a culinary star lands on Lummi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "At the renowned Willows Inn on Lummi Island, 32 lucky people wait to find out who’s making their dinner. They’re lucky not only to have the $175 for the ticket, but to get a ticket at all: The seats sold out online almost instantly.\nAfter months of anticipation, the chef in the kitchen could be Rene Redzepi of Noma in Copenhagen, often considered the world’s best restaurant. Or Massimo Bottura of Italy’s famed Osteria Francescana. Or any one of the 37 stellar talents affiliated with the GELINAZ! chefs collective.\nNasturtium flowers stuffed with a bite of crab were part of the 17-course dinner. (Ellen M. Banner/The Seattle Times) Tonight is the Grand GELINAZ! Shuffle: the world’s culinary elite, switching restaurants (and sometimes continents) for one night only. Unlike most culinary events, they have the luxury of some time to get the lay of the land, create and prepare. The usual chef at the Willows Inn, Blaine Wetzel, is already in France — the whole thing was his idea, a global cross-pollination of approaches, ingredients and ideas.\nGrand GELINAZ! Shuffle menu The Willows Inn: July 9, 2015\nYoung delicata squash and flower\nOyster, pickled beet, purple shiso\nNasturtium, crab, mint\nSmoked mussel wrapped in sea lettuce\nSeared spot prawn, black gooseberry, anise hyssop\nCharred leek, cold broth of greens and flowering cilantro\nGeoduck, succulents, cucumber\nSalmon warm-smoked in the moment, sorrel juice vinaigrette\nDeer tartare, spicy radish, turnip, apple, juniper\nWild nettle soup, sprouting grains, cipollini, oxalis\nKohlrabi cooked in sea water, grilled seaweed oil\nBaked potato, goat’s milk curd, chive\nSteamed halibut, shiitake consommé , fir\nChicken-fried egg, velouté of chicken and arrowhead cabbage, puffed malted barley\nWhite tea and honey ice\nGems\nBuckwheat doughnuts, rose sugar and yogurt\nAs the first small courses arrive, diners open an envelope, pull out the menu and are directed to the GELINAZ! website for a video. There, the secret’s revealed: It’s Daniel Patterson , of San Francisco’s Michelin-starred Coi. (Coi, in turn, has become the temporary home of the chef of Spain’s vaunted Mugaritz.)\nThe elegance and seeming ease of the 17 courses that follow is the result of days of intense effort.\nEarlier that week, Patterson walked the rows of a sunny field, investigating the vegetables. He carried a yellow legal pad, writing down everything he found. He answered a question tersely. He plucked a single petal off a sunflower and chewed it, moving on. His attenuated build and concentration gave him the aspect of a heron on the hunt. He is a man who seems taller than he is.\nAmong those who may benefit the most from the Shuffle — besides the diners — are the staff chefs, partnering and processing with a new mastermind for many rigorous hours. For now, Willows Inn chef de cuisine Nick Green and Loganita Farm manager Mary von Krusenstiern mostly stood aside, chatting quietly, as Patterson interrogated the produce. He liked the look of the raspberries, but insisted they must be picked the morning of the dinner and never see the inside of a refrigerator. How big are the biggest beets?, he asked.\nHis list complete, he joined us at the end of the last row to discuss his inventory with evident satisfaction. “I like working with limitations,” he explained, invoking filmmaker Lars Von Trier’s “The Five Obstructions.” “The whole idea is that limitation forces creativity.”\nSeared spot prawn, black gooseberry and anise hyssop. (Ellen M. Banner/The Seattle Times) His acute mind also extends to matters political: At various points, he admired President Obama’s eulogy for the Rev. Clementa Pinckney, deplored Clarence Thomas’ objection to the recent Supreme Court ruling on gay marriage and praised Hillary Rodham Clinton’s unflinching approach to issues of race in the U.S.\nAnd his politics aren’t just talk. He’s working with Los Angeles’ Roy Choi to start a chain of fast-food restaurants that will also serve to train the disadvantaged as chefs. He hopes for little less than a revolution: high-quality food available fast and cheap, plus the upending of the white-male domination of his industry. It’s called LocoL — a combination of “loco” and “local” — and the first iteration is planned for Watts.\nBut here on Lummi, he had a formidable dinner to plan. Chef de cuisine Green drove him to Nettles Farm , another Willows source. One of Patterson’s limitations is no citrus; the dinner is to be as local as humanly possible, so instead of the lemons that grow in San Francisco’s backyard, Nettles’ gooseberries could provide acidity. He requisitioned two of the farm’s signature Poulet Bleu roosters. The birds clucked quietly in the grass, fluffy white and picturesque; tomorrow they’d be in a pot on the stove at the Willows, becoming stock.\nNettles Farm owner Riley Starks had strung up old CDs among his plants, their reflections clearly intended to keep thieving birds at bay. “He’s teaching his plants music, I guess,” Patterson joked. He’s not without a sense of humor, and when he finds something funny, he beams like a sunbreak on an otherwise mildly threatening day.\nDown on the beach, Green handed Patterson leaves of wild succulents to taste as they walked along. On the way back, Patterson looked for especially pretty rocks to take back to Oakland for his two children. Scrutinizing all that’s underfoot, he Quote: d Georgia O’Keeffe — “to see takes time, like to have a friend takes time” — and philosophized, “Seeing what you’re looking for and seeing what’s there are two different things.”\nDeer tartare with spicy radish, turnip, apple and juniper. (Ellen M. Banner/The Seattle Times) And then they cook, for two days — prep of the most precise variety, testing of methods and tasting of dishes. The kitchen is grave and mostly silent, though a half-dozen and more cooks are involved. Just watching from a corner is exhausting. A server, going about her own careful routine in the dining room, says sotto voce, “It’s intense in there, isn’t it?” But, she says, it’s not much different when Wetzel’s in the kitchen.\nAmong a thousand other things that happen, Patterson makes Douglas fir oil, juniper oil, hyssop oil and chive oil. He “chicken-fries” egg after egg, dropping them in hot oil where they bloom, the edges getting crispy but the white inside still almost juicy. He assiduously thanks the staff for what they do. He washes his own dishes.\nThe “baked potato,” here in the oven, was one of chef Daniel Patterson’s favorite new creations of the evening. He’ll be taking the idea back to his restaurant Coi in San Francisco. (Ellen M. Banner/The Seattle Times) He confers with Green, working on a course that he’ll consider one of the dinner’s greatest successes: a “baked potato” encrusted with a mixture of potato puree and dehydrated yellowfoot mushroom, served with chive oil, chive blossoms and goat’s milk curd. It ends up taking far longer in the oven than they think, and when an experimental potato is possibly done, Patterson slices it surgically and they taste. He does a little celebratory hop, and they both laugh, quietly but with childlike glee.\n“That’s really good,” Patterson says. “I have to [expletive] write this down to remember what I did. I love this.”\nShigoku oysters with pickled beet wrapped in purple shiso. (Ellen M. Banner/The Seattle Times) With the diners abuzz, course after course emerges, starting with a pristine baby delicata squash. Vivid red nasturtium flowers are stuffed with a bite of crab. Succulents go with geoduck and a cucumber gelée. Just before the course of kohlrabi cooked in seawater, a cook is seen outside, running down to the beach. The potato is a crowd favorite. Dessert is buckwheat doughnuts, rolled in rose-petal sugar.\nDespite the feverish interest, Patterson never comes out to be applauded. But after dinner, his fans find him in the adjoining room, and await a chance to touch the hem of his chef’s whites.\nBethany Jean Clement: 206-464-2050 or bclement@seattletimes.com .", "external_links": ["http://www.nettlesfarm.com/", "http://loganita.com/", "https://en.wikipedia.org/wiki/Daniel_Patterson_(chef)", "https://www.indiegogo.com/projects/locol-revolutionary-fast-food#/story", "http://gelinaz.com/"], "published": "2015-07-15T15:00:00.000+03:00", "crawled": "2015-07-15T22:42:59.000+03:00", "highlightTitle": ""}