{"organizations": [], "uuid": "d8ae7669f6af131aa8cbe310b9556ae9e263ad94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn3.scmp.com/sites/default/files/styles/620x356/public/2015/07/23/dcccfca5150c1c7e29ec39c94544921d.jpg?itok=H8q3E4eY", "site_section": "http://www.scmp.com/rss/37/feed", "section_title": "South China Morning Post - Travel &amp; Leisure feed", "url": "http://www.scmp.com/magazines/post-magazine/article/1843001/temple-house-hotel-chengdu-cosy-blend-very-new-and-old", "country": "HK", "title": "Temple House hotel, Chengdu, a cosy blend of the very new and old", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "Temple House hotel, Chengdu, a cosy blend of the very new and old | South China Morning Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "d8ae7669f6af131aa8cbe310b9556ae9e263ad94"}, "author": "ED PETERS", "url": "http://www.scmp.com/magazines/post-magazine/article/1843001/temple-house-hotel-chengdu-cosy-blend-very-new-and-old", "ord_in_thread": 0, "title": "Temple House hotel, Chengdu, a cosy blend of the very new and old", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Where is it? The newly opened Temple House - a robust chilli-toss from the statue of Mao Zedong in the centre of the Sichuan capital, Chengdu - blends the ancient and the modern with admirable dexterity. The main entrance (above) embraces a restored, two-storey Qing dynasty courtyard building that was originally a transcription office, hence the hotel's Chinese name: \"Scholar House\". The hotel proper lies immediately to the rear, an 11-storey, L-shaped block whose jet black curtain walls are etched with a soaring bamboo motif.\nWhat's the accommodation like? The 100 rooms and suites, complete with free maxi-bar (beer, soft drinks, three jars brim-full of sweets), are infinitely relaxing. Of the nine room types, aside from the obvious penthouse, the S90 suites are particularly tempting, thanks to a 13-metre balcony that serves as a private eyrie. Design-wise, the rooms are a case of Chinese urban chic, with a delicate palette of light oak and white contrasting sharply with the very dark walls, ceilings, floors and doors of the toilet and dance-in rainforest shower.\nWill we get a good feed here? Perhaps surprisingly, there is no Chinese restaurant per se, however, the self-explanatory Teahouse serves iconic brews such as zhu ye qing , popular desserts - with red bean cake heading the menu - and a large selection of vegetarian dishes. More mainstream, The Temple Café (above) combines the roles of all-day diner and deli, its distinctive international influences courtesy of its Australian chef. Home-made baked beans give full English breakfasts something of a fillip, and, come afternoon tea, the triple-decker cake stands empty remarkably quickly. Pride of place in the hotel restaurant line-up goes to Tivano (below), where the menu roams the length and breadth of Italy. A vertical rotisserie, an open grill and a stone-fired pizza oven are the main armaments in the chef's batterie de cuisine, and the results - taking the lack of conversation and dearth of empty chairs as indicators - are delectable. Both the café and Tivano benefit from outdoor seating, with plenty of opportunity to watch the world go by at the former and a more secluded setting in the latter's bamboo garden.\nAnd drink? Not for nothing does the name of Temple House's bar rhyme with \"sing\". In fact, Jing (below) is practically an anthem in praise of all things grain and grape. The cocktails are strong, presented with imagination and flair, and best enjoyed in the bar's outdoor section, the sofas and tables of which overlook the hotel's immaculately tended, undulating inner courtyard lawn. Indoors, Jing takes on a party ambience, with a very respectable wine list and a DJ spinning until the wee hours.\nWill we want to venture out? The spa (Mi Xun) and indoor pool (below) are good reasons to linger, but Temple House is part of Swire's innovative Taikoo Li, which is as much a museum - the Daci Temple, which gave the hotel its name, is more than 1,000 years old - as it is a low-rise mall, and presents traditional-style laneways alongside designer labels. More conventional malls stand within a kilometre-radius, along Chunxi Road, while a maw of clubs and bars (Chengdu Lan Kwai Fong, natch) garrisons a short stretch of the east bank of the Jinjiang River, whose leafy boardwalks make for the best jogging and hiking routes. And where would Chengdu be without its signature pandas? Models, logos and cuddly imitations are sprinkled all over the city, while the real things strut their stuff at the snappily named Chengdu Research Base of Giant Panda Breeding. Bilingual signage makes navigating the metro a breeze: fares start at two yuan (HK$2.50).\nWhat's the bottom line? Opening \"buy-one-get-one-free\" nightly rates start at 1,699 yuan.\nGo to www.thetemplehousehotel.com for more information.", "external_links": [], "published": "2015-07-26T03:00:00.000+03:00", "crawled": "2015-07-26T02:05:54.312+03:00", "highlightTitle": ""}