{"organizations": [], "uuid": "959350416cd8793d0d3acdb7bcc4358d73a839a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03381/Generic---see-summ_3381193a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-24.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/health/optical-express-opticians/11747383/laser-eye-surgery-the-truth.html", "country": "US", "title": "Laser eye surgery: the truth uncovered", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Laser eye surgery: the truth uncovered - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T01:25:00.000+03:00", "replies_count": 0, "uuid": "959350416cd8793d0d3acdb7bcc4358d73a839a4"}, "author": "Helen Pickles", "url": "http://www.telegraph.co.uk/sponsored/health/optical-express-opticians/11747383/laser-eye-surgery-the-truth.html", "ord_in_thread": 0, "title": "Laser eye surgery: the truth uncovered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Learn more about laser eye surgery » “Although modern-day contact lenses are very safe, statistics show that you are more likely to develop long-term eye problems from wearing contact lenses than from having laser eye surgery,” says David Moulsdale, chairman and chief executive of the Optical Express Group. This is partly due to long-term contact lens intolerance which can cause painful, dry, red and itchy eyes, but also the increased risk of developing a serious eye infection, especially when storing in tap water or wearing the lenses overnight, when compared with laser eye surgery. Today, advances in eye-diagnostic techniques and surgical technology means that laser treatment is a viable option for more people than ever. iDesign technology, for example – a clever device that monitors the way light passes through the eye’s cornea (the transparent layer that covers the front of the eye) and lens – takes more than 1,200 measurements of the eye to give incredibly detailed information from which ophthalmic surgeons can create a unique and customised treatment tailored to the individual. Optical Express clinics are one of the few places in the UK that use this highly advanced piece of kit. Despite advances, many people still have misconceptions about laser eye surgery. Here we look at some of the most common ones. My optician says my eyes are not suitable? Not necessarily. Optometrists (or opticians) are not ophthalmic surgeons. They are skilled in prescribing glasses and contact lenses, but may have limited knowledge of eye surgery. “We often find patients with astigmatism are told they can’t have laser treatment,” says Moulsdale. “In fact, it’s usually only if the astigmatism is very extreme that they would not be suitable for surgery. Up to five diopters of astigmatism is routinely corrected by way of laser eye surgery today.” I’ve been recommended surgery but it’s only because they want my money? While he can’t speak for other organisations, Moulsdale says he’d be surprised if this is true. \"We always want to do the best thing by patients because that's how we get recommendations and grow as a company. If the right solution is contact lenses or spectacles, that's what we recommend.\" Laser treatment wears off after a few years? This isn’t physically possible. However, eyesight, whether or not laser surgery has been performed, can change for other – usually age-related – reasons, such as cataracts or macular degeneration. Laser treatment can't correct near vision (or presbyopia)? Not true, says Moulsdale. “Laser eye surgery can facilitate both functional distance and near vision for patients, through individually tailored treatment plans. After surgery these patients can read menus, newspapers and their mobile phone without the need for reading glasses they used before.” Laser surgery, like some cosmetic procedures such as Botox, is not always done by qualified surgeons? This baffles Moulsdale. \"To the best of our knowledge, all laser surgery in the UK is done by qualified ophthalmologists otherwise known as ophthalmic surgeons, registered with the GMC (General Medical Council).” It hurts? An understandable assumption, but not true. The surgery – which takes less than 10 minutes for both eyes, including preparation – is done under a local anaesthetic of “numbing” eye drops. In some people, these can cause a few moments of mild discomfort when inserted. There may also be a little soreness or scratchy feeling for a short time when the anaesthetic wears off, which can be relieved with over-the-counter painkillers. There's bound to be a risk? Over 90 per cent of procedures use what's termed the LASIK or “protective flap” method. Using computer-guided, precision lasers, a small flap of the cornea is raised, the cornea’s surface reshaped and the flap replaced. In the past, the method was mechanical with more room for inaccuracy. “The process today is much more accurate,” says Moulsdale. “It is reassuring that with modern technology the likelihood of a serious complication is much less than 1 per cent, which makes it very rare.” It's not been around long enough to know if there are long-term problems? Laser treatment was first practised in Canada in the Eighties and the current form of laser surgery since the early Nineties. \"Worldwide, more than 30 million people have been successfully treated,\" says Moulsdale. \"Optical Express set up its first laser eye surgery clinics in 2002, and since then we’ve treated more than half a million patients in the UK and Ireland. Our latest survey* of some 336,000 patients found more than 99 per cent reported 20/20 vision or better.\" • Search Optical Express for more information on laser eye surgery * Survey of 336,381 patients tested for 20/20 or better vision, unaided, following laser eye surgery; Optical Express Biostatistics Department, September 2014", "external_links": [], "published": "2015-07-25T01:25:00.000+03:00", "crawled": "2015-07-24T21:29:17.225+03:00", "highlightTitle": ""}