{"organizations": [], "uuid": "0f9b4672398fa62265eb28ecfa5c63abed29243c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b7deb51700002600565c46.jpeg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/news.xml", "section_title": "Travel News on The Huffington Post", "url": "http://www.huffingtonpost.com/entry/palawan-the-most-beautiful-island-in-the-world-is-sheer-perfection_55b79fc4e4b0224d8833e5e4", "country": "US", "title": "Palawan, The Most Beautiful Island In The World, Is Sheer Perfection", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Palawan, The Most Beautiful Island In The World, Is Sheer Perfection", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T22:58:00.000+03:00", "replies_count": 0, "uuid": "0f9b4672398fa62265eb28ecfa5c63abed29243c"}, "author": "Carly Ledbetter", "url": "http://www.huffingtonpost.com/entry/palawan-the-most-beautiful-island-in-the-world-is-sheer-perfection_55b79fc4e4b0224d8833e5e4", "ord_in_thread": 0, "title": "Palawan, The Most Beautiful Island In The World, Is Sheer Perfection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Palawan, The Most Beautiful Island In The World, Is Sheer Perfection Carly Ledbetter Huffington Post Associate Lifestyle Editor Posted: 07/28/2015 \nIt's hard to believe the Philippines are an under-appreciated tropical travel destination , especially with their extraordinary hiking, diving, beaches and of course -- islands that are THIS beautiful . \nAnd while we'd like to visit every single island in the Philippines, there's one island in particular we're zeroing in on -- Palawan, a hidden piece of paradise that was recently named \" The Top Island in the World \" by Conde Nast Traveler's Reader Choice Awards. \nThere, beautiful blue water mixes with emerald green, jungle-filled mountains that appear to rise up from the ocean, and small fishing villages dot the island. Together with its neighboring islands, it creates the Palawan province , aka paradise. \nDescribed as \"the last frontier,\" Palawan has artifacts that date back 50,000 years . The island is accessible by either boat or airplane -- it's about an hour and a half by air from Manila-- although you can also get there from Iloilo and Cebu . Many say the ideal time to head to Palawan is between about October and May , so we suggest booking tickets ASAP. \nHigh points include island-hopping around the Bacuit archipelago for the cliffs, sinkholes and lagoons , venturing to Puerto Princesa for its culinary delights and staying in one of Coron's \"otherworldly\" luxury hotels . \nIncredible (and rare) wildlife can be found on the islands, from purple crabs and Philippine mouse-deer to Philippine pangolin and beautiful butterflies. Just be sure to avoid the creepy-looking Palawan bearcat at night. \nWe suggest heading into the water and going below the surface. Palawan has some of the best spots to scuba dive in the world -- barracuda-filled shipwrecks, for example, line the bottom of Coron Bay. \nIf diving sounds too scary, try a tour of Palawan's subterranean river (which UNESCO calls \"one of the most unique\" in the world) or take a bangka boat to travel between the islands. \nOnce you're back on land, hop on a \"tricycle,\" one of the preferred methods of transportation on Palawan. We're pretty sure that after all the biking, swimming and exploring you'll do -- you'll never want to leave.", "external_links": [], "published": "2015-07-28T22:58:00.000+03:00", "crawled": "2015-07-28T23:53:42.421+03:00", "highlightTitle": ""}