{"organizations": [], "uuid": "032e85e19b12eb373b0ef3a5e59d697463db3b9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/07/jetblue.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-trends/", "section_title": "Travel Trends And FocusTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/jetblue-airways-newwest-routes-service-boston/", "country": "US", "title": "Jetblue Airways Newwest Routes Service From BostonTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Jetblue Airways Newwest Routes Service From BostonTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "032e85e19b12eb373b0ef3a5e59d697463db3b9b"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/jetblue-airways-newwest-routes-service-boston/", "ord_in_thread": 0, "title": "Jetblue Airways Newwest Routes Service From BostonTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jetblue Airways newest routes service from Boston Published on : Friday, July 10, 2015\nJetBlue today announced that several new routes are out for sale, including Mint service between Boston’s Logan International Airport (BOS) and San Francisco International Airport (SFO), as well as seasonal Mint service between Boston’s Logan International Airport (BOS) and Barbados’Grantley Adams International Airport (BGI).\nAdditional routes available for purchase include non-stop service between New York’s John F. Kennedy International Airport (JFK) and Daytona Beach International Airport (DAB), and between Charleston International Airport (CHS) and Fort Lauderdale-Hollywood International Airport (FLL).\nIn addition, the airline announced plans to launch service between Fort Lauderdale-Hollywood (FLL) and Turks and Caicos Islands’ Providenciales International Airport (PLS), subject to receipt of government operating authority. The new route will go out for sale in the coming weeks.\n“We can’t wait to bring Mint to Boston, which has welcomed our award-winning customer service and low fares since we first launched service there in 2004,” said Dave Clark, vice president network planning, JetBlue. “We are also thrilled to announce additional growth in Florida. In addition to adding Daytona Beach to our route network, we are very pleased to announce our 40th and 41st non-stop destinations from our rapidly expanding Fort Lauderdale focus city.”\nThe announced launches of Charleston and Turks and Caicos will mark JetBlue’s 7th and 8th new non-stop routes to Fort Lauderdale-Hollywood in 2015.\nAll aircraft serving the new routes will offer JetBlue’s award-winning service featuring the most legroom in coach*, unlimited name-brand snacks and soft drinks, 36+ channels of DIRECTV® programming and 100+ channels of SiriusXM® satellite radio.\nJetBlue’s entire selling schedule is now out for sale through May 3, 2016.\nMint Service from Boston\nJetBlue is now offering an introductory fare starting at $599 one way (a) for Mint experience travel from Boston to San Francisco from March 24 through May 3, 2016. All introductory fare tickets must be purchased by July 10, 2015.\nAll customers traveling on the Mint aircraft will benefit from JetBlue’s new Airbus A321 aircraft, which features the airline’s new core experience. Every A321 offers a new world-class seat designed to maximize comfort, larger 10.1″ seatback screens, free Fly-Fi broadband Internet, in-seat power outlets accessible to all customers, and a drink holder.\nJetBlue currently flies between Boston and San Francisco three times daily. By the end of September 2016, all three flights will operate on Mint.\nMint Flights, Once Daily, except for Saturdays, as of March 24, 2016:\nBOS - SFO SFO - BOS 8.00 a.m. - 11.50 a.m. 1.55 p.m. - 10.29 p.m.\nAdditional Mint Flights, Once Daily, as of April 20, 2016:\nBOS - SFO SFO - BOS 10.15 a.m. - 2.01 p.m. 9.15 p.m. - 6.26 a.m.\nMint Seasonal Schedule Between Boston and Barbados on Saturdays from March 26, 2016 through April 30, 2016:\nBOS - BGI BGI - BOS 8.00 a.m. - 12.49 p.m. 2.00 p.m. - 7.26 p.m.\nService Between New York and Daytona Beach\nJetBlue is now offering an introductory fare of only $79 one way (b) to Daytona Beach from New York’s JFK from January 7 to February 9, 2016. All introductory fare tickets must be purchased by July 10, 2015.\nJetBlue non-stop services to Daytona from New York JFK will operate with the airline’s spacious 150-seat Airbus A320 aircraft.\nDaily Schedule Between New York and Daytona as of January 7, 2016:\nJFK - DAB DAB - JFK 10.29 a.m. - 1.13 p.m. 2.00 p.m. - 4.23 p.m.\nService Between Charleston and Fort Lauderdale-Hollywood\nJetBlue is now offering an introductory fare of only $79 one way (c) from Charleston to Fort Lauderdale-Hollywood from December 2, 2015 to February 10, 2016. All introductory fare tickets must be purchased by July 10, 2015.\n“Our partnership with JetBlue continues to be mutually beneficial and exceed our expectations,” said Fernando Harb, vice president tourism sales, Greater Fort Lauderdale Convention and Visitors Bureau. “With the addition of direct service from Charleston, SC, we see great growth potential for meetings and conventions as well as business travel segments.”\nJetBlue services between Charleston and Fort Lauderdale-Hollywood will operate with the airline’s E190 aircraft, which comfortably seats 100 and boasts window or aisle seats for everyone.\nDaily Schedule Between Charleston and Fort Lauderdale-Hollywood as of November 19, 2015:\nCHS - FLL FLL - CHS 2.27 p.m. - 4.12 p.m. 11.09 a.m. - 12.56 p.m.\nDaily Schedule Between Charleston and Fort Lauderdale-Hollywood as of January 6, 2016:\nCHS - FLL FLL - CHS 7.00 a.m. - 8.34 a.m. 7.55 p.m. - 9.24 p.m.", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-10T22:08:56.000+03:00", "highlightTitle": ""}