{"organizations": [], "uuid": "170f24d6a9651d0142a28969e06ce88c5b41624d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61883/technology-set-drive-innovation-meetings-industry", "country": "US", "title": "Technology set to drive innovation in the meetings industry", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Technology set to drive innovation in the meetings industry", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T22:43:00.000+03:00", "replies_count": 0, "uuid": "170f24d6a9651d0142a28969e06ce88c5b41624d"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61883/technology-set-drive-innovation-meetings-industry", "ord_in_thread": 0, "title": "Technology set to drive innovation in the meetings industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IMEX survey shows that technology leads the way Technology set to drive innovation in the meetings industry Adv: \nJul 27, 2015 Adv: \nTechnology is the sector set to deliver the next major innovation in the meetings industry. This is according to research of more than 800 buyers and suppliers at this year’s IMEX in Frankfurt. Of the 840 people who answered the question, what sphere do you think the next big innovation in meetings will come from? Over 50% of hosted buyers and exhibitors and over 40% of visitors identified technology ahead of education, health and wellbeing and meetings design. \nCompanies offering technology innovations are invited to take part in the IMEXpitch, the new name for the IMEX Tech Startup Competition, which returns to IMEX America for the second year. IMEXpitch enables companies to showcase exciting new technology products that address challenges faced by meeting and events professionals. The competition is currently inviting submissions from companies who have been operating for less than two years and the shortlist will be announced at the start of September. The shortlisted “Startuppers” then have the opportunity to pitch to an expert panel at IMEX America which takes place October 13-15 in Las Vegas, with the winner receiving a free stand space at the Tech Pavilion at IMEX America 2016. \nCarina Bauer, CEO IMEX Group, explains: “With technology evolving at a rapid rate, it’s no surprise that our event attendees are in overwhelming agreement that this sector will deliver the most innovation. We’re already seeing this with many start-ups making waves in the market, and we launched IMEXpitch at IMEX America last year to support budding tech companies who develop innovative solutions and services for the meetings industry. \n“Following its premiere at IMEX America, the competition took place for the first time at IMEX in Frankfurt this year with Init Live, a cloud-based service and mobile app for managing staff and volunteers at events, crowned the winner. We’ve noticed that many companies shortlisted for the competition focus on apps as their main product offering, demonstrating that this is fertile ground for fast innovation and added value. “ \nThis is demonstrated by the growing usage of the IMEX App which launches for IMEX America 2015 in September and helps both buyers and exhibitors stay organized and up to date with everything happening at the show. Buyers can access their diary to make and check appointments, as well as view travel and accommodation information; and exhibitors can view and manage stand staff schedules on the show floor. \nIMEX America will take place from October 13-15 at the Sands Expo and Convention Center at The Venetian® | The Palazzo® Las Vegas. \neTN is a media partner for IMEX America.", "external_links": [], "published": "2015-07-27T22:43:00.000+03:00", "crawled": "2015-07-27T23:04:04.921+03:00", "highlightTitle": ""}