{"organizations": [], "uuid": "ad3dc50cfa9c0b98ed10e55dd6bd26c4c2640f9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/news/how-to-nab-travel-deals-as-competition-shrinks/ar-AAddfDP", "country": "US", "title": "How to nab travel deals as competition shrinks", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "How to nab travel deals as competition shrinks", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "ad3dc50cfa9c0b98ed10e55dd6bd26c4c2640f9c"}, "author": "Trent Gillies", "url": "http://www.msn.com/en-us/travel/news/how-to-nab-travel-deals-as-competition-shrinks/ar-AAddfDP", "ord_in_thread": 0, "title": "How to nab travel deals as competition shrinks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How to nab travel deals as competition shrinks CNBC 12 hrs ago Trent Gillies\nWith vacation season underway, where can consumers find the best travel deals: at online travel sites, or directly from airlines?\nSteve Hafner, CEO of Priceline-owned Kayak, said that sometimes, the better option is with the latter. \"I think the best place to book an American Airlines (AAL) ticket is through American.com.\"\nIn an interview with \" On The Money \", Hafner told CNBC that his Kayak travel search engine shows prices from an airline or hotel site \"as an option, and we still show the OTA's, the online travel agencies.\"\nHowever, \"I think for most consumers, if you book supplier-direct you're actually in a better spot,\" he added.\nHafner co-founded Kayak in 2004. Eleven years later, the online travel hub runs more than 1 billion searches a year. He told CNBC that represents \"more than 110 million searches a month\" in 40 countries and in 18 languages.\n\"Historically, we did a great job at if you knew where you wanted to go, finding you the lowest price.\" Yet Hafner added the travel buyer now explores searches on the site differently, and can structure results according to affordability. \"If you want to say, 'I want to go to a beach in June and for less than $500' we show you the options for that.\"\n\"What we do is very different from other travel sites,\" Hafner said, serving as a clearing house to other websites that provide travel pricing.\nAfter a consumer comes to Kayak, \"We'll take that request and send it to hundreds of other travel sites, both online agencies as well as airline and hotel sites. So they'll get a complete picture of what's available out there to purchase.\"\n© Provided by CNBC Although there's a multitude of choices for online travel sites, consolidation has led to just two big players: Expedia (EXPE) and Priceline (PCLN) . The online travel category has newer entrants like Trivago, and apps like Hotel Tonight and Hipmunk, yet few of these possess the scale of the larger players in the space.\nIn November 2012, Priceline reached a deal to buy Kayak in a transaction worth $1.8 billion . Meanwhile, Priceline also owns four other online travel brands: Booking.com, agoda.com, rentalcars.com and restaurant reservation site OpenTable.\nRiding the wave of consolidation, Expedia acquired Travelocity for $280 million, and is awaiting approval for its $1.6 billion takeover of Orbitz —which may face regulatory hurdles.\nThese mergers are taking place against a backdrop of consumers that are hungrier than ever for convenient ways to book travel, and are spending more for the privilege. According to the U.S. Travel Association, $644.9 billion was spent on leisure travel in the U.S. in 2014.\nAn American Express survey showed that travel consumers are looking for more online information, and now check an average of five websites before booking travel. The survey also noted that 25 percent actually check more than seven. Hafner said that Kayak does not receive any payment from airlines or hotels.\nSo how exactly do they make money?\n\"We are supported financially by a small referral fee if the transaction actually gets completed,\" Hafner said, \"as well as advertising on the site.\"\nHafner added that his company \"operates on a scale these other sites don't. Not only do we have hotels tonight and next week and next month. Not only do we show you a handful of hotels, we show you every hotel.\"\nTravel sites aren't the only ones in an acquisitive mood. Megamergers have reduced the number of carriers to just four major airlines: American (AAL) , Delta (DAL) , United (UAL) and Southwest (LUV) . Together the four control more than 80 percent of the U.S. market.\nThose large deals have put upward pressure on domestic airfares, to the tune of 5 percent over the last decade , adjusted for inflation.\nAt least for now, vacationers are willing to suck up the higher prices, which Hafner said may be a function of higher demand or industry consolidation.\nOn June 30, the Justice Department announced it is investigating whether airlines have been keeping ticket prices high through collusion. The four main carriers deny behaving illegally.\nHafner, however, said Kayak doesn't \"really have a dog in that fight. But what we do is provide lots of tools for consumers to help them find cheaper airfares.\"\n—\"On the Money\" airs on CNBC Sundays at 7:30 p.m. ET, or check listings for airtimes in local markets.\n ", "external_links": ["http://cnbc.com/", "http://www.cnbc.com/on-the-money/?__source=msn|money|inline|story|&par=msn&doc=102841148|How", "http://www.cnbc.com/2015/02/12/expedia-to-buy-orbitz-for-12-a-share-in-cash.html?__source=msn|money|inline|story|&par=msn&doc=102841148|How", "http://www.cnbc.com/id/49749342?__source=msn|money|inline|story|&par=msn&doc=102841148|How", "https://www.ustravel.org/sites/default/files/page/2013/08/US_Travel_AnswerSheet.pdf", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAddfDP%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdcXTN.img&description=Provided+by+CNBC", "http://apne.ws/1eZ4VwA"], "published": "2015-07-19T03:00:00.000+03:00", "crawled": "2015-07-20T04:04:11.372+03:00", "highlightTitle": ""}