{"organizations": [], "uuid": "ed10c3d36a62dc547de3761e8ebce618c0c5e9f0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.com", "main_image": "http://ichef.bbci.co.uk/wwfeatures/624_351/images/live/p0/2v/hx/p02vhxm5.jpg", "site_section": "http://www.bbc.com/travel/feed.rss", "section_title": "BBC Travel", "url": "http://www.bbc.com/travel/story/20150624-a-romantic-escape-above-the-trees?ocid=global_travel_rss", "country": "GB", "title": "A romantic escape, above the trees", "performance_score": 0, "site": "bbc.com", "participants_count": 0, "title_full": "A romantic escape, above the trees", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T23:14:00.000+03:00", "replies_count": 0, "uuid": "ed10c3d36a62dc547de3761e8ebce618c0c5e9f0"}, "author": "", "url": "http://www.bbc.com/travel/story/20150624-a-romantic-escape-above-the-trees?ocid=global_travel_rss", "ord_in_thread": 0, "title": "A romantic escape, above the trees", "locations": ["US"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Britany Robinson"], "text": "Nature & Outdoors A romantic escape, above the trees Although dwindling in number, thousands of fire towers still dot forests across the US. Stay in one during off-season for unparalleled views from high above. By Britany Robinson 31 July 2015 \nWhen Joey and Shannon Hodgson used their last match to burn the pages of a book titled How to Take Six Months Off, they didn’t know if they’d survive the night. \nThe couple had been hurrying home from a winter weekend getaway at Warner Mountain Fire Tower in Central Oregon, but the storm moved in fast, dumping 3ft of snow on the trail. Frostbitten and scared, they were eventually rescued by a search party just a mile from their car after spending a long night in sub-freezing temperatures. \nSome might be deterred after such a dangerous experience, but the adventurous couple were spurred on to fulfil a dream that Joey had been entertaining since he first stumbled upon a fire tower while hiking when he was 12. View image of The fire tower in Pickett Butte (Credit: Credit: Britany Robinson) \nPassionate about protecting the nation’s forests, they quit their jobs and for six months each year they work as fire lookouts, taking up residence in basic structures perched on stilts or peaks and surveying thousands of acres of forest. Joey reckons he reports an average of 100 forest fires per season. \n“Lookouts are our life,” he told me over a static-y cell phone from his current lookout position at Lava Butte in Central Oregon, 19 years after that frightening night. \nFirst appearing in the early 1900s, around 8,000 fire towers once dotted forests across the United States, from busy state parks to secluded mountains, manned by paid lookouts and volunteers who spent their summers with a bird's eye view of the surrounding trees. It was a profession romanticised by the likes of Jack Kerouac, who wrote a fictionalised account of his time as a fire lookout in the book Dharma Bums. View image of Light over Oregon's forests (Credit: Credit: George Rose/Getty) \nFire towers and lookout positions have dwindled in number in recent decades, mainly due to budget cuts, but the 2,552 surviving towers (of which only 826 are staffed) are often available to rent when they’re not in use. Built for optimal vantage points of the surrounding wilderness, they offer an inspiring escape for adventurous souls. \nWanting to experience the solitude and thrill of a fire tower without the responsibility, I decided to escape the daily grind as a freelance writer in Portland, Oregon, for a weekend above the trees. I was looking forward to channelling Jack Kerouac and feeling the freedom from civilisation that might allow me to write, or simply relax, more so than I could in my busy city life. \nPickett Butte , approximately 200 miles south of Portland and my home for the night, was originally constructed in 1934 and a paid lookout still lives here from July through September. But from October through June, when forest fires are extremely rare, it’s a coveted campsite for families, couples and solo sojourners like me. I reserved a night in early May, with reservations booked solid for weeks on either side. View image of Sleeping above it all (Credit: Credit: Britany Robinson) \nThe prospect of spending a night alone in the woods was a little unnerving for my city-minded senses, but when I reached the Tiller Ranger Station in the Umpqua National Forest the warm sunshine gave me courage. My dog, Jackson, eyed me from the passenger seat as we bounced along the dirt road past the station. He seemed to understand that my Hyundai Elantra was not meant for off-roading. \nA slow seven miles later, I pulled up to the sign for Pickett Butte. Faded and pockmarked with bullet holes, it did nothing to ease my nerves, and I looked back at the long, quiet road we’d just covered. One bumpy mile later, the 40ft-high tower — a wooden box balanced at the top of three flights of steep, slatted stairs — revealed itself in a clearing of trees, looking astute against the baby blue sky. \nJackson and I surveyed the grounds, which included two picnic tables, a fire pit and an outhouse. We snacked and lounged in the grass. Then, it was time to climb. \nThe steps were too steep for Jackson’s liking, so I clutched 40lbs of trembling dog against my chest while slowly making my way up. When I released him on the final platform, my arms ached with relief. \nA line from Kerouac came to mind as I slowly absorbed my surroundings. \n“One day I will find the right words, and they will be simple,” he wrote in Dharma Bums. \nThis was how I felt as I took in the landscape below: layers of rolling hills in a palette of green and gold spread out in all directions. A narrow porch wrapped around the square structure, and I circled it once, twice, three times, trying to soak in the bizarre sensation of being surrounded by so little, yet so much. View image of A view from the top (Credit: Credit: Britany Robinson) \nThere were sounds; a snapping twig; a singing bird; a strange, hollow drumming in the distance. But there was also a silence in the air that was completely new to me. I was alone. \nInside the structure was a single cot, a desk and a stove. In the centre of the room was a topographical map of the area enclosed beneath a circle of glass. Joey would later explain that this device, called an Osbourne Fire Finder, is used to pinpoint the location of a fire within 50ft. Lookouts line up a sighting aperture on the map with the smoke in the distance, and note the degrees on the edge of the glass circle, which gives them coordinates on the fire's location. Luckily, I would not be responsible for watching the forest or locating fires during my stay. View image of The Osbourne Fire Finder (Credit: Credit: Britany Robinson) \nIt was only 2 pm when we settled in. I’d anticipated a need to fill the afternoon with some activity, but now that I was here, it seemed more fulfilling to do as the fire lookouts do — watch and enjoy. I’d barely cracked the pile of books I brought along when the sun started setting. Jackson and I sat on the cot, watching the greens and golds slowly transform into pinks and blues. I thought about how a sudden plume of smoke might jolt me out of my dreamy state. But the sky stayed clear as the sun disappeared behind the furthest mountains and dark purple seeped across the skyline. \nThat evening, I heated a can of soup over the little gas stove. The night sounds seemed louder as darkness surrounded us; the owls’ hoots bouncing between stars. View image of The little gas stove (Credit: Credit: Britany Robinson) \nI woke with the sun’s return at 5:30 am, the blood-red orb casting streams of light through the picture windows. I’d never get up that early at home, but here it felt natural to rise with the day. Jackson, stretching next to me and wagging his tail, agreed. View image of Jackson enjoying the blood-red sunrise (Credit: Credit: Britany Robinson) \nI spent the morning wandering around the campsite, taking breaks to read or toss Jackson’s ball, or simply stand on a rock and stare at the peaks and valleys below. It’s amazing how doing nothing at all can feel so fulfilling when you’re enveloped by nature at its most raw, yet inviting state. \nI wasn’t ready to leave that afternoon. But I also knew, thanks to the men and women who watch over these sites and the surrounding trees each summer, I could always return. Back in Portland, I immediately booked a second weekend at Pickett Butte in October, with confidence that Joey, Shannon and the rest of the lookouts would be keeping the forests safe for another season. \nIn the meantime, I’d find myself a copy of How to Take Six Months Off. Follow BBC Travel", "external_links": [], "published": "2015-07-31T23:14:00.000+03:00", "crawled": "2015-07-31T03:58:52.550+03:00", "highlightTitle": ""}