{"organizations": [], "uuid": "e49b3b78ad7779a488eb29d69aeea92190e56192", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/07/09/Production/Daily/Style/Images/Italy_Fashion_Gucci-01676.jpg", "site_section": "http://www.washingtonpost.com/lifestyle", "section_title": "Lifestyle: Food, Style, Travel, Advice, Home, Garden &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/style/spring-2016-is-all-about-lacy-shirts-floral-prints-silky-fabrics--for-men-hey-why-not/2015/07/09/3a1d90d4-1a8d-11e5-bd7f-4611a60dd8e5_story.html", "country": "US", "title": "Spring 2016 is all about lacy shirts, floral prints, silky fabrics — for men. Why not?", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Spring 2016 is all about lacy shirts, floral prints, silky fabrics — for men. Why not? - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "e49b3b78ad7779a488eb29d69aeea92190e56192"}, "author": "By Robin Givhan", "url": "http://www.washingtonpost.com/lifestyle/style/spring-2016-is-all-about-lacy-shirts-floral-prints-silky-fabrics--for-men-hey-why-not/2015/07/09/3a1d90d4-1a8d-11e5-bd7f-4611a60dd8e5_story.html", "ord_in_thread": 0, "title": "Spring 2016 is all about lacy shirts, floral prints, silky fabrics — for men. Why not?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Robin Givhan Fashion critic July 9 at 10:10 AM Follow @RobinGivhan\nModels blur gender lines on the runway at the Gucci men's spring-summer 2016 collection in Milan. (Antonio Calanni/AP) The end of gender is near.\nMenswear designers are on a mission to eradicate it. Some are going full bore, wielding lace shirts and floppy, grandma blouses like cultural grenades. Others are taking a stealth approach, quietly chiseling away the boundaries between masculinity and femininity through non-traditional retail, models and silhouettes.\nRobin Givhan is a staff writer and the Washington Post fashion critic, covering fashion as a business, as a cultural institution and as pure pleasure. View Archive Facebook RSS Overwhelmingly, it is menswear designers, from London to New York, who are on this rampage. Spurred on by men’s heightened interest in fashion and shifts in social mores, they are flexing their creative muscles, taking risks and challenging their customers to think beyond pastel suits, leggings and a pair of skinny trousers cropped to the ankle.\nAnd when they dip into womenswear, they eschew prissy and overtly sexy. They prefer swagger, cool and just a little bit bad ass.\n[ Fashion puts men in a tight spot with pants that keep shrinking ]\nThe spring 2016 menswear season began last month in London with men in loosely pleated trousers, floral prints and lace shirts. When the pack of retailers and editors moved on to Milan, they were greeted even more emphatically with lace and the addition of lounging robes. By the time Paris designers unveiled their wares, the catwalks were covered in oversize, flower-embroidered cardigans.\nAnd when New York hosts its first men’s fashion season in recent memory next week, one can only expect more of the same. The over-arching message: Gender is a mood, a metaphor, an anachronism.\nTim Coppens will be one of several dozen relative newcomers presenting their work in New York. Belgian born, he began his career working for Ralph Lauren and Adidas. When he launched his brand in 2011, his point-of-view was rooted in skater culture, hip-hop and the visual arts — all elevated by his commitment to luxury. He recently moved to womenswear, but the source of inspiration remains the same.\n“It all comes from streetwear,” Coppens says of his subtle gender-blurring ways. His female customers might look “cute and feminine, but there’s something tough about them. I’m less inclined to do a pretty dress.”\nIn the Tim Coppens fall 2015 collection, the men’s fashion . . . (Monica Feudi / Feudiguaineri.com)\n. . . exuded a street-smart vibe almost identical to the women’s fashion. (Monica Feudi / Feudiguaineri.com)\nA man’s graphically outlined coat . . . (Monica Feudi / Feudiguaineri.com)\n. . . looks similar to a woman’s. (Monica Feudi / Feudiguaineri.com) In his fall collection, if a guy wore a satiny bomber jacket, the girl following on his heels wore a similarly styled one. His graphically outlined coat could have been hers. Their striped shirts and sweaters were the same. The erasure of boundaries made the womenswear feel more connected to the street, more attuned to the realities of urban life, more relevant.\nBut so far, no designer has spoken as bluntly — or in as exaggerated terms — as Gucci designer Alessandro Michele. His spring 2016 collection was a storm of dandy, fey, drag, rock-and-roll and hipster. It included embroidered lace shirts, floral suits, silk robes and shirts with floppy bow ties reminiscent of the dress-for-success accessories women wore in the 1970s as feminized versions of a four-in-hand knot.\nNamed creative director of the brand in January, he could be deploying his gender-defying sensibility to grab attention for a struggling company that needs to regain its financial footing. Perhaps classic machismo, long associated with Gucci, is waiting in the wings to return to center stage as soon as the balance sheet improves. “I’m a little wary” of a full buy-in, notes Dwayne Brice, an image consultant who works in Washington and Los Angeles. But like so many men, he can’t completely resist what Michele, Coppens and other designers are offering.\n“I like that it’s challenging the traditional structure of male clothing with dropped shoulders, the [softer] fabric. It gives you something different to wear — not just a suit and tie,” Brice says. “Designers are not just trying to put womenswear on men, but they’re moving menswear forward.”\nLace and high-waist jeans from the Gucci spring-summer 2016 menswear show. (Giuseppe Cacace/AFP/Getty Images)\nRuffles , lace, pink and a flower on a male model at Gucci’s spring-summer 2015 show in Milan. (Giuseppe Cacace/AFP/Getty Images)\nAs with most developments in fashion, the drive toward gender obsolescence did not happen overnight. It began on one runway, on one street corner, in one neighborhood, in one daydream. And these separate sparks converged and began to sweep across the landscape.\nA host of labels are onto this movement, each in its unique way: Gucci and Tim Coppens, but also, Burberry Prorsum, J.W. Anderson, Baja East, Givenchy, Hood by Air, Rick Owens, Public School. Just about every silhouette or flourish that society has assigned to women has been put on the backs of men by at least one of these brands. Often, they book models with long hair, a slender build and a gentle quality. But these young men do not leave viewers guessing at their gender and then feeling guilty about speculating. They are clearly men. And, until our eyes adjust: They often look as if they are wearing girls’ clothes.\nA lace shirt and man-bag on the Burberry Prorsum men’s runway for spring 2016. (Tristan Fewings/Getty Images) Which leads to the fundamental question that all these designers are asking: Why are clothes assigned a gender at all?\nThe question is not referring to fit. There’s a reason why a woman’s blouse has darts and a man’s does not: breasts. Women’s trousers are more challenging to design than a man’s because of a woman’s curves, which can range from nearly non-existent to hourglass to Kardashian. Bootylicious. Olympic sprinter. Have mercy.\nThe creators of the New York-based label Duckie Brown have long chafed at the idea that certain styles, fabrics and flourishes are off limits to men. When Duckie Brown was founded almost 15 years ago, it had a loose conception of gender rules. Daniel Silver and Steven Cox disrupted the system. “We’ve always looked at women’s [fabric] mills. When it’s [womenswear], it’s like this magic door opens and all these wonderful fabrics are there,” Cox says. The mill owners “are almost aggravated that a menswear designer is in the women’s section.”\n[ How do you age as a designer? Duckie Brown designers find a way ]\nBut why should men be deprived of colorful floral prints, fluid silk or the richness of handmade embroidery? “When we started Duckie Brown, it was let’s just do clothes for people,” Silver says.\n“I didn’t want to put a gender on it,” Cox adds. But retailers, editors, customers needed an organizing principle. Not so much anymore. “We had a sample sale and someone was asking is this for a man or a woman?” Cox recalls. His answer? “If it fits you and you like it, it’s for you.”\nThe fall 2015 Duckie Brown collection included a group of elegantly draped chiffon and satin shirts. Duckie Brown had offered similarly feminine looks in the past, and they have typically been met with little more than a patient nod acknowledging the brand’s eccentricities.\nThis time, however, there have been requests from top fashion stylists to borrow the shirts for photo shoots. After all, these blouses epitomize the anti-machismo mood of the moment.\nDuckie Brown has always favored feminine flourishes on its menswear. (Joe Kohen/Getty Images)\nA slinky, glamorous shirt “for humans” from the fall 2015 Duckie Brown menswear collection. (Slaven Vlasic/Getty Images) Men are indulging, in part, because popular culture is telling them that they can. Tony Gyepi-Garbrah regularly blurs the line between menswear and womenswear in his daily attire, wearing a reworked vintage suit, a bright orange motorcycle helmet and a cat collar as a bracelet. He and Sadiki Harriott, two D.C.-area IT guys by day who produce the Gentlemen’s Brim style blog by night, might snag a pair of jeans from the women’s department if the silhouette is appealing. They will wear a woman’s hair clip as a lapel pin. “What you’re seeing, if you take it out of the fashion world and put it in the political world . . . this generation has less concern about being judged,” Harriott says. “Your style is emotions. You wear what you feel.”\n[ What Kanye West gets right about fashion, and what he gets wrong ]\nIt’s impossible to look at this shift in fashion without considering the broader cultural changes that have pushed issues of gender identity and sexual stereotypes front and center. Caitlyn Jenner appeared on the July cover of Vanity Fair using classic pin-up costuming to declare her femininity. The ensuing discourse about how glorious she looked underscored clothes’ defining power. But it also raised skepticism about the validity of those definitions and whether definitions are even necessary.\nIn 2014, Barneys New York launched an advertising campaign celebrating 17 transgender individuals in photographs by Bruce Weber. And this year, the British department store Selfridges announced it was doing away with its men’s and women’s departments in favor of three floors of unisex shopping under the banner, Agender.\nThe duo behind Proenza Schouler included a man — dressed in the women’s collection — on their runway and quietly underscored the breadth and malleability of their work. Rick Owens put full-frontal male nudity on his runway in a provocative statement on gender biases. Even Kanye West, in his collaboration with Adidas, offered a blur of men and women on his runway all dressed in the same muted palette of pullovers, baggy pants and slouchy tunics. They could have been dressed from West’s own closet. And Pharrell Williams co-stars in a Chanel advertising campaign wearing the womenswear brand’s tweed jackets and cardigans.\nA phalanx of models pose in gender-neutral clothing on the runway at the Adidas Originals and Kanye West fashion show. (Gareth Cattermole/Getty Images For Adidas) The flamboyant flourishes of black dandies was recently celebrated in a French documentary and in a New York exhibition by artist Iké Udé. And now, the pompadoured performer Jidenna is exploiting these male peacocks in his atonal “Classic Man.”\nSamuel L. Jackson looking fine and dandy at the Burberry Prorsum spring 2016 menswear show. (Tristan Fewings/Getty Images)\nHistorically, fashion has always gotten creative with gender, touting men’s skirts, Annie Hall’s borrowed-from-the boys aesthetic and, of course, androgyny. But the current tide is full of nuance and energy, unlike the stoic detachment that typically defines androgyny. It is less gimmicky. Designers aren’t putting one or two skirts on the runway in a sedate shade of navy or in the familiar shape of a sarong. They are dedicating entire collections — entire businesses — to genderless dressing.\nIn many ways, this 21st-century philosophy calls to mind the work of designer Stephen Burrows, who founded his business in the late 1960s. Burrows was attuned to street culture and nightlife, as well as the growing sexual freedom of the times. He loved the idea of all his friends — men and women — pulling their going-out wardrobe from a single pile of clothes. His clothes. He wasn’t making a political statement. He was simply designing for the kind of life he and his friends led.\nA descendant of that kind of ease may very well be a designer such as Coppens. He was not pondering Jenner, transgender or Agender. “I never really thought about those things; they’re just there,” Coppens says. “I just make the clothes.”\n“For me, the important part is there’s men and women. It’s one world,” Coppens says. “It’s one group of girls and boys belonging to the same tribe; they like the same music. But each has a little twist because they want to be individuals within that world.”\n“Sometimes people get very intellectual about men’s versus women’s,” Coppens continues. “If a girl picks up a men’s sweater and it looks and feels right, it’s okay.”\n[ What happens when designers take a deep breath and leap ]\nIt is still not as easy for boys to borrow from the girls. “I still don’t think it’s [fully] accepted that a man could wear a feminine silhouette or a dress,” says Cox of Duckie Brown. As much as he loves the very chiffon shirts he designed, “I feel a little bit uncomfortable going out in one. But I love wearing it around here.”\nThe models of Duckie Brown in their draped trousers and chiffon shirts at the fall 2015 runway show. (Slaven Vlasic/Getty Images) This determination to eradicate gender, however, is broader than ever, with significant establishment heft behind it. The push is coming from corporate-owned design houses, publicly traded companies, major department stores and even IT wonks.\nAlmost certainly, every idea won’t endure. But menswear will have moved forward — ever farther away from the oppressive confines of gray, Glen plaid and button-downs. “It’s having a moment, but I think there will be stuff that sticks,” Silver says. “I think there could be something that’s left, that goes into the fashion lexicon.”\nAnd it very well may be a simple shirt in a few yards of lace or chiffon.", "external_links": ["https://twitter.com/@RobinGivhan", "https://www.facebook.com/RobinGivhan", "http://nymag.com/thecut/2014/01/barneys-cast-17-transgender-models-in-spring-ads.html", "http://gentlemensbrim.blogspot.com/"], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-09T17:39:17.000+03:00", "highlightTitle": ""}