{"organizations": [], "uuid": "b48c458e4d854dfa17fa5618a074fe9859a33d89", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/opinion/jimmy-carter-his-legacy-and-a-rabbit/", "country": "EU", "title": "Jimmy Carter, his legacy and a rabbit", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Jimmy Carter, his legacy and a rabbit | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T01:11:00.000+03:00", "replies_count": 0, "uuid": "b48c458e4d854dfa17fa5618a074fe9859a33d89"}, "author": "Nicholas Kristof", "url": "http://www.seattletimes.com/opinion/jimmy-carter-his-legacy-and-a-rabbit/", "ord_in_thread": 0, "title": "Jimmy Carter, his legacy and a rabbit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Quiz time: Which American president was attacked by a “killer rabbit”?\nIt was Jimmy Carter, although the incident says more about the news media than it does about Carter. He was fishing from a boat when a rabbit swam frantically for the president’s boat.\nWhere’s the Secret Service when you need it? Carter fended off the rabbit with an oar.\nA few months later, Carter’s press secretary mentioned the incident to a reporter. Soon there was a flood of articles and cartoons about a hapless president cowed and outmatched by a wet bunny.\n One of journalists’ worst traits is that when we have a narrative in our minds, we often plug in anecdotes that confirm it. Thus we managed to portray President Gerald Ford, a first-rate athlete, as a klutz. And we used a distraught rabbit to confirm the narrative of Carter as a lightweight cowed by anything that came along.\nThe press and chattering class have often been merciless to Carter. Cartoons mocked him as a country rube using an outhouse or associating with pigs, writers pilloried him as a sanctimonious hick, and in recent years it has been common to hear that he’s anti-Israel or anti-Semitic. (This about the man whose Camp David accord ensured Israel’s future!)\nNow that Carter is 90 and has been an ex-president longer than anyone in history, it’s time to correct the record.\nHe is anything but an empty suit. At a time when “principled politicians” sometimes seem a null set, it’s remarkable how often Carter showed spine.\nHis new memoir, “A Full Life,” recounts that his father was a segregationist. Yet Carter says he was the only white man in his town who refused to join the White Citizens’ Council, and he fought to integrate his church. At one point, after a racist slur was posted on his door, he considered giving up and moving away.\nCarter persevered. When he was inaugurated governor of Georgia, he declared, “I say to you quite frankly that the time for racial discrimination is over.” He then erected a portrait of Martin Luther King Jr. in the State Capitol.\nA black woman who was a convicted murderer, Mary Prince, was assigned to work at the governor’s mansion in a work-release program. Carter became convinced that she was innocent and applied to be her parole officer. He took her to the White House to be his daughter’s nanny. Prince was eventually pardoned.\nIt’s true that Carter sometimes floundered as president. He also had great difficulty, as an outsider, managing Washington, and suffered from a measure of anti-Southern prejudice. When the Reagans took over, their interior decorator reportedly couldn’t wait to “get the smell of catfish out of the White House.”\nBut Carter was also a pioneer. He was the first to elevate human rights in foreign policy. He appointed large numbers of women, Latinos and blacks. He installed solar panels on the White House. He established diplomatic relations with China.\nCarter also had a deep sense of honesty. Other politicians have affairs and deny them. Carter didn’t have affairs but disclosed that “I’ve committed adultery in my heart many times.” File that under “too much information.”\nAfter leaving D.C., Carter could have spent his time on the golf course. Instead, he roamed the globe advocating for human rights and battling diseases from malaria to blinding trachoma.\nBecause of Carter’s work, the world is very close to eradicating Guinea worm disease, an excruciating ailment, and has made enormous headway against elephantiasis and river blindness. Only five cases of Guinea worm disease have been reported in 2015 — it’s a race, Carter acknowledges, between him and the Guinea worm to see which outlasts the other.\nI’m betting on Carter. In 2007, I joined him on an Africa visit because his aides said it would be his last major foreign trip. So as we sat by a creek, I noted that this was his last major overseas trip.\n“Whatever would give you that idea?” Carter interrupted. His icy tone made clear that he planned to be touring Ethiopian villages until at least his 200th birthday.\nCarter, the one-termer who was a pariah in his own party, may well have improved the lives of more people in more places over a longer period of time than any other recent president. So we in the snooty media world owe him an apology: We were wrong about you, Mr. President. You’re not a lightweight at all, and we can’t wait to see what you’ll do in your next 90 years.", "external_links": [], "published": "2015-07-10T01:11:00.000+03:00", "crawled": "2015-07-10T14:19:00.000+03:00", "highlightTitle": ""}