{"organizations": [], "uuid": "c8ba2e8cd3b1349a0d9492cabde9d59fd9c9fa57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rt.com", "main_image": "http://cdn.rt.com/files/2015.07/article/55ad2a4ac36188c1348b45a4.jpg", "site_section": "http://www.breakingnews.com/feeds/rss/air-travel", "section_title": "Breaking news on air travel - breakingnews.com", "url": "http://www.rt.com/news/310295-wikileaks-germany-nsa-rendition/#.Va0uYds-61k.twitter", "country": "US", "title": "NSA spied on German Foreign Minister Frank-Walter Steinmeier and 20 others prior to 9/11 and amid the rendition flights scandal, WikiLeaks says - @RT_com", "performance_score": 7, "site": "rt.com", "participants_count": 1, "title_full": "NSA spied on German Foreign Minister Frank-Walter Steinmeier and 20 others prior to 9/11 and amid the rendition flights scandal, WikiLeaks says - @RT_com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T20:28:00.000+03:00", "replies_count": 0, "uuid": "c8ba2e8cd3b1349a0d9492cabde9d59fd9c9fa57"}, "author": "Rebecca Bratek", "url": "http://www.rt.com/news/310295-wikileaks-germany-nsa-rendition/#.Va0uYds-61k.twitter", "ord_in_thread": 0, "title": "NSA spied on German Foreign Minister Frank-Walter Steinmeier and 20 others prior to 9/11 and amid the rendition flights scandal, WikiLeaks says - @RT_com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WikiLeaks: NSA spied on German FM for years, ‘helped CIA to kidnap and torture’ Published time: 20 Jul, 2015 17:16 Edited time: 20 Jul, 2015 19:28 Get short URL German Foreign Minister Frank-Walter Steinmeier. © Leonhard Foeger / Reuters A leaked NSA intercept shows that German FM Steinmeier was relieved to have “not received any definitive response” from the US on its rendition program at the time of the scandal, which exempted him from the need to act on the matter, WikiLeaks claims. \nThe WikiLeaks publication intercept of the German FM’s communications, which was undertaken after his official visit to the US in November, 2005.The intercept revealed that Steinmeier “seemed relieved that he had not received any definitive response from the US Secretary of State [Condoleezza Rice] regarding press reports of CIA flights through Germany to secret prisons in Eastern Europe allegedly used for interrogating terrorism suspects,” the website claimed.The visit occurred during the CIA’s secret “rendition flights” scandal, which saw people illegally abducted in Europe and taken to “black site” US prisons for torture.After the first reports on \"rendition flights\" emerged in the media, European governments denied any knowledge of the CIA program, but continued providing airspace and airport facilities to the US security agency which facilitated it. \n\" Today's publication indicates that the NSA has been used to help the CIA kidnap and torture with impunity, \" Julian Assange, the editor-in-chief of the whistleblowing website, commented on the leak. RELEASE: NSA Helped CIA Outmanoeuvre Europe on Torture: new Secret docs re NSA spying https://t.co/RuF3Drp9a7 #NSAUA pic.twitter.com/U6pO5aYRhk — WikiLeaks (@wikileaks) July 20, 2015 \n\" For years the CIA was systematically abducting and torturing people, with the tacit complicity of European governments. In 2005 German Foreign Minister Steinmeier was thrilled that his tactic of asking Condoleezza Rice no hard questions about CIA renditions had worked. The US said nothing that would require him to do anything. And how do we know about it? Because the National Security Agency was gloating to the US senior executive about intercepting this cowardly display. Nobody comes out of this looking good ,\" he added. \nAfter first reports on \"rendition flights\" emerged in the media, the European governments denied any knowledge of the CIA program, but continued providing its airspace and airport facilities to the US security agency. \nIn 2006, the European Parliament published a report stating that Germany, among other EU states, aided or was aware of the CIA’s extraordinary rendition program. \n“ It is now clear… that authorities in several European countries actively participated with the CIA in these unlawful activities. Other countries ignored them knowingly, or did not want to know ,” Dick Marty, Council of Europe Parliamentary Assembly rapporteur, said back then. \nSweden, Bosnia and Herzegovina, UK, Italy, Macedonia, Germany and Turkey were mentioned by Marty as states to have cooperated with CIA, in varying degrees, on rendition flights. \nThe documents published by WikiLeaks also suggest that the NSA was spying on key German Foreign Ministry figures since before 9/11. \nGerman Vice Chancellor, and Foreign Minister from 1998 to 2005, Joschka Fischer, was among NSA’s targets, the website claimed. \nHis successor, Steinmeier, had two of his cellphones monitored by the NSA, including the one he used for communications with fellow Social Democratic Party members. \nThe other NSA targets included such Foreign Ministry officials as Jurgen Borsch from the Foreign Ministry’s Crisis Response Center; Commissioner for International Energy Policy, Viktor Ebling; Director for Latin American and Caribbean Affairs (in 2008-2011), Bernhard Von Waldersee; Secretary of State at the Foreign Office from 2008-2011, Peter Ammon.", "external_links": [], "published": "2015-07-20T20:28:00.000+03:00", "crawled": "2015-07-20T22:46:29.673+03:00", "highlightTitle": ""}