{"organizations": ["Europe Travel"], "uuid": "e54b385000846f9739f910139c322aefcdec66c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goitaly.about.com", "main_image": "http://f.tqn.com/y/goitaly/1/S/3/2/-/-/galleria.jpg", "site_section": "http://z.about.com/6/g/goitaly/b/index.rdf", "section_title": "About Italy Travel", "url": "http://goitaly.about.com/od/hotelsandlodginginmilan/fl/Milans-Seven-Star-Galleria-Luxury-Hotel.htm", "country": "US", "title": "Milan's Seven Stars Galleria Luxury Hotel", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Milan's Seven Stars Galleria Luxury Hotel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T23:32:00.000+03:00", "replies_count": 0, "uuid": "e54b385000846f9739f910139c322aefcdec66c0"}, "author": "", "url": "http://goitaly.about.com/od/hotelsandlodginginmilan/fl/Milans-Seven-Star-Galleria-Luxury-Hotel.htm", "ord_in_thread": 0, "title": "Milan's Seven Stars Galleria Luxury Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Martin", "Vittorio Emanuele"], "text": "Expert Videos Galleria Vittorio Emanuele. by James Martin, Europe Travel \nMilan, one of Europe’s richest and most stylish cities, is home to Italy's first 7-star hotel. Italian hotels are rated by a star system of 1 to 5 stars, but the Seven Stars Galleria luxury hotel (formerly called the Townhouse Galleria ) in the heart of Milan classified itself as a 7-star hotel when it opened. It later became the first certified 7-star hotel in Europe. It's also the only Italian hotel inside a national monument, Galleria Vittorio Emanuele II . \nSo what does the Seven Stars Galleria hotel offer for 7-stars? First, the intimate hotel has only seven suites, each one unique and overlooking the Galleria. So you’ll get lots of personal service and attention. Each suite comes with its own butler who speaks several languages. Each of the suites is named after a famous opera house musician and some include extra amenities like a laptop computer or a small meeting room. The suites are contemporary in style and have designer furniture yet the hotel maintains the historic decor and antiques. Guests also get exclusive services such as valet parking, private limousine transfers, reservations, and referrals to top of the line services including hair stylists and fitness centers. \nLa Sinfonia , the hotel's elegant restaurant, has views of the Galleria Vittorio Emanuele II dome and is open only to hotel guests or can be booked for private parties. \nMilan’s historic Galleria Vittorio Emanuele II , built in 1876. The Galleria, Italy’s first shopping mall, was built as a covered connecting street, lined with fancy bars and shops, linking Milan’s Piazza Duomo with La Scala Opera House . The Galleria still houses shops and bars and the hotel retains much of the original splendor while adding contemporary touches. \nSeven Stars Galleria Hotel Details: Via Silvio Pellico 8, inside the Galleria Vittorio Emanuele II , 100 meters from the CathedralContact: +39 02 89058297, galleria@townhouse.it \nFind the best prices for your dates on Hipmunk: Hotel Seven Stars Galleria Milan \nMore Milan Hotel Choices: Don't think you can afford 7-star luxury? Don't worry, there are many good places to stay in Milan - see our Top Rated Milan Historic Center Hotels .", "external_links": [], "published": "2015-07-19T23:32:00.000+03:00", "crawled": "2015-07-20T05:12:12.989+03:00", "highlightTitle": ""}