{"organizations": [], "uuid": "6691f29c3ab3e8bea7ebb0a5e0dee2e72b93866a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/c9303258-2416-11e5-aaf4-cae02da47a87-1020x655.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/opinion/why-state-democrats-held-up-a-budget-deal-over-i-1351/", "country": "EU", "title": "Why state Democrats held up a budget deal over I-1351", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Why state Democrats held up a budget deal over I-1351 | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T01:26:00.000+03:00", "replies_count": 0, "uuid": "6691f29c3ab3e8bea7ebb0a5e0dee2e72b93866a"}, "author": "Sharon Nelson", "url": "http://www.seattletimes.com/opinion/why-state-democrats-held-up-a-budget-deal-over-i-1351/", "ord_in_thread": 0, "title": "Why state Democrats held up a budget deal over I-1351", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NO one looks forward to paying a big bill, especially one you don’t have the money to cover.\nAfter six months in Olympia, lawmakers finally opened the envelope just last week for a serious bipartisan discussion of how to address Initiative 1351 — the noble but costly $2 billion class-size reduction measure passed in November.\nIn the state Senate, the Republican majority runs the show, writes the budget and decides which bills we consider and when. This year, they asked Democrats to leave the room after a few months of bipartisan budget work. They wanted to finish it on their own terms, with their own spin.\nState Sen. Sharon Nelson, D-Maury Island, is the Senate minority leader. Another view Read The Times’ editorial board’s view on last week’s Senate action: seati.ms /budget-editorial\nBefore now, Senate Republicans made no attempt to build a consensus approach to I-1351. The 2 billion-pound gorilla in the room was simply ignored. In fact the only “solution” Senate Republicans offered before last week was one that required only a majority vote. They would send the initiative back to the voters to ask, “Did you really want smaller class sizes?” If the voters answered, “Yes, that’s why we voted for them the first time,” we’d find ourselves right back in Olympia still with an unfunded $2 billion hole to fill and no plan to fill it.\nBy contrast, in April, Senate Democrats proposed a comprehensive plan to address I-1351 and our moral and constitutional obligations outlined in the Supreme Court’s McCleary decision. Our plan, SB 6104, would amend the initiative and also honor the will of the voters by including a plan for future implementation.\nSenate Republicans did not move SB 6104 forward.\nLast week, just a day before the budget passed, Senate Republicans decided to address I-1351 by delaying it. Amending an initiative requires a supermajority. Republicans needed Democratic votes, but because the solution wasn’t revealed to us until the last moment, our caucus didn’t have a chance to discuss the decision to delay it. There was no “deal” — it was a decision by the majority.\nTypically, when a supermajority is needed, the majority will work with the minority. House Democrats worked with House Republicans, which allowed time to discuss the bill and the delay of I-1351 was passed. Senate Republicans came to us and said this is what they were doing and we should give them the votes to do it. The bill failed with both Democrats and Republicans voting no.\nThe decisions we made last week came only after careful thought by each senator about how he or she could best represent constituents.” Senate Democrats are realistic about I-1351. We understand it would be impossible to afford this year. We have members who are willing to vote to change the initiative, but we were clear with Senate Republicans about what that means: If we are going to pass a bill that is detrimental to kids, let’s do something significant to help them. That’s why we asked for a solution to our high-stakes testing problem.\nOne option is SEHB 2214, which would permanently reform our punitive high-stakes testing system for all students and, more immediately, would help nearly 2,000 deserving high-school seniors, who failed to pass the required biology exam, to graduate this year. There is broad bipartisan support to change our existing testing system while keeping expectations for our kids high.\nSenate Republicans refused to discuss the testing issue this session, never holding a hearing or work session on any of the five Senate bills or House bill dealing with this issue. One might ask why SEHB 2214, which passed the House three times this year with near unanimous support — most recently last week — can’t even get discussed in the Senate.\nThe decisions we made last week came only after careful thought by each senator about how he or she could best represent constituents, many of whom voted to limit class sizes.\nA shutdown is no longer a possibility. Major decisions on transportation and the capital budget are agreed upon. But we felt that creating a positive change for our kids in the classroom was a loose end too important to leave undone.\nState Sen. Sharon Nelson, D-Maury Island, is the Senate minority leader.", "external_links": ["http://seati.ms/budget-editorial"], "published": "2015-07-07T01:26:00.000+03:00", "crawled": "2015-07-07T19:20:11.000+03:00", "highlightTitle": ""}