{"organizations": [], "uuid": "697a4a4e85b2dbf2fd966a341fc8f1085dfbc06f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.recordnet.com", "main_image": "http://www.recordnet.com/storyimage/SR/20150708/ENTERTAINMENTLIFE/150709738/AR/0/AR-150709738.jpg", "site_section": "http://www.recordnet.com/entertainment/travel?template=rss&mime=xml", "section_title": "Travel - recordnet.com", "url": "http://www.recordnet.com/article/20150708/ENTERTAINMENTLIFE/150709738/101024/A_ENTERTAIN?rssfeed=true", "country": "US", "title": "Ag powerhouse", "performance_score": 0, "site": "recordnet.com", "participants_count": 1, "title_full": "Ag powerhouse", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T01:45:00.000+03:00", "replies_count": 0, "uuid": "697a4a4e85b2dbf2fd966a341fc8f1085dfbc06f"}, "author": "Tim Viall Special to The Record", "url": "http://www.recordnet.com/article/20150708/ENTERTAINMENTLIFE/150709738/101024/A_ENTERTAIN?rssfeed=true", "ord_in_thread": 0, "title": "Ag powerhouse", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted Jul. 8, 2015 at 5:45 PM By Tim Viall Posted Jul. 8, 2015 at 5:45 PM » Social News San Joaquin County is consistently ranked in the top 10 counties in the United States for the value of its agricultural production — positioning our county as one of the topmost producers in the world. Living in the center of this ag powerhouse — have you and your family explored the history and splendor of our county’s agriculture? Capt. Charles M. Weber, the German immigrant who founded Stockton in 1849 during the early days of the Gold Rush, relied on his own crops and pioneering farmers for food to feed his family and the huge influx of fortune seekers headed to the central Sierra mines. New arrivals to Stockton’s busy port and San Joaquin County would pay handsomely for staples such as wheat, corn and potatoes grown nearby. Specialty crops such as chicory (mixed with coffee to stretch expensive coffee imports) and grapes, for table use, juice and wine also figured prominently in farms in and adjacent to the Delta. As the country hurtled towards World War II, 20-some years after Ben Holt invented what would become the Caterpillar tractor and revolutionized Delta farming, the complexion of San Joaquin County agriculture had changed. With the benefit of refrigerated railcars, growers were able to ship produce all over the United States. The ag commissioner reported leading crops in the late 1930s were grapes (table grapes, juice and wine production) followed by alfalfa hay, potatoes, beans, asparagus, peaches and tomatoes. Today, leading ag commodities are grapes, almonds, walnuts, milk, cherries and tomatoes, with an overall value at well over $2 billion annually. So, if you want to show kids or grandkids the history, impact and fun of our agricultural community — how do you do that? We asked several experts in the field where they would direct people for insight and entertainment. Here's are destinations that will provide history and fun for all. Everyone agreed that the place to start for hands-on history is the San Joaquin County Historical Society and Museum in Micke Grove Park, just south of Lodi. There you will find, spread across 13 acres, exhibits on Charles Weber, founder of Stockton and our first agriculturalist, including many artifacts and Victorian room dioramas with Weber family furnishings and a new exhibition on the first settlers and farmers in the county, featuring a prairie schooner (wagon) that came from Illinois in 1859. Six large museum buildings focus on agricultural history, including the invention and manufacture of farm and earthmoving equipment. Through August, the popular Critter Corral (meet and pet small farm animals) runs weekends, delighting young and old. Another exhibition (through Aug. 9) displays Rich Turner’s stunning photographs of the Sacramento-San Joaquin Delta. The museum preserves a portion of the Tokay vineyard planted by William Micke in 1922, at that time the most popular grape grown locally. David Stuart, executive director of the San Joaquin County Historical Society, noted “The goal of the Historical Society is to preserve the rich history of our county and to tell some of the many fascinating stories that have shaped us. Stories feature the Miwok- and Yokuts-speaking nations that cared for this region for millennia and Captain Charles Weber, who had the vision to develop Stockton as a transportation, manufacturing, and agricultural center.\" “Featured are the early American settlers who emigrated to build families, farms, and communities here; of inventors and entrepreneurs such as Benjamin Holt and R.G. LeTourneau, who started international corporations here; of thousands of immigrants who built our levees, toiled in our fields, and brought new energy and ideas for agriculture. This is what we hope to provide to visitors to the County Historical Museum.” ”The Historical Society hopes that visitors to the Museum will be fascinated by the stories of those who have gone before us and have shaped our county; stories that demonstrate a tradition of innovation, ingenuity and creativity. We trust that a visit will whet visitors’ appetite to learn more. Discovering the roots of California’s heartland will encourage community pride and civic engagement.” Pat Patrick, CEO of the Lodi Chamber of Commerce, concurs on visiting the San Joaquin Historical Museum, “Visit the Tractor Building, where history of tractors and earth-moving equipment is graphically demonstrated; kids can climb on old Caterpillar tractors. Then, stop at the Lodi Wine and Visitor Center (corner of Turner Road and Lower Sacramento), with plenty of info on local wines, events and wineries — as well as the demonstration vineyard on the west side, flush with zinfandel, chardonnay, syrah and the methods illustrating how grape varieties are grown. On the way, stop for breakfast or lunch at Phillips Farms, corner of Highway 12 and Ray Road.” Patrick also suggests walking the quaint streets of downtown Lodi, where 13 wineries and tasting rooms flourish, with more than 20 labels of wine to sample. The World of Wonders Science Museum is also located in the midst of these tasting rooms, for kids' activities. A host of other destinations can be included in your tour of county agricultural heritage. They include the University of California Cooperative Extension and lovely demonstration garden at the Cabral Agricultural Center, a result of federal legislation in 1914 that established a system of cooperative agricultural services. Additionally, tour nearly a dozen farmers markets throughout the county, farm stands that sell local, fresh produce until late in the fall, the historic Lockhart Seeds in Stockton and evidence of the growing farm-to-fork movement, including neighborhood gardens such as the Puentes Garden in Boggs Tract, teaching gardens at agencies such as Stockton’s Emergency Food Bank and school gardens such as Taylor Leadership Academy. — Contact Tim Viall at tviall@msn.com. Follow him at recordnet.com/travelblog . Happy travels in the West! By Tim Viall", "external_links": [], "published": "2015-07-09T01:45:00.000+03:00", "crawled": "2015-07-09T10:32:47.000+03:00", "highlightTitle": ""}