{"organizations": [], "uuid": "64ce0d1555b98ea4d0bb2fbee3e14b9163534b49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.com", "main_image": "http://ichef.bbci.co.uk/wwfeatures/624_351/images/live/p0/2s/s0/p02ss0km.jpg", "site_section": "http://www.bbc.com/travel/feed.rss", "section_title": "BBC Travel", "url": "http://www.bbc.com/travel/story/20150528-where-the-cave-dwellers-once-lived?ocid=global_travel_rss", "country": "GB", "title": "Where the cave dwellers once lived", "performance_score": 0, "site": "bbc.com", "participants_count": 0, "title_full": "Where the cave dwellers once lived", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T01:53:00.000+03:00", "replies_count": 0, "uuid": "64ce0d1555b98ea4d0bb2fbee3e14b9163534b49"}, "author": "", "url": "http://www.bbc.com/travel/story/20150528-where-the-cave-dwellers-once-lived?ocid=global_travel_rss", "ord_in_thread": 0, "title": "Where the cave dwellers once lived", "locations": ["Turkey"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Hasankeyf", "Inka Piegsa-Quischotte"], "text": "History Where the cave dwellers once lived As Turkey’s audacious llisu Dam approaches completion, the ancient settlement of Hasankeyf looks set to lose thousands of years of history underwater. By Inka Piegsa-Quischotte 30 July 2015 \nCradling a baby goat in his arms, my driver, Mourad, crouched next to me on the bank of the mighty Tigris River. All around us in the shade of centuries-old trees, young girls in colourful dresses and old men with weather-beaten faces tended to their flocks of sheep and goats. Some animals strayed into the shallow waters, followed by splashing girls who made sure none of their charges, particularly the babies, came to any harm. With Mourad translating, I expressed my wish to milk a sheep, which made the children giggle out loud. View image of A shepherd girl along the Tigris River (Credit: Credit: Scott Wallace/Getty) \nWe were in the town of Hasankeyf in the Batman province of southeast Turkey, not far from the border with Syria and, further down, Iraq. Today mainly populated by Kurds, many archaeologists consider Hasankeyf one of the world’s oldest continuously populated settlements, inhabited by nine civilisations over some 10,000 years – including Neo-Assyrian, Roman, Persian, Byzantine and Ottoman. One of its most important legacies was the period of the Artukid and Ayyubid kings in the 12thand 13th Centuries, when the city was an important trading post along the Silk Road. During this period, many tombs, palaces and mosques were built – including the remarkable 12th-century Great Palace and the famous Tigris Bridge – contributing to the more than 300 historical monuments that grace Hasankeyf today. \nEqually outstanding are the thousands of human-made caves that have been built along the river and in the limestone cliffs above, much like better-known Cappadocia. For generations, the caves have been inhabited by the same families, who make a living from agriculture, fruit trees, sheep and goats. View image of The ancient cave town in Hasankeyf (Credit: Credit: Tolga Tezcan/Getty) \nThese remarkable treasures are not without threat, though. By the end of 2015, the massive 135m-high and 1,820m-wide llisu Dam – one of the world’s most controversial water reservoir projects – is projected to force many of Hasankeyf’s sites under water, including the Great Palace and the caves. An estimated 25,000 to 70,000 cave dwellers will be relocated to either the newly created settlement of New Hasankeyf, approximately 2km north, or to New Ilisu, some 100km to the south. \nAccording to the governor of Batman province, Temel Ayca, there are plans to create an archaeological park by relocating some of the monuments to higher ground. The ones that cannot be moved will become an underwater diving park. Yet even with these plans, many historians, scientists and archaeologists are concerned that another Troy or Mycenae may remain lost forever since much of the area has yet to be excavated. View image of Dam construction in Hasankeyf (Credit: Credit: Ercan Ayboga/Keep Hasankeyf Alive) \nBack in the company of the cave dwellers – after the laughter at my fruitless attempt at milking a sheep had died down – the conversation quickly turned to the dam. With typical Turkish hospitality, a family of five shepherds had invited Mourad and I over for tea and something to eat. \nWe piled into the shepherds’ ramshackle truck and crossed the shallow river to the family’s home –“cave” hardly did the dwelling justice. Two storeys high, spacious, beautifully decorated, with running water, electricity and even a glass pane window, the cave was a place I might have moved into. Thick carpets lined with plush cushions covered the living room floor. \nAs honoured guests, we were invited to sit down and partake in a breakfast so ample, it left me full until evening. Dish after dish appeared: fried eggs, goat’s cheese, fresh bread, olives, tomatoes, butter, cucumbers, meatballs, sweets and gözleme (paper thin pancakes filled with cheese or honey and nuts). Politeness demanded we have at least one of each. View image of Gozleme, a traditional Turkish pancake (Credit: Credit: Levent Songur/Getty) \nOther family members came in and sat with us, including the brother, Hassan, and the patriarch, Sabri Bey. \n“See,” Bey said, gesturing to his surroundings, “My family has lived in this home for five generations. We are happy here. We live off our land and our sheep and goats. And now, all this is going to disappear underwater and we are forced to relocate to a place where we don’t want to be.” \n“And for what? Electricity, they say.” Bey shook his head in disbelief. “We have electricity!” he shouted. As if to prove his point, he hit a light switch several times. \n“We get compensation, but it’s far too little to buy one of the horrible new homes they are already building over there,” Hassan added, gesturing in the direction of the river and the newly constructed support bridge. “We can’t move elsewhere either, this is our home, our tradition, our river. I don’t know what will happen and how we will adjust.” View image of The ramparts of Hasankeyf (Credit: Credit: Bulent Kilic/Getty) \nHassan turned even more serious and looked at me with troubled eyes. “You know, what is the worst of it?” he asked, raising his hands. “Because there is so little work and money is tight, I even took a job to help with construction of the dam! These,” he said, shaking his hands, “have helped to bring about our own misery.” \nAfter our meal, we returned with the shepherds to their grazing spot for a final look at the centuries-old site. \nIn many ways, the llisu Dam is just the last in a long line of events that have affected this ancient town. Wars, earthquakes, conquests – glory and decline – all has been survived by the monuments that stand today and the people who live around them. Sevi, one of the young girls at the river, had a thought about how they will survive again. \n“Maybe more tourists like you will now come to visit us,” she said. “We could open a small restaurant and serve them our specialities, or a shop selling our handmade clothes and silver jewellery. We’ll learn some English, so we can speak to them. And some,” she added with a mischievous grin, “might even want to learn how to milk a sheep.” \nJudging by the breakfast I had just enjoyed, the restaurant is bound to be a huge success. \nWhere do you rank in our tribe of worldly readers? Answer these questions to get a sense. Follow BBC Travel", "external_links": [], "published": "2015-07-31T01:53:00.000+03:00", "crawled": "2015-07-30T11:50:39.288+03:00", "highlightTitle": ""}