{"organizations": [], "uuid": "1ce62e04f17b5d4541afdee478de83541596309c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61179/tropical-system-may-impact-hawaii-thursday-saturday", "country": "US", "title": "Tropical system may impact Hawaii from Thursday into Saturday", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Tropical system may impact Hawaii from Thursday into Saturday", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T23:26:00.000+03:00", "replies_count": 0, "uuid": "1ce62e04f17b5d4541afdee478de83541596309c"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61179/tropical-system-may-impact-hawaii-thursday-saturday", "ord_in_thread": 0, "title": "Tropical system may impact Hawaii from Thursday into Saturday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE LIST: 5 Star Rated by eTN Readers - and not for sale! Hotels - Airlines - CVBs - Destinations - people Tropical system may impact Hawaii from Thursday into Saturday Adv: \nJul 07, 2015 Adv: \nA budding tropical system may pass close enough to Hawaii to bring an uptick in gusty showers and thunderstorms as well as building seas late in the week. \nHow significant these impacts become will depend on the track, strength and size of the system. \nWhile there are several areas in the Eastern and Central Pacific that bear watching this week, one system in particular southeast of Hawaii is of the greatest concern. \nAs of Tuesday morning, the most organized system is located about 1,300 miles east-southeast of the Big Island of Hawaii and is being monitored for development as the week progresses. This system is currently drifting toward the west-northwest. \nAccording to AccuWeather Hurricane Expert Dan Kottlowski, the system is likely to become a tropical depression by Tuesday evening Hawaii Standard Time (HST). \n\"The system could rapidly become a hurricane prior to reaching Hawaiian waters later this week,\" Kottlowski said. \nAt present course and speed, the system could begin to produce squalls and building swells on the Big Island during Thursday. The sudden squalls and seas could catch boaters off guard. \nWaves and rip currents may increase in strength and number, especially along the east-facing beaches during the latter part of the week. \n\"How extensive the squalls become and how big the seas get will depend on the size, strength and path of the system,\" Kottlowski said. \nA compact hurricane passing a couple of hundred miles to the northeast may have little impact, but a large system could spread showers and storms throughout the islands. \"We will have to see how quickly the system develops and how big it gets over the next couple of days,\" Kottlowski said. \nKottlowski is mostly concerned about heavy rain affecting the northwestern islands of Hawaii, which extend farther north. \nWarm waters surrounding the islands could cause the system to develop rapidly and gain some strength. \nAccording to AccuWeather Meteorologist Eric Leister, most of the time waters are rather cool, relatively speaking around Hawaii and act as a deterrent to tropical activity. \n\"During El Niño years, waters around Hawaii can run above average,\" Leister said. \"In this case, water temperatures are running several degrees Fahrenheit higher than average.\" The system was tracking to the east-northeast between 15 and 20 miles per hour. \nPeople traveling to or living in the Hawaiian Islands will want to monitor the progress of the disturbance, which could develop into a depression, tropical storm or hurricane. The next name on the list, depending on where the system develops, is Dolores in the East Pacific or Ela in the Central Pacific. \nThe Eastern Pacific Basin extends from North America to 140 degrees East longitude. The Central Pacific basin extends from 140 degrees to 180 degrees East longitude. \nOdds favor the center of the system passing northeast of the Big Island on Friday and just north of the other islands of Hawaii during Friday night and Saturday. \nThe string of pearls, as the Hawaiian Islands are called, are aligned southeast to northwest. However, the associated gusty showers, thunderstorms and waves could extend outward by 50-100 miles or more, depending on the strength and size of the system. \nAs El Niño began to ramp up during the latter half of 2014, Hawaii saw two developed tropical systems pass close by. One was Iselle, which made landfall on the Big Island of Hawaii as a tropical storm on Aug. 7. Another well-developed system, named Ana, impacted the islands during the middle of October. \nOnce a powerful Category 4 hurricane, Iselle was the strongest tropical cyclone to make landfall on the Big Island on record. Iselle caused downed trees, power outages and property damage along with flooding rain and travel disruptions. \nAna passed just to the south and west of the islands as a hurricane and produced locally heavy rain. \nOther systems such as Wali, Genevieve and Julio either passed well away from the islands or had minimal effect. \nHurricanes in the Central Pacific Basin are uncommon with three or four named, but relatively weak systems per year over the entire basin. \n\"This could be a busy year again for Hawaii, in terms of tropical systems passing nearby, as the effect of El Niño continues and perhaps reaches a peak during hurricane season,\" Kottlowski said.", "external_links": [], "published": "2015-07-07T23:26:00.000+03:00", "crawled": "2015-07-08T00:50:30.000+03:00", "highlightTitle": ""}