{"organizations": ["Ala Moana Center"], "uuid": "17e2ecb747a020340e70a2c9f82805490fef3b77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gohawaii.about.com", "main_image": "http://f.tqn.com/y/gohawaii/1/S/A/D/5/honolulu-fireworks-001.jpg", "site_section": "http://z.about.com/6/o/m/gohawaii_t2.xml", "section_title": "About.com Hawaii Travel: What's Hot Now", "url": "http://gohawaii.about.com/od/festivals/a/ala-moana-center-fourth-of-july.htm", "country": "US", "title": "Ala Moana Center's 24th Annual Fourth Of July...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Ala Moana Center's 24th Annual Fourth Of July...", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T14:11:00.000+03:00", "replies_count": 0, "uuid": "17e2ecb747a020340e70a2c9f82805490fef3b77"}, "author": "", "url": "http://gohawaii.about.com/od/festivals/a/ala-moana-center-fourth-of-july.htm", "ord_in_thread": 0, "title": "Ala Moana Center's 24th Annual Fourth Of July...", "locations": ["Hawaii"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Stephen"], "text": "Ala Moana Center's 24th Annual Fourth Of July Festivities Hawaii's Largest Fireworks Display Will Cap Off the Weekend's Activities Sign Up for our Free Newsletters Thanks, You're in! Health Tip of the Day Sign up There was an error. Please try again. Please select a newsletter. Please enter a valid email address. Did you mean ? Expert Videos Honolulu Fireworks. Photo Credit: Stephen Kacirek/Getty Images \nOne of the highlights of the the annual 4th of July celebration in Hawaii is the fireworks display at Ala Moana Beach Park, sponsored by Ala Moana Center. Always a huge draw for local residents and visitors alike, this year marks the 24th year that Ala Moana Center has presented their Fourth of July Spectacular and the Center is pulling out all the stops to present its longest and largest fireworks show to date. \nLocated at 1450 Ala Moana Boulevard just outside of Waikiki, Ala Moana Center is the world's largest outdoor shopping center and Hawaii's premier shopping, entertainment, and dining destination with 290 stores including luxury houses, national retailers and locally owned boutiques and nearly 80 dining options. \nNamed among the top 25 shows in the country, this spectacular event is the only fireworks show in Hawaii to launch from three separate platforms. The free fireworks spectacular, launched from Ala Moana Beach Park, will begin on Saturday, July 4, 2015 at 8:30 p.m. Customers are encouraged to watch the 24th Annual Fireworks Spectacular from Ala Moana Beach Park. There will not be a designated spectator zone at Ala Moana Center . Spectators can tune in to KSSK, AM590/FM92.3 for a live fireworks soundtrack that accompanies the show. \nAla Moana Center's Fourth of July Spectacular is considered on of the top 25 Independence Day celebrations in the country and this year, from July 3-6, the Center is offering an entire holiday weekend celebration featuring award-winning entertainment and shopping and savings for the entire family. Then on July 4, Hawaii's largest fireworks display caps off the entire weekend. Live Entertainment \nThroughout the holiday shoppers can enjoy free musical performances at the Ala Moana Centerstage: \nFriday, July 3, 2015 - 3:00 p.m. Royal Hawaiian Band; 4:00 p.m. Jordan Segundo; 5:00 p.m. Streetlight Cadence; 6:00 p.m. Kupaoa \nSaturday, July 4, 2015 - 3:00 p.m. Drill Team Hawaii; 4:00 p.m. Natalie Ai Kamauu; 5:00 p.m. Aidan James and The Rising Sons; 6:00 p.m. Rocky Brown and DeShannon Higa \nSunday, July 5, 2015 - 3:00 p.m. EMKE; 4:00 p.m. Kala'i Stern; 5:00 p.m. Hoku Zuttermeister 20% Savings Pass \nTake advantage of the weekend of savings during Independence Day weekend. Ala Moana Center is offering a 20% Savings Pass, valid throughout the entire holiday weekend from July 3-5 at over 55 merchants. Visit www.AlaMoanaCenter.com to print out a pass or head to Ala Moana Center's Customer Service Center to pick one up. Use the Savings Pass to receive 20 percent off the purchase of one regular-priced item per store, per day. Holiday Weekend Hours \nAla Moana Center's hours of operation for the Fourth of July weekend are: \nFriday, July 3 - 9:30 a.m. – 9:00 p.m.Saturday, July 4 - 9:30 a.m. – 7:00 p.m. (Makai Market Food Court closes at 8:00 p.m.) \nFor more information on Ala Moana Center's Fourth of July Spectacular, visit www.AlaMoanaCenter.com , follow Ala Moana Center on Twitter at ww.twitter.com/AlaMoanaCenter, or become a fan of Ala Moana Center on Facebook at www.facebook.com/AlaMoanaCenter .", "external_links": [], "published": "2015-07-04T14:11:00.000+03:00", "crawled": "2015-07-04T18:44:33.000+03:00", "highlightTitle": ""}