{"organizations": [], "uuid": "e027809f3a33e815a9b7d1230bcdd64ae0c51927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03359/Kazakhstan_Baytere_3359279k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-03.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/china-watch/business/11708378/silk-road-initiative-china-risks.html", "country": "US", "title": "Chinese companies must be aware of risks of new Silk Road", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Chinese companies must be aware of risks of new Silk Road - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T02:00:00.000+03:00", "replies_count": 0, "uuid": "e027809f3a33e815a9b7d1230bcdd64ae0c51927"}, "author": "Chen Jia", "url": "http://www.telegraph.co.uk/sponsored/china-watch/business/11708378/silk-road-initiative-china-risks.html", "ord_in_thread": 0, "title": "Chinese companies must be aware of risks of new Silk Road", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More news, analysis and features at China Watch Chinese enterprises should be aware of the significant risks and the considerable opportunities as the government implements a strategy to revive the historical trading connections along the ancient Silk Road, a report from a British think tank said. Although the Silk Road economic Belt and the 21st century maritime Silk Road offer many opportunities to boost trade, they also bring challenges due to the uncertain political, economic and regulatory conditions in the countries and regions involved despite their strategic importance to China’s foreign relations, the economist Intelligence Unit said. As an example, the report highlighted the political stability in Kazakhstan and said popular protests could drive an increasingly nationalist agenda. Similarly, foreign companies may suffer unfair rulings on contractual disputes in Vietnamese courts, while labour market risks in Malaysia may increase as labour shortages persist, it said. In addition, security reasons, government effectiveness, tax policies and the standard of local infrastructure may also create barriers for China’s plan, it warned. Security reasons, government effectiveness, tax policies and the standard of local infrastructure may also create barriers for China’s plan “While there are opportunities, the strong policy support for the strategy may prove a weakness if Chinese companies fall into a false sense of security about the government’s plan,” said Liu Qian, director of China forecasting services at the eIU. The report assessed credit risks in more than 60 countries and regions likely to be included in the Belt and Road Initiative, using quantitative and qualitative indicators across different categories, including sovereign, currency and banking sector risks. This article was originally produced and published by China Daily. View the original article at www.chinadaily.com.cn • Read more about Chinese current affairs at China Watch", "external_links": [], "published": "2015-07-04T02:00:00.000+03:00", "crawled": "2015-07-03T22:41:58.000+03:00", "highlightTitle": ""}