{"organizations": [], "uuid": "1cf4f3df1d9d446f8ea8eb85618ee562323f8199", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/07/14/12848150/Shooting Star 2.jpg", "site_section": "http://www.prweb.com/rss2/businesstravel.xml", "section_title": "Business: Travel", "url": "http://www.prweb.com/releases/MaestroPMS/PropertyManagementSystem/prweb12848150.htm", "country": "US", "title": "Maestro PMS Launches Powerful Solutions for Tribal Gaming Operators", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Maestro PMS Launches Powerful Solutions for Tribal Gaming Operators", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "1cf4f3df1d9d446f8ea8eb85618ee562323f8199"}, "author": "PRWEB", "url": "http://www.prweb.com/releases/MaestroPMS/PropertyManagementSystem/prweb12848150.htm", "ord_in_thread": 0, "title": "Maestro PMS Launches Powerful Solutions for Tribal Gaming Operators", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Maestro enables us to quickly look at each guest's activities throughout the property and track where they spend their money to assist Shooting Star in building business that better meets customer perspectives. Toronto (PRWEB) July 15, 2015\nMaestro PMS™, the leading solutions provider for independent hotel operators, continues to expand services with Tribal Gaming and hotel operators in the US and Canada. Maestro’s solutions enable Tribal Gaming operators to understand their guests by measuring and recording their property experience and making the data available for effective, focused marketing and guest service programs that increase loyalty. Click here to learn more about Maestro’s solutions for profitability and productivity.\nWarren Dehan, Maestro PMS President, said, “Tribal Gaming properties are different from most hotels. Without question, gaming hotels have a broader operating focus, but guest-centric service and operating efficiency are as vital here as they are in any other property. We have many Tribal Gaming clients in the US and Canada and each Tribal group has its own legal and operations guidelines. Maestro works within these unique business policies to deliver the solutions they need to support successful operations.”\nMaestro helps Tribal Gaming companies know their guests\nDehan noted that it is essential that these specialized Tribal properties understand their guests, each person’s preferences, and how they spend their money. “Maestro customized its web-based Guest Experience Measurement (GEM) guest satisfaction module to let Tribal operators receive guests’ feedback on what they valued during their stay. Understanding guests and their preferences is the foundation of effective personalized marketing. Guest-stay data and GEM comments are accessible in our Maestro Analytics Business Intelligence system.” Maestro Analytics lets operators easily develop highly effective email marketing programs based on guest interests.\nTight system integration is also important to Tribal casinos. “We partnered with a number of our users, including Shooting Star Casino and Spirit Lake Casino Resort, to integrate Maestro with the most popular gaming systems. These interfaces enable gaming systems to access guest stay and guest history data in Maestro PMS for greater property efficiency.”\nShooting Star Casino relies on Maestro PMS\n\"Shooting Star Casino is a busy seasonal tribal gaming property with a full-service hotel that operates 24/7,\" said Rodney Lemna, MIS director for Shooting Star. \"We use property management technology from Maestro PMS because of its reliable SQL Server database that provides integration within the Maestro Front Office, reservation system, and other modules. Maestro also simplifies integration with our casino management system data. We tie all related outlets together on one Maestro database to better serve guests and operate our hotel more profitably.\" Lemna explained that the property previously used an Oracle-based system. \"Maestro enables us to quickly look at each guest's activities throughout the property and track where they spend their money to assist Shooting Star in building business that better meets customer perspectives.\" The Shooting Star is one of many tribal gaming properties that use the Maestro PMS Suite of integrated modules.\nMaestro PMS is the preferred Property Management System of leading independent hotels, resorts and multi-property groups. Maestro was developed from the ground up as a true hospitality enterprise system that offers a comprehensive suite of 20+ integrated modules sharing a single database.\nFor more information on Maestro PMS or for a demo of the Maestro Property Management Suite’s more than 20 modules please contact Maestro PMS at 1.888.667.8488 or email info(at)maestropms.com.\nExchange ideas and connect with Maestro PMS on Twitter , Facebook , and LinkedIn .\nMaestro Property Management Solution\nEnhance guest service, improve efficiency, and maximize online and offline revenue with Maestro PMS, the industry's most robust and flexible resort software and boutique hotel software solution empowering leading full-service hotels, luxury resorts, multi-property groups, conference centers, condominiums, and timeshare properties. Solutions include Front Office (PMS), Accounts Receivable, Analytics and Business Intelligence, Sales and Catering, Multi-Property Management, Condo & Timeshare Owner Management with Web Functionality, Spa and Activities, Web Booking Engine, Real-Time Yield Management, Dynamic Packaging Golf, CRM, Guest Experience Measurement, CRO, GDS Two-Way XML Connectivity or Integration, Membership, Work Orders, Fine Dining and Retail POS, Online Table Reservations with Web Booking, Concierge, and Guest Experience Measurement. The Maestro PMS is database independent (ODBC Compliant) and may be deployed via Windows, UNIX, Linux, Terminal Services, hosted, and Web platforms.\nAbout Maestro PMS\nMaestro PMS is recognized in the hospitality industry for its standard-setting Diamond Plus Service and robust integrated Maestro resort hotel software technology. With more than 30 years’ experience dedicated to developing technology solutions for the hospitality industry, Maestro PMS is a partner who understands you need a scalable, flexible PMS that works the way you do. Maestro applications are engineered for operators who need to manage their enterprise in a real-time environment for the utmost operational efficiency, productivity, control, and profitability.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5saW5rZWRpbi5jb20vY29tcGFuaWVzLzE0Njg0NA==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tYWVzdHJvcG1zLmNvbS8/cT1jb250YWN0JnV0bV9zb3VyY2U9UFJXZWImdXRtX21lZGl1bT1yZWZlcnJlciZ1dG1fY2FtcGFpZ249UFJDYXNpbm9KdWwxNTIwMTU=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tYWVzdHJvcG1zLmNvbS8/dXRtX3NvdXJjZT1QUldlYiZ1dG1fbWVkaXVtPXJlZmVycmVyJnV0bV9jYW1wYWlnbj1QUkNhc2lub0p1bDE1MjAxNQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tYWVzdHJvcG1zLmNvbS8/cT1hbmFseXRpY3MtYnVzaW5lc3MtaW50ZWxsaWdlbmNlJnV0bV9zb3VyY2U9UFJXZWImdXRtX21lZGl1bT1yZWZlcnJlciZ1dG1fY2FtcGFpZ249UFJDYXNpbm9KdWwxNTIwMTU=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tYWVzdHJvcG1zLmNvbS8/cT1ndWVzdC1leHBlcmllbmNlLW1lYXN1cmVtZW50JnV0bV9zb3VyY2U9UFJXZWImdXRtX21lZGl1bT1yZWZlcnJlciZ1dG1fY2FtcGFpZ249UFJDYXNpbm9KdWwxNTIwMTU=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3R3aXR0ZXIuY29tL21hZXN0cm9wbXM=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5tYWVzdHJvcG1zLmNvbS8/cT1tYWVzdHJvLW1vZHVsZXMmdXRtX3NvdXJjZT1QUldlYiZ1dG1fbWVkaXVtPXJlZmVycmVyJnV0bV9jYW1wYWlnbj1QUkNhc2lub0p1bDE1MjAxNQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5mYWNlYm9vay5jb20vTWFlc3Ryb1BNUz9yZWY9dHM="], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-17T19:25:17.000+03:00", "highlightTitle": ""}