{"organizations": [], "uuid": "0b07e1a159965717500e1736a7011357aaa7cd20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61975/israel-president-shimon-and-seychelles-minister-stange-discussed", "country": "US", "title": "Israel President Shimon and Seychelles Minister St.Ange discussed cooperation", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Israel President Shimon and Seychelles Minister St.Ange discussed cooperation", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T11:03:00.000+03:00", "replies_count": 0, "uuid": "0b07e1a159965717500e1736a7011357aaa7cd20"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61975/israel-president-shimon-and-seychelles-minister-stange-discussed", "ord_in_thread": 0, "title": "Israel President Shimon and Seychelles Minister St.Ange discussed cooperation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cooperation: Peres Center for Peace in Israel and the Peace Islands of the Seychelles Israel President Shimon and Seychelles Minister St.Ange discussed cooperation Adv: srael President Shimon and Seychelles Culture and Tourism Minister St.Ang Adv: \nCooperation between the Peres Center for Peace and the paradise islands of the Seychelles has been on the agenda in Israel. \nThe historic visit of Alain St.Ange, the Minister of Tourism & Culture of the Republic of Seychelles in Israel and the warm meeting with Shimon Peres has grabbed press attention the world over. \nShimon Peres, the former President, Prime Minister and also Nobel Peace Laureate who welcomed the Seychelles Minister St.Ange to his private office at The Peres Center for Peace is seen as a positive sign for future cooperation. Minister Alain St.Ange of the Seychelles, who has the responsibility for Tourism and also for Culture, has always repeated in his press conferences that in Seychelles the island's culture has been placed at the centre of the islands tourism development. \n\"When we say culture we are in fact saying our people, because we have no culture with having our people involved\" said the Seychelles Minister. The Shimon Peres approach in saying that the world needs peace between people and not just between governments has attracted the attention of the visiting Seychelles politician as he said that it is the people that makes the difference every time. \n\"We push for our people to be at thecentre of our development by making them the centre for our tourism development through our island's rich culture. Today our tourism industry is on firmer ground because the People of Seychelles can find themselves in the industry that remains the pillar of the Seychelles economy. This is also why we appealed to the Seychellois to work with the government to claim back our country's tourism industry because when the people are involved they will defend their industry and help to consolidate it for the long term\" said Minister St.Ange. \nThe Seychelles Minister will be meeting today Wednesday the 29th July at the Royal Beach Hotel in Tel Aviv with the leadership of the Israeli travel industry as well as the Israeli media. During this meeting the Minister and his staff will disclose practical matters on how to further increase the popularity of Seychelles in Israel. Minister St.Ange is also expected to hold a meeting with the Israeli Minister responsible for Tourism and have a followup meeting with the Team at the Offices of President Shimon Peres to examine and to propose avenues for cooperation.", "external_links": [], "published": "2015-07-29T11:03:00.000+03:00", "crawled": "2015-07-29T22:30:56.309+03:00", "highlightTitle": ""}