{"organizations": [], "uuid": "5e3e8ac02b93951245e61c97e8ef6f26b3460961", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61805/almaty-promises-most-responsible-convenient-and-sustainable-wint", "country": "US", "title": "Almaty promises most responsible, convenient and sustainable Winter Olympics concept", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Almaty promises most responsible, convenient and sustainable Winter Olympics concept", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T01:30:00.000+03:00", "replies_count": 0, "uuid": "5e3e8ac02b93951245e61c97e8ef6f26b3460961"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61805/almaty-promises-most-responsible-convenient-and-sustainable-wint", "ord_in_thread": 0, "title": "Almaty promises most responsible, convenient and sustainable Winter Olympics concept", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Almaty promises most responsible, convenient and sustainable Winter Olympics concept Adv: Almaty, Kazakhstan Adv: \nALMATY, Kazakhstan and LAUSANNE, Switzerland - Almaty 2022 wants to change the way Olympic Winter Games are planned for and hosted by ensuring a true and lasting Olympic Legacy for the city and region, that will inspire more cities to bid for the Games in the future. \nAlmaty has a very long tradition in winter sports, beginning in the 1950's during the Soviet Union when the city was the center for outdoor winter sports activities. After becoming an independent country two decades ago, Almaty began improving its status as the number one winter sport center in Eurasia. \nAlmaty has continuously flourished into a true winter sports city and one of the top tourist destinations in all of Eurasia. The growth of winter sports in Almaty is directly tied to the city and region's long-term goals and is a key element in the planning for the 2022 Olympic and Paralympic Winter Games. \nA New Winter Games model focused on the Athletes \nAlmaty 2022's Games Concept is one of the most compact in over 30 years. All venues are located within a 30-kilometer radius of the Olympic Village - an unprecedented convenience for the movement's most important stakeholders, the athletes, as well as for the Olympic Family and spectators. \nReal Winter Sports Venues for Real Winter Sports \nSeventy percent of the venues necessary for the Games already exist and are currently fully utilized for winter sports. Since 2000, Almaty has added six top-tier venues to its already existing collection of world-class ski resorts and other competition venues. By 2017, 80% of the venues necessary will exist due to Almaty hosting the 2017 Winter Universiade. \nMinister of Culture and Sport of the Republic of Kazakhstan, Mr Arystanbek Mukhamediuly: \n\"Almaty's bid for the Winter Games is driven by our people's passion for winter sports and is well aligned with our long-term sports infrastructure plan. Almaty will only need two additional competition venues for the Games. Rising demand from the city and region makes the addition of these venues a natural continuation of our strategic plan. Hosting the Winter Games will further the development of winter sports in Kazakhstan and the Central Asian region.\"", "external_links": [], "published": "2015-07-25T01:30:00.000+03:00", "crawled": "2015-07-25T04:46:25.030+03:00", "highlightTitle": ""}