{"organizations": [], "uuid": "ddee2bf7cc07492b5ae56b06e83dd5771735d1fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/celebrity-chef-jose-andres-cancels-deal-for-restaurant-in-donald-trumps-new-dc-hotel-312653341.html", "country": "US", "title": "Celebrity chef Jose Andres cancels deal for restaurant in Donald Trump's new DC hotel", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Celebrity chef Jose Andres cancels deal for restaurant in Donald Trump's new DC hotel - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T20:43:00.000+03:00", "replies_count": 0, "uuid": "ddee2bf7cc07492b5ae56b06e83dd5771735d1fd"}, "author": "Brett Zongker, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/celebrity-chef-jose-andres-cancels-deal-for-restaurant-in-donald-trumps-new-dc-hotel-312653341.html", "ord_in_thread": 0, "title": "Celebrity chef Jose Andres cancels deal for restaurant in Donald Trump's new DC hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON - Celebrity chef Jose Andres backed out of plans Wednesday to open a flagship restaurant in Donald Trump's new hotel under construction in Washington amid ongoing fallout from Trump's political statements.\nAndres, a Spanish immigrant, cited Trump's statements \"disparaging immigrants\" in his decision to cancel plans to open an eatery at the Trump International Hotel. Andres is known for popularizing the small dishes known as tapas in the United States.\nReal estate mogul and Republican presidential candidate Trump said in a speech June 16 that some Mexican immigrants bring drugs and crime to the U.S., and some are rapists. Various organizations are severing relationships with Trump.\nAndres said Trump's statements \"make it impossible for my company and I to move forward.\" More than half of his team is Hispanic, as are many of his restaurant guests, the chef said.\n\"As a proud Spanish immigrant and recently naturalized American citizen myself, I believe that every human being deserves respect, regardless of immigration status,\" Andres said.\nThe new 270-room Trump International Hotel is being built in the historic Old Post Office Pavilion on Pennsylvania Avenue between the White House and the Capitol. It is slated to open in 2016 after a $200 million redevelopment.\nDonald Trump Jr., Trump's son and a Trump Organization executive, issued a statement threatening legal action and noted that Andres has a 10-year lease. The Trump Organization would seek to recover any unpaid rent for the full 10-year term, he said.\n\"Our relationship with Jose Andres has always been a good one, but simply put, Jose has no right to terminate or otherwise abandon his obligations under the lease,\" Donald Trump Jr. said. \"We will also enforce the exclusivity provisions preventing Mr. Andres from opening a competing restaurant anywhere in the D.C area.\"\nOn Monday, The Washington Post reported some immigrant workers at the hotel construction site said they came to the country illegally and are wary now of working for Trump.\nDonald Trump was set to address the report Wednesday in an interview with CNN. Trump said that the buck \"absolutely\" stops with him, and he wished The Washington Post had given him names of workers who came to the country illegally.\n\"We have gone out of our way to make sure that everybody in that building is legal,\" he told CNN. \"I wish they would give us some names; we would get them out immediately.\"\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-07-09T20:43:00.000+03:00", "crawled": "2015-07-09T01:50:19.000+03:00", "highlightTitle": ""}