{"organizations": [], "uuid": "b8c01f905a453eb171607e64a620a022072db8b3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61042/south-african-airways-what-does-future-hold", "country": "US", "title": "South African Airways: What does the future hold?", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "South African Airways: What does the future hold?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T08:53:00.000+03:00", "replies_count": 0, "uuid": "b8c01f905a453eb171607e64a620a022072db8b3"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61042/south-african-airways-what-does-future-hold", "ord_in_thread": 0, "title": "South African Airways: What does the future hold?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE LIST: 5 Star Rated by eTN Readers - and not for sale! Hotels - Airlines - CVBs - Destinations - people eTN interview with SAA CEO Nico Bezuidenhout South African Airways: What does the future hold? Adv: \nJul 04, 2015 Adv: \nDuring the International Air Transport Association (IATA) Annual General Meeting (AGM) held last month in Miami, Florida, eTurboNews (eTN) Publisher Juergen T. Steinmetz had the opportunity to interview Nico Bezuidenhout , Acting CEO of South African Airways (SAA), the South African national flag carrier. The initial part of this meeting focused on Nico sharing with eTN about SAA’s new service from Washington, DC, to Accra, Ghana, on to Johannesburg, South Africa. \nSubsequent to that, the interview’s focus turned to the completion of South African Airways’ 90-Day Action Plan . The plan was a roadmap to stabilize the carrier and resume full implementation of a refined Long-Term Turnaround Strategy (LTTS). The plan comprised 6 pillars - to immediately address the liquidity of the business, resolution of future funding, a full review of its high-level governance framework, correct governance defects, the reorganization and optimization of assets, and the implementation of an effective communication plan. \nIn this final portion of the interview, Nico talks about South African Airways’ ambitions to drive aviation growth in Africa. \neTN: What is the main focus now of South African Airways’ future growth? \nNico: South African Airways wants to focus on growing its African network and improving inter-connectivity on the continent. With more than 80 years of operations and a leading position in Africa, SAA has a crucial role to play in driving aviation traffic growth and economic development. At the IATA Annual General Meeting in Miami, SAA’s determination was to bring its premium service to more and more destinations in Africa. \nOur goal is to increase our revenue in the region by 30% in the next 12 months. Africa is a huge potential market for aviation, and as Africa’s legacy airline, we want to see the continent contribute to more than the current 3% of global aviation. \neTN: Can you tell us specifically what SAA is doing to bolster its service in West Africa? ? \nNico: SAA is already strengthening its position in West Africa with the launch of a new service between Accra, Ghana, and Washington, DC, United States. Starting August 3, 2015, SAA will be providing the only nonstop flight between Ghana and Washington DC, as well as the only Skytrax 4-star-rated airline service and world-class quality from the entire West Africa region to North America. \neTN: This is great news. What else is in store for SAA flights in the future? \nNico: True to its promise of improving inter-connectivity on the continent, SAA entered into a bi-lateral codeshare agreement with Africa World Airlines. This airline partnership will offer SAA customers from Washington and Johannesburg seamless connectivity via Accra to other destinations in Ghana such as Kumasi, Takoradi, and Tamale as well as to Lagos, Nigeria. \neTN: Is there anything you would like to add with regard to SAA’s 90-Day Action Plan that we discussed earlier? \nNico: SAA has improved its performance since the 90-Day Action Plan was completed, with a material year-on-year improvement noticeable in the current financial year, which we commenced in April 2015. The plan included major cost-cutting initiatives and network optimization, which led to significant savings. South African Airways is now ready to continue to boost its capacity and focus on its African routes. \neTN: Thank you so much taking the time to speak with our readers. Do you want to say anything in conclusion? \nNico: SAA has put lot of effort into stabilizing our airline, and we have achieved significant milestones just in the first quarter of 2015 alone. We now look forward to the future of continuing to grow our capabilities and better connect South Africa to the rest of the continent.", "external_links": [], "published": "2015-07-04T08:53:00.000+03:00", "crawled": "2015-07-04T18:21:50.000+03:00", "highlightTitle": ""}