{"organizations": [], "uuid": "cc20271a942ace7b445019a15b6a4286ff4f135c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailysabah.com", "main_image": "http://i.tmgrup.com.tr/dailysabah/2015/07/27/HaberDetay/1438026339146.jpg", "site_section": "http://dailysabah.com//rss/travel", "section_title": "Daily Sabah - Travel", "url": "http://www.dailysabah.com/travel/2015/07/27/akcakoca-the-forgotten-pearl-of-black-sea", "country": "", "title": "Akçakoca: The forgotten pearl of black sea", "performance_score": 0, "site": "dailysabah.com", "participants_count": 0, "title_full": "Akçakoca: The forgotten pearl of black sea", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T20:45:00.000+03:00", "replies_count": 0, "uuid": "cc20271a942ace7b445019a15b6a4286ff4f135c"}, "author": "", "url": "http://www.dailysabah.com/travel/2015/07/27/akcakoca-the-forgotten-pearl-of-black-sea", "ord_in_thread": 0, "title": "Akçakoca: The forgotten pearl of black sea", "locations": ["Mediterranean", "Akçakoca", "Black Sea", "Aegean"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Akçakoca, though neglected by tourists, is still the pearl of the Black Sea, and a tempting option for people who are looking for a different holiday destination other than the regular seaside towns along the Mediterranean and Aegean coasts \nAkçakoca in Düzce province of the Black Sea region was once an important tourism center, when the popular tourist destinations of the Aegean and Mediterranean regions, such as Çeşme, Marmaris and Bodrum, were unknown. With the tourism initiative started in the 1980s in the Mediterranean and Aegean regions, Akçakoca was forgotten. Akçakoca, a district of Düzce, which is only two-and-a-half hours from both Istanbul and Ankara, offers visitors many options like hiking trails, rafting, caving, culture, sea and gastronomical tours. It is also home to the Genoese Castle, which is on UNESCO's Temporary World Heritage List. The restoration of the castle will begin next year and be completed in 2017 to offer adventurers a chance to visit this historical artifact. Another option for tourists is to visit Fakıllı Cave, which is eight kilometers south of the district. The cave is marked as a first-degree archaeological site and is 1,017 meters long. However, only 350 meters of the cave is currently open to visitors. It is foreseen that the visiting area will be enlarged with the finalization of the ongoing work in the cave. The cave, which is composed of galleries going in various directions, pendants, stalactites and stalagmites, is an awe-inspiring natural beauty. The white chamber area of the cave is especially rich in terms of stalactites. This cave is also considered a half-active cave, consisting of areas that show characteristics of a multi-period progress. The unique locals in Akçakoca also make the place worth seeing. People from Hamshen immigrated to Akçakoca from Artvin during the Ottoman-Russian War in 1877 to form a Hamshen village. Some people from Hamshen still live in Russia. The ones who came to Turkey have largely converted to Islam, and the ones who still live in Russia are Russian Orthodox. Hamshen village is 15 kilometers from Akçakoca, and the village includes the historical Hamshen Village Mosque. The first floor of the 150-year-old mosque was made with stone crafting, and the second floor includes examples of the \"çantı\" technique (a building technique that does not use nails). The mosque has a wooden minaret and is famous for its altar, pulpit and frescos. If the road ever takes you to this welcoming village, do not forget to join people who are dancing the \"horon\" (a traditional Black Sea regional dance), drinking tea, chatting and eating Hamshen pears and cherry laurel in the main square. It is also recommended to shop in the Upper Village Bazaar, as it contributes to the local economy. There, you can find fruits and vegetables produced by the locals in their own gardens and local dishes prepared by local women such as \"melengüççeği\" (a kind of homemade baklava), a laz pastry desert, noodles and wild strawberry jam. During the summer season, the bazaar is open every weekend. In Akçakoca, visitors can feel the historic and authentic fabric of the region and learn about local architecture. When feeling tired, a glass of tea or coffee will help tourists relax and enjoy the place even more. Akçakoca has a 35-kilometer seaside with myriad beautiful beaches. Martı, Tersane, Bulaklı, Köy Hizmetleri, Değirmenağzı, Çınaraltı and Çuhallı Çarşı beaches in particular are the most visited ones during summer. Akçakoca Mayor Cüneyt Yemenici said that the district is flooded with tourists during the Eid al-Fitr holiday and that the hotels and hostels reach full capacity during this time. \"During holidays, the population of the village quadruples and reaches up to 130,000,\" Yemenici added. Besides the seaside, the Aktaş and Sarıyayla waterfalls, where every shade of green lingers with harmony, are strongly recommended to adventurers. Moreover, at Kurugöl Canyon, intermediate and advanced hiking trails await eager hikers. Even though the walk can be challenging, walking until the end to enjoy the visual feast of the waterfalls is a rewarding and unforgettable experience.", "external_links": [], "published": "2015-07-27T20:45:00.000+03:00", "crawled": "2015-07-28T05:23:00.820+03:00", "highlightTitle": ""}