{"organizations": [], "uuid": "e2247b15b7e9208a5a58f495be246b27a77a190c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/technology/27803-travelport-starts-search-for-innovative-start-ups-in-uk-ireland-and-nordics-to-join-incubation-programme", "country": "US", "title": "Travelport starts search for innovative start-ups in UK, Ireland and Nordics to join incubation programme", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Travelport starts search for innovative start-ups in UK, Ireland and Nordics to join incubation programme", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T14:00:00.000+03:00", "replies_count": 0, "uuid": "e2247b15b7e9208a5a58f495be246b27a77a190c"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/technology/27803-travelport-starts-search-for-innovative-start-ups-in-uk-ireland-and-nordics-to-join-incubation-programme", "ord_in_thread": 0, "title": "Travelport starts search for innovative start-ups in UK, Ireland and Nordics to join incubation programme", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travelport starts search for innovative start-ups in UK, Ireland and Nordics to join incubation programme Travelport starts search for innovative start-ups in UK, Ireland and Nordics to join incubation programme Details Category: Technology   12:00 Travelport , a leading Travel Commerce Platform, has today announced a special round of funding for travel technology start-ups based in the UK, Ireland and the Nordics to take part in the Travelport Incubation programme announced in June this year. The seed stage investment and mentorship initiative was launched to accelerate the growth of innovative start-up companies focused on travel commerce and the first class has just begun at the Travelport Labs facility in the US. \nThe programme is open to companies from all over the world but this special round of funding has been earmarked specifically to try and find two projects to take forward, one from the UK and Ireland and one from the Nordics. The incubator, which is being run completely in-house by Travelport’s team of dedicated experts, will provide coaching to the winning applicants and provide practical support such as office space and other services. The winners will have access to Travelport’s APIs, software development kits and data feeds, as well as invaluable feedback from Travelport’s customers including travel agencies and travel content providers such as airlines, hotels and car hire companies. The aim is to enable a startup to take its travel commerce innovations to a stage where they can establish product-market fit, develop a user base and drive product usage. Ultimately it will then pitch its idea to a panel of Travelport executives, investors and other potential business development partners from across the travel industry. Simon Ferguson, Travelport’s Managing Director for the UK, Ireland and the Nordics commented: “Travelport is trying to encourage and inspire innovation in our industry. Our open platform already attracts some of the brightest and best developers to conceive, build and sell new apps and technologies. The incubation programme takes that to the next level and we’re looking for truly game-changing ideas. I want to encourage all interested developers and travel startups in the UK, Ireland and the Nordics to apply and firmly believe that with access to Travelport’s expertise and infrastructure, we could help startups take an idea and turn it into a genuinely viable and successful proposition.” More details, including how to apply, can be found on http://www.travelport.com/labs/incubator-apply-fall-2015. Winning teams will be asked to temporarily relocate and base themselves at the Travelport Labs Incubator in Denver, Colorado. Teams may elect to use a portion of the seed funding to offset relocation costs. Related articles", "external_links": [], "published": "2015-07-21T14:00:00.000+03:00", "crawled": "2015-07-21T14:06:38.667+03:00", "highlightTitle": ""}