{"organizations": [], "uuid": "e0329b43f19ab175bb484efbede21b8ee19f4b2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/transit-taking-slow-boat-and-train-london-paris", "country": "US", "title": "In Transit: Taking the Slow Boat (and Train) From London to Paris", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "In Transit: Taking the Slow Boat (and Train) From London to Paris", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T06:19:00.000+03:00", "replies_count": 0, "uuid": "e0329b43f19ab175bb484efbede21b8ee19f4b2c"}, "author": "senh", "url": "http://www.wopular.com/transit-taking-slow-boat-and-train-london-paris", "ord_in_thread": 0, "title": "In Transit: Taking the Slow Boat (and Train) From London to Paris", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Loading... BING NEWS: There’s Nothing Wrong With the MTA That a Hundred Years and a Few Hundred Billion Bucks Can’t Fix Gene Russianoff, who only seems like he's been the head of NYPIRG's Straphangers Campaign since the first IRT train ... New York's transit system functions at all. The subway covers 232 miles of track (fourth in the world, behind only the London ... 07/2/2015 - 6:32 am | View Link Nicholas Winton is dead at 106; saved children from the holocaust A picture taken on September 4, 2009 shows Sir Nicholas Winton (R) being greeted by one of the many Jewish children he saved from former Czechoslovakia evacuated at the begining of World War II to London's Liverpool Street Station on The Winton Train. 07/1/2015 - 10:31 pm | View Link Nicholas Winton, 106, savior of Jewish children, dies Nicholas Winton ... a train. Mr. Winton and his colleagues later arranged for eight more trains to get the rest of the children out, crossing the Third Reich through Nuremberg and Cologne to the Hook of Holland, and then across the North Sea by boat ... 07/1/2015 - 2:42 pm | View Link 14 suspected migrants killed by train in central Macedonia That journey, because of overcrowding and the inexperience of boat ... slow to react to trains because of mental and physical exhaustion. At one point, he said, one woman with an injured foot had to be pushed by others out of the way of an oncoming train. 04/24/2015 - 2:18 am | View Link Japan by train: spirited away in Tokyo and Kyoto There are slow carp in the pools in the gardens ... the phenomenally successful creator of such classic anime films as My Neighbour Totoro and Spirited Away, produced by his Studio Ghibli. Miyazaki inspires fierce devotion and as we wander up the bizarre ...", "external_links": [], "published": "2015-07-25T06:19:00.000+03:00", "crawled": "2015-07-25T08:09:20.014+03:00", "highlightTitle": ""}