{"organizations": [], "uuid": "96f2716bdb41d2c56551db5360f9cf372db42d5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03070/bobbuilder-Sum_3070483k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/education/11766819/Bob-the-Builder-can-he-fix-sex-education-for-toddlers-Yes-he-can-says-UN-adviser.html", "country": "US", "title": "Bob the Builder – can he fix sex education for toddlers? Yes he can, says UN adviser", "performance_score": 2, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Bob the Builder – can he fix sex education for toddlers? Yes he can, says UN adviser - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T08:52:00.000+03:00", "replies_count": 1, "uuid": "1b67feab46f4685b4d972598435ee6d7664c74ef"}, "author": "Anita Singh , Arts and Entertainment Editor", "url": "http://www.telegraph.co.uk/education/11766819/Bob-the-Builder-can-he-fix-sex-education-for-toddlers-Yes-he-can-says-UN-adviser.html#post-0", "ord_in_thread": 0, "title": "Bob the Builder – can he fix sex education for toddlers? Yes he can, says UN adviser", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Parents should sit down with their toddlers and discuss the sex life of Bob the Builder, according to a United Nations goodwill ambassador on sexual health. Goedele Liekens, a former Miss Belgium, said children should be taught about sexuality as soon as they are able to talk – and she warned British parents they should stop being prudish about the subject. Bob the Builder, the much-loved television cartoon character, might seem an unlikely place to start but Miss Liekens thinks otherwise. There could be more to Bob’s seemingly platonic relationship with his business partner Wendy than meets the eye, and that is an ideal basis for a discussion with his toddler fans about sex, she said. “Parents should broach the subject of sex as soon as their children can talk,” Miss Liekens told Radio Times. “I have two teenage daughters and when they were younger we’d watch Bob the Builder and I’d say: 'How do you think Bob feels about Wendy? What would they do if they were in love?’ “You don’t have to comb over the details, just demonstrate that you’re happy to be open.” • 'Why I'm no longer looking forward to university' Miss Liekens, 52, is a qualified psychologist and television presenter who visits schools around the world as part of her work with the United Nations Population Fund. She said: “I’m passionate about the power of good sex education in schools. “In Belgium, it’s fair to say that we are significantly more liberal in our approach than you are in the UK. It’s time you took off the blinkers.” For a forthcoming Channel 4 series, Sex In Class, the UN aide spent two weeks teaching sex education to 15- and 16-year-olds in a Lancashire secondary. • School performs emotional Haka at teacher's funeral in New Zealand In scenes that may prove to be controversial, she invited the pupils to rewrite a porn scene. She is also calling for a GCSE that teaches youngsters as much about the joys of sex as about its dangers, saying: “Sex education shouldn’t be just about averting risk.” Miss Liekens said children now have access to online porn via smartphones and tablets, and “are learning about bad sex younger than ever”. In a message for schools, she said: “When I was growing up, teachers could afford to be less frank. Their pupils’ notion of healthy relationships wasn’t being warped by the internet.” telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-07-28T08:52:00.000+03:00", "crawled": "2015-07-28T06:05:52.039+03:00", "highlightTitle": ""}