{"organizations": [], "uuid": "5af8b1f251381ca77d0b54846352a8301b70ba18", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/06/royal-caribbean-int.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/royal-caribbean-delivers-new-adventures-exclusive-shor-excursions-program/", "country": "US", "title": "Royal Caribbean Delivers New Adventures and Exclusive Shor Excursions ProgramTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Royal Caribbean Delivers New Adventures and Exclusive Shor Excursions ProgramTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "5af8b1f251381ca77d0b54846352a8301b70ba18"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/royal-caribbean-delivers-new-adventures-exclusive-shor-excursions-program/", "ord_in_thread": 0, "title": "Royal Caribbean Delivers New Adventures and Exclusive Shor Excursions ProgramTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Royal Caribbean Delivers New Adventures and Exclusive Shor Excursions Program\nDesigned to meet every travel passion, Royal Caribbean International is tapping into what guests really want to do on their next vacation with an enhanced shore excursion program featuring exclusive new options. From playing five-on-five soccer in Spain to exploring Buddhist temples in Bangkok, these new excursions allow guests to discover a destination through activities which appeal to their sense of adventure. The cruise line’s more than 2,800 shore excursions worldwide also have been grouped into seven special interest categories designed based on guest’s interest and vacation needs: Active Adventures, Family Connections, Royal Tour Challenge, Culture and Sights, Culinary Delights, Caring Discoveries and the Royal Premium Tour Collection.\nActive Adventures\nGuests can get their hearts pumping with activities at every level, from riding a dune buggy and boat rides to high-energy excursions that will take their vacation’s adrenaline factor to the next level. From tackling six exhilarating zip lines and two skybridges in Charlotte Amalie, St. Thomas, to rappelling through small waterfalls, sliding toboggan-style down boulders and jumping off cliffs into natural pools at a thrilling watercourse in Madeira, Portugal, adventure seekers can test their metal on any one of these excursions.\nFamily Connections\nCreating lifelong memories are what family vacations are all about. What better way to ensure that than with shore excursions that kids, parents and even grandparents can enjoy together. Families can share exciting experiences while attending gladiator school in Rome, Italy, where families will learn Roman gladiator combat skills with a hands-on fighting lesson and earn a certificate of Roman citizenship. Or join a wilderness kayak experience at Chilkoot Lake in Skagway, Alaska, where adventure seekers might spot bald eagles, brown bears, seals, sea lions or even whales.\nRoyal Tour Challenge\nIn the spirit of good fun and some friendly competition, guests can spend their days in port with challenge-based activities designed especially for families and groups. Families and friends can spend some quality time together with a half-day laser tag adventure in Cozumel, Mexico, where participants will hit targets to gather points by following a jungle path filled with Mayan ruin replicas. Or better yet, guests can enjoy a five-on-five soccer game in Gijon, Spain, followed by a game of paddle tennis, a raquet sport played extensively in Spain.\nCulture and Sights\nFor travelers looking to explore history and culture with local experts and enrich their understanding of the world they can select classic sightseeing tours, guided visits to archaeological sites and museums, live performances, and more. Guests can enjoy a sprawling Buddhist temple complex in Bangkok, Thailand, which was built in honor of two famous kings, or exploring Rome, Italy, in an Ape Calessino, the little vehicle eponymous to Italian style which launched in 1948 to help with post-WWII reconstruction.\nCulinary Delights\nWant to know what’s on the menu, in the fields or on tap? Discover a destination’s authentic, essential flavors through excursions that introduce guests to local chefs, specialties and purveyors. Visit Graycliff Chocolatier in Nassau, Bahamas, and delight in making truffles, bonbons and bars with a tropical flair, or learn pizza-making from the experts in Naples, Italy, where the Italian favorite was invented in 1830.\nCaring Discoveries\nGuests wanting to make a difference in the places they visit can select tours that help wildlife, the environment and local communities. Save a sea turtle in Cozumel, Mexico, where approximately 20 percent of turtles aren’t quite ready to head for the seas or meet an Iditarod musher and their racing dogs at a dog sled camp in Skagway, Alaska.\nRelated Posts Helsingborg Launches Destiantion Video Quantum of the Seas sets sail from her new homeport of Shanghai Amawaterways Introduces More Opportunities dor Solo Travelers Classic Vacations Creates New Pre & Post Cruise Land Packages for Travel Advisors Royal Caribbean offers WOW sale offers up to $200 onboard and reduced deposit", "external_links": [], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-17T20:04:41.000+03:00", "highlightTitle": ""}