{"organizations": [], "uuid": "6c3ab8169e4e4a90a693769e06dfdd5083056440", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2014/7/27c260c4-e31a-48b0-bf77-ebb0594ba0fbMediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Books", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/chunk-ht-ui-brunch-columns/the-charm-of-fictional-characters/article1-1372753.aspx", "country": "US", "title": "Why some fiction characters have such a grip on our imagination?", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Why some fiction characters have such a grip on our imagination?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T12:16:00.000+03:00", "replies_count": 0, "uuid": "6c3ab8169e4e4a90a693769e06dfdd5083056440"}, "author": "", "url": "http://www.hindustantimes.com/chunk-ht-ui-brunch-columns/the-charm-of-fictional-characters/article1-1372753.aspx", "ord_in_thread": 0, "title": "Why some fiction characters have such a grip on our imagination?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Harper Lee"], "text": "Updated: Jul 26, 2015 17:20 IST The cover of Harper Lee’s new book ‘Go Set a Watchman’. \nSo, Atticus Finch turned out to be a racist so-and-so. Now, who could have seen that coming? Not me, not the many millions of other readers who loved the upright, righteous lawyer of To Kill A Mockingbird . No, not even his adoring daughter, Jean Louise Finch, better known to us as Scout, who suffers a full-scale nervous breakdown when she discovers the ‘truth’ about the father she hero-worshipped.What could Harper Lee have been thinking, when she turned the wise, gentle and just Atticus Finch of Mockingbird into just another Southern supremacist who flirted with the Klan in his youth and now attends ‘Council Meetings’ in Go Set A Watchman to discuss how to keep the ‘Negroes’ in their place as desegregation gathers strength? Wise and gentle no more: Atticus Finch, the righteous lawyer of To Kill A Mockingbird (a still from the film, above) turns out to be a racist in Go Set A Watchman By the time you read this, much newsprint would have been spent on articles, columns and book reviews, dissecting the strange and disturbing path Atticus’ character takes from one book to another. You will have heard from those who insist that Go Set A Watch man was nothing more than a first draft of To Kill A Mockingbird and should never have seen the light of day. You will have read about how the dark undertones of Atticus’ racism were always present in Mockingbird , if only we had bothered to look. You may have even followed sly suggestions that the new book was not entirely Harper Lee’s work. And you will probably have made up your mind about Go Set A Watchman after reading it yourself.So, I am not going to bore you with my views about Harper Lee and her two books (except to say that while Mockingbird remains a classic, Watchman is an interesting case study of how great literature comes into being).Instead, I'd like to talk about something that has intrigued me for many years now. What is it about certain fictional characters that we invest so much of ourselves in them? Why do we get so involved in their entirely imaginary emotional lives? And why do we feel so cheated, even angry, when they don’t live up to the image we carry of them in our heads?Atticus Finch is only the most recent example. But there are many other fictional characters who exercise as great a control on our imagination. And we feel outraged when they are presented as something entirely different without our consent. It seems like a betrayal of the worst kind – because it is.Yes, yes, we’ve all heard that trite line. The book belongs to the author, as do the characters in it. And it is for her/him to do with them as she/he sees fit. But I beg to differ. I truly believe that the act of reading turns the book into something that belongs to every reader as well. A different world: An Agatha Christie mystery when re-imagined for television is transformed into something entirely different by the sudden inclusion of a lesbian angle in the mix And when authors turn rogue (yes, Harper Lee, I'm looking at you!) it feels as if they’re spitting in the face of every single person who has loved their books and fallen in love with their characters.In the case of Watchman , at least, you could argue that it is the author herself who has done the dirty on us. But it is even more annoying when the reinvention is the work of a new author/adapter who has decided to mess with classic pieces by writing a sequel, a spin-off, or just doing a simple rewrite. (Here’s an idea: if you are so creative, why don't you just make up your own stories peopled by your own characters, instead of ruining other people’s imaginary worlds?)Much as I loved Longbourn [by Jo Baker], with its central conceit of telling the story of Jane Austen’s Pride and Prejudice from the viewpoint of the servants of the Bennet household, I was revolted by the little plot twist that gave the entirely harmless (if woolly-headed) Mr Bennet an illegitimate child. Now, what had the poor man done to deserve this kind of besmirching of his character?I feel much the same way when I see some of Agatha Christie’s Poirot mysteries re-imagined for television. A much-loved book, with its cast of familiar characters, is transformed into something entirely different by the sudden inclusion of a lesbian angle in the mix (poor old Agatha would be spinning in her grave if she got wind of this!). Not that I have anything against lesbians (some of my best friends... etc etc) but they are not a part of Christie’s universe. If you want a murder mystery with a lesbian twist, then feel free to write your own.And then, there’s the whole Game of Thrones imbroglio (if you haven’t seen the last series or read all the books, be warned: spoilers ahead!). You read a book in which sweet little Sansa Stark escapes from King’s Landing and ends up at the Eyrie with Littlefinger. Meanwhile, a girl is tricked out to look like Arya Stark and married to Ramsay Bolton. And then, one day, you settle down to watch the TV series. And what do you see? Sansa Stark, in the flesh, married to Ramsay Bolton!So, to go back to my original question, why do we feel so invested in certain fictional characters? Why do their fates so absorb us? Why do we feel outraged on their behalf when their creators do the dirty on them? Why does Atticus Finch turning out to be a racist upset us so?Is it because we feel the certainties of our world being turned upside down? Or are we just big babies who can’t bear to grow up and see the world in shades of grey rather than in stark black and white? \nFrom HT Brunch, July 26Follow us on twitter.com/HTBrunchConnect with us on facebook.com/hindustantimesbrunch Tags", "external_links": [], "published": "2015-07-25T12:16:00.000+03:00", "crawled": "2015-07-27T07:10:51.960+03:00", "highlightTitle": ""}