{"organizations": [], "uuid": "e731a44ef331947f52414bb12ca729b2f018e84a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03386/hobbitu-rexfeature_3386281k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-24.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/travelnews/11760429/Hobbit-hole-to-be-built-in-Suffolk.html", "country": "US", "title": "Hobbit hole to be built in Suffolk", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Hobbit hole to be built in Suffolk - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T19:59:00.000+03:00", "replies_count": 1, "uuid": "2a20cc30a3b985ddca957fcc9248f8cd5f1a7211"}, "author": "Hugh Morris", "url": "http://www.telegraph.co.uk/travel/travelnews/11760429/Hobbit-hole-to-be-built-in-Suffolk.html#post-0", "ord_in_thread": 0, "title": "Hobbit hole to be built in Suffolk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Do you want to spend your days in tiny houses built into the countryside, smoking pipe-weed and prancing about in fields singing songs? If the answer is yes then you aspire to the life of a hobbit – and a Suffolk holiday company is determined to make your dream a reality. Poddit Hole Holidays has launched a Kickstarter campaign in an effort to raise £50,000 to build an authentic halfling house and recreate life in the Shire of Middle Earth, the famous creation of JRR Tolkien in The Hobbit and Lord of the Rings. • 10 best hobbit houses to buy Fans of the books – and seemingly endless films – are able to invest anything from £2 - and receive “a big thank you” - up to £1,000 - and be one of the first to spend five nights in the Poddit Hole, as well as a guided tour of the nearby Anglo-Saxon village of West Stow. • Video: tour of The Hobbit film set For a pledge of £80, investors can guarantee themselves a night in the hobbit hole. Jan Lengyel, who has run the existing pod-camping site at West Stow with his wife for two years, admits that Lord of the Rings “doesn’t really float my boat” but was motivated by the environmentalist aspects of the project. His commitment to the Tolkien theme was brought about when he spoke of his plans to Tolkien Society member Alan Baxter who offered to oversee the project with his hobbit eye, pro bono. • UK's most luxurious camping experiences Lengyel says the sustainable pod, which will be carbon-neutral and could be carbon-positive, will have underfloor heating and cost between £100 and £130 a night for a stay (“I don’t want to be part of rip-off Britain,” he said). • Game of Thrones filming locations and holidays Work will start as soon as the funding target is met (it currently hovers around £5,000) and be carried out by specialist builders, Hartwyn Natural Building. “I wanted to make a sort of blueprint, open-source project which might perhaps help or inspire other people to create their own hobbit dwellings and contribute to enlightening the wider public,” said Lengyel. “I’m very conscious of people’s – and my own – carbon footprint, so if I can stop one family from flying to Benidorm, and instead holidaying in Britain, that’s my ultimate goal.” For truly committed Lord of the Rings fans, tours of the Hobbiton set in Waikato, New Zealand are available. Other incarnations of hobbit houses – though not as authentic as the one planned for Suffolk – are also available around the world, from Cornwall to Thailand. Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-07-24T19:59:00.000+03:00", "crawled": "2015-07-24T15:03:19.274+03:00", "highlightTitle": ""}