{"organizations": [], "uuid": "c49979fa752e4cc1fec8657f4e5babcc47b9d0f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/download-21.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/cega-secures-investment-announces-management-buy/", "country": "US", "title": "CEGA secures investment and announces management buy-out", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "CEGA secures investment and announces management buy-out", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T12:50:00.000+03:00", "replies_count": 0, "uuid": "c49979fa752e4cc1fec8657f4e5babcc47b9d0f5"}, "author": "Bicky", "url": "http://www.travelandtourworld.com/news/article/cega-secures-investment-announces-management-buy/", "ord_in_thread": 0, "title": "CEGA secures investment and announces management buy-out", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  TOURISM NEWS » CEGA secures investment and announces management buy-out CEGA secures investment and announces management buy-out   \nCEGA, the market-leading medical assistance and claims handler, has secured funding from NatWest to support a management buy-out, led by Alistair Hardie, Group Chief Executive. The buy-out supports the company’s recently publicised intention to invest in the business to drive innovation for clients and support its growth agenda. The management team will remain unchanged with Muir Robertson as Managing Director, Warwick Hoddy as Group Finance Director and Neil Heasman as Operations Director. Graham Ponsford, one of the original founders, will remain as Non-Executive Chair. Graham comments: “I am delighted with this outcome. At the core of CEGA is exceptional customer service and commitment to our clients; knowing that the management team will continue to drive CEGA’s growth by building on this is the best possible result.” \n\nAlistair Hardie adds “CEGA has grown strongly over the last few years and with this support from NatWest, which brings additional focus and opportunity for the management team to drive further expansion, we can continue to build on our first class customer service, delivering increased innovation for our Insurer and Corporate clients, and implement our plans to establish an international footprint.” \n\nAnthony Donohue, Head of Corporate for Solent Region at NatWest, commented “NatWest is delighted to support this exciting development in CEGA’s evolution. We have worked with CEGA for over 20 years and know the business intimately, making the decision to back the management team with this investment an easy one for NatWest. We look forward to being CEGA’s partner as it continues to grow over the coming years.” \n\nAlistair, who joined CEGA in January, has delivered solutions to the insurance and corporate sectors for 30 years. Most recently he was CEO for CIGNA’s individual health, life and accident business, and was part of the management team of FirstAssist insurance services when it was acquired by CIGNA in 2011.", "external_links": [], "published": "2015-07-02T12:50:00.000+03:00", "crawled": "2015-07-02T13:03:19.000+03:00", "highlightTitle": ""}