{"organizations": [], "uuid": "1aea61a1890b260ed446594466a76d3ad521d0b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297482275337_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.calgarysun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.calgarysun.com/2015/07/21/tourist-attractions-in-havana-attest-to-complicated-us-cuban-history", "country": "CA", "title": "Tourist attractions in Havana attest to complicated US-Cuban history", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "Tourist attractions in Havana attest to complicated US-Cuban history", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T16:10:00.000+03:00", "replies_count": 0, "uuid": "1aea61a1890b260ed446594466a76d3ad521d0b4"}, "author": "", "url": "http://www.calgarysun.com/2015/07/21/tourist-attractions-in-havana-attest-to-complicated-us-cuban-history", "ord_in_thread": 0, "title": "Tourist attractions in Havana attest to complicated US-Cuban history", "locations": ["Havana"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Trends \nHAVANA -- This week's reopening of embassies and resumption of diplomatic relations between the United States and Cuba opens a new chapter in the countries' complicated relationship. \nBut any visitor to the Cuban capital can see that connections between the two nations run long and deep just by taking stock of all the attractions showcasing American culture and history. Despite decades of hostility, some of these sites even seem to celebrate Americans, while others reflect an anti-U.S. point of view. \nHere's a look: \n\nHEMINGWAY \nAmerican writer Ernest Hemingway lived in Cuba on and off for years and worked on some of his most famous books here, including \"For Whom the Bell Tolls\" and \"The Old Man and the Sea.\" One of Havana's biggest tourist attractions is his estate at Finca Vigia, visited by literary pilgrims from around the world and Cubans alike. You can't enter the home, but large open windows provide a good look inside. Liquor bottles and magazines artfully placed amid sofas and tables suggest Hemingway will be back at any moment. Also onsite is Hemingway's boat, the Pilar. \nPhotos of Hemingway posing with trophy fish and with revolutionary leader Fidel Castro decorate many bars and hotels, including the Ambos Mundos hotel in Old Havana, where you can tour a room Hemingway lived in. And two Havana bars attract a steady stream of tourists in part thanks to Hemingway's famed drinking declaration: \"My mojito in La Bodeguita, my daiquiri in El Floridita.\" The handwritten quote, allegedly scribbled by Hemingway himself, is framed over the bar at La Bodeguita del Medio. The Floridita features a Hemingway statue. \nOther sites include a yacht club named the Hemingway Marina and a Hemingway monument in the nearby fishing village of Cojimar. \n\nU.S. PRESIDENTS \nSeveral sites around Havana reference U.S. presidents, but not all are complimentary. \nInside the Museum of the Revolution, caricatures of Ronald Reagan, George H.W. Bush and George W. Bush are displayed in \"Cretins Corner.\" Outside the museum sits wreckage from a U.S. spy plane shot down over Cuba in 1962 during the Cuban Missile Crisis, a defining moment in John F. Kennedy's presidency. \nAbraham Lincoln is honoured with two statues: a miniature sculpture outside an English-language school, Escuela de Idiomas, on Avenida de los Presidentes between 17th and 19th streets in the Vedado neighbourhood, and a bust in the Parque de la Fraternidad on the Paseo del Prado. \nEven Havana's domed Capitolio building will look familiar to Americans. It was modeled on the U.S. Capitol in Washington. \n\nTHE ROSENBERGS \nJulius and Ethel Rosenberg were executed by the U.S. government on charges of passing atomic secrets to the Soviet Union. Their deaths were protested around the world; they left behind two young children and newly released 1950 grand jury testimony suggests Ethel may have been innocent. In Havana, a brick memorial at Zapata and Paseo streets is decorated with their images, a flock of doves and the words, \"For peace, bread and roses, we will face the executioner. Ethel and Julius Rosenberg, murdered June 19, 1953.\" \n\nMOBSTERS, MOVIE STARS AND BASEBALL PLAYERS \nMany hotels display pictures and stories from Havana's pre-revolutionary heyday as a glamorous playground for mobsters, movie stars and baseball players, from a plaque about Babe Ruth in the Hotel Plaza lobby to a photo exhibit at the Hotel Nacional that includes Nat King Cole, Frank Sinatra and Fred Astaire. The Nacional's official history notes that in 1946, it was the site of a meeting of Mafia bosses. The gathering later inspired part of \"The Godfather: Part II.\" \nBlack-and-white photos also decorate Sloppy Joe's, an Old Havana bar once frequented by Hemingway and other celebs. Sloppy Joe's also figured in a piece of British culture, the book and film \"Our Man in Havana,\" Graham Greene's story of a bumbling spy. \n-", "external_links": [], "published": "2015-07-21T16:10:00.000+03:00", "crawled": "2015-07-21T17:00:31.972+03:00", "highlightTitle": ""}