{"organizations": [], "uuid": "c21027ea349ffad4d608bac3429fb061ad23aaba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-07/20150718_PORTUGAL-LEISURE-MARKET_02.JPG", "site_section": "http://www.themalaymailonline.com/feed/rss/travel", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/old-lisbon-market-cooks-up-food-to-media-concept-to-go-global", "country": "MY", "title": "Old Lisbon market cooks up food-to-media concept to go global", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Old Lisbon market cooks up food-to-media concept to go global", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T04:49:00.000+03:00", "replies_count": 0, "uuid": "c21027ea349ffad4d608bac3429fb061ad23aaba"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/old-lisbon-market-cooks-up-food-to-media-concept-to-go-global", "ord_in_thread": 0, "title": "Old Lisbon market cooks up food-to-media concept to go global", "locations": ["Lisbon"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Old Lisbon market cooks up food-to-media concept to go global Saturday July 18, 2015 Print Article \nChef Susana Felicidade cooks at Ribeira Market in Lisbon, Portugal, July 15, 2015. — Reuters pic LISBON, July 18 — In the past year, Lisbon’s 19th-century riverside market has soared from dilapidated oblivion to a top attraction on a zesty blend of fine food, drinks, arts and hip shopping — a concept its owners now plan to replicate in London and New York. \nAside from serving as a gigantic window display for downtown renovation and the Portuguese capital’s tourism boom, the two-storey Mercado da Ribeira also gives a physical dimension to the mostly-digital Time Out magazine, which owns the expanding project. \nThe Lisbon unit of the London-based global media brand, which provides tips to dozens of cities worldwide, had assigned its journalists and critics to handpick their favourite chefs, bars and shops for the market. \n“This is a magazine, with various of its sections, brought to life,” said Joao Cepeda, director of Time Out Lisbon and now the chief of international operations of the new Time Out Markets unit that will expand the project overseas. \nThe venue sells Time Out -brand tours, invites musicians and houses an urban art project called Underdogs, which is a gallery and a public art programme for local and foreign artists. Portuguese street artist VHILS is one notable co-founder of Underdogs. \nJoao Cepeda (centre), director of Time Out Lisbon poses for a picture at Ribeira Market in Lisbon, Portugal, July 15, 2015. — Reuters pic Cepeda said the project was meant to “use our know-how to save the local edition”. \nDuring Portugal‘s 2010-2014 economic crisis, revenues from advertising and website views fell. So when city hall offered a 20-year concession to renovate and run the market in 2011, the magazine seized the opportunity. \nWith 60,000 visits on a good week, the commercial success has exceeded initial expectations almost two-fold, he said. \nTime Out is choosing locations to open a market in London by 2017 and another in New York by 2018. In the meantime, it is also looking at Portugal‘s second-largest city of Porto. \nPeople have a meal at Ribeira Market in Lisbon, Portugal, July 15, 2015. — Reuters pic Day and night, tourists and locals sit at long wooden tables and bar counters sampling fusion food and local dishes made in 20 busy, see-through kitchens. Popular choices are salmon-cuttlefish burger with seaweed on cuttlefish ink bun, salad with goat cheese and ice cream or fish tartar with avocado puree. \nRave reviews on travel websites frequently label the spot a “foodies’ paradise”, with many praising it as a pioneering “cross between a food court, a Shoreditch food market and a chef’s restaurant”, while others highlight its “hipster aura” and modest prices considering a vast choice of quality food. \nIn the past year, Lisbon’s 19th-century riverside market has soared from dilapidated oblivion to a top attraction on a zesty blend of fine food, drinks, arts and hip shopping. — Reuters pic Cepeda calls it “a simplified version of fine dining experience”, which sets it apart from souped-up street food generally served at similar venues abroad, including New York. \nThe chefs are happy too as client numbers keep growing. \n“Now, over a year on, the business is better than when we opened, way past the novelty peak, and it has all the goings of improving further,” saidSusana Felicidade, a prominent chef who runs Cozinha da Felicidade (Kitchen of Joy) in the market and a popular restaurant called Pharmacia in an old quarter nearby. \nThe chef, who specialises in Portuguese-inspired “petiscos” — a more elaborate and heartier cousin of Spain‘s tapas — says the success of the food court also supports the remaining part of the old market where locals buy vegetables, meat and seafood. She buys some 80 per cent of all ingredients from the market. \nThe renovation and a new riverside promenade helped boost the wining and dining scene in the hip Cais do Sodre area where 14 restaurants and bars have opened up in the past year. — Reuters More Stories for You:", "external_links": [], "published": "2015-07-18T04:49:00.000+03:00", "crawled": "2015-07-18T05:11:36.000+03:00", "highlightTitle": ""}