{"organizations": [], "uuid": "1ce985e2f20329bed853eb24f5e5a268ccddfef4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site333/2015/0707/20150707__GLFJohnDeereClassic~1.jpg", "site_section": "http://www.denverpost.com/travel", "section_title": "Travel - The Denver Post", "url": "http://www.denverpost.com/sports/ci_28447082/spieth-skips-scotland-familiarity-john-deere-classic", "country": "US", "title": "Spieth skips Scotland for familiarity of John Deere Classic", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Spieth skips Scotland for familiarity of John Deere Classic - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T10:16:00.000+03:00", "replies_count": 0, "uuid": "1ce985e2f20329bed853eb24f5e5a268ccddfef4"}, "author": "Luke Meredith  AP Sports Writer", "url": "http://www.denverpost.com/sports/ci_28447082/spieth-skips-scotland-familiarity-john-deere-classic", "ord_in_thread": 0, "title": "Spieth skips Scotland for familiarity of John Deere Classic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SILVIS, Illinois (AP) — Most golfers believe the path to the British Open title starts a week early in Scotland.\nJordan Spieth is content to stay at home and continue his Grand Slam push at the tournament that launched his PGA Tour career.\nRather than join the majority of the world's top golfers and prep for St. Andrews by playing the links course in Gullane, Scotland, Spieth will spend the weekend at the often-overlooked John Deere Classic.\nIt's not just that Spieth wants to remain loyal to the tournament where he won for the first time in 2013 at age 19.\nHe's also just very comfortable playing the TPC Deere Run, one of the easiest courses on the tour.\n\"If I thought I wasn't going to play well next week because I played here, it would be a different story. I probably wouldn't be here. This is good preparation for me to get good feels, to get in contention and to find out what's on and what's off,\" said Spieth, one of just six golfers to win the U.S. Open and the Masters in the same season.\n\"I'm here because I believe I can win this week. I believe it's advantageous for me to try and win this week.\"\nSpieth's rapid rise to No. 2 in the world — with injured Rory McIlroy's top spot within reach as soon as next weekend — has taken many by surprise.\nThose who watched Spieth's breakthrough on this Quad Cities course two years ago saw his potential first-hand.\nAdvertisement One year after playing the JDC at just 18 on a sponsor's exemption, Spieth forced his way into a three-way playoff by holing out from the 18th-hole bunker.\nSpieth then outlasted David Hearn and local favorite Zach Johnson to become the first teenager to win on the tour in 84 years.\nSpieth also played the Quad Cities and the Open Championship in back-to-back weeks in 2014, finishing tied for 36th at Royal Liverpool.\nSpieth said the only issue he has with skipping Scotland is the 6-hour time difference he'll have to make up following Sunday's final round.\nBut it might even be easier for Spieth to get into a rhythm at Deere Run — which yielded more eagles and birdies than any other PGA course in 2013-14.\n\"It doesn't matter where it is. When I get over there, whether I play well or I don't play well, it has nothing to do with what I did the week before. I will certainly have enough energy. I will certainly have enough rest, and I will be as prepared as I can be,\" Spieth said.\nThough Spieth is by far the marquee name in this event, he'll likely have plenty of competition.\nJohnson, who grew up in nearby Cedar Rapids, Iowa, and serves on the tournament committee, has shot in the 60s in 24 consecutive rounds at Deere Run.\nSteve Stricker, a native of nearby Wisconsin, won three straight here from 2009-11.\nLast year's winner, Brian Harman, and Kevin Kisner should also push Spieth.\nBut this year's event will be all about Spieth and how it impacts his run at a third straight major.\n\"He stuck with his commitment, which is very honorable. At the same time, there has only been so many guys in so many years who've won the first two majors, and there's a lot of pressure on him. I applaud him,\" Johnson said.", "external_links": [], "published": "2015-07-07T10:16:00.000+03:00", "crawled": "2015-07-08T06:08:44.000+03:00", "highlightTitle": ""}