{"organizations": [], "uuid": "2043d72f2347ca24a4b4061efd80f0924b7034b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ottawasun.com", "main_image": "http://storage.ottawasun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297723771712_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.ottawasun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.ottawasun.com/2015/07/13/diefenbunker-near-ottawa-a-monument-to-canadas-cold-war-era", "country": "CA", "title": "Diefenbunker near Ottawa a monument to Canada's Cold War era", "performance_score": 0, "site": "ottawasun.com", "participants_count": 0, "title_full": "Diefenbunker near Ottawa a monument to Canada's Cold War era", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T17:17:00.000+03:00", "replies_count": 0, "uuid": "2043d72f2347ca24a4b4061efd80f0924b7034b2"}, "author": "", "url": "http://www.ottawasun.com/2015/07/13/diefenbunker-near-ottawa-a-monument-to-canadas-cold-war-era", "ord_in_thread": 0, "title": "Diefenbunker near Ottawa a monument to Canada's Cold War era", "locations": ["Canada", "Ottawa"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cultural & Historical Travel \nCARP, Ont. -- Mike Braham could tell you stories all day about the life of soldiers working underground in Canada's most famous bunker. \nThere's the one about the two guys who lived there for two months before the military made them get some fresh air. Or the cat that broke in and took up residence in the Central Emergency Government Headquarters, better known as the Diefenbunker. \nBraham knows the stories not only because he's been a tour guide at the museum for eight years, but because also at one time he was on the list of 535 men and women -- among them the governor general, prime minister and senior cabinet members -- who would be locked inside the bunker if the Soviet Union launched missiles at the Canadian capital. \nWho wasn't on the list? Family of those 535 individuals. \n\"They didn't give too much thought to what it would be like when the doors locked down,\" Braham says, noting that it would have been \"more than stressful\" to be locked down underground not knowing how bad things were topside. \nLuckily the facility was never used in an emergency and now sits as a massive monument to Canada's Cold War era. \nThe Diefenbunker, officially opened as a museum in 1999, is in a nondescript area of Carp, Ont., about 35 kilometres from Parliament Hill, or a 30-minute drive from downtown Ottawa. The area around it is tranquil with rolling fields where cows graze. The heart of the village and the local fairgrounds are short walks from the museum site. \nBeing run by a private, not-for-profit group, there is no grand building like those at nationally funded museums in and near the heart of the capital. \nThe Diefenbunker was an active military facility until 1994 at which time it was designated a national historic site. \nUpon its closure, the military moved much of its equipment out of the bunker and let the locals in. (One farmer actually stole the bed reserved for the prime minister, which museum officials were able to retrieve and now have on display.) \nThe next year, locals grabbed flashlights and started leading tourists down the musty, metallic and concrete-laden blast tunnel (which, years later, actor Morgan Freeman walked down in a scene for the Hollywood political thriller \"The Sum of All Fears\") and through the corridors connected to, among other things, the CBC-Radio Canada transmission booth, the emergency cabinet room and smaller Canadian versions of the war room and \"big board\" from \"Dr. Strangelove.\" \nThere were also living quarters, a medical centre, the cafeteria -- \"The food here was always good,\" Braham jokes, noting that rations were always freshly stocked (and staff ate well because the facility never had to host a full contingent of officials) -- and a Bank of Canada vault designed to store the weight in gold of about 100 African elephants behind a 30-ton door to prevent a \"Goldfinger\"-type scenario that would lead to a currency collapse. \nThat vault now hosts conferences, receptions and even weddings. \nLast year, 55,000 visitors walked the halls of the Diefenbunker, and the museum is on track to surpass that this year with the majority being families with children who have no experience with the Cold War. \n\"We're not your typical museum environment,\" says museum marketing manager Megan Lafreniere. \n\"In a lot of areas, you can interact with things. So kids who have never seen a rotary telephone -- don't understand what that is -- they're picking them up, they're playing with them, they're taking selfies with their own phones. \n\"It's this really special environment where people can actually walk through and experience it rather than being behind stanchions and away from the artifacts.\" \nIF YOU GO \nWear comfortable shoes and something warm (it gets chilly underground), and plan to be there for between one to two hours. There are elevators for those in wheelchairs. Parents may want to opt for baby carriers over strollers to more easily move around the facility. Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions . Sponsored Links", "external_links": [], "published": "2015-07-13T17:17:00.000+03:00", "crawled": "2015-07-14T01:02:41.000+03:00", "highlightTitle": ""}