{"organizations": [], "uuid": "115f1c9530efc895f1e30aea7234bea9c3f0df45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/1/7/d/9/image.related.StuffLandscapeSixteenByNine.620x349.1617cq.png/1438027837468.png", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/news/70600058/AHEAD-plane-design-project-with-KLM-The-future-of-air-travel", "country": "AU", "title": "AHEAD plane design project with KLM: The future of air travel?", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "AHEAD plane design project with KLM: The future of air travel?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T23:10:00.000+03:00", "replies_count": 0, "uuid": "115f1c9530efc895f1e30aea7234bea9c3f0df45"}, "author": "Craig Platt", "url": "http://www.stuff.co.nz/travel/news/70600058/AHEAD-plane-design-project-with-KLM-The-future-of-air-travel", "ord_in_thread": 0, "title": "AHEAD plane design project with KLM: The future of air travel?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AHEAD plane design project with KLM: The future of air travel? CRAIG PLATT Last updated 08:10, July 28 2015 \nThe AHEAD aircraft design features an integrated wing and body. \nIs this the future of airliners to come? According to TU Delft University in the Netherlands and airline KLM, it may well be. \nA project undertaken by the university with assistance from KLM Engineering & Maintenance as well as Airbus and engine manufacturers has resulted in the AHEAD design. AHEAD stands for Advanced Hybrid Engine Aircraft Development. \nThe revolutionary design does away with the traditional fuselage body-with-wings attached shape of the current generation of jet aircraft, instead replacing it with a sleek 'blended wing' body, where the wings and body of the plane are integrated. \nAccording to KLM's engine project manager Rob Duivis , the design minimises drag and results in a more efficient aircraft. \nThe design would also use a hybrid engine totally different to the turbofan engines currently used by jets. The hybrid would use two different combustion systems, burning either cryogenic hydrogen or liquefied Natural Gas (LNG) in the first system, and either kerosene or biofuel in the second. \n\"By using two different combustor and fuel systems the engine's total efficiency increases and emissions are reduced,\" Duivis wrote. \nThe design would allow for about 300 passengers to be seated on board and offer a flying range of about 14,000 km (similar numbers to that of the current Boeing 777-300ER, but with far more efficiency). \nThe AHEAD design overlayed above a Boeing 777. \nSo would passengers notice any differences, other than the shape of the plane? It's not likely, according to Dr. Arvind Gangoli Rao, scientific coordinator for the project, who told Skift that some of the more outlandish predictions for the future of air travel won't result from this project. But there might still be some minor benefits. Ad Feedback \n\"It might not result in playgrounds in the sky, but it is also unlikely to be too tightly packed, simply because the routes and demand it is designed to fill won't require much denser cabins,\" he said. \nAirbus itself has predicted its own \"concept cabin\" spaces customised to the needs of individual passengers. Instead of separate classes, there would be \"zones that target more individual needs like relaxing, playing games, interacting with other passengers or holding business meetings with people on the ground\". There are even predictions of a transparent fuselage, offering panoramic views (and perhaps making nervous flyers even more nervous). \nThat may seem far fetched, but passengers shouldn't get too excited about even boarding a plane like the AHEAD design any time soon though - KLM estimates that introduction of this type of aircraft is likely around the year 2050. \nWhat do you think of the design? Let us know in the comments.", "external_links": [], "published": "2015-07-27T23:10:00.000+03:00", "crawled": "2015-07-28T03:43:11.704+03:00", "highlightTitle": ""}