{"organizations": [], "uuid": "1fb73b7c26d63a40891315ede8256ee9ca1c67a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150701LlimonFloodingGirl.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/07/01/spike-costa-ricas-school-dropouts-latest-challenge-flooding", "country": "US", "title": "Spike in Costa Rica's school dropout rates latest concern after flooding", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Spike in Costa Rica's school dropout rates latest concern after flooding -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:06:00.000+03:00", "replies_count": 0, "uuid": "1fb73b7c26d63a40891315ede8256ee9ca1c67a0"}, "author": "Zach Dyer", "url": "http://www.ticotimes.net/2015/07/01/spike-costa-ricas-school-dropouts-latest-challenge-flooding", "ord_in_thread": 0, "title": "Spike in Costa Rica's school dropout rates latest concern after flooding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Officials are worried about how school closings this week across the province of Limón and other areas affected by flooding in Costa Rica might cause a spike in the dropout rate.\n“We’re very worried about this area,” Education Minister Sonia Marta Mora told reporters during a site visit to Barra del Colorado, on Costa Rica’s northern Caribbean coast, on Wednesday.\nMora said a compound effect of school closings this week across the region immediately before the upcoming two-week summer vacation could keep some students from returning to classes. More than 51,000 students are out of the classroom because of flooding, and 431 school buildings have been damaged.\nPresident Luis Guillermo Solís, who is touring the affected areas on Wednesday and Thursday, declared a national emergency during a press conference at Casa Presidencial on Tuesday.\nDespite the suspension of classes, the minister said that more than 400 schools would continue to provide meals for students.\nThe minister asked school directors to check in with families to ensure they “don’t lose one boy or girl in the classroom.”\nSchool attendance is already a challenge in many of the areas hard-hit by flooding last weekend. According to the most recent State of Education report, 64 percent of districts with the highest concentration of low levels of household education and other challenges that prevent high school attendance are located in the Caribbean slope and Brunca regions. In 2011, only 46.7 percent of Costa Rican young adults aged 17 to 21 graduated from high school.", "external_links": [], "published": "2015-07-02T03:06:00.000+03:00", "crawled": "2015-07-02T05:09:00.000+03:00", "highlightTitle": ""}