{"organizations": [], "uuid": "23cb2fcfeb1f854ba5c65bbcad2fad3621bf7b00", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "", "site_section": "http://www.financialexpress.com/section/lifestyle/travel-tourism/", "section_title": "Travel News:Travel and Tourism,Latest Travel News,Tourism News Today,Latest Travel News Articles | The Financial Express", "url": "http://www.financialexpress.com/article/markets/commodities/gold-price-reaching-buying-temptation-zone-of-rs-25000-in-india-assocham/107842", "country": "IE", "title": "Gold price reaching ‘Buying Temptation Zone’ of Rs 25,000 in India: ASSOCHAM", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Gold price reaching ‘Buying Temptation Zone’ of Rs 25,000 in India: ASSOCHAM | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T22:44:00.000+03:00", "replies_count": 0, "uuid": "23cb2fcfeb1f854ba5c65bbcad2fad3621bf7b00"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/commodities/gold-price-reaching-buying-temptation-zone-of-rs-25000-in-india-assocham/107842", "ord_in_thread": 0, "title": "Gold price reaching ‘Buying Temptation Zone’ of Rs 25,000 in India: ASSOCHAM", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Gold likely to fall to Rs 23,000 level within a month: Experts Gold rate regains sheen on robust stockists buying Data Drive: Gold losing glitter Gold will remain gold and not turn into silver or brass, however, much correction in prices takes place due to receding global risk perceptions and the yellow metal is fast reaching a “Buying Temptation Zone” in India, an ASSOCHAM paper has said.\nRs 25,000 or a shade below per ten grams in the spot market is a “Buying Temptation Zone (BTZ)” for Indian retail demand, the paper said , taking note of the fact that in the futures market the prices are already below this level for August delivery.\n“The enquiries among the consumers, mostly women, are increasing. As we near the festive and wedding seasons in the next few months, the demand for jewellery will pick up, boosting the overall sentiment, which of course at a bottom now,” the ASSOCHAM Paper said.\nIt said India, along with China, being among the largest two consumers of the gold can influence the global prices as well. A sharp reduction in the international prices below the USD 1100 per troy ounce was triggered by a resolution of the Greek financial crisis and stability returning in the Chinese stock market which had lost a huge three trillion dollar between June 12 and the second week of July on apprehensions of a bubble in the making.\nThen, there have also been expectations of interest rates hikes to be announced by the US Fed sometime in September-October. This optimism about the interest rates in the US has been cemented by the better job data.\n“Yes, in this backdrop gold lost some lustre as risk aversion in other asset classes got reduced, but neither in Greece , nor in China systemic issues have not been addressed,” the paper pointed out.\n“When it comes to gold, some kind of conventional wisdom is seen whereby it is considered to be best save haven even among the central bankers all over the world. So, it would be premature to write off gold, even though in India a debate is underway whether as an investment class, gold is productive,” said ASSOCHAM Secretary General D.S. Rawat while commenting on the scenario.\nAccording to ASSOCHAM Paper, gold is not all that non-productive item, given its contributions in the market for jewellery-both for domestic customers and the global markets.\n 26, 2015 2:44 pm", "external_links": [], "published": "2015-07-26T22:44:00.000+03:00", "crawled": "2015-07-26T14:08:42.174+03:00", "highlightTitle": ""}