{"organizations": [], "uuid": "a03fcdbd4fe304e995da7ef2fcb6108c8bcbac9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/27850-excel-london-celebrates-association-success-in-busiest-ever-year", "country": "US", "title": "ExCeL London celebrates association success in busiest ever year", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "ExCeL London celebrates association success in busiest ever year", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T15:30:00.000+03:00", "replies_count": 0, "uuid": "a03fcdbd4fe304e995da7ef2fcb6108c8bcbac9c"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/27850-excel-london-celebrates-association-success-in-busiest-ever-year", "ord_in_thread": 0, "title": "ExCeL London celebrates association success in busiest ever year", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ExCeL London celebrates association success in busiest ever year ExCeL London celebrates association success in busiest ever year Details Category: Venues & Events Created   13:30 ExCeL London has got off to a flying start in what will be the venue’s busiest ever year for conferences and events. Ahead of playing host to Europe’s largest medical association meeting for the European Society of Cardiology, ExCeL and London are already demonstrating their ability to host world leading events. \nThe European Wound Management Association (EWMA), which hosted their annual congress at ExCeL from 13th – 15th May, saw a 17% increase in delegates and a 33% increase in exhibitors. The congress welcomed a total of 4126 participants from 77 countries. Commenting on their event in London, Bent von Eitzen, said: “EWMA had a very successful conference at ExCeL and feedback from the delegates and exhibitors has been very positive. We enjoyed working with the staff at the venue, who were very professional. Everything worked well, from start to end, and we got very valuable suggestions along the way.\" EuroPerio8, which was held in London from 4th – 6th June, also reported a 25% increase in delegate numbers with 9,700 participants, compared to their last congress in 2012. Florian Fehringer, Senior Project Manager, Mondial Congress & Events, said “ExCeL London is a venue which I can definitely recommend for any kind of large-scale congress. The flexibility in terms of venue concept and room capacities was a big asset contributing to a very successful EuroPerio8. London in general is also destination which delegates obviously like to go to.” The 52nd Annual Congress of the European Renal Association-European Dialysis and Transplantation Association (ERA-EDTA 2015), which took place from the 28th – 31st May, also reported strong delegate numbers with four times the number of attendees from the UK compared to previous events. Since the start of the year, ExCeL London has also welcomed the Diabetes UK Annual Professional Conference; IEEE International Conference on Communications; Global Offshore Wind; the Digestive Disorders Federation Conference and the Regional Congress of the International Society of Blood Transfusion. Samantha Shamkh, Head of Conventions, ExCeL London, said: “The record number of associations that are now choosing London is an endorsement of the decision to open our International Convention Centre. The world renowned attraction of London is responsible for delivering record breaking attendance and is why so many associations are now seeing our city as a prime location for their events. We are committed to continuing our investment in the venue, in the build-up to the opening of our Crossrail station in 2018 and beyond.\" Becky Graveney, Head of Associations at London & Partners added: “This is a standout year for association events, with the European Society of Cardiology’s annual congress just around the corner, and the fantastic spread of leading medical events coming to London. We’re delighted that our strategy of targeting larger scale conventions and meetings, as well as our focus on London’s sectoral expertise is delivering such strong results for the city. London now sits at number 6 for the number of meetings hosted and number 4 for number of delegates and we regularly see that when events come to London, the number of attendees increases.” Related articles", "external_links": [], "published": "2015-07-23T15:30:00.000+03:00", "crawled": "2015-07-23T22:11:18.917+03:00", "highlightTitle": ""}