{"organizations": [], "uuid": "919be69f70a6da1ac45c7b12052bbf0aed124304", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/the-story-behind-pragues-astronomical-clock.html", "country": "US", "title": "The Story Behind Prague's Astronomical Clock", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "The Story Behind Prague's Astronomical Clock", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T06:02:00.000+03:00", "replies_count": 0, "uuid": "919be69f70a6da1ac45c7b12052bbf0aed124304"}, "author": "Lisa Jeeves-2015-07-17T04:02:51-0400", "url": "http://www.articlesfactory.com/articles/travel/the-story-behind-pragues-astronomical-clock.html", "ord_in_thread": 0, "title": "The Story Behind Prague's Astronomical Clock", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | July 17, 2015 \nIf you’re visiting Prague for the first-time, you can't afford to miss one of the city’s most famous attractions: its astronomical clock tower, which has rung out the time, every single ho... \nIf you’re visiting Prague for the first-time, you can't afford to miss one of the city’s most famous attractions: its astronomical clock tower, which has rung out the time, every single hour, for more than 600 years. Even now, the hourly performance of the clock, where the Apostles and other characters come out in procession, amazes visitors from all over the world. But how was the clock created, and how does it stand among the city’s sources of pride? \nOld Town Square’s Highlight \nBuilt sometime between 1410 and 1490, the famous astronomical clock is remarkable not only for its sheer longevity (it’s one of the three oldest astronomical clocks in the world, but the only one that is still functioning well) but also for its showmanship. Designed to tell time but also entertain and remind people of certain truths of life, every hour the clock comes to life as the twelve apostles file out of two open doors. Other minor characters also serve as asides to the hourly show: a skeleton rings a bell, while a Turk shakes his head. Meanwhile, the character understood to represent vanity looks in the mirror - a poignant footnote to the chimera nature of beauty and the swiftness of time’s passage. The hourly show is capped off by the crowing of a golden rooster and the ringing of the bell at the tower’s top. \nMore than Just a Clock \nThe astronomical clock is not only designed to tell time, but also to the months and the position of important heavenly bodies. For the modern tourist, these things may no longer be considered important, but during Medieval times, when even the question of whether the Earth moved around the sun or otherwise was still in question, the clock was an important human achievement. \nOver the centuries, the clock tower has come to embody many layers of cultural meaning and significance for its citizens and, while the circumstances of the clock’s creation is documented in fact, it is nevertheless shrouded in myth - some sinister, some intriguing. In any case, the astronomical clock is a true wonder of human craftsmanship and ingenuity, and one that has been delighting visitors for many years. \nHow to Visit Prague’s Famous Clock and other City Attractions \nIf you’re flying into the city, you can use Prague airport transfers as a convenient transportation option. While most of the attractions throughout the city can be reached on foot, if you ask your driver to point out the high profile sites while going past on the Prague airport transfers, it's an excellent way to get the lay of the land so you can return at your leisure. Source: Free Articles from ArticlesFactory.com ABOUT THE AUTHOR \nLukas Johannes is a driver for Shuttle Direct. If you’re looking for Prague airport transfers , Shuttle Direct provide pre-booked shuttles to major destinations all over Europe. Wherever you travel, Shuttle Direct can make sure that you don’t miss your car on your holiday abroad.", "external_links": [], "published": "2015-07-17T06:02:00.000+03:00", "crawled": "2015-07-17T15:41:10.000+03:00", "highlightTitle": ""}