{"organizations": [], "uuid": "577f13def63de40772f1dcdb4f1113a7a009027d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/tunisia-travellers-face-major-rebooking-price-hikes/4697711.article", "country": "GB", "title": "Tunisia travellers face major rebooking price hikes", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Tunisia travellers face major rebooking price hikes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T11:00:00.000+03:00", "replies_count": 0, "uuid": "577f13def63de40772f1dcdb4f1113a7a009027d"}, "author": "", "url": "http://www.ttgdigital.com/news/tunisia-travellers-face-major-rebooking-price-hikes/4697711.article", "ord_in_thread": 0, "title": "Tunisia travellers face major rebooking price hikes", "locations": ["Tunisia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Save \nClients looking to rebook a holiday away from Tunisia for travel in the next few weeks are facing higher prices in other destinations. \nTour operators have changed their terms and conditions to allow Tunisia customers to switch to other destinations without any charges, but customers are facing higher prices to alternative locations and having to pay the difference. \nLee Hunt, owner of Deben Travel in Woodbridge, Suffolk, said he had one family of four booked to go to Tunisia in August for a total of £2,800 but they were now facing prices of at least £3,500 to switch to other destinations. \n“Tunisia typically is one of the better priced places to go, particularly when clients book early, as this family did,” he told TTG . “It’s very hard to find a similar holiday for the same price now. \n“They are looking at having to spend an extra £700 to go elsewhere and they are not sure they can afford that. The only other option is to reduce the duration of the holiday.” \nHunt said that they had also rebooked a couple who had been due to fly to Tunisia on Sunday, just two days after the massacre. \n“They were booked through Just Sunshine and we were able to cancel, get a refund and get them rebooked to Zante in Greece on Saturday for travel the next day,” he explained. \nSteve Lee, commercial director of Jet2holidays, admitted there were price differences with other destinations because Tunisia “offered great value for money”. \n“We’re making pricing as competitive as possible, but there is only so much we have control over,” he said. “Our sales advisers are trying to find good-value alternatives and if there’s an uplift in price, we’re trying to make sure it’s as small as possible.” \nSteve Pattenden, owner of Double S Travel in Luton, said: “We didn’t have any customers in Tunisia or booked to travel there in the next few months, but we have had people come in and ask for ‘anywhere but Tunisia’. \n“We booked them to Tenerife in the end. But this kind of attack could happen anywhere.” \nAidan O’Kelly, a homeworker with Colchester Travel, said: “You never know where these things are going to happen - look at what France has been through. Some people think that Tunisia is safer because of the extra security.” Readers' comments (3) Alan Bowen | Wed, 1 Jul 2015 12:18 pm \nClearly the right decision on the merits of the two airports but politically this is probably a non starter. The Prime Minister will sit on the fence for fear of a revolt, not only of his backbenchers but also many of his Cabinet who are vehemently opposed to any expansion at Heathrow. Agreeing to move forward will force Boris Johnson and his cohorts to mobilise against both the idea and the PM and he needs their support in dealing with the EU in the next 18 months. The only place this idea will go, at least in the short to medium time is into the long grass in the hope that many forget about it. Unsuitable or offensive? Report this comment Alan Bowen | Wed, 1 Jul 2015 12:24 pm \nSafer after an attack? This was the second attack in three months in Tunisia, security clearly wasn't stepped up at all, or if it was, it failed. It would be interesting to see what percentage increase the operators have added to holidays elsewhere as a result of this massacre because that is the usual reaction to bad news. Unsuitable or offensive? Report this comment William Thompson | Wed, 1 Jul 2015 1:36 pm \nHowever, if you book the Ibis in Lyon for example, you're not going to get the Conrad in Mauritius at the same price no matter when you book.", "external_links": [], "published": "2015-07-01T11:00:00.000+03:00", "crawled": "2015-07-03T10:18:18.000+03:00", "highlightTitle": ""}