{"organizations": [], "uuid": "a96bebd738ecea6e1083f17c59234069df55c16f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/Wires/Online/2015-07-01/AP/Images/GayMarriageClerks-076fd.jpg", "site_section": "http://www.washingtonpost.com/lifestyle", "section_title": "Lifestyle: Food, Style, Travel, Advice, Home, Garden &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/national/probate-judges-opposed-to-gay-marriage-stand-firm/2015/07/01/a5b3acfa-1fd0-11e5-a135-935065bc30d0_story.html", "country": "US", "title": "Probate judges opposed to gay marriage stand firm", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Probate judges opposed to gay marriage stand firm - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "a96bebd738ecea6e1083f17c59234069df55c16f"}, "author": "By Martin Swant and Claire Galofaro | AP", "url": "http://www.washingtonpost.com/national/probate-judges-opposed-to-gay-marriage-stand-firm/2015/07/01/a5b3acfa-1fd0-11e5-a135-935065bc30d0_story.html", "ord_in_thread": 0, "title": "Probate judges opposed to gay marriage stand firm", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Protesters waive a rainbow flag on the front lawn of the Rowan County Judicial Center, Tuesday, June 30, 2015, in Morehead, Ky. The protest was being held against Rowan County Clerk Kim Davis, who, due to the ruling of the Supreme Court of the United States and her own religious beliefs, has refused to issue any marriage licenses in the county. (Timothy D. Easley/Associated Press) By Martin Swant and Claire Galofaro | AP July 1 at 5:15 AM TROY, Ala. — Gay couples can petition, protest and even sue — but that won’t change Probate Judge Wes Allen’s mind: He is not issuing them marriage licenses, despite a U.S. Supreme Court ruling that marriage is a constitutional right equally held by all Americans.\nAllen is the probate judge in Pike County, a county in southern Alabama with a population of about 33,000. He is among a handful of public officials across the Bible Belt so repulsed by the thought of enabling a same-sex marriage that they are defying the U.S. Supreme Court and refusing to issue a license to anyone, gay or straight.\nAllen and other probate judges in the state cite Alabama Code section 30-1-9, which says marriage licenses “may” be issued by them — not that they must issue them.\nConsequently, Allen says, he is “not in violation of any Supreme Court order. ... We’re just going to hold the course and not issue any marriage licenses.”\nAllen says that he believes marriage “is one man, one woman.”\nIn Kentucky on Tuesday, Rowan County Clerk Kim Davis shut her blinds at work to block the view of rainbow-clad protesters outside. They carried flags and signs saying, “You don’t own marriage” and chanted, “Do your job!”\nMoments later, Davis told a lesbian couple who walked in asking for a license to try another county.\n“It’s a deep-rooted conviction; my conscience won’t allow me” to grant gay-marriage licenses, Davis told The Associated Press. “It goes against everything I hold dear, everything sacred in my life.”\nSome judges and clerks in Texas have done the same, ordering their offices in the name of religious liberty and free speech to issue no marriage licenses at all.\nLegal experts are dubious that religious freedom arguments will protect public officials who not only refuse to participate due to their own beliefs, but also decline to make accommodations so that others who don’t object can serve the public instead.\nTwo things can happen if a Kentucky clerk won’t issue a marriage license to a same-sex couple: They can resign, or go to jail, said Sam Marcosson, a constitutional law professor at the Louis D. Brandeis School of Law at the University of Louisville.\n“If it means that you simply cannot fulfill your duties because of your religious beliefs, what is required of you is that you can no longer hold that office,” Marcosson said. “That applies to a judge, that applies to a senator, that applies to anyone who holds public office.”\nClerks and probate judges hold the keys to marriage in counties around the country, and in many rural areas, there are few alternatives for hundreds of miles. Couples turned away could seek a court order, and a clerk who still refuses to issue a license could be jailed for contempt, Marcosson said.\nThey also risk criminal official misconduct charges, said Warren County Attorney Ann Milliken, president of the Kentucky County Attorneys Association. The misdemeanor, punishable by up to a year in jail, is committed when a public servant “refrains from performing a duty imposed upon him by law or clearly inherent in the nature of his office.”\nCasey Davis, the clerk in Casey County, Kentucky, says he won’t resign and he’d rather go to jail than issue a marriage license to a same-sex couple. None have yet come in to get one, he said.\nAfter the Supreme Court declared that marriage is a constitutional right equally held by all Americans, clerks in Arkansas and Mississippi resigned Tuesday rather than be forced to sign the licenses of gays and lesbians. Linda Barnette, the circuit clerk in Grenada County, Mississippi, for 24 years, wrote in her resignation letter that she is a “follower of Christ” and that she chooses “to obey God rather than man.”\nOther reluctant Kentucky clerks gave up the fight Tuesday.\nLawrence County Clerk Chris Jobe, who also serves as president of the Kentucky County Clerks Association, told The Courier-Journal in Louisville that he would resume issuing licenses for fear of being removed from office. Several other Kentucky clerks made similar concessions.\nEven in Mississippi, Texas and Louisiana, where governors took the most vigorous stands against Friday’s Supreme Court’s ruling, clerks were issuing licenses.\nBut in Kentucky, Kim Davis stayed firm in denying one Tuesday to April Miller and Karen Roberts, a couple of 11 years who live in Morehead.\nThe office of Kentucky Attorney General Jack Conway encouraged any couples who are turned away to seek private counsel. Miller and Roberts contacted the American Civil Liberties Union of Kentucky to represent them.\n“This is where we live; we pay taxes here, we vote here. And we want to get married here,” said Miller.\nOutside Kim Davis’ office, drivers honked and waved, flew rainbow flags from their windows and shouted “love must win!”\nBut a small group also gathered to support Davis, demonstrating the stark divide that remains in the most theologically conservative stretches of the South and Midwest, where state leaders fought hard for years to prevent same-sex marriage.\n“Our country is on the wrong path. We as a people no longer exalt God,” said Dennis Buschman, who carried a Bible as he led a half-dozen people supporting the clerk’s defiance. He called homosexuality an “abomination” and a “serious, serious sin.”\nSome protesters confronted them.\n“God did not elect her, I did,” said Kevin Bass, a former police officer who arrived at the courthouse with his wife to support gay couples seeking licenses. “If she objects to doing her job, she can go.”\n___\nGalofaro reported from Morehead, Kentucky. Associated Press writers Jeff Amy in Jackson, Mississippi; and Adam Beam in Frankfort, Kentucky; contributed to this report.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-01T12:31:51.000+03:00", "highlightTitle": ""}