{"organizations": [], "uuid": "c1c4661a1991204c36f06f0b48c69a5938161645", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/dcx/2015/07/09/1083912.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/618132/cycling-in-hua-hin", "country": "TH", "title": "Cycling in Hua Hin", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Cycling in Hua Hin", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T23:29:00.000+03:00", "replies_count": 0, "uuid": "c1c4661a1991204c36f06f0b48c69a5938161645"}, "author": "", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/618132/cycling-in-hua-hin", "ord_in_thread": 0, "title": "Cycling in Hua Hin", "locations": ["Hua Hin district"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Prachuap Khiri Khan", "Hua Hin"], "text": "NEWSPAPER SECTION: LIFE | WRITER: PICHAYA SVASTI - + On July 12, the \"Cycling for Sustainable Tourism\" trip will take place on the 70km Hua Hin-Pa La-u route in Hua Hin district, Prachuap Khiri Khan. \nPa La-u waterfall. \nThe objectives are to promote sustainable tourism and regular exercise among people as well as the sale of fruits, such as durian, mangosteen and rambutan, from near Pa La-u Waterfall. \nThe event is organised by the Tourism Authority of Thailand's (TAT) Prachuap Khiri Khan Office, the Muang Hua Hin Municipality, Klai Kang Won Palace Cycling Club, Hua Hin/Cha Am Tourism Business Association, Hua Hin Police Station, Hua Hin tourist police, two local associations and a local hospital. \nRegistration begins at 6.30am in front of the clock tower near Wat Hua Hin and the trip starts at 7am. Participants will have lunch together at the venue of the \"Prized Products of Tambon Huai Sat Yai\". Call the TAT local office on 032-513-885. For the Love of Museums \nUntil the end of September, there are free trips to five museums in Bangkok on Saturdays and Sundays and especially on July 30 and 31 from 10am-6pm. \nThe aim is to celebrate the 60th birthday of HRH Princess Maha Chakri Sirindhorn who wishes to see the development of museums nationwide. \nThe five museums are the King Prajadhipok Museum (with the focus on the Thai Parliament Exhibition), the Thai Cabinet Museum, the Royal Thai Orders and Decorations Museum, the Nitas Rattanakosin Museum (Rattanakosin Exhibition Hall) and the Ratchadamnoen Contemporary Art Centre. \nThe objectives are to promote museum visits, enhance co-operation among Thai museums and increase the number of visitors to each museum. \nThe Bangkok Metropolitan Administration provides a free shuttle service from the city hall near the Giant Swing to the five museums every 20 minutes throughout the day except from noon-1pm. Call the BMA Call Centre 1555. Biking in Chai Nat \nThe TAT Suphan Buri Office and the Chai Nat Cycling for Health Club are promoting cycling around the Bung Krachab Yai swamp in Han Kha district, Chai Nat province. \nA highlight is riding bicycles across the San Jai Rak Jai Samakkhi Bridge, a 500m bamboo bridge, above the pond filled with red lotus flowers to an island where more than 30 water buffaloes reside. The views are stunning especially at dawn and dusk. Also on this island is a community with four houses without tap water and electricity. Visit www.tatsuphan.net or www.facebook.com/chainatcitybike or call the TAT local office on 035-525-863. Hong Kong tourism campaign \nUntil the end of next month, every visitor who arrives in Hong Kong through Hong Kong International Airport will be surprised by the 78-day Hong Kong Summer Fun campaign, launched by the Hong Kong Tourism Board on June 15. \nA highlight is the Instant Mega Draw, which will run every day from 9am-11pm at Terminal 1, Level 5, the Hong Kong International Airport, during the campaign period with more than 2.4 million prizes worth more than HK$400 million (around 1.7 billion baht). \nEach participant will receive Free 7 Days csl Wi-Fi Pass. Prizes include a free cellphone with SIM card, free tickets to some attractions, discounts for hotel accommodation and complimentary airport transfers, ferry tickets and Explore Hong Kong tours.", "external_links": [], "published": "2015-07-08T23:29:00.000+03:00", "crawled": "2015-07-10T03:21:44.000+03:00", "highlightTitle": ""}