{"organizations": [], "uuid": "c247bd594f72d51a7593026725b1d4066caf6a6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/new-yorker-follows-earthquake-tsunami-instructions-saying-portland-faces-enhanced-threats", "country": "US", "title": "The New Yorker follows up with earthquake, tsunami instructions, saying Portland faces enhanced threats", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "The New Yorker follows up with earthquake, tsunami instructions, saying Portland faces enhanced threats", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T07:47:00.000+03:00", "replies_count": 0, "uuid": "c247bd594f72d51a7593026725b1d4066caf6a6c"}, "author": "senh", "url": "http://www.wopular.com/new-yorker-follows-earthquake-tsunami-instructions-saying-portland-faces-enhanced-threats", "ord_in_thread": 0, "title": "The New Yorker follows up with earthquake, tsunami instructions, saying Portland faces enhanced threats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: The New Yorker follows up with earthquake, tsunami instructions, saying Portland faces enhanced threats Kathryn Schulz, the author of an article in The New Yorker about the massive earthquake and tsunami expected to hit the Northwest, has written another story that says Portland faces especially high risks. The New Yorker posted Schulz's follow-up piece Tuesday. 07/28/2015 - 3:28 pm | View Link EXTREMELY Dangerous situation unfolding in NYC/NJ (RECORD STORM SURGE BROKEN is with NYC tonight. Be safe, be well. A veteran is someone who at one point in his life wrote a blank check made payable to The United States of America for the amount of \" up to and including my life\". That is Honor, and there are too many people in ... BING SEARCH: Portland Tribune Story Is taxi subsidy the answer to wheelchair policy? No easy answers when it comes to providing timely, affordable cab service to wheelchair users Jim... 07/27/2015 - 7:36 pm | View Website Breaking News Videos, Story Video and Show Clips Watch breaking news videos, news stories and video clips from your favorite CNN shows 07/27/2015 - 6:02 pm | View Website Sponsor a Child | Child Sponsorship Program | World Vision Sponsor a child and help fight world hunger through your donations that support World Vision's aid, child nutrition and agricultural solutions around the world. 07/27/2015 - 5:41 pm | View Website The Search for the Chemical Soldier on Conspiracy Café More than 50% of Germans disapprove of the bailout of Greece. Greece repays the creditors with debt they received from the central banks. Euro zone puts pressure on ... 07/27/2015 - 4:44 pm | View Website FlashAlertPortland This afternoon at approximately 5:30 p.m. Multnomah County Sheriff's Office River Patrol and Portland Fire Bureau responded to the Willamette River near the Fremont ...", "external_links": [], "published": "2015-07-29T07:47:00.000+03:00", "crawled": "2015-07-29T07:58:14.529+03:00", "highlightTitle": ""}