{"organizations": [], "uuid": "fbb830178237f052df59a21cf68a6c49782c32f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/27775-associations-welcome-new-plan-to-drive-tourists-beyond-london", "country": "US", "title": "Associations welcome new plan to drive tourists beyond London", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Associations welcome new plan to drive tourists beyond London", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T13:15:00.000+03:00", "replies_count": 0, "uuid": "fbb830178237f052df59a21cf68a6c49782c32f7"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/27775-associations-welcome-new-plan-to-drive-tourists-beyond-london", "ord_in_thread": 0, "title": "Associations welcome new plan to drive tourists beyond London", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Associations welcome new plan to drive tourists beyond London Associations welcome new plan to drive tourists beyond London Details Category: Agency & Association Created on Friday, 17 July 2015 11:15 The Prime Minister will today announce the Government’s new 5 point plan to boost tourism right across the UK - spreading the benefits of one of our fastest growing sectors beyond the capital, helping to create jobs and rebalance the economy. A new inter-ministerial group will be formed to co-ordinate and align action across Government to ensure that we have the right infrastructure in place to make it easy for visitors to discover the best of what this country has to offer. \nThe group, headed by the Culture Secretary John Whittingdale, and including ministers from across government, including the Department for Communities and Local Government, BIS, DEFRA, Home Office, and the Foreign and Commonwealth Office, will focus on five key areas: 1. A better co-ordinated sector: the sector is too fragmented - we want to see local attractions and tourism organisations collaborating to grow the sector for everyone not competing. 2. Skills and jobs: Driving and retaining talent in the sector to encourage growth 3. Common sense regulation: Reforming regulation sensibly to drive competition and improve the tourism offer for visitors 4. Transport: Forging innovative links between the transport and tourism sectors to help visitors travel outside of the capital 5. An improved welcome: Delivering a world class welcome at the Border Ministers from the Scottish, Welsh and Northern Ireland Governments are also invited to join the group when relevant. The Prime Minister will also announce: A £1 million ‘Rail for Tourism innovation’ competition, which will call for ideas to transform the travel experience for visitors to the UK and make exploring the UK by rail more attractive to tourists. The competition will be run by the RSSB’s Future Railways Programme, and winners will receive funding to develop their ideas and carry out trials. The plan will build upon the enormous success of the 2011 tourism strategy, which culminated in a record year for overseas visitors in 2014 and now sees the industry contribute £60 billion to the UK economy a year. By opening up new experiences to tourists, we can build on this and ensure more visitors travel outside London and experience the very best of Britain. Continuing his visit to the South West today the Prime Minister, David Cameron, said: \"Millions of overseas tourists visit the UK every year and most take in the sights of London. But Britain has so much more to offer, from the Cornish Riviera to the Scottish Highlands and everything in between. \"For many areas tourism is a key industry bringing jobs, growth and security for working people. Tourism supports almost one in 10 jobs in the UK and we want to rebalance the economy to make sure this boost is felt right across the country.” Culture Secretary, John Whittingdale, said: “Tourism is a vital industry that brings jobs and growth to local economies across Britain. There are so many world-class things to see and do in the UK, and we need to make sure visitors are experiencing as many of them as possible. “I am delighted to chair this new group which will put tourism at the heart of government and help to ensure that every part of the UK benefits by co-ordinating action across Government. We want every visitor to the UK, whether from home or abroad, to have a brilliant experience and shout about it, encouraging even more tourists to choose Britain.” Ufi Ibrahim, chief executive of The British Hospitality Association, said: \"This is truly a watershed moment for the hospitality and tourism industry and is a result of concerted campaigning by the BHA and its members to Parliament and Whitehall to make their voices heard loud and clear on how we can make the UK a better place to live, work and visit. We congratulate the Prime Minister for making this bold move and John Whittingdale and Tracey Crouch for listening to the evidence we presented during last year’s Culture, Media and Sport Select Committee tourism inquiry that made the economic, diplomatic and social case for prioritising the potential of our industry. \"Joined up government leadership will enable our vision for the UK to become the world's hospitality and tourism powerhouse attracting more visitors, creating more jobs and strengthening local economies to the benefit of all society. We are mobilising the entire private sector to coordinate with national, regional and local government to maximise the industry’s potential and look forward to working with the new inter-ministerial group to begin constructive dialogue with HM Treasury and other bodies to bolster the UK’s international competitiveness and advance growth.” Commenting on this morning’s announcement by Prime Minister David Cameron on tourism policy, ABTA Head of Public Affairs Stephen D’Alfonso said: “ABTA welcomes this morning’s announcement of the Government’s five point plan for tourism. We are particularly encouraged that the Prime Minister has chosen to speak on the importance of tourism within these first 100 days after the General Election, recognising publicly the value of our industry as a key driver of jobs and growth in the UK economy. We welcome that focussed commitment on jobs and skills, transport infrastructure, an improved visitor experience, and a more joined up approach to tourism across Government, through the new ministerial taskforce, all of which were priority areas identified by ABTA in our manifesto ahead of the General Election. We look forward to working closely with the Government in the months and years ahead to deliver on the announcements the Prime Minister has made today.” Related articles", "external_links": [], "published": "2015-07-17T13:15:00.000+03:00", "crawled": "2015-07-17T15:39:55.000+03:00", "highlightTitle": ""}