{"organizations": [], "uuid": "7749406b8c2cd366eabd9a12fad2fff91beb162d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/View-migratory-sharks-in-New-Zealand.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/view-migratory-sharks-new-zealand-conservation-project/", "country": "US", "title": "View migratory sharks in New Zealand under a conservation project - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "View migratory sharks in New Zealand under a conservation project - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "7749406b8c2cd366eabd9a12fad2fff91beb162d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/view-migratory-sharks-new-zealand-conservation-project/", "ord_in_thread": 0, "title": "View migratory sharks in New Zealand under a conservation project - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View migratory sharks in New Zealand under a conservation project Published on : Monday, July 6, 2015\nNew Zealand has boosted the protection of sharks by signing the Memorandum of Understanding on the Conservation of Migratory Sharks.\nPrimary Industries Minister Nathan Guy and Conservation Minister Maggie Barry have signed the agreement today which aims to improve the conservation of seven migratory shark species vulnerable to over-exploitation.\n“This international memorandum is the first global instrument of its kind, and we join 38 other countries in becoming a signatory,” says Mr Guy.\n“Many migratory sharks are increasingly under threat because they grow slowly, are late to mature, and produce very few offspring.\n“Some of these populations have also been severely depleted by the global increase in unregulated fisheries, and markets targeting sharks and their fins.”\n“Becoming a signatory will help New Zealand have a voice in the global conservation of sharks and will help to support and lead shark conservation efforts – in particular across the wider south west Pacific,” says Ms Barry.\nThe decision to sign the MOU was set out in the revised New Zealand National Plan of Action on Sharks which was released in January 2014, which drives the conservation and management of shark species in New Zealand.\n“One of the key outcomes of this plan has been a complete ban on shark-finning, which came into effect in October last year,” says Ms Barry.\n“The signing today will further reinforce the reputation of New Zealand as being committed to protecting sharks and contributing to the wider global efforts on this.”\nRelated Posts Dubai Airport Terminal 1 await bids from retailers! Hiking Through Paradise Tourism 2025 – promising start but much more to do MIA Director, National Counterparts Travel To Washington, D.c. To Make Case For Additional CBP Staffing", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T14:18:42.000+03:00", "highlightTitle": ""}