{"organizations": [], "uuid": "879df463f735262044e6a10b99c330b998d86f23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/Saudi_Arabias_Umrah_revenue_touches_SAR12bn-ZAWYA20150721035005/", "country": "AE", "title": "Saudi Arabia's Umrah revenue touches SAR12bn", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Saudi Arabia's Umrah revenue touches SAR12bn", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T08:15:00.000+03:00", "replies_count": 0, "uuid": "879df463f735262044e6a10b99c330b998d86f23"}, "author": "", "url": "http://www.zawya.com/story/Saudi_Arabias_Umrah_revenue_touches_SAR12bn-ZAWYA20150721035005/", "ord_in_thread": 0, "title": "Saudi Arabia's Umrah revenue touches SAR12bn", "locations": ["Saudi Arabia", "Taiwan JEDDAH"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Emirates operates first commercial A380 flight to Taiwan JEDDAH -- With the number of pilgrims coming for Umrah increasing annually, economists are estimating the Umrah season revenue for this year may reach SR12 billion. \nThe reasons for the numbers rising are manifold, including increased economic power of Muslims, easy and direct flights globally and the top facilities at the two Holy Harams.Economist Abdulaziz Daghustani said the Kingdom's efforts in facilitating Umrah for Muslims all over the world has attracted more and more pilgrims from all over the world. \n\"According to the Ministry of Foreign Affairs, the highest number of pilgrims reached SR5.8 million. With the low rate of overstayers this year, more and more pilgrims were able to come and the Grand Mosque was not uncontrollably crowded despite the high number of pilgrims,\" said Daghustani. He added the Ministry of Haj is one of the oldest ministries in the Kingdom and its efforts never cease to be essential and extremely effective. \"Pilgrims to Makkah are also tourists to the country. They pay for hospitality and residence and Ramadan pilgrims buy gifts for their families and friends back home. Pilgrims spend a minimum of SR1,500 to SR2,000 on gifts alone,\" he said.\nSaudi Economic Association member Ossam Khalifah said the retail industry and kiosks on the street are constantly raising their prices. \"Pilgrims mostly buy prayer mats, clothes, misbahas and gold due to its quality here. However, most of these products are imported from abroad and some are of poor quality as well,\" said Khalifah. He added a forum on Umrah economics should be held to discuss the best strategies to use Umrah revenues. \"We need to open local factories in Makkah and Madinah to produce local products instead of imported ones for pilgrims to purchase. With the completion of the expansion project next year, an even higher number of pilgrims are expected,\" said Khalifah.\nEconomist Abdullah Al-Maghlouth said we need to focus on opening exhibitions of national products during the Haj and Umrah seasons. \n\"We need to introduce national and local products to pilgrims and the Saudi society. We really need to diversify our local production from just petrol. We also need to have a high standard of quality in the products we import and sell as they reflect the reputation and image of the country,\" said Khalifah. \n© The Saudi Gazette 2015", "external_links": [], "published": "2015-07-21T08:15:00.000+03:00", "crawled": "2015-07-21T11:03:44.521+03:00", "highlightTitle": ""}