{"organizations": [], "uuid": "73c555c28ea284df2ebf51b0c93da5e28db39d6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=81", "section_title": "Travel Trade Gazette - Digital edition", "url": "http://www.ttgdigital.com/home/digital-editions/read-the-july-23-issue-online/4697927.article", "country": "GB", "title": "Read the July 23 issue online", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Read the July 23 issue online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T10:00:00.000+03:00", "replies_count": 0, "uuid": "73c555c28ea284df2ebf51b0c93da5e28db39d6f"}, "author": "", "url": "http://www.ttgdigital.com/home/digital-editions/read-the-july-23-issue-online/4697927.article", "ord_in_thread": 0, "title": "Read the July 23 issue online", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read the July 23 issue online 22 July 2015 \nIn this issue : We explore the lucrative and untapped potential of the LGBT market \nClick the image to read the issue online Pippa Jacks, editor, TTG Clear eyes, full hearts, can’t lose \nWhen we look back at 2015, it will be remembered as a landmark year for gay rights, when the US, Slovenia, Luxembourg, and Greenland became the latest countries to legalise same-sex marriage, while Ireland was the first in the world to legalise it following the popular vote.A wave of greater acceptance is undoubtedly sweeping the world, but as we heard at our first TTG LGBT conference last week, the travel industry must remain conscious there are still 82 countries where your customers could be imprisoned or even executed just for being gay. And even in gay-friendly destinations, poor staff training can still mean an uncomfortable experience for LGBT holidaymakers.One of the main things I learned at the conference was that you don’t need to rush out and rainbow-stripe your website to signal you’re ready to sell to LGBT travellers: it can be as simple as ensuring the community does not feel excluded by the kind of images you use in marketing.I realised TTG Media itself can tend to rely on pictures of white, heterosexual couples in our features, and on stereotypical representations of the LGBT community - and we intend to change that.In this week’s magazine you’ll find eight pages of research, case studies and marketing advice from our hugely successful conference, and I invite you to join us for our second TTG LGBT networking drinks at Kew Gardens on September 3. So let 2015 be a landmark year for your business too: the year you switch on to the needs and opportunities of this lucrative sector. Print power This year has also been a landmark for TTG in another way, since we’ve printed more pages so far this year than at any time since before the recession. We’re taking our usual breather over the quieter summer, printing bi-weekly between July 9 and August 20, but do stay tuned to ttgdigital.com and at social media channels for all the latest news and views. \n﻿Pippa Jacks", "external_links": [], "published": "2015-07-22T10:00:00.000+03:00", "crawled": "2015-07-22T12:02:01.620+03:00", "highlightTitle": ""}