{"organizations": [], "uuid": "9bc2627248d016f12106b60b94fc9130a1efb9d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ortravelexperience.com", "main_image": "", "site_section": "http://ortravelexperience.com/feed/", "section_title": "Oregon Travel Experience", "url": "http://ortravelexperience.com/news-press/the-pendleton-connection/", "country": "US", "title": "The Pendleton connection", "performance_score": 0, "site": "ortravelexperience.com", "participants_count": 1, "title_full": "The Pendleton connection", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T00:06:00.000+03:00", "replies_count": 0, "uuid": "9bc2627248d016f12106b60b94fc9130a1efb9d5"}, "author": "Madeline MacGregor", "url": "http://ortravelexperience.com/news-press/the-pendleton-connection/", "ord_in_thread": 0, "title": "The Pendleton connection", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted on: July 30th, 2015 by Madeline MacGregor in News & Press | No Comments A new historical marker “writes” history \nOn Thursday, August 6, 2015 at 11:00 a.m., the public is invited to attend the dedication of a newly revised and hand-crafted Oregon Historical Marker. The Pendleton Historic Trail marker has been installed at the same site as the original (as SE Court Ave becomes Hwy 30) at the east end of the city. The marker is located in a small pull-off on the right side of the highway on the outskirts of Pendleton. \nThe new cedar board is sponsored by the 2015 Leadership Pendleton Class. During their eight-month course, class participants study Pendleton’s history, education, agriculture, and business—and complete a community project as part of their requirements. \n“Our class was initially interested in beautifying an entrance to town, said Buffy Farber, a Financial Analyst at the Pendleton Branch of Columbia Bank, and Leadership Pendleton Class member and spokesperson. \n“We looked at a few entrances and signs coming into town. We chose the historic trail marker as our project after seeing the extremely poor condition it was in,” Farber said. \n“The leadership class secured donations of wood and other materials, as well as funding for the routing and installation of the new sign,” said Annie von Domitz. \nVon Domitz is the Oregon Historical Marker Program Administrator for Oregon Travel Experience (OTE), the semi-independent state agency responsible for overseeing all 111 of the state’s official historical markers. \n“The original historic trail marker was very old,” von Domitz noted. “Perhaps dating back to the 1950s or 60s—and the cedar was rotting away.” \nVolunteers from across the state participate on OTE’s Oregon Historical Marker Committee. Their work includes vetting marker nominations for accuracy and accessibility, and interacting with local communities who wish to preserve existing markers and create new interpretive or regional historical markers. \n“When our committee heard the leadership class was interested in bringing the old marker back to life, the committee members coordinated a text revision,” said von Domitz. “Marker volunteers worked with the Confederated Tribes of the Umatilla Indian Reservation to ensure that history was accurately portrayed.” \nFarber said the Pendleton team worked with local businesses and organizations to gather financial and in-kind contributions for the project. \n“Kelly Lumber Supply and Les Schwab Tire Center provided us with the lumber, Altrusa International of Pendleton and CHI St. Anthony Hospital contributed funds to cover the routing and other expenses,” said Farber. \nLeadership Pendleton Class member Megan Lauer was excited to see the new marker installed. \n“We want to thank Oregon Travel Experience for being so easy to work with and those organizations who donated towards this project,” said Lauer. \n“This has all come together better than anyone had planned,” added Farber. “We were just in the right position at the right time. It will be nice to see the updated wording in place.” \nBobbie Conner of the Confederated Tribes of the Umatilla Indian Reservation will speak at the new marker dedication, as will Leadership Pendleton class members, local dignitaries, and OTE representatives. \nOTE’s Highway Business Sign staff installed the new marker earlier this week. \nThe new marker text \n“This location marks a travel corridor for Plateau Tribes moving seasonally from the Columbia River to the Blue Mountains. In 1811, members of the Astor Party under the leadership of Wilson Price Hunt camped here on their way west. They traded with the Cayuse people for horses. The Imatalam Wana (Umatilla River) abounded with beaver and salmon then. Oregon Trail migrations began passing this way in 1841. In 1868, the emerging town of Pendleton was named for George Hunt Pendleton, US Senator from Ohio.” \nAbout the sponsoring organizations \nFor more information on the Oregon Historical Marker Program, visit http://ortravelexperience.com/oregon-historical-markers/about-historical-markers/ or contact Annie von Domitz at 1-800-574-9397. \nLeadership Pendleton application information may be obtained by contacting the Pendleton Chamber of Commerce at 541-276-7411. Share this post:", "external_links": [], "published": "2015-07-31T00:06:00.000+03:00", "crawled": "2015-07-31T01:57:42.866+03:00", "highlightTitle": ""}