{"organizations": [], "uuid": "b28082cadb51468f9ee2ad8914ef6d0d847b3a06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "http://blogs-images.forbes.com/paulmonckton/files/2015/07/Moto_X_Style_Champagne_Front_Back.jpg", "site_section": "http://www.forbes.com/travel/", "section_title": "Forbes - Travel Information and Travel News - Forbes.com", "url": "http://www.forbes.com/sites/paulmonckton/2015/07/28/moto-x-pure-edition-beats-both-iphone-6-and-iphone-6-plus-in-respected-benchmark/", "country": "US", "title": "Moto X Pure Edition Beats Both iPhone 6 and iPhone 6 Plus In Respected Benchmark", "performance_score": 2, "site": "forbes.com", "participants_count": 1, "title_full": "Moto X Pure Edition Beats Both iPhone 6 and iPhone 6 Plus In Respected Benchmark - Forbes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T02:10:00.000+03:00", "replies_count": 0, "uuid": "b28082cadb51468f9ee2ad8914ef6d0d847b3a06"}, "author": "Paul Monckton", "url": "http://www.forbes.com/sites/paulmonckton/2015/07/28/moto-x-pure-edition-beats-both-iphone-6-and-iphone-6-plus-in-respected-benchmark/", "ord_in_thread": 0, "title": "Moto X Pure Edition Beats Both iPhone 6 and iPhone 6 Plus In Respected Benchmark", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Moto X Pure Edition (Moto X Style). Image Credit: Motorola\nToday sees the launch of the Moto X Pure Edition (known as the Moto X Style in the UK), the latest flagship smartphone from Motorola. Improving on last year’s Moto X, the new model features a “best in class” 21 megapixel rear-facing camera which, the company boasts, beats the iPhone 6 for quality.\nQuick off the mark, testers over at DxO have already put an early review sample of the camera through their usual rigorous testing regime. With a DxOMark score of 83 points, the Moto X Pure Edition now ranks second place behind top scorer the Samsung Galaxy S6 Edge in terms of overall quality, putting it just ahead of the Sony Sony Xperia Z3 Plus and both of Apple Apple ’s iPhone 6 (note that the LG G4 hasn’t been tested yet).\nPerformance breakdown\nBut the overall DxOMark score alone doesn’t tell the full story, first breaking the results down into photo and video categories with seven sub-tests within each category, the report reveals distinct strengths and weaknesses in a number of areas.\nPhoto performance\nHere the Moto X Pure Edition loses out, if only by a single point, to Apple’s iPhone 6 Plus phablet. Here we an example of a 21 megapixel device being outgunned by an 8 megapixel rival, but this particular result has nothing at all to do with resolution. Instead it’s the flash performance in this case which lets the Moto X Pure Edition down. Compared to the Galaxy S6 Edge and iPhone 6 Plus, DxO noted overexposure, imaging noise (or grain) and some unwanted colour tints in the corners of the image. This is a prime example of why it’s important to look at the performance of any camera in a range of shooting situations- If you hardly use flash, the Moto X Pure Edition suddenly looks much better against the competition.\nVideo performance\nThe tables are turned, however, when it comes to video performance, with the Moto X Pure Edition coming out four points ahead of the iPhone 6 Plus and just a single point behind the Samsung Galaxy S6 Edge at the top of the chart. Why? Not because of overall superior quality, but because the Moto X Pure Edition outshone the competition in the image stabilisation test where the Galaxy S6 Edge and iPhone 6 Plus proved weakest. It also excelled at exposure and contrast, where the iPhone 6 Plus fell behind both the Motorola and Samsung cameras. Weakest points for the Moto X Pure Editon proved to be autofocus where “some slow focus adjustments and occasional overshooting was observed in low light levels”. It also proved to be more susceptible to image noise, often the bugbear of high-megapixel sensors.\nREAD MORE -$329 OnePlus 2 Outguns Galaxy S6 and iPhone 6 Cameras\nPage 1 / 2 Continue", "external_links": ["http://www.dxomark.com/Mobiles/Moto-X-Style-Mobile-review-Style-and-Substance"], "published": "2015-07-29T02:10:00.000+03:00", "crawled": "2015-07-29T01:38:26.504+03:00", "highlightTitle": ""}