{"organizations": [], "uuid": "01f025b934098f02dbec91ba4c8a7a5ab9b6852a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61977/help-nepal-etihad-airways-employees-get-it", "country": "US", "title": "Help Nepal: Etihad Airways employees get it", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Help Nepal: Etihad Airways employees get it", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T11:59:00.000+03:00", "replies_count": 0, "uuid": "01f025b934098f02dbec91ba4c8a7a5ab9b6852a"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61977/help-nepal-etihad-airways-employees-get-it", "ord_in_thread": 0, "title": "Help Nepal: Etihad Airways employees get it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Help Nepal: Etihad Airways employees get it Adv: \nJul 29, 2015 Adv: \nEtihad Airways’ employees have raised almost AED 270,000 (7.5 million Nepalese Rupees) through a company-wide campaign to help earthquake survivors re-build their lives and communities in Nepal. \nThe airline’s employees volunteered and ran a ‘bake and aid’ sale, organised a sport tournament, a raffle competition, and other events across the organisation to raise awareness, funds and support since the tragedy occurred in May 2015. \nA donation scheme was also set-up with the National Bank of Abu Dhabi to collect financial contributions from employees for the ‘Prime Minister’s Relief Fund,’ under the leadership of Sushil Koirala, the Prime Minister of Nepal. \nRay Gammell, Etihad Airways’ Chief People and Performance Officer, said: “Volunteering and giving back to our community, as well as to the communities in which we operate is part of Etihad Airways’ culture. We are proud that year after year, our people have generously provided their time and resources and donated financially to such important causes.” \nIn addition to the efforts of Etihad Airways’ employees, the disaster response initiative also included the provision of food, water, clothing, tents, medical kits and other items, delivered through the UAE Red Crescent to Kathmandu and surrounding areas. \nThe airline flew over 52 emergency relief workers and items from the US, Europe, and Australia to Kathmandu through Airlink, a global agency which coordinates airline partners to provide support in emergency situations and provided over 5,000 blankets. \nTo date, 10,000kg of excess baggage for relief items has been provided on special request free-of-charge to passengers who are travelling to Nepal. \nEtihad Guest, Etihad Airways’ award-winning loyalty program, also established a dedicated page on the donations section of its Etihad Guest Reward Shop website and invited its members around the world to support the cause by contributing their miles. As a result, over 30 million miles were donated by Etihad Guest members. \n“As individuals, and as an airline, we will continue making a difference where we can, and our thoughts remain with everyone affected by the earthquake. Our more than 600 Nepalese colleagues and their families are a key priority and being by their side is crucial at this time,” said Mr Gammell. \nEtihad Airways is continuing its efforts in partnering up with organisations in Nepal to support move displaced communities with essential items, ranging from tents to permanent housing.", "external_links": [], "published": "2015-07-29T11:59:00.000+03:00", "crawled": "2015-07-29T22:30:56.016+03:00", "highlightTitle": ""}