{"organizations": ["GBTA", "Global Business Travel Association", "TravelClick's Hotel Industry Outlook", "Dinova LLC"], "uuid": "c4e1bb709ab83378d27fd3aef55843005481c015", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_9_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13231559/1/dinova-corporations-spending-more-at-restaurants.html?cm_ven=RSSFeed", "country": "US", "title": "Dinova: Corporations Spending More At Restaurants", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Dinova: Corporations Spending More At Restaurants", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T20:00:00.000+03:00", "replies_count": 0, "uuid": "c4e1bb709ab83378d27fd3aef55843005481c015"}, "author": "", "url": "http://www.thestreet.com/story/13231559/1/dinova-corporations-spending-more-at-restaurants.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Dinova: Corporations Spending More At Restaurants", "locations": ["America", "U.S.", "Dinova", "ATLANTA", "Orlando"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dinova", "Michael McCormick", "Vic Macchio"], "text": "Reprint ATLANTA , July 26, 2015 /PRNewswire/ -- Dinova LLC reported today that overall restaurant spending by its corporate clients grew 3.3 percent year-over-year in the second quarter of 2015, enhancing restaurant revenue and traffic across the U.S. Dinova's corporate clients recorded 4.1 percent more dining transactions in the second quarter, a positive figure that helped counteract negative overall traffic trends. According to TDn2K's Black Box Intelligence Report, overall transient restaurant traffic dropped 1.7 percent in the second quarter. Dinova's clients, which include more than one-third of America's highest-travel-spending companies , spend $3 billion on catering and dining annually. So far this year, Dinova has added more than 40 large corporations and hundreds of smaller companies - which cumulatively spend more than $500 million on dining every year - to its client roster. Dinova's nationwide restaurant network includes more than 12,000 independent and chain restaurants, encompassing all price levels and cuisines. GBTA Revisions, Hotel Reports Foreshadow Positive Corporate Dining Traffic New projections shared by the Global Business Travel Association (GBTA) Foundation support this trend identified by Dinova's statistical analysis of sales reports. Revised GBTA data projects overall U.S. corporate travel expenditures to jump nearly five percent over 2014 totals, surpassing $300 billion. Looking farther ahead, GBTA anticipates 2016 corporate spend increasing 5.4 percent to $319 billion . Restaurant owners should also be enthused by GBTA's revised corporate group travel outlook, which sees group trip volume growing nearly one percent this year and leaping more than three percent in 2016. \"Economic fundamentals remain strong,\" said GBTA executive director Michael McCormick . \"Business travel will continue to have positive momentum as we move toward 2016.\"On the lodging front, TravelClick's Hotel Industry Outlook shows that advance hotel bookings for the year ahead are up more than three percent , even with average rates up nearly five percent. \"All the indicators regarding business dining and catering are positive for restaurants, particularly those that are engaged with Dinova clients,\" said Vic Macchio, founder and CEO of Dinova . \"What's more, corporations are steering their travelers and the admins that book private dining towards Dinova network restaurants at a greater rate than ever. So far this year, dining by Dinova clients at Dinova network restaurants is up 10 percent, demonstrating the effectiveness of the Dinova program for corporations and restaurants alike.\"By shifting more spending to preferred suppliers - including Dinova network restaurants - companies gain more value from the employee travel expenses they incur. Dinova's corporate clients get a monthly rebate on their dining spend at Dinova network restaurants. Dinova will showcase its network to more than seven thousand corporate travel industry professionals at the annual GBTA conference in Orlando on July 26-29 at booth number 565. ABOUT DINOVA:", "external_links": [], "published": "2015-07-26T20:00:00.000+03:00", "crawled": "2015-07-26T21:15:44.354+03:00", "highlightTitle": ""}