{"organizations": [], "uuid": "121934cdfcb75f836fec6adb163e77b7008f4227", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02498/cameron-EU_2498127k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/uknews/crime/11766496/Foreigners-who-launder-dirty-money-in-UK-to-be-named-and-shamed.html", "country": "US", "title": "Foreigners who launder 'dirty money' in UK to be named and shamed", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Foreigners who launder 'dirty money' in UK to be named and shamed - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T08:01:00.000+03:00", "replies_count": 0, "uuid": "121934cdfcb75f836fec6adb163e77b7008f4227"}, "author": "Matthew Holehouse , in Jakarta", "url": "http://www.telegraph.co.uk/news/uknews/crime/11766496/Foreigners-who-launder-dirty-money-in-UK-to-be-named-and-shamed.html", "ord_in_thread": 0, "title": "Foreigners who launder 'dirty money' in UK to be named and shamed", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Corrupt foreigners who launder their \"dirty money\" by buying properties in Britain will have their names published as part of a new crackdown, David Cameron is expected to say on Tuesday. The Prime Minister will vow to strike “the biggest blow in a generation” against the “cancer” of corruption by seeking to publish the ultimate owners of secretive foreign companies used to buy property in Britain. Purchasing high-value mansions in London with anonymised offshore accounts is regarded as an easy way for foreign criminals and corrupt foreign leaders to “clean” large sums of money in a single transaction. The National Crime Agency has warned that the trend is pushing up house prices in the capital by pushing wealthy buyers down the chain in a \"ripple effect\". Speaking in Singapore, Mr Cameron will say: \"The UK must not become a safe haven for corrupt money from around the world. \"I want Britain to be the most open country in the world for investment. But I want to ensure that all this money is clean money. There is no place for dirty money in Britain. Indeed, there should no place for dirty money anywhere. \"Together I believe we can defeat the cancer of corruption in all its forms and with it, strike the biggest blow for our generation in the struggle to ensure greater prosperity in every part of the world.\" The National Crime Agency has warned that the trend is pushing up house prices in the capital Under measures to be introduced this autumn, the Land Registry will release a public database listing properties owned in Britain by foreign companies. Downing Street is also exploring plans to identify the true owners of foreign \"shell\" companies which are often used to buy properties anonymously. There are already plans to launch a register listing the ultimate owners of UK-registered companies, in a bid to cut through the secrecy that aids tax evasion. The release of millions of pieces of data related to foreign property ownership will help deter corrupt foreign leaders from using London to launder their gains. It will allow police and charities “follow the money” and “shine a light” on potential corruption, UK government sources said. The Prime Minister will warn that properties in Britain \"are being bought by people overseas through anonymous shell companies, some with plundered or laundered cash.\" Mr Cameron will single out the case of a former Kazakh secret police chief linked to a £150 million property empire in London. He will also name James Ibori, the former governor of Nigeria’s Delta State who was jailed for 13 years for fraud and was linked to property in St John’s Wood and Hampstead. The speech comes days before Mr Cameron meets Najib Razak, the Malaysian Prime Minister who is facing demands to resign over allegations of political corruption. Mr Najib has denied he had received almost $700 million dollars from a troubled development fund into his personal bank account. But Mr Cameron will say today that the international community has “looked the other way for far too long” against corruption, “one of the greatest enemies of progress in our time.” “We simply cannot afford to side-step this issue or make excuses for corruption any more. We need to step up and tackle it.\" The migration of hundreds of thousands of people from Africa to Europe is being driven by corruption that prevents people from finding good jobs, Mr Cameron will say. telegraph.co.uk Follow @telegraphnews", "external_links": [], "published": "2015-07-28T08:01:00.000+03:00", "crawled": "2015-07-28T06:07:26.201+03:00", "highlightTitle": ""}