{"organizations": [], "uuid": "b3b5ed569cadf8d154ef7c9103917d70db5ac436", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/Australia-tourism.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/australia-calls-tourism-projects-reverse-decline-visitor-numbers-ayers-rock/", "country": "US", "title": "Australia calls for tourism projects to reverse decline in visitor numbers to Ayers RockTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Australia calls for tourism projects to reverse decline in visitor numbers to Ayers RockTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "b3b5ed569cadf8d154ef7c9103917d70db5ac436"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/australia-calls-tourism-projects-reverse-decline-visitor-numbers-ayers-rock/", "ord_in_thread": 0, "title": "Australia calls for tourism projects to reverse decline in visitor numbers to Ayers RockTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia calls for tourism projects to reverse decline in visitor numbers to Ayers Rock\nAustralia’s government and the Uluru’s traditional owners are calling for investors, especially international investors, to propose tourism projects around the iconic sandstone rock to reverse declines in visitor numbers.\nVisitor numbers have fallen by 20 percent to Uluru, also known as Ayers Rock, in the 10 years to 2014, primarily due to the drop of global tourism due to the GFC, the Australian government said.\nNational Parks Director Sally Barnes told Australia’s national broadcaster on Friday that there was nothing they would rule in or out.\n“It could be people who want to do day trips, it could be people who are interested in accommodation, it could be people who want to have food or beverage,” Barnes said.\n“But obviously, we’re here in a world heritage area so we’ve got to make sure things come through the door that are appropriate in terms of sustainability and culturally in sync with the wishes of the traditional owners.”\nHowever, the Australian government’s proposal is misguided and focus should not be solely on Uluru, local tourism operator Linda Wells said.\n“A great deal of emphasis needs to be put on encouraging tourism and encouraging visitors to come right through to Alice Springs and Tennant Creek and all the regional centers,” Wells said. “Central Australia, and visiting Central Australia, is way more than about visiting Uluru.”\nWells also said enticing overseas investors would not help Australian tourism operators while they are struggling.\n“I think that it’s best provided by Australians and by people who know the country and have the country in their hearts,” Wells said.\nRelated Posts Antalya Gazipasa Airport opens new terminal building Egypt’s tour guides’ new business: Producing opium Utah lost $33 million in tourism due to shutdown ‘Earn While you Learn’ Programme – India New VisitScotland data reveals regional visitor trends for 2012", "external_links": [], "published": "2015-07-12T03:00:00.000+03:00", "crawled": "2015-07-12T23:48:35.000+03:00", "highlightTitle": ""}