{"organizations": [], "uuid": "8325215b963827acb55e1864e109a9be8f56fa19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150727NYMag-450x600.jpg", "site_section": "http://www.ticotimes.net/categories/bill-cosby-rape-allegations", "section_title": "Bill Cosby rape allegations Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/27/35-bill-cosby-accusers-on-new-york-magazines-cover", "country": "US", "title": "35 Bill Cosby accusers on New York magazine's cover", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "35 Bill Cosby accusers on New York magazine's cover -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T01:24:00.000+03:00", "replies_count": 0, "uuid": "8325215b963827acb55e1864e109a9be8f56fa19"}, "author": "Justin Wm. Moyer | The Washington Post", "url": "http://www.ticotimes.net/2015/07/27/35-bill-cosby-accusers-on-new-york-magazines-cover", "ord_in_thread": 0, "title": "35 Bill Cosby accusers on New York magazine's cover", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For a cover story this week, New York magazine interviewed and photographed 35 of Cosby’s alleged victims, supplementing the story with video interviews with six.\n(Via New York magazine Facebook)\nIn the years since women first said Bill Cosby drugged and sexually assaulted them and the months since the media started paying attention, it’s been difficult to keep track of the comedian’s alleged victims. Many publications — including The Washington Post — have reported dozens of versions of the same story: A young woman, often an aspiring actress, is violated by a man who thinks himself a mentor.\nAfter a few weeks, unfortunately, it became difficult to tell such stories apart. Was it P.J. Masten who said Cosby drugged and raped her in a Chicago hotel, or was that Lise-Lotte Lublin?\nNew York magazine may have ended the relative anonymity of many Cosby accusers for good. For a cover story this week, New York interviewed and photographed 35 of Cosby’s alleged victims, supplementing the story with video interviews with six.\n“The group of women Cosby allegedly assaulted functions almost as a longitudinal study — both for how an individual woman, on her own, deals with such trauma over the decades and for how the culture at large has grappled with rape over the same time period,” the magazine wrote. “In the ’60s, when the first alleged assault by Cosby occurred, rape was considered to be something violent committed by a stranger . . . But among younger women, and particularly online, there is a strong sense now that speaking up is the only thing to do, that a woman claiming her own victimhood is more powerful than any other weapon in the fight against rape.”\nThe stories here aren’t necessarily new.\n“In the early 1990s, in my mid-20s, Bill Cosby mentored me,” Lili Bernard, who went public in a news conference in May, said in a New York video. “He gained my total trust and then he drugged me without my knowledge. He raped me. I wouldn’t call him crazy . . . I felt that he was very much in control of his behavior.”\nThe images and videos, however, leave quite an impression.\nThe New York story comes at the end of a particularly bad month for Cosby. The comedian has denied all sexual assault allegations and has not been charged with a crime, but acknowledged in a 2005 court deposition made public three weeks ago that he intended to give quaaludes to young women with whom he wanted to have sex.\nIn the deposition, Cosby put himself forward as quite the Lothario.\n“I’m a pretty decent reader of people and their emotions in these romantic sexual things, whatever you want to call them,” he testified.\nOne notable absence from the pages of New York: Andrea Constand, the former college basketball player and Temple University administrator who claimed Cosby drugged and raped her in his Pennsylvania home. (Constand, who signed a confidentiality agreement, has since sought full release of Cosby’s deposition.)\nConstand’s civil suit against the comedian led to the deposition — and testimony so damning that Spelman College, a historically black women’s school in Atlanta that maintained its relationship with the comedian long after Temple cut ties with him, said goodbye.\n“The William and Camille Olivia Hanks Cosby Endowed Professorship at Spelman College has been discontinued,” the school’s communications office said in a brief statement Saturday, as CNN reported.\nThe foundation was established by Cosby’s wife, Camille, to honor her mother, as the Atlanta Journal Constitution reported; two of his daughters attended the school, where exteriors for “A Different World,” a “Cosby Show” spin-off, were filmed.\n© 2015 , The Washington Post", "external_links": [], "published": "2015-07-28T01:24:00.000+03:00", "crawled": "2015-07-28T14:03:50.875+03:00", "highlightTitle": ""}