{"organizations": [], "uuid": "f84efeabe70964fd54fc54f02019aff1320fe37c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/life/travel/delta-air-lines-is-changing-its-loyalty-program/", "country": "EU", "title": "Delta Air Lines is changing its loyalty program", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Delta Air Lines is changing its loyalty program | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T18:23:00.000+03:00", "replies_count": 0, "uuid": "f84efeabe70964fd54fc54f02019aff1320fe37c"}, "author": "Hugo Martin", "url": "http://www.seattletimes.com/life/travel/delta-air-lines-is-changing-its-loyalty-program/", "ord_in_thread": 0, "title": "Delta Air Lines is changing its loyalty program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you are saving up reward miles to pay for a trip on Delta Air Lines, you might want to book the trip before the airline switches to a new format that could raise the number of miles you need for the most popular destinations.\nFor travel on or after June 1, 2016, Delta said the number of miles needed to book a flight may rise based on destination, demand and “other considerations.”\nBut don’t expect the airline to disclose the exact reasons why fares will vary from day to day.\nSouthwest Airlines adopted similar changes to its reward program, taking effect last April.\nMost Read Stories Mariners’ triple play hadn’t been seen since 1955 Seattle police officer faces firing over arrest of man carrying golf club 5 things you should know about Microsoft’s Windows 10 Before getting the ax, Steve Sandmeyer show was scraping by Seattle’s Panama Hotel deemed a National Treasure The move — the latest by airlines to reduce the value of reward points — is sure to frustrate travelers, who are already relying less and less on loyalty reward programs to pay for airline tickets.\n“What’s disturbing about this is the complete lack of transparency,” said Tim Winship, publisher of the rewards program monitoring website Frequentflier.com. “Nobody knows what these other variables might be.”\nSeveral recent surveys have shown that confusing rules and stipulations hidden in tiny print are among the biggest frustrations travelers have with loyalty programs.\nThat may explain why a 2013 survey by Deloitte found that travelers ranked the importance of loyalty reward programs 19th among an airline’s best attributes, behind comfort, staff attitude and check-in convenience.\nDelta spokesman Anthony Black defended the reward program, noting that many flights won’t rise in cost because of next year’s changes.\nHe added that the airline also recently launched a flight sale that lets travelers use a combination of reward miles and cash to fly to many destinations within the contiguous 48 states.\nOther airlines may consider converting to Delta’s new system but not until they see if the changes are a success, said Brian Karimzad, director of the reward monitoring website MileCards.com.\n“I think other airlines are going to sit back and take a look,” he said.\nExpect more add-on fees from airlines Charges for checked bags, entertainment, food and seats with extra legroom, among other extras, generated $38.1 billion for the world’s airlines in 2014, a 21 percent increase from the previous year, according to a report from IdeaWorks, a Wisconsin-based airline consulting firm.\nBut you can expect such revenue to continue to soar as airlines consider adopting even more fees.\nHow about a fee that ensures your bag is delivered at the baggage carousel before all the others?\nOr a charge to let you be the first to exit your plane?\nHow about a charge to put a radio frequency identification tag on your luggage so you can track its location in real time from your smartphone?\nThese were among the extras that at least 60 percent of travelers said they were willing to pay for, according to a survey of 2,339 business and leisure travelers by Flightview, a Boston-based flight information firm. An even higher rate of millennials, 75 percent, said they were willing to pay such fees.\nAmong other fees travelers would be willing to pay, according to the survey, are flight status alerts that are automatically sent to family, employers, hotels and others; a smartphone app to let you pre-order food and drinks at airport eateries; in-seat charging stations for mobile devices; and a rental car service to pick you up at the terminal curb.\nSome airlines already offer a few of these services, and others may be ready to adopt them in the future, said Flightview spokeswoman Katherine Wellman.\n“We just wanted to pass along to airlines what people really want,” she said of the survey.\nHugo Martin", "external_links": [], "published": "2015-07-27T18:23:00.000+03:00", "crawled": "2015-07-28T14:26:44.150+03:00", "highlightTitle": ""}