{"organizations": [], "uuid": "3e114236fff8fa6bbd86e28edeedcd718179b868", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/27667-redfern-strengthens-with-private-sector-wins", "country": "US", "title": "Redfern strengthens with private sector wins", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Redfern strengthens with private sector wins", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T17:15:00.000+03:00", "replies_count": 0, "uuid": "3e114236fff8fa6bbd86e28edeedcd718179b868"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/27667-redfern-strengthens-with-private-sector-wins", "ord_in_thread": 0, "title": "Redfern strengthens with private sector wins", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Redfern strengthens with private sector wins Redfern strengthens with private sector wins Details Category: Agency & Association   15:15 Redfern, the UK’s fastest growing travel management company, has added another two big name clients to its roster. Insurance company Hastings Direct and rapidly growing product development company Tharsus have both appointed Redfern to manage business travel. \nThe addition of Hastings Direct increases Redfern’s financial services client base, expanding on its recent Skipton Building Society win. Tharsus expands its engineering base. The client wins follow recent gains in the charities and retail sector also. Across the board, clients have been looking for efficiency and savings driven by automation through Redfern’s unique online management tool tRIPS. Daniel Phillips, Head of Sales at Redfern, said: “Corporate travel is growing in strength again after the recession, when costs were cut across all sectors. In the past few years Redfern has innovated and invested in technology at the front end. “As a result our customers are benefitting from state of the art technology and the whole booking process is incredibly efficient. “Large corporates are recognising how Redfern’s technology can support policy compliance, provide one-stop-shop functionality, and can help staff buy and track travel in a smarter way whilst providing cost savings.” Redfern is the fastest growing travel management company in the UK and the nominated supplier of UK travel management to the government. Earlier this year, the company was named in the Sunday Times Virgin Fast Track 100 which ranks Britain’s 100 fastest growing businesses. Related articles", "external_links": [], "published": "2015-07-10T17:15:00.000+03:00", "crawled": "2015-07-10T17:31:55.000+03:00", "highlightTitle": ""}