{"organizations": ["Bloomberg"], "uuid": "69b8c2843dd1afe28650a71dc00667e285725090", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/60c3c8ad-7bef-45dd-bccb-20f2b237b1dd.img", "site_section": "http://www.ft.com/rss/companies/travel-leisure", "section_title": "Travel & Leisure", "url": "http://www.ft.com/cms/s/0/17b6bca0-1c22-11e5-8201-cbdb03d71480.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "country": "US", "title": "Surf’s up for cruise ship orders", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Surf’s up for cruise ship orders", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T19:26:00.000+03:00", "replies_count": 0, "uuid": "69b8c2843dd1afe28650a71dc00667e285725090"}, "author": "", "url": "http://www.ft.com/cms/s/0/17b6bca0-1c22-11e5-8201-cbdb03d71480.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Surf’s up for cruise ship orders", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malcolm Moore", "Stephen Wilmot"], "text": "Surf’s up for cruise ships after new vessel orders hit record Stephen Wilmot and Malcolm Moore ©Bloomberg \nShipyards around the world are humming again, with the pipeline of new cruise ships due to reach a record of 45 by the end of the year. A boom in the cruise industry, which is expecting 23m passengers in 2015, has seen companies line up to place orders for new ships. \nVirgin Cruises, the latest venture by Richard Branson’s Virgin Group, which has backing from private equity group Bain Capital, has pledged to order three new ships from Fincantieri. Carnival , the world’s largest cruise operator, has signed a deal with Meyer Werft, the 221-year-old German shipbuilder, for four of the largest ships ever built, with 6,600 berths each. More Greene King sales growth slows \nCarnival is in talks with Fincantieri for a further five ships, with orders due to be confirmed by the end of the year. \n“We’re making up for lost time,” says David Dingle, chairman of Carnival UK. Rivals such as Royal Caribbean have ordered and begun to deploy new ships to service China and the growing market in Asia. \nAt least 17 ships are due to be ordered this year, up from just one in 2009, when the financial crisis put the industry’s expansion plans on hold. The boom is confirmation that cruising has recovered from the Costa Concordia disaster of 2012, when the Italian cruise ship capsized. \nLenders, which typically finance 80 per cent of any new ship, are more confident about underwriting the billions of dollars needed. The strong dollar is also making the twin European shipbuilding giants of Fincantieri and Meyer Werft more attractive for US operators. Lower oil prices , which account for 20-30 per cent of the cost of running a cruise ship, have saved operators money. \nDemand for cruises is rising again. Passenger numbers rose 3.7 per cent in 2014, according to the Cruise Lines International Association, after 2 per cent increases in 2012 and 2013. \nThe rise of the Asian market and new technology elsewhere in the hospitality industry has forced operators to upgrade their cruise ships. Royal Caribbean has sent its latest ship, Quantum of the Seas, to be permanently berthed in Shanghai. \nThe new ship has 80cm LED screens in its inside cabins, which act as virtual windows, showing a live picture of the sea outside, and even a dedicated satellite providing high-speed broadband internet to everybody on board — the first for a cruise ship. \n“Slow internet was a pain point for customers because there are very few people who can disconnect,” says Adam Goldstein, chief operating officer. “Now guests can do anything they want, including video streaming.” \nThe new ships also have scrubbers to reduce sulphur dioxide emissions, produce zero landfill waste, and even pass tiny bubbles over their hulls to reduce drag in the water and save on fuel. \n3.7% \nRise in cruise passenger numbers in 2014, according to Cruise Lines International Association \nThe new Carnival ships will be the first in the world to be powered at sea by liquefied natural gas. \nThe rebound marks a turnround for an industry whose growth profile has been disfigured by largely self-inflicted crises. \nThe Costa Concordia, which foundered off the coast of Tuscany in 2012 causing the death of 32 people, cost Carnival about $500m in operating profits relative to prior expectations. \n“With the Costa business we’re just coming back to recovery now,” says Mr Dingle. \nA 2013 engine room fire on Carnival Triumph , a ship in another Carnival fleet, prompted further negative publicity after an escape of raw sewage sparked headlines about a “poop cruise”. \nAfter two years of decline Carnival’s cruise prices are showing signs of recovery. First-half results last week recorded a 3.1 per cent growth in the group’s key pricing metric, though the gain was wiped out in dollar terms by the weak euro. Cruise operators get hip with ‘voluntourism’ \nWhen Virgin Cruises launches in 2020 it will be based in Miami, home to the cruising industry’s target market of affluent North Americans. \nBut as the luxury travel sector grows it hopes to attract a more diverse audience. \n“We want our cruises to be cool, hip and young at heart,” says Tom McAlpin, chief executive of Virgin Cruises. “The market for the modern cruise is underserved.” \nEstablished cruise liners are busy courting a geographically new consumer: China. \nIn 2017, Carnival will take delivery of what chairman David Dingle says is the first cruise ship specifically designed for Chinese consumers. \nThe interior is being configured according to local tastes. “They’re less interested in the traditional Western bar experience and they don’t indulge in spas nearly as much,” he says. \nInstead, the ships will feature more retail and gambling. Sun-bathing is also less popular in China, which has prompted a redesign of the open deck area. \nThe company is hoping to profit from the global rise of “voluntourism” with the launch of “fathom”, a consumer brand designed to attract philanthropically minded tourists. \nThe first fathom cruise is scheduled to leave Miami in April 2016, heading for the Dominican Republic. \n“The idea is to take people who want to do some kind of community work. It gives them an amazing opportunity to get under the skin of the country they’re visiting. Hopefully we’re going to put this kind of holiday on the map,” says Mr Dingle. \nAfter the problems caused by Costa Concordia and Carnival Triumph, public relations will also play a role in the initiative. He says: “It’s good reputationally.” Related Topics Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-07-03T19:26:00.000+03:00", "crawled": "2015-07-03T21:57:18.000+03:00", "highlightTitle": ""}