{"organizations": [], "uuid": "45466222e4b12642041c4f41e5fc34f21b8cf986", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/20150708/c1_616076_150708050458_620x413.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/616076/trial-for-koh-tao-killings-starts-july-8", "country": "TH", "title": "Trial for Koh Tao killings starts Wednesday", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Trial for Koh Tao killings starts Wednesday", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T23:29:00.000+03:00", "replies_count": 0, "uuid": "45466222e4b12642041c4f41e5fc34f21b8cf986"}, "author": "", "url": "http://www.bangkokpost.com/travel/tourists-and-expats/616076/trial-for-koh-tao-killings-starts-july-8", "ord_in_thread": 0, "title": "Trial for Koh Tao killings starts Wednesday", "locations": ["Myanmar", "Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Koh Tao"], "text": "Myanmar farmers dream of resurrecting Asia's rice bowl Surat Thani — Two Myanmar migrants accused of murdering two Britons 10 months ago on the tourist island of Koh Tao will stand trial Wednesday. \nThe legal team for Zaw Lin and Win Zaw Htun said it is keen to hear how the prosecutor intends bringing forth witnesses and evidence in the case concerning the rape and murders of the tourists. \nThe Myanmar suspects are accused of brutally murdering British backpackers David Miller, 24, and Hannah Witheridge, 23, on the resort island in the early hours of Sept 15 last year. \nNakhon Chompuchat, chief of the defendants' lawyers, said it was a complex and difficult case as contentious issues such as allegations that the police tortured the defendants and the credibility of some evidence were still outstanding. \nThe defence team could not secure key witnesses from Koh Tao to testify to help free the migrants. \nWitnesses from Koh Tao who knew the defendants and could give explanations of events that would help free them from the lawsuits refused to testify in the court. \n\"It's a pity but it's understandable that they don't dare to stand in the court for their own safety and the security of their work there,\" said the chief lawyer. \nThe parents of the British victims are due to attend the start of the trial on Wednesday, court officials said. \nHowever, the defendants' families will not be able to offer their support at the court this week as travel difficulties deterred them from coming, the lawyer added. \n\"We are convinced our clients were tortured to confess to the murders, and if the government grasps the issue and brings some clarity to it, it will lend credibility to the government. But if the court eventually finds that they were tortured, the credibility of the government will be damaged,\" said Mr Nakhon. \nThe Lawyers' Council of Thailand received complaints about the alleged torture and sent a legal team to help. The Myanmar embassy has also requested the LCT's help in the case. \nAbout a dozen witnesses from both the prosecution and defence will testify to the court during the trial, which is expected to last three months.   4 people liked / 61  ", "external_links": [], "published": "2015-07-07T23:29:00.000+03:00", "crawled": "2015-07-08T14:13:02.000+03:00", "highlightTitle": ""}