{"organizations": [], "uuid": "94f59ba0dce2d562f74e092c3c59b569ae266d54", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/27980-meet-taiwan-embarks-on-roadshows-in-major-southeast-asian-cities-to-strengthen-mice-presence", "country": "US", "title": "MEET TAIWAN embarks on roadshows in major Southeast Asian cities to strengthen MICE presence", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "MEET TAIWAN embarks on roadshows in major Southeast Asian cities to strengthen MICE presence", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T18:15:00.000+03:00", "replies_count": 0, "uuid": "94f59ba0dce2d562f74e092c3c59b569ae266d54"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/27980-meet-taiwan-embarks-on-roadshows-in-major-southeast-asian-cities-to-strengthen-mice-presence", "ord_in_thread": 0, "title": "MEET TAIWAN embarks on roadshows in major Southeast Asian cities to strengthen MICE presence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MEET TAIWAN embarks on roadshows in major Southeast Asian cities to strengthen MICE presence MEET TAIWAN embarks on roadshows in major Southeast Asian cities to strengthen MICE presence Details Category: Venues & Events   16:15 Thailand, Malaysia and Singapore are amongst the countries in Asia to deliver the highest number of inbound tourists to Taiwan. As such, MEET TAIWAN will launch a series of Southeast Asian roadshows in Bangkok, Thailand (27 July), Kuala Lumpur, Malaysia (29 July) and Singapore (31 July) with the purpose of raising their level of engagement, support and networks with MICE planners, buyers and business elites in these key cities. \nFollowing the success of similar roadshows last year, MEET TAIWAN will once again partner TTG Events to organise the local editions in Bangkok and Singapore. The roadshows which feature Taiwan’s MICE delegates, including ABLY Conference and Exhibition Co., China Airlines, Kuching Travel Service (Taiwan), MSL Group and Taiwan Tour Travel, aim to inspire attendees to choose Taiwan for their next MICE event. From presentations to table-top showcases, lucky draws and networking activities that facilitate business discussions, MEET TAIWAN believes the roadshow programme will effectively convey Taiwan’s appeal as a MICE destination. Lily Su, Deputy Executive Director of MEET TAIWAN said, “We are eager to share about Taiwan’s myriad of cultural experiences, gastronomic delicacies, natural scenic locations, as well as its modern convention and exhibition venues, accommodation choices and strong infrastructure facilities and resources. The multitude and diversity of options that Taiwan offers makes it easy to create programmes and packages for a variety of MICE agendas. Taiwan offers unlimited advantages for both buyers and sellers looking for innovation, value and fully integrated supply chain networks. There is certainly something for everyone!” MEET TAIWAN will also be leveraging on these roadshows to promote the second edition of its “Asia Super Team” contest, a multi-national incentive campaign aimed at positioning Taiwan as the top-of-mind destination for MICE in Asia. Sponsored by Taiwan Bureau of Foreign Trade and implemented by Taiwan External Trade Development Council (TAITRA), the 2015 campaign will reach participants in Australia, Japan, Malaysia, Singapore, South Korea, and Thailand. Related articles", "external_links": [], "published": "2015-07-30T18:15:00.000+03:00", "crawled": "2015-07-30T19:03:57.928+03:00", "highlightTitle": ""}