{"organizations": [], "uuid": "aeb8c83903c9d33999f25f4656058a3378b8d3c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61025/only-city-world-have-wildlife-park", "country": "US", "title": "The only city in the world to have a wildlife park", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "The only city in the world to have a wildlife park", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T23:16:00.000+03:00", "replies_count": 0, "uuid": "aeb8c83903c9d33999f25f4656058a3378b8d3c9"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61025/only-city-world-have-wildlife-park", "ord_in_thread": 0, "title": "The only city in the world to have a wildlife park", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE LIST: 5 Star Rated by eTN Readers - and not for sale! Hotels - Airlines - CVBs - Destinations - people The only city in the world to have a wildlife park Adv: \nBy Apolinari Tairo, eTN Tanzania Correspondent | Jul 03, 2015 Adv: \nTANZANIA (eTN) - Selected to host the 40th Africa Travel Association (ATA) World Congress November this year, Nairobi, the Kenyan capital city, has been rated the only city in the world boasting of a wildlife park. Nairobi, which is counted as the most beautiful and a leading business metropolis in East and Central Africa, is rated a tourist-friendly city by its nightlife, cool weather, accommodation services, regional and global gatherings, as well as a hub for regional tourism. \nNairobi prides itself on hosting the regional headquarters of multinational companies, and of being the powerhouse driving the East Africa economy. According to a Kenyan newspaper, the Daily Nation, Nairobi has been counted as the only city in the world that boasts a game park. It quoted a publication painting a rosy picture of the city’s night life and mysteries, which all in all, make it a tourist-friendly metropolis and worth to visit. \nThe publication mentioned the city to have many more mysteries, but, most attractive is the Nairobi National Park which is located just a 10-minute drive from the metropolis, and is home to a variety of wild animals. \nNairobi National Park has raised wood walkways that provide a panoramic view of the park’s ecology. The visitor gets a clear picture of what to look forward to seeing. It was establlished by British settlers in the 1940s, and occupies some 117 square kilometers. \nHome to more than 550 species of birds and attracting some 150,000 visitors a year, the park also acts as the lungs of the city, bringing in fresh air to an increasingly crowded capital. \nThe park is home to diverse wildlife, from the African buffalo, impala, waterbuck, Burchell’s zebra, hartebeest, and ostrich to the nocturnal lion and leopard. \nGiraffes can also be seen loping about, their elongated necks dwarfing the acacia trees. For the bird watcher, there are endless flocks to explore, with an estimated over 500 permanent and migratory species. The park is also one of Kenya’s most successful rhino sanctuaries. Both species of rhino, white and black, can be found within the park. \nThe southern boundary is formed by the River Mbagathi and on hot, sunny days, especially in August, herds of zebra, wildebeest, and other ungulates flock to quench their thirst. Beyond the river is Maasai cattle country, which lies on the migratory corridor through which the animals access the Athi Kapiti plains during the rainy season. \nAnother must-see place is the ivory burning site monument, where then President Moi burned 12 tons of ivory in 1989 as a gesture to persuade the world to halt the trade. \nChildren on school trips flock to the park by the hundreds to gape at this magnificent urban jungle. \nThe Kenyan government has fostered a tradition of hosting the ATA Congress every ten years, said ATA Executive Director Edward Bergman, adding, “On the occasion of ATA’s 40th anniversary, we are eager to return to Kenya for this milestone in ATA’s history. We are delighted to bring together the public and private sectors, travel industry, and media to participate in the Congress.” \nATA Congress delegates include African tourism ministers, tourist industry professionals representing tourism boards, destination representatives, travel agents, tour operators, airlines, hotels and accommodations, service providers, and travel media. \nParticipants from the corporate, nonprofit, and academic sectors are also expected to attend along with travel and hospitality students. Pre- and post-Congress tours will also be available to explore Magical Kenya beyond the Congress.", "external_links": [], "published": "2015-07-03T23:16:00.000+03:00", "crawled": "2015-07-04T00:58:37.000+03:00", "highlightTitle": ""}