{"organizations": ["IBM"], "uuid": "7573d03c5a02e11085c5aaee6c5296beef92d99a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/ibmleftcrnrlogo-inside_600x400.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13225284/1/dow-opens-lower-as-ibm-suffers-sales-slump.html?cm_ven=RSSFeed", "country": "US", "title": "Dow Opens Lower as IBM Suffers Sales Slump", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Dow Opens Lower as IBM Suffers Sales Slump", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T16:36:00.000+03:00", "replies_count": 0, "uuid": "7573d03c5a02e11085c5aaee6c5296beef92d99a"}, "author": "", "url": "http://www.thestreet.com/story/13225284/1/dow-opens-lower-as-ibm-suffers-sales-slump.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Dow Opens Lower as IBM Suffers Sales Slump", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint \nNEW YORK ( TheStreet ) -- The Dow Jones Industrial Average opened lower on Tuesday, weighed down by shares of IBM ( IBM - Get Report ) , which suffered its 13th straight quarterly sales decline. Other benchmark indexes were mixed as investors digested a rush of earnings reports. \nThe Dow fell 0.38%. The S&P 500 was down 0.05%, and the Nasdaq was flat. \nIBM ( IBM - Get Report ) fell nearly 5% after second-quarter revenue of $20.81 billion slid 14.6% from a year earlier, missing estimates by $140 million, as PC demand continued to fall. IBM affirmed its full-year guidance. \nUnited Technologies ( UTX - Get Report ) shares were down 6% after the defense contractor reported a mixed quarter. Net income of $1.81 a share beat analysts' estimates by a dime, while revenue of $16.33 billion fell 5% and missed estimates by $190 million. The company warned that future profit at its aerospace and elevator businesses would be lower than expected for 2015. \nMust Read: Warren Buffett's Top 10 Dividend Stocks \nVerizon ( VZ - Get Report ) slipped 2.7% on a mixed quarter, earning $1.04 a share on $32.22 billion in sales. Analysts expected $1.01 in net income on $32.45 billion in revenue. \nHarley-Davidson ( HOG - Get Report ) gained 3.6% despite a drop in quarterly motorcycle sales. Overall motorcycle sales fell 1.4%, driven by a 2.7% decline in the international market. Harley-Davidson downgraded 2015 guidance for shipments of motorcycles to 281,000 at the high end, below a previous forecast of 282,000 at the low end. \nTravelers ( TRV ) rose 1% after beating bottom-line quarterly estimates. The insurance holding company earned $2.52 a share, 39 cents better than expected, on $6.17 billion in revenue. \nBaker Hughes ( BHI ) shares were on watch after the oil services company swung to a quarterly loss and reporting a 33.2% drop in revenue tied to tumbling oil prices. North American sales, which contribute more than one-third of total revenue, fell 47% to $1.5 billion. \nQualcomm ( QCOM ) gained nearly 2% on Wall Street Journal reports the chipmaker is considering a strategic breakup. The company could announce major changes, which may include significant layoffs, in its third-quarter earnings call on Wednesday afternoon. \nShake Shack ( SHAK ) stumbled more than 3% after filing a secondary offering of 4 million shares of common stock on behalf of shareholders. Shake Shack will not receive any of the proceeds. \nTesla ( TSLA ) dropped 4% after UBS analysts recommended a \"sell\" based on expectations the electric vehicle maker will miss its storage and auto volume growth forecasts. Analysts wrote the company has based forecasts on solicitations of interest rather than more-reliable deposits. \nCrude oil struggled to hold above $50 a barrel, extending losses after hitting its lowest point since early April on Monday. West Texas Intermediate crude fell 0.1% to $50.10 a barrel. \nOil has been under pressure in recent weeks as a number of macro worries came to a head: Iran and six world powers agreed on a nuclear deal that would ease international sanctions; the likelihood of a Federal Reserve rate hike this year increased, pushing the safe-haven U.S. dollar higher; and the International Energy Agency warned that the market remains \"massively oversupplied\" in a report earlier in the month. \n\"Oil prices are still showing a tendency towards weakness,\" wrote Commerzbank analysts in a note. \"The prospect of ongoing oversupply on the oil market if Iran resumes its supply is continuing to weigh on prices.\" Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-07-21T16:36:00.000+03:00", "crawled": "2015-07-21T16:52:31.954+03:00", "highlightTitle": ""}