{"organizations": [], "uuid": "2fa65279a04b635f0cc84e557ca61498d924d60b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61665/honduran-port-connects-tourists-culture-history-and-nature", "country": "US", "title": "Honduran port connects tourists with culture, history and nature", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Honduran port connects tourists with culture, history and nature", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T23:25:00.000+03:00", "replies_count": 0, "uuid": "2fa65279a04b635f0cc84e557ca61498d924d60b"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61665/honduran-port-connects-tourists-culture-history-and-nature", "ord_in_thread": 0, "title": "Honduran port connects tourists with culture, history and nature", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Honduran port connects tourists with culture, history and nature Adv: Five centuries after Columbus, Honduran Caribbean Port connects visitors with culture and history Adv: \nTEGUCIGALPA, Honduras - Following the upcoming Columbus Day holiday, American cruise passengers will have the option of a unique port-of-call that is being developed where the Italian explorer made his fourth and final visit to the New World. Once known as Punta de Caxinas, 500 years of a history of pirates, gold and silver and Spanish fortresses await visitors to the port town of Trujillo today. \nThe Norwegian Pearl will set sail from Miami on October 18 to the newly developed Honduran destination, and smaller liners such as the adult-only Fred. Olsen Cruise Lines have also added Trujillo as an enticing stop. \nFollowing a 2011 groundbreaking on a 50,000 square foot commercial center, the beachfront colonial town welcomed its first commercial liner in early 2014. With the motto: “Where the rainforest meets the sea,” today the destination offers the nation’s first mainland counterpart to its famed island destinations such as Roatan. Both offer beautiful white sandy beaches and retail spaces, with the new Banana Coast development also offering more easy access to day trips to experience indigenous cultures and ziplines over the 500-year-old Spanish Royal Road. Those looking for a guided tour of the area can even choose whether to set out upon an ATV, a kayak or even horseback. \nWhile excitement abounds regarding the coming opportunities for prosperity for the town of about 30,000 residents; the spirit first established by Spanish settlers in 1525 is being preserved today. The new development allows visitors from around the world to retrace Columbus’s steps and see much of the same wildlife, nature and beauty that greeted the first visitor five centuries ago.", "external_links": [], "published": "2015-07-21T23:25:00.000+03:00", "crawled": "2015-07-21T23:53:27.129+03:00", "highlightTitle": ""}