{"organizations": [], "uuid": "5453c368c22925bc07606c1ba406c29ec4af8d3c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/frg.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/seychelles-multi-sectoral-ministerial-meeting-creates-islands-tourism-industry/", "country": "US", "title": "Seychelles Multi Sectoral Ministerial meeting creates in island's tourism industryTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Seychelles Multi Sectoral Ministerial meeting creates in island's tourism industryTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "5453c368c22925bc07606c1ba406c29ec4af8d3c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/seychelles-multi-sectoral-ministerial-meeting-creates-islands-tourism-industry/", "ord_in_thread": 0, "title": "Seychelles Multi Sectoral Ministerial meeting creates in island's tourism industryTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seychelles Ministerial meeting creates further opportunity in tourism industry Published on : Wednesday, July 8, 2015\nVice President Danny Faure had called for members of Seychelles Hospitality and Tourism Association (SHTA) and Seychelles of Chamber commerce and Industry (SCCI) to sit down with Joel Morgan, Minister for Foreign Affairs and Transport, Jean Paul Adam Minister for Finance, Trade & Blue Economy and Alain St.Ange Minister for Tourism and Culture to find a cohesive and harmonious approach for air access strategy for China and India markets, and to also discuss operational costsamongst other tourism related matters.\nThe meeting which is due to take place Wednesday 8th July at the Tourism Board’s Offices at ESPACE Building will be chaired by Joel Morgan, Minister for Foreign Affairs and Transport, was tabled during the second multi-sectoral ministerial meeting for 2015, chaired by Vice President Danny Faure. The public-private sector ministerial meeting is a continued approach by the Seychelles Government to come out with comprehensive strategies designed to solve issues or challenges seen to be affecting the tourism industry.\nDuring the last session of the multi-sectoral ministerial meeting, there was a transparent and open debate on the proposed Seychelles air access charters to China as well as the marketing approach to China and India. Discussions also continued on Air Seychelles domestic and International rates; the latter touching on the applicable rates for the Indian market comparing it to the applicable rate to Mauritius which is over two hours longer.\nThe meeting which also saw the presence of Charles Bastienne, Minister of Home Affairs, Christian Lionnet Minister of Land Use and Housing, Didier Dogley Minister of Environment, Energy and Climate Change, Wallace Cosgrow Minister for Fisheries and Agriculture and Micheal Benstrong Minister for Investment , Entrepreneurship Development and Business Innovation touched base on other issues such as Finance, Environment and Land use.\nAlain St.Ange Minister for Tourism and Culture said the public-private sector ministerial meeting has created a new spirit of openness in the country.\n“It’s been a very frank, open and transparent meeting, which created something new for the country: the spirit of openness. We must not forget that since the last couple of years ago this new approach in looking at the tourism industry is bearing fruits for Seychelles. Today this transparency and openness that exist is a big step in working together between the island’s government and its private sector’’ Minister St.Ange said.\nThe Minister went on to say that the public and the private sector should continue working together for the country to continue to move forward.\n“ Seychelles has but one tourism industry. We do not have a Government Tourism Industry and a Private Sector Tourism Industry. What we have is a Seychelles Tourism Industry and the whole country needs to work together to make sure we move forward together to consolidate our tourism industry for the long term” said Minister Alain St.Ange during a press interview after this July multi-sectorial ministerial meeting that was held at National House.\nSource:- Seychelles Tourism\nRelated Posts ‘Earn While you Learn’ Programme – India Tourism Minister visits the island’s new Savoy Hotel Project at the Seychelles popular beach of Beau Vallon ‘Tourism ministry will keep opening doors for its personnel,’ says Minister St.Ange of Seychelles New VisitScotland data reveals regional visitor trends for 2012 PROMPERÚ to tap Indian travel market", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-08T20:18:15.000+03:00", "highlightTitle": ""}