{"organizations": [], "uuid": "3216e3ee1b59e0ab6b92e086f5da9531cc937230", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61850/longest-homeport-any-industry-cruise-ship", "country": "US", "title": "Longest homeport of any industry cruise ship", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Longest homeport of any industry cruise ship", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T11:03:00.000+03:00", "replies_count": 0, "uuid": "3216e3ee1b59e0ab6b92e086f5da9531cc937230"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61850/longest-homeport-any-industry-cruise-ship", "ord_in_thread": 0, "title": "Longest homeport of any industry cruise ship", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Longest homeport of any industry cruise ship Adv: \nJul 27, 2015 Adv: \nOn 24 July, Star Cruises joined with Xiamen Port Holding Group to hold a festive celebration marking the beginning of SuperStar Libra’s homeport in Xiamen, China until 1 November. The longest homeport of any industry cruise ship ever in Xiamen, SuperStar Libra will operate 3-day/2-night cruises to Penghu, Taiwan and 6-day/5-night cruises to Miyakojima and Naha, Okinawa in Japan throughout the summer and autumn. \nGreeting SuperStar Libra in Xiamen during the welcome ceremony were government officials and representatives from the city of Xiamen, Xiamen Port Holding Group and the Xiamen Municipal Tourism Bureau, Taiwan Visitors Association and the Penghu Municipal County. The event was highlighted by an energetic lion dance, a captivating dance performance by SuperStar Libra’s talented performers, and a special presentation by the ship’s award-winning chefs. \nXiamen also holds a special personal connection with Tan Sri Lim Kok Thay, Chairman and Chief Executive Officer of Genting Hong Kong Limited, the parent company of Star Cruises, who can trace his ancestry back to the Fujian province. Starting in 1996, Star Cruises’ fleet, including Star Pisces, SuperStar Leo, SuperStar Aquarius, etc., have conducted more than 400 calls into Xiamen, bringing over 500,000 visitors to the city. \n“In response to the Fujian government’s plan to grow the city as a major cruise destination, Star Cruises is looking forward to its homeport in Xiamen for the next three months,” said Mr. Ang Moo Lim, Executive Vice President of Sales, Marketing & Hotels, Genting Hong Kong. “China is an important market for us in the region and we have regularly visited Xiamen in the past for short-term homeports with SuperStar Gemini in 2013 and SuperStar Virgo in 2014 and 2015. With cruising gaining in popularity in the country, the long-term deployment of SuperStar Libra in Xiamen will facilitate cross-strait cruises to enhance cultural exchange and boost tourism development in the region.” \nWith SuperStar Libra now in Xiamen, Star Cruises is well positioned to cater to tourists not only from the Fujian province and greater China but also to foreign visitors as well, allowing them to explore new and unique travel experiences. \nGuests can spend a magical weekend departing on Friday evenings for a 3-day/2-night cruise to Penghu, Taiwan where they can enjoy the famous blue skies and pristine white beaches immortalized in the well-known song “Grandma’s Penghu”. A popular destination for a romantic getaway, the Penghu Islands is now in the spotlight as the setting for the upcoming film “All You Need Is Love”, directed and starring Taiwanese superstar Richie Jen and acclaimed actress Shu Qi. \nFor a longer cruise experience, SuperStar Libra will embark on 6-day/5-night cruises to Miyakojima and Naha in Okinawa. The resort destinations of Japan, Miyakojima and Naha are known for their splendid shopping opportunities and are blessed with a balmy climate and some of the most abundant coral reefs found in the world. \nOn board, guests can savour a variety of award winning culinary delights in any of seven food and beverage outlets and can enjoy an all-inclusive dining experience of up to six meals a day at selected venues. Additionally, SuperStar Libra offers cruisers a spectacular selection of world-class entertainment and leisure options along with state-of-the-art accommodations to suit every taste and budget level. \nApproximately the length of two football pitches and at ten storeys high, SuperStar Libra was designed to meet the changing needs of today's passengers, challenging the conventional model of cruising by providing a more relaxed, resort-style cruise, complete with flexibility and non-intrusive services of the highest standard for guests of all ages.", "external_links": [], "published": "2015-07-27T11:03:00.000+03:00", "crawled": "2015-07-27T19:53:30.190+03:00", "highlightTitle": ""}