{"organizations": [], "uuid": "6383874b21aae43c2350f93123fd2c7904940c8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newser.com", "main_image": "http://img1-azcdn.newser.com/image/1026918-0-20150710092957.jpeg", "site_section": "http://rss.newser.com/rss/section/22.rss", "section_title": "Travel from Newser", "url": "http://www.newser.com/story/209615/awful-evil-new-airline-seat-design-unveiled.html", "country": "US", "title": "'Horrible,' 'Evil' New Airline Seat Design Unveiled", "performance_score": 0, "site": "newser.com", "participants_count": 1, "title_full": "'Horrible,' 'Evil' New Airline Seat Design Unveiled", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T13:34:00.000+03:00", "replies_count": 0, "uuid": "6383874b21aae43c2350f93123fd2c7904940c8c"}, "author": "Rob Quinn", "url": "http://www.newser.com/story/209615/awful-evil-new-airline-seat-design-unveiled.html", "ord_in_thread": 0, "title": "'Horrible,' 'Evil' New Airline Seat Design Unveiled", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Horrible,''Evil' New Airline Seat Design Unveiled 'Economy Class Cabin Hexagon' unlikely to take off By Rob Quinn , Newser Staff Posted Jul 10, 2015 5:34 AM CDT COMMENTS (27) (Newser) – A radical new concept for airplane seating has been unveiled in a patent application from a company called Zodiac Seats France—and initial reactions range from disbelief to disgust to sheer horror. The \" Economy Class Cabin Hexagon \" turns the middle seat in rows of three around, so one passenger is facing two others. The patent says it will allow airlines to fit more passengers in cabins while increasing \"space available at the shoulder and arm area,\" but it seems like most people would rather walk. A roundup of reactions: \"If you're traveling with your kid or spouse, being face-to-face can be nice,\" writes Jordan Golson at Wired . \"But if you're around the sort of people one usually sits next to on airplanes, it would be horrible. At least if you're all facing the same direction, you can pretend they don't exist. Here, if you're a human with peripheral vision, fat chance of that.\" Even worse than staring at a seat back is staring at a \"stranger who's probably a mouth-breather with a bad nail-biting habit,\" writes Adam Clark Estes at Gizmodo . \"What's even worse than that is the new staggered design also ensures that you're flanked by two more strangers' faces, a peripheral inconvenience [that's] bound to be as anxiety-inducing as the very act of soaring 30,000 feet in the air inside a metal tube that weighs several tons.\" The new arrangement \"threatens to eliminate every last ounce of air travelers' dignity,\" writes Claire Zillman at Fortune , who decides shoulder space is overrated and most people would sooner \"have their arms totally immobilized instead of having to sit inches away from strangers, while positioned face-to-face.\" At the Verge , Ross Miller calls the \"evil\" design a \"truly nightmarish idea that lives somewhere between Saw and The Twilight Zone ,\" and he wonders what would happen during turbulence. Shawn Langlois at MarketWatch calls the design \"the worst air travel idea since pay toilets,\" but he notes that there are no current plans to install hexagon seating in planes. (Scientists have figured out why people fart more on planes and what can be done about it.) This is not how most people want to fly. (Zodiac Seats France) ADVERTISEMENT", "external_links": [], "published": "2015-07-10T13:34:00.000+03:00", "crawled": "2015-07-10T18:10:32.000+03:00", "highlightTitle": ""}