{"organizations": ["AP"], "uuid": "c60391389706e0935972dae35cd5fe8de2abe712", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 6:46 p.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_BRIEF_YELLOWSTONE_BISON_INJURY_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "Bison injures woman posing for selfie at Yellowstone", "performance_score": 0, "site": "ap.org", "participants_count": 0, "title_full": "Bison injures woman posing for selfie at Yellowstone", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T01:42:00.000+03:00", "replies_count": 0, "uuid": "c60391389706e0935972dae35cd5fe8de2abe712"}, "author": "", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_BRIEF_YELLOWSTONE_BISON_INJURY_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "Bison injures woman posing for selfie at Yellowstone", "locations": ["Yellowstone   YELLOWSTONE NATIONAL PARK", "Mississippi", "Yellowstone National Park", "Wyo."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Amy Bartlett", "Bartlett"], "text": "  YELLOWSTONE NATIONAL PARK, Wyo. (AP) -- Yellowstone National Park officials are warning tourists to keep their distance after a bison flipped a woman into the air as she posed for a selfie with the massive beast. The dangerous encounter was the fifth run-in between park-goers and buffalo this year. Park officials said the 43-year-old Mississippi woman turned her back on the animal to get a photo with it near the Fairy Falls trailhead just outside Old Faithful. Someone nearby saw the woman and her daughter about 6 yards from the animal and warned they were too close just before it came at them. They tried to run, but the bison caught the woman and tossed her with its head. The woman's family drove her to a nearby clinic where she was treated for minor injuries. \"The (woman) said they knew they were doing something wrong but thought it was OK because other people were nearby,\" park spokeswoman Amy Bartlett said. \"People are getting way too close.\" In separate incidents earlier this year, bison gored a 68-year-old woman and a 16-year-old girl and tossed an off-trail teenager and an Australian tourist into the air. Five bison encounters resulting in injuries is unusual during a tourist season, Bartlett said. \"We typically have one or two per year,\" she said. One factor that could be contributing to added encounters is increased attendance at the park this year, Bartlett said. The park had more than 780,000 recreational visits in June, a 17 percent increase over June 2014 and 12 percent more than the previous record set in June 2010. July and August are the busiest months of the year for tourists. Yellowstone prohibits people from getting within 25 yards of bison and within 100 yards of bears and wolves.", "external_links": [], "published": "2015-07-23T01:42:00.000+03:00", "crawled": "2015-07-23T04:47:40.458+03:00", "highlightTitle": ""}