{"organizations": [], "uuid": "8fb595087f0529586b5c81c3979408a31b9ac35d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/10/11/2A6709A500000578-0-image-a-41_1436523057389.jpg", "site_section": "http://www.dailymail.co.uk/travel/articles.rss", "section_title": "Travel Articles | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3156010/German-drivers-named-best-Europe-British-holidaymakers-Italian-motorists-rated-worst.html", "country": "GB", "title": "German drivers named the best in Europe by British holidaymakers", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "German drivers named the best in Europe by British holidaymakers | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T18:15:00.000+03:00", "replies_count": 1, "uuid": "6379f3b1604f68a7fe38c1137dfcee57df756d4a"}, "author": "Chris Kitching for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3156010/German-drivers-named-best-Europe-British-holidaymakers-Italian-motorists-rated-worst.html#post-0", "ord_in_thread": 0, "title": "German drivers named the best in Europe by British holidaymakers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1\nView\ncomments\nGermans are Europe’s best drivers and Italians are the worst – at least in the minds of their British counterparts.\nWith a busy summer travel season ahead, more than a third of Britons (37 per cent) believe German drivers are the best on the roads, according to a recent survey.\nOf those polled, 32 per cent said German motorists’ ability to abide by the rules of the road makes them stand out.\nMore than a third of those polled said they consider German drivers to be the best in Europe\nAnd while they admire their driving habits, almost half of 2,000 respondents (44 per cent) feel that Germans are Europe’s fastest drivers.\nThat may be due to the fact that Germans get plenty of time to drive fast on the country’s Autobahn motorways, where some stretches have no speed limits for cars.\n Say cheese! Japan's Mount Fuji gets Wi-Fi so hikers can... Thought the Swiss were just good at clocks? Revealing the... Caught on camera: Lucky seal escapes jaws of great white... Is THIS the world's best hotel? Inside India's... While Germans can celebrate being named No 1, Britons have crowned Italians as Europe’s worst drivers, according to the Green Flag study of UK drivers’ habits and opinions.\nMore than a third (37 per cent) of respondents said Italians aren’t up to scratch behind the wheel.\nThirty-nine per cent said they feel Italian drivers are most likely to break the rules of the road.\nMeanwhile, the survey named France as the best place to enjoy a driving holiday – with almost half of British tourists (46 per cent) saying it would be their first choice.\nNeighbouring Belgium ranked at the bottom, with just five per cent of respondents wanting to go on a driving holiday there.\nWhen Britons do drive abroad, it appears language differences (38 per cent), different road rules and regulations (37 per cent) and driving on the ‘wrong side’ of the road (30 per cent) are the biggest challenges.\nHalf of those polled said they’re most likely to drive fast in Germany and slowly in Italy (25 per cent).", "external_links": ["http://dailym.ai/1LZBk4m"], "published": "2015-07-10T18:15:00.000+03:00", "crawled": "2015-07-10T14:19:56.000+03:00", "highlightTitle": ""}