{"organizations": ["United"], "uuid": "c6c521471e9e26846dba424d5bcd0ffe866620ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/2/f/x/2/p/image.related.StuffLandscapeSixteenByNine.620x349.15s5fg.png/1436741315845.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/news/70177660/United-pilot-flushed-bullets-down-toilet-on-plane", "country": "AU", "title": "United pilot flushed bullets down toilet on plane", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 0, "title_full": "United pilot flushed bullets down toilet on plane", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T01:48:00.000+03:00", "replies_count": 0, "uuid": "c6c521471e9e26846dba424d5bcd0ffe866620ee"}, "author": "", "url": "http://www.stuff.co.nz/travel/news/70177660/United-pilot-flushed-bullets-down-toilet-on-plane", "ord_in_thread": 0, "title": "United pilot flushed bullets down toilet on plane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "United pilot flushed bullets down toilet on plane Last updated 10:48, July 13 2015 \nA United Airlines pilot flushed bullets down the toilet of a Munich-bound plane. \nA United Airlines captain threw bullets in a trash bin accessible to passengers and later flushed them down a toilet on board a flight that he was piloting to Germany. \nThe US Transportation Security Administration and the airline said that they were investigating the incident. \nUnited spokeswoman Karen May said that the pilot should not have thrown the bullets in the toilet. \nShe said the pilot is allowed to carry a gun on domestic flights, in the US, under a post-9/11 federal program intended to make planes harder to hijack. The pilot did not take his gun on the June 23 international flight from Houston to Munich, she said, but he realised during the flight that he had left ammunition in his bag. \nThe pilot dumped the bullets before reaching Germany, which has strict gun laws. \n\"He did incorrectly dispose of the ammunition,\" May said, \"but it is likely that the pilot is not going to face any criminal charges.\" \nA TSA spokesman confirmed that the agency is investigating but declined to say more. The Federal Aviation Administration and aviation authorities in Munich did not immediately respond to requests for comment. \nUnited declined to name the pilot. He is likely to be very experienced - it takes many years of seniority for pilots to become captains on international flights for major US airlines. \nMay said the pilot was still employed by United, but she declined to say whether he had been grounded. \n\"We are investigating,\" she said. \"I can't give any details about his status other than he is still with us.\" Ad Feedback \nThe incident was first reported by The Aviation Herald, which said that a flight attendant looking for a passenger's missing ring found 10 bullets in a waste bin and alerted the captain. \nHe flushed the bullets down the toilet and alerted German authorities when he realised that the flight attendant would report the incident, according to the Herald. \nAfter landing in Munich, the plane taxied to a remote area where passengers got off and the waste tanks were emptied to find the bullets. - AP", "external_links": [], "published": "2015-07-13T01:48:00.000+03:00", "crawled": "2015-07-13T02:10:17.000+03:00", "highlightTitle": ""}