{"organizations": [], "uuid": "d8448d42490b470f5a64baad6adbcfb663e0a341", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/0706/20150706__austin-dillon-daytona-crash~p1.jpg", "site_section": "http://www.denverpost.com/travel", "section_title": "Travel - The Denver Post", "url": "http://www.denverpost.com/motorsports/ci_28440518/dale-earnhardt-jr-wins-at-daytona-after-horrific", "country": "US", "title": "Dale Earnhardt Jr. wins at Daytona after horrific last lap crash involving Austin Dillon", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Dale Earnhardt Jr. wins at Daytona after horrific last lap crash involving Austin Dillon - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T20:52:00.000+03:00", "replies_count": 0, "uuid": "d8448d42490b470f5a64baad6adbcfb663e0a341"}, "author": "Jenna Fryar", "url": "http://www.denverpost.com/motorsports/ci_28440518/dale-earnhardt-jr-wins-at-daytona-after-horrific", "ord_in_thread": 0, "title": "Dale Earnhardt Jr. wins at Daytona after horrific last lap crash involving Austin Dillon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DAYTONA BEACH, Fla. — A horrific last-lap accident that left drivers fearing for Austin Dillon's safety muted Dale Earnhardt Jr.'s victory in the rain-delayed race at Daytona International Speedway.\nDenver-based Furniture Row Racing's Martin Truex Jr. went out in an 11-car crash on lap 105 of 160, finishing 38th and sustaining considerable damage to the No. 78 car.\nTruex — who was already driving a backup car because of a wreck during practice on Friday — was in 15th at the time of the crash. He had started 19th.\n\"The weekend didn't start off well for us and it ended worse,\" Truex said. \"The backup car turned out to be really fast as we ran up front for a good portion of the race. But when we got shuffled back we just happened to be in the wrong place at the wrong time.\"\nTruex is now sixth in the Sprint Cup standings, with Jimmie Johnson leading.\nEarnhardt crossed the finish line at 2:41 a.m. Monday morning, filled with dread after Dillon's car sailed upside down into the fence then shot back onto the track. The car was on its roof and mangled when it was hit hard by Brad Keselowski.\nThe car tore down a section of fencing, debris scattered into the grandstands, and crew members from several teams raced to check on Dillon.\nA stunned Earnhardt seemed speechless as he crossed the finish line.\n\"Oh My God. That looked awful,\" Earnhardt yelled into his radio. He followed with a string of expletives as he tried to comprehend the frightening accident.\nAdvertisement Crew chief Greg Ives immediately radioed his team to not pull Dillon from the car.\n\"Whoever is in that window, if he's OK, do not touch him. Tell him to stay in there,\" Ives said.\nEarnhardt continued to inquire about Dillon, who earned his first career win at Daytona in Friday night's Xfinity Series race and has been close with the Earnhardt family his entire life. The late Dale Earnhardt won 34 races at Daytona and Dillon was present for many of them as he grew up watching The Intimidator drive for his grandfather, Richard Childress.\nEarnhardt was killed in a 2001 crash on the final lap of the Daytona 500.\nEarnhardt Jr. said after the race he had no idea who was in the car — it was torn nearly in half, its engine ripped from under the hood — but admitted to being genuinely scared after the wreck.\n\"You are just on the verge of tears,\" Earnhardt said. \"I saw everything in the mirror pretty clearly ... I just was very scared for whoever that car was. I didn't care about anything except figuring out who was OK.\n\"The racing doesn't matter anymore.\"\nThe outcome was never in doubt as Earnhardt dominated the entire race. But as the pack of cars chased him on a two-lap overtime sprint to the finish, contact in the train sent Dillon's car sailing upside down into the fence.\nAustin Dillon goes airborne and hits the catch fence after being involved in a multi-car crash on the final lap of the NASCAR Sprint Cup series auto race at Daytona International Speedway, Monday, July 6, 2015, in Daytona Beach, Fla. ( Terry Renna, The Associated Press ) Daytona President Joie Chitwood said 13 fans were attended to in the grandstands. Eight declined treatment, four were seen at the track and one was taken to a local hospital in stable condition.\nDillon was seen and released in Daytona's infield care center and said he had a bruised arm and tailbone.\n\"I am just going to be really sore; it got my tailbone pretty good and my arm,\" he said. \"But just thank the good Lord for taking care of me and for what NASCAR has done to make the sport this much safer.\"\nThe accident was similar to a 2013 crash in the Xfinity Series when Kyle Larson's car sailed into the fence, sending debris into the stands that injured 28 fans. Larson's car was destroyed as it ricocheted back onto the track.\nJimmie Johnson, who finished second to Hendrick Motorsports teammate Earnhardt, said Dillon's wreck was one of the worst he's ever seen.\n\"I'm shocked that Austin Dillon is even alive,\" said Johnson. \"I expected the worst when I came back around.\"\nThe accident overshadowed Earnhardt's second win of the season — his first was in May at Talladega — and his first in this race since 2001. It was his fourth Sprint Cup Series win at Daytona.\nThe wreck was also the main focus at the end of a day that began early Sunday but quickly fell off schedule because of weather.\nThe race began at 11:42 p.m., a delay of 3 hours, 34 minutes for rain. Drivers spent the time doing an array of different activities: Daytona 500 winner Joey Logano went into the stands to thank fans for sticking around, while Ricky Stenhouse Jr. used social media to prove he can do a headstand.\nThey also stopped by the NBC studio to help the network fill air time in its first race broadcasting NASCAR since 2006.\nWhen the race finally began, and the field circled the track waiting for the green flag, reigning NASCAR champion Kevin Harvick made note of the unusual start time by wishing his crew a good evening before correcting himself to morning.\nIt then took just three laps for the action to begin as David Gilliland sliced across the front of Clint Bowyer to trigger a nine-car accident that collected Logano and Danica Patrick, among others.\nTony Stewart, winner of the 2005 race that ended at 1:42 a.m., sliced his way through the carnage then grumbled on his radio about early-race aggressiveness.\n\"Somebody please remind me how much Lap 2 pays again?\" he smarted.", "external_links": ["http://extras.mnginteractive.com/live/media/site36/2015/0706/20150706__austin-dillon-daytona-crash~p1.jpg"], "published": "2015-07-06T20:52:00.000+03:00", "crawled": "2015-07-07T02:35:20.000+03:00", "highlightTitle": ""}