{"organizations": ["MSC Voyagers Club"], "uuid": "d0a55c9bab21f029574a8fa2246b185dbc99e329", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/135/590x/MSC-Cruises-ship-593394.jpg", "site_section": "http://www.express.co.uk/posts/rss/132/travel", "section_title": "Daily Express :: Travel Feed", "url": "http://www.express.co.uk/travel/cruise/593394/MSC-Cruises-launches-new-loyalty-scheme-for-every-passenger", "country": "IE", "title": "MSC Cruises launches new loyalty scheme for every passenger", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "MSC Cruises launches new loyalty scheme for every passenger", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T02:00:00.000+03:00", "replies_count": 0, "uuid": "d0a55c9bab21f029574a8fa2246b185dbc99e329"}, "author": "", "url": "http://www.express.co.uk/travel/cruise/593394/MSC-Cruises-launches-new-loyalty-scheme-for-every-passenger", "ord_in_thread": 0, "title": "MSC Cruises launches new loyalty scheme for every passenger", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MSC Cruises launches new loyalty scheme for every passenger MSC Cruises launches new loyalty scheme for every passenger MSC Cruises has launched a new loyalty scheme, the MSC Voyagers Club, which starts the moment a booking is confirmed. PUBLISHED: 00:00, Thu, Jul 23, 2015 | UPDATED: 21:36, Thu, Jul 23, 2015 PH Membership to MSC Voyagers Club starts as soon as a booking is confirmed \nThe existing Classic, Silver, Gold and Black tiers of the previous MSC Club will remain, but a new introductory Welcome level will also offer an enhanced range of onboard benefits. MSC Voyagers Club members will receive a five per cent discount off all future cruises and additional 15 per cent off cruises included in a special Voyages Selection. Silver, Gold and Black card members will also receive around £30 ($50) of onboard credit per person when booking a cruise from the Voyages Selection. This is part of our consistent commitment to offer guests an exceptional all-round experience before, during and after their cruise MSC Cruises executive director Giles Hawk Membership of MSC Voyagers Club is open to all ages (previously guests had to be a minimum of 14) and guests are automatically registered as members. They can start earning rewards as soon as they step on board, with points awarded depending on the level of cabin booked (Bella, Fantastica, Aurea or MSC Yacht Club). Points will also be awarded for pre-paid onboard services such as spa treatments and excursions, and for onboard purchases, with 100 points for every £100 ($150) spent. Each passenger will receive a booklet of onboard discounts and special offers, with more privileges introduced as members rise up the levels. New benefits include mini bar discounts, internet packages, spa treatments and shopping offers. \nThe loyalty scheme is open to MSC Cruises customers [PH] Additional offers, depending on passengers' membership tier, include priority disembarkation in ports where a tender boat is required (Gold and above) and complimentary dance classes (Black). Other privileges include dedicated events, milestone rewards, exclusive onboard offers, priority boarding and late check-out for top tier members. Members of the current MSC Club will have all their points transferred to the MSC Voyagers Club and multiplied by 100 to reflect the new points system. Related articles Grab a bargain in the sails: Cruises for every budget MSC Cruises executive director Giles Hawke said: \"This enhancement of the current loyalty programme is part of our consistent commitment to offer guests an exceptional all-round experience before, during and after their cruise. \"The MSC Voyagers Club is designed to reward our most loyal guests and to ensure that they feel part of the wider MSC Cruises family.\" Personalised MSC Voyagers Club cruise cards will be given to passengers at the beginning of each sailing.", "external_links": [], "published": "2015-07-23T02:00:00.000+03:00", "crawled": "2015-07-24T07:32:27.662+03:00", "highlightTitle": ""}