{"organizations": [], "uuid": "de308f660d1765094e0e160ba0e369baf1e94cca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/4-steps-get-air-if-your-flight-delayed-or-canceled-0", "country": "US", "title": "4 steps to get in the air if your flight is delayed or canceled", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "4 steps to get in the air if your flight is delayed or canceled", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T19:47:00.000+03:00", "replies_count": 0, "uuid": "de308f660d1765094e0e160ba0e369baf1e94cca"}, "author": "senh", "url": "http://www.wopular.com/4-steps-get-air-if-your-flight-delayed-or-canceled-0", "ord_in_thread": 0, "title": "4 steps to get in the air if your flight is delayed or canceled", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: 30 flights delayed due to fire at airport's longue Agus said international flights that had been delayed due to the incident include China Southern Flight 388, Xiamens Air Flight 870 and Malaysia Airlines ... police have taken coordination with regard to steps to handle the situation. 07/5/2015 - 12:41 am | View Link Air India in turbulence after Rijiju, Fadnavis episodes; PMO steps in For its part, the Union civil aviation ministry sought a report from Air India on the recent incidents ... unannounced rescheduling of the aircraft.” Rijiju said the flight wasn’t delayed but was rescheduled for technical reasons. 07/2/2015 - 11:16 pm | View Link PMO steps in, seeks probe into VVIP flight ‘delays’ According to an email sent by Air India Duty Manager to the airline’s CMD and Executive Director, the flight was delayed because Fadnavis’ Principal Secretary Praveen Pardeshi had forgotten to carry his old passport which had the US visa. The email ... 07/2/2015 - 10:02 am | View Link Fadnavis-Rijiju flight delay row: Aviation Minister apologises, PMO seeks report This also delayed the flight.The revelation came days after a similar report which said that an Air India flight to Newark from Mumbai ... Washington: India has saved $2 billion in the last one year by taking steps to reform fuel subsidiary delivery ... 07/2/2015 - 9:33 am | View Link VVIPs delaying flights: PM office steps in, seeks report 1. An Air India flight (AI 446) from Leh to New Delhi was delayed for about an hour on June 24. Reports say that three passengers, including a child were allegedly off loaded from the flight to accomodate Union Minister Kiren Rijiju and Jammu and Kashmir ...", "external_links": [], "published": "2015-07-09T19:47:00.000+03:00", "crawled": "2015-07-09T19:50:24.000+03:00", "highlightTitle": ""}