{"organizations": [], "uuid": "049f35a4408e7d6596682319f8a3a13fad184aad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/l/w/0/9/image.related.StuffLandscapeSixteenByNine.620x349.15lg04.png/1435870658309.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/europe/italy/69864772/Italy-NZ-takes-centre-stage-at-Venice-Biennale", "country": "AU", "title": "Italy: NZ takes centre stage at Venice Biennale", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Italy: NZ takes centre stage at Venice Biennale", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T04:45:00.000+03:00", "replies_count": 0, "uuid": "049f35a4408e7d6596682319f8a3a13fad184aad"}, "author": "Liz Light", "url": "http://www.stuff.co.nz/travel/destinations/europe/italy/69864772/Italy-NZ-takes-centre-stage-at-Venice-Biennale", "ord_in_thread": 0, "title": "Italy: NZ takes centre stage at Venice Biennale", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Italy: NZ takes centre stage at Venice Biennale LIZ LIGHT Last updated 05:00, July 5 2015 Liz Light \nThe bustling Grand Canal in Venice. \nAs Venetian as the palaces on the Grand Canal, the Biennale Arte offers a feast of art and culture. And New Zealand, with our man Simon Denny, is in the heart of it. \nLocation, location; Denny's installation, Secret Power , is in the Marciana Library, in San Marco Square, opposite the cathedral and Doge's Palace. \nA few hundred thousand people walk past every day, and a percentage of them make their way upstairs into the library, to Secret Power. That New Zealand has such a prominent place is partly due to the veneration that Denny has garnered in the European art world. Ironically, until the Biennale, he was scarcely known here. The New Zealand room in the library has a Titian painting on the vestibule ceiling, marble busts dating to the Greek Empire 2400 years ago along the walls and the marvellous 1450 Fra Mauro map of the then-known world. Denny is exhibiting in a magnificent space, overpowering enough to make a less-accomplished person tremble. He handles it well and links contemporary issues to those that Venice grappled with 500 years ago. Venice, then the world power, had an intricate spy network and it mapped the world from little snippets of discovered knowledge. Now parallel but different mapping is done with internet-based communication and Edward Snowden, among others, have revealed mass surveillance spy networks. The theme of the Biennale, All the World's Futures, was ignored by some of 200-plus art installations, but Denny, faithful to the topic, was the only person who addressed the impact of NSA's (National Security Agency) secret international telecommunications surveillance programmes. \nNZ artist Simon Denny's work is in the spotlight at the 2015 Venice Biennale. \nHe did this in a uniquely New Zealand context, highlighting the US-led Five Eyes alliance and New Zealand's role in it. \nDenny's installation is complex and multi-layered both physically and intellectually. It also has humour, is represented, at times, in popular cultural icons – cartoons and skulls – and is technologically clever. And, I learnt a lot more about the US surveillance systems and Five Eyes than I have from other media. New Zealand has two installation sites, the other being at Venice airport, where Denny was able to have high-resolution images of the glorious ceiling of the Marciana Library, including the Titian painting, placed on the floor of the passenger halls. The effect is ornately beautiful and it's a weird treat to walk, and wheel one's bags, over it. Good on you Simon Denny, you make us proud. The Biennale, though artistically and culturally exhilarating, can be exhausting and when viewing more than 200 art installations in three days, it's easy to identify dross. There is plenty of it. Four years ago it was piles of found-objects (rubbish) that bored me but thankfully random rubbish is no longer trendy. This year my irritation is bad video installations; for instance, the man sitting endlessly vomiting, and three heads, one on each wall, talking simultaneously about corrupt government, murder and mayhem. A variation on bad is boring; endless washing waves with woo-woo music, and home-type videos – my dad's dog playing on the beach. Go figure. But within the myriad video installations there are two that are superb. The Ways of Folding Space & Flying , in the Korean Pavilion, is a collaborative multi-channel film project that interweaves history with visions of the future; good concept and story, excellent photography, appropriate linking of the different films and appropriate noise – music is not quite the right word. \nTo quote the blurb, \"art is a crucial facet of complex human desires that compel us to imagine, dream and challenge\". \nDetail of one of the vivid works by Ahmet Gunestekin of Turkey. Ad Feedback \nLikewise, Taiwanese artist Wu Tien-chang's Never say Goodbye references an increasingly robotic future, the American military bases in Taiwan and an idealised but unrealistic past. \nTien-chang uses actors to tell a story in the way animation does, a quirky reversal of animation being used to represent people. His three linked video/film installations are funny, witty and sweet. A final criticism relates to multimedia and artists who are arrogant enough to think they are expert at everything. There were quite a few; for instance, Maria Leon who \"creates the photographs, shoots the videos, edits them, paints and draws characters and symbols, writes the script and designs the sound track\". Jolly good, Ms Leon, but the only impressive thing about the installation is the funky portrait photography. It is those who have a more precise focus who excel. And there are many. The work of Turkish artist Ahmet Gunestekin, as he traces all the different names Istanbul has had through the ages, has detail, colour, shadow, texture and mirrored reflections. \nIt's three dimensional but looks two, is artful and cleverly symbolic. \nJuan Carlos Distefano, in the Argentina room, has created large transparent sculptural pieces of people in various torture postures. \nThis straddles the line between horrible and hilarious; either way they are powerful, a comment on Argentina's past and unfortunately, probably, on an aspect of the future. \nFiona Hall, the Australian representative, transforms ordinary materials into beautiful art works that explore the connections between nature, culture and the role of humans in nature's demise. \nFor instance, a perfect bird's nest made of finely shredded US dollar notes, paper images of skulls in elegant perfume bottles and clocks ticking out the time backwards, with natural scenes painted on their faces. \nAnother of the many must-see installations is that of Chiharu Shiota, Japan's representative. \nHer two-room installation, The Key in the Hand , weaves red yarn into complex webs over the entire gallery. \nKeys of many different types, from all over the world, dangle from the yarn, suggesting multi-layered memories of houses, places and people. \nThe light filtering though the yarn and keys is subtle as are the shadows on the walls and floor. \nThis has a beauty that transcends language and culture. \nI spend three days focusing on contemporary Biennale art and four more being a tourist in Venice. \nThis audacious city is built over water. \nThe Grand Canal is four kilometres of the world's most beautiful architecture and the play of light between sky and water on the centuries-old buildings and the shimmering reflections of them in the labyrinth of canals give Venice unique beauty. \nThis age-old magnificence has made Venice a world centre for art and culture for 700 years. \nIts many churches and galleries are filled with centuries of extraordinary art. \nThe Academia Gallery, for instance, displays numerous works by Bellini, Tintoretto, Tiepolo, Titian and Canaletto, all artists I studied in art history many years ago, and wondered if I would ever see. \nVenice itself, and galleries such as this, are intense, dreamy and artful. \nReally good art lasts the distance. And, for sure, there is some of it at the Biennale. \nFact file \nThe Venice Biennale, the world's most prestigious art event, is on until November 22. See labiennale.org and nzatvenice.com. Cathay Pacific flies from Auckland to Milan via Hong Kong every day. See cathaypacific.co.nz. At Milan Airport, stay at Novotel Malpensa Airport; divine beds and great breakfast. See accorhotels.com. Trains leave Milan Central for Venice every half hour. \nThe writer travelled with assistance from Cathay Pacific and Accor Hotels. - Stuff", "external_links": [], "published": "2015-07-02T04:45:00.000+03:00", "crawled": "2015-07-04T22:33:34.000+03:00", "highlightTitle": ""}