{"organizations": [], "uuid": "cc0dfa15bc58b51c3fc28909b27706886f608189", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/rss/press-releases-1/168.xml", "section_title": "PR.com Press Releases: Travel Arrangement & Reservation Services News", "url": "http://www.pr.com/press-release/617906", "country": "US", "title": "3 Morton Grove Organizations Team Up for a July 12th Presentation About the Chicago Tribune's Late Publisher, Colonel Robert Mccormick", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "3 Morton Grove Organizations Team Up for a July 12th Presentation About the Chicago Tribune's Late Publisher, Colonel Robert Mccormick", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T18:00:00.000+03:00", "replies_count": 0, "uuid": "cc0dfa15bc58b51c3fc28909b27706886f608189"}, "author": "Morton Grove Chamber of Commerce", "url": "http://www.pr.com/press-release/617906", "ord_in_thread": 0, "title": "3 Morton Grove Organizations Team Up for a July 12th Presentation About the Chicago Tribune's Late Publisher, Colonel Robert Mccormick", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Morton Grove Chamber of Commerce Press Release Receive press releases from Morton Grove Chamber of Commerce: By Email RSS Feeds: 3 Morton Grove Organizations Team Up for a July 12th Presentation About the Chicago Tribune's Late Publisher, Colonel Robert Mccormick The Morton Grove Chamber of Commerce, Historical Society and Public Library will be hosting a speaker from the Robert R. McCormick Museum in Wheaton to talk about the life and times of the legendary publisher of the Chicago Tribune, Colonel Robert R. McCormick on Sunday, July 12, 2015 at 2pm at the Library. Morton Grove, IL, July 01, 2015 --( PR.com )-- Planned in the newly renovated Morton Grove Public Library building located at 6140 Lincoln Avenue, the event will be held on Sunday, July 12, 2015 starting at 2 pm in the afternoon.Titled \"Colonel Robert R. McCormick: His Life and Legacy,\" this presentation will cover the history of Colonel Robert R. McCormick and his family and how they became one of the most powerful, wealthy and influential media families in American history. The presentation will also look at the lasting legacy of Colonel McCormick through his creation the Colonel Robert R. McCormick Foundation; the Chicago based charitable foundation as well as Cantigny Park and Golf, the 500 acre public park and golf course located in Wheaton Illinois. The estate was named Cantigny after the French village in which the Colonel fought a battle during World War One.The speaker will be Jeffrey Anderson who has been the tour coordinator of the Robert R. McCormick Museum for 10 years. He holds a BA and MA in history from Roosevelt University. During his time at the McCormick Museum he has researched, interpreted and lectured on the McCormick family history. He has also taught on the McCormick family for College of DuPage as well as lectured on the McCormick family to the Conference on Illinois History.About the Robert R. McCormick Museum: ​This stately mansion was once the home of Chicago Tribune editor and publisher Robert R. McCormick (1880-1955). Upon his death, McCormick’s will established the Robert R. McCormick Charitable Trust, known today as the McCormick Foundation, which created a public park, museum, and philanthropy to foster communities of educated, informed and engaged citizens.About the Morton Grove Public Library: The Morton Grove Public Library has served the community with entertainment, information, education, and cultural experiences for more than 75 years. Beginning as a volunteer program with nothing but a book collection barrel and a storefront, MGPL has transformed into a dynamic community centerpiece in Morton Grove.About the Morton Grove Historical Society: The Morton Grove Historical Society, in cooperation with the Morton Grove Park District cooperate in maintaining and operating the Historical Haupt-Yehl House and Educational Annex. The Society collects and displays artifacts of significance to Morton Grove, including those of the original founders and those of more recent settlers to the community who continue to enhance the vitality of Morton Grove along with providing educational programs.About the Morton Grove Chamber of Commerce and Industry: They are dedicated to promoting and advocating for the local business community to ensure the continued economic, cultural and civic well-being of Morton Grove. The Chamber is a vehicle for business to work collectively to build their business and enhance the economic make-up of the community. They also inform businesses and advocate on their behalf about local, state and federal issues, since 1926.For More Information about the Morton Grove Chamber of Commerce contact the office at 847-965-0330 or email: director@mgcci.org. More about the Chamber can be found on their website (www.mgcci.org) along with their Facebook Page and YouTube Channel, both found by searching \"Morton Grove Chamber of Commerce.\" Contact Information Morton Grove Chamber of CommerceMark V. Matz", "external_links": [], "published": "2015-07-01T18:00:00.000+03:00", "crawled": "2015-07-01T18:36:17.000+03:00", "highlightTitle": ""}