{"organizations": [], "uuid": "8ced24ccab51c31d874a2e5c27776442e2065108", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61769/movenpick-resort-spa-karon-beach-phuket-awarded-best-performer-a", "country": "US", "title": "Movenpick Resort & Spa Karon Beach Phuket awarded “Best Performer in Asia” by Green Globe", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Movenpick Resort & Spa Karon Beach Phuket awarded “Best Performer in Asia” by Green Globe", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:10:00.000+03:00", "replies_count": 0, "uuid": "8ced24ccab51c31d874a2e5c27776442e2065108"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61769/movenpick-resort-spa-karon-beach-phuket-awarded-best-performer-a", "ord_in_thread": 0, "title": "Movenpick Resort & Spa Karon Beach Phuket awarded “Best Performer in Asia” by Green Globe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Movenpick Resort & Spa Karon Beach Phuket awarded “Best Performer in Asia” by Green Globe Adv: \nJul 24, 2015 Adv: \nLOS ANGELES, California - The Movenpick Resort & Spa Karon Beach Phuket, Thailand, is pleased to announce that it has been honored as “Best Performer in Asia” by Green Globe the international sustainability certification program for travel and tourism. \nOnce again, the renowned property was acknowledged for setting a high industry standard with its long-term sustainability management systems, which include daily monitoring and regulation of energy consumption, water usage and waste production. \nGreen Globe Certification CEO Guido Bauer said, “Movenpick Hotels & Resorts (MHR) is the most Green Globe certified hotel company in the world. Within the Asian region, Movenpick Resort & Spa Karon Beach Phuket is the ‘Best Performer’ for sustainable operations and management. \n“Movenpick Resort & Spa Karon Beach was the first MHR resort to be certified in Asia, in 2011, and today records the region’s highest compliance score of 83% against Green Globe sustainability criteria. \n“For travelers concerned with making the right accommodation choice, Movenpick Resort & Spa Karon Beach would have to be one of the best options for its environmentally and culturally sensitive approach to hospitality in a unique destination,” added Mr. Bauer. \nAccepting the accolade on behalf of the upscale Phuket resort, General Manager Hansruedi Frutiger said, “We are very proud of this important achievement, which clearly underlines our commitment to promoting sustainability and is reflected in our management principles and daily practices.” \nMovenpick Resort & Spa Karon Beach Phuket is a member of The Green Leaf Foundation, dedicated to protecting the quality of the environment while developing the tourism industry. The resort is also diligent in providing regular educational training seminars for staff on energy efficiency and environmental standards. \nMuch of the property’s fresh water is sourced from a company-owned treatment plant, located in the nearby municipality. Overall waste reduction targets are achieved through comprehensive reuse/recycle and packaging minimization. And the hotel’s purchasing policy favors suppliers that adhere to ecological sustainability practices. \nRecently, the property introduced a new line of eco-friendly water bottles and bathroom amenities. Moreover, the property incorporates traditional Thai influences into its aesthetic profile and service philosophy, and supports community-based activities, which highlight the area’s environmental, historic and cultural identity. \nAbout Movenpick Hotels & Resorts \nMovenpick Hotels & Resorts, an international upscale hotel management company with over 16’000 staff members, is represented in 25 countries with 82 hotels, resorts and Nile cruisers currently in operation. Around 30 properties are planned or under construction, including Chiang Mai (Thailand), Riyadh (Saudi Arabia) and Tunis (Tunisia). \nFocusing on expansion in its core markets of Europe, Africa, the Middle East and Asia, Movenpick Hotels & Resorts specializes in business and conference hotels, as well as holiday resorts, all reflecting a sense of place and respect for their local communities. Of Swiss heritage and headquartered in central Switzerland, Movenpick Hotels & Resorts is passionate about delivering premium service and culinary enjoyment – all with a personal touch. Committed to sustainable environments, Movenpick Hotels & Resorts has become the most Green Globe certified hotel company in the world. For further information please visit moevenpick-hotels.com \nContact: Nampetch Tipaxsorn, Director of Marketing Communications, 509 Patak Road, Karon Beach, Phuket 83100, Thailand, Phone +66 76 396 139, Fax +66 76 396 122, moevenpick-hotels.com/phuket-karon-beach \nAbout Green Globe Certification \nGreen Globe is the worldwide sustainability system based on internationally-accepted criteria for sustainable operation and management of travel and tourism businesses. Operating under a worldwide license, Green Globe is based in California, USA, and is represented in over 83 countries. Green Globe is an Affiliate Member of the United Nations World Tourism Organization (UNWTO). \nGreen Globe is a member of the International Coalition of Tourism Partners (ICTP) . Source: Green Globe", "external_links": [], "published": "2015-07-24T03:10:00.000+03:00", "crawled": "2015-07-24T05:02:22.282+03:00", "highlightTitle": ""}