{"organizations": [], "uuid": "70c19fb9ea929456519dca19008ad2f870c3b7f8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beontheroad.com", "main_image": "http://lh3.googleusercontent.com/-Du-w35DiNp8/VZ1oe6hmeMI/AAAAAAABcp0/EYjdghRpg4s/s72-c/Collection%252520of%252520ancient%252520cuckoo%252520and%252520musical%252520clocks%252520at%252520Black%252520Forest%252520Museum%25252C%252520Triberg%25252C%252520Germany.JPG", "site_section": "http://www.beontheroad.com/feeds/posts/default", "section_title": "BE ON THE ROAD | Travel Blog of an Indian Globetrotter", "url": "http://www.beontheroad.com/2015/07/black-forest-fairy-tale-kingdom-of-germany.html", "country": "US", "title": "Black Forest: Fairy Tale Kingdom of Germany", "performance_score": 0, "site": "beontheroad.com", "participants_count": 1, "title_full": "Black Forest: Fairy Tale Kingdom of Germany", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T11:18:00.000+03:00", "replies_count": 0, "uuid": "70c19fb9ea929456519dca19008ad2f870c3b7f8"}, "author": "Sankara Subramanian (noreply@blogger.com)", "url": "http://www.beontheroad.com/2015/07/black-forest-fairy-tale-kingdom-of-germany.html", "ord_in_thread": 0, "title": "Black Forest: Fairy Tale Kingdom of Germany", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tweet As a young boy, I grew up listening to Grimm’s Fairy Tales. As I grew older, I read some of it. Today, we all watch these fairy tales through 2D and 3D movies. Be it Rapunzel, Hansel and Gretel, The Wolf and the Seven Young Kids, Cinderella, Little Red Riding Hood, Snow White, Sleeping Beauty or the other of Grimm’s fairy tales, they were set in the dense Black Forest of South West Germany’s Baden- Wurttemberg state. Clock Making is a native industry of the Black Forest region Hence, when I recently visited the Black Forest (Schwarzwald) region of Germany, I was pretty much high on the fairy tale value of this region, but what I got to learn is that in addition to being a fairy tale kingdom, it is the place where the world’s first automobile was test driven, it is home to the world’s largest cuckoo clock, it is home to some really ancient traditions and culture, it is home to the ancient art of mouth glass blowing, it has Germany’s highest waterfall, it is where the absolutely delicious cherry gateau cake finds its home and it packs in some sensational natural beauty and scenery. And I am sure there is so much more to discover in these green mountains as I just happened to skim the surface in my 3 days there. Different kind of travelers see different things in the Black Forest. Elderly couples see a relaxed holiday destination with great nature, food and wine. Hikers see a lot of mountains to climb. Culture lovers seem to go behind the hidden stories of this land. Outdoor aficionados, road trippers, motorcyclists and bikers seem to explore some of its less beaten paths which starts with tracing the famous Mercedes Benz test drive trail that takes them through the heart of the Black Forest region. Water lovers take to the lakes of Titisee and Schluchsee for its wind surfing and diving. And if it is festival time, you can go almost everywhere for beer, wine, food and frolic. The multi tiered Triberger waterfalls of Schwarzwald located at Triberg General holidaymakers and backpackers like me go all around. Triberg, Vogtsbauernhof, Wolfach, Dorotheenhutte, Freiburg, Oberwolfach, Schonach and the Murg valley railway are the popular destinations of Black Forest from where you can explore the smaller villages around them. The super delicious Black Forest cherry gateau that is heavenly to eat with your afternoon coffee My trip started in the quiet city of Wolfach that is home to some friendly people and great food. But, the place that really blew my mind is the Glass Blowing factory located near Wolfach at Dorotheenhutte. This place is one of the few places in the world that still practice the art of making glass items by mouth and hand. To see a lost art in its full glamour is quite a surreal experience and to know that they make some of the best crystal glass in the world and that their customers are some of the richest names of the world says a lot about this place. Home to a museum, a fully loaded glass factory, a training school, a shop and a restaurant, the Glassblowing factory at Dorotheenhutte is certainly one of the highlights around Wolfach and definitely a must see if you are interested in ancient art and if you wish to see magic unfold with a mouth, a pair of hands and molten silica. Glass making is still an art form here My next stop was the scenic valley of Vogtsbauernhof where I came in contact with 400 years of rich history at the Schwarzwalder Freilichtmuseum. If you spend some quality time in this open air museum and explore each of the farm houses from different parts of the Black Forest, you will suddenly have a lot of respect for the people of that era. These farm houses were pretty much self sufficient, had their own storage barns, horse stables, pig stys, water based wheat crusher, water based wood cutter, blacksmith area, silver smith area and so much more that for a while I was wondering how come they managed all that so admirably so many hundreds of year ago. This is one place where you can certainly discover a lot of history, traditions and customs. This is also the place where I discovered the extremely delicious cherry gateau (my mouth is watering as I write this) with some espresso on a bright afternoon. This is the original black forest cake and is packed with cherry, cherry liquor, chocolate and much more. And definitely a zillion times better than the ones I have had in India. This cherry gateau is a definite must try ! The gear mechanism of the largest cuckoo clock in the world My next stop was Oberwolfach where I spent time exploring its pretty valleys, mountain streams and pine forests. This small town is perfect for a relaxed nature getaway. And the people here are so warm. I tried some mouth glass blowing myself. Blew myself a pretty vase. At Triberg, I got to indulge in quite a bit as I stayed here the longest. This pretty mountain town has everything from cuckoo clock factories to baroque churches, from a stunning waterfall to great food and not to say many beautiful hiking trails around it. The Triberger waterfalls, one of the Germany’s highest waterfalls finds its home here. This multi tiered waterfall is quite a spectacle and is definitely worth every bit of the walk. Hiking through the green forests around it is very much recommended. The trail is steep at places, but nature is so pristine here that you will hardly notice the difficulty. If you keep going on the trail from the waterfall, you will come to the Black Forest museum where you can learn a lot about the bobble hats and the interesting clothes and head gear of the people of the black forest, their music, their train system, their rich history and definitely a lot about its various cuckoo and musical clocks. After all, the people of the Black Forest along with neighbouring Switzerland are the pioneers in clock making and the people of Black Forest are definitely the pioneers in cuckoo clocks. If you head up from the Black Forest Museum, you will come across a beautiful baroque church where if lucky, you might come to witness a religious sermon and some delightful music. The very ornate traditional bobble hats worn by the single women of certain parts of the forest Since Triberg is also one of the larger towns of the Black Forest, you can indulge in some shopping here. A lot of people definitely buy some cuckoo clocks as souvenirs. Some even buy bobble hats. And there are so many quality restaurants here that the food action is always in top gear in this town. Festive costumes from the black forest Close to Triberg is the town of Schonach that is the heart of Black Forest Cuckoo clock making. After exploring Triberg, I paid a visit to the Rombach and Hass Black Forest Cuckoo Clock Manufacture facility. This is where I learnt and saw a lot of traditional and modern cuckoo clocks. On the fringes of this town is also located the world’s largest cuckoo clock that is the hard work of one man who devoted a good part of his life to building it. Made from 63 gears and lots of passion, this cuckoo clock is quite a sight and a lot of people are interested in seeing the cuckoo come out every 30 minutes. Even I waited for it to say cuckoo-cuckoo! 400 year old farm houses that used to be pretty self sufficient in its time Unfortunately, I only had a limited time to explore the Black Forest area and would definitely like to explore it on a bicycle or a motorcycle the next time I visit this beautiful fairy tale land. There is so much more that I can discover in terms of the hidden treasures of this place especially when it comes to traditions and customs. I think I can definitely spend 2 full weeks if not more exploring it at a leisurely pace. Black Forest – the land of cuckoo clocks If you wish to visit this land of cuckoo clocks, may be you might to try the bright, sunny and warm summer months as that is when this region is at its absolute best and when every part of it is easily accessible. Welcome to BE ON THE ROAD Travel Blog! I am Sankara, its founder, a 30 something male from Bangalore who is living his dream of exploring the world and simultaneously trying to inspire others to live their dream. Wanna live your dream? Find Some inspiration here!", "external_links": [], "published": "2015-07-09T11:18:00.000+03:00", "crawled": "2015-07-10T01:46:43.000+03:00", "highlightTitle": ""}