{"organizations": [], "uuid": "a0e36e369e121f0894951341fb7e595a1062a6b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/30/102877919-GettyImages-163670407.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000739/device/rss/rss.html", "section_title": "Travel", "url": "http://www.cnbc.com/2015/07/30/lufthansa-profits-take-off-despite-labor-strikes-and-germanwings-crash.html", "country": "US", "title": "Lufthansa profits take off despite labor strikes and Germanwings crash", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "Lufthansa profits take off despite labor strikes and Germanwings crash", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "a0e36e369e121f0894951341fb7e595a1062a6b4"}, "author": "Alexandra Gibbs", "url": "http://www.cnbc.com/2015/07/30/lufthansa-profits-take-off-despite-labor-strikes-and-germanwings-crash.html", "ord_in_thread": 0, "title": "Lufthansa profits take off despite labor strikes and Germanwings crash", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No financial impact from crash: Lufthansa\nSimone Menne, CFO of Deutsche Lufthansa, discusses how oil prices have helped the business and why Germanwings will break-even this year.\nThe fall in oil price helped German airline, Deutsche Lufthansa AG post better-than-expected second-quarter earnings Thursday in spite of the Germanwings crash and labor disputes .\nThe company reported net earnings of 529 million euros ($580 million) for 2015's second quarter, up from 173 million euros in the same period last year. Total revenue came in at 8.39 billion euros, an 8.9 percent increase from 2014's second quarter.\nDespite the lift from cheap oil, Lufthansa is currently in the midst of dealing with disputes between its labor force and over compensation with the families from the March crash of an aircraft operated by its subsidiary Germanwings.\nMarket shares in Lufthansa may have sunk after the news in March, however, the airline doesn't see any financial impact on it or either.\nRead More Can flat earnings really support a rising market?\nRalph Orlowski | Bloomberg | Getty Images Simone Menne, Chief Financial Officer for Deutsche Lufthansa AG, told CNBC on Thursday that the outlook for Germanwings was looking good in terms of bookings, expecting it to break-even.\n\"Of course it was a very, very tragic case. Regarding the figures (though) we don't see any impact at the moment. Actually Germanwings is performing very well, with high volumes during summer and the outlook looks good. So I don't see a financial impact. Germanwings will break-even this year.\"\nIn terms of the families and compensation, Menne said Lufthansa preferred not to discuss the process in the media, however, stressed that they talked to the relatives \"in all respect directly.\"\nCheap oil definitely helps In its earnings, published Thursday, Lufthansa attributed its lift in profits to the 309 million euro reduction in its fuel costs, along with a rise in sales and capacity utilization.\n\"The oil is definitely helping us. In the first half year, that was really a huge tailwind and also for the rest of the year we see the oil prices will stay low, and at least on the short-term does help. We have reduced our prognosis for the oil to 6 billion from 6.2 billion,\" Menne told CNBC.\nRead More Ryanair sees full-year profit near top of forecast\nHowever, Menne admitted that with more affordable pricing from other competitors, this was causing pricing pressure.\n\"We see that the pricing pressure is there and will continue to stay, as the low cost carriers are entering into our home markets. On the other hand, we are well prepared, because we have our new platform, Eurowings, with a different cost space than the premium platform.\"\n\"We are pretty sure than our new fares structure is fitting into the market and the needs to our customers. The individualized possibility to buy what you need helps our passengers, and the transparency makes everybody see that we are very competitive in our pricing I don't think this is a risky strategy.\"\nStocks in the airline rose 3.5 percent in early trade, making it a two month high for the firm, according to Reuters . In later trade however, the stock pared gains to trade around 0.7 percent lower.\nRead More BT profits beat expectations as EE deal eyed", "external_links": [], "published": "2015-07-30T03:00:00.000+03:00", "crawled": "2015-07-30T16:29:08.233+03:00", "highlightTitle": ""}