{"organizations": [], "uuid": "67c06a7e495a6c1443a78745e59c1fe5b7e15392", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/06/30/17/2A1DB4D800000578-0-image-a-82_1435680648578.jpg", "site_section": "http://www.dailymail.co.uk/travel/articles.rss", "section_title": "Travel Articles | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3144684/Supersize-visit-wonders-world-fast-food-outlets-opened-tourist-attractions.html", "country": "GB", "title": "Supersize your visit to the wonders of the world: The fast food outlets that have opened next to top tourist attractions", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Supersize your visit to the wonders of the world: The fast food outlets that have opened next to top tourist attractions | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T15:09:00.000+03:00", "replies_count": 1, "uuid": "ecea1462ef3433d5ba88ccd1d99eec0acd8f65f7"}, "author": "Catherine Eade for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3144684/Supersize-visit-wonders-world-fast-food-outlets-opened-tourist-attractions.html#post-0", "ord_in_thread": 0, "title": "Supersize your visit to the wonders of the world: The fast food outlets that have opened next to top tourist attractions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1\nView\ncomments\nThey say there are only two certainties in life: death and taxes, but maybe there should be a third...\nWhere there’s a tourist attraction there’s sure to be a fast food outlet nearby, and this seems true of a number of beautiful tourist landmarks, whether it's an acclaimed art gallery in the centre of Paris or a pyramid built circa 2560 BC.\nTrip Advisor is just one site where a number of travellers have bemoaned the location of not one but two fast food joints, literally opposite the ancient site of the Pyramid of Giza, the oldest and largest of the three pyramids in the Giza Necropolis.\nLovely view: Pizza Hut opened up above a Kentucky Fried Chicken outlet just minutes away from the Pyramid\nOne is a Pizza Hut, which sits right on top of a KFC.\nWith more than 30,000 McDonald's restaurants worldwide and counting, it's hardly surprising that the chain has located some of its outlets in places they perhaps shouldn't have, but even fans of the chain might be shocked at some of the choices.\n Next Cross-Channel chaos: French strike action causes misery for... View from behind! From the Statue of Liberty to the Sphinx... The final flight for Terminal 1: Heathrow closes T1 after 47... Forget actually going shopping: At the world's most... The picturesque city of Prague for example, with its beautiful buildings and cobbled streets has its very own McDonald's... slap bang next to the Museum of Communism.\nI'm loving it: The Museum of Communism with the red and white umbrellas of the burger joint nextdoor\nA strange juxtaposition? As you enter the Museum, you can smell the burgers as you pass McD's on the left\nIn September 2008, the chain opened a restaurant in Peru on Cusco's Plaza de Armas, which was named by the Project for Public Spaces as one of the 60 best places in the world.\nAfter protestations from those keen to keep its cultural identity separate from modern consumerism, McDonald's made a concession and replaced its traditional neon yellow 'M' with a brown one that was considered to be in better taste.\nThe Pantheon in Rome, that 2,000-year-old architectural marvel which dominates the grand square, the Piazza della Rotonda, also has a Ronald McDonald nearby - until 2011.\nThe Pantheon in Rome\nThe stunning scenery of China's Guangxi regions....Oh. Is that really a Micky D's blocking the view? Yes\nThere are several other outlets in central Rome, however, including one at the Trevi fountain.\nYangshuo, meanwhile, a county and resort town in southern China’s Guangxi region, is known for its beautiful mountain landscapes.\nThe town is set amid pinnacles like Bilian Feng (Green Lotus Peak), which has a hiking trail to the top, while tour boats offer cruises on the Li River past picturesque countryside from the town of Guilin to the north... Oh and you are never too far from your next burger and fries.\nThey weren't loving it: Paris was up in arms about the decision to locate a burger restaurant under the Louvre\nThankfully the Parisian government turned down a request to locate a McDonald's underneath La Tour Eiffel in 1993, realising that the monument and symbol of the capital which is one of the biggest draws to visitors worldwide might be somewhat sullied by the addition of the golden arches.\nHowever they saw fit to say yes to the plan for the chain's 1,142nd French outlet - slap bang underneath the Louvre - to the dismay of many. Fans of the world’s most-visited museum feared the smell of burgers might put them off their art, but the chain opened there nonetheless.\nEven the Great Wall of China has a Starbucks, which opened at the popular Badaling section in 2005\nOther landmarks have been spared by public outcry. Beijing's Forbidden City got a Starbucks in 2000, but it was finally closed down seven years later, after half a million signatures on a petition and much campaigning from a well known TV news anchor who said it was 'eroding Chinese culture'.\nBut those fast food outlets are nothing but determined. In 2005 Starbuck managed to get permission to open a branch at the Great Wall of China, setting up at the popular Badaling section.", "external_links": ["http://dailym.ai/1eiduT1"], "published": "2015-07-01T15:09:00.000+03:00", "crawled": "2015-07-01T10:23:47.000+03:00", "highlightTitle": ""}