{"organizations": [], "uuid": "430b007632ac5e20f3a4d710b6ce7a861298955e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.herald.ie/lifestyle/article31352813.ece/ALTERNATES/h342/2015-07-06_lif_10884588_I1.JPG", "site_section": "http://www.herald.ie/lifestyle/travel/", "section_title": "Travel - Herald.ie", "url": "http://www.herald.ie/entertainment/music/review-neil-diamond-at-3arena-31352814.html", "country": "", "title": "Review: Neil Diamond at 3Arena", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "Review: Neil Diamond at 3Arena - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T11:00:00.000+03:00", "replies_count": 0, "uuid": "430b007632ac5e20f3a4d710b6ce7a861298955e"}, "author": "Chris Wasser", "url": "http://www.herald.ie/entertainment/music/review-neil-diamond-at-3arena-31352814.html", "ord_in_thread": 0, "title": "Review: Neil Diamond at 3Arena", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Use #TweetCaroline to see your tweets on the big screen!\" Now that right there, Diamond lovers, is a genius move. Neil Diamond Chris Wasser – 06 July 2015 03:00 AM\nAlmost as good as the grand opening. Put it this way - American soft-rock warrior Neil Diamond doesn't just stroll out on stage. Oh no, he's got his very own walk-on music, complete with a jewel-shaped entrance that doubles up as a CGI diamond. A Diamond within a diamond within a diamond, basically.\nJeez, it's like the Second Coming up on that stage. It's almost too much. \"Are you ready to partay?\" asks the man in black, arms outstretched and hips a shakin'. Oh yes, I just got shivers.\nHere's the deal: an evening with Neil Diamond (74)is everything you'd expect it to be. A soppier and sappier affair than his previous outing in Lansdowne Road, Diamond 2015 utilises every over-egged trick in the book, with the main attraction almost moving in slow motion as he recounts a love on the rocks.\nPROLIFIC\nThe ladies sway - the men do, too. This is a surprisingly intimate, Vegas-like set-up in which time stands still, taste is abandoned and a bearded Neil Diamond is a sex god (it's those remarkable eyebrows of his).\n\"It's great for the ego to have the ladies screaming out your name,\" he smiles. \"Makes me feel like I'm 70 again\". Yep, more shivers. Indeed, Neil is in possession of a repertoire that spans six decades, and some of these songs kick and scream their way out of the set list.\nOthers land naturally. Whatever the case, we're reminded of just how prolific and varied a songwriter he is.\nThe voice may have lost some of its strength, but it just about holds up, and the man with the black, acoustic Gibson is a sharp, giddy, and likeable performer. A complete cheeseball, too.\nHe recalls the thrill of his first visit to Dublin way back when. \"I didn't know anybody knew me here!\" he tells us. It's like Sally Field's Oscar speech all over again. And let's not forget that rush of emotion that comes over Neil Diamond when a small army of musicians take us into Red Red Wine. \"I do, do, do love to dance!\" he jests.\nYou gotta take the good with the bad. Brooklyn Roads comes equipped with footage from the Diamond family photo and video album, and it's a lovely touch, but those new songs from Melody Road almost put us to sleep. I'm a Believer, Holly Holy, Forever in Blue Jeans - it's all good, but the horrendous Sweet Caroline is another matter entirely. Crikey, he's still doing that stop-start thing at the end. \"Last chorus, I promise!\" announces Neil Diamond. And on and on it goes. Oh well. Keep 'em swaying, Diamond Man… HHHII\n> CHRIS WASSER", "external_links": [], "published": "2015-07-06T11:00:00.000+03:00", "crawled": "2015-07-06T16:42:27.000+03:00", "highlightTitle": ""}