{"organizations": [], "uuid": "b6700f9597eff1526f2b1ec5a3000c22548778f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61767/india-states-vie-tourism-investment-dollars", "country": "US", "title": "India states vie for tourism investment dollars", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "India states vie for tourism investment dollars", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T02:50:00.000+03:00", "replies_count": 0, "uuid": "b6700f9597eff1526f2b1ec5a3000c22548778f5"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61767/india-states-vie-tourism-investment-dollars", "ord_in_thread": 0, "title": "India states vie for tourism investment dollars", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "India states vie for tourism investment dollars Adv: \nBy Anil Mathur, eTN India Correspondent | Jul 23, 2015 L-R: Mr. Shri Ashok Gajapathi Raju, Dr. Jyotsna Suri & Dr. Mahesh Sharma Adv: \nINDIA (eTN) - The two day Tourism Investors Meet 2015, organized by the Federation of Indian Chambers of Commerce and Industry in association with the Tourism Finance Corporation of India in Delhi on July 22 and 23 raised some very important points which will have to be tackled if any long-term results are to be achieved, after the din dies down. \nFocus on improving infrastructure and connectivity was no doubt important, as there was a long list of avenues available in different states for investment in this area. \nState after state vied with one another to tell the investors to make use of the opportunities in various projects planned, be it cruises, hotels, chopper services, or amusement parks. West Bengal, Kerala, Rajasthan, Punjab, Chattisgarh, Haryana, and Karnataka were among the states keen to get investment, but the vital question posed was that both domestic and international investors face many problems even as it is, so how and why will they come to put in more money? \nWhat was emphasized by people like Subhash Goyal, President of the Indian Association of Tour Operators (IATO), and top brass of the Tourism Finance Corporation of India (TFCI), was that the promises already made should be implemented in a time-bound manner, so that the investors do not feel cheated. \nThe key to the success of the laudable efforts will be the follow-up that must be done, if the meet is not to turn out to be merely another photo-op event for ministers, bureaucrats, and industry leaders.", "external_links": [], "published": "2015-07-24T02:50:00.000+03:00", "crawled": "2015-07-24T05:02:27.635+03:00", "highlightTitle": ""}