{"organizations": [], "uuid": "19144757b4c29df8ddaae3e71b99f49ea6cb7e8a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources0.news.com.au/images/2015/07/10/1227436/920084-f24d23c2-26a4-11e5-b33b-dc629bef0d9a.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/cheetahs-hop-aboard-vehicle-and-get-up-close-and-personal-with-tourists-in-kenya/story-fnndib5x-1227436920689?from=public_rss", "country": "IL", "title": "Cheetah faces off with scared tourist", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Cheetah faces off with scared tourist", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T08:32:00.000+03:00", "replies_count": 0, "uuid": "19144757b4c29df8ddaae3e71b99f49ea6cb7e8a"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/cheetahs-hop-aboard-vehicle-and-get-up-close-and-personal-with-tourists-in-kenya/story-fnndib5x-1227436920689?from=public_rss", "ord_in_thread": 0, "title": "Cheetah faces off with scared tourist", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mickey McCaldin"], "text": "What are these? The look on tourist Mickey McCaldin’s face says it all. Picture: Caters News Source: Picture Media \nSILLY or brave? This tourist got a little more than he bargained for while on safari in Kenya. \nWith its razor sharp claws and teeth, this is one moggy you certainly don’t want curling up in your lap. \nThe bold big cat jumped into the back seat of the jeep as it drove through the Masai Mara game reserve in Kenya. \nSlowly it sauntered over to where Irish tourist Mickey McCaldin until it was barely a foot away from his face. McCaldin was concerned the cheetah wanted to curl up in his lap. Picture: Caters News. Source: New York Post \nCheetahs are seen as being the less threatening member of the big cat family, although attacks aren’t unheard of. Adam Sandler was the victim of a threatening cheetah attack in 2013. \nScottish tourist Violet D’Mello was also attacked by a cheetah back in 2012 in Kragga Kamma game reserve in South Africa. And in this case the big cats were hand reared, not wild. \n“I just remember … something biting my head and dragging me down,” D’Mello said of the attack. \nIn her case, the attack lasted three minutes, and injuries included cuts to the face, one which was dangerously close to her eye. The images was scarily captured by Violet’s husband. Perhaps these tourists should have remembered this is what they’re capable of. Picture: Archibald D'Mello Source: AP Violet D'Mello was attacked by this tamed cheetah back in 2012. Picture: Archibald D'Mello Source: AP \nMickey McCaldin’s friend David Horsey captured the tense standoff between the pair as it looked like the cheetah was going to make himself comfortable on Mickey’s lap. \n“I’ve been living in Kenya all my life and I’ve never seen anything like this,” said David, 62, from Mombasa, Kenya. \n“The cheetah just wasn’t scared of getting up close and personal. \n“At first Mickey was really relaxed but I think he was quite concerned it might try and sit in his lap. \n“Unlike a domestic cat, you certainly don’t want that.” All aboard! Picture: Caters News Source: Picture Media Bigger than your average household cat, these cheetahs made themselves at home with these tourists. Picture: Caters News Source: Picture Media \nDavid captured the pictures last month as the group tracked a well-known family of cheetahs, whose mother is called Malaika. \nHaving followed them for a couple of days previously, they observed that the family hadn’t had a kill for a few days. \n“The family had been looking for a gazelle for a few days with no luck,” David said. \n“As we’d been around for a couple of days, I think they were used to the jeep so the mum jumped on top to get a better view. \n“I think the other cheetah tried to follow her up but went a different way.” There were many other tourists on board, but these cheetah’s took a special liking to Mickey McCaldin, seated in the back row. Picture: Caters News Source: Picture Media \n“Once it had got bored of Mickey it turned away and looked out of the vehicle for a few minutes. \n“It just jumped out afterwards.” \nMickey was out on holiday with his wife and sister, who are friends of David and his wife Vicky. \n“Me and Vicky have lived in Kenya all our lives but we never feel the urge to leave, ”David said. \n“People always ask us where we’re going on holiday and it’s always around the game reserves. \n“You never know what you’re going to come across — just like this.” Picture: Caters News Source: Picture Media Picture: Caters News Source: Picture Media Cheetah Fail: Big Cat Falls Through Safari Jeep Roof 1:43 Play video \nCHEETAHS are known for speed, accuracy and grace but this agile predator humiliated itself after falling into a JEEP full of tourists. The curious cat was playing with seven other cheetahs in the Maasai Mara, Kenya, much to the delight of some watching safari-goers. Amir Ahmed, a 69-year-old airline pilot from Dubai, filmed the cheetah prowling on the roof of the Land Rover. But the elegant cat suddenly lost its footing and fell into the jeep. Videographer / Director: Amir Ahmed Producer: Rebecca Lewis, Chloe Browne Editor: Sonia Estal, Ian Phillips, Kyle Waters Rightster", "external_links": [], "published": "2015-07-10T08:32:00.000+03:00", "crawled": "2015-07-10T16:02:39.000+03:00", "highlightTitle": ""}