{"organizations": [], "uuid": "d465029c67f455f64d99be08c03dcc42501a1091", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03349/open-top-bus-tour_3349724a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/why-not/11691572/sightseeing-bus-tours.html", "country": "US", "title": "Who needs travel? Enjoy sightseeing in your own city", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Who needs travel? Enjoy sightseeing in your own city - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T17:43:00.000+03:00", "replies_count": 0, "uuid": "d465029c67f455f64d99be08c03dcc42501a1091"}, "author": "Tim Gibson", "url": "http://www.telegraph.co.uk/sponsored/why-not/11691572/sightseeing-bus-tours.html", "ord_in_thread": 0, "title": "Who needs travel? Enjoy sightseeing in your own city", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "#WhyNot get moving by exploring your own city? When you plan a city break to Berlin or Paris, the focus is often on seeing and doing as much as possible in a very short time. Checking off seven of the city’s top landmarks in one day? No problem. Logging a few miles walking from one neighbourhood to the next? You bet. When it comes to your own town or city, however, it’s easy to put off seeing the most iconic sites. After all, there’s no rush. But playing tourist in your own backyard can offer you an entirely new perspective on your home town. You’ll need to use a bit of imagination to get out of your familiar habits. But the effort will be worthwhile, as you rediscover your local environment and savour all that it has to offer. One surefire way to give yourself a visitor’s view of your town or city is to follow the tourist trail. Rather than marching down the same old streets that you use day in, day out, download a tourist map and take in all the landmarks that you usually ignore. It’s important that you don’t get sucked into anything that resembles your daily routine Whatever you do, it’s important that you don’t get sucked into anything that resembles your daily routine. So what if you’re passing within a few metres of the office and really need to collect a document? You wouldn’t have been able to pop in if you’d gone to Vienna for the weekend. And that trip to the supermarket can wait - just go to a café for lunch: it’s what a tourist would do. If you have children, it can be great fun to revisit some of your favourite landmarks, introducing them to your kids for the first time. As always, seeing through their wondering eyes can make anything seem new again. Once you get into the groove, you’ll discover a whole new perspective on surroundings that provide the backdrop to your everyday life. It’s a great way of reinvigorating your relationship with a place because you get to enjoy the image it projects to the world, and that’s usually tinged with a healthy smattering of idealism. Of course, playing tourist isn’t only about seeing new sites - it’s also about getting a bit of outdoor exercise. So choose a sunny day, avoid the tourist buses and opt to explore the sites on foot. And if does start to rain, pop into a museum and continue your walking tour indoors. We guarantee there are nooks of even your favourite museums that you haven’t fully examined. Finally, the trick is to capture your joy so you can relive the experience when normal life resumes. Remember that street you fell in love with on your day as a tourist and be sure to walk down it at every opportunity. Make a mental note to visit that fantastic deli where you bought your picnic, and grab a sandwich there as a mid-week treat. In these ways, you’ll fall back in love with your home turf. Not only will that make for a memorable experience, it will help you appreciate where you live every single day. ADVERTISEMENT The joy of movement Whether you’re pushing your body to its limits or just enjoying the great outdoors, trying new activities can sometimes lead to aches and pains. Voltarol relieves pain at its source and reduces inflammation, which speeds up recovery — so you can enjoy moving again. Visit www.voltarol.co.uk/keep-moving to find out how Voltarol can help you enjoy the freedom of movement in your life. Voltarol® Pain-eze emulgel® for the relief of pain and inflammation. Contains diclofenac diethylammonium. Always read the label.", "external_links": [], "published": "2015-07-10T17:43:00.000+03:00", "crawled": "2015-07-10T12:36:52.000+03:00", "highlightTitle": ""}