{"organizations": [], "uuid": "015eb1a45ff364a5c6817eed7c347675ace23cd2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61002/global-experts-and-researchers-air-transport-gather-singapore", "country": "US", "title": "Global experts and researchers on air transport gather in Singapore", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Global experts and researchers on air transport gather in Singapore", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T06:26:00.000+03:00", "replies_count": 0, "uuid": "015eb1a45ff364a5c6817eed7c347675ace23cd2"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61002/global-experts-and-researchers-air-transport-gather-singapore", "ord_in_thread": 0, "title": "Global experts and researchers on air transport gather in Singapore", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Global experts and researchers on air transport gather in Singapore Adv: \nJul 03, 2015 Adv: \nSINGAPORE - The Air Transport Research Society (ATRS) announced that over 250 participants from around the world have gathered at the 19th World Air Transport Conference, held from 2 to 5 July 2015. The Conference is being held for the first time in Singapore and is hosted by the Singapore Aviation Academy, the training arm of the Civil Aviation Authority of Singapore, and the National University of Singapore. \nThe annual ATRS Conference is a congregation of global leading experts and researchers, where air transport research findings are shared and insights and research findings are discussed and debated. Through air transport research, organisations and States can study and better implement different strategies of managing resources, increasing capacity and enhancement of performances. With the Conference in Singapore, 17 Singapore-based experts and researchers will be leveraging on this opportunity to share on the experiences and research, accumulated from developing Singapore as an air hub in the last 50 years of nation-building. \nThree keynote sessions will highlight the Conference. The first session on the changing aviation landscape in Asia, features CEOs and top level executives discussing the everevolving air transport industry in one of the fastest growing region of the world. The second session highlights airport productivity with the presentation of the annual ATRS Airport Benchmarking Awards. The third session involves a panel of top airport executives discussing best practices in airport management. \nIn addition, nearly 200 participants will present papers on current aviation research topics. \nSpecial sessions will be held on Singapore's air logistics, with panelists from the Asian air cargo industry, as well as a session on measuring aviation system performance with the cooperation of the US Federal Aviation Administration. Selected papers presented at the Conference will be published in special issues of leading transportation research journals. \n“As a growing centre of excellence for aviation knowledge, Singapore seeks to advance exchanges, research and thought leadership towards the development of international civil aviation. We are therefore pleased and honoured to host the 19th World Air Transport Conference, a key event of the notable Air Transport Research Society. This Conference provides an excellent platform for the sharing of insights and ideas from research into various aviation fields and issues that will benefit the global aviation community. This includes adopting best practices, improving performance and even changing paradigms for the overall enhancement of the international aviation system.” said Mr Yap Ong Heng, Director-General, Civil Aviation Authority of Singapore. \n“The Air Transport Research Society is the world’s largest association of researchers in the aviation field. We are excited to be in Singapore this year for our 19th World Conference, hosted by one of the world’s leading aviation training centers, the Singapore Aviation, and by one of the world’s top universities, the National University of Singapore. \nTopics covered range from airport operational strategies to safety and security. Moreover, the conference provides delegates with an excellent opportunity to network with other researchers from around the world as well as with key industry executives.” said Professor Martin Dresner, President and CEO of ATRS.", "external_links": [], "published": "2015-07-03T06:26:00.000+03:00", "crawled": "2015-07-03T06:42:43.000+03:00", "highlightTitle": ""}