{"organizations": [], "uuid": "913c9b335dec290a7482aab5dc45399c36458042", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/07/17/sw-ruins-art-g5j12f1r1-1mesa-verde.jpg", "site_section": "http://dispatch.com//content/syndication/lae_travel.xml", "section_title": "The Columbus Dispatch Travel Feed", "url": "http://www.dispatch.com/content/stories/travel/2015/07/19/1-ancient-americans.html", "country": "US", "title": "Southwest sites yield both clues and questions about ancient Americans", "performance_score": 0, "site": "dispatch.com", "participants_count": 0, "title_full": "Southwest sites yield both clues and questions about ancient Americans", "spam_score": 0.0, "site_type": "news", "published": "2015-07-19T12:00:00.000+03:00", "replies_count": 0, "uuid": "913c9b335dec290a7482aab5dc45399c36458042"}, "author": "", "url": "http://www.dispatch.com/content/stories/travel/2015/07/19/1-ancient-americans.html", "ord_in_thread": 0, "title": "Southwest sites yield both clues and questions about ancient Americans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Southwest sites yield both clues and questions about ancient Americans \nIF YOU GO Seeing the Southwest ruins of Ancestral Puebloans gives an appreciation for the history of the country. For more information: 1. Grand Gulch, Utah: blm.gov 2. Mesa Verde National Park, Colo.: nps.gov/meve 3. Chaco Culture National Historical Park, New Mexico: nps.gov/chcu Travel Enlarge Image Request to buy this photo Eunika Sopotnicka | Deposit Photos The Ancestral Puebloans lived in the cliff dwellings of Mesa Verde National Park, Colo., hundreds of feet above the canyon floor. By Brad Branan THE SACRAMENTO (Calif.) BEE • Sunday July 19, 2015 5:00 AM \nGRAND GULCH, Utah — As the setting sun turned the red rock of southern Utah to a deepening shade of pink, I set up camp below an ancient ruin tucked high into a cliff. My tent raised, I enjoyed a hot pasta dinner while contemplating what looked like a house 70 feet above where I sat. \nI wondered about the people who lived there roughly 1,000 years ago: Why did they live on a cliff? How did they get up and down? What drove them away? \nDuring a 10-day road trip in October, I visited three of the country’s best-known ancient archaeological sites: Chaco Culture National Historical Park in northwestern New Mexico, Mesa Verde National Park in southwestern Colorado and Utah’s Grand Gulch, a federally managed wilderness area. \nThe ruins provide clues about the Ancestral Puebloans, who preceded the Pueblo, Hopi and other Southwestern U.S. tribes, and who built towns with elaborate architecture, farms and places of worship. \nOr so the experts say. \nThe Ancestral Puebloans — also known as the Anasazi — had no written language, leaving anthropologists and archaeologists to pore over the ruins and relics and make educated guesses about their lives. Some facts are fairly well-established, such as the abandonment of Chaco and Mesa Verde about 800 years ago. Others are contested, such as how many people lived there and what their lives were like. \nThe lack of solid answers adds to the mystery of these lost communities, encouraging visitors to explore and ponder the possibilities. \nI followed the path of Richard Wetherill, a Mancos, Colo., rancher whose family became intrigued with ruins in the late 19th century when he saw the cliff dwellings in nearby Mesa Verde. \nThe ruins were largely unknown to white Americans when the Wetherill family began exploring them, said Fred Blackburn, a former Grand Gulch ranger who has written books about the family and Southwest archaeology. Wetherill’s father tried to persuade the Smithsonian to send experts to inspect the sites, to no avail. \nThe Wetherills “lacked a prejudice toward Indians because of their Quaker beliefs,” Blackburn said. “Because they could better relate to the Indians, they were brought to the ruins.” \nRichard Wetherill persuaded people to participate in the first major excavations of Mesa Verde, Grand Gulch and Chaco Canyon. A director of Harvard University’s natural history museum once hailed Wetherill’s work as “the most far-reaching single event in Southwestern archaeology.” \nBut because he sold artifacts and wasn’t a scientist, Wetherill was derided as a “pot hunter” who was in it only for the money, Blackburn said. Such claims led the federal government to halt his excavation at Chaco Canyon and to pass the American Antiquities Act in 1906. The law made it a crime to take relics from archaeological sites. \nThe negative characterizations of Wetherill persist despite efforts by Blackburn and other writers to set the record straight. Wetherill sold relics to museums for public benefit, in keeping with his traditions as a Quaker, Blackburn said. \n“Richard was an adventurer, a thinker, and he was trying to understand this culture,” Blackburn said. Mesa Verde \nOf the three archaeological sites I visited, Mesa Verde is the most restricted, owing to the large number of visitors, the fragile condition of the structures, and their importance to American archaeology. Two of the best-known ruins in Mesa Verde — Balcony House and Cliff Palace — can be seen only on ranger-guided tours and are closed several months a year. \nThe cliff dwellings are arguably the most striking ruins in the Southwest. They resemble small villages tucked into large crevices on valley walls hundreds of feet above the canyon floor. \nWhile it appears as if some of the dwellings were accessed from hand- and footholds carved into the cliff walls, just how people got up and down the cliffs remains a question, like so much else about them. \nPerhaps the essential question: Why did they live in the cliffs? \nOn my tour of Cliff Palace, a ranger explained that the Ancestral Puebloans probably sought to insulate themselves from the extremes of summer and winter weather. He cautioned, however, that this was only an interpretation. He said the dwellings went beyond mere shelter, pointing to the plaster and decorative designs on the wall of one room. Chaco \nWhat is most compelling about the Chaco ruins is their size. The best-known sites, Pueblo Bonito and Chetro Ketl, are each about the length of a city block. Each is a collection of rooms and courtyards that still inspire awe, despite hundreds of years of decay. \nPueblo Bonito is the largest of Chaco’s 13 ruins and once stood four stories high. \nThe buildings encompass more than 350 ground-floor rooms and are distinguished by fine masonry — tiny pieces of rock were mortared with larger ones, making the walls strong enough to stand for hundreds of years. \nPerhaps the most distinctive feature of Pueblo Bonito specifically and Ancestral Puebloan architecture in general is the kiva, a circular room that some experts say served as a ceremonial gathering place. A kiva had a hole in the roof through which people entered, and a hole in the ground (a sipapu ) from which their mythical ancestors appeared, according to the Hopi Indians who use kivas today. \nPueblo Bonito, Chetro Ketl and other ruins at Chaco are called “great houses,” reflecting a long-held belief that they were basically large apartment buildings. \nBut some scholars contend that Chaco served as a ceremonial center and few people actually lived there. \nWetherill’s grave site is a short distance from Pueblo Bonito. He was killed by a Navajo man who lived in the area. Grand Gulch \nWhile it’s hard to match the impressiveness of the ruins in Mesa Verde and Chaco Canyon, nothing beats finding archaeological sites on your own. No place offers more opportunities for such exploration than Grand Gulch. \nOverseen by the federal Bureau of Land Management, Grand Gulch offers a history of the ancient Pueblo people that no museum can match. It contains dozens of archaeological sites that are pretty much left in their natural surroundings. \nThe Bureau of Land Management limits the number of overnight permits in Grand Gulch, but I had no problem getting a permit in November. Permit-holders are required to watch a 30-minute video that instructs them to not disturb the ruins or take any potsherds. \nThere are many canyons with ruins in Grand Gulch, which is part of the bureau’s Cedar Mesa area. I backpacked the most popular route, going through Grand Gulch and exiting Bullet Canyon, a 25-mile hike that took three days. The trails in Grand Gulch are not highly maintained. Dense brush, rocks, canyon walls and dry waterfalls can make the going slow. A lack of reliable water sources means you should carry as much as you will need to drink. \nStill, the pleasures more than outweigh the difficulties. Seeing undisturbed ruins, with names such as Turkey Pen Ruin and Perfect Kiva, can be a transforming experience and bring you closer to a distant past.", "external_links": [], "published": "2015-07-19T12:00:00.000+03:00", "crawled": "2015-07-19T13:13:32.093+03:00", "highlightTitle": ""}