{"organizations": ["Argyll", "Argyll Walking Holidays"], "uuid": "49a85c1c795d4fc1d1b865ca6ec225f09db8c939", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.webwire.com", "main_image": "http://photos.webwire.com/prmedia/28691/198621/198621-1-m.jpg", "site_section": "http://rssfeeds.webwire.com/WebWire-News-Travel", "section_title": "WebWire | News by Industry : Travel Industry", "url": "http://www.webwire.com/ViewPressRel.asp?aId=198621", "country": "US", "title": "About Argyll Walking Holidays Announces 2016 Programme", "performance_score": 0, "site": "webwire.com", "participants_count": 0, "title_full": "About Argyll Walking Holidays Announces 2016 Programme", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T13:18:00.000+03:00", "replies_count": 0, "uuid": "49a85c1c795d4fc1d1b865ca6ec225f09db8c939"}, "author": "", "url": "http://www.webwire.com/ViewPressRel.asp?aId=198621", "ord_in_thread": 0, "title": "About Argyll Walking Holidays Announces 2016 Programme", "locations": ["Scotland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wire Service About Argyll Walking Holidays Announces 2016 Programme Specialised guided walking holiday company About Argyll Walking Holidays have launched their programme of walks in Scotland for 2016. And as an incentive to prospective clients, About Argyll offers an early booking discount. Scotland – WEBWIRE – Wednesday, July 01, 2015 Hiking on the Mull of Oa, Isle of Islay, Scotland \nP { margin-bottom: 0.21cm; }Specialised guided walking holiday company About Argyll Walking Holidays have launched their programme of walks in Scotland for 2016. And as an incentive to prospective clients, About Argyll offers an early booking discount. Anyone booking before 1st October 2015 will receive a 6% off the price of their holiday. There is also a 3% early booking discount if the trip is booked before 1st February 2016. Plus, there is an additional 3% discount if the client has walked with About Argyll Walking Holidays before.About Argyll offer guided hiking and walking trips all over Scotland, with walks chosen not only for their breathtaking scenery and abundant wildlife, but also for historical, archaeological and geological interest. Expert guides with superb local knowledge take the hiker off the beaten track to explore Scotlands hidden and secret corners, to places often overlooked by most independent visitors.Frieda Bos, owner of About Argyll Walking Holidays said: We are pleased to announce that, as well as our existing range of trips, 2016 will see the addition of a brand new luxury walking tour which will explore the Morar Peninsula and the Isle of Skye. Its a wonderful opportunity to walk this most beautiful part of Scotland.Full details can be found at www.aboutargyll.uk \n( Press Release Image: http://photos.webwire.com/prmedia/28691/198621/198621-1.jpg )", "external_links": [], "published": "2015-07-01T13:18:00.000+03:00", "crawled": "2015-07-01T22:51:39.000+03:00", "highlightTitle": ""}