{"organizations": [], "uuid": "8f9a7d89f435f7a542f5b8d11e9c069db3df440f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/04/Silversea-Cruises.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/cruise/", "section_title": "Cruise News| Online Cruise Industry News| Cruise Market Trends | Cruise Business News| Travel Industry NewsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/silversea-cruises-announces-new-ship-silver-muse-arriving-spring-2017/", "country": "US", "title": "Silversea Cruises Announces New Ship — the Silver Muse, Arriving Spring 2017 - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Silversea Cruises Announces New Ship — the Silver Muse, Arriving Spring 2017 - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "8f9a7d89f435f7a542f5b8d11e9c069db3df440f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/silversea-cruises-announces-new-ship-silver-muse-arriving-spring-2017/", "ord_in_thread": 0, "title": "Silversea Cruises Announces New Ship — the Silver Muse, Arriving Spring 2017 - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Silversea Cruises Announces New Ship — the Silver Muse, Arriving Spring 2017 Published on : Friday, July 3, 2015\nSilversea Cruises is happy to announce their new flagship, the Silver Muse, to be delivered in the spring of 2017. The new ultra-luxury ship is being built by Fincantieri and at 40,000 grt accommodates 596 guests, representing an exciting evolution of the Silver Spirit that will redefine ultra-luxury ocean travel, enhancing the small-ship intimacy and spacious all-suite accommodations that are the hallmarks of the Silversea experience.\nThe addition of the Silver Muse will expand Silversea’s fleet to nine ships, and will once again significantly raise the bar in the ultra-luxury cruise market with a wealth of enhancements to the onboard experience, while satisfying the uncompromising requirements for comfort, service, and quality of the world’s most discerning travellers.\n“We have always had a special relationship with Fincantieri, since my father ordered from them the first cruise vessels for Sitmar Cruises in 1987,” said Manfredi Lefebvre d’Ovidio, chairman of Silversea. “Both companies have a clear understanding of what today’s affluent traveller seeks, and each approaches the market with originality, creativity, and quality. The management team led by Giuseppe Bono has been exceptional in managing Silversea’s project.”\nAccording to Enzo Visone, Silversea’s CEO, “With enhanced design specifications and enriched content, the Silver Muse will continue to build on the sophistication, innovative style and ground-breaking concepts for which Silversea ships are renowned. This ship contributes to our ambitious growth plans that will ensure our continued leadership in ultra-luxury cruising.”\n“We’re very pleased to once again partner with Silversea,” commented Giuseppe Bono, CEO of Fincantieri. “Silversea has shown remarkable dynamism and ability to achieve important results in this market. This project offers us the opportunity to develop creative solutions and set new standards for shipbuilding in the ultra-luxury segment, a segment in which Fincantieri has won every new order on the market in the past year.”\nAdditional details and specifications on the new ship will be announced in the near future.\nRelated Posts TripAdvisor touches mark of 100 million downloads for free app for iPhone and Android Amawaterways Introduces More Opportunities dor Solo Travelers Jason Pomeranc, hotelier announces launch of new brand of hotel Sixty Hotels Helsingborg Launches Destiantion Video Silversea Cruises launched its multi-lingual official website", "external_links": [], "published": "2015-07-03T03:00:00.000+03:00", "crawled": "2015-07-04T03:58:47.000+03:00", "highlightTitle": ""}