{"organizations": [], "uuid": "801605d654556b2d39c24559471ccac0840925c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25456", "country": "", "title": "SACEOS expands professional education reach in China and region", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "SACEOS expands professional education reach in China and region", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "801605d654556b2d39c24559471ccac0840925c9"}, "author": "Caroline Boey, Singapore", "url": "http://www.ttgasia.com/article.php?article_id=25456", "ord_in_thread": 0, "title": "SACEOS expands professional education reach in China and region", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SACEOS expands professional education reach in China and region Caroline Boey, Singapore \nFOLLOWING its partnership with the Shanghai Municipal Tourism Administration (SMTA) to conduct two professional education programmes during the city’s Business Events Week in April, the Singapore Association of Convention and Exhibition Organisers and Suppliers (SACEOS) is moving into Kunming next. \n\nIn Shanghai, SACEOS provided corporate travel and association meetings professional education to 40 and 30 MICE practitioners respectively. \n\nSACEOS education chair, Ong Wee Min, said the partnership with SMTA in Shanghai was a “dipstick” and there would be further development in China. \n\nLilian Kuan, SACEOS executive director, announced new MOUs to provide professional education to MICE professionals in Kunming have been signed. \n\nKuan noted: “MOUs have been signed with the China Council for the Promotion of International Trade Yunnan Sub-Council and the Kunming Exposition Affairs Bureau.\" \n\n“SACEOS will be providing PEM (Professional Exhibition Management) education (with continuing education unit credits) for 30 people,” she said. Dates for the programme in fall have not been fixed. \n\nApart from China, SACEOS president Janet Tan-Collis named Malaysia, Macau, Thailand and India as professional education partners. \n\n“We signed an MoU with MACEOS (Malaysia Association of Convention and Exhibition Organiser and Suppliers) two months ago to conduct a train-the-trainer programme,” she said. \n\nIn Singapore, the number of MICE professionals with CMP (Certified Meeting Professional) accreditation has doubled from 15 last year to 30 this year, which Ong notes is the largest concentration outside the US and Australia. \n\nHe added: “The focus of SACEOS continues to be professional development. So far we have targeted our members in Singapore for CMP accreditation. Next, we will be reaching out to the hotels and other sectors. \n\n“Our goal for Singapore is to have 100 CMPs by mid-2016,” Ong said, adding it is not an ambitious target.", "external_links": [], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-09T09:36:27.000+03:00", "highlightTitle": ""}