{"organizations": [], "uuid": "07be67237d9d33333f2e75f6b688e59c64526799", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "lagalog.com", "main_image": "", "site_section": "http://lagalog.com/feeds/posts/default", "section_title": "lagal[og] - Philippines Travel & Photography Blog", "url": "http://lagalog.com/2015/07/maligcong-hiking-mt-fa-to-and.html", "country": "US", "title": "Maligcong Mountain Province: Hiking Mt. Fato and traversing to Mt. Kupapey, From Sea of Clouds to Sea of Green", "performance_score": 0, "site": "lagalog.com", "participants_count": 1, "title_full": "Maligcong Mountain Province: Hiking Mt. Fato and traversing to Mt. Kupapey, From Sea of Clouds to Sea of Green", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T23:23:00.000+03:00", "replies_count": 0, "uuid": "07be67237d9d33333f2e75f6b688e59c64526799"}, "author": "noreply@blogger.com (Oggie Ramos)", "url": "http://lagalog.com/2015/07/maligcong-hiking-mt-fa-to-and.html", "ord_in_thread": 0, "title": "Maligcong Mountain Province: Hiking Mt. Fato and traversing to Mt. Kupapey, From Sea of Clouds to Sea of Green", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Contact Me Monday, July 6, 2015 Maligcong Mountain Province: Hiking Mt. Fato and traversing to Mt. Kupapey, From Sea of Clouds to Sea of Green My guide, Tina, foraging early in the fern-filled summit of Mt. Fa-to I couldn't really sleep. At the back of my head, Suzette , Tina and I were set to hike up eastwards to another fantastic (I hope) vantage point in a few more hours. By some strange clockwork, cows would come passing by the road every 1-1:30am, waking up the neighborhood dogs -- that includes our resident canine, Kunig , who would otherwise be snoozing at the corner of my room or underneath the adjacent bed. Some neighbors would also wander up the road for their turn at getting their water supply (filling out their tanks for the day ahead) after midnight and wake up the dogs. I'll rouse time and again, my trusty Nitecore torch in hand, to see who/what's up and about when the rest of the town seems to be asleep. Graphic from EarthSky.org Maybe I did get in an hour of shallow sleep (maybe) but around 3:15am, I just made up my mind and go out to the yard and let the darkness seep in. The fireflies were still hanging around their favorite bamboo thickets, in itself a magical, haunting, scenery. The night sky had a touch more cloudiness than in the past two nights but it was still a sight to behold. It seemed where there are no clouds, stars would just cram and ornament the space. Should I just say the view was sublime and humbling? Even merely washing my hands in the outdoor sink became a treat as I can see Jupiter and Venus to the west, hanging like bright beacons that outshone their more distant fellow luminaries. I recognized them outright since I caught a bit of this and other planetary alignment news in a favorite YouTube channel, Suspicious Observers . (Read about it also in this EarthSky.org link ) Rocks, pines, mountains and a sea of clouds atop Mt. Fato We set of at 4:30am, treading on a dirt trail that's overgrown. Either no one passed through in long while or that the occasional rains have goaded the forest to grow back what has been bushwhacked weeks earlier. Most likely, it was both. Even if I seemed to be sleep-hiking my way up Mt. Fato , I can certainly feel the pleasant familiarity of being in a mountain's embrace. There's nothing more intoxicating to me than being wrapped in the sweet odor of wet, dewy grass as I step on/tread on/pass/claw my way through the vegetation this early in the morning. The sun was up very early at this time of year, the sky lightening up even before we made it to a high-enough clearing. By the time we got to the summit, about an hour of hiking later, the sun was already a bit bright, lending a warm hue to the sea of clouds draping over the Dalican and Guina-ang terraces, and Sagada farther out southeast. Mt. Fato got its name from the rocks (Filipino translation: bato ) and boulders that crown its summit. At the very top, there's a pinnacle that rises above the pine trees and gives one an unobstructed 360º view. Even Kunig, who also had little sleep, seemed to be awed by the sight. Tina, our guide from way back my first visit, pointed out the head of the Sleeping Beauty mountain range all the way in Tinglayan, Kalinga to the east near where the sun rose. To the southeast, there's Sagada town, dotted by houses and structures. Nearer and seemingly just down the mountain were the beautiful rice terraces of Guina-ang, accessible thru a trail going down and is reachable in a few hours of hiking. An undulating abstract pattern sea of green from Mt. Kupapey Tina asked me if I'm not that hungry to consider a mini-traverse going via the old Spanish trail to the other vantage point, on Mt. Kupapey . I was more sleepy than hungry so off we went as the two ladies, armed with machetes, bushwhacked their way through the overgrown trail, punctuated by felled trees abandoned by their sawyers. In these parts, residents and locals are allowed to cut off trees only if they would use the wood for building their houses. At the same time, Suzette and Tina were foraging for wild mushrooms, their trained eyes spotting the often small fungal growths under fallen leaves, around pine tree roots, even those on the precarious slopes. They collected a large plastic bag of the fungus, some of which I'd get to taste in the next few days. Occasionally, an impatient Kunig would wander ahead and we'd lose sight of him. He'd bark loudly somewhere distant and we'd know he's playing chase-me with the cows and carabaos grazing on those treacherous slopes like it's a game. I'd worry about him time and again but Tina would dismiss the notion, reminding me that this is is after all his playground. She was right - we'd more probably get lost out here but not him. Maligcong Route Map © Oggie Ramos It was growing progressively hotter by the time we got to Mt. Kupapey at around 11am but it was certainly more pleasant hiking here than walking on the main Bontoc town which was at least 1,200 feet lower and consequently, hotter. From the sea of clouds we've seen atop Mt. Fato, we were now greeted by a sea of green terraces. Two months ago, these fields were filled with water, now these are teeming with month-old rice plants. Tina brought out our lunch, canned tuna, boiled eggs and mountain rice. Maybe nothing special on the lowlands but up here, it is a treat. I ate greedily with my bare hands and shared some (half?) of my food and water with our always-hungry canine. By almost high noon, we got down to the terraces with the relative heat making me decide to defer hiking an hour or so more to an organic farm on the other side of the mountain to a later date (a blessing in disguise really as Tina would later tell me that the farm/garden will be ready for viewing much later in the year or probably next year though an organic farm in the area would be an interesting destination). I dropped by the only sari-sari (variety) store in town on the way back to the homestay to celebrate with a Coke and coconut cookies which I shared with Suzette and Kunig. Then it's off to a bath and dreamland for the rest of the afternoon, with Kunig already snoring in the corner of my room even before my back laid flat on the bed.", "external_links": [], "published": "2015-07-05T23:23:00.000+03:00", "crawled": "2015-07-06T08:32:35.000+03:00", "highlightTitle": ""}