{"organizations": [], "uuid": "7aa66d1090ea0dc679d0bb6c3e66baed7bc12310", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/07/02/8c/68/bugfest-divers.jpg", "site_section": "http://www.palmbeachpost.com/s/travel/", "section_title": "Florida Travel | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/travel/florida-travel-specials-festival-celebrates-lobste/nmqr3/", "country": "US", "title": "Florida travel specials: Festival celebrates lobster mini-season", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Florida travel specials: Festival celebrates lobster mini-season | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T15:40:00.000+03:00", "replies_count": 0, "uuid": "7aa66d1090ea0dc679d0bb6c3e66baed7bc12310"}, "author": "Mary Thurwachter", "url": "http://www.palmbeachpost.com/news/travel/florida-travel-specials-festival-celebrates-lobste/nmqr3/", "ord_in_thread": 0, "title": "Florida travel specials: Festival celebrates lobster mini-season", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lobster mini-season approaches, and that means it’s time for BugFest-By-The-Sea, a weeklong series of events, contests and seminars for scuba divers. Set for July 25 through Aug. 1, the 4th Annual BugFest will give away $15,000 in cash, dive gear and other great prizes.\nThe cost to register for the Bug Hunt is $20, and divers can catch spiny lobster anywhere off Palm Beach, Broward or Miami-Dade counties. The daily bag limit north of the Keys is 12 bugs (mini-lobster) per day per diver.\nBesides diving for lobster, BugFest includes a two-dive wreck diving workshop, a bug hunting seminar, mini-season kickoff party, photo contest, pier and beach clean-up, barbecue and a free Scuba Cowboy concert. Contributed Besides hunting for lobster, BugFest includes a two-dive wreck diving workshop, a bug hunting seminar, mini-season kickoff party, photo contest, pier and beach clean-up, barbecue and a free Scuba Cowboy concert.\nHotels in Lauderdale-By-The-Sea, which hosts the event, are offering 10 percent discounts off already reduced summer rates.\nFor more information, visit www.lbtsevents.com/bugfest-by-the-sea .\nSummer savings abound at The Breakers this summer. Kids can cool off in the pool or in the ocean. LILA PHOTO ISLAMORADA\nA tranquil escape\nSummer rates start at $179 a night with a two-night stay minimum at the all-suite La Siesta Resort. Known as the hidden hideaway of the Florida Keys, La Siesta offers bike riding, swimming, boating and snorkeling.\nSnorkel or sunbathe at the all-suite La Siesta Resort. It’s known as the hidden hideaway of the Florida Keys. Contributed There are a variety of suite styles to choose from, each with amenities including complimentary kayak rentals, bikes and fishing equipment, and more.\nTo book the Escape to Islamorada package, visit www.lasiestaresort.com .\nPALM BEACH\nYou’re guaranteed a great waterview at Waterstone Resort & Marina in Boca Raton. The resort is offering a summer special to go with affordable off-season rates. Contributed Take a break at The Breakers\nOff-season rates and special package deals make summer a good time to vacation at The Breakers.\nThe 5-star hotel’s summer promotion includes a $50 nightly resort credit for two-night stays and longer; the credit can be used for dining at eight distinctive restaurants and bars, spa services and various other activities.\nThe promotion also includes complimentary “Everyday Summer Benefits” for guests such as kids’ menu meals (for ages 12 and younger at all restaurants), access to the new Ocean Fitness facility, unlimited group fitness classes, unlimited tennis court time (10 Har-Tru courts, lit for night play), Wi-Fi and local calls.\nSavings also are available for golf, tennis and lessons for both; kids’ camp and daily rentals of poolside bungalows; plus special offers at select restaurants, bars and on-site boutiques.\nSummer weekday room rates (Sunday-Thursday) start at $349 per room, per night, and begin at $449 per night on weekends (Friday/Saturday).\nFor reservations or more information, call at 855-313-8851 or visit www.thebreakers.com/florida_vacation_packages .\nBOCA RATON\nSplash into summer with savings\nWaterstone Resort & Marina has a Summer Escape Package that includes accommodations with a water view, $25 daily food and beverage credit, free overnight parking, 20 percent off watersport rentals, premium streaming Wi-Fi. That translates to a daily savings of up to $60.\nWhether for family-fun, summer romance, or a girls’ weekend, Waterstone Resort & Marina’s ‘Summer Escape Package’ is ideal for Florida residents looking to find the perfect weekend adventure. For more information, visit www.waterstoneboca.com .\nFLORIDA\nTwo organizations link to boost hospitality industry\nThe Florida Restaurant and Lodging Association and the Florida Bed and Breakfast Inns Association have formed a partnership to boost hospitality industry advocacy, education and promotion in the Sunshine State.\nThe collaboration joins two nonprofits aimed at developing unique guest experiences, safeguarding the needs of the industry and attracting visitors to Florida.\nFor more information on FRLA, visit www.frla.org . For details about FBBI, visit www.florida-inns.com .\n</span", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/07/02/5d/51/Waterstone.jpg", "http://www.thebreakers.com/florida_vacation_packages/", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/07/02/8c/68/bugfest-divers.jpg", "http://www.lbtsevents.com/bugfest-by-the-sea", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/07/02/65/6e/Kids-Tubing-at-Breakers.jpg", "http://www.lasiestaresort.com/", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/07/02/c8/aa/La-Siesta-Resort.jpg"], "published": "2015-07-05T15:40:00.000+03:00", "crawled": "2015-07-05T22:15:32.000+03:00", "highlightTitle": ""}