{"organizations": [], "uuid": "7e8708f11d3133877e7f4ad6dbcac71ef5ff10bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25400", "country": "", "title": "Tourism the winner from 2 major sporting events hosted in Australia", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "Tourism the winner from 2 major sporting events hosted in Australia", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "7e8708f11d3133877e7f4ad6dbcac71ef5ff10bc"}, "author": "Rebecca Elliott, Melbourne, July 1, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25400", "ord_in_thread": 0, "title": "Tourism the winner from 2 major sporting events hosted in Australia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tourism the winner from 2 major sporting events hosted in Australia Rebecca Elliott, Melbourne, July 1, 2015 \nTHE AFC Asian Cup and ICC World Cricket Cup hosted in Australia in January and February to March respectively, provided a major boost to the country's visitor numbers and profile, according to Tourism Australia. \n\nSpeaking at a media conference at the Australian Tourism Exchange (ATE) in Melbourne last week, Tourism Australia’s managing director John O’Sullivan said the AFC Asian Cup exceeded all expectations, with ticket sales reaching A$20 million (US$15.3 million) and a 15 per cent jump in arrivals. \n\n“We saw increased growth out of Japan and South Korea, two markets that have not enjoyed the same growth rates as other Asian markets in recent times,” he said. \n\n“Furthermore, the broadcast of the tournament reached an audience of 2.5 billion viewers helping to put our country top of mind in our most significant markets in Asia.” \n\nO’Sullivan also said that the latest arrivals figures released by the Australian Bureau of Statistics had recorded a 46 per cent increase in the number of visitors from India during the month of March. Australia’s High Commission in India also found a 37 per cent increase in visa applications in January. \n\nIn addition, India’s MakeMyTrip.com reported overall growth of almost 50 per cent for February and March. \n\nReflecting on sporting events such as the Commonwealth Games to be held in Gold Coast in 2018, O’Sullivan said: “These are all events which typically attract international visitors who stay longer, travel further and spend more. \n\n“That’s a real sweet spot for any NTO and why we’re so focused upon developing a targeted event strategy to maximise the tourism potential and economic return of Australia's year round calendar of top-quality events.”", "external_links": [], "published": "2015-07-01T03:00:00.000+03:00", "crawled": "2015-07-01T17:37:18.000+03:00", "highlightTitle": ""}