{"organizations": [], "uuid": "facf2fd65713c35a3ffa687308ec3bf4bf963e1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/05/29/Style/Images/ximena1.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel: Travel News, Guides, Deals, Hotels, Vacation Ideas &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/entertainment/music/ximena-sarinana-finds-her-happy-middle-ground/2015/07/03/9c1db6e4-218e-11e5-84d5-eb37ee8eaa61_story.html", "country": "US", "title": "Ximena Sariñana finds her happy middle ground", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Ximena Sariñana finds her happy middle ground - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "facf2fd65713c35a3ffa687308ec3bf4bf963e1a"}, "author": "By Julyssa Lopez", "url": "http://www.washingtonpost.com/entertainment/music/ximena-sarinana-finds-her-happy-middle-ground/2015/07/03/9c1db6e4-218e-11e5-84d5-eb37ee8eaa61_story.html", "ord_in_thread": 0, "title": "Ximena Sariñana finds her happy middle ground", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mexican singer-songwriter Ximena Sariñana. (Courtesy of Seitrack US) By Julyssa Lopez July 3 at 8:30 PM Mexican singer Ximena Sariñana started off soulful, then she tried some sugar-sweet pop. Now, with the help of the synths and electro spark she brought to U Street Music Hall on Thursday night, she’s showing that her new sound falls somewhere in the middle — and that might just be her groove.\nSariñana rose to fame as a child actress in Mexico. (Telenovela watchers might remember her as the spoiled little rich girl from the ’90s soap “Luz Clarita.”) She contributed to a few soundtracks growing up and surprised both audiences and critics after recording her precocious debut album, “Mediocre.” The 2008 release won her Grammy and Latin Grammy nominations.\nAlthough she tried her hand at English songwriting for her sophomore effort, the bilingual performer reverted to Spanish for her latest album, “No Todo Lo Puedes Dar” (“Not All Can Be Given”). The songs come with a post-heartbreak bleakness, as they were written after she parted ways with Mars Volta frontman Omar Rodríguez-López, but they’re infused with some upbeat, dance-driven energy that Sariñana credits to the album’s production, a lot of which she did herself.\nIt could also be that she’s been hanging out with her opening act Alex Ferreira, a Dominican musician and synth enthusiast whose new album is what you’d play at an ’80s party on a Caribbean island. It’s sparkly dream pop with a tropical beat, and Ferreira used it Thursday night to get the crowd moving. He returned onstage after his set to cover lead guitar for Sariñana’s band.\nStanding together coolly — Ferreira shaking his big curly hair, and Sariñana waving her fringed kimono sleeves in the air — the two musical wunderkinds seemed to be giving the audience a tutorial on what the hipster effect looks like in Latin America. A mostly Spanish-speaking crowd cheered as the pair launched into “Parar a Tiempo,” a song that’s emblematic of Sariñana’s new, more contemporary sound: It twinkles delicately before falling into a robotic, bass-heavy stride. Amid the tinny chimes and fuzzy synths, Sariñana’s voice soared effortlessly — deep and sonorous as ever.\nThat voice is why people were there, after all. She might be trying an edgier version of herself, but the 29-year-old reminded everyone of her stunning vocal range when she belted out the wailing choruses of “Mediocre” and “Monitor” off her first album. Still, her greatest moments were the upbeat ones, when she’d awkwardly — but lovably — jam out and fling her alabaster limbs toward Ferreira. His warbling guitar added some grit to poppy tunes such as “La Vida No Es Fácil” and “No Voy a Decir Que No.”\nWhen it was time for Sariñana’s scorned lover’s revenge anthem, “Sin Ti No Puede Estar Tan Mal,” the singer completely let go and jumped up and down while delivering rich, throaty vocals and hyping the crowd. For a girl whose album is called “Not All Can Be Given,” she certainly gives a lot.\nLopez is a freelance writer.", "external_links": [], "published": "2015-07-03T03:00:00.000+03:00", "crawled": "2015-07-04T04:00:18.000+03:00", "highlightTitle": ""}