{"organizations": ["Hindustan Times"], "uuid": "ec9453198c90084a9776bf8005561aae78bd0e11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2014/12/6a4a115b-2b87-424b-9e9a-332bfb1fed97MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Sexandrelationships", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/sexandrelationships/a-calmer-you-by-sonal-kalra-khush-toh-bohot-hogey-tum/article1-1365867.aspx", "country": "US", "title": "A calmer you by Sonal Kalra: Khush toh bohot hogey tum!", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "A calmer you by Sonal Kalra: Khush toh bohot hogey tum!", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T15:21:00.000+03:00", "replies_count": 0, "uuid": "ec9453198c90084a9776bf8005561aae78bd0e11"}, "author": "", "url": "http://www.hindustantimes.com/sexandrelationships/a-calmer-you-by-sonal-kalra-khush-toh-bohot-hogey-tum/article1-1365867.aspx", "ord_in_thread": 0, "title": "A calmer you by Sonal Kalra: Khush toh bohot hogey tum!", "locations": ["New Delhi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sonal Kalra", "Khush"], "text": "Sonal Kalra, Hindustan Times , New Delhi | Updated: Jul 04, 2015 17:56 IST When it comes to relieving stress, giggles and guffaws are just what the doctor orders (Photo: Shutterstock) \nThis world has two kinds of people, those who keep waiting for the right time to be happy, and those who… Chalo ji, tension over. I thought with life being so unpredictable, who knows till when will I get an opportunity to give you gyaan about ­calm-sutra.Let us, in one stroke, figure out the magic formula for happiness. I can see that some of you have already put the ­cynics’ cap on, and are rolling your eyes on this 243567th attempt by a self-help writer to tell you how to be happy. I wish I could humour your cynicism further by saying things like, ‘no one, but I, can teach you how to be happy’, but all that is bullshit and you know it. Calmness tips on how to be happy Nothing I ever say in this ­column is something you don’t already know. But you still read it, right? Please allow me to share the steps I followed to drag myself out of a phase where I was feeling a bit low and out of sync. Believe me, these five steps work, no matter what the nature or cause of your unhappiness is. Because my dearies, this formula focuses on the solution and not the ­problem. Instant satisfaction guaranteed. Please send Rs 1,000 by cash/cheque/Bank DD (It had anyway started to sound like an ad to cure impotency, so added that for effect :)). \n1 Check your surroundings: Close your eyes (not now, Einstein, after you finish ­reading the column) and think about the people you normally spend your day in the company of…colleagues, boss, classmates, Facebook friends. Ask yourself if you are spending your days being around people who are mostly happy. If the answer to that is no, please stand up. Bend your right leg backwards and raise it till your foot reaches the right level. Kick yourself in the a**. Heart patients and pregnant women, please abstain. Those who are planning to write to me saying it’s impossible to kick yourself over ‘there’, please remember that you will have to first admit that you actually tried it.Anyway, the point is this. Happiness is an infectious trait. You have to be around positive people to catch the right ­infection. If you are wasting away your time in the company of constant whiners and people who have nothing good to say about anyone or anything, you will, sooner or later, start to sound like them. Avoid. If you have to be physically around them out of compulsion, learn to switch off mentally at the very moment someone starts to say something negative. Start thinking about Rakhi Sawant saying she wants to marry Baba Ramdev, but remember to nod at frequent intervals, with an utterly serious expression, to not give it away. 2 Take the Joy-Test: Every Friday evening, take a piece of paper and on one side, make a list of problems you are going through. (Note: if your list mentions the word ­boyfriend/girlfriend more than twice, stand again and repeat the exercise you did in step 1, you loser!). On the other side, make a list of things that gave you joy in the past week. Simple pleasures like sharing a cup of coffee with an old friend from school and remembering the crush you both had on the ­biology teacher. Or indulging in that extra helping of French fries you had when no one else was looking. Sonal Kalra Or waking up to see that beautiful bird perched on your balcony at sunrise. For every two joys on your list, give yourself one mark. If the total number of joy-marks are more than the number of problems on your list, you have passed the joy test for the week. Treat ­yourself to something you really enjoy, on Saturday. Make it a rule to do this for six months and you’ll start adding more joys to make every Saturday of your life memorable. 3 Kill the ‘when’ word: The biggest rule in the happiness formula is simple — abhi nahi toh kabhi nahi. If you ever talk about being happy in a sentence, which has the word ‘when’ at the end, you’re not getting it right. ‘I’ll be happy ‘when’ — I will — get good marks, get admission, get a job, be rich, lose weight, get ­married, have babies, buy my dream car, get retired, blah, blah and blah.’ The moment you use the word ‘when’, you put a ­condition on your happiness. Since your mind is not your slave, it retaliates by ensuring that when you achieve any of these, the condition shifts to the next benchmark. Kill the when. Right now. 4 Try out something crazy, and new: If the first thought that came to your mind was ‘drugs’, I’m alarmed at what kind of weirdos read my column. It is a scientifically proven fact that doing ­something you’ve never done before releases happy hormones in your body. I checked it in my own state-of-the-art laboratory. And no, you don’t have to now suddenly think of bungee ­jumping or deep sea diving. Ek toh movies ne hamein bigaad diya hai. We don’t look at simpler things. How about spending an entire day-out, just with yourself. Go, watch a movie alone, then head off to the market and gift yourself something really nice, get into a restaurant and enjoy a lavish meal with a nice drink. For a lot of us, even that has never been tried before. We are too busy putting riders on our own enjoyment. Give yourself a break. 5 Infect others: If as per step 1, your happiness rests on ­having happy ­people in your life, surely you also have to be one such person for those who have you in their lives. Last week, I ­happened to be invited to a party where I did not really know anyone from before, except the host. I was ­obviously wary of spending much time in the company of people I hadn’t met before, and kept looking at my watch every five minutes, till I got ­introduced to this group of women who were laughing the loudest.They turned out to be so full-of-life and happy that the next time I looked at my watch, it was 4am. Happiness, as I said, is ­infectious. It would have been fairly easy for those women to have spent time cribbing about jobs, kids, mother-in-laws, weight … but they chose to spend time laughing and ­cracking jokes. If you spread laughter, God figures out a way to reward you by giving more reasons to laugh often. If you become the reason for someone else failing their joy-test, you are unlikely to pass yours for too long. Simple. Sonal Kalra has given kuchh zyada hi deep philosophy this time. What should be her punishment? Mail her at sonal.kalra@­hindustantimes.com or on Facebook at facebook.com/sonalkalra13.Follow on Twitter at twitter.com/sonalkalraOn popular demand, this is a re-run of a previous column. Tags", "external_links": [], "published": "2015-07-04T15:21:00.000+03:00", "crawled": "2015-07-05T09:43:39.000+03:00", "highlightTitle": ""}