{"organizations": [], "uuid": "a8c5abf4fe0f73e642ba5bba6289c8760b0f9f2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestar.com", "main_image": "http://www.thestar.com/content/dam/thestar/life/travel/2015/07/15/anything-is-possible/salento5.jpg", "site_section": "http://www.thestar.com/life/travel.html", "section_title": "Travel | Vacations, Destinations &amp; Reviews | Toronto Star", "url": "http://www.thestar.com/life/travel/2015/07/15/anything-is-possible.html", "country": "CA", "title": "Lecce, the Caribbean of Italy", "performance_score": 0, "site": "thestar.com", "participants_count": 1, "title_full": "Lecce, the Caribbean of Italy | Toronto Star", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "a8c5abf4fe0f73e642ba5bba6289c8760b0f9f2d"}, "author": "Jennifer Allford", "url": "http://www.thestar.com/life/travel/2015/07/15/anything-is-possible.html", "ord_in_thread": 0, "title": "Lecce, the Caribbean of Italy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Photos View photos zoom LECCE, SALENTO–“Just assume anything at all could happen pretty much at any time,” our guide says with a grin and a London accent as we walk the narrow ancient streets of Lecce, on our first night in Salento on the heel of the boot in Italy.\nThe caution wasn’t meant to be ominous — although he did warn us olives could have pits, even in bread. It was more a note to watch for the delightfully unexpected, such as the Friday night school band performances in the courtyard next to the Basilica di Santa Croce, the bride and groom wandering down Via Libertini on a Monday afternoon and the costumed flag throwers doing their thing in Piazza Sant’Oronzo.\nWhat’s no surprise is that Italians like to vacation here. It’s hot and there are beautiful beaches on either side of the boot—the Adriatic Sea on the east and the Ionian on the west. They call Salento the Caribbean of Italy. They call Lecce, the region’s main city, the Florence of the South because of all its baroque churches from the 1600s.\nBut unlike Florence, you don’t see hordes of international tour groups. Instead of marching after a guide holding a flag, you wander among the locals out for the “passeggiata,” an evening stroll through the centre of town. Families with little kids, old couples, teenagers; it seems all of Lecce’s 100,000 residents are out sitting on church steps eating pizza, enjoying gelato or watching the big soccer match on patios.\nAnd taking pictures for tourists. A dad offers to take a photo of me on my camera. I suggest his 11-year old daughter pose with me. She smiles a big smile and they slip me an email address to send them the photo. On a Sunday afternoon in Otranto on the Adriatic coast, Italian teenagers insist I stand in front of them to get a better view as a procession of townspeople and priests walk past, singing.\nIt’s easy to see why our guides Robert Collins and Lili Okuyama fell for Salento while visiting years ago. They decided to share their love of the region by touring other people around. Collins, a former music journalist with a dry British sense of humour loves history. Okuyama is of Japanese and Ukrainian heritage, speaks fluent Italian and has a knack for logistics. It’s a good pairing. Okuyama makes sure everyone’s on schedule and Collins tells us the stories in the stone.\nAt Lecce’s Basilica De Santa Croce in Lecce he points out St. Pablo sailing across sea using his cloak “wind-surf like.” Outside the Church of the Jesuits, he explains the lack of statutes in the enclaves was a tax dodge—you only had to pay taxes when the church was “complete.” He shows us the Roman amphitheatre uncovered by accident in the 1900s and we meet Oronzo, the Patron Saint of Lecce who came to a bad end: “Nero’s boys chopped his head off.”\nCollins also shows us stuff you won’t find in regular guide books. Like a ground floor window with a phallic looking grate that once advertised the brothel inside. Or the “spooky tree” behind La di San Giovanni Battista al Rosario. “I like that it looks like aliens,” he says looking up the centuries old tree that is indeed spooky looking.\nThey also share the friends they’ve made. Chef Gianna Greco teaches us to roll out orecchiette and after dinner we sing and dance with folk singers in the courtyard. We meet the family reviving traditional “terra” recipes like fried chickpea pasta and eggplant and mint at Alle Due Corti.\nWe enjoy the “taste of the house” along with locals on a Sunday lunch at an olive oil farm. “There are very few tourists here. That’s why we like it,” Collins says as we dig into platters of antipasti and penne tossed in olive pate.\nWe eat seafood in Gallipoli, go to a winery to taste local varietals like Primitivo and Negramaro and benefit from the couple’s extensive research into where to find the best gelato. Everywhere we go we feel the warmth of the land, its people and Salento’s little wonders.\nOne day, we’re all a little perplexed as a sudden blast of recorded music fills Lecce’s Piazza Sant’Oronzo. A young man tells us that every day at noon they play a little Tito Schipa, a beloved local opera singer who died in 1965. “I guess we haven’t been standing here right at noon before,” says Collins, thrilled that the unexpected has happened yet again.\nJust the facts:\nJennifer Allford is a freelance writer based in Calgary. Follow her on Twitter @JenniferAllford and read more at JenniferAllford.com. Jennifer was a guest of Espressino Travel and their partners which covered flights, accommodations and meals.\nKiller courtyard: We stay in Mantatelurè, a beautiful boutique guest house dating back to 1550 that’s tucked away on a narrow little street in Lecce. In the morning, we choose from a small buffet that includes loads of freshly baked goods we enjoy in a beautiful courtyard.\nMind the garlic: People in Salento don’t cook with both onion and garlic. You choose one or the other because using both would be too strong “for the digestion.” And, digest this: pepperoni isn’t a spicy sausage. It’s peppers.\nBring your bather: Swimming in the warm blue waters on either side of the boot is wonderful. But don’t be alarmed if you’re the only one moving. Many Italians like to just stand in the water to cool off.\n ", "external_links": ["http://static.freeskreen.com/publisher/52/freeskreen.min.js"], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T00:46:23.000+03:00", "highlightTitle": ""}