{"organizations": ["Amazon Dream", "Amazon PANDAW River Expeditions", "Amazon Pandaw River Expeditions"], "uuid": "aba2942e4645adc4c73afd73b4c4abd012ac993d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/135/590x/Amazon-Dream-river-cruise-boat-591438.jpg", "site_section": "http://www.express.co.uk/posts/rss/132/travel", "section_title": "Daily Express :: Travel Feed", "url": "http://www.express.co.uk/travel/cruise/591438/Pandaw-River-Expeditions-South-America-cruises-Amazon-Brazil", "country": "IE", "title": "Pandaw River Expeditions launches new South America cruises on the Amazon", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Pandaw River Expeditions launches new South America cruises on the Amazon", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T22:45:00.000+03:00", "replies_count": 0, "uuid": "aba2942e4645adc4c73afd73b4c4abd012ac993d"}, "author": "", "url": "http://www.express.co.uk/travel/cruise/591438/Pandaw-River-Expeditions-South-America-cruises-Amazon-Brazil", "ord_in_thread": 0, "title": "Pandaw River Expeditions launches new South America cruises on the Amazon", "locations": ["South America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pandaw River Expeditions launches new South America cruises on the Amazon Pandaw River Expeditions launches new South America cruises on the Amazon PANDAW River Expeditions has launched a new programme of South America cruises in partnership with the ship Amazon Dream. PUBLISHED: 20:45, Wed, Jul 15, 2015 | UPDATED: 20:57, Wed, Jul 15, 2015 PH The Amazon Dream carries just 18 passengers and is a comfortable base during the nine-night cruise \nIt is offering five special 14-night departures in 2016 exploring the lesser-visited region of the Amazon River from Santarem, where the Tapajos River and the Amazon meet. \nAs well as exploring Santarem, highlights will include visiting Maguari and Munduruku villages to meet the local communities, and relaxation time on the white sand beach at Alter do Chao, one of the best freshwater beaches in the world. Travellers will be able to discover the natural wonders of the great rainforest with its varied wildlife, flora and fauna Hugh Clayson, Pandaw’s commercial director \nHugh Clayson, Pandaw’s commercial director, said: “This is an exciting addition to the Pandaw partner programme, which also includes the Brahmaputra, Ganges and Hooghly in India and River Kwai in Thailand. \n“It has been introduced due to requests from Pandaw travellers, who will be able to discover the natural wonders of the great rainforest with its varied wildlife, flora and fauna. Like Pandaw expeditions in Asia, it will visit friendly local villages and discover the unique way of life of the people living on the Amazon.” \nThe Amazon Dream carries just 18 passengers and is a comfortable base during the nine-night cruise, which includes guided walking tours to see wildlife such as monkeys and birds including parrots. \nThere are also motorboat trips to observe crocodiles and pink dolphins in Maica Lake, canoe expeditions and night-time walks to listen to the jungle’s noises. GETTY The white sand beach at Alter do Chao is one of the best freshwater beaches in the world \nThe Amazon cruise is combined with three nights at a 5 star hotel on Copacabana beach in Rio de Janeiro, with an included excursion to Corcovado and Sugar Loaf Mountain. \nThere is also a two-night stay at the Hotel Das Cataratas next to the monumental Iguazu Falls on Argentina’s border with Brazil. After the cruise there is also the option of adding two nights in both Manaus and Salvador. Related articles", "external_links": [], "published": "2015-07-15T22:45:00.000+03:00", "crawled": "2015-07-16T07:29:49.000+03:00", "highlightTitle": ""}