{"organizations": [], "uuid": "c7b3ba079df81b30739306d8b3b16a8216b329ac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03366/boyspaulcooper_3366522k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-11.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11720344/This-river-used-to-be-deadly.-Now-its-a-tourist-attraction.html", "country": "US", "title": "This river used to be deadly. Now it's a tourist attraction", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "This river used to be deadly. Now it's a tourist attraction - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T16:01:00.000+03:00", "replies_count": 0, "uuid": "c7b3ba079df81b30739306d8b3b16a8216b329ac"}, "author": "Andrew Griffiths", "url": "http://www.telegraph.co.uk/goodlife/11720344/This-river-used-to-be-deadly.-Now-its-a-tourist-attraction.html", "ord_in_thread": 0, "title": "This river used to be deadly. Now it's a tourist attraction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I am sitting with Tom Duddy, 79, beside the River Irwell in Springwater Park, Whitefield, on the outskirts of Manchester. We have just been fly fishing for wild brown trout, as Tom does every Wednesday evening now during the summer months. We are talking about the changes Tom has seen in the river during his lifetime. The Irwell was once described in parliament as: \"this disgracefully dirty river\", and Tom remembers a headline that appeared in the centre pages of the Daily Dispatch in 1947: \"Roach caught in Irwell\". \"That was how significant the catching of a fish in the river was then,” Tom tells me. Tom taught in the girls’ grammar school in the early 1970s, which was on the banks of the Irwell. “The river then was a by-word for filth and pollution,” he says. “If anybody fell in, they would be carted off to hospital straight away. Fortunately, Salford Royal was right next door to the school!” Now, here we are in 2015 and Manchester’s Lowry Hotel is offering guided fly fishing trips on its own river - The Irwell. Tom can’t quite believe he has lived to see it. Tom Duddy, his son Mike and grandson Matthew (Paul Cooper) I’ve been fishing today with three generations of the angling-mad Duddy family: Tom’s son Mike, 49, and grandson Matthew, 19. As we talk, Matthew, a keen fly fisher himself, learns with increasing incredulity about how the Irwell used to be. • Fly fishing: a new generation has become hooked “It’s mental when you think about it,” says Matthew. “It is there now as clean as it is, and that’s all that I’ve ever really known. But you hear these stories about people going to hospital to have their stomachs pumped if they fell in it and that’s crazy. A huge amount has changed, obviously.” A significant part of that change is down to the efforts of Tom’s son Mike Duddy, who is chair of local fishing club the Salford Friendly Anglers Society , the oldest fishing club in the world, established in 1817. Duddy \"inherited\" the club in the 1990s, when an old school friend turned up on his doorstep with a box of documents left to him by his grandfather. Then, it had only ten members, but it came at just the right time for him and his angling friends. “We were looking for a vehicle to use as an angling club and river restoration campaigning group,” says Duddy. Mike Duddy cleaning the river (Paul Cooper) So, the once private Salford Friendly Anglers flung open its doors and became a public group with free membership, and now almost 2,500 people have joined this river restoration pressure group. The Irwell is a post industrial river in recovery. Its story is similar to that of many rivers in the north of England and as with all, its fortunes began to improve once the traditional industries which so degraded it fell into decline. The Irwell still has a long way to go to regain full health, but much progress has been made in the past few years, largely due to the need to comply with the EU’s Water Framework Directive (WFD) which requires all waterways to be of \"good ecological status\" by 2027. A key figure on the river restoration campaigning scene is Theo Pike, with the work he and his team has done cleaning up the River Wandle in London. Duddy is keen to acknowledge his influence on Salford Friendly Anglers. Pike, like many before and since, became sidetracked into river restoration through his twin passions for fly fishing and wild trout. As well as being a key figure in the work of the Wandle Trust , he is author of ‘ Trout in Dirty Places ’, a guide to fly fishing in the UK’s towns and city centres. The Wandle at Hackbridge before and after (The Wandle Trust) The Wandle was the UK's first urban river restoration success story. If Pike was to offer Salford Friendly Anglers any advice, he would stress the importance of getting the local people involved. “If you can turn around people’s opinion that an ex industrial river is a nasty, dangerous, polluted thing, and think instead that it can be a really beautiful asset, if they can only look after it,” says Pike. “That is how you get real long term sustainability, and that’s how a river can be kept healthy for years to come.” Mike Duddy is now turning his campaigning zeal to the River Irk , which joins the Irwell in Manchester city centre. Known as \"The Dirty Irk\", Its current status is poor and unloved. Although some work has been carried out by the Irwell Rivers Trust, Chairman Matthew Schofield tells me that when they last checked for the presence of fish they could walk 3km and find “absolutely nothing”. A preliminary report was carried out on the Irk by the Wild Trout Trust , a charity which specialises in scoping and managing river restoration projects. • 10 things no one tells you before you take up fishing Director Shaun Leonard explains how the restoration of a river such as the Irk might work in an ideal world. The Wild Trout Trust produces a proposal which would show, as Leonard puts it: “How to take down a weir, how to put some wiggles back into a river, maybe introduce some gravel if gravel is missing, create marginal habitat for fish and wildlife and plants, then one of our project officers will project manage the work being done on the ground.” Leonard makes it all sound disarmingly simple. But in the real world, river restorations such as this are complex partnerships between the Environment Agency , Local Authorities, The Rivers Trusts , environmental charities such as the Wild Trout Trust and Groundwork , and community interest groups such as Salford Friendly Anglers. Money of course is what kick starts the whole process, and it is in increasingly short supply in the sector. Mike Duddy cleaning the river (Paul Cooper) The Irk has been heavily modified and flows through some of the most deprived communities in the country. Water quality is a particular concern. \"The Irk is one of the most challenging water courses, because there is a very high density of population on that side, and some of the water treatment works will be upgraded shortly,\" says Katherine Causer, the Environment Agency’s Project Manager for the Irwell. “And there is a legacy of contaminated land in that part of the catchment.” But Mike Duddy believes that change happens from the ground up, and that harnessing the power of the people is the way to make things happen. \"All we want is a river that is as good as everybody else’s,” says Duddy. “We don’t want anything better, all we are saying is that we are a massive centre of population, a massive centre of bill payers, so why is our river not as good as everybody else’s?” Mike Duddy is now planning to take his \"people power\" campaigning style beyond the Irwell and Irk, and into the mersey system as a whole. As Causer says: “It keeps us on our toes. Certainly from an Environment Agency point of view, Mike keeps me very busy.” You can pay an awful lot of money for fly fishing tackle - but fortunately, you don’t have to. In fact, there has never been a better time to buy great quality kit at a reasonable price. Mike Duddy fishing (Paul Cooper) Five essentials for the budding urban angler: 1. Fly rod If you want to cut a dash as an English gentleman who took a wrong turn on the Test and found himself in the urban jungle, then maybe a handmade split cane rod such as this is for you. Beautiful, but at a shade under £3,000 maybe a tad pricey. Two and three piece fly rods from The Edward Barder Rod Company : £2800 But a perfectly serviceable rod can be had for not much more than a hundred pounds: Greys GR30 Fly Rod from Sportfish : £99.99 2. Reel They say that in fly fishing, the reel is just somewhere to hang your line. But if you fancy hanging your line somewhere rather beautiful with classically designed engineering, consider something like this, a bargain at under £350: Hardy Bougle MKVII Fly Reel from Sportfish : £339 But, when it comes to getting out on the river and casting a line at your town trout, this will do the job just as well, and for under thirty quid too: Shakespeare Sigma Fly Reel from Sportfish : £29.99 3. Landing net You do need one. You don’t know what’s down there, you really don’t. You need something you can sling on your back. Here’s one for under £60, but there are cheaper. And more expensive. Sharpes Teardrop Gye Net from Sportfish : £57.99 4. Waders If you want to go deeper into things than your wellies - and you will - a pair of waders is essential. Nylon waders can be picked up for under £80 Snowbee Nylon Chest Waders from Sportfish : £69 But much more comfortable, if more expensive, are breathable waders with separate boots. Vision are mid price range - here is a boot and waders offer for £220 Vision Ikon Stockingfoot Chest Waders from Sportfish : £219.99 5. Where to go Theo Pike has done more than anybody to promote ‘small scale adventures’, and to make urban fly fishing for wild brown trout - and so river restoration - fashionable in angling circles. This book has a place in most urban anglers’ backpacks and contains fascinating information on the industrial history of the areas through which the rivers flow, as well as where to go to find wild brown trout and grayling in the most unlikely places. If you are buying a rod and reel, it is important that everything balances. So a good starter would be a 9 ft 6 weight rod, which would need a reel that will take a 6 weight line, and of course a 6 weight line. You can buy all these online, but consider shopping at your local fly fishing shop, where you will not only get advice on tackle, but also good places to fish in your area. And, you will be doing your bit to help another endangered species - your local independent trader. To order Trout in Dirty Places: 50 Rivers to Fly-fish for Trout and Grayling in the UK's Town and City Centres by Theo Pike for £20, call 0844 871 1514 or visit books.telegraph.co.uk Follow @TeleGoodLife Follow @telegoodlife", "external_links": [], "published": "2015-07-11T16:01:00.000+03:00", "crawled": "2015-07-11T10:27:16.000+03:00", "highlightTitle": ""}