{"organizations": [], "uuid": "41b22b9ebe7cb674c4fb05ca82d4e9674cb1691f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/07/23/Food/Images/firstbite29071437668948.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel: Travel News, Guides, Deals, Hotels, Vacation Ideas &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/food/ag-kitchen-is-all-over-the-map-in-silver-spring/2015/07/26/e140d7e8-2fca-11e5-8f36-18d1d501920d_story.html", "country": "US", "title": "A.G. Kitchen is all over the map in Silver Spring", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "A.G. Kitchen is all over the map in Silver Spring - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "41b22b9ebe7cb674c4fb05ca82d4e9674cb1691f"}, "author": "By MauraJudkis", "url": "http://www.washingtonpost.com/lifestyle/food/ag-kitchen-is-all-over-the-map-in-silver-spring/2015/07/26/e140d7e8-2fca-11e5-8f36-18d1d501920d_story.html", "ord_in_thread": 0, "title": "A.G. Kitchen is all over the map in Silver Spring", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By MauraJudkis July 26 at 8:00 AM Lest you forget that A.G. Kitchen is the work of TV chef Alex Garcia, all you need to do is look around the new American and Latin restaurant in Silver Spring. Garcia’s smiling, goateed mug is on the patio umbrellas and dividers, the entryway wall, even the water glasses.\nThe Havana-born Garcia made his name in New York at restaurants Erizo Latino, Calle Ocho and Babalu, and on the small screen hosting “Melting Pot” on Food Network and “Nuestra Cocina” on Vme, the Spanish-language affiliate of PBS.\nA.G. Kitchen is a twin to Garcia’s New York restaurant of the same name, with an identical mix of American comfort food and accessible Latin favorites: Think tacos, arepas and seviche sharing the table with grilled cheese, bacon-wrapped dates and turkey burgers with cranberry sauce. Chef Charles Wynn handles kitchen duties when Garcia is back in New York.\nA.G. Kitchen’s Cubano sandwich is one of the Silver Spring restaurant’s standouts. (Deb Lindsey/For The Washington Post) Use Garcia’s Cuban heritage as your menu guide. Opt for the Cubano, the traditional pork loin, ham, melted Swiss, mustard and pickle sandwich on slightly sweet Cuban bread. The same goes for the Cuban Classic for Two, a shareable platter of rice, beans, plantains, tamales and ropa vieja, or shredded braised short ribs. It could use a bit more seasoning, but I’m almost afraid to say that about a dish here, where many other offerings are too salty, too sweet or sometimes both.\nPineapple and pomegranate, or papaya and mint, are unnecessary adornments to guacamole, which becomes more of a dessert than an appetizer in their presence. And the self-declared “tableside” guacamole was delivered to our table already mashed and mixed, the requested medium spice level imperceptible. A too-salty paella studded with crabs, lobster, clams and other sea- and land-dwelling creatures left us gulping water. And when a friend tried the punny, medicinal-tasting “Thai Me Down” cocktail, made of pineapple and Thai basil-infused tequila and green chartreuse, she quipped, “I’m using my safe word.”\nThe cheddar-stuffed Inside Out burger is topped with bacon, more cheddar, onions, mushrooms, lettuce, tomato, onion and garlic aioli. (Deb Lindsey/For The Washington Post) The cheese-stuffed Inside Out burger’s texture and moisture level suffer from the requirement that it be cooked medium-well, and the Samba Chicken, served with sweet and spicy house-made sauces, is bested by Nando’s, the restaurant’s fast-casual budget-friendly neighbor across the street.\nWith an aqua, orange and yellow color scheme, the room is bright and cheery but gives off a slight cafeteria vibe. Patio seating next to Silver Spring’s kid-magnet interactive fountain is preferable, thanks to a pressed-tin ceiling that makes the room so loud that our server misheard us.\nYou won’t be able to resist looking at the dessert menu here — not because of its contents, but because of its presentation. On every table sits a red plastic toy View-Master , the retro personal slideshow device that might bring back childhood memories. Except instead of scenes from around the world, you’ll click through photos of apple pie a la mode, chocolate empanadas, flan resting on a puddle of raspberry sauce and Banana Mania, which reveals itself to be a not-so-manic slice of banana bread topped with bananas Foster and ice cream. A better choice comes in liquid form: a rich rum-spiked banana-butterscotch milkshake.\nA Gone Bananas milkshake at A.G. Kitchen in Silver Spring. (Deb Lindsey/For The Washington Post)\nDiners of all ages can use toy View-Masters to view the dessert menu. (Deb Lindsey/For The Washington Post) The View-Masters are among the most novel (and most stolen) menu presentations in all of Washington. It’s too bad the same can’t be said about the rest of A.G. Kitchen’s offerings.\n931 Ellsworth Dr., Silver Spring. 301-588-9400. www.agkitchen.com. Entrees, $13 to $29.\nMore from Food :\nFirst Bite\nOther Tom Sietsema reviews/Ask Tom\nSmoke Signals\nSpirits Column\nBeer Column", "external_links": ["https://en.wikipedia.org/wiki/View-Master", "http://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&ved=0CCAQFjAA&url=http%3A%2F%2Fwww.washingtonpost.com%2Flinksets%2F2010%2F07%2F06%2FABDCs7D_linkset.html&ei=PzM9UPzZH6bs0gGsvYCIBg&usg=AFQjCNHbyMroS1ZoRf30GF9csn1E4ySzBw", "http://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&ved=0CCIQFjAA&url=http%3A%2F%2Fwww.washingtonpost.com%2Flinksets%2F2010%2F07%2F06%2FABP6r7D_linkset.html&ei=BzM9UPvqL4Pq0gHoqIDgDg&usg=AFQjCNGDbwwxNkznEVleiDjWeXZylJRU0A", "http://www.agkitchen.com/"], "published": "2015-07-26T03:00:00.000+03:00", "crawled": "2015-07-26T15:07:16.414+03:00", "highlightTitle": ""}