{"organizations": [], "uuid": "cb504974e6f01e722edf931ddce9cedd152a7d56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/explore-the-south-kensington-tunnel.html", "country": "US", "title": "Explore the South Kensington Tunnel", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Explore the South Kensington Tunnel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T18:50:00.000+03:00", "replies_count": 0, "uuid": "cb504974e6f01e722edf931ddce9cedd152a7d56"}, "author": "Lisa Jeeves-2015-07-21T16:50:59-0400", "url": "http://www.articlesfactory.com/articles/travel/explore-the-south-kensington-tunnel.html", "ord_in_thread": 0, "title": "Explore the South Kensington Tunnel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | July 21, 2015 \nKensington hotels are close to the South Kensington Tunnel and the world-renowned local museums. The tunnel is more interesting than you might imagine! \nVisiting London and staying in Kensington? No matter where you choose to stay, most of the Kensington hotels will be close to the ‘South Kensington Pedestrian Tunnel’. This tunnel travels entirely underground from the local Underground station into the famous Science and Natural History Museums. \nIf you’re unfamiliar with it, that might not sound to be the most enticing introduction to an attraction you’ve ever encountered! But, in fact, it is actually more interesting than it might sound. \nThe tunnelTrue, this isn’t a great architectural treasure. One thing you won’t see when using it (well, probably not!), are awe-struck tourists stopping to take photographs! It’s a very long subterranean walkway built of brick that dates back to the 19th century. In itself, it isn’t an engineering marvel but, as is commonplace with some of London’s lesser-known spots, when you know more about it you’ll also get more of an insight into the entrepreneurial zeal of the Victorians of the time. If you think property speculation and an unbridled enthusiasm for development is a modern thing in London, think again! \nEarly days of Kensington as a museum centre \nLondon had long looked for a major exhibition centre and the first major London exhibitions in the 1880s were held on a site occupied today by Imperial College. An enterprising (and as became clear later, overly-optimistic) railway company built a long foot tunnel to offer a way for pedestrians to get from the station to the exhibition centre without risking soiling their clothes on the chaotic and typically filthy streets of 19th century “South Ken”. \nThe company concerned weren’t thinking altruistically, of course. Having paid their fare, the passengers then had to pay another 1d (an old penny) to use the tunnel – no doubt with much grumbling and outrage. Of course, the important and typically well-heeled pedestrians staying in the upmarket Kensington hotels were probably less inclined to complain! \nYet fate can be a fickle friend. Very shortly after opening, fashion and ideas changed. At almost a snap of fingers, the major London exhibitions moved to a new site altogether (you can find them today in Olympia). Suddenly, almost nobody wanted to use the now virtually redundant tunnel, and those that did certainly had no intention of paying to do so. Those staying in the nearby Kensington hotels and rail passengers were simply going in another direction and had no need for the tunnel. The money dried up almost overnight. \nForlorn days \nThe tunnel was closed and stood empty and largely unused for many years.Eventually, in 1908 somebody had a bright idea: the tunnel was refurbished and re-directed to link the major museums now on the site, with use this time being free of charge. \nEven though the surrounding streets today are cleaner, though probably just as crowded, the tunnel today remains popular – particularly in poor weather. It’s a structure that many thousands of people use every day heading to and from the museums – and very few probably know its interesting history. \nThese little snippets of life in a long-gone-by London are part of what makes staying in any of the charming Kensington hotels such a pleasant experience. Source:   \nKensington hotels . This wonderful hotel embodies the true flavour of Kensington, with its traditional regency-style façade and superb facilities. Whether you're looking for accommodation in London for business or leisure, the Regency offers an effortlessly elegant experience.", "external_links": [], "published": "2015-07-21T18:50:00.000+03:00", "crawled": "2015-07-22T05:00:43.123+03:00", "highlightTitle": ""}