{"organizations": [], "uuid": "7dbd37129181aa8c824fb3acc28c219e0c089d45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/greece-tourism-unaffected-financial-crisis-0", "country": "US", "title": "Greece tourism unaffected by financial crisis", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "Greece tourism unaffected by financial crisis", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T01:47:00.000+03:00", "replies_count": 0, "uuid": "7dbd37129181aa8c824fb3acc28c219e0c089d45"}, "author": "senh", "url": "http://www.wopular.com/greece-tourism-unaffected-financial-crisis-0", "ord_in_thread": 0, "title": "Greece tourism unaffected by financial crisis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Greek Default: What it Means for Travel Tourism in Greece is as healthy as it has ever been ... For Liadis, Greece bookings have not only been unaffected by financial concerns rather travel to the country has increased. Liadis has had to turn business down because of lack of hotel availability ... 06/30/2015 - 1:01 pm | View Link Greece tourism unaffected by financial crisis Pro-Euro protesters argue with riot police, preventing them to go up towards the parliament building in Athens on June 30, 2015. Thousands of people rallied in Athens Tuesday in support of a bailout deal with international creditors which has been rejected ... 06/30/2015 - 10:09 am | View Link FTSE CLOSE: Footsie slides 2% as Greek default looms tomorrow; travel stocks fall after Tunisia attack Connor Campbell, financial analyst at Spreadex ... depressed as the morning session progressed as Greece moved a step closer to a debt default and a possible exit from the euro, with travel and tourism stocks the worst off in London. 06/29/2015 - 10:36 am | View Link Greek government assures tourists that crisis won't affect them But it stressed that credit or debit cards issued abroad would be unaffected ... Tourism Ministry said it did not expect tourists to suffer, saying in a statement that it \"does not expect any inconvenience ... either on the islands or in mainland Greece ... 06/29/2015 - 9:40 am | View Link Tourists in Greece need not worry about running out of cash, say tour operators Travel companies say holidays to Greece are unaffected by the financial crisis but offer guests the chance ... He added that the weak euro was also favouring tourism to the country. Visitor numbers reached record levels in 2014 with international arrivals ...", "external_links": [], "published": "2015-07-01T01:47:00.000+03:00", "crawled": "2015-07-01T23:27:01.000+03:00", "highlightTitle": ""}