{"organizations": [], "uuid": "ec196e5e484cbc979baa68e9a19863e058aa14a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03369/Yorkshiretea_full__3369933k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/sport/cricket-tea-challenge/11730593/newton-linford-cricket-tea.html", "country": "US", "title": "Newtown Linford Cricket Club: judges comments", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Newtown Linford Cricket Club: judges comments - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T18:40:00.000+03:00", "replies_count": 0, "uuid": "ec196e5e484cbc979baa68e9a19863e058aa14a2"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/sport/cricket-tea-challenge/11730593/newton-linford-cricket-tea.html", "ord_in_thread": 0, "title": "Newtown Linford Cricket Club: judges comments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more about the Great Cricket Tea Challenge Telegraph writer Gareth A Davies and former England cricket captain Mike Gatting discuss the finer points of the Newton Linford cricket tea. Gareth A Davies It was a marvellous banquet prepared by the women of the Hopkins family. The pork pie was incredible – succulent meat, delicious pastry. The beetroot and apple chutney in the cheese sandwiches was sheer perfection. The venison sausages and the toad-in-the- hole with chutney were another highlight. It does not surprise me that almost all the tea was demolished, with any leftovers being hoovered up in the pavilion after the match. Mike Gatting I pushed for pork pie at Lord’s when I was president of the MCC, so you can imagine my delight at a pork pie the size of a birthday cake. I loved the fact that this was all home-made from local produce. The sausages sliced into toad-in-the-hole, along with the chutney, were fabulous. The strawberry and raspberry jam cake was so tasty, as were the scones. These girls put their heart and soul into it. I pity the guys who only have 20 minutes to eat this at tea-time. Vaughan's verdict: the Victoria Sandwich Each finalist bakes a cake for former England captain Michael Vaughan to taste and judge. This had one layer of strawberry and prosecco jam and a layer of rasperry jam, home-made. Vaughan said: \"When I discovered that it was home-made prosecco jam, I knew why it tickled my taste buds.\"", "external_links": [], "published": "2015-07-10T18:40:00.000+03:00", "crawled": "2015-07-10T14:55:50.000+03:00", "highlightTitle": ""}