{"organizations": ["Warsaw Palace of Culture"], "uuid": "a6d04de7e33786e6fbab48cf07c688b5466516fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stripes.com", "main_image": "http://www.stripes.com/polopoly_fs/1.359375.1437674681!/image/image.jpg_gen/derivatives/landscape_490/image.jpg", "site_section": "http://feeds.stripes.com/starsandstripes/travel#", "section_title": "Stars and Stripes Travel", "url": "http://www.stripes.com/travel/unwanted-gift-from-stalin-warsaw-palace-of-culture-turns-60-1.359286", "country": "US", "title": "Unwanted gift from Stalin, Warsaw Palace of Culture turns 60", "performance_score": 0, "site": "stripes.com", "participants_count": 0, "title_full": "Unwanted gift from Stalin, Warsaw Palace of Culture turns 60", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T23:23:00.000+03:00", "replies_count": 0, "uuid": "a6d04de7e33786e6fbab48cf07c688b5466516fa"}, "author": "", "url": "http://www.stripes.com/travel/unwanted-gift-from-stalin-warsaw-palace-of-culture-turns-60-1.359286", "ord_in_thread": 0, "title": "Unwanted gift from Stalin, Warsaw Palace of Culture turns 60", "locations": ["Warsaw", "Moscow", "Poland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Josef Stalin", "Stalin"], "text": "Travel Unwanted gift from Stalin, Warsaw Palace of Culture turns 60 Cars are parked in front of the Palace of Culture and Science in Warsaw, Poland. The building was a gift from Soviet leader Josef Stalin and is celebrating its 60th birthday this year. Some officials called for the building to be torn down in a symbolic gesture after Poland shed communism and Moscow's dominance in 1989, but the opinion prevailed that it is a witness to national history and should be preserved. Czarek Sokolowski/AP Published: July 22, 2015 \nWARSAW, Poland — Some Poles liken the skyscraper to an elephant in lace underpants. A famous poet dubbed it \"the nightmare of a drunken baker.\" And one joke goes that it provides the best view of Warsaw because you can't see the building from inside. \nWarsaw's Palace of Culture and Science has been derided as an oppressive eyesore ever since Soviet dictator Josef Stalin built it as his personal gift to the city. On Wednesday — having survived persistent calls to tear it down — the building marked its 60th birthday as an enduring symbol of a city that has known waves of destruction. \nExhibitions of the palace photos and caricatures opened and officials were to raise a birthday toast with Champagne. Concerts and fireworks are also planned over the weekend, to mark the anniversary of a building that Warsaw residents have finally come to appreciate. Rising 42 floors, it remains Poland's tallest building and it boasts over 350,000 visitors each year. A growing number of them are foreign tourists curious to explore the many corners of the massive Soviet-style edifice. \n\"I like it, it's nice,\" said Joanna Golabek. \"I don't mind its history so much. I have good associations with the concerts and the events that I attended there.\" \nIn the early 1950s, when Warsaw was still largely a sea of ruins after World War II, some 5,000 Soviet and Polish workers built the skyscraper in less than three years, complete with marble interiors and impressive crystal chandeliers. Some 18 were killed in on-site accidents. \nStalin offered to build the edifice in 1951, while the Soviet Union was strengthening its grip on Poland and other countries in the region. The money and most materials came from the Soviet Union; Polish and Soviet officials opened the building, then-named after Stalin, with great pomp on July 22, 1955. \n\"It was an unwanted gift mainly because, as we say, it was a gift from Stalin and for obvious reason it was not welcome,\" said Renata Kaznowska, head of the city-run building's management board. \"Its difficult childhood also comes from the fact that a whole section of old houses had to be pulled down to make room for it.\" \nA team of Soviet architects, led by Lev Rudnev, styled it after similar buildings in Moscow, but added traditional Polish features like wooden box ceilings, pillars and carved stone ornaments. \nPolish poet Wladyslaw Broniewski famously called the building — stacked like a wedding cake — \"the nightmare of a drunken baker.\" \nEven as an eyesore, the structure was and remains very functional. It houses theaters, cinemas, museums, a swimming pool, a concert and congress hall and many scientific organizations. It also \"employs\" 11 cats that fight rodents in the basement. \n\"For those times it really was a great support for culture,\" said Wit Henryk Bak, 76, who worked in the building in 1958 as an elevator technician. He recalled how Warsaw's downtown in the 1950s was still a wasteland of \"only debris and debris all around.\" \nThe palace also boasts a popular viewing platform on the 30th floor. Tragically, eight people, including a Frenchman, chose the viewing area to plunge to their deaths, until protective grates were installed in the 1970s. \nAfter Poland shed communism in 1989, calls were made for the palace to be torn down in a symbolic gesture of doing away with the Soviet past. But the city ended up preserving it due to its Socialist realist architecture — which in recent years has begun to gain some appreciation — and because it is part of the city and the country's history. \n\"It's good that it's still standing here,\" Bak said. \"But it would be good to clean it a bit.\" \nForeign tourists also appreciate it. \n\"I think it is an extraordinary piece of architecture,\" said Paul Kulig, a high school student visiting from Edmonton, Canada. \"Just seeing those ballrooms and the history behind them, how the communists would meet there, discuss politics and, obviously, drink together because that's just what they did — it was extremely neat.\" Join the conversation and share your voice. \nShow Comments", "external_links": [], "published": "2015-07-22T23:23:00.000+03:00", "crawled": "2015-07-23T23:31:02.265+03:00", "highlightTitle": ""}