{"organizations": [], "uuid": "4585e26b279ebd61b83621ade2a6261f2b18839d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61803/southwest-flight-attendants-reject-tentative-agreement", "country": "US", "title": "Southwest flight attendants reject tentative agreement", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Southwest flight attendants reject tentative agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T00:10:00.000+03:00", "replies_count": 0, "uuid": "4585e26b279ebd61b83621ade2a6261f2b18839d"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61803/southwest-flight-attendants-reject-tentative-agreement", "ord_in_thread": 0, "title": "Southwest flight attendants reject tentative agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Southwest flight attendants reject tentative agreement Adv: \nJul 24, 2015 Adv: \nDALLAS, TX - Southwest Airlines today announced that its Flight Attendants have voted down a tentative agreement that would have ended two years of negotiations. \nRepresentatives for Transport Workers Union (TWU) Local 556 say Flight Attendants rejected the deal by 87 percent of those casting ballots. Nearly 89 percent of eligible Flight Attendants voted. \n\"This agreement ensured that our Flight Attendants would stay atop the industry in pay and benefits,\" said Randy Babbitt, Southwest Senior Vice President Labor Relations. \"It improved the Company's competitiveness with certain work-rule changes and supported our evolving network, both domestically and in international markets. So naturally we're disappointed that it didn't pass.\" \nThe deal was slated to run through May 2019 and contained fixed wage increases, cash bonuses, and quality of life improvements. Southwest says it remains committed to reaching an agreement that best serves the interests of both the Company and its Flight Attendants. \n\"Knowing how volatile our industry can be, I can't imagine a better time to secure an agreement,\" said Vice President Cabin Services Mike Hafner. \"But together we will find a way to move forward. Southwest Flight Attendants are the finest in the industry, and I am continuously proud of their consistent efforts and the caring service they provide our Customers.\" \nSouthwest expects TWU leadership will take some time to evaluate the results prior to returning to direct bargaining. But for now, Southwest Flight Attendants will continue working under the terms of their current agreement, which became amendable May 31, 2013.", "external_links": [], "published": "2015-07-25T00:10:00.000+03:00", "crawled": "2015-07-25T00:59:32.381+03:00", "highlightTitle": ""}