{"organizations": [], "uuid": "9419a2a468b616c4e6078366ad15682a3a6925bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.accidentaltravelwriter.net", "main_image": "http://www.accidentaltravelwriter.net/.a/6a0148c6f68c01970c01bb0857db78970d-200pi", "site_section": "http://www.accidentaltravelwriter.net/accidental-travel-writer/atom.xml", "section_title": "Accidental Travel Writer", "url": "http://www.accidentaltravelwriter.net/accidental-travel-writer/2015/07/china-worlds-top-10-worst-airports-for-on-time-performance-.html", "country": "US", "title": "China: World's Top 10 Worst Airports for On Time Performance", "performance_score": 0, "site": "accidentaltravelwriter.net", "participants_count": 1, "title_full": "China: World's Top 10 Worst Airports for On Time Performance", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T05:06:00.000+03:00", "replies_count": 0, "uuid": "9419a2a468b616c4e6078366ad15682a3a6925bb"}, "author": "Michael Taylor", "url": "http://www.accidentaltravelwriter.net/accidental-travel-writer/2015/07/china-worlds-top-10-worst-airports-for-on-time-performance-.html", "ord_in_thread": 0, "title": "China: World's Top 10 Worst Airports for On Time Performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China: World's Top 10 Worst Airports for On Time Performance \nAirlines and Aviation \nIf you're travelling by air in China, don't go to the airport without a good book or hand-held game. The country's airports have the world's worst records for on time arrivals and departures. The terminal of Guangzhou Baiyun International Airport in the Southern Chinese province of Guangdong. Photo Credit: China Travel Savvy. \n\nChina has built some dazzlingly beautiful airports since economic reforms were launched in 1989, but despite modern terminal buildings and stellar facilities, flight delays at most of the country's airports are the rule rather than the exception. \nAs the saying goes, China is long on hardware, and short on software. Sure, inclimate weather is often to blame for flight delays. But that happens everywhere. Poor management also plays a major role in the country's dismal on-time performance record. \nGuangzhou Baiyun International in the Southern Chinese province of Guangdong had the unenviable distinction of having the worst on-time performance of any of the world's major airports in May 2015, according to statistics released by CARNOC database CADAS (Civil Aviation Data Analysis). \nA breathtaking 65% of flights departed the airport behind schedule. Compare that to Sao Paulo Congonhas Airport in Brazil, where only 2.09% of flights departed late. \nOf the 10 major airports with the best on-time performance, fully 6 were in Japan: Tokyo Haneda International Airport (2nd) , Osaka International Airport (3rd), Sapporo Airport (4th), Nagoya Airport (5th), Fukuoka Airport (6th), and Osaka New Chitose Airport (10th). \nThree airports with the best on-time performance were in Brazil: Sao Paulo Congonhas International Airport (first) and Rio de Janeiro Galeao International Airport (7th), and Sao Paulo Guarulhos International Airport (8th). \nOne on the airports with the best on-time performance record was in Canada: Calgary International Airport (9th). \nOn Time Performance Airport Terminal at Urumqi Airport in Xinjiang, China. Photo Credit: Nihongarden. \n\nNot all airports in China are a basket case when it comes to on-time performance. Urumqi Airport in restive Xinjiang province boasted an on-time performance of 86.6%. \nAirports serving Kunming, Dalian, Qingdao, and Harbin all had on-time performance rates of between 70% and 79%. \nOverall, however, major Chinese airports had the world's worst on-time performance records, with fully 7 airports ranking in the top 10 list of airports with the worst on-time performance. \nOnly 35% of flights departing from Guangzhou Baiyun International Airports left on time. Five more major Chinese airports suffered on-time performance rates of less than 50%. \nShenzhen International Airport came in 2nd, with an on-time departure rate of 37.98%, followed by Nanjing Airport (39.79%), Shanghai Pudong Airport (45.06%) Shanghai Hongqiao Airport (48.85%), Xiamen Airport (49.40%). \nEven the country's showcase Beijing Capital Internatinal Airport, which is the world's 2nd busiest airport in terms of passenger volume, had an on-time performance rate of just 57.68%", "external_links": [], "published": "2015-07-27T05:06:00.000+03:00", "crawled": "2015-07-27T09:51:33.107+03:00", "highlightTitle": ""}