{"organizations": [], "uuid": "c5f1a5065d5394997ce97e08edc0279917f205d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61610/fighting-his-life-shark-attacks-during-international-surf-compet", "country": "US", "title": "Fighting for his life! Shark attacks during international surf competition in South Africa", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Fighting for his life! Shark attacks during international surf competition in South Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T08:35:00.000+03:00", "replies_count": 0, "uuid": "c5f1a5065d5394997ce97e08edc0279917f205d5"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61610/fighting-his-life-shark-attacks-during-international-surf-compet", "ord_in_thread": 0, "title": "Fighting for his life! Shark attacks during international surf competition in South Africa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fighting for his life! Shark attacks during international surf competition in South Africa Adv: \nJul 20, 2015 Adv: \nThe announcer is yelling into the microphone: \"Get out of the water now! - everyone out! The horn is blasting. Sports tourist watching the final event of the Association of Surfing Professionals’ J-Bay Open event in the Eastern Cape province of South Africa on Sunday became witness to the most incredible situation ever seen in professional surfing. \nWhen the announcer yelled: Get out of the water immediately, World championship surfer Mick Fanning from Australia was seen fighting for his life with a dangerous tiger shark caught on camera and live TV for the world to see. The dangerous incursion, said to be “the first in professional surfing history. \nThe shark – described as a “big tiger shark” by the event’s live commentators, approached Fanning from behind as he was sitting on his board in the waters of Jeffreys Bay (also known as J-Bay) getting ready to compete. \nIn the broadcast, the shark could be seen launching itself at the surfer, known by the nickname “White Lightning,” who then disappeared from his board. After that, only huge splashes of water were visible to viewers. Assisting jet skis rushed to the spot where the struggle was taking place. \n“There were two sharks apparently,” World Surf League (WSL) Deputy Commissioner Renato Hickel said, adding that “this is the first time in professional surfing history, no one has experienced a situation like that.” \nThis is true sports. Another fellow Australian surfer, Julian Wilson, who was competing against Fanning in the world title battle, immediately paddled to his opponent’s aid on seeing the attack. \nDescribing the attack afterwards, Fanning – who luckily escaped without injury - said the shark “punched me in the back.” \nThe unprecedented attack happened during the final of the Association of Surfing Professionals’ J-Bay Open event in the Eastern Cape province of South Africa. Sunday was the final day of the competition, in which 36 surfers took part. Fanning’s struggle to survive the “terrifying situation” was called “nothing short of heroic” by WSL. The organizers decided to call off the final, with the surfers to split the money prize.", "external_links": [], "published": "2015-07-20T08:35:00.000+03:00", "crawled": "2015-07-20T12:14:56.607+03:00", "highlightTitle": ""}