{"organizations": [], "uuid": "7ea82dfd803c9a56e443d4039d1591f4dda0d0f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03389/mosquito_3389716k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/france/11767535/What-is-the-point-of-mosquitoes.html", "country": "US", "title": "What is the point of mosquitoes?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "What is the point of mosquitoes? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:22:00.000+03:00", "replies_count": 0, "uuid": "7ea82dfd803c9a56e443d4039d1591f4dda0d0f5"}, "author": "Anthony Peregrine", "url": "http://www.telegraph.co.uk/travel/destinations/europe/france/11767535/What-is-the-point-of-mosquitoes.html", "ord_in_thread": 0, "title": "What is the point of mosquitoes?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mosquitoes can destroy your marriage. This summer, and for reasons too tedious to go into, there has been an upsurge in mosquito numbers in our bit of southern France . This can cause marital strife. Last time we had a mosquito excess, it certainly did, as I may have mentioned before. The facts: there was a mosquito in our bedroom. It buzzed in a manner both controlled and manic, like Norman Wisdom playing Macbeth. Then it stopped. It waited, lurking like a secondary infection. The tension grew intolerable. “Come on, you little winged bastard,” I cried. “Fly!” The ensuing conflict swiftly became primal, Man .v. Insect on the classic pattern: insect flies, man smashes wall, insect laughs like emptying drain from the lampshade. Now, no wife will long sleep through the destruction of her bedroom, and mine is no exception. She awoke as her mate and protector clambered onto the wardrobe. (I’d discerned a buzz in the far corner.) There was a time when a man could climb onto a wardrobe above his wife and excite no untoward comment. It was a normal part of married life, like pipe-smoking and dancing the jive. With the advent of feminism and lightweight furniture, those days are gone. “What the hell are you doing up there?” she asked, switching on the bedside lamp. This lured the insect from its hiding place. (Mosquitoes, like freckled virgins from the Irish countryside, rarely resist the bright lights.) I lunged, missed, plunged, and ended up athwart the wife’s legs. “Imbecile,” she moaned. “Thank you,” I said. “And how was it for you?” As my wife slept again, it occurred to me what a damned fool existence mosquitoes lead. This one was blundering about our bedroom to no apparent purpose. Elsewhere, mosquitoes have no contribution to make. Bees pollinate flowers, produce honey and have a most attractive drone. Butterflies are beautiful and inspire artists of the calibre of Dolly Parton. Spiders catch flies. The mosquito’s achievements, by contrast, are all negative, tied up with itching and malaria. Even from a mosquito’s point of view, this must become depressing. There’s no hope of advancement. No matter how staggeringly gifted one might be as a mosquito, one remains a mosquito. One may not even aspire to become a spittle-bug (itself no great shakes on a scale of one to ten). The wretched beasts must ultimately ask themselves what it’s all about. But not the one in our bedroom. Not anymore. I eventually got the little devil when he alighted on my sleeping wife’s upper arm. I used Middlemarch though, certainly, any other 900-page paperback would have done the trick. My wife hit back - convincingly - with Testament Of Youth. We had words the following morning. It remains to be seen whether the agreement thus reached survives the present mosquito resurgence. As with Greece, the precedent is not promising. How to avoid mosquitoes in France Mosquitoes like heat and water. In summer, try anywhere else where there's not much water and perhaps a few hills. What about the Vosges mountains of Alsace? These are beautiful, wild, hot in summer, full of good food and wine - and I've yet to meet a mosquito there. And on no account head for the Camargue or lagoon-y areas of Languedoc. More from Anthony Peregrine • The Franco-American love-fest • Napoleon or Wellington - who was better? • Why I’m embarrassed to be a non-smoker • The fêtes of our nations: bullfighting or tombola? • The perils of holidaying with friends • Why I love motorways • The joy of dining alone - and why my satnav is the perfect woman • Why France is better than Britain Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-07-28T19:22:00.000+03:00", "crawled": "2015-07-28T13:43:28.585+03:00", "highlightTitle": ""}