{"organizations": [], "uuid": "2a7831a1d73d5a2388c4337da9d3ea3526b0f4cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150713Mexico.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/07/13/mexico-hunts-drug-kingpin-probes-prison-guards", "country": "US", "title": "Mexico hunts drug kingpin, probes prison guards", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Mexico hunts drug kingpin, probes prison guards -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T23:52:00.000+03:00", "replies_count": 0, "uuid": "2a7831a1d73d5a2388c4337da9d3ea3526b0f4cd"}, "author": "Laurent Thomet | AFP", "url": "http://www.ticotimes.net/2015/07/13/mexico-hunts-drug-kingpin-probes-prison-guards", "ord_in_thread": 0, "title": "Mexico hunts drug kingpin, probes prison guards", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY, Mexico — Mexican security forces scrambled Monday to save face and recapture drug kingpin Joaquín “El Chapo” Guzmán as authorities investigated whether guards helped him escape prison through a tunnel under his cell.\nFor the second time in 14 years the head of the powerful Sinaloa drug cartel managed to flee a maximum-security prison, dealing an embarrassing setback to President Enrique Peña Nieto.\nTroops and police were deployed to hunt down Guzmán after he vanished late Saturday from the Altiplano prison 90 kilometers (55 miles) west of Mexico City, after just 17 months behind bars.\nProsecutors questioned 30 prison employees of various rank, including the warden, the attorney general’s office said, signaling suspicions of an inside job.\nThe guards in charge of the capo’s cell and those who monitored the surveillance cameras that look into the room were among those interrogated, an official in the attorney general’s office said.\nAuthorities had already investigated a strange prison visit to Guzmán in March when a woman managed to see him by using a fake ID to enter the jail.\nOn a state visit to Paris, Peña Nieto said Guzmán’s escape was “an affront to the state” and demanded an investigation into whether prison guards helped him.\nGuzmán, 58, who nurtured a Robin Hood image in his northwestern state of Sinaloa while running the most powerful and one of the most ruthless cartels in Mexico, was able to slip out even though surveillance cameras were trained on his cell.\nHe went into his private shower and after he failed to come out guards found a hole 10 meters (33 feet) deep with a ladder in it.\nThe gap led to a 1.5-kilometer tunnel with a ventilation and light system that was apparently dug with the help of a motorcycle mounted on a rail to transport tools and remove earth.\nThe sophisticated tunnel led to a gray brick building on a hill surrounded by pastures in central Mexico State.\nProsecutors released a video showing the hole inside the building’s dirt-covered floor. A bed and kitchen were in the facility, indicating that people had lived there.\nAgainst the clock\nAs investigators tried to figure out how Guzmán busted out again, police and troops manned checkpoints and searched cars and trucks on nearby roads.\nMike Vigil, a retired U.S. Drug Enforcement Administration (DEA) international operations chief, warned that if Guzmán is not captured in the next day or so he will vanish for good.\n“If he is able to make his way to Sinaloa, his native state, and gets into that mountainous range, it’s going to be very difficult to capture him because he enjoys the protection of local villagers,” Vigil told AFP.\nRecommended: How do ‘El Chapo’ Guzmán’s kids live? Follow them on Twitter\nSeveral states, including Sinaloa, set up checkpoints. Central Puebla state said it was using X-ray technology at toll booths to see through cars.\nTroops in Guatemala launched a special operation at the border with Mexico. It was in that country that Guzmán was first arrested in 1993.\nGuzmán’s first escape was in 2001, when he slipped past authorities by hiding in a laundry cart in western Jalisco state.\nMarines recaptured him in February 2014 in a pre-dawn raid in a condo in Mazatlán, a Pacific resort in Sinaloa state, with the DEA’s help.\nHe was then jailed at Altiplano, which houses several other infamous drug capos captured during Peña Nieto’s administration.\nPeña Nieto setback\nGuzmán’s second escape overshadowed Peña Nieto’s visit to France.\nThe government has won praise for capturing a slew of kingpins and Guzmán, a diminutive but feared man whose nickname means “Shorty,” was the president’s biggest trophy.\nU.S. Attorney General Loretta Lynch said she shared Mexico’s “concern” and offered help for his “swift recapture.”\nSome U.S. prosecutors wanted to ask for his extradition following last year’s arrest, but Mexican officials insisted on trying him first.\n“This leads to a big problem with the U.S. government because they asked (for an extradition) and the Mexican government did not deliver him, claiming that he could be held in one of the country’s maximum-security prisons,” said Raúl Benítez Manaut, security expert at the National Autonomous University of Mexico.", "external_links": [], "published": "2015-07-13T23:52:00.000+03:00", "crawled": "2015-07-14T05:05:40.000+03:00", "highlightTitle": ""}