{"organizations": [], "uuid": "8d86c0e86c2a48936b8146a0d9ed653ef4825fac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1153401/images/o-RETAIL-THERAPY-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/business-travel/feed", "section_title": "Business Travel on Huffington Post", "url": "http://www.huffingtonpost.com/mary-ellen-biery/finally-some-good-news-fr_b_7867952.html", "country": "US", "title": "Mary Ellen Biery: Finally, Some Good News From U.S. Retailers", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Mary Ellen Biery: Finally, Some Good News From U.S. Retailers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T19:55:00.000+03:00", "replies_count": 0, "uuid": "8d86c0e86c2a48936b8146a0d9ed653ef4825fac"}, "author": "Mary Ellen Biery", "url": "http://www.huffingtonpost.com/mary-ellen-biery/finally-some-good-news-fr_b_7867952.html", "ord_in_thread": 0, "title": "Mary Ellen Biery: Finally, Some Good News From U.S. Retailers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nDespite jokes on social media about Amazon's Prime Day shopping event and headlines that monthly retail sales slid unexpectedly in June, a closer look at the big picture for privately held retailers indicates these shop owners are still growing - and growing fairly nicely, in some cases. \nPrivately held retailers, on average, have been increasing sales by 6.6 percent, according to an analysis of financial statements for the 12 months ended July 13 by Sageworks , a financial information company. \n\"Smaller retailers, those averaging less than $10 million in annual revenue, have been growing sales pretty consistently over the last few years, between 5 and 8 percent year over year, said Sageworks analyst Libby Bierman. \nLarger private retailers, or those with annual sales topping $50 million, have seen even faster growth. They posted an average sales increase of 9.5 percent in the most recent 12-month period, according to Sageworks' financial statement analysis . Bierman noted that sales growth for this group has been in the double digits for the past few years. \n\"Based on the Sageworks' data, it's not fair to say that retail is in bad shape,\" she said. Retailers may not be growing as quickly as they did right out of the recession, but they are still growing, she added. \nThe largest retailers experienced stronger sales growth than the smallest retailers for the last five 12-month periods. \"While we don't know definitely why that's the case, it would make sense that the larger private retailers have more marketing dollars and more marketing resources to be able to grow revenue quickly and more effectively,\" Bierman said. \"Some examples may be a bigger web presence or more advertising compared to some of the mom-and-pop shops that may be included in the smaller retail averages.\" \nIn addition to seeing sales growth, private retailers -- particularly the smallest ones -- have experienced minor increases in profitability, Bierman said. \"That obviously means a lot to retailers, many of which typically rely on volume gains to boost sales.\" \nAverage net profit margin among retailers of all sizes has improved to 3 percent from 2.6 percent in the previous 12-month period. For retailers with less than $10 million in annual sales, net profit margin has improved by about half a percentage point, to 3.2 percent from 2.7 percent, based on Sageworks' data. Larger retailers in the analysis have experienced stable margins at around 2 percent in the last five 12-month periods. \nThrough its cooperative data mode l, Sageworks collects and aggregates financial statements for private companies from accounting firms, banks and credit unions. Net profit margins are adjusted to exclude taxes and include owner compensation in excess of their market-rate salaries. These adjustments are commonly made to private company financials in order to provide a more accurate picture of the companies' operational performance. \nSageworks, a financial information company, collects and analyzes data on the performance of privately held companies and provides accounting, financial analysis, and risk management solutions . \nFollow Mary Ellen Biery on Twitter: www.twitter.com/MELloyd More:", "external_links": [], "published": "2015-07-24T19:55:00.000+03:00", "crawled": "2015-07-25T00:18:13.105+03:00", "highlightTitle": ""}