{"organizations": [], "uuid": "744b7a3bb130ccba2fffe072603a9d1ced971cc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/dubai-airport.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/dubai-wins-best-airport-award-aflas/", "country": "US", "title": "Dubai wins the best airport award at AFLAS", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Dubai wins the best airport award at AFLAS - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "744b7a3bb130ccba2fffe072603a9d1ced971cc7"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/dubai-wins-best-airport-award-aflas/", "ord_in_thread": 0, "title": "Dubai wins the best airport award at AFLAS", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dubai wins the best airport award at AFLAS\nDubai International, the world’s number one airport for international passengers, has been named as the Best Airport in the Middle East at the Asian Freight, Logistics, and Supply Chain Awards (AFLAS) held in Hong Kong recently.\nHosted and organised annually by Asia Cargo News, the awards recognise leading service providers including air and shipping lines; air and sea ports; and logistics and other associated industry professionals. The nomination and voting process allowed the more than 15,000 readers of Asia Cargo News and e-news subscribers to first determine the leading companies in the market, and then determine the winners, making the results the opinion of service users.\n“Dubai International is known around the world for the speed with which it has transformed from a small regional airport to a global hub, but we also want to be recognised by our customers as well as the industry as an airport that provides the best airport experience. We believe this award represents that sort of recognition and we are very pleased to have won it,” said Anita Mehra, Vice President of Communication & Business Development at Dubai Airports.\nShe added that the AFLAS Award is the fourth for best airport category and the ninth overall that Dubai Airports has claimed so far this year.\nSource: Dubai Airports.\nRelated Posts TripAdvisor touches mark of 100 million downloads for free app for iPhone and Android Qatar Executive To Exhibit At Leading Business Aviation Show In Dubai Dubai Airport Terminal 1 await bids from retailers! Egypt’s tour guides’ new business: Producing opium MIA Director, National Counterparts Travel To Washington, D.c. To Make Case For Additional CBP Staffing", "external_links": [], "published": "2015-07-13T03:00:00.000+03:00", "crawled": "2015-07-13T18:04:53.000+03:00", "highlightTitle": ""}