{"organizations": [], "uuid": "eb847bdfe1158d4c5175ac41ef376101d2c96acb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/07/22/travel/images/30264959-01_big.jpg", "site_section": "http://www.nationmultimedia.com/home/rss/travel.rss", "section_title": "NationMultimedia.com - Travel", "url": "http://www.nationmultimedia.com/travel/INCHEON-PENTAPORT-ROCK-FESTIVAL-30264959.html", "country": "TH", "title": "INCHEON PENTAPORT ROCK FESTIVAL", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "INCHEON PENTAPORT ROCK FESTIVAL", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T21:00:00.000+03:00", "replies_count": 0, "uuid": "eb847bdfe1158d4c5175ac41ef376101d2c96acb"}, "author": "", "url": "http://www.nationmultimedia.com/travel/INCHEON-PENTAPORT-ROCK-FESTIVAL-30264959.html", "ord_in_thread": 0, "title": "INCHEON PENTAPORT ROCK FESTIVAL", "locations": ["INCHEON"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » travel » INCHEON PENTAPORT ROCK FESTIVAL FESTIVAL DIARY INCHEON PENTAPORT ROCK FESTIVAL THE NATION July 22, 2015 1:00 am \nRock artists, both local and foreign, are featured in the line-up of Incheon Pentaport Rock Festival. Incheon Pentaport Rock Festival is one of the biggest live music events in South Korea. INCHEON PENTAPORT ROCK FESTIVAL August 7 to 9, Incheon, South Korea Incheon Pentaport Rock Festival is one of the biggest live music events in South Korea. The event gets its name from its five main themes: music, passion, friendly environment, DIY (do it yourself), and friendship. Rock artists, both local and foreign, are featured in the line-up, creating an energetic international music festival. Visit www.PentaportRock.com. WORLD FOOD EXPO August 5 to 8, Manila, the Philippines The annual World Food Expo or Wofex at Manila's World Trade Centre brings together all segments of the Food and Beverage industry. The event attracts more than 50,000 visitors every year with baking demos, cooking demos, technical and business seminars, and much more. Wofex offers something for all foodies. It's also the home of the Philippine Culinary Cup, the most prestigious culinary competition in the country. Let the best chefs meet and compete! NATIONAL DAY PARADE August 9, Singapore A parade of the Singapore Armed Forces, harmonies from a 2,000-strong combined schools' choir and dazzling pyrotechnics are just part of the fun on Singapore National Day. Get into the mood of the celebration by wearing anything red and flying the Singapore flag. In the evening, the city skyline is lit up by a fireworks display. Don't forget to bring an umbrella or rain poncho to the show. Visit www.NDP.org.sg. THE GREAT BRITISH BEER FESTIVAL August 11 to 15, London, England The Great British Beer Festival is Britain's biggest beer event, boasting more than 400 British real ales, up to 60 perries and ciders and a range of new bottle-conditioned beers. There are wheat beers, ginger ales, beers flavoured with herbs and spices, mild and stouts from all over the UK, and 300 foreign brews, from Belgian and German to American. Enjoy live music, sample some food, including good traditional pub snacks, and also attend tutored beer tasting. Visit www.GBBF.org.uk. EKKA! - ROYAL QUEENSLAND SHOW August 7 to 16, Queensland, Australia The Royal Queensland Show, known by the locals as Ekka! has been bringing city and country together for more than 130 years. It celebrates Queensland’s lifestyle, industry and heritage at the RNA Showgrounds. Today the Ekka attracts more than half a million visitors for its mix of entertainment, agriculture and education. From Champion Rooster of Show to the glamorous fashion parades, Ekka has always celebrated the rural and the urban; the traditional and the innovative, and it is for this reason the event holds a special place in the hearts of Queenslanders and all visitors. Visit www.Ekka.com.au. MOBILE PHONE THROWING WORLD CHAMPIONSHIPS August 22, Savonlinna, Finland Mobile Phone Throwing is the only sport where you can pay back all the frustrations and disappointments caused by these pieces of modern equipment. Every August, the small Finnish town of Savonlinna plays host to the Mobile Phone Throwing World Championships. The event attracts hundreds of participants from around the world, eager to test this very special skill. 244 Viewed", "external_links": [], "published": "2015-07-21T21:00:00.000+03:00", "crawled": "2015-07-22T00:44:18.237+03:00", "highlightTitle": ""}