{"organizations": [], "uuid": "c978c5644a1377b4d54d7d954ab5b6b65542ba74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/03/Unesco.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/unesco-approves-extension-cape-floral-region-world-heritage-site/", "country": "US", "title": "UNESCO approves extension of Cape Floral Region as World Heritage SiteTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "UNESCO approves extension of Cape Floral Region as World Heritage SiteTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "c978c5644a1377b4d54d7d954ab5b6b65542ba74"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/unesco-approves-extension-cape-floral-region-world-heritage-site/", "ord_in_thread": 0, "title": "UNESCO approves extension of Cape Floral Region as World Heritage SiteTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UNESCO approves extension of Cape Floral Region as World Heritage Site Published on : Monday, July 6, 2015\nThe United Nations Education, Scientific and Cultural Organisation (UNESCO) approved the extension of the Cape Floral Region Protected Areas World Heritage Site. The approval was granted by the 39th Session of the UNESCO’s World Heritage Committee taking place in Bonn, Germany which started on June 28 to July 8.\nThe Cape Floral Region is one of the eight South African World Heritage Sites with the other seven being Fossil Hominid Sites of South Africa, iSimangaliso Wetland Park, Robben Island, Maloti-Drakensberg Park (Transboundary with Lesotho), Mapungubwe Cultural Landscape, Vredefort Dome and Richtersveld Cultural and Botanical Landscape.\nThe Cape Floral Region was first inscribed onto the World Heritage List in 2004. At the time of inscription, the site was made up of 8 protected areas comprising about 553,000 hectares.\nThe eight protected areas are located in the Eastern Cape and the Western Cape provinces and are managed by the Eastern Cape Parks and Tourism Agency, Cape Nature and the South African National Parks (SANParks).\nThe extension brings the size of the World Heritage Site to 1,094,742 hectares thus significantly increasing the size of South Africa’s protected areas with outstanding international recognition.\nThese include Table Mountain National Park, Agulhas Complex, Langeberg Complex, Anysberg Nature Reserve, Swartberg Complex, Baviaanskloof Complex and the Garden Route Complex.\nThe extension also increases the number of protected area clusters making up the Cape Floral Region from eight to 13.\nThe extension also marks a new era in South Africa’s listing of World Heritage Sites. The last time South Africa had a site inscribed on the World Heritage List was in 2007 with the inscription of the Richtersveld Cultural and Botanical Landscape.\nSince then the government shifted its focus to improving the management of the sites that are already inscribed and to put in place measures to minimise challenges experienced in world heritage sites.\nAs a result, no new nominations were submitted to UNESCO from 2007 until now. The extension of the Cape Floral Region is the first nomination to be submitted after the development of the Procedure for Nomination of World Heritage Sites.\nAs new nominations are also being compiled, it is envisaged that in the next few years the number of World Heritage Sites in South Africa will increase and thus increasing the size of the conservation estate.\nThe South African delegation is led by the Deputy Minister for the Department of Environmental Affairs, Barbara Thomson, who is supported by the South African Ambassador to France and permanent delegate to UNESCO, Rapulana Molekane.\nRelated Posts Global Coalition “Unite for Heritage” launched in Bonn by UNESCO Egypt’s tour guides’ new business: Producing opium Antalya Gazipasa Airport opens new terminal building Yemen’s Old City of Sana’a and Old Walled City of Shibam added to List of World Heritage in Danger Ha Long Bay in Vietnam – one of the great natural wonders of the world", "external_links": [], "published": "2015-07-06T03:00:00.000+03:00", "crawled": "2015-07-06T23:39:42.000+03:00", "highlightTitle": ""}