{"organizations": [], "uuid": "510d3b90b22555775bda6c62c767062d5c2525bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/7235ed53b015457a9d2b266c6ce04e8e-1200x1200.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/nation-world/clinton-to-make-boosting-wages-central-to-her-economic-plan/", "country": "EU", "title": "Clinton to make boosting wages central to her economic plan", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Clinton to make boosting wages central to her economic plan | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T03:56:00.000+03:00", "replies_count": 0, "uuid": "510d3b90b22555775bda6c62c767062d5c2525bf"}, "author": "KEN THOMAS", "url": "http://www.seattletimes.com/nation-world/clinton-to-make-boosting-wages-central-to-her-economic-plan/", "ord_in_thread": 0, "title": "Clinton to make boosting wages central to her economic plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Hillary Rodham Clinton will make boosting middle class incomes and wages the focus of her economic agenda, pointing to stagnant paychecks as the central challenge facing the U.S. economy.\nThe Democratic presidential candidate intends to lay out the themes of her economic plan in a speech on Monday, emphasizing the need for the real income of everyday Americans to rise steadily alongside corporate profits and executive compensation.\nWhile Republican candidate Jeb Bush has called for an annual growth rate of 4 percent, Clinton will assert that the nation’s economy should not be judged by a specific growth figure but rather by how much income increases for middle-class households.\n“For a typical working American, their income has not been rising anywhere near as fast as it should be rising, and that is the challenge we face,” said David Kamin, a New York University law professor who has advised Clinton’s campaign. “It’s not a new problem, and it’s going to take a holistic vision.”\nMost Read Stories How Edgar Martinez is already making Mariners hitters better Traffic death of boy stirs outcry in Issaquah The jury’s in: ‘True Detective’ Season 2 is not so hot Mount St. Helens, still steaming, holds the world’s newest glacier Bush’s 'work longer hours’ remark may follow him for a long time Clinton’s campaign on Saturday provided a preview of her speech to be given at The New School, a university in New York City. The campaign said the Democratic front-runner will point to economic progress during her husband’s two terms in the 1990s and more recently under President Barack Obama. But she will aim to identify ways of improving upon the uneven nature of the nation’s recovery since the Great Recession, bolstering wages even as the unemployment rate has fallen to a seven-year low of 5.3 percent.\nClinton on Saturday picked up the endorsement of the American Federation of Teachers union, the first major labor union to endorse a presidential candidate. The union is led by Randi Weingarten, a longtime Clinton ally, and comes as Clinton has sought the support of labor leaders.\nThe former secretary of state is expected to begin outlining a series of specific economic proposals this summer on issues like wage growth, college affordability, corporate accountability and paid leave.\n“It’s a new moment, and she’s bringing new ideas to the table of how to do that,” said Neera Tanden, a former Clinton policy adviser who leads the Center for American Progress.\nIn Clinton’s approach to the economy, more Americans would share in the prosperity and avoid the boom-and-bust cycles of Wall Street that have led to economic turbulence of the past decade. She is also expected to argue that the nation should not be fatalistic about globalization and that specific policy steps can help U.S. workers achieve better living standards.\nClinton, who is seeking to become the nation’s first female president, is also expected to address ways of making it easier for women to join the workforce.\nIn framing an economic vision, Clinton will attempt to meet the demands of liberals within her own party who are wary of her willingness to regulate Wall Street while inspiring confidence among a larger electorate who will judge her policies if she wins the Democratic nomination.\nProgressives encouraged Elizabeth Warren to seek the presidency, but the Massachusetts senator, who has railed against Wall Street and corporate excesses, declined to run. Many of those same liberals are now packing large gatherings held by Vermont Sen. Bernie Sanders, who is challenging Clinton for the nomination and has made economic inequality the chief plank of his campaign.\nAlan Blinder, a Princeton University economist and former economic adviser to President Bill Clinton, said the former first lady has expressed interest in policies to curb excessive risk on Wall Street, such as a financial transactions tax on high-frequency trading, taxes on large Wall Street banks based on their risk profile and eliminating the so-called carried interest loophole that allows managers of hedge funds and private equity firms to pay a lower tax rate than most individuals.\n“I’m pretty sure that as the details come out you and others will judge them to be more anti-Wall Street than pro-Wall Street,” Blinder said. “This is not going to look like an agenda that came out of a bunch of Wall Streeters.”\nClinton has said she will take nothing for granted in the primary contest, but the economic message will allow her to begin contrasting herself with Republicans. In recent speeches, she has portrayed the Republican presidential field, including Bush, the former Florida governor, as supportive of “top-down” economic policies and large tax breaks for the wealthy.\n“They’re back to the trickle down, cut taxes on the wealthy and everything will be fine,” Clinton said last week in Iowa. “This will be the biggest economic debate, because they know the only way they can win the White House back is to somehow convince voters that what we have done didn’t work.”\n___\nFollow Ken Thomas on Twitter: https://twitter.com/KThomasDC\nKEN THOMAS", "external_links": ["https://twitter.com/KThomasDC"], "published": "2015-07-12T03:56:00.000+03:00", "crawled": "2015-07-12T06:10:49.000+03:00", "highlightTitle": ""}