{"organizations": ["Calgary Stampede"], "uuid": "66371126e8caef6bbee5437758718257585eaccc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canada.com", "main_image": "http://www.canada.com/cms/binary/11194810.jpg", "site_section": "http://rss.canada.com/get/?F178", "section_title": "canada.com Travel Picks", "url": "http://www.canada.com/life/food/Deep+fried+everything+Calgary+Stampede+midway/11194807/story.html", "country": "CA", "title": "Deep-fried everything at the Calgary Stampede midway", "performance_score": 0, "site": "canada.com", "participants_count": 0, "title_full": "Deep-fried everything at the Calgary Stampede midway", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T23:50:00.000+03:00", "replies_count": 0, "uuid": "66371126e8caef6bbee5437758718257585eaccc"}, "author": "", "url": "http://www.canada.com/life/food/Deep+fried+everything+Calgary+Stampede+midway/11194807/story.html", "ord_in_thread": 0, "title": "Deep-fried everything at the Calgary Stampede midway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Deep-fried everything at the Calgary Stampede midway Food tour of the Calgary Stampede midway has some surprises By Postmedia News July 7, 2015 \nI have come for the big dog. \nAnd also the lobster corndog. And possibly a deep-fried peanut butter and jelly sandwich. \nDeep fried things and things on sticks and, on occasion, deep-fried things on sticks are the mainstays of the midway each year the Calgary Stampede kicks off. Hybrid dishes combining the best of both worlds and sometimes the worst. I’m looking at you, grilled cheese glazed donut. This year was no exception as 27 new foods made their debut on the Calgary Stampede midway . \nScratch that. There were 26. \nSad for some — but not for this food writer — cockroach pizza was taken off the menu because the cockroaches didn’t make it across the border. Canadian Border Services Agency said it couldn’t comment specifically on the case of the missing cockroaches, but would say the unusual ingredient isn’t prohibited. \nThe bug-strewn pizza was anticipated to be one of the most talked-about foods leading up to this year’s Stampede — following in the footsteps of the scorpion pizza the year before. It was to be among the 27 new offerings on the midway this year, including Red Velvet Chicken Strips, a cactus burger and a foot-long pizza dog. Sadly, the $100 hotdog (a foot-long bratwurst infused with Remy Martin Louis XIII cognac — selling for $3,000 a bottle — and topped with Kobe beef, lobster and truffles) was not within my food-writer budget. \nInstead, I — with the help of several colleagues — tried seven of the new items and gave them their own categories for which they could be in the winner’s circle. \nBest disguise: Big Dog, $15 \nBilled as the “biggest dog,” this massive corn dog is exactly as advertised. Or is it? Underneath that corn batter coating, lies the secret: it’s actually three wieners impersonating a lone, long dog. But the sausage is nicely spiced and the cornbread coating crispy and hot, so I’m willing to overlook the misnomer. That said, this is awkward as all get out to eat. Eater beware. \nMost heart-stoppingly good: The Kabob, $12. \nIts name, The Kabob, does little to convey the deep-fried deliciousness that is this offering from The Peanut Butter Cupboard. Here, they take a classic, a good ol’ peanut butter and jam sandwich, and add the typical midway twist of deep frying it to golden brown, making the peanut butter meltingly soft and warming the jam into oozy goodness. Then they slap in a few deep-fried peanut butter cups for good measure. Decadent and rich, I recommend taking the offer to buy some milk to go alongside. Bring your own defibrillator. \nMost disappointing: Glazed Donut Grilled Cheese, $10. \nI like salty and sweet and I really like salty-sweet, but this was a sickeningly sweet combination of donut and melted cheese with ham that was the worst of both worlds. Purported to have a layer of cheddar and havarti, I figured the slab of white between the two donut halves was the havarti. And then I heard three chilling words: It’s not cheese. No, it wasn’t; it was a layer of cream cheese glaze so thick that it looked like a cheese slice. I ate a little donut coated in cinnamon and sugar as a palate cleanser. \nMost un-midway-like: Empanada Chaat from the Naaco Truck, $9. \nTrust the folks from the popular Naaco Truck to offer up a cross between a samosa and an empanada that encompasses lightly spiced potatoes in a crisp dough, topped with sour cream and other goodies. There’s a reason it was named — in a tie with the mini donut popsicle (keep reading) — the best food on the midway this year by a panel of judges. Hot and fresh, the tangy sour cream played off the Indian spices and it was all cooled with tomatoes, cucumber and onion. We devoured this immediately. \nMost unexpectedly tasty: Lobster corn dog, $12. \nPeople expecting chunks of lobster dunked in cornbread batter and served on a stick will be disappointed; it’s still labeled a corn dog after all. But the sausage, made from 90 per cent lobster and 10 per cent smoked pork (which helps make it into a wiener shape), is unexpectedly juicy and flavourful. Although, it has to be said, not discernibly flavoured of lobster. \nMost uncomfortable to eat in public: Crazy Cone, $5. \nIt is gluten free, lactose free and low in fat. It is also incredibly uncomfortable to eat in public — and not just because it is teeth-achingly cold. It’s a hollow corn tube filled with soft-serve ice cream, in chocolate or vanilla, and topped with sprinkles, if desired. Think of it like Corn Pops cereal combined with ice cream. But all put together in an awkward package. \nBest hybrid: Mini Donut Popsicle, $5. \nCaramel ice cream plus mini doughnuts, combined in popsicle forms equals a winning dessert. There’s a slight hint of cinnamon in the ice cream — no doubt a nod to the cinnamon and sugar that coats the famous little donuts — and a few bites are punctuated with the deep-fried dessert. Refreshing, it was not too rich or decadent; an excellent counterpoint to the rich, deep-fried goodies elsewhere on the midway. One key piece of advice: don’t let it melt, or the donuts get a bit soggy.  ", "external_links": [], "published": "2015-07-07T23:50:00.000+03:00", "crawled": "2015-07-08T04:24:38.000+03:00", "highlightTitle": ""}