{"organizations": [], "uuid": "7a306c230db7fddfcf2e1d5f7e832d69beaf52b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/thomas-cook-reviews-commission-payments/4697933.article", "country": "GB", "title": "Thomas Cook reviews commission payments", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Thomas Cook reviews commission payments", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T12:00:00.000+03:00", "replies_count": 0, "uuid": "7a306c230db7fddfcf2e1d5f7e832d69beaf52b9"}, "author": "", "url": "http://www.ttgdigital.com/news/thomas-cook-reviews-commission-payments/4697933.article", "ord_in_thread": 0, "title": "Thomas Cook reviews commission payments", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Thomas Cook"], "text": "Thomas Cook reviews commission payments 22 July 2015 Save \nThomas Cook is reviewing its commission payments for third-party agents, its new commercial director has revealed. \nThe vertically integrated operator originally made the decision to “adjust” its payments to independent partners in April this year - a move that was widely criticised by many in the industry.However, Chris Mottershead, who was internally appointed as commercial director last week, has admitted that the policy was now under review.He added: “We most definitely wish to have the support of third- party agents and it has got to be on a win-win basis. Those that are prepared to support us positively, we will do likewise.“It has to be case by case; not only do we have to look at our model but we have to look at their model.“There are so many third-party agents. It depends on what’s important to them and whether we can work together.“If they just want to sell our package holidays to fill a small hole in their portfolio, I don’t think it is a good place for Thomas Cook, but those that see us as a major part of their business, then that’s a conversation we can have.”Mottershead was talking to TTG as the operator hard-launched its full 2016 summer programme.He added the travel giant still had faith in its Greece product, despite its recent economic woes, and had added Thassos to its programme while some of the 25 new properties featured are on some of Greece’s main islands.“We’re still confident about Greece,” Mottershead said. “We haven’t really seen a significant impact over the last few weeks mainly because we were particularly well sold over the peak period.”The launch of the programme came as Cook announced a new “strategic partnership” with Club Med which aims to drive £100 million of annual sales of its product via the operator by 2018, representing a 60% increase.Closer ties between the two companies have been expected since Club Med’s owner, Fosun, took a 5% stake in Cook in March. It also follows the operator’s divestment of Neilson, which sold similar product, in November 2013. Readers' comments (1) Anonymous | Wed, 22 Jul 2015 1:58 pm \nyou certainly do need the support of 3rd party agents, as do all tour operators, good decision to review this Chris Mottershead, I will definitely get behind the brand if the commission increased!", "external_links": [], "published": "2015-07-22T12:00:00.000+03:00", "crawled": "2015-07-22T20:05:27.916+03:00", "highlightTitle": ""}