{"organizations": [], "uuid": "27feb1993903512915a3273850883dcd3bd8b166", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03385/Norton_20_high_3385084k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-25.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/culture/culturenews/11755526/Life-In-Squares-star-James-Norton-acting-is-a-neurotic-profession-I-always-need-to-get-away.html", "country": "US", "title": "Life In Squares star James Norton: 'acting is a neurotic profession, I always need to get away'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Life In Squares star James Norton: 'acting is a neurotic profession, I always need to get away' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T15:00:00.000+03:00", "replies_count": 0, "uuid": "27feb1993903512915a3273850883dcd3bd8b166"}, "author": "Guy Kelly", "url": "http://www.telegraph.co.uk/culture/culturenews/11755526/Life-In-Squares-star-James-Norton-acting-is-a-neurotic-profession-I-always-need-to-get-away.html", "ord_in_thread": 0, "title": "Life In Squares star James Norton: 'acting is a neurotic profession, I always need to get away'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "James Norton, 30, is an actor best known for his roles in ITV’s Grantchester and the BBC’s Happy Valley, for which he was nominated for a Bafta. Norton was raised in North Yorkshire and read theology at Fitzwilliam College, Cambridge, before pursuing acting at Rada. He will play the artist Duncan Grant in Life In Squares, a new drama about the Bloomsbury Group, starting on BBC Two on July 27. Norton lives in Peckham, south London. Routine I get up around nine o’clock on a regular day and five or six if I am shooting. I cannot function without a good breakfast: porridge in the winter and muesli in the summer. I grew up in the countryside so I feel guilty if I am inside too much. As a result, every day I have to go out and do something, like riding my bike. Someone once told me I am always trying to overtake London, and they’re probably right. I can get quite manic. (VICTORIA BIRKINSHAW) Religion I have always been drawn to Eastern religions. I don’t practise anything, but as an outsider I find their way of thinking fascinating. Before university I travelled around India and Nepal learning about Hinduism and Buddhism, which I went on to structure my theology degree around. On a later return trip, an ex-girlfriend bought me this mandala [above left]. It’s a Buddhist meditation tool; the idea is to use the repetitious pattern to focus your mind. Tailoring I’ve always liked vintage clothing. A friend of mine runs a pop-up shop nearby that I help stock the menswear section for; it means I can buy what I want and sell it if it doesn’t fit. I make sure to find a flea market wherever I am shooting. I found this herringbone coat in Doncaster. They would be amazed how sought after things like that are in London. (VICTORIA BIRKINSHAW) Bookshelf One of the great privileges of being an actor is that you get to engage with little snapshots of humanity for a while, like Duncan Grant and the Bloomsbury Group. Often this involves reading a few novels and studies as research, so my bookshelf has become a record of my career. Stage debut The first character I ever played was Gwen Stefani in a school miming competition in 1998. I was utterly terrified at first, and just stood there demurely tapping my foot, but then everyone began cheering. All of a sudden I started enjoying it, strutting up and down the stage and lapping up the applause. I completely forgot about it, but a few years ago my old French teacher sent me the DVD. It captures the moment I realised I wanted to act in front of people. (VICTORIA BIRKINSHAW) Tuck box I went to boarding school from the age of 11 and loved it. When you’re a boarder your tuck box is the most important thing you own. Tuck was currency, so a well-stocked and well-locked supply was essential. I still have my original box, which now contains 25 years of jumbled-up postcards, letters and theatre tickets. It has become a store for anything that is important to me. Rambling Maybe it’s something to do with turning 30, but I recently became a member of both the National Trust and the Ramblers. I love it. Last year I climbed the Brecon Beacons, Lake District and South Downs. I like the idea of being able to get out of London and climb a hill. (VICTORIA BIRKINSHAW) Diving in Acting is quite a neurotic profession: you spend a lot of time in your own head and have to be fully concentrating – otherwise you’re wasting everybody’s time. It lacks the meditative repetition of a regular job, so I like to get away as much as possible. Since I was a kid I have loved wild swimming. There’s something about jumping into a big body of water that I find very calming and refreshing. I’ve got books on it, and take road trips to find the best spots. Twang I spent the first 18 years of my life in Yorkshire, but I no longer sound like it. I find occasionally I have to justify myself to people – mostly other Yorkshiremen. I still visit quite a lot, and when I’m home the accent creeps back in. Doing Happy Valley was a blessing, as Tommy had a West Riding accent that I could easily slip into. (VICTORIA BIRKINSHAW) Cooking At university at first all I ate was beans on toast, but that had changed by my final year when I lived with a big group of friends. We often ate together, and I got more and more into cooking. I wouldn’t say I do fine dining, but I love getting people round a table for a feast. My sister gave me this cooking pot, which is ideal as I always end up making three times the amount I need. (VICTORIA BIRKINSHAW) Bracelet There was a girl at Cambridge who directed my first few shows, a couple of which went to Edinburgh semi-professionally. She was older and became a bit of a mentor, convincing me that acting could be a career rather than just something I mess about with for a few years. She gave me a bracelet for my 19th birthday, then saw me a year later and swapped it for hers. I’m quite sentimental, so a decade on I still wear it every day in gratitude to her. Directing At some point I’d like to transition into directing. On set I spend a lot of time watching the technical craft of filmmaking, and it’s made me realise how much more I have to learn. As an actor you are effectively one brushstroke in a painting, which is liberating at times, but at others I find myself wishing I could have a greater role in the overall storytelling. Maybe I’m just a control freak. Life In Squares begins on Monday at 9pm on BBC2 telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-07-25T15:00:00.000+03:00", "crawled": "2015-07-27T08:56:45.411+03:00", "highlightTitle": ""}