{"organizations": ["Hindustan Times"], "uuid": "d4865ede686416a65101cd16c37f9b38b67572c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2009/3/9345f6ff-95a2-427b-be67-0b797c83a72fMediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Wellness", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/wellness/mumbai-stem-cells-help-boy-with-cerebral-palsy/article1-1373689.aspx", "country": "US", "title": "Mumbai: Stem cells help boy with cerebral palsy", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Mumbai: Stem cells help boy with cerebral palsy", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T17:23:00.000+03:00", "replies_count": 0, "uuid": "d4865ede686416a65101cd16c37f9b38b67572c6"}, "author": "", "url": "http://www.hindustantimes.com/wellness/mumbai-stem-cells-help-boy-with-cerebral-palsy/article1-1373689.aspx", "ord_in_thread": 0, "title": "Mumbai: Stem cells help boy with cerebral palsy", "locations": ["Mumbai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Priyanka Vora"], "text": "Priyanka Vora, Hindustan Times , Mumbai | Updated: Jul 27, 2015 19:54 IST \nTwo years ago, a Ghatkopar couple opted to bank the stem cells derived from the umbilical cord blood at their son’s birth. Within six months of his birth, the new parents noticed some functional abnormalities, making it difficult for the child to sit and grip. The parents took the infant to the paediatrician who diagnosed him of cerebral palsy with dystonia. The condition, doctors said, affects two to three children of 1,000 live births reported. \nAs the condition has no specific treatment, the only hope is physiotherapy exercises that help improve the motor functional disability. “While we were seeking different medical opinions, I recollected about the stem cell banking we had done. We contacted the laboratory and enquired if stem cells could help,” said the mother, adding that the child was born prematurely at 32 weeks. \nHowever, doctors at ReeLabs Stem Cell laboratory asked the couple to wait for a few months and started the autologous stem cell transplantation when the child turned 14 months. In August last year, the child was intravenously administered stem cells that were harvested in the lab from the umbilical cord. “We have treated patients with cerebral palsy in the past. This is the first case where we administered the stem cells harvested from the umbilical cord preserved at birth,” said Dr Abhijit Bopardikar, director of the lab. \nWith a two months interval, the child was given five infusions of autologous cord blood stem cells intravenously. “We observed his condition for six months and there were significant improvements in his muscle tone which reduced his dystonia. His drooling had reduced and was able to balance him better,” said Dr Borpadikar. Children with cerebral palsy are unable to control their neck movements and upper body, which too improved significantly, opined the doctors. Tags", "external_links": [], "published": "2015-07-27T17:23:00.000+03:00", "crawled": "2015-07-27T18:06:17.105+03:00", "highlightTitle": ""}