{"organizations": [], "uuid": "fa9003f33bd2670e0deffcfbb2f5d28102665a80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61273/world-routes-continues-attract-top-airlines", "country": "US", "title": "World Routes continues to attract top airlines", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "World Routes continues to attract top airlines", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T01:09:00.000+03:00", "replies_count": 0, "uuid": "fa9003f33bd2670e0deffcfbb2f5d28102665a80"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61273/world-routes-continues-attract-top-airlines", "ord_in_thread": 0, "title": "World Routes continues to attract top airlines", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "World Routes continues to attract top airlines Adv: \nJul 09, 2015 Adv: \nThe event is expected to attract up to 3,000 delegates, representing 300 airlines, 600 airports and over 100 tourism authorities, along with a number of other industry stakeholders to discuss the future of air service development. \nNetwork Planners and other key decision makers from a wide range of carriers will attend this year’s event which will take place in Durban from 19-22 September 2015. \nA number of the world’s top airlines by Available Seat Kilometres (ASK) will be attending the event this year in Durban, including US major, Delta Air Lines. The World Routes attendee and its subsidiaries operate over 5,400 flights a day, and serve an extensive domestic and international network that includes over 333 destinations. \nMiddle Eastern carrier, Emirates Airlines will also be in attendance at this year’s World Routes event, as well as Qatar Airways who have recently been named as the best airline at the Skytrax annual World Airline Awards. \nThe world’s largest low-cost carrier, Southwest Airlines, will be attending the event in Durban, as well as one of Europe’s largest airlines, Lufthansa. European giants, British Airways and Air France have also confirmed attendance at World Routes 2015. \nBoth China Southern and Air China will be attending this year’s event, as well as Turkish Airlines which was ranked fourth at the annual Skytrax World Airline Awards this year. Both KLM and Australian flag carrier, Qantas will also be in attendance. \nBoth Asia and Europe are particularly well represented at this year’s World Routes in Durban, with a total of 34 and 52 airline’s attending respectively, with a number of airlines still expected to register. \nThe AirAsia Group will be attending this year’s event, along with representatives from a number of its subsidiaries including those from India, Japan and the Philippines. \nThose wishing to meet with low-cost carriers can expect to see representatives from, easyJet, flydubai, Norwegian, Vueling and WestJet amongst others at the event in September. The full attendee list for World Routes can be found on our website. \nA large number of airports have already registered to attend the event, with many more still expected to join them. Attendees include Kilimanjaro International Airport, and Julius Nyerere International Airports in Tanzania from the African region, as well as Moscow’s Domodedovo International Airport and Sheremetyevo International Airport in the CIS region. \nNotable attendees from the Americas region include Boston Logan, Dallas/Fort Worth and Los Angeles in the US, and Sao Paulo – Guarulhos International in Brazil, while European airport attendees include Aeroports de Paris, Amsterdam Airport Schiphol and Manchester Airports Group. \nWorld Routes 2015 will take place at the Durban International Convention Centre (ICC), which has successfully hosted some of the world’s largest and most prestigious conferences. It has been voted “Africa’s Leading Meetings and Conference Centre” at the World Travel Awards 14 times in 15 years. \nRegister now to connect with aviation professionals from across the globe. \neTN is a media partner for Routes. Source: Routes", "external_links": [], "published": "2015-07-10T01:09:00.000+03:00", "crawled": "2015-07-10T02:39:13.000+03:00", "highlightTitle": ""}