{"organizations": ["Pregnancy Accommodations Carrie Hoffman Labor and Employment AttorneyGardere Wynne Sewell LLP", "EEOC", "James Berkeley Managing DirectorEllice Consulting Ltd", "CKE", "Ericsson", "ASIMCO Technologies", "UPS", "Wall Street Journal", "Reactions Business Club", "Deseret News", "Frieda Birnbaum Research Psychologist", "EdSource Today", "Caesars Entertainment Corporation", "International Expansion Summit", "U.S. Travel Association"], "uuid": "51570c78be63ccc63ee882ff8c47c10c9500bcf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_3_article_600px.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13208708/1/profnet-experts-available-on-internet-of-things-pregnancy-in-the-workplace-more.html?cm_ven=RSSFeed", "country": "US", "title": "ProfNet Experts Available On Internet Of Things, Pregnancy In The Workplace, More", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "ProfNet Experts Available On Internet Of Things, Pregnancy In The Workplace, More", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T19:12:00.000+03:00", "replies_count": 0, "uuid": "51570c78be63ccc63ee882ff8c47c10c9500bcf2"}, "author": "", "url": "http://www.thestreet.com/story/13208708/1/profnet-experts-available-on-internet-of-things-pregnancy-in-the-workplace-more.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "ProfNet Experts Available On Internet Of Things, Pregnancy In The Workplace, More", "locations": ["North America", "U.S.", "TheStreet.com", "Berkeley", "Dallas", "Australia", "Europe", "NEW YORK", "Americans", "Asia Pacific", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Birnbaum", "JoAnn Yamani", "Gandhi", "Rhonda Reddick", "Ryan McCormick", "Forbes"], "text": "ProfNet Experts Available On Internet Of Things, Pregnancy In The Workplace, More By PR Newswire | 07/06/15 - 12:12 PM EDT Reprint NEW YORK , July 6, 2015 /PRNewswire/ -- Below are experts from the ProfNet network that are available to discuss timely issues in your coverage area. You can also submit a query to the hundreds of thousands of experts in our network - it's easy and free! Just fill out the query form to get started: http://prn.to/alertswire . EXPERT ALERTS Workplaces Changing Views on Pregnancy Accommodations Evolution of IoT, Hardware Tech Brings Challenges for Developers and IT Departments Achieving Profitable Growth Americans Taking Fewest Vacation Days in Four Decades MEDIA JOBS Opinion Editor/Writer - Deseret News (UT) Editor - EdSource Today (CA) Police Reporter - Reading Eagle (PA) OTHER NEWS & RESOURCES Tweeting Live: 12 Tips for Covering Events The Blog Blog's Blogger of the Month PR Newswire Media Moves, July 6 Edition EXPERT ALERTS: Workplaces Changing Views on Pregnancy Accommodations Carrie Hoffman Labor and Employment AttorneyGardere Wynne Sewell LLP, Dallas office\"In my experience, employers frequently are too quick to determine that pregnant employees should not be entitled to special accommodations. Because of the Young v. UPS decision, employers now will be required to change that mindset. Although the court's ruling failed to grant 'favored nation' status to pregnant workers, it did require that they receive the same accommodations that are offered to non-pregnant employees who are temporarily unable to perform specific job requirements. Additionally, the court expressed serious concern that the EEOC's most recent guidance on pregnancy discrimination was promulgated after the court had granted certiorari and took a position about which the EEOC had previously been silent. Moreover, the EEOC's guidance contradicted the government's prior positions in other matters.\"Contact: Rhonda Reddick , rhonda@androvett.com Evolution of IoT, Hardware Technology Brings Challenges for Developers and IT DepartmentsDev GandhiCEOmoBack\"With all of the emerging possibilities for mobile that come with IoT, connected home and wearables come challenges for developers and IT Departments alike. As hardware technology continues to evolve, it's not just the user experience that's impacted, but the fundamental way we think about and develop our apps. People are interacting with their technology in brief moments and across multiple screens throughout the day, and the traditional concept of the 'app' is starting to become obsolete.\" Gandhi is an expert in mobile development and the mobile economy, as well as technology trends as they relate to mobile. He founded Nexage, which was eventually sold to Millennial Media for $108 million . His most current venture is moBack, a new enterprise Mobile Backend-as-a-Service (MBaaS) company. One of the key products of moBack is moBack Enterprise, a self-deployable MBaaS platform that helps developers build and deploy mobile and Web apps faster and at a lower cost. With moBack's self-deployable platform, businesses now have instant access to an easy, secure and scalable backend platform to develop mobile apps, while enjoying full control and customization capabilities. This announcement marks the launch of a multi-phase rollout of the cloud-based platform, which allows large enterprises and startups to rapidly scale their existing infrastructure to roll out mobile and Web apps. Contact: JoAnn Yamani , Joann@gutenbergpr.com Achieving Profitable Growth James Berkeley Managing DirectorEllice Consulting Ltd\"Growth for growth's sake is dumb. Profitable growth assumes you can distinguish it from fat and unhealthy growth. In the former, you are growing but decreasing productivity. In the latter, you are growing but increasing the risks of the firm's failure. You would be surprised how often executives confuse these alternatives and the attendant risks and rewards.\"Based in London , Berkeley is a consultant, coach and speaker who helps investors and portfolio company management achieve unprecedented levels of profitable growth and expansion. He has helped brands such as CKE Restaurants, Hilton Worldwide, Ericsson, Caesars Entertainment Corporation, ASIMCO Technologies, Now Health and more than 30 other market-leading organizations. His publishing includes regular position papers for boards, executives and senior management on critical and contemporary growth issues. He is a contributor to Wall Street Journal, Management Today, Forbes, TheStreet.com and more than 30 international media publications. He is a frequent attendee and contributor at international strategy, investment and industry events such as The Economist's High Growth Markets Summit, Reactions Business Club, Retail Bulletin's International Expansion Summit and the World Gaming Executive Summit. His career has taken him to 49 different countries. His distinctive experience, living and working in North America , Europe , Asia Pacific and Australia brings practical insight into the real world growth challenges executives and organisations face in different cultures. He is available to discuss profitable growth and expansion of insurance, financial services, professional services and private equity firms.Website: http://www.elliceconsulting.com Contact: james@elliceconsulting.com Americans Taking Fewest Vacation Days In Four DecadesDr. Frieda Birnbaum Research Psychologist, PsychoanalystThe great American summer vacation is on its way out, and the country's huge vacation deficit keeps on going. Each year, Americans fail to use 429 million vacation days, and with those days, $160 billion in economic opportunity is lost, according to the U.S. Travel Association. And certainly survey data from Skift -- for summer, international and yearly vacations -- can speak to that. About 62 percent of Americans said they won't be taking a vacation this summer at all. Says Birnbaum: \"All work and no play will be detrimental to your mental health in the long term. You owe it to yourself to take a break from work and stress even if you don't physically travel anywhere. Earlier generations of Americans made it a priority to take vacations, but they don't seem to do so anymore because they fear for the security of their job or for other reasons. When an adequate break is taken, a person's mental complexion can change dramatically for the better. Anxiety, depression, and even pent-up frustration can evaporate. For all those micro-managing executives who don't see their employees as people but as faceless worker bees, the best thing you can do is force your employees to take vacation. Their productivity will likely increase.\"Dr. Birnbaum is author of \"What Price Power: An In-Depth Study of the Professional Woman in a Relationship.\" She's an expert on depression, women's issues, and attaining happiness. She has been featured on \"Oprah\" and \"20/20\" as the oldest woman in the U.S. to have twins.Contact: Ryan McCormick , ryan@goldmanmccormick.com", "external_links": [], "published": "2015-07-06T19:12:00.000+03:00", "crawled": "2015-07-06T19:37:34.000+03:00", "highlightTitle": ""}