{"organizations": [], "uuid": "0b9848ec181a55b718c5e2143226b026733f9e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61747/what-nationalities-give-most-generous-hotel-reviewers", "country": "US", "title": "What nationalities give the most generous hotel reviewers?", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "What nationalities give the most generous hotel reviewers?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T11:18:00.000+03:00", "replies_count": 0, "uuid": "0b9848ec181a55b718c5e2143226b026733f9e71"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61747/what-nationalities-give-most-generous-hotel-reviewers", "ord_in_thread": 0, "title": "What nationalities give the most generous hotel reviewers?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What nationalities give the most generous hotel reviewers? Adv: \nJul 23, 2015 Adv: \nOne of the world's leading accommodation sites an, announced today the results of its most recent Travel Smarts survey, which shows the nationalities that give the best -- and worst -- hotel review scores on average. Russians emerged as the most generous, while travelers from the UAE are the most demanding. \nThe survey, conducted in July 2015, analyzed over seven million Agoda.com hotel reviews from travelers all over the world to see which nationalities tended to rate hotels higher or lower than average. Agoda.com travelers can submit reviews for hotels after every stay by scoring hotels on a scale of 0 to 10 in six categories. A hotel's review score is an average of those numbers. \nThe global average review score among Agoda.com travelers is 8.52 out of 10. \nRussian travelers tend to give the highest scores. As a group, they give hotel scores .56 review points higher than the global average. Egyptian, Irish and Polish travelers also give significantly higher scores. Chinese travelers placed in the top 10, coming in eighth. \nThe toughest reviewers are travelers from the UAE, who give scores .32 review points lower than average. Japanese, Omani and Indian travelers also give hotel review scores significantly lower than the norm. \n\"Travelers from different countries tend to have different review rating standards depending on their travel patterns, spending power, and just general likes and dislikes,\" says John Brown, Chief Operating Officer of Agoda.com. \"Our customers are from all over the world so our ratings will reflect the average. On our website and mobile app you can also read detailed reviews and even see which country each traveler is from,\" he adds. \nTravelers from Spain, Denmark, Canada, South Africa, Bahrain, Taiwan and South Korea submit reviews with scores closest to the global average. Their scores fall within .04 points of the norm. \nAverage Review Divergence by Nationality* 1", "external_links": [], "published": "2015-07-23T11:18:00.000+03:00", "crawled": "2015-07-23T17:40:42.537+03:00", "highlightTitle": ""}