{"organizations": [], "uuid": "5e7c3850c99b3670dbe9f3742e9e82291803cd2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03363/man-on-phone-compa_3363095a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-07.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/giulietta-business-edition/11715423/choosing-the-best-company-car.html", "country": "US", "title": "Six steps to choosing the best company car", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Six steps to choosing the best company car - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T23:18:00.000+03:00", "replies_count": 0, "uuid": "5e7c3850c99b3670dbe9f3742e9e82291803cd2d"}, "author": "Ernest Richardson", "url": "http://www.telegraph.co.uk/sponsored/motoring/giulietta-business-edition/11715423/choosing-the-best-company-car.html", "ord_in_thread": 0, "title": "Six steps to choosing the best company car", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Choosing a company car can be a mind-boggling experience. There are so many factors to bear in mind, and you want to get your selection absolutely right. But there’s no need to panic. As our guide shows, with a bit of thought you can easily identify the best company car for your needs. 1. The best company car keeps carbon emissions low Naturally, you’ll want to do your bit to safeguard the environment. But perhaps a bigger incentive is that company car tax rates are worked out on the basis of carbon emissions. By choosing a lower-emitting vehicle, you’ll pay Benefit in Kind (BiK) tax on a lower proportion of its official price, known as its P11d value. For example, the 120hp 1.6 JTDM-2 Alfa Romeo Giulietta Business Edition costs a basic-rate tax payer just £54 per month, thanks to its CO2 emissions of 99g/km. In a further fillip, low carbon emissions mean employers can offset more of a car’s purchase or lease cost against tax. So you’ll be keeping your boss happy as well as making your money go further. 2. The best company car has a cost-effective P11d value Sounds simple, doesn’t it? By choosing a car with the lowest possible P11d value, you’ll minimise your BiK burden in real terms. But you don’t want to compromise on specification, so it pays to choose wisely. The Giulietta Business Edition goes to show that safety needn’t come at the expense of style Look for a company car that offers what you want at the right price, such as the Giulietta Business Edition. This has been designed specifically for fleet drivers, so provides the equipment you’ll find most useful along with a highly competitive P11d value. 3. The best company car offers great fuel economy There’s no doubting that a company car is a real perk, especially if you choose a tax-efficient model. But you’ll still have to put fuel in the vehicle when you’re driving it for pleasure. It makes sense to choose an economical car, therefore. Opt for something like the Giulietta Business Edition and you’ll enjoy an official combined cycle figure of up to 74.3mpg along with the sort of performance you’d expect from an Alfa Romeo. Company car tax rates are worked out on the basis of carbon emissions 4. The best company car won’t cost the earth to insure Look at it from an employer’s point of view. They have to insure a whole fleet of cars, and often for occupations that carry a high risk factor. So the pressure to minimise insurance costs is plain. That needn’t commit you to making a boring choice, however. The Giulietta Business Edition compares favourably with many other more mundane hatches. But it delivers plenty of thrills behind the wheel, thanks in no small part to Alfa’s trademark D.N.A Driving Mode Selector. This enables you to set the car up so that its performance suits the prevailing conditions. That means better safety, and a much more involving drive. 5. The best company car keeps you out of harm’s way Let’s assume you’ll be covering a fair number of miles in your company vehicle. And let’s assume a proportion of these miles will involve transporting your nearest and dearest. You’ll want to choose a car with a good selection of safety features. The Giulietta Business Edition comes up trumps here as well, with standard equipment including six airbags, ABS and EBD, Isofix fitting points in the rear seats, and neat touches like a tyre pressure monitor. Which just goes to show: safety needn’t come at the expense of style. 6. The best company car won’t break the bank to repair You might not consider repair costs to be a major issue, since your employer will most likely pick up the tab. But think about the number of bumps and scrapes accrued across a company car fleet and you’ll soon see why this is an important consideration. That’s where equipment such as front and rear parking sensors, which are standard on the Giulietta Business Edition, come into their own. They reduce the risk of collisions when parking, helping to keep your company car pristine, and your employer on side. Don't forget to order a brochure about the Alfa Romeo Giulietta Business Edition or book a test drive", "external_links": [], "published": "2015-07-07T23:18:00.000+03:00", "crawled": "2015-07-07T19:20:24.000+03:00", "highlightTitle": ""}