{"organizations": [], "uuid": "e2bc413f7e73a1906f703fede397db9977c5bb1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153752-naadam--3-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/07/29/travel/google-mongolia-naadam-festival/index.html", "country": "US", "title": "Google Street View crashes Mongolia's Naadam Festival", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Google Street View crashes Mongolia's Naadam Festival - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T08:26:00.000+03:00", "replies_count": 0, "uuid": "e2bc413f7e73a1906f703fede397db9977c5bb1d"}, "author": "Nila Sweeney, for CNN", "url": "http://edition.cnn.com/2015/07/29/travel/google-mongolia-naadam-festival/index.html", "ord_in_thread": 0, "title": "Google Street View crashes Mongolia's Naadam Festival", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ulaanbaatar, Mongolia (CNN) After going underwater, climbing mountains and riding atop trains, Google Street View this month chalked up another achievement.\nIt's first festival.\nNot just any festival, but Naadam -- rugged Mongolia's annual display of horsemanship, marksmanship and muscle.\nAnd CNN got to tag along for the ride.\nHeld each summer in Ulaanbaatar (this year July 11-13), Naadam is also known as the Three Games of Men.\nIt features archery, wrestling and horse racing and was granted UNESCO Intangible World Heritage status in 2010.\nGoogle Trekker has 15 individual fixed-focused lenses capable of taking 360-degree panoramic shots roughly every three meters. Given its cultural significance to both Mongolians and the world, Naadam is a natural choice for the technology's first festival effort, says Alex Starns, who heads Google's Asia Pacific Street View Operation.\n\"I think Naadam is a perfect example of something that's truly unique to Mongolia and it's a showcase of Mongolian culture and heritage,\" he says. \"We use the Google Street View as a way for people around the world to understand that.\"\nInitial setbacks\nTurns out it's easier for a horse to get into the Naadam stadium than a Google Trekker operator.\nEven with the right credentials, gaining entry to the opening ceremony wasn't as straightforward as expected.\nGuards at the gate initially refused operators entry, apparently unsure of what to make of the Google Trekker strapped on the operator's back.\nThe Trekker is a contraption with a ball head that houses 15 cameras used to capture images at a rate of two frames per second.\nAfter being shunted around and questioned a few times, the group was finally allowed in.\nBy this point, the crowd had already filled the 10,000-capacity stadium to the brim.\nA few moments later, cultural performances began with a mesmerizing display of traditional costumes, dancing, throat singing and vigorous marching.\nAfter the presidential speech, Google began shooting the festivities, walking around the field amid marching warriors and sword-wielding performers.\nDodging arrows and dust storms\nKids from five to 13 years old are used as jockeys, ensuring that races focus on the skill of the horses, not the riders. Getting in the middle of the archery event was particularly thrilling.\nArrows were flying all over the place -- anyone not paying attention could easily get hit.\nAt one point, I was walking in front of an archer without even noticing that I was directly in the firing line.\nI was too busy trying to keep up with Google Trekker operator Azaa, who somehow managed to dodge every arrow without looking up.\nThis excitement paled in comparison with the horse racing event, held about 20 kilometers from the city.\nThe many spectators riding their horses to the event inevitably created a dust storm that blasted the area throughout the race.\nAs the jockeys, some as young as five, emerged from the cloud of dust to cross the finish line, the crowd erupted in applause.\nAccording to local guide Timur Yadamsuren, Mongolian nomadic children learn how to ride a horse even before they can walk.\n\"By the time they turn four years old, they're seasoned riders and by five, the boys are ready to compete,\" he says. \"But when they hit 13, they have to retire from racing.\n\"The smaller Mongolian horses can no longer take their weight.\"\nOther Google projects in Mongolia\nTaking on the Naadam Festival is just a part of Google's activities in the country.\nGoogle has been mapping the Mongolian countryside since October 2014.\nUsers can now explore, albeit virtually, the rough and largely untouched landscapes of Mongolia without leaving their couches.\nSo far Google has captured breathtaking landscapes across five cities and six provinces , including Ulaanbaatar, Darkhan, Khentii, Dornogovi and Selenge.\nGoogle's local coordinator says Street View has to drive another 48,000 kilometers to cover the whole country.\nThe Web giant has partnered with Mongolia's three largest museums -- the National Museum of Mongolia, Fine Arts of Zanabazar Museum and Bogd Khaan Palace Museum -- to bring more than 200 pieces of Mongolian cultural pieces online.\nAccording to project supporters, being featured on Google Street View comes at at a fortuitous time for Mongolia.\nMuch-needed tourism boost\nAfter a heady economic boom in 2011, the country has suffered economic blows due to falling copper prices and low investor confidence.\nSusan Pointer, Google's Asia Pacific government relations director, says showcasing Mongolia's pristine landscapes and rich cultural heritage will help raise its profile.\nAriantuul, a Google Trekker operator, has climbed Mongolia's 1,600-meter Khar Zurkh Uul mountain with the 18-kilogram (40 pounds) contraption strapped to her back. She points to a 30% uptick in visitors to Pompeii that followed the Italian landmark's exposure on Street View.\nPointer says Cambodia's Angkor Wat complex saw similar results when Google released images of its 110 temples.\nD. Gankhuyang, Mongolian foreign affairs minister, has high hopes for exposure on the Internet.\n\"The technology initiatives can greatly enhance Mongolia's profile on the international stage,\" he says.\n\"High definition images of Mongolia's most significant landmarks on Google's platforms will inspire more tourists to visit our country.\n\"This will in turn enhance ties between Mongolia and the world.\"", "external_links": ["http://i2.cdn.turner.com/cnnnext/dam/assets/150727153752-naadam--3-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153752-naadam--3-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727160738-naadam--12-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153752-naadam--3-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153752-naadam--3-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153745-naadam--5-super-169.jpg", "https://www.google.com/maps/embed?pb=!1m0!3m2!1sen!2sus!4v1438158314117!6m8!1m7!1sVCnuZPlOvDrMcSzoLqdhVg!2m2!1d50.50288!2d100.166163!3f104.316055!4f14.314514000000003!5f0.7820865974627469", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153752-naadam--3-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727160738-naadam--12-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727160738-naadam--12-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153745-naadam--5-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153745-naadam--5-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727160738-naadam--12-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153745-naadam--5-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727160738-naadam--12-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153745-naadam--5-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153752-naadam--3-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727160738-naadam--12-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153745-naadam--5-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153752-naadam--3-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727153745-naadam--5-small-11.jpg", "http://googleasiapacific.blogspot.sg/2015/07/a-journey-of-5000-km-begins-with-single.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150727160738-naadam--12-large-169.jpg"], "published": "2015-07-30T08:26:00.000+03:00", "crawled": "2015-07-30T04:32:41.350+03:00", "highlightTitle": ""}