{"organizations": [], "uuid": "5ee6a6148487fbedbad216ac591a72dcbaa1fc40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/rita-cook/miata-in-the-city-for-the_b_7720958.html?utm_hp_ref=travel&ir=Travel", "country": "US", "title": "Miata in the City for the Fourth of July", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Miata in the City for the Fourth of July", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T15:18:00.000+03:00", "replies_count": 0, "uuid": "5ee6a6148487fbedbad216ac591a72dcbaa1fc40"}, "author": "Rita Cook", "url": "http://www.huffingtonpost.com/rita-cook/miata-in-the-city-for-the_b_7720958.html?utm_hp_ref=travel&ir=Travel", "ord_in_thread": 0, "title": "Miata in the City for the Fourth of July", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nIt's the weekend, it's the holiday and it's time to eat. So whether you're looking for the best burger or a place to sink your teeth into some authentic Mexican food with a side of tequila, look no further this Fourth of July if you're in Dallas and consider Dugg Burger or Lazaranda Modern Kitchen & Tequila. Even better, do it with the top down in the cool little 2015 Mazda MX-5 Miata. \nRoadsters never go out of style and the 2015 Mazda MX-5 Miata brand of roadster is a well loved and fine tuned machine. This year too, the Mazda folks added the 25th Anniversary Edition trim and there were some minor changes to the base Sport convertible trim with a cloth top versus vinyl from years past. \nIt's a tiny car, but it gave me a big smile as a scooted around the curves and turns, it just feels good as takes the road with precision and great handling no matter the situation. \nThe 2015 Mazda MX-5 Miata seats two and comes in four trims: Base Sport, Club, Grand Touring and the 25th Anniversary Edition. For this year's new 25th Anniversary Edition you get better leather inside, 17-inch wheels and the added Premium and Suspension packages standard. \nUnder the hood the 2015 Mazda MX-5 Miata offers a 2.0-liter inline four-cylinder engine with 167 horsepower on the manual and 158 horsepower on the automatic with 140-pound-feet of torque. If you opt for a sport it comes with a manual that is only five-speed, but the three higher trims will give you a six-speed manual transmission. Rear-wheel drive and all the trims also have a shift paddle option or, the base trim can be had for a little more money with a six-speed manual transmission. \nWhile a bit snug that is part of the reality of a roadster and while tight it was still a comfortable fit, I felt like I was in a rocket getting ready to take off. And taking off is exactly what you will want to do for the Fourth so begin by discovering one of Dallas's best burgers at Dugg Burger where you will find a simple menu, but not a simple taste. \nDugg Burger is located in Dallas' Lakewood area. These guys have created the perfect burger concept where the juicy style burger, complete with organic meat, is served inside a tasty bun. Even better, you get to choose your own fixings while the burger master digs out the bun and replaces it with your chosen ingredients. \nTurning the world of burgers upside down, Dugg Burger opened earlier this year and was founded by Jeff Braunstein, Martin Hennessy, Scott Spence and Jeremy Samson, four burger-loving restaurant industry veterans who collectively boast over 70 years of experience. \nA revolutionary burger concept indeed, Dugg Burger combines simplicity with innovation and the name appropriately comes from the unique process of digging out the top portion of the bun so as to reverse the burger-building process. \n\"Dallas is a burger town. People aren't even going to walk in the door if you don't have a great burger,\" says Braunstein. \"Guests have been loving our burger because our dug out bun lets them taste more of the meat and toppings. This process also allows us to provide a high quality, customized burger -- done quickly. We believe that was something missing here in Dallas.\" For toppings - well that is simple since you can choose from the \"Dugg Dozen\" toppings or take a chance on the day's rotating Lucky 13 topping, a surprise every day. \nWhat is not a surprise however, the Dugg Burger philosophy, which emphasizes guest customization while keeping pace with a faster moving style of foodie. \nOf course for Mexican food lovers who want some tequila to wash it down, check out Lazaranda Modern Kitchen & Tequila, offering a classic and contemporary Mexican cuisine meaning a meal Texans will love with a modern Mexico-style flare. Lazaranda is actually the first U.S. venture of veteran Mexican restaurateurs Mario Letayf and Antonio Marquez. \n\"We are proud to bring Dallas the food we serve in our restaurants in Mexico and that I prepare in my home. We invite you to enjoy and live Mexico,\" says Chef Marquez, whose 30-year career has brought him from Paris to Los Angeles, back to his native Mexico, and now to Texas. \n\"'Authentic' is a word that is frequently used,\" adds Letayf, who has owned and managed restaurants in Mexico for 20 years. \"Since Lazaranda serves the contemporary cuisine of Mexico. Lazaranda is truly the authentic restaurant that many others claim to be.\" \nIn keeping with a great kitchen and menu, Chef Marquez has a number of culinary degrees to bring to the Lazaranda kitchen from both Le Pot au Feu and the prestigious Le Cordon Bleu. Must-try menu items include the ceviche, one of the most versatile dishes of Mexican cuisine. Lazaranda offers a specialty section of ceviche with a variety of flavor combos or there is also the specialty dish called Chamorro, which is slow-roasted pork shank cooked in barbecue pits, wood-fired ovens or even in holes in the ground, where charcoal and hot stones serve as low-temperature ovens served with baked black or pinto beans. \nWhat word will you come away with after a meal at Lazaranda Modern Kitchen & Tequila, definitely authentic and the Tequila bar is worth a visit even if you aren't hungry. \nSo power up and get behind the 2015 Mazda Miata, did I mention it's 21 miles to the gallon in the city and 28 miles per gallon on the highway at a cost of $32,935 for the 2015 Mazda MX-5 Miata Grand Touring and can opt for a power or do-it-yourself convertible top too. I particularly liked the power convertible top since all you have to do is push a button and pull a lever then wait a minute and everything happens like magic up and down. \nNo matter what your preference this holiday weekend for food and fun, do it with the wind in your hair and celebrate the Fourth of July in style. \nFollow Rita Cook on Twitter: www.twitter.com/@ritacook13 More:", "external_links": [], "published": "2015-07-03T15:18:00.000+03:00", "crawled": "2015-07-03T18:51:58.000+03:00", "highlightTitle": ""}