{"organizations": [], "uuid": "2e35fd4523ab2d2b196aa328a9739ee7ea11563b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03377/700_3377738k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-16.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/earth/wildlife/11744095/Pine-marten-spotted-in-England-for-the-first-time-in-a-century.html", "country": "US", "title": "Pine marten spotted in England for first time in a century", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 4, "title_full": "Pine marten spotted in England for the first time in a century - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T21:50:00.000+03:00", "replies_count": 3, "uuid": "9aa087360c11e14ef4a1a864892a7b3816cf1c80"}, "author": "Isabelle Fraser", "url": "http://www.telegraph.co.uk/news/earth/wildlife/11744095/Pine-marten-spotted-in-England-for-the-first-time-in-a-century.html#post-0", "ord_in_thread": 0, "title": "Pine marten spotted in England for first time in a century", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With their cute ears and inquisitive, beady eyes, pine martens were officially declared extinct in England in the 1990s, and haven't been seen in the wild in more than a century. But a recent sighting has proved that pine martens are moving back. Amateur wildlife spotter Dave Pearce took two pictures of the creature in a wood in Shropshire last week, confirming the rumours that for years had suggested the pine marten might be back in the country. A pine marten (PA) Stuart Edmunds, chair of the Shropshire mammal group, verified the sighting, and said: \"There is a real possibility that they may have been living here right under our noses for a long time. “There have been rumours of pine martens in England on and off for years. Most of these, on close enquiry, have proved to be domestic cats, mink and even black squirrels.\" The Telegraph previously described how the pine marten \"has a fondness for jam sandwiches and chicken wings\", and reports that the species was protected by decree of the king in medieval times and its rich brown fur restricted for royal use. It became the rarest carnivore in Britain after the wild cat due to people trapping and shooting it, as well as loss of its habitat, and it was classed as an endangered species in 1981. • Pine marten invades football pitch and bites player • Meet the small mammal that is one of the world’s most endangered species A pine marten (PA) The pine marten is the size of a house cat, and a member of the stoat and weasel family. They exist in healthy numbers in Scotland, and it is thought that the one spotted in Shropshire may have lived over the border in Wales, where they live around Snowdonia. The animals, which travel up to 20 miles per day, are hard to spot because they are nocturnal and during the day live in trees. The pine marten is similar to a stoat but significantly larger and is easily confused with fox cubs. It can reach 30in long, has a long bushy tail, dark fur coat and white bib. • Remove pine martens to safeguard capercaillie, say gamekeepers • Tricks and tips to attract wildlife to your garden Follow @telegraphnews", "external_links": [], "published": "2015-07-16T21:50:00.000+03:00", "crawled": "2015-07-16T18:42:06.000+03:00", "highlightTitle": ""}