{"organizations": [], "uuid": "6885daa525ea8c713d77050fe47d582c2d5bdc52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/world-heritage-city-of-bath-launches-bath-after-5-campaign/", "country": "US", "title": "World Heritage City of Bath launches ‘Bath After 5′ campaign", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "World Heritage City of Bath launches ‘Bath After 5′ campaign | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "6885daa525ea8c713d77050fe47d582c2d5bdc52"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/world-heritage-city-of-bath-launches-bath-after-5-campaign/", "ord_in_thread": 0, "title": "World Heritage City of Bath launches ‘Bath After 5′ campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "World Heritage City of Bath launches ‘Bath After 5′ campaign\nBath’s new summer ‘Bath After 5’ campaign sees major tourist, spa and wellbeing attractions across the city opening their doors late on Thursday evenings throughout the month of August.\nThe initiative aims to encourage greater footfall and give people more time to see the attractions, allowing locals and tourists alike to make the most of the World Heritage City of Bath.\nRediscover your inner ‘Culture Vulture’ in Bath\nThroughout August (Thursdays only), Bath’s eclectic mix of museums will be keeping their doors open later to make the most of the summer hours, allowing you to see exhibitions in a completely different light.\nNo.1 Royal Crescent\nNo.1 Royal Crescent will be offering atmospheric evening tours throughout the month of August (Thursdays, starting at 6pm and 6.30pm).\nEnjoy the atmospheric interiors of this wonderfully preserved Georgian townhouse; explore the contrasting world of downstairs and upstairs. Don’t forget to explore your inner child and check out the ‘Small Worlds’ exhibition of 18th and 19th century dollhouses.\nMuseum of Bath Architecture\nThrough the month of August (Thursdays, 5-7pm), explore ‘Words and Music’ at the Museum of Bath Architecture where you can discover the story of the City’s architecture accompanied by live music and spoken word from various Bath folk singers and storytellers.\nThe Roman Baths\nTorch-lit summer evenings at the Roman Baths will be taking place throughout August, with last entry at 9pm. Explore the atmospheric surroundings of the steaming Great Bath, walk across 2,000-year-old pavements and discover perfectly preserved Roman artefacts.\nThe Pump Room will also be open late on Thursdays for dinner and drinks, with last orders at 9pm. Dine to live music from the Pump Room trio and resident pianist every evening throughout August. Twilight Dinner and Tour packages are also available throughout the summer.\nVictoria Art Gallery\nThe Victoria Art Gallery will be open late every Thursday throughout August. Take in the newly installed ‘Jane Austen’s Bath’ art exhibition which will be accompanied by authentic displays of Georgian and Regency dancing from the Bath Minuet Dancers and the Jane Austen Dancers (Thursdays, 5pm-7pm).\nFashion Museum\nThe Fashion Museum will open its doors until 7pm on Thursdays throughout August (last entry 6pm). Displays include ‘Georgians – Dress for Polite Society’, featuring Georgian dress alongside Georgian-inspired contemporary clothing; ‘Great Names of Fashion’, showcasing dresses by Dior, Balenciaga and Yves Saint Laurent; and this year’s ‘Dress of the Year’ by Gareth Pugh.\nFor fashion enthusiasts, the ‘Fashion Museum Backstage Tour’ offers a select ‘behind-the-scenes’ tour of the stored museum collection. Tours start at 5.45pm and finish at 6.45pm each Thursday evening throughout August.\nMuseum of Bath at Work\nFilms of the Desert: a short season of films inspired by the Clarks Desert Boot exhibition will be shown at the Museum of Bath at work including ‘Ice Cold in Alex’ (6th August), ‘The English Patient’ (13th August), and ‘Carry On Follow that Camel’ (20th August).\nSource:- Visit Bath", "external_links": [], "published": "2015-07-31T03:00:00.000+03:00", "crawled": "2015-07-31T18:12:05.358+03:00", "highlightTitle": ""}