{"organizations": [], "uuid": "bc9f5fc74a29418a6e172a4fc4c644cc2ad107ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61892/air-canada-offer-ancillary-products-through-arc-app", "country": "US", "title": "Air Canada to offer ancillary products through ARC app", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Air Canada to offer ancillary products through ARC app", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T01:03:00.000+03:00", "replies_count": 0, "uuid": "bc9f5fc74a29418a6e172a4fc4c644cc2ad107ab"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61892/air-canada-offer-ancillary-products-through-arc-app", "ord_in_thread": 0, "title": "Air Canada to offer ancillary products through ARC app", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Air Canada to offer ancillary products through ARC app Adv: \nJul 27, 2015 Adv: \nORLANDO, FL - Airlines Reporting Corporation (ARC) announced today at the 2015 Global Business Travel Association (GBTA) Convention that Air Canada will become the first carrier to offer ancillary products to its travel agency-ticketed passengers using ARC’s Better My TripTM mobile app. Products to be offered include Air Canada’s Preferred Seats product, advance seat selection, advance meal purchase, On My WayTM enhanced trip interruption protection service and day passes to Air Canada’s award-winning Maple LeafTM Lounges. \nBetter My Trip is a mobile trip management and monitoring app created by ARC for travel agencies to brand as their own. The mobile app improves an agency’s client travel experience by combining agency, supplier and post-ticketing airline content into one location, as opposed to downloading and deploying multiple apps. Better My Trip also allows travelers to directly contact agents for before, during and post-trip support and service. Agencies deploying Better My Trip receive applicable commissions for bookings and purchases made through the app. Air Canada expects to begin offering ancillaries via Better My Trip in conjunction with a major travel management company in the fourth quarter. \nMore information concerning Better My Trip is available in ARC’s booth (#551) during GBTA exhibition hours. \n“Air Canada is continually focused on working with our technology partners to identify solutions that bring value to our customers,” said Keith Wallis, Air Canada’s director, global product distribution. “Better My Trip realizes that goal by providing a tool that will help our travel agency partners better service their Air Canada customers. At the same time, it will provide Air Canada with access to an extensive new network to market our unique product and brand.” \nBy offering its ancillary products through Better My Trip, Air Canada will extend the carrier’s products across an additional mobile platform to reach more of its passengers. With this announcement, Air Canada joins other Better My Trip content partners that currently include Viator, CarTrawler, Park ‘n Fly, SuperShuttle and Limos.com. \n“We’re excited to be working with Air Canada to offer content to their agency-ticketed passengers through Better My Trip,” said Doug Mangold, ARC’s managing director of product. “The company’s initiative and engagement with both its agency partners and ARC has been a superb example of innovation and cooperation within the industry. ARC looks forward to the prospect of more air carriers interacting with their passengers through Better My Trip.”", "external_links": [], "published": "2015-07-28T01:03:00.000+03:00", "crawled": "2015-07-28T01:09:23.410+03:00", "highlightTitle": ""}