{"organizations": [], "uuid": "ca6737dfe17d9572ff92418ae0cd523bf5c5c6cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gouk.about.com", "main_image": "http://f.tqn.com/y/gouk/1/S/E/G/0/-/GettyImages-149685943.jpg", "site_section": "http://z.about.com/6/g/gouk/b/index.rdf", "section_title": "About United Kingdom Travel", "url": "http://gouk.about.com/od/theedinburghfestivals/p/Edinburghfringe.htm", "country": "US", "title": "The Edinburgh Fringe Festival - Quick Facts", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "The Edinburgh Fringe Festival - Quick Facts", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T14:49:00.000+03:00", "replies_count": 0, "uuid": "ca6737dfe17d9572ff92418ae0cd523bf5c5c6cb"}, "author": "", "url": "http://gouk.about.com/od/theedinburghfestivals/p/Edinburghfringe.htm", "ord_in_thread": 0, "title": "The Edinburgh Fringe Festival - Quick Facts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Find how to put on a show at the Edinburgh Fringe. A bit of background \nIn 1947, the Edinburgh International Festival was organized to perk up post war Britain. The Fringe Festival began along side it, as an informal opportunity for less established and more off beat artists. In those days, it was known as the Edinburgh Festival Fringe. \nNowadays, it's the Edinburgh Fringe Festival and there is plenty in that subtle rearrangement of words. The Edinburgh International Festival continues to host important theatre, music and dance companies from around the world and is a very prestigious affair. But when it comes to an arts party to beat the band, the Fringe Festival is the whole enchilada. The biggest arts festival in the world? \nThat's a pretty big claim but the Edinburgh Fringe Festival has the amazing facts to back it up. Here are a few: 3,314 shows will be staged for the 2015 festival. In 2015, 50,459 performances are scheduled in 313 venues - 14 of them new and unique for 2015. Tens of thousands of performers, representing companies from 49 countries will appear. In 2014, Festival organizers sold more than 2.18 million tickets - but hundreds of shows were absolutely free. In fact, in 2015, a total of 807 free shows are included in the program. 1,778 performances in 2015 will be world premieres. \nSo, pretty big then? Well, every year the Edinburgh Fringe gets bigger and, as usual, each year produces the biggest arts festival in the world, ever. What kinds of performances to expect \nPerformances range from stand up comedy, revivals of classic plays, one person performances to wildly avant gard, in-your-face productions in places like - believe it or not - a public toilet and a moving, double decker bus. \nThough every year is unique, the art forms scheduled for the festival in 2015 can give you an idea: Theatre - 27%", "external_links": [], "published": "2015-07-02T14:49:00.000+03:00", "crawled": "2015-07-03T00:47:03.000+03:00", "highlightTitle": ""}