{"organizations": [], "uuid": "343609a75f76ce557f2a85dde3f5d58987d6b9b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.abc17news.com", "main_image": "http://www.abc17news.com/image/view/-/34380928/highRes/2/-/maxh/640/maxw/640/-/gj28n0/-/tin-goose-jpg.jpg", "site_section": "http://www.abc17news.com/18455488?format=rss_2.0&view=feed", "section_title": "Travel Top Stories", "url": "http://www.abc17news.com/lifestyle/travel/fly-on-a-time-machine-called-the-tin-goose/34374578", "country": "US", "title": "Fly on a 'time machine' called the Tin Goose", "performance_score": 0, "site": "abc17news.com", "participants_count": 0, "title_full": "Fly on a 'time machine' called the Tin Goose", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T23:10:00.000+03:00", "replies_count": 0, "uuid": "343609a75f76ce557f2a85dde3f5d58987d6b9b9"}, "author": "", "url": "http://www.abc17news.com/lifestyle/travel/fly-on-a-time-machine-called-the-tin-goose/34374578", "ord_in_thread": 0, "title": "Fly on a 'time machine' called the Tin Goose", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Thom Patterson"], "text": "Fly on a 'time machine' called the Tin Goose Museum pieces still allowed to fly By Thom Patterson CNN \nThey call this airplane a time machine. Related Content \nAt nearly 90 years old, Ford Tri-Motors are museum pieces. They're the world's first all-metal, multi-engine commercial airliners. \nReally, it's hard to believe they still let these things fly. They're too historic. \nBut the so-called Tin Goose was flying at last week's aviation festival at Oshkosh, Wisconsin, so, as an aviation buff, I had to get aboard. \nYou have to watch your head when you enter this 50-foot plane through the rear hatch, and I immediately feel the adventure of early airline travel. Part of what gets my heart pumping is the plane's legacy. \nThey flew the first transcontinental airline-railroad routes. A Tin Goose was the first plane ever to fly over the South Pole. And Neil Armstrong's first flight as a passenger was aboard a Tri-Motor -- spurring him toward a career that took him to the moon. \nIt's a \"taildragger,\" meaning, the plane's rear sits lower on the ground than the nose. So, I grab the seat-backs and pull myself forward, up the narrow center aisle toward the front. Taking a seat, I notice the windows are dressed with curtains. The walls are decorated with wood paneling and elegant light sconces that remind me of an old luxury shipliner. \nThe newer seats in this plane are comfy enough, but originally, these planes had five lightweight wicker seats on each side of the cabin. No headrests. No fancy personal in-flight entertainment systems. \nThe pilots crank up the Tri-Motor's three super-loud radial engines. They rumble to a deafening roar and we're off, rolling toward the runway for takeoff. \nTaxiing across Wittman Regional Airport, I realize I'm not getting a complete sense of the 1920s airline experience. We have no luggage and no flight attendant. We aren't getting a chance to see the lavatory located in the back of the plane. \nBy the way, only 199 Tri-Motors were ever made. Just a handful still fly today. This particular Tin Goose is owned by the Liberty Aviation Museum in Port Clinton, Ohio. But back in the late '20s and early '30s, it was known as the City of Wichita. It served as a workhorse for an airline called TAT -- Transcontinental Air Transport, the nation's first coast-to-coast air-rail service. \nPassengers would take trains from New York City to Columbus, Ohio, and then board the City of Wichita for a flight with stops in Indianapolis, St. Louis, Kansas City, Wichita, Oklahoma and then on through Texas, New Mexico, Arizona and California. A one-way ticket would put you back about $350. \n\"Fire up the time machine,\" says one of the pilots. \"We are about to go back to 1928!\" \nI'm practically pressing my nose against the window glass as I watch the City of Wichita's wheels leave the ground on takeoff. It kind of pops up into the air all of a sudden -- no gradual lift off at all. \nFlying the plane feels \"kind of like driving a truck,\" laughs Christine Soucy, a Tri-Motor pilot who I met before my flight. \"It's big and it's kind of slow to respond. But other than that, it's a lot of fun!\" \nWe quickly grab air -- rising to an altitude of about 2,500 feet with a spectacular view of Lake Winnebago. Speed: about 100 mph. Perfect flying weather. One of the pilots rests his arm out an open cockpit window. \nOff to our right, I can see a second Tri-Motor in flight, which makes the experience feel even more like 1928. \nIn those days, when these planes flew over mountains at altitudes exceeding 8,000 feet, passengers' ears would pop. Worse -- those unpressurized cabins got a little chilly. Cabin heaters on the planes \"kept the temperature at a relatively comfortable 60 degrees,\" according to history site American Heritage. \nPilots -- usually men in their mid-30s making about $12,000 per year -- flew these planes from inside cramped cockpits, with very little legroom. \"There was a periscope through which the pilot could observe the tail assembly for signs of ice accumulation or mechanical malfunction,\" says American Heritage. \nOutside my window I can see thick flight control cables that connect the cockpit controls to the wings. Gauges are mounted on the engines, forcing pilots to monitor them by looking out the windows. \nThere was no food during my 25 minute flight. But the 1920s in-flight meals didn't offer much more. \nBreakfast service between Columbus and Indianapolis included \"small aluminum trays bearing coffee, rolls, and small bottles of milk,\" American Heritage reported. \nBy the time City of Wichita touched down in LA, total travel time from New York was just 48 hours! \nCompare that to coast-to-coast trains at the time that took 72 hours. \nNowadays, we can fly that distance in under six. ‹previous", "external_links": [], "published": "2015-07-27T23:10:00.000+03:00", "crawled": "2015-07-28T00:46:26.881+03:00", "highlightTitle": ""}