{"organizations": ["Priceline"], "uuid": "652325422f17b53eb90eced3aded25d223dd3b50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources2.news.com.au/images/2015/07/18/1227447/035670-4a03e0c4-2b4b-11e5-a439-5c856edaa69b.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/silent-giant-of-the-travel-world-is-changing-how-we-live/story-e6frfqfr-1227447037653?from=public_rss", "country": "IL", "title": "The invisible giant changing your life", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "The invisible giant changing your life", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T08:27:00.000+03:00", "replies_count": 0, "uuid": "652325422f17b53eb90eced3aded25d223dd3b50"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/silent-giant-of-the-travel-world-is-changing-how-we-live/story-e6frfqfr-1227447037653?from=public_rss", "ord_in_thread": 0, "title": "The invisible giant changing your life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Darren Huston"], "text": "Priceline CEO Darren Huston says we’ll soon feel like locals anywhere in the world. Source: Supplied \nMENTION ‘Priceline’ in Australia, and everyone will assume you mean a pharmacy. \nIn fact, it’s also the name of the world’s largest online travel giant, and you’re probably using it without even knowing. \nThe Priceline Group owns Booking.com, the biggest online booking service in Australia, as well as numerous well-known brands including Kayak (for flights), Agoda (hotels), and Europe-based services RentalCars.com and OpenTable (restaurants). \nThe $80 billion organisation is rapidly changing every aspect of how we travel, and it has big ideas for how technology can streamline our lives in the future. \n“We want to help people experience the world through technology,” Priceline CEO Darren Huston told news.com.au from Amsterdam, where the American company is based. “It’s about making the world a smaller place. \n“The old experience is that you would book your hotel and print off a confirmation page, but now everyone has a computer in their pocket. You want to be able to switch between mobile, PC and tablet. In five years, you may do everything with smartphone. That’s a profound change.” A different life is now at our fingertips, wherever we are. Source: Supplied \nDespite his excitement about technology, Mr Huston says the company is focused on the “end experience” for the traveller. He wants to see customers seamlessly book a flight and hotel on their phone, get directions from the airport when they land and check-in on arrival to record their feelings so far. “That flags any issues to the hotel so they can respond while you’re there, and make sure they don’t get a bad review,” he added. \nPriceline is now worth more than Yahoo and AOL combined, and its quiet dominance is causing some concern in an industry crowded with online travel agents. Last October, the Australian Competition and Consumer Commission approved Expedia’s purchase of Wotif after Booking.com outstripped Wotif, the former leader in Australia. \nWhile Wotif offered more domestic properties, Booking.com tapped into Australians’ love of overseas travel with a wider offering, and Priceline’s smart decisions in terms of technology and customer service gave them the edge. \nThe company has three offices in Australia and New Zealand — in Sydney, Melbourne and Auckland — and is planning to open another in the Gold Coast. Its call centres are all based in Europe, however, where multilingual staff can be easily brought under one roof. \nAgoda is based in Asia, and Priceline is constantly partnering with other services: recently OnStar in the US, which provides voice-activated internet in your car; Hotel Urbano in Brazil , which uses push notifications to match last-minute travellers with hotels that have empty rooms and Chinese travel agency CTrip . Booking.com’s offices are a nod to modernity, technology and travel. Source: Supplied \nBut all is not lost for Priceline’s competitors, which has to be good news for the consumer. \nThe company made $67m last year, mainly through the commission it charges to hotels. Others charge a commission to the customer. The opportunity is there for competing online travel agents, and even the accommodation owners themselves, to offer slicker alternatives. \nWhen the ACCC agreed to Expedia’s Wotif takeover , it noted that the online travel space was “dynamic”. While hotels have lost search rankings to big aggregators, providers of great deals and service can still ease their way in. \nTripAdvisor, Airbnb, HotelsCombined, Trivago, LastMinute.com, Skyscanner and niche agencies all have their advantages. It’s up to them to exploit those points of difference, meaning plenty of scope for the average traveller. \nMr Huston, former head of new networks at Starbucks and head of global consumer and online businesses at Microsoft, is enthusiastic about the fast-changing outlook. \n“In the future, I could show up in Melbourne and very quickly make decisions about where I want to stay, where I want to eat and feel like I know what activities I want to do. That’s very powerful. \n“You enter your destination and you can have it all at your fingertips — your smartphone helps you feel like a local. \n“I’ve lived in Tokyo and Canada, I’ve travelled extensively and I love technology and the internet. It’s taking all that and experiencing on a canvas that’s very global.” \nThe increased simplicity of global travel is already changing our lives, and it looks as though our horizons are only going to keep getting broader.", "external_links": [], "published": "2015-07-18T08:27:00.000+03:00", "crawled": "2015-07-18T09:50:13.000+03:00", "highlightTitle": ""}