{"organizations": [], "uuid": "4d3116b98e43bfd98420987c3c4df5385e43874c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/seattle-news/your-choice-shaken-citizens-of-seattle-run-or-succumb/", "country": "EU", "title": "Your choice, shaken citizens of Seattle: Run or succumb", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Your choice, shaken citizens of Seattle: Run or succumb | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T22:26:00.000+03:00", "replies_count": 0, "uuid": "4d3116b98e43bfd98420987c3c4df5385e43874c"}, "author": "Ron Judd", "url": "http://www.seattletimes.com/seattle-news/your-choice-shaken-citizens-of-seattle-run-or-succumb/", "ord_in_thread": 0, "title": "Your choice, shaken citizens of Seattle: Run or succumb", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Whew.\nIt took while, but we now get it.\nThe leak of that plan to stack incoming Amazombies three high , literally on top of longtime residents in single-family neighborhoods? That was just clever performance theater, designed to prepare everyone for the inevitable 9.0 gizzard-rattling coastal earthquake that set interweb message boards on fire last week.\nThe announcement that the fiber of the city has been refabricated by a committee of fringe activist wonks (pardon the redundancy) is City Hall’s theatrical rendition of “The Big Boom.” Staying true to geologic form, this was followed mere minutes thereafter by Mayor Ed Murray’s powerful tsunami of lies, parsing and obfuscation that it’s really not such a big deal.\n Just like the real megaquake, the Seattle lifestyle temblor presents Legacy Citizens with a clear Hobson’s choice: Run like hell for higher ground, or lie back, close your eyes, and succumb.\nJust don’t expect your own puny protestations to impede the natural flow.\nMore dessert-plate tectonics:\nThis Week’s You-Might-Be-A-Legacy-Citizen-If Update: Nobody lives on top of you. Yet.\nIt Just Gets Bigger and Better: A local team is planning a new 880-foot skyscraper for Second Avenue. It will be the city’s second-tallest skyscraper — aside from that one someone is about to build next to your house in Ballard.\nIn Case You Wondered: Why did the Seattle Seahawks choose the laughably Orwellian term “Dynamic Pricing” to describe their new plan to gouge even more money out of fans for games in higher demand? Because “Craptastic Pricing” was already taken.\nSpeaking of Which: Is anyone else yearning for autumn, when football players’ idiotic on-field antics can be endlessly dissected by TMZ-inspired journos instead of their idiotic off-field behavior?\nThis Just In: The Old Spaghetti Factory will soon be turned into Something Else , thanks to a $9 million purchase by thousands of anti-gluten zealots who pooled their monthly allowances.\nOne Thing to Know About All Those Boneheaded “Five Things to Know” Online Lists: It’s the Thousand Other Things You Don’t Know that ultimately will kill you.\nOminous Headline of the Week: Straight from Tri-Cities: “Atomic bomb test marks 70th birthday amid renewed interest.”\nSeriously: Renewed interest?\nSpeaking of Large Holes in the Ground: Not sure whether we should be pleased, or horrified, to hear the inevitable rumors that Seattle Tunnel Partners was a subcontractor on the job that sprung Mexican drug lord Joaquin (El Chapo) Guzman out of that (ahem) maximum-security prison.\n Related video: Earthquake warning system John Vidale, director of the Pacific Northwest Seismic Network, explains how an early warning system could alert people before an earthquake hits. Read more . (Steve Ringman & Corinne Chin / The Seattle Times) Interesting Technical Difference Between El Chapo Escape and Upstate New York Escape: Instead of frozen hamburger, blades for El Chapo’s power tools smuggled in via frozen Barbacoa.\nStay Classy, Oklahoma: What’s more amazing, the fact that a dozen resident geniuses waved Confederate flags during a visit to Oklahoma City by President Obama last week, or that so many people stood there and watched and did nothing?\nSpeaking of Which: Nice play by Oklahoma Gov. Mary Fallin, whose spokesman responded to the stupidity by suggesting the flag-waving miscreants had slipped over the state line from Texas. Where else?\nAnd Finally: In financial news, sad to see performer 50 Cent file for bankruptcy. Insert your own two-quarters-to-rub-together joke here.", "external_links": [], "published": "2015-07-17T22:26:00.000+03:00", "crawled": "2015-07-18T19:10:10.000+03:00", "highlightTitle": ""}