{"organizations": [], "uuid": "53c62660d08b5d15829a27e52bc6b655d3a3ec4a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/14/15/2A829A1200000578-0-image-a-5_1436882602925.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3160733/Un-icyclists-rejoice-North-Korea-installs-bike-paths-Pyongyang-pedal-power-grows-popularity-citizens.html", "country": "GB", "title": "North Korea installs bike paths throughout Pyongyang as bicycles grow popularity", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 6, "title_full": "North Korea installs bike paths throughout Pyongyang as bicycles grow popularity | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T22:15:00.000+03:00", "replies_count": 5, "uuid": "b88e823d4a3d2bbb1a4c29f11d078034db725fb2"}, "author": "Katie Amey for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3160733/Un-icyclists-rejoice-North-Korea-installs-bike-paths-Pyongyang-pedal-power-grows-popularity-citizens.html#post-0", "ord_in_thread": 0, "title": "North Korea installs bike paths throughout Pyongyang as bicycles grow popularity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View\ncomments\nDictator Kim Jong-un has installed bike lanes on major thoroughfares running through the North Korean capital city of Pyongyang.\nThe country is hoping to cut down on pedestrian accidents as more people have the cash to spend on bicycles to get around.\nBicycles are an expensive but popular mode of transport for many in an impoverished and reclusive country where private car ownership, although on the rise, is still rare.\nNorth Korea has recently installed cycle lanes on many major thoroughfares in Pyongyang\nThey are often used by women to transport goods to semi tolerated markets, where one of the most common services sold for profit is bicycle repair.\nConcrete paving stones on some long stretches of pavement in the central area of Pyongyang have been replaced by a strip of smooth cycle path marked with white outlines of bicycles, according to photos seen by Reuters.\n Next Private first-class suites, 32-inch TV screens and personal... Tourist who carved her initials into a stone pillar at... Mine! Seagull steals GoPro from tourist and takes it for... Rise above the rat race: The amazing portable balconies... One image from early July showed a freshly laid bicycle path leading to the towering 105-storey Ryugyong Hotel, the uprooted paving stones still on the pavement.\nNorth Korean cyclists are not supposed to ride on urban roads and have for years used an unmarked narrow strip of pavement shared with pedestrians, residents and visitors said.\nCity cyclists are not supposed to ride on urban roads and the paths hope to cut down pedestrian accidents\n'This causes a lot of accidents and collisions and as a result people ride slowly and ring their bells very frequently,' said Simon Cockerell of Beijing-based Koryo Tours, which takes Western tourists into North Korea.\nPyongyang - the name of the showpiece capital meaning 'flat lands' - is geographically bicycle-friendly, but has in the past introduced and then lifted bans on bikes in the city centre.\nCockerell said the number of cyclists in Pyongyang appears to have increased by roughly 50 per cent in the past few years, although the thought of riding a bike might be unsophisticated for many image-conscious Pyongyang residents.\n'They are not the most common form of transport for the average Pyongyanger, and many people I have spoken to about bikes there - mostly men - have scoffed at the idea that they would ride a bike,' said Cockerell, whose company offers bicycle tours of North Korea.", "external_links": ["http://dailym.ai/1RwpbYb"], "published": "2015-07-14T22:15:00.000+03:00", "crawled": "2015-07-14T20:33:49.000+03:00", "highlightTitle": ""}