{"organizations": [], "uuid": "98024ae0f6c9c9726297307775806c974dd80df6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "ezinearticles.com", "main_image": "//ezinearticles.com/members/mem_pics/Mark-West_262476.jpg", "site_section": "http://feeds.ezinearticles.com/category/Travel-and-Leisure:Adventure-Travel.xml", "section_title": "Travel-and-Leisure:Adventure-Travel Articles from EzineArticles.com", "url": "http://EzineArticles.com/?4-Tips-For-Diving-in-Boracay-Philippines&id=9117120", "country": "US", "title": "4 Tips For Diving in Boracay Philippines", "performance_score": 0, "site": "ezinearticles.com", "participants_count": 0, "title_full": "4 Tips For Diving in Boracay Philippines", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T22:31:00.000+03:00", "replies_count": 0, "uuid": "98024ae0f6c9c9726297307775806c974dd80df6"}, "author": "", "url": "http://EzineArticles.com/?4-Tips-For-Diving-in-Boracay-Philippines&id=9117120", "ord_in_thread": 0, "title": "4 Tips For Diving in Boracay Philippines", "locations": ["Boracay Philippines"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark West"], "text": "Basic PLUS Author | 159 Articles Joined: January 17, 2009 4 Tips For Diving in Boracay Philippines By Mark West | Submitted On July 29, 2015 \nBoracay is not exactly as famous for diving as it is for its white, soft sandy beaches. Nonetheless, there are some excellent diving spots at Boracay that you can take advantage of, most of them being around the famous White beach. The fees you get charged for diving is peanuts, at just 33 pesos. In this article I will yell you about more about diving in Boracay. \nDiving locations: As of this writing, there are at least twenty-five decent diving locations in Boracay. Most of them are filled with colorful coral reefs and shallow water, are easily accessible through boat rides, and are full of a variety of fishes such as turtles, parrot fishes, damsel fishes, etc. If the White beach is not enough for you, remember that there is also the Crocodile island which is not too far way and where you will find plenty of aquatic life comprising of pipefishes, nudibranch, etc. Did I mention that the Crocodile island is also full with multi-colored coral reefs? Just about enough reason to take your underwater camera with you, don't you think so? If you are up for a bit of challenge, then visit Yapak as it is one of the most famous diving sites not just in Boracay but also in the entire Philippines; the downer is that only experienced divers can dive here. A similar diving spot for experienced divers is Camia. \nBest season for diving: Diving depends on visibility and if you wish to get the best amount of visibility possible then be sure to visit Boracay during the months of April, May or June. In fact these three months are the best period for any diving enthusiast as the visibility is exceptionally high at more than twenty meters and the water temperature is also pleasant. During the months from December to February the visibility is not as high; due to the increased presence of plankton in water, the water becomes dense and the visibility level does not go beyond ten meters, not to mention that water temperature during this period is extremely cold. Monsoons around Boracay are unpredictable because sometimes the eastern side gets a favorable weather and at other times it is the western side which seems more favorable for diving. Well, all I can say is that if you visit Boracay during the monsoon you would need to find your favorable spot for yourself! \nGetting yourself insured: When it comes to diving, it is better to be safe than sorry. No matter how expert of a diver you may be, accident can and does happen to divers. You would never know what would happen to you when you are underwater, several meters deep! For this reason, it is best to buy travel insurance before going on a diving trip to Boracay. Find an insurance company which offers insurance for scuba diving for up to at least fifty meters of depth, and also offers international coverage. If you find an insurance company which covers not just scuba diving but also all the other water spots, then even better! \nEnjoy the night ride: No need to waste your nighttime at bars; you can indulge in diving activities even at night. There are in fact several diving operators there who would be more than happy to arrange short diving trips to the other islands for you! \nDiving is a fun activity if you know how to do it the right way! \nMark West invites you to plan your trip with our help from our site Boracay Review . The most updated information about Boracay ! See you on the beaches of the world!", "external_links": [], "published": "2015-07-29T22:31:00.000+03:00", "crawled": "2015-07-30T11:48:01.984+03:00", "highlightTitle": ""}