{"organizations": [], "uuid": "1a6a46f64aa78e5351813ec009a2d9cd8dde0d45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150706GreenTurtleTrunk.jpg", "site_section": "http://www.ticotimes.net/categories/sea-turtles", "section_title": "Sea Turtles Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/06/costa-rican-sea-turtle-rescued-police-car-trunk", "country": "US", "title": "Sea turtle rescued by Costa Rican police from car trunk", "performance_score": 0, "site": "ticotimes.net", "participants_count": 3, "title_full": "Sea turtle rescued by Costa Rican police from car trunk -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T07:22:00.000+03:00", "replies_count": 2, "uuid": "1a6a46f64aa78e5351813ec009a2d9cd8dde0d45"}, "author": "Zach Dyer", "url": "http://www.ticotimes.net/2015/07/06/costa-rican-sea-turtle-rescued-police-car-trunk", "ord_in_thread": 0, "title": "Sea turtle rescued by Costa Rican police from car trunk", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When police stopped a car in the city of Limón Friday evening they were looking for guns or drugs. What they found was a 100-kilogram green sea turtle, according to a statement from the Public Security Ministry.\nGreen sea turtles (Chelonia mydas) are listed as endangered by the International Union for Conservation of Nature and Natural Resources.\nPolice stopped a car driven by a man with the surname Solano near the Limón cemetery and asked him to open the trunk of his vehicle. Inside was a green sea turtle measuring 1.4 meters from beak to tail. The turtle was on its back with its flippers bound.\nThe turtle sustained two large gashes, likely from harpoons used to catch it, according to Fernando Alegre, the veterinarian at the Jaguar Rescue Center in Puerto Viejo, where authorities delivered the turtle for treatment Saturday. Besides the deep cuts, Alegre said that the turtle had been “brutally” tied by its captors and had injuries from the cords.\nAlegre said the animal was “very weak” but was being treated in hopes of eventually releasing it back into the Caribbean.\n“Until it improves, we can’t be optimistic,” Alegre told The Tico Times.\nThe driver of the car and three passengers were handed over to the Prosecutor’s Office to face charges.\nGreen sea turtles can weigh up to 320 kilograms (700 pounds). The creatures nest on Costa Rica’s Caribbean beaches from July to October and are often poached for their meat and eggs.\nOn June 30, police arrested five men found with the meat and shell of an endangered hawksbill sea turtle.", "external_links": ["http://www.jaguarrescue.com/", "http://www.iucnredlist.org/details/4615/0"], "published": "2015-07-07T07:22:00.000+03:00", "crawled": "2015-07-08T05:56:10.000+03:00", "highlightTitle": ""}