{"organizations": [], "uuid": "de4fe96c02a2a912df7446562d08d236c3516a77", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources3.news.com.au/images/2015/07/14/1227441/478379-8c59cf62-29d7-11e5-9e41-70fbd812ceac.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/discovering-tokyo-japan-travelling-is-not-all-lost-in-translation/story-e6frfq7r-1227441480274?from=public_rss", "country": "IL", "title": "Lost in translation travelling Tokyo", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Lost in translation travelling Tokyo", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T07:44:00.000+03:00", "replies_count": 0, "uuid": "de4fe96c02a2a912df7446562d08d236c3516a77"}, "author": "", "url": "http://www.news.com.au/travel/discovering-tokyo-japan-travelling-is-not-all-lost-in-translation/story-e6frfq7r-1227441480274?from=public_rss", "ord_in_thread": 0, "title": "Lost in translation travelling Tokyo", "locations": ["Tokyo", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Scarlett Johansson", "Bill Murray"], "text": "HERE’S the deal. You catch this fish. You win a million dollars. It’s all part of a very weird Australian tourism campaign. Travel Discovering Tokyo, Japan: Travelling is not all lost in translation by: What are these? Tokyo based film Lost in Translation starring Bill Murray and Scarlett Johansson Source: Supplied \nTAKE me to the Park Hyatt in Shinjuku, I tell the Tokyo cab driver. “Ah, Rost in Transration,’’ he grins. “Scarlett Johansson.’’ Further conversation is lost in translation. The white-gloved driver in his spotlessly clean cab doesn’t speak English and I don’t speak Japanese. \nBut everyone in Tokyo remembers Rost in Transration. We speed on through Shinjuku, a neon world that inspired the set for Ridley Scott’s Blade Runner . “Brade Runner,’’ offers the cab driver as we dart out of the traffic to pull up in front of Tange Kenzo’s towering edifice. \nI am bowed in and take a silent lift the 40th floor and then through a Dickensian maze of book-lined shelves to another lift to the 52nd floor. \nFilm \"Blade Runner\". \nIs this where Lost in Translation was made, I ask four deeply bowing and startlingly good-looking Japanese women, as I step out of the shussshing lift. “Rost in Transration,’’ they agree. It’s all about the Ls. \nI look out through the floor-to-ceiling glass in Kenzo’s great atrium. A white-gloved and smiling figure suspended outside the building is a reflection in the glass, not the window cleaner I found welcoming me as he swung suspended in space outside my room on the 23rd floor of the Tokyo Dome Hotel when I was last here. \nI am at the Park Hyatt for Scarlett Johansson, whose fleshly delights are exceeded only by the medium rare prospect of a Kobe steak. The white-hatted chefs spin like martial artists in the grill room, silent and deadly with knives tempered and sharpened like the samurai sword created by Hattori Hanzo in Kill Bill Vol 1, forged for the Black Mamba played by Uma Thurman. \nI am right into all of this. The Japanese Karate Association spring camp has attracted more practitioners of the Japanese martial art than are sent to a warrior’s paradise by Thurman in Quentin Tarantino’s blood-drenched extravaganzas. Bar, Park Hyatt Tokyo Image supplied by Hyatt Hotels Source: Supplied \nThe matire’d in the grill room at the Park Hyatt looks very like the Japanese actor Toshiro Mifune in the Seven Samurai, and Throne of Blood, but he died 20 years ago. \nThe ravishing hostess who greeted me outside the lift glides past. Is it O-Ren Ishi, also known as Conttonmouth, the half-Japanese, half-Chinese-American woman. Two many halves here, I think remembering Kill Bill. \nO-Ren Ishi became the sword-slicing boss of the Yakuza and head of the Crazy 88. Call me crazy, I think, as a bowing waiter advises me to graze on a half-Caesar salad while I’m waiting for the medium-rare Kobe steak, which will take 35 minutes to cook and has a price tag approaching the budget of Lost in Translation. New York Grill at Park Hyatt, Tokyo in Japan. Picture: Supplied Source: Supplied \nFor those travelling to Tokyo and wishing to taste Wagyu beef from hand-massaged and beer-swilling herbivores, it weighed a mere 180 grams and cost 15,000 yen, which translates to about 150 Australian dollars if I haven’t lost something in calculation. \nI must catch up with Scarlett in Avengers: Age of Ultron but Lost in Translation is still an instant conversation opener, usually terminating when the participants find they have nothing else to say that either party understands. I do manage to strike up a conversation with a French sous chef who explains that keeping steak medium rare after 35 minutes instead of presenting it as shoe leather involves a mysterious processing of heating it and resting it. This makes me think of lying on a beach. \nThe Kobe steak, Kobe referring to the area from which the cattle are genetically modified and bred, arrives, and is a sublime culinary experience. I leave the company of an ageing American in the grill room who has ordered a hamburger and I go into the bar where, like Bill Murray, I think I may meet Scarlett Johansson. I must catch up with her in Avengers: Age of Ultron. \nThe jazz quartet, which was playing when bashful Bill met Scarlett, is producing a cool line in American jazz. Dave Brubeck’s Take Five suffers from heavy rearrangement and takes five minutes longer. Scarlett Johansson and Bill Murray filming Lost in Translation scene in Park Hyatt Source: Supplied \nAt least the woman playing the sax doesn’t remind me of Paul Desmond, the Brubeck saxophonist, known as The Stork, who played the alto sax solo. \nNo one cares for the sax anymore, except ageing guys like me and Bill Murray who sat on the stool on which I’m sitting. Outside, the pulsing neon of Shinjuku lights opposite worlds, the redder the neon appealing to Ridley Scott whose star, Harrison Ford, wandered the street stalls amid the falling rain, searching for “replicants’’ who have returned from other planets in the hope of avoiding “decommission.’’ \nDecommission comes to humans too, although this is something I hope to avoid at the karate camp where my movie flashbacks continue. Once again, I am confronted on the dojo floor by Oddjob, who was dispatched by James Bond in Goldfinger. \nMr Shinna, is a revered and feared instructor who announces himself with bellowed commands that need no translation. You know what wants. There is also another instructor who reminds me of Jaws in the Spy Who Ruvved Me (I must stop doing this, my attempts at Japanese pronunciation are worse) and Moonraker. Actor Scarlett Johansson in scene from film Lost in Translation . Source: AP \nAnother very senior instructor looked like the aforementioned Toshiro Mifune as Admiral Yamamoto in the Battle of Midway. The code of the samurai is preserved in karate, which is recognised as Japan’s premier martial art and conducts regular tournaments at the Nippon Budokan, built for the Tokyo Olympics in 1964. The Olympics are to return in 2020. \nJudo, kendo akido and other forms of martial art hold their championships at the budokan. Muhammad Ali fought Japanese wrestler Antonio Inoki there in an ugly mismatch of styles for enough money to eat Kobe beef in your hamburgers for years. \nThe Japanese are as enthusiastic about martial arts as they are about movies. Karate began with Sensi Gichin Funakoshi who said karate is like boiling water: without heat it returns to its tepid state. \nI train, but too often I am tepid, I think as the week at the training camp ends and we catch a train to the Tokyo suburbs, as do millions it seems of Japanese citizens who somehow remain polite as they crush aboard the subway. Many wear masks, not only to avoid breathing in the viruses that must be hanging in the air like the rain, but so as not to pass anything on to others. \nEven the prostitutes, as I suspect they were, were unfailingly polite as we walked through what appeared to be a red-light district. They remained silent on street corners. Was there ever a more polite society, I thought as, like Simon and Garfunkel I turned my collar to the rising damp. I remember the words, under the halo of a street lamp, stabbed by a flash of neon light that split the night and touched the sound of silence. Park Hyatt Tokyo. Japan / Hotel / Exterior Travel Source: News Corp Australia \nPaul and Art played several concerts at the Tokyo Dome, next to the Tokyo Dome Hotel where I am staying. \nWhen I arrived it was spring, but the temperature was zero and it was snowing. Still shivering, I I decide on a restorative massage and look through the peephole in the hotel door when I hear a knock. \nPresumably, it is the masseur. But there is no one there. I open the door. “Coster San?’’ asks a disembodied voice. I look down to find a tiny Japanese woman with forearms like Popeye. \nNervously, I endure greater pain than I have suffered in the dojo. Life here is an order of opposites. Western and Japanese culture exist in a bewildering fusion.", "external_links": [], "published": "2015-07-14T07:44:00.000+03:00", "crawled": "2015-07-14T08:05:36.000+03:00", "highlightTitle": ""}