{"organizations": ["Oberoi Udaivilas"], "uuid": "fc996a908ba1232c0d57aca443611b091f34689f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/blurbs/2015-07/oberoi_udaivillas_0907.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/travel\r", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/indias-oberoi-udaivilas-named-worlds-best-hotel-in-2015-video", "country": "MY", "title": "India’s Oberoi Udaivilas named world’s best hotel in 2015 (VIDEO)", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "India’s Oberoi Udaivilas named world’s best hotel in 2015 (VIDEO)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T02:34:00.000+03:00", "replies_count": 0, "uuid": "fc996a908ba1232c0d57aca443611b091f34689f"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/indias-oberoi-udaivilas-named-worlds-best-hotel-in-2015-video", "ord_in_thread": 0, "title": "India’s Oberoi Udaivilas named world’s best hotel in 2015 (VIDEO)", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "India’s Oberoi Udaivilas named world’s best hotel in 2015 (VIDEO) Thursday July 9, 2015 Print Article \nNEW YORK, July 9 — The world’s best hotel for 2015 is a palatial resort fit for a maharaja, built on the edge of a fairy tale lake in Western India. \nCoronated with the illustrious title by readers of Travel + Leisure magazine in their latest ‘World’s Best Awards’ released this week, the Oberoi Udaivilas, Udaipur was given a near-perfect score of 99 by readers of the US publication. \nLocated in a city widely described as the most romantic destination in India, the Oberoi Udaivilas, Udaipur capitalises on its lake-front setting and the city’s old-world mythology — historic palaces, forts, temples and bazaars — to offer a dreamy stay in a domed, marbled and lavish setting. \nDesigned to harken Udaipur’s royal past with decorative fountains, private courtyards and manicured gardens, guests arrive at the property by private boat and are greeted with lush purple bougainvillea trees and sweeping views of the Aravalli Hills across the lake. \nModern conveniences and room décor are offset by touches of local Rajasthani accents and colors. \nActivities at the hotel include culinary classes, yoga, Henna lessons, art classes, lake cruises, camel ride, sightseeing tours and luxury on-site spa treatments. \nOberoi Udaivilas capitalises on its lake-front setting and the city’s old-world mythology to offer a dreamy stay in a domed, marbled and lavish setting. — AFP pic The property, which served as hunting grounds 200 years ago, also features a wildlife conservatory that is home to Indian spotted deer, wild boar and peacocks. \nThe Oberoi Udaivilas, Udaipur is no stranger to accolades. Conde Nast Traveler readers and TripAdvisor users voted the palatial resort the best hotel in India in 2014. \nHere are the world’s top hotels of 2015, as voted by readers of Travel + Leisure magazine: \n1. Oberoi Udaivilas, Udaipur, India 2. Hotel Castello di Casole — a Timbers Resort, Casole d’Elsa, Italy 3. Ashford Castle, County Mayo, Ireland 4. Triple Creek Ranch Darby, Montana 5. Oberoi Rajvilas, Jaipur, India 6. Four Seasons Hotel, Istanbul at Sultanahmet, Turkey 7. Singita Sabi Sand, Kruger National Park Area, South Africa 8. Farmhouse Inn, Forestville, California (three-way tie) 8. The Peninsula Shanghai 8. Sunset Key Guest Cottages, A Luxury Collection Resort, Key West, Florida — AFP-Relaxnews More Stories for You:", "external_links": [], "published": "2015-07-09T02:34:00.000+03:00", "crawled": "2015-07-09T04:30:22.000+03:00", "highlightTitle": ""}