{"organizations": [], "uuid": "fda0c3d9deb34fd87d54b810b8e3aea1c89492fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61644/africa-tourism-time-call-spade-spade", "country": "US", "title": "Africa tourism: Time to call a spade a spade?", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Africa tourism: Time to call a spade a spade?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T04:37:00.000+03:00", "replies_count": 0, "uuid": "fda0c3d9deb34fd87d54b810b8e3aea1c89492fc"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61644/africa-tourism-time-call-spade-spade", "ord_in_thread": 0, "title": "Africa tourism: Time to call a spade a spade?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Africa tourism: Time to call a spade a spade? Adv: \nBy Prof. Wolfgang H. Thome, Ph.D., eTN Africa Correspondent | Jul 21, 2015 Photographers gather to capture the great migration. Adv: \nThe visit of American President Barrack Obama is now imminent, and Kenyans of all walks of life will no doubt expect that their civil society organizations and business associations will engage with Obama’s entourage comprising government, business, and NGO (non-governmental organization) representatives. This will be a prime opportunity to both showcase their successes and achievements and also to highlight the challenges they face in today’s Kenya in the specific fields they are engaged in. \nOf course, Kenya’s conservation community will also seek audience with selected members and groups of Obama’s entourage, some of them no doubt in the knowledge – or what they think is knowledge – of their infallibility. Yes, it appears we now have conservation Popes behaving exactly as if they had that nonexistent quality of infallibility. \nThey know it all, they are never wrong, and yet, unlike the real Pope, lack humility and apparent respect for the opinions of others with the recent debate on the pros and cons of destroying or trading, confiscated blood ivory being a good example. \nThe situation surrounding the Nairobi National Park and the two incursions planned by the Southern Bypass Highway and the Standard Gauge Railway (SGR) is another example. With the Southern Bypass route cleared, attention of late has been focused on the SGR project, and it brought out the worst from some “holier than thou” individuals claiming the moral high ground of conservation. \nOver the past two days, Mohammed Hersi, Chairman of the Kenya Coast Tourism Association, finally burst a vessel over the half-truths peddled in this raging debate and called a spade a spade on his social media timelines, locking horns with the high and mighty of conservation as few others would dare. The “exchange of fire” must have come as a shock, that someone of Hersi’s standing and position would openly challenge the conservation Popes, but as a great relief to a great many other people who, unlike Hersi, were scared and feared to be cyber mobbed if they would dare to challenge the pronouncements of the infallibles. \nMuch of it goes back to a battle fought on behalf of the African Heritage House, which was threatened by the same SGR promoters last year, before in January, and against the odds, when the Kenyan government declared this haven of African art a national monument. \nThis correspondent had taken a stand at a very early stage when SGR contractors threatened Alan Donovan and lobbied for support on behalf of him and the African Heritage House from all corners. The avalanche of support grew stronger and stronger, and there was widespread celebration when the news came in that the house was saved. \nAll too soon, this now seems, as Alan got into the cross hairs of some of the infallibles in what can best be described as outright character assassination. \nMore recently, in a related article, suggestions were made to right that wrong and offer an apology, but none has come forth as the individuals involved are preparing to meet their financial backers who are expected to be in the country as part of Obama’s entourage. With them they have to appear to be strong, fearless, able to lock horns with government all and sundry, so that those who write the checks can be suitable impressed. An apology, while humanly the right thing to do, would probably tactically undermine their Wagenburg stand and perhaps lessen their chances to tap into the cash rich North American conservation community. \nFinancial and moral support for conservation in Kenya, East Africa, and the continent are much needed, no doubt about that. The ongoing controversy over poaching issues in Tanzania is just one example, where according to the latest media reports the once great herds of elephant have been decimated to less than a third of what they were even a decade ago. The slaughter of rhinos in South Africa, thousands over the past five years, has shocked the world, but little in terms of resource transfers has taken place to stem the tide, and figures this year are once again up from last year. \nBut conservation, too, needs to be accountable and transparent, and the methods used against Alan Donovan are simply not acceptable by any standards. The end does not justify the means, especially not by individuals who have hitherto claimed the moral high ground, and got support where and when appropriate from this correspondent, too. \nMohammed Hersi, when discussing these issues 24 hours ago, made it clear that his responses could be used here, but as many of the readers from Kenya are either following him on Facebook or Twitter anyway, they might well read it all there or have already read his opinion. Mohammed made it clear that he took a stand in the public domain because he felt that people had the right to know the entire truth and not just the truth of one vocal group, a group trying to drown out other opinions by raising the noise levels. I agree with Mohammed on this and, therefore, decided to give the topic once more prominence. It is time to let common sense prevail, stop fights a la Don Quixote, and accept the Realpolitics of today’s Kenya. \nThe two projects, Southern Bypass and SGR, are carving out a route right along the park boundary in an area where across the fence massive industrial and housing developments have sprung up over the past decades. True, animals are seen there at times, but it is not a vital migration route in or out of the park as some have tried to make the public believe, as there is NO WAY OUT at that side of the park. A recent drive across the park towards the gate at the Mombasa Road made that all but clear. \nHence, Kenya Kenya Wildlife Service (KWS) done a deal and is hopefully able to cash in on a whole lot of concessions and payback from government, including getting additional land on the other side of the park, where it is still possible to create a buffer zone before the entire park boundary will be lined with housing and commercial estates. \nThat should be the focus now, and not trying to perpetuate the wrongs inflicted on Alan Donovan and others who dared to stand up in his defense, including Mohammed Hersi and notably one prominent Kenyan who was in the process called “Emma Who?”", "external_links": [], "published": "2015-07-21T04:37:00.000+03:00", "crawled": "2015-07-21T05:21:07.469+03:00", "highlightTitle": ""}