{"organizations": [], "uuid": "68e7fbbc584da24f955082a6a3be25a54c8f5728", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297726713706_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.calgarysun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.calgarysun.com/2015/07/18/airbus-ceo-fairly-confident-planes-cant-be-hacked", "country": "CA", "title": "Airbus CEO 'fairly confident' planes can't be hacked", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "Airbus CEO 'fairly confident' planes can't be hacked", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T20:12:00.000+03:00", "replies_count": 0, "uuid": "68e7fbbc584da24f955082a6a3be25a54c8f5728"}, "author": "", "url": "http://www.calgarysun.com/2015/07/18/airbus-ceo-fairly-confident-planes-cant-be-hacked", "ord_in_thread": 0, "title": "Airbus CEO 'fairly confident' planes can't be hacked", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airports, Airlines & Security \nDALLAS -- These are heady times for the commercial-aircraft business at Airbus and Boeing, as airlines place huge orders for new planes. \nEach is working on more fuel-efficient aircraft to satisfy airlines that want lower fuel bills and regulators who want lower emissions from aircraft. \nAirbus Group CEO Tom Enders spoke last month to an aviation conference in Dallas and urged the industry to put more emphasis into breakthrough technologies that could be \"disruptive\" or revolutionary -- more like tech companies. He touted the cockpit automation of the giant A380, assembled at the Airbus plant in Toulouse, France, and talked about building electric-powered or hybrid planes. \nEnders, a former German defence official who has led Airbus since 2012, took time afterward to talk with The Associated Press. Here is a summary of that interview, edited for length and clarity. \nQ: In your speech, you talked at length about innovation in the tech sector. Has the airline industry lost its aura of cool and cutting-edge technology? \nA: Back in the '50s and '60s, aviation and space was very disruptive. The jet engine came along -- that was disruptive. It looks like we ran out of steam a little bit in the '70s. We might get a second wind or second boost. \nQ: Do Airbus shareholders want you investing in \"disruptive\" technology? \nA: There needs to be a healthy balance of risk-taking and of securing the core business. I'm not talking about betting the company on certain new technologies or disruptive technologies. \nQ: Is cheaper jet fuel or concern about airlines adding too much capacity hurting demand for jets? \nA: Not really. The outcome of the (recent Paris) air show proves our point that the market is still strong, it's still dynamic. By and large the prospects are positive, and you know, the airline industry is so much more profitable, particularly here in the United States. \nQ: The U.S. Environmental Protection Agency just took the first steps toward regulating carbon emissions from aircraft. What effect will such regulation have on your business? \nA: New engines ... will be significantly less fuel-consuming and less emitting than previous generations. At the same time we are working on alternative fuels, we are working on algae, we are working on gas, we're working on electric-powered aircraft -- we want to reach the goal of building regional aircraft in 10, 15, 20 years -- who knows? -- 50-seater to 100-seater, with electric or at least hybrid propulsion. \nQ: Passengers rave about the A380 but your sales have dropped off. Why? \nA: It was always clear that there would only be a very limited number of airlines who were customers or potential customers of the 380. You have some who are more risk-averse than others. If you want to maximize the possibility of filling your aircraft you will tend more toward smaller aircraft. (Emirates President) Tim Clark has said numerous times the 380 is a money-making machine for him because he manages to fill it. If you manage to fill a 380, let's say 80 per cent or more, it is a money-making machine. If you are flying at only 50 per cent passenger load, you have a big problem. \nQ: Are you worried that your planes could be hacked? \nA: Our concern with hacking into our planes, our concern with terrorism, dates back to the early development days of the 380. Ever since then we've taken particular precautions to make our aircraft as safe as possible. If you ask me today, I'm fairly confident that our aircraft are secure from hacking. \nQ: Will we ever see a plane with one pilot or even no pilot on board? \nA: We all know that from a technological point of view, we could fly large aircraft today completely autonomous. (But) another question is political aspects and psychology, hence I do not think that anytime soon we will see a completely pilotless aircraft due to security reasons. But if you look at reality, look at our aircraft, for most of the flight they are flying autonomous. Pilots take off, 30 seconds after takeoff they hit the autopilot, and then they cruise. Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions . Sponsored Links", "external_links": [], "published": "2015-07-18T20:12:00.000+03:00", "crawled": "2015-07-18T20:41:24.000+03:00", "highlightTitle": ""}