{"organizations": [], "uuid": "1c9cbbe4c1bfad7bbd1430ce32a982cf4c67f89d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/e5f69508-2b23-11e5-bef9-f00a1a6eacb9-1200x1200.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/business/boeing-aerospace/blast-at-washington-aerospace-plant-hurls-machinery-hurts-5/", "country": "EU", "title": "Blast at NE Washington aerospace plant hurls machinery, hurts 5", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Blast at NE Washington aerospace plant hurls machinery, hurts 5 | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T18:17:00.000+03:00", "replies_count": 0, "uuid": "1c9cbbe4c1bfad7bbd1430ce32a982cf4c67f89d"}, "author": "NICHOLAS K. GERANIOS", "url": "http://www.seattletimes.com/business/boeing-aerospace/blast-at-washington-aerospace-plant-hurls-machinery-hurts-5/", "ord_in_thread": 0, "title": "Blast at NE Washington aerospace plant hurls machinery, hurts 5", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SPOKANE — An explosion rocked an aerospace plant in northeast Washington, toppling large pieces of machinery, lifting an entire floor off its foundation and seriously injuring five people, authorities said Wednesday.\nThe sheer power of the blast Tuesday night and the shrapnel it created caused the majority of the damage, and little to no fire ignited at Zodiac Aerospace in the small town of Newport, said Brian Schaeffer, assistant chief of the Spokane Fire Department who responded to the scene.\n“The energy from that explosion went through that building almost like a tidal wave and destroyed or impacted everything in its path,” he said.\nSchaeffer said the blast peeled open huge metal roll-up doors and led multiple places to collapse in the large commercial building in the town 50 miles north of Spokane, along the Idaho border.\n Thirty people were inside the plant, but most escaped with help from emergency systems that worked properly, including a sprinkler system, Schaeffer said. Two people were critically injured and three were seriously injured, whether from the pressure of the blast or penetrating injuries from shrapnel, Schaeffer said.\nTwo victims went to Providence Sacred Heart Medical Center in Spokane. One was in critical condition in intensive care and the other was in the orthopedic unit in satisfactory condition, according to an administrative supervisor.\nThe blast stemmed from vapors released during chemical manufacturing, but there was no more danger to the surrounding area, said Schaeffer, who responded with a hazardous-materials team. The chemicals are used to make fire-resistant components for aircraft interiors, he said.\nOfficials were trying to stop runoff from reaching a nearby river after water lines ruptured and the sprinkler system activated and then broke, prompting concerns that the water mixed with chemicals, he said.\nSeveral thousand gallons of water per minute were flowing after the blast, but much of it likely was absorbed into the ground, Schaeffer said. Environmental regulators were responding.\nCalls rang unanswered at the Zodiac plant Wednesday morning. A woman who answered the telephone at the company’s facility in Marysville said they were not commenting on the explosion.\nZodiac Aerospace is a French company that makes aircraft components around the world.\nThe Newport plant is designated as a “composite and engineered materials facility.” It makes structural composites and assemblies, adhesives, panels with honeycomb core and various plastics, all used in the manufacture of aircraft cabin interiors.\nThe company posted a statement online saying that it has set up a “crisis/counseling team on site, dedicated to provide support to our employees in Newport.”\n“The cause of the explosion is not known and will be investigated both internally as well as with local and government officials. Zodiac Aerospace will fully support the inquiry,” the statement adds.\nZodiac has multiple plants around Washington state and the U.S., and is a major supplier of cabin interior products to Boeing.\nIn the past year, as Boeing production ramped up, Zodiac struggled to supply aircraft seats on time, creating a serious choke point in the supply chain.\nThe seat supply shortage delayed a series of aircraft deliveries, including 787 Dreamliners to American Airlines.\nBoeing spokesman Doug Alder said Wednesday the jet maker is “working to determine what, if any, impact there may be to our production system” from the Newport explosion.\nSchaeffer said the plant is one of the largest employers in the town, located in the depressed northeastern corner of Washington.\n“It’s pretty devastating to that area,” he said.\nVia email, a Zodiac spokesman in Paris said the Newport facility employs about 200 people.\nVolunteer firefighter Christopher Demlow told Spokane news station KHQ-TV that the blast shook his home, located three blocks from the plant.\n“It shook every window in the house,” he said in an on-air interview. “We saw a big plume of smoke coming up from the factory area.”\nSeattle Times aerospace reporter Dominic Gates contributed background information about Zodiac to this report.", "external_links": [], "published": "2015-07-15T18:17:00.000+03:00", "crawled": "2015-07-15T22:29:27.000+03:00", "highlightTitle": ""}