{"organizations": [], "uuid": "efec3ffb5d327cb79d7133a7f38cb93b87a9c739", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/fodors/headshot.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/fodors/10-things-you-need-to-do_b_7886528.html", "country": "US", "title": "10 Things You Need to Do Before Any International Trip", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "10 Things You Need to Do Before Any International Trip", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T16:07:00.000+03:00", "replies_count": 0, "uuid": "efec3ffb5d327cb79d7133a7f38cb93b87a9c739"}, "author": "Fodor's", "url": "http://www.huffingtonpost.com/fodors/10-things-you-need-to-do_b_7886528.html", "ord_in_thread": 0, "title": "10 Things You Need to Do Before Any International Trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nMemorize the following and make it your mantra: Good travel is the result of good planning. That applies to any trip you take, but it's especially true when you're heading to a foreign country. It can be tempting to book a ticket and start fantasizing about your getaway, but there's work to be done. In addition to the planning any trip requires--lodging, restaurants, activities, and so on--international travel calls for extra steps and research to ensure a stress-free experience. Fortunately, we've broken it all down into a ten-point plan that will help make your next international getaway a success. \n1. CHECK YOUR PASSPORT AND APPLY FOR ANY NECESSARY VISAS. While it's not necessary to memorize your passport's expiration date, it's best to take a look at it--and to verify that you know where your passport is stored--before making any international travel plans. Generally speaking, you want your passport to be valid for at least six months after entering a foreign country, though some nations will let you get away with less; refer to the State Department's website for full details, organized by country. If its expiration date is approaching, you'll need to renew your passport before your next overseas trip. \nThough not a universal requirement, tourist visas are needed to visit many nations around the world, and the application process varies greatly from country to country. If you have an American passport, the State Department's website is the best resource for determining if you need to apply for a tourist visa based on the countries you're visiting and how much time you plan to spend in each one. It's important to note that applying for a visa can be costly and time-consuming, so it's best to get it out of the way as soon as possible. Some countries, like China, offer multiyear visas that allow for multiple entries and exits; if there's a chance you'll return to a country sooner rather than later, multiyear visas can save you a lot of time and money in the long run. \n2. GET VACCINATED AND STOCK UP ON MEDICINE. Depending on where you're going, you may need to get special vaccines or medications as a precaution against various diseases. For the most comprehensive and up-to-date medical recommendations, check the Centers for Disease Control and Prevention's website , which also lists health advisories by country. In addition, if you routinely take any prescription medication, make sure you have enough to cover the duration of your travels so that you don't run out while you're overseas. Finally--and especially if you're going to any remote regions--it's wise to pack non-prescription medicines (aspirin, Imodium, etc.) that may not be easy to find. \n3. CHECK FOR TRAVEL WARNINGS/ADVISORIES AND REGISTER YOUR TRIP. Before you travel abroad, refer to the State Department's Consular Information Program for Travel Alerts (\"short-term events we think you should know about when planning travel to a country\") and Travel Warnings (\"We issue a Travel Warning when we want you to consider very carefully whether you should go to a country at all.\"). It's worth checking for these notices both before you book a trip and just before you depart. You should also enroll in the Smart Traveler Enrollment Program (STEP), which makes it easier for the State Department to assist you in the event of an emergency. Similarly, write down the addresses and phone numbers of any American embassies or consulates in the destinations you'll be visiting, in case you need to contact them. \n4. PREPARE YOUR FINANCES. Before you travel overseas, call your bank and credit card providers to let them know where you'll be; if the companies see foreign charges with no notice that you're abroad, they might freeze your cards, which can be quite annoying if you're in a shop or trying to pay for dinner. Before you travel internationally, be aware of the exchange rate and know how much things generally cost wherever you're going so that you get some sense of how much you're going to spend. If you want to get traveler's checks, feel free to do so, but know that they are not widely accepted and are exchanged at a less favorable rate than the one you'll find at an ATM, no matter where you are in the world. \n5. MAKE COPIES OF TRAVEL DOCUMENTS. Most importantly, have at least one color copy of your passport's ID page stored somewhere safe and separate from your passport. You should also make copies of any visas that pertain to your current travels. Hotel reservations, train ticket confirmations, and all other travel documents should be copied as well. In this digital age, it is very convenient (and eco-friendly) to only have digital copies of these documents handy. That's fine, but be sure that these items are saved to your device locally so that you can access them without an Internet connection. Also, if you're going to store sensitive information (like a scan of your passport) on your phone or in your email inbox, make sure your passwords are strong enough to keep potential intruders out. \n6. OBTAIN AN INTERNATIONAL DRIVING PERMIT. The international road trip of your dreams isn't going to happen unless you plan correctly. That's because it's illegal to drive without a valid driver's license and insurance in most countries, and many do not recognize U.S. driver's licenses. Car rental companies usually offer insurance, but for the license you'll need to obtain an International Driving Permit, either from AAA or the National Auto Club . It's also smart to familiarize yourself with local driving laws wherever you plan to drive. Contact foreign embassies for official rules and regulations regarding driving. \n7. GET ALL THE NECESSARY GEAR FOR YOUR ELECTRONICS. Electrical outlets are different all over the world, so you'll need to have adapters that allow your devices to plug into foreign sockets. Your best bet is to buy an adapter with different settings that adjust to most outlets, so you only have to worry about one adapter instead of one per country. You also need to check the strength of the electrical current wherever you're going and make sure your devices are compatible--cell phones and computers often are. If you have a device that's not compatible with a higher or lower current, then you'll need to buy a transformer or leave that gadget at home. Finally, if you don't own them already, it's worth investing in portable phone chargers and/or spare batteries that can be charged and swapped into phones, cameras, and other electronics so that you can stay fully charged while you're on the go. \n8. LEARN KEY PHRASES IN THE LOCAL LANGUAGE . Of course it's best practice to learn basics like \"Hello,\" \"Thank you,\" and \"Where is the bathroom?\", but the more you can say in the local tongue, the better. Then there are times when being able to effectively communicate is a matter of health and safety. If you have any food allergies or severe medical conditions, it's important to learn how to inform others about those issues in a foreign language. If you don't feel comfortable with your language abilities, then cheat and print out a document with relevant phrases or make flashcards that you can carry with you. \n9. RESEARCH ENTRANCE AND EXIT FEES. Regardless of whether a country requires you to obtain a tourist visa, it may levy an entrance and/or exit fee against you. For example, Argentina allows U.S. citizens to visit for up to ninety days without a visa, but a $160 \"reciprocity fee\" must be paid before entering the country--you won't be allowed in without a copy of the receipt. Once again, the Consular Information Program is the most reliable resource for determining whether a country charges these fees; on any country page, look under the Entry, Exit & Visa Requirements tab for complete information. \n10. BUY HEALTH AND TRAVEL INSURANCE. Before you travel, check your health insurance policy to see if it includes international coverage. If not, consider buying a short-term policy that will cover you while you're abroad, in case something should happen. Similarly, a smart way to protect your trip and your money is to purchase travel insurance. Policies and coverage vary from provider to provider, but the basic idea is that you can have your money refunded if your trip has to be cancelled, postponed, or cut short for any number of reasons. \nBy Michael Alan Connelly", "external_links": [], "published": "2015-07-28T16:07:00.000+03:00", "crawled": "2015-07-28T16:10:39.416+03:00", "highlightTitle": ""}