{"organizations": [], "uuid": "302c62f5e580f6430633fad47f8d5e7bf67e0b61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/barcelona-suspends-new-tourist-accommodation-licenses-in-bid-to-control-influx-of-visitors-311435651.html", "country": "US", "title": "Barcelona suspends new tourist accommodation licenses in bid to control influx of visitors", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Barcelona suspends new tourist accommodation licenses in bid to control influx of visitors - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T11:08:00.000+03:00", "replies_count": 0, "uuid": "302c62f5e580f6430633fad47f8d5e7bf67e0b61"}, "author": "Ciaran Giles, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/barcelona-suspends-new-tourist-accommodation-licenses-in-bid-to-control-influx-of-visitors-311435651.html", "ord_in_thread": 0, "title": "Barcelona suspends new tourist accommodation licenses in bid to control influx of visitors", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MADRID - Barcelona's new leftist mayor Thursday temporarily halted the issuing of new licenses for tourist accommodation while new regulations are drawn up to govern a sector some say has grown too big in recent years.\nA town hall statement said the suspension would apply to hotels, apartments, hostels and privately owned accommodation houses. It will affect some 30 current applications, including one to turn the city's geyser-shaped Agbar skyscraper tower into a hotel.\n\"It was necessary to put things in order,\" Mayor Ada Colau told reporters. \"Up to now, tourism policies had been drawn up piecemeal.\"\nColau took office last month promising social changes, including a plan to deal with the problem of mass tourism.\nBarcelona is one of Europe's top vacation destinations, receiving more than 7 million visitors annually. But many of its 1.6 million residents complain the city is being overrun and losing its character.\nLocated on the Mediterranean coast just south of the French border, Barcelona is the capital of Spain's powerful Catalonia region and recognized worldwide as a business, cultural and political centre.\nThe town hall said it plans to study existing accommodation capacity and its economic and social impact, and will start a public debate on developing a sustainable tourism plan by early 2016. It said it aimed to reduce the pressure of tourism in certain areas and spread it more equitably among the city's 73 neighbourhoods.\nOfficials said they would take into account the experience of other major tourist cities, adding that the plan aimed to preserve Barcelona as a quality tourism destination without disturbing residents.\n ", "external_links": [], "published": "2015-07-02T11:08:00.000+03:00", "crawled": "2015-07-02T17:16:49.000+03:00", "highlightTitle": ""}