{"organizations": [], "uuid": "a85a79f1855e107f4b54cfea326fa8ede252f3ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03381/BB__8400_3381916a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-24.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/lifestyle/honduras-gangs/11751746/starting-a-new-life-coffee-growing.html", "country": "US", "title": "Coffee vs Gangs: ‘It's brought nothing but happiness’", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Coffee vs Gangs: ‘It's brought nothing but happiness’ - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T18:34:00.000+03:00", "replies_count": 0, "uuid": "a85a79f1855e107f4b54cfea326fa8ede252f3ab"}, "author": "Rob Crilly", "url": "http://www.telegraph.co.uk/sponsored/lifestyle/honduras-gangs/11751746/starting-a-new-life-coffee-growing.html", "ord_in_thread": 0, "title": "Coffee vs Gangs: ‘It's brought nothing but happiness’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Luis is the youngest of 10 brothers and sisters. “He's like my right hand,” says his proud father, Paola, sitting in a plastic chair on the terrace of the family's rented home. Children, grandchildren and a ginger kitten all crowd around as he describes how his youngest son helps farm their small plot of land. “He would help me here or there… but not for any money.” In rural Honduras, odd jobs around the family plot are not enough for a young man to make his way in life, so Luis used to travel back and forth to nearby towns trying to find work in a maquila – or clothing factory. It made nobody happy, not Luis who wanted a proper trade , nor his family who missed him during his absences. Luis has already proved an adept businessman, saving his monthly stipend for attending the course to spend on coffee seeds to get his plans started So things have changed in the past months as Luis studied the principles of coffee farming and how to run his own business in a classroom less than a mile away. He has planted his own coffee seeds in the family land, where a puppy lazes in the afternoon sun and chickens peck at the long grass. He and his father work side by side, the green hills of coffee country looming out of the distance all around. The family have seen the 20-year-old grow during the past year. “He thinks differently now,” says his mother Ana. “For us it's brought nothing but happiness because he has stayed nearby.” Luis has already proved an adept businessman, saving his monthly stipend for attending the course to spend on coffee seeds to get his plans started. With the help of his farming tutor he researched the best varieties for Honduran conditions and plumped for Lempira – known for its caramel sweetness and one of the most popular among local farmers. Family bond: Luis' mother and father at home with other members of the family But there was a mishap on the way to buy the seeds when he was involved in a motorcycle accident. He has two more weeks with his arm in a sling, although that does not seem to hinder his work in the mountain fields, where he helped harvest a cucumber crop before heavy grey rainclouds closed in. “One of the things we have learned is to set aside a bit of land for crops like this,” he says. “I'll grow bananas too.” Already he says he has been helping his father change one or two things on his own land. “For me, with everything we have learnt, I want to do all the farming myself from A to Z. That is really important,” he says. The way he describes it is a back-to-basics approach, with every decision about varieties, harvesting and investing scrutinised afresh – throwing out unproductive practises and adopting the best new methods. He is quietly serious as he discusses his plans. Then he pauses and adds that he is excited the course is drawing to a close and he can begin to do it all for real. “It's a start in life,” he says. • To discover more about the Coffee vs Gangs project and read about gang culture in Honduras, visit telegraph.co.uk/coffeevsgangs You may also be interested in: • Video: Visiting the Coffee vs Gangs farm • The Honduras coffee region by numbers • Coffee production: from seedling to coffee cup", "external_links": [], "published": "2015-07-24T18:34:00.000+03:00", "crawled": "2015-07-24T12:52:09.041+03:00", "highlightTitle": ""}