{"organizations": [], "uuid": "a56a8f8b0386b4ceea17b33f3090fca04c69e874", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.independent.ie/incoming/article31353996.ece/ALTERNATES/h342/Cluxo.jpg", "site_section": "http://www.herald.ie/lifestyle/travel/", "section_title": "Travel - Herald.ie", "url": "http://www.herald.ie/sport/gaa/paul-curran-dubs-carry-too-much-weight-for-westmeath-31352747.html", "country": "", "title": "Paul Curran: Dubs carry too much weight for Westmeath", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "Paul Curran: Dubs carry too much weight for Westmeath - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T11:00:00.000+03:00", "replies_count": 0, "uuid": "a56a8f8b0386b4ceea17b33f3090fca04c69e874"}, "author": "Paul Curran", "url": "http://www.herald.ie/sport/gaa/paul-curran-dubs-carry-too-much-weight-for-westmeath-31352747.html", "ord_in_thread": 0, "title": "Paul Curran: Dubs carry too much weight for Westmeath", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT is a Leinster final pairing that nobody predicted but it is a final to look forward to for so many reasons. Westmeath restored some much needed faith in the football championship and proved that there is still a place in the main championship for the minnows. Dublin goalkeeper Stephen Cluxton takes a free kick Paul Curran – 06 July 2015 03:00 AM\nAt a time when I, and many others, were calling for a two-tier competition we were all put firmly back in our box as we witnessed a huge shock in the provincial semi-final when Meath were dumped into the qualifiers by their long suffering neighbours.\nIt was a terrific advertisement for Gaelic football and Westmeath thoroughly deserved the victory.\nThe manner in which they attacked the last 20 was very impressive and that dominant period will give them huge confidence going into Sunday's Leinster final against the Dubs.\nThey will be coming up against a completely different animal to Meath however, as they face a very experienced Dublin team who are picking up Leinster medals practically every year without too much fuss.\nThe evergreen Stephen Cluxton and Alan Brogan will be trying to win their 11th Leinster senior medals (2002, 2005, 2006, 2007, 2008, 2009, 2011, 2012, 2013 and 2014) while there isn't a single player on the Westmeath team who have played in a provincial decider.\nThat experience or lack of it is a huge factor.\nWestmeath will want to enjoy the occasion but they will also be well aware of just how good this Dublin team can be and will be very focused on staying in the game in the opening quarter.\nWestmeath manager Tom Cribbin will know that if this Dublin team get their noses in front they will not take the foot off the gas. The talent on the Dublin bench keeps the starters on their toes and they know that a drop in personal performance levels on any given day will automatically result in bench time the next day out.\nIt will be interesting to see if Westmeath set up ultra-defensive this Sunday in Croke Park to try and limit the damage.\nI hope they stick to their principles and come out to play on the front foot and take the game to the Dubs from the very first whistle of the game.\nThere are some outstanding players - particularly up front in the versatile Kieran Martin and John Heslin - on the Westmeath team that will need to be watched closely but I don't think they have the strength in depth to really test Jim Gavin's men.\nHeslin proved again that he is a quality player and a terrific athlete and Martin will need to be marked tightly especially if he is, as expected, given a role in the forwards again.\nHe is a very direct player who will head straight for goal every time but he also has the smarts to take a point when required which is something that some of the Meath players should have done in the closing stages of their provincial semi-final.\nIt is the biggest game for Westmeath since 2004 when they won their first Leinster senior title by beating Laois in a replay. I was in Croke Park for both games and really enjoyed the occasions.\nThe supporters have had to wait a long time to get back to another final and will come in their numbers.\nThey will be hoping that their team can pull off a seismic shock. The players will be very well prepared and if they perform close to their maximum then there will be no 20-point win for the Dubs, despite what the bookies are suggesting.\nFired up Rebels show they can live with the best WHAT a difference a day makes or in Cork footballers case what a difference a year makes as they produced a terrific second half display to earn a draw with the defending Munster and All-Ireland champions Kerry.\nIt was a game that had everything that you would want to see between these two great Munster superpowers as both teams attacked the game in a positive manner right from the throw in.\nIt was a contest that reaffirmed the belief that Cork have always had the ability to play at a very high level and on their day if they get it right they can be a very difficult team to beat.\nYesterday they got their system of play spot on and the important thing is that they had total belief in their system and made Kerry look ordinary at times especially in the second period.\nThey started the game with a hunger and a desire that is absolutely necessary if you are going to beat Kerry but you also need to bring a little bit more than that and Cork played some really attractive football throughout the entire duel.\nAll the talk last night and today will be about how well the Rebels played but the worrying thing from their point of view is that Kerry have not gone away and are likely to improve for the replay in Killarney on Saturday, July 18.\nTo beat Kerry is always difficult and they will feel that they didn't do themselves justice although they did have some great moments in the game. At half-time they looked to be in control when leading by four but lost their way after the restart. It took a wonderful long range point in injury-time from Fionn Fitzgerald to rescue the day but Eamonn Fitzmaurice will be scratching his head with his team's second half performance.\nI felt that some of the big decisions went against Cork yesterday, none more so that the penalty call, but they need to clear the heads again because they will have to be a lot better the next day. Kerry will be a tougher nut to crack in the replay.", "external_links": ["http://www.independent.ie/incoming/article31353996.ece/f994d/ALTERNATES/w620/Cluxo.jpg"], "published": "2015-07-06T11:00:00.000+03:00", "crawled": "2015-07-06T16:48:59.000+03:00", "highlightTitle": ""}