{"organizations": [], "uuid": "f20a3c61f8c272c7b3c3170df3a2146b94cc65e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03370/Baby-Doe_3370761k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/worldnews/northamerica/usa/11730669/50m-people-view-image-of-unclaimed-Baby-Doe-girl-found-dead-near-Boston.html", "country": "US", "title": "50m people view image of unclaimed 'Baby Doe' girl found dead near Boston", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "50m people view image of unclaimed 'Baby Doe' girl found dead near Boston - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T18:04:00.000+03:00", "replies_count": 0, "uuid": "f20a3c61f8c272c7b3c3170df3a2146b94cc65e8"}, "author": "Jessica Winch , and agencies", "url": "http://www.telegraph.co.uk/news/worldnews/northamerica/usa/11730669/50m-people-view-image-of-unclaimed-Baby-Doe-girl-found-dead-near-Boston.html", "ord_in_thread": 0, "title": "50m people view image of unclaimed 'Baby Doe' girl found dead near Boston", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Two weeks after the remains of a four-year-old girl were found on a Boston Harbour beach, more than 50 million people have reportedly seen or shared a computer-generated image of what she may have looked like when she was alive. But investigators have been unable to identify the girl, known as Baby Doe and believed to have had long brown hair, chubby cheeks and expressive brown eyes. The mystery began on June 25, when a woman reported finding a rubbish bag containing the girl's body. The child was wearing white leggings with black polka dots. Inside the bag with her remains was a zebra-print blanket. Police immediately appealed to the public for help in identifying the girl. The computer-generated image of 'Baby Doe' The National Center for Missing and Exploited Children used photographs of her remains to create the image of what the girl may have looked like, which was posted on Massachusetts State Police Facebook page with photographs of the leggings and blanket. \"She was discarded by someone, and the indignity of it has really struck a chord with all Bostonians and all New Englanders,\" Dan Conley, Suffolk County district attorney, told CNN . \"And we have tried very, very hard to identify who she is and how this could have come to pass.\" There were no obvious signs of trauma to her body, and an autopsy performed by the state medical examiner's office did not determine the manner or cause of her death. \"The body had no obvious signs of violent trauma, so we're looking at a possibility of a poisoning. It could have been accidental, for example. I don't know the answer to that,\" Mr Conley said. \"But that's why we appeal to the caregivers, the parents. Please step forward. Clear your conscience. No child, no person, deserves to be discarded like this.\" Mr Conley said the outpouring of support by people who have shared the girl's image on social media is gratifying and gives him confidence that her identity will be discovered. Follow @telegraphnews", "external_links": [], "published": "2015-07-10T18:04:00.000+03:00", "crawled": "2015-07-10T14:52:39.000+03:00", "highlightTitle": ""}