{"organizations": [], "uuid": "8ea3e313d5ba9e9d7764cd66bdc5f0ea21296ae1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03377/Yorkshiretea_uffin_3377611a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-17.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/sport/cricket-tea-challenge/11743445/delicious-cricket-tea-at-uffington.html", "country": "US", "title": "Uffington: delicious cricket tea but poor batting", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Uffington: delicious cricket tea but poor batting - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T17:10:00.000+03:00", "replies_count": 0, "uuid": "8ea3e313d5ba9e9d7764cd66bdc5f0ea21296ae1"}, "author": "Gareth A Davies", "url": "http://www.telegraph.co.uk/sponsored/sport/cricket-tea-challenge/11743445/delicious-cricket-tea-at-uffington.html", "ord_in_thread": 0, "title": "Uffington: delicious cricket tea but poor batting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more about the Great Cricket Tea Challenge What stood out about Uffington Cricket Club in Lincolnshire – and what made it one of the six finalists in the Yorkshire Tea Great Cricket Tea Challenge – was the pride members take not only in their club and community, but in their teas. In fact, they take them so seriously that the maker of the season’s best has their name engraved on a special wooden spoon. “We are very proud of our teas at Uffington,” says club chairman Dean Cornish. “Every team member has to make tea at least once in a season. Each tea is photographed and receives a score out of 10 from every player. The scores are then added up and the winner receives the engraved wooden spoon at the end-of-season presentation night. “It’s a fiercely fought contest, and has made our teas the best in the Rutland League. Every tea has to have a ‘special item’ in addition to the standard cricket tea fare, and this ensures that the opposition go home impressed with our efforts.” Today’s members are an inventive group, who have put the club at the heart of village life. In recent years they’ve raised £55,000 to build a new pavilion And it was the spoon in particular that impressed Yorkshire Tea. Beccie Deighton, the assistant brand manager, said: “We chose Uffington based on the concept of winning the spoon at the end of the season for the best tea. \"It’s a proper way to approach cricket teas and we liked the idea that everyone gets involved and it’s such an honour to win it.” Uffington has had a cricket club since 1858, and today’s members are an inventive group, who have put the club at the heart of village life. In recent years they’ve raised £55,000 to build a new pavilion. It stands proudly in their three-and-a-half-acre ground that was given to them by a local farmer. The club has attracted enough players to put a second team in the Rutland League, and now have three junior teams, at under-9, under-11 and under-13 level. The under-9s, a mixed team of boys and girls, are league champions. The home side, perhaps affected by the sumptuous tea, lost two wickets in the first three balls but rallied to win by four wickets Old railway sleepers, salvaged by the groundsman in the Sixties, now form the picket fence that runs around the ground, and bunting was hanging all along it when my fellow Great Cricket Tea Challenge judge Xanthe Clay and I visited to sample the Uffington tea. Uffington were hosting Northamptonshire side Weldon, who batted first and were skittled for 80, thanks to fine bowling from Ben Jennings (three for 34), Simon Larter, son of former England and Lions forward Peter (three for 14), and Steve Moody, who finished with figures of four for 29. Uffington’s success with the ball meant an early tea, or rather banquet. More than two dozen club members, their families and the local butcher contributed to it. The home side, perhaps affected by the sumptuous tea, lost two wickets in the first three balls but rallied to win by four wickets after a 60-run partnership between Damien Herrick (39) and Cornish (16). The victory lifted them to the top of Rutland League Division 3.", "external_links": [], "published": "2015-07-17T17:10:00.000+03:00", "crawled": "2015-07-17T11:25:20.000+03:00", "highlightTitle": ""}