{"organizations": [], "uuid": "d6f65d59a95382100266e27d2bb08b033a564749", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61613/icc-sydney-announces-executive-chef", "country": "US", "title": "ICC Sydney Announces Executive Chef", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "ICC Sydney Announces Executive Chef", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T12:32:00.000+03:00", "replies_count": 0, "uuid": "d6f65d59a95382100266e27d2bb08b033a564749"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61613/icc-sydney-announces-executive-chef", "ord_in_thread": 0, "title": "ICC Sydney Announces Executive Chef", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ICC Sydney Announces Executive Chef Adv: Tony Panetta, ICC Sydney Executive Chef Adv: \nFollowing much anticipation, AEG Ogden today announced the appointment of Tony Panetta as the International Convention Centre Sydney (ICC Sydney) Executive Chef. \nIn an industry move set to shake up the convention and business events market, the appointment of Tony to the venue’s culinary team is a positive coup for Sydney, highlighting the city’s ongoing attraction as a national and global talent hub. A senior practitioner with more than 20 years industry experience at leading Australian venues, Tony joins the ICC Sydney team following five years as Executive Chef of the Melbourne Convention and Exhibition Centre (MCEC). Prior to MCEC, he was the Executive Chef at the renowned Aitken Hill Conference and Events VIC and The Yacht Club Hotel VIC. \nThe Executive Chef appointment solidifies an esteemed leadership team, alongside Director of Culinary Services Lynell Peck and General Manager Adam Mather-Brown. Combining Lynell’s Sydney expertise at five star venues, Adam’s extensive international convention centre experience and Tony’s outstanding skills in delivering superior dining at large scale events, the powerful trio will deliver a world class food and beverage experience to every event held at ICC Sydney. \nSpeaking of his appointment, Tony said: “Creating innovative culinary solutions, using local produce, is a life-long passion of mine. I feel a natural affinity with the ICC Sydney Culinary Plan; to ensure the venue delivers a fresh, five star creative cuisine, while encompassing the AEG Ogden philosophy to deliver a seasonal, locally-supplied, superior food and beverage experience. I am genuinely thrilled to be appointed to this position.” \nVenue manager AEG Ogden builds exceptionally talented teams of highly experienced people who have an international outlook combined with a local focus. Adding to Tony’s sentiments, ICC Sydney Chief Executive Officer, Geoff Donaghy said: “AEG Ogden is committed to developing a world class team to manage Australia’s premier convention, exhibition and entertainment precinct, ICC Sydney. Tony’s background and award-winning accomplishments made him a clear choice for us in this role.” \nThe exceptional service and commitment displayed by Tony and his teams throughout his career has been recognised by numerous industry awards and accolades; Tony was responsible for planning and executing the culinary services for the largest medical conference ever held in Australia; the 2014 International AIDS Conference for 12,000 delegates. Under Tony’s leadership, MCEC was awarded six medals and champion trophies at the prestigious 2015 Royal Melbourne Fine Food Awards (RMFFA), including three gold for their house-made dairy products as well as MEA Awards for Banqueting and Catering 2013 and 2014. \nWhen ICC Sydney opens in December 2016 it will employ more than 320 full time and up to 1,500 casual staff.", "external_links": [], "published": "2015-07-20T12:32:00.000+03:00", "crawled": "2015-07-20T12:40:15.253+03:00", "highlightTitle": ""}