{"organizations": [], "uuid": "77e4e60b1b5fabb10a4bf7daa47fafb0d15c6605", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/27723-private-dining-terrace-make-the-rooftop-garden-suites-at-the-peninsula-paris-a-magical-summer-retreat", "country": "US", "title": "Private dining terrace make the rooftop Garden Suites at The Peninsula Paris a magical summer retreat", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Private dining terrace make the rooftop Garden Suites at The Peninsula Paris a magical summer retreat", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T14:15:00.000+03:00", "replies_count": 0, "uuid": "77e4e60b1b5fabb10a4bf7daa47fafb0d15c6605"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/27723-private-dining-terrace-make-the-rooftop-garden-suites-at-the-peninsula-paris-a-magical-summer-retreat", "ord_in_thread": 0, "title": "Private dining terrace make the rooftop Garden Suites at The Peninsula Paris a magical summer retreat", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Private dining terrace make the rooftop Garden Suites at The Peninsula Paris a magical summer retreat Private dining terrace make the rooftop Garden Suites at The Peninsula Paris a magical summer retreat Details Category: Hotel   12:15 magical summer retreat Boasting five luxurious Garden Suites, The Peninsula Paris invites guests to experience summer in ultimate style with exclusive dining on a private terrace and unbeatable rooftop garden views. Five exquisite Garden Suites at The Peninsula Paris enable guests to experience the French capital in ultimate style accompanied by exclusive views of Europe’s most romantic city. Located on the sixth floor and top floor of the beautifully restored heritage Haussmannian-style building, the Garden Suites afford stunning Parisian panoramas from a private terrace balcony. \nLandscaped rooftop gardens, accessed by a private staircase, were unique to the original grand hotel and have been carefully recreated for Garden Suite guests to enjoy at The Peninsula Paris. Remaining faithful to the building’s classic late-19th century architecture and the storied history of its elevated gardens, architect Henry Leung delved into the archives to combine true Parisian chic and secluded luxury in the heart of Paris. Jardins de l’Orangerie, an award-winning creator of distinctive terraces and gardens, and Dedon, the world’s premiere outdoor furniture brand, helped bring this vision to reality. The Peninsula Paris offers the largest choice of Garden Suites in the City of Light, with private terraces ranging from 85 to 272 sq m (915 to 2,928 sq ft). The five Garden Suites are the perfect summer retreat to savour long, sunny Parisian days and spectacular sunsets, while enjoying specially prepared seasonal dishes. Guests can share a private al fresco lunch for two while admiring the Sacré-Coeur Basilica, or an aperitif served with tapas at sunset. Alternatively, friends can gather together on the terrace for an unforgettable American, Oriental or Mediterranean barbecue party. A fine selection of wines, Champagnes and cocktails, served in person by the sommelier or head barman, can be paired with each dining option. Summertime guests staying in a Garden Suite also benefit from special “Suite Experience” privileges, including three hours use of a chauffeur-driven MINI Cooper S Clubman car for a Parisian sightseeing tour or shopping trip, free in-room internet access, free local and international VOIP calls, and access to the Swimming Pool and Fitness Centre. Related articles", "external_links": [], "published": "2015-07-15T14:15:00.000+03:00", "crawled": "2015-07-15T14:20:37.000+03:00", "highlightTitle": ""}