{"organizations": [], "uuid": "3df219b28ec3954894bbd33a793e6a6184247ed4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-event-news/", "section_title": "TRAVEL EVENT NEWS | Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/uia-and-11-media-launch-a-new-csr-program/", "country": "US", "title": "UIA and 1+1 Media launch a new CSR program", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "UIA and 1+1 Media launch a new CSR program | Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "3df219b28ec3954894bbd33a793e6a6184247ed4"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/uia-and-11-media-launch-a-new-csr-program/", "ord_in_thread": 0, "title": "UIA and 1+1 Media launch a new CSR program", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UIA and 1+1 Media launch a new CSR program Published on : Friday, July 24, 2015\nUkraine International Airlines and 1+1 Media Holding commence implementing the new corporate social responsibility program. As part of the program 1+1 Media raises funds to honor medical treatment of serious patients abroad while UIA guarantees to carry 2 aided persons* on each scheduled international flight.\nJuly 17, 2015, UIA sent the following formal letter to Jean-Claude Juncker, President European Commission:\n“UIA addresses the European Commission with an issue of the highest importance to Ukraine, Ukrainian carriers, and passengers.\nAs the Ukrainian flag carrier and member of IATA and Association of European Airlines (AEA), Ukraine International Airlines (UIA) is concerned with the fact that the Agreement on Common Aviation Area between Ukraine and the European Union is still not concluded. Currently, the case of Gibraltar-related wording is the only impediment from EU side to the Agreement conclusion, while it seems there are no barriers on the part of Ukraine.\nThe Agreement on Common Aviation Area between Ukraine and the EU will boost numerous improvements in aviation rules and standards in Ukraine, will open further market opportunities and economic benefits on both sides, will remove most of remaining limitations between Ukraine and the EU in air transportations, as well as establish free and fair competition.\nMoreover, Ukraine`s accession to Common Aviation Area will help realize the country`s aviation potential, exploit transit opportunities, encourage Ukraine`s carriers to raise operational safety, quality and service standards, facilitate the development of airlines and the consolidation of the sector, bring new opportunities for consumers.\nAs the leading Ukraine`s carrier, Ukraine International Airlines ask the European Commission to make a strong contribution to accelerate the process and commence as soon as possible the conclusion procedure for the Common Aviation Area Agreement.\nBeyond that, liberalization of air traffic between Ukraine and the East is of critical importance to further development of our country`s transit potential. Therefore, UIA encourages the Commission to join the efforts of Ukrainian aviation authorities and help gain access to the overregulated eastern markets. It will allow gradually opening the respective aviation markets and expanding flight opportunities between Europe and Asia.\nSource:- UIA\nTags: Ukraine International Airport", "external_links": [], "published": "2015-07-24T03:00:00.000+03:00", "crawled": "2015-07-24T12:40:09.584+03:00", "highlightTitle": ""}