{"organizations": [], "uuid": "0ddb301b72e152f88b04342a827a4f584dac4675", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.airwise.com", "main_image": "", "site_section": "http://www.airwise.com/", "section_title": "Airwise - The Airport and Air Travel Guide", "url": "http://news.airwise.com/story/view/1436402629.html", "country": "AU", "title": "Greek Crisis Hits Last-Minute Travel Bookings", "performance_score": 0, "site": "airwise.com", "participants_count": 1, "title_full": "Greek Crisis Hits Last-Minute Travel Bookings", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "0ddb301b72e152f88b04342a827a4f584dac4675"}, "author": "Reuters", "url": "http://news.airwise.com/story/view/1436402629.html", "ord_in_thread": 0, "title": "Greek Crisis Hits Last-Minute Travel Bookings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greece's debt crisis has hit tourism, with last-minute bookings falling sharply, although the impact on the industry may be limited because the flare-up has come late in the season when most summer holidays are already booked. The Greek Tourism Confederation said it has seen a 30 percent drop in last-minute bookings, which typically account for one-fifth of bookings to the country.\n\"We believe that a swift conclusion to the Greek government's negotiations with the country's creditors would still give us sufficient time to make up for the loss - as far as possible - in last-minute bookings,\" Andreas Andreadis, chairman of the confederation, said.\nTravel website Opodo said Greece flight bookings from Germany, which had been tracking the levels of the previous year, suddenly dropped off after June 26, when talks broke down between Greece and its euro zone creditors.\nBetween June 27 and July 6, daily flight bookings have been down most days by around 30-35 percent from the previous year, with one day showing a decrease of 68 percent.\nOther German travel sites Kayak and Swoodoo said in the week before Sunday's referendum on whether to accept the terms of a bailout searches for flights to Greece were down 8 percent compared with the previous year.\nSkyscanner said searches for flights were down 10 percent and flight prices had dropped around 7 percent.\nThe reduction in bookings seems particularly to affect Germans. Skyscanner said earlier this week that interest from Britain and Spain had actually increased. Some European tourists were switching travel plans to Greece from Tunisia following an attack on tourists there.\nMany Greeks blame Germany for their country's debt woes, and in past years some Germans have cancelled trips to Greece because of fear of hostility from the locals. In 2012, anti-German sentiment at protests in Athens led to bookings from Germans falling around 30 percent.\nThis time, the crunch has come later in the year, and with 70 percent of the 2.5 million Germans going to Greece visiting on package holidays, many trips were booked months ago. With no refunds being offered, cancellations are not being reported and tour operators have said overall demand this year was strong.\nCAPITAL CONTROLS\nCapital controls imposed since June 29, which limit withdrawals from cash machines and payments abroad, mean governments have advised tourists visiting Greece to bring euros in cash for spending money.\nSeveral airlines, including Emirates, Qatar Airways and Turkish Airlines, have stopped allowing Greek travel agents to sell their tickets, said Lysandros Tsilidis, president of the Hellenic Association of Travel and Tourist Agencies (HATTA).\n\"We consider this inexcusably tough,\" he said. \"Even though they have been our partners for years and even though we have already paid 82 percent of what we owe to them during this season.\"\nIATA has set up emergency procedures for its clearing house system which serves 400 airlines. Travel agents in Greece will be required to send funds to a Greek bank account on a weekly rather than fortnightly basis from July 15. Under the capital controls, the money still cannot leave the country.\n\"While we understand... the difficulties facing agents on the ground in Greece, this action is being taken in response to the extraordinary circumstances facing the country,\" an IATA spokesman said.\nTurkish Airlines and Emirates confirmed they had stopped issuing tickets through Greek tour operators and travel agents.\nEmirates said its customers could still book tickets for its flights via its sales office in Athens, on the phone or online.\nOther major European carriers are continuing to sell tickets, although customers with Greek bank cards may have difficulty paying airlines that process payments elsewhere.\nRyanair, which usually sells its tickets online, said last week it would allow Greek customers to pay with cash.\nLufthansa said it and group airlines Austrian, Swiss and Brussels were continuing to sell tickets paid for by credit cards with no restrictions.\n(Reuters)", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-09T06:02:30.000+03:00", "highlightTitle": ""}