{"organizations": [], "uuid": "79cf464afdfb162129dc026000dbe02d4cb75faf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenewstribune.com", "main_image": "http://www.thenewstribune.com/mistatic/images/facebook/NewsTribuneOnline.jpg", "site_section": "http://www.thenewstribune.com/164/index.rss", "section_title": "The News Tribune -- Travel", "url": "http://www.thenewstribune.com/welcome_page/?shf=/2015/06/29/3870196_the-weekly-geography-quiz.html", "country": "US", "title": "It can pay to change your ticket", "performance_score": 0, "site": "thenewstribune.com", "participants_count": 0, "title_full": "It can pay to change your ticket", "spam_score": 0.0, "site_type": "news", "published": "2015-06-29T11:00:00.000+03:00", "replies_count": 0, "uuid": "79cf464afdfb162129dc026000dbe02d4cb75faf"}, "author": "", "url": "http://www.thenewstribune.com/welcome_page/?shf=/2015/06/29/3870196_the-weekly-geography-quiz.html", "ord_in_thread": 0, "title": "It can pay to change your ticket", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["TOM PARSONS"], "text": "It can pay to change your ticket By TOM PARSONS The Dallas Morning News June 29, 2015 2015-06-29T12:53:06Z Order a reprint of this story \nOf the many fees the airlines charge these days, change fees are among the worst. \nYears ago, you could make ticket changes at no cost, and if your fare went down you'd get the difference back in a voucher. Today, the legacy airlines typically charge $200 to change a domestic ticket, and fees to international destinations can be even higher. Although I am no fan of these fees, there are times when it makes sense to pay the fee and change your ticket. \nWhen you plan a trip abroad, it's common to buy your ticket early. After you purchase your ticket, I suggest continuing to check the fare, because it could go down enough to make it worth changing. A few weeks ago, we saw some rock-bottom rates on summer and fall fares to Europe in a sale that only lasted 72 hours. This major battle of the airfares included $750 fares from Dallas to Amsterdam, Madrid or Paris and $830 from Dallas to London. Some of these fares were down from $1,700 to $1,900, so the difference was $870 and more - a huge savings. \nAirline change fees can be very expensive, and many airlines charge $300 on flights to Europe. While those are hefty, it can be worthwhile if the fare goes down significantly. In the example above, the savings after deducting the change fee would be $570 or more, so it is a scenario where it would be well worth making a change to your ticket. Typically you will get the difference back in an airline voucher that can be applied to the cost of a future ticket. \nSometimes a sale is offered by only one airline, but it could be the airline you booked on. We recently saw another quick sale on Delta to multiple cities in Central America for travel Aug. 19 through Oct. 31. The fare from Dallas to Liberia, Costa Rica, was $300 round trip during the sale. We looked at prices at press time, and the fare averaged $750, so while the savings isn't as dramatic as the Europe itinerary above, you could still get a voucher for $250 if you changed the ticket. \nLast week, we had Dallas to Frankfurt for $809 round trip on Delta, Air France and KLM for travel as early as Aug. 1, and this fare had been averaging $1,600 for travel in August. If you had a ticket on these carriers, it would have been well worth changing your ticket. These deals come and go, so it pays to keep checking. \nOn the flip side, if the cost of a new ticket is less than the change fee, you should buy a new ticket. This scenario is most likely for domestic travel because we do see tickets that are less than the $200 change fee charged by American, Delta, United and US Airways. \nWhen you buy tickets, it can be well worth the time of checking the fare rules to see what the change fees are before you book. Southwest doesn't charge change fees, so if fares are similar, you could save a lot of money by flying on Southwest if you end up needing to change your ticket. Alaska and JetBlue don't charge a change fee if you make the change 60 or more days ahead of departure, otherwise the fee is $125 for domestic and international on Alaska and $75-$150 on JetBlue, depending on the original ticket price. Virgin America charges $100 to $150 to change a ticket, depending on the route. Spirit charges $120 to $130. \nOne thing to note is if you need to change your ticket and you haven't departed, you have to pay the change fee, plus the difference in fares if the price has gone up. You also typically have 24 hours after you book to change your mind and get a full refund. \nIf you are traveling during a peak season, keep checking the fares to see if the price goes down. On domestic routes, it can be hard to find an airfare that drops by more than $200, but when you buy a ticket to Europe, or anywhere in the world, in the $1,500 to $2,000 range, you have a vested interest to keep watching that airfare and hope that it comes down by more than $300. It could drop enough to pay for your next trip. \n(Tom Parsons is CEO of www.bestfares.com. Email him at media@bestfares.com.)", "external_links": [], "published": "2015-06-29T11:00:00.000+03:00", "crawled": "2015-07-01T08:45:45.000+03:00", "highlightTitle": ""}