{"organizations": [], "uuid": "db46b4eac41af3672c9d4d56512e08d7ae146224", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27729-new-resort-head-chef-for-gleneagles-hotel", "country": "US", "title": "New Resort Head Chef for Gleneagles Hotel", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "New Resort Head Chef for Gleneagles Hotel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T16:30:00.000+03:00", "replies_count": 0, "uuid": "db46b4eac41af3672c9d4d56512e08d7ae146224"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27729-new-resort-head-chef-for-gleneagles-hotel", "ord_in_thread": 0, "title": "New Resort Head Chef for Gleneagles Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Resort Head Chef for Gleneagles Hotel New Resort Head Chef for Gleneagles Hotel Details   14:30 The Gleneagles Hotel, Perthshire, has welcomed Ram Jalasutram as its new Resort Head Chef. Jalasutram, 37, will oversee the day-to-day operations of the resort’s 70-strong kitchen brigade, including The Strathearn restaurant, Deseo and The Dormy Clubhouse, as well as Gleneagles’ private dining operation. \nEducated in Mumbai and with a family background in hospitality, Ram studied hotel management and was named Young Chef of the Year in 2002. From there, his culinary career moved to London and he went on to work in some the UK’s best-known culinary establishments. Previous roles include Sous Chef at Alain Ducasse at The Dorchester; Senior Sous Chef at The Capital Hotel in Knightsbridge; Senior Sous Chef at Gordon Ramsey’s Pétrus and, latterly, Head Chef at Pennyhill Park in Surrey. Chef Ram commented: “I am thrilled to be joining Gleneagles and look forward to learning as much as possible from the team here. It’s an energetic young brigade full of characters and I’m already impressed by their passion and hard work. “I want to focus on keeping Gleneagles on the British culinary map by serving up classics with a modern twist. One of the attractions of coming to Scotland was being able to strike up closer relationships with suppliers, and I’m excited about working with the top quality produce that’s available in Perthshire to create some fantastic dishes. “I would also like to take some of my experience of running culinary masterclasses in London and create some more opportunities for Gleneagles’ guests to interact with, and learn from, our chefs.” Executive Chef Alan Gibb will remain at the hotel, focusing more on the strategic direction for the food and beverage operation, reporting to Director of Food & Beverage Alan Hill. Related articles", "external_links": [], "published": "2015-07-15T16:30:00.000+03:00", "crawled": "2015-07-15T17:38:19.000+03:00", "highlightTitle": ""}