{"organizations": [], "uuid": "670769839b73862091ddab6f460c791be324dae2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03371/Tunisia_soldier_3371085a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/worldnews/africaandindianocean/tunisia/11731420/In-Tunisia-or-London-were-all-at-risk-from-terrorism.-Its-up-to-us-how-we-respond.html", "country": "US", "title": "In Tunisia or London, we're all at risk from terrorism. It's up to us how we respond", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 9, "title_full": "In Tunisia or London, we're all at risk from terrorism. It's up to us how we respond - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T21:01:00.000+03:00", "replies_count": 16, "uuid": "2e04ccd7abcc5729495c64590a5213730c006eca"}, "author": "Graeme Archer", "url": "http://www.telegraph.co.uk/news/worldnews/africaandindianocean/tunisia/11731420/In-Tunisia-or-London-were-all-at-risk-from-terrorism.-Its-up-to-us-how-we-respond.html#post-0", "ord_in_thread": 0, "title": "In Tunisia or London, we're all at risk from terrorism. It's up to us how we respond", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It's a little difficult to discuss something as abstract as \"risk\" in the light of the horrific murders in Sousse. But it seems germane. The Tunisian government have complained about the official advice from the Foreign Office that all British nationals should leave that country. Philip Hammond, the Foreign Secretary, said yesterday: \"Since the attack in Sousse the intelligence and threat picture has developed considerably, leading us to the view that a further terrorist attack is highly likely.\" You would be irrational, I think, to ignore advice such as this. But there's still something a little odd in the consequences of our approach to interpreting risk. After all, some of the tourists who are leaving Tunisia will return to the UK, where the current risk of terrorist attack is \"severe\". MI5's website tells us this means an attack is \"highly likely\". So coming home won't totally negate the risk. The new advice has sparked fears it could play into the hands of extremists in the North African country (Photo: Warren Allott/The Telegraph) First define your terms. By \"risk\", I think people are referring to what statisticians call the \"hazard rate\", a correctly if alarmingly named construct which measures the instantaneous chance of an event – often \"death\" – happening. That is: given that I've survived until now (time \"t\"), what is the probability that I will die in the next interval of time (time \"t plus a tiny bit\")? Without that notion of instantaneousness, talk of \"risk\" is too open-ended to be useful. Compare \"what's the probability of a terrorist attack at any point in the future?\" with \"what's the probability of a terrorist attack in the next three months?\" The probability of the latter may well be lower than the former. But the consequences of the latter, in the sort of time frame that human beings can contemplate, are so frightening that I am pleased that governments of recent years have shared their estimates of that risk with us. But risk, as I've defined it, is a sliding scale between zero (no risk at all) and one (certainty of the event). We don't know how big an increase triggers the changes in the Government's advice, which explains, I think, our zero-one behaviour (from \"it's fine to stay in Tunisia and if you leave your insurance won't cover it\" to \"please leave, and your cover is intact\"). There's a statistical reason for this too, which is to do with the expected value of an action. The \"gain\" to me of safety is immense, but not infinite. The advice comes a fortnight after 30 Britons were among 38 tourists killed on the beach in Sousse As I said, the threat level in London just now is severe: but I'm writing this in the sun, a stone's throw from the British Museum, not in a bunker on the Isle of Arran. I am (implicitly) making a calculation like this: although the cost to me of losing my life would be immense, I judge the probability of that event to be sufficiently low that in fact (sunshine, the fountain in Russell Square, the museum) I expect to make a gain on the day compared to the less risky option of spending it indoors. So I interpret the threat level as \"far enough away from certainty, in the time frame I'm considering\". Without for a second doubting the veracity of MI5's alert. Am I right to do so? Well, all probabilities are personal (which is the most controversial statement I've ever written, but one I believe to be true), and you might – the security service might – take a different view. That's fine: your calculation is as valid as mine. My point is not that we should ignore Government advice (I'm saying the opposite) , nor that it's realistic to expect anything other than concrete policies from institutions such as the Foreign Office (\"It's OK to stay / Now you should leave\"). Only that we shouldn't forget that all that advice is based on estimates of probability – that is to say uncertainty – and in particular, the (please God) lack of a repeat outrage in Sousse won't make Mr Hammond's advice wrong. In the end we each have to make our own choices, based on our own estimates of the likely cost or gain of those choices. That \"we\" certainly includes Government ministers. No angel of truth will appear to tell us what we should do to be perfectly safe. That particular angel is a fiction, certainly in a world where so many people want us dead. Follow @telegraphnews", "external_links": [], "published": "2015-07-10T21:01:00.000+03:00", "crawled": "2015-07-10T16:31:59.000+03:00", "highlightTitle": ""}