{"organizations": [], "uuid": "0bc4f4e7a84c3976021b4c0e6dcaf87d17cd255c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/More_families_to_visit_Dubai_SweetBeam-ZAWYA20150728074136/", "country": "AE", "title": "More families to visit Dubai- SweetBeam", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "More families to visit Dubai- SweetBeam", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T12:14:00.000+03:00", "replies_count": 0, "uuid": "0bc4f4e7a84c3976021b4c0e6dcaf87d17cd255c"}, "author": "", "url": "http://www.zawya.com/story/More_families_to_visit_Dubai_SweetBeam-ZAWYA20150728074136/", "ord_in_thread": 0, "title": "More families to visit Dubai- SweetBeam", "locations": ["Qatar", "US", "Dubai", "Europe", "Hollywood", "Southeast Asia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sarah White", "Troy Simoni"], "text": "Tourism boom as 3m set to visit Qatar this year Dubai - Leading luxury hotel and resort marketing specialist SweetBeam has today revealed its latest hotel industry intelligence. The results demonstrate the likely revenue increase due to the expected surgein family visitors to Dubai in the run up to 2020.S The research was conducted over a random sample of luxury Dubai hotels across a two year period. It showed that on average there was almost an equal number of business vs leisure guest nights (49% vs 51%). Of the leisure guests, while just 31% of rooms were booked by families, a staggering 50-60% of the total non-room revenue came from these guests alone. According to the research the months of March, April and December are most popular in terms of the number of families visiting Dubai. With ideal weather conditions and a tailored, informative marketing campaign the average familywill spend between AED 550 and AED 650 per room,per night on food, beverages, spa and other hotel facilities . August also sees a high number of family holidaymakers in Dubai, albeit more budget-conscious ones. During this month, families spend on average between AED 250 to AED 300 per night in addition to the cost of the room itself. \"Dubai is continuing to be the destination of choice for family holidaymakers, and this year it has never been more prevalent,\" said SweetBeam CEO, Troy Simoni.\"The Emirate is focusing on attracting 20 million visitors a year by 2020.The openings of exciting family-inspired attractions - such as a safari drive, theme parks, and entertainment parks based on Hollywood and Bollywood movies - mean that a large part of these visitors will from the valuable family segment. In line with Dubai's 2020 strategy, the next few years will highlight why Dubai is the perfect holiday choice for families\" As has been made transparent, attracting families through tourism continues to lie at the heart of the Dubai 2020 strategy and is matched by the continuous development of supporting infrastructure and attractions. *Research MethodologyThe survey was conducted across SweetBeam's partner hotels in Dubai over a 2 year period - Q2 2013, 2014, Q1 2015.Figures include in-house guest spending on hotel outlets and do not include guest spending on accommodation or spending from external visitors. These guests have been subject to SweetBeam's bespoke marketing efforts. -Ends- About SweetBeam SweetBeam is the global leader in in-house guestcapturein luxury hotels and resorts, increasing in-house guest spending on hotel outlets and discretionary services from the moment of check-in to the moment of check-out. Luxury properties generate an average of +23% more revenue from in-house guests when they use SweetBeam's individualizedmarketing techniques, as compared to using traditional marketing. SweetBeam provides a comprehensive range of individualizedmarketing services from planning and data analysis through to program activation and revenue optimization. SweetBeam is headquartered in Dubai, with offices in Europe, and is expanding to the US and Southeast Asia. For further information, please contact:Sarah White", "external_links": [], "published": "2015-07-28T12:14:00.000+03:00", "crawled": "2015-07-28T12:18:23.236+03:00", "highlightTitle": ""}