{"organizations": [], "uuid": "f985343f019c8cf31281ac5f67e8a0e5d2e4191e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/06/150601FIFAWebb.jpg", "site_section": "http://www.ticotimes.net/categories/topics/crime", "section_title": "Crime Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/17/prosecutor-confirms-fifas-webb-in-us-no-court-date-yet", "country": "US", "title": "Prosecutor confirms FIFA's Webb in US; no court date yet", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Prosecutor confirms FIFA's Webb in US; no court date yet -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T04:50:00.000+03:00", "replies_count": 0, "uuid": "f985343f019c8cf31281ac5f67e8a0e5d2e4191e"}, "author": "AFP", "url": "http://www.ticotimes.net/2015/07/17/prosecutor-confirms-fifas-webb-in-us-no-court-date-yet", "ord_in_thread": 0, "title": "Prosecutor confirms FIFA's Webb in US; no court date yet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW YORK, United States — A court appearance has yet to be scheduled for former FIFA Vice President Jeffrey Webb, extradited to the United States as part of a massive corruption scandal, a prosecutor said Friday.\nIt was the first official comment on U.S. media reports that Webb, a citizen of the Cayman Islands, had been flown from Switzerland to New York earlier this week to answer the charges.\nDuring a pre-trial hearing for the only defendant in the case arrested in the U.S., sports marketing executive Aaron Davidson, Judge Raymond Dearie asked prosecutors if Webb would appear in court “any time soon.”\n“Your honor we don’t have a date yet,” Assistant U.S. Attorney Evan Norris replied.\n“Is he in the States?” Dearie asked. “He is,” replied Norris, also confirming that Webb had a lawyer in the U.S.\nSix other former FIFA officials — including Costa Rican Eduardo Li — remain in custody in Switzerland, fighting against extradition to the United States.\nNorris said the litigation “may take several months.”\nRecommended: Eduardo Li’s lawyer says client could avoid extradition to the United States\nThe hearing was called to take stock of efforts to try the case against 14 defendants accused of soliciting and receiving more than $150 million in bribes and kickbacks across 24 years. Attorney General Loretta Lynch unveiled the 47-count indictment in May, charging the soccer officials and marketing executives with racketeering, wire fraud and money laundering conspiracies.\nThe defendant to attend Friday’s hearing was Davidson, a multilingual U.S. sports marketing executive and lawyer.\nDearie scheduled the next hearing for September 18, indicating that by then other defendants may have arrived in New York.\n“Presumably by that time we’ll have some other participants,” he said. “My biggest concern is how long we wait for others (before moving ahead with the trial),” he said.\nDavidson has been discussing a plea deal with prosecutors, court papers show. He was president of Traffic Sports USA , which bought and sold media and marketing rights for football games.\nU.S. prosecutors say he and his company bribed Webb, a former president of CONCACAF , more than $7 million in exchange for contracts giving them exclusive rights to soccer tournaments.\nDavidson, charged with racketeering, wire fraud, money laundering and obstruction of justice charges, is free on bail.\nU.S. prosecutors say he found ways to pay the bribes and cover them up, knowing what he was doing was illegal. During one meeting in New York in March 2014 to discuss the bribe schemes, Davidson acknowledged that it was illegal and “bad” for the company, his indictment alleges.\nDavidson, who went to law school, is bilingual in English and Spanish, with working knowledge of Portuguese and some French.\nTraffic Sports USA is a subsidiary of the Brazil-based Traffic Group, which was involved in buying and selling media and marketing rights for football games.", "external_links": [], "published": "2015-07-18T04:50:00.000+03:00", "crawled": "2015-07-19T03:49:10.000+03:00", "highlightTitle": ""}