{"organizations": [], "uuid": "5c30c882efa6c98fe33d34ba8fec184fe9a2a2a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03361/churchill-nike-01_3361048k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-01.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/worldnews/europe/france/11711308/Nike-fined-for-defiling-statue-of-Winston-Churchill-on-Champs-Elysees.html", "country": "US", "title": "Winston does not dribble: Nike fined for dressing Churchill statue in basketball shirt", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Winston does not dribble: Nike fined for dressing Churchill statue in basketball shirt - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T01:35:00.000+03:00", "replies_count": 0, "uuid": "5c30c882efa6c98fe33d34ba8fec184fe9a2a2a9"}, "author": "Rory Mulholland , Paris", "url": "http://www.telegraph.co.uk/news/worldnews/europe/france/11711308/Nike-fined-for-defiling-statue-of-Winston-Churchill-on-Champs-Elysees.html", "ord_in_thread": 0, "title": "Winston does not dribble: Nike fined for dressing Churchill statue in basketball shirt", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US sportswear firm Nike has been ordered by a French court to pay an artist damages for desecrating his statue of Winston Churchill striding down the Champs Elysées by dressing it in a basketball jersey in a publicity stunt. The 10ft-high bronze statue of the British wartime leader was adorned in September 2011 with a sleeveless T-shirt of the French national basketball team with the number 9, that of star player Tony Parker. The stunt was carried out with the help of events company Ubi Bene to mark the qualification of the French team for European championships and for the London Olympics of the following year. But sculptor Jean Cardot was furious at what he saw as his work being defiled and by the fact that his permission had not been asked, and he sued the two companies. The Paris court in a ruling late last month agreed with him that using the statue for commercial ends was to defile it and ordered each firm to pay the artist €67,500 (£48,000) in compensation. The statue was unveiled in 1998 by the Queen. Its plinth bears the words: 'We shall never surrender.' French anti-war campaigners desecrated it in 2009 on the anniversary of the death of the Nazi leader Rudolf Hess . They painted the statue’s hands red to signify blood and scrawled the initials RH on the plinth. The campaigners said in a statement that they blamed Churchill for the deaths of millions during the Second World War because he refused to listen to Hess’ call for an end to the conflict. The artwork is modelled on a photograph of Churchill marching with France's wartime leader General Charles de Gaulle along the Champs Elysées on November 11, 1944. The £250,000 statue – which was paid for by donations by the French public – stands on the Avenue Winston Churchill at the bottom of the Champs Elysées. It is one of the few statues in Paris of a non-French public figure. Follow @telegraphnews", "external_links": [], "published": "2015-07-02T01:35:00.000+03:00", "crawled": "2015-07-02T00:12:25.000+03:00", "highlightTitle": ""}