{"organizations": [], "uuid": "55c8a6e072a2c4ccd63b88be41ad5b5c81b99d95", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/top-chefs-make-your-cruise-mouth-watering.html", "country": "US", "title": "Top Chefs Make Your Cruise Mouth-Watering", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Top Chefs Make Your Cruise Mouth-Watering", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T19:26:00.000+03:00", "replies_count": 0, "uuid": "55c8a6e072a2c4ccd63b88be41ad5b5c81b99d95"}, "author": "Lisa Jeeves-2015-07-22T17:26:39-0400", "url": "http://www.articlesfactory.com/articles/travel/top-chefs-make-your-cruise-mouth-watering.html", "ord_in_thread": 0, "title": "Top Chefs Make Your Cruise Mouth-Watering", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | July 22, 2015 \nWhether you’re on a barge cruise in France or cruising Spain, Greece or anywhere else, these master chefs will make your experience more mouth-watering. \nAnyone who is familiar with the concept of cruises knows that it’s the staff on board who can make or break the experience. Although the atmosphere on a cruise is generally very calm and relaxed, behind the scenes there is a troupe of people working hard to make that possible. \nAmongst those people are some that hardly get any of the limelight, even though the results of their efforts are gratefully savoured every day: the chefs. \nChefs Who Can Make Your Cruise Mouth-Watering \nThere are many excellent chefs, but these particular ones have one extra level of skill that makes them unique: they carry out (or have carried out) their profession from a galley kitchen. \nTodd English, Chef on Cunard Line’s Queen Mary 2 \nEven though his last name might lead one to expect otherwise, Todd English is an American chef who is based in Boston. He is the proprietor of an upscale chain of Mediterranean-style restaurants called Olives, and with a list of accolades up his sleeve including National Rising Star Chef and Top 50 Tastemakers, he is guaranteed to deliver a quality dish on every plate that leaves the kitchen. \nHaving worked under Jean-Jacques Rachou at New York's La Cote Basque before moving to Italy to continue his career over there, he returned to the United States at the age of 25. He worked as the executive chef of an Italian restaurant in Massachusetts for three years before opening his own very first restaurant: the original Olives. English has been hired by UK cruise line Cunard Line, to run a restaurant on their ship Queen Mary 2. Amongst his specialties are seared yellow fin tuna and sea scallops with oxtail and risotto cake. \nLuc Dessain, Chef on La Renaissance of European Waterways \nHaving started his career at the age of 18 in a ski resort in the French Alps, English-born Luc Dessain is a passionate chef specialising in authentic French cuisine. After spending eight years developing his skills and finesse in the field of food, flavours and ingredients, he now works on board La Renaissance, serving his delicious creations to passengers on a barge cruise in France with European Waterways. \nThose who have enjoyed a barge cruise in France on hotel barge La Renaissance praise Dessain for his famous Sticky Toffee Pudding, a dessert that was inspired by his English childhood. Generally speaking, Luc’s cuisine is to be described as a comfortable blend of locally sourced French fare sauced with a light touch. \nDerek McKight, Chef on Board of Allure of the Seas® \nHaving worked in the cruise industry for over 30 years, Derek McKnight is truly seasoned in his profession. Arranging dinner for over 5,000 people every morning, afternoon and evening, the cooking skills of this Irish chef are hard to beat. Having trained in Cork, Killarney and Stuttgart before joining the cruise industry, he is now the proud owner of a restaurant in Cork and Executive Chef on Allure of the Seas® of Royal Caribbean International®. He likes to visit the on-board restaurants to personally check with the guests if they are happy with the food and service. Source:   ABOUT THE AUTHOR \nPaul Newman is the Marketing and E-Systems Executive for European Waterways. We can provide you with a luxury, all-inclusive barge cruise in France to enjoy the sights of the country's most picturesque waterways. Cruises are also offered in Holland, Italy and the UK.", "external_links": [], "published": "2015-07-22T19:26:00.000+03:00", "crawled": "2015-07-23T02:39:11.180+03:00", "highlightTitle": ""}