{"organizations": [], "uuid": "c87c7052f74db2028cfd8d7b4927a0b99034e0ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150728CecilZimbabwe-700x467.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/07/29/rich-us-tourists-kill-hundreds-of-lions-each-year-and-its-all-legal", "country": "US", "title": "Rich US tourists kill hundreds of lions each year, and it's all legal", "performance_score": 0, "site": "ticotimes.net", "participants_count": 3, "title_full": "Rich US tourists kill hundreds of lions each year, and it's all legal -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T01:35:00.000+03:00", "replies_count": 2, "uuid": "c87c7052f74db2028cfd8d7b4927a0b99034e0ec"}, "author": "Christopher Ingraham | The Washington Post", "url": "http://www.ticotimes.net/2015/07/29/rich-us-tourists-kill-hundreds-of-lions-each-year-and-its-all-legal", "ord_in_thread": 0, "title": "Rich US tourists kill hundreds of lions each year, and it's all legal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Internet is in an uproar this week over the recent killing of a well-known lion in Zimbabwe. Walter J. Palmer, a Minnesota dentist, allegedly baited the lion out of a national park by dragging a dead animal behind a car at night. Palmer shot it with a crossbow. The wounded lion escaped and wasn’t found by Palmer and his fellow hunters until 40 hours later, when they killed it with a rifle.\nThis would all be perfectly legal had the lion not been a resident of Zimbabwe’s Hwange National Park, a protected area. The International Union for the Conservation of Nature estimates that trophy-hunting tourists legally kill some 600 lions each year. Dr. Jane Smart, the Global Director of IUCN’s Biodiversity Conservation Group, said in an interview that the 600 figure is several years old and the actual number is probably a little bit higher than that. Given that there are only about 30,000 lions left in Africa , this represents an annual loss of roughly 2 percent of the total lion population to legal hunting, and a considerably larger share of the population of healthy adult male lions, which hunters typically prize.\nU.S. tourists — wealthy ones, given the high costs involved — account for the majority of lions killed for sport in Africa. A 2011 report by the International Fund for Animal Welfare found that between 1999 and 2008, Americans brought home lion “trophies” — heads, pelts and whatnot — representing 64 percent of all African lions killed for sport during that period. And that number is rising: “Of these trophies, the number imported into the United States in 2008 was larger than any other year in the decade studied and more than twice the number in 1999,” the report found.\nThe dwindling lion population cannot sustain hunting losses like this indefinitely, the IUCN found in its report. Last year, the U.S. Fish and Wildlife Service declined to list African lions as “endangered,” which would have banned the importation of recreational lion trophies to the U.S. Instead they listed lions as “threatened,” which allows the domestic trade in lion trophies to continue.\nSuch beautiful creatures are killed for no good reason. Hoping #WalterPalmer be punished for such horrid actions. pic.twitter.com/XfDG1zFA81\n— Anaï (@anai_scooby) July 29, 2015\nSafari Club International, the hunting group Palmer belongs to, hailed the ruling as a victory for hunters. The Club maintains an online record book where hunters can track their kills of lions and other big game animals and compare their rankings with other hunters. “You can submit your score and method of kill for any species, and it will interactively show you where you would rank in the book if your entry was submitted today,” the Web site says. An image of an example ranking page shows scores and rankings for kills of African lions.\nSafari International says there are records of over 2,000 lions killed in its online record book. A November 2014 blog post highlights the top 10 African lions killed, with photos of hunters posed next to their prizes. “The African lion is one of the most challenging and dangerous hunts,” the copy reads. “Virtually anyone who imagines an African Safari envisions the big maned lion charging the implacable hunter shouldering his European double rifle.\nThis handout picture taken on Oct. 21, 2012 and released on July 28, 2015 by the Zimbabwe National Parks agency shows the much-loved Zimbabwean lion called “Cecil.”\nZimbabwe National Parks/AFP\nIn reality, lion hunting doesn’t appear to require much in the way of skill. Many hunter-tourists are guided by teams of locals and professionals. Adult lions are not particularly afraid of humans, making it relatively easy to get close to one. They spend the majority of their day sleeping.\nHunting groups like Safari Club International maintain that hunting lions helps conserve them. They promote the positive effects of hunting in African communities. They argue that “hunting plays a role in raising the value of the African lion and discourages poaching.”\nIn a phone interview, IUCN’s Jane Smart said that well-regulated trophy hunting can be a net benefit for lion populations. “What is clear is that overall the trophy hunting must be carefully regulated, otherwise it casts the whole trophy hunting industry into ill-repute,” she said. “There is a payback for communities if we can do it in a regulated way. However unpleasant people find this, this can be a good conservation technique.” She stressed that habitat destruction and illegal poaching were even bigger threats to the lion population.\nIn a statement to the Minneapolis Star-Tribune, Palmer expressed regret. “I had no idea that the lion I took was a known, local favorite, was collared and part of a study until the end of the hunt… I deeply regret that my pursuit of an activity I love and practice responsibly and legally resulted in the taking of this lion,” he said.\nSome of the other animals the American Walter Palmer has killed. We have to stop this horrific killing of animals. pic.twitter.com/KbBKEKzLqT\n— Ian Poulter (@IanJamesPoulter) July 29, 2015\n© 2015 , The Washington Post", "external_links": ["http://www.washingtonpost.com/national/health-science/african-lions-are-set-to-become-the-last-big-cat-listed-under-the-endangered-species-act/2014/10/27/d13904a0-5de9-11e4-91f7-5d89b5e8c251_story.html", "http://t.co/KbBKEKzLqT", "http://www.washingtonpost.com/news/speaking-of-science/wp/2015/07/28/american-dentist-says-he-regrets-killing-cecil-the-lion-believed-zimbabwe-hunt-was-legal/", "https://twitter.com/hashtag/WalterPalmer?src=hash", "https://portals.iucn.org/library/efiles/documents/2009-074-En.pdf", "http://www.scirecordbook.org/login/index.cfm", "http://t.co/XfDG1zFA81", "http://www.ifaw.org/united-states/node/2666", "http://www.fightingforlions.org/pressreleases/fws-lion-decision.pdf", "https://twitter.com/anai_scooby/status/626418445442265088", "https://twitter.com/IanJamesPoulter/status/626317686398681088"], "published": "2015-07-30T01:35:00.000+03:00", "crawled": "2015-07-31T00:22:24.450+03:00", "highlightTitle": ""}