{"organizations": [], "uuid": "4a7b448dbad651aa55473f5e9deba03183afbad9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/27498-hotelrez-hotels-resorts-signs-first-apac-hotel", "country": "US", "title": "HotelREZ Hotels & Resorts signs first APAC Hotel", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "HotelREZ Hotels & Resorts signs first APAC Hotel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T15:45:00.000+03:00", "replies_count": 0, "uuid": "4a7b448dbad651aa55473f5e9deba03183afbad9"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/27498-hotelrez-hotels-resorts-signs-first-apac-hotel", "ord_in_thread": 0, "title": "HotelREZ Hotels & Resorts signs first APAC Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HotelREZ Hotels & Resorts signs first APAC Hotel HotelREZ Hotels & Resorts signs first APAC Hotel Details Category: Hotel   13:45 Following the announcement of a recent partnership with Singapore-based Peak Hospitality Solutions, HotelREZ Hotels & Resorts signs the first Asian property to its international hotel portfolio. HotelREZ will provide the 3 star GLOW Penang in Malaysia with GDS representation, under the HO chain code, as well as sales and marketing services. \nGLOW Penang in George Town is a trendy 3 star hotel in the touristic island of Penang, northern Malaysia, offering 131 well-appointed rooms. Located only 5 minutes away from the UNESCO listed town centre, GLOW has a funky, colourful and contemporary environment with all the in-room commodities the modern traveller requires - from complimentary high-speed Wi-Fi, to high pressure showers, in-room slippers, a mini-refrigerator with complimentary coffee, tea and water and a work desk with international adapter. Other facilities at the hotel include a fitness centre and swimming pool, a restaurant and pool bar, as well as a private dining/meeting room with a capacity for 40 pax theatre style. Silvan Neuteboom, General Manager for GLOW Penang, stated: \"We are very excited to be the first APAC hotel under the HotelREZ Hotels & Resorts umbrella. HotelREZ has a reputation for helping to distribute and market independent and small chain hotels, by providing them with all the necessary tools and putting at their disposal a dedicated team of account managers and support staff. We look forward to maximising our revenues on the different channels now available to us\" Lucas Peng, HotelREZ's VP of Business Development for the APAC, commented: \"GLOW Penang is our very first hotel representation in Asia, but I'm pleased to say we have several others coming on board soon. HotelREZ's strategy continues to be providing the very best hotel representation for the independents and small groups of hotels, allowing them to compete both offline and online, across the different channels.\" Related articles", "external_links": [], "published": "2015-07-01T15:45:00.000+03:00", "crawled": "2015-07-01T16:02:38.000+03:00", "highlightTitle": ""}