{"organizations": ["Tucson Museum of Art"], "uuid": "274014e0fe2e9f2e6f7ae4e8ab1fbe1b94ff8a59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://www.marketwire.com/library/MwGo/2015/7/1/11G046470/Tucson_Museum_of_Art_logo-218981005738.jpg", "site_section": "http://www.marketwire.com/rss/mwTravelandHospitality.xml", "section_title": "Marketwired - Travel and Hospitality", "url": "http://www.marketwired.com/press-release/museum-as-sanctuary-perspectives-resilience-opens-public-july-17-2015-tucson-museum-2035124.htm", "country": "CA", "title": "Museum as Sanctuary: Perspectives of Resilience Opens to the Public July 17, 2015 at the Tucson Museum of Art", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Museum as Sanctuary: Perspectives of Resilience Opens to the Public July 17, 2015 at the Tucson Museum of Art", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T17:00:00.000+03:00", "replies_count": 0, "uuid": "274014e0fe2e9f2e6f7ae4e8ab1fbe1b94ff8a59"}, "author": "", "url": "http://www.marketwired.com/press-release/museum-as-sanctuary-perspectives-resilience-opens-public-july-17-2015-tucson-museum-2035124.htm", "ord_in_thread": 0, "title": "Museum as Sanctuary: Perspectives of Resilience Opens to the Public July 17, 2015 at the Tucson Museum of Art", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SOURCE: Tucson Museum of Art July 02, 2015 10:00 ET Museum as Sanctuary: Perspectives of Resilience Opens to the Public July 17, 2015 at the Tucson Museum of Art \nTUCSON, AZ --(Marketwired - July 02, 2015) - Museum as Sanctuary: Perspectives of Resilience opens July 17, 2015 at the Tucson Museum of Art (TMA) in historic downtown Tucson. This collaboration with The Hopi Foundation's Owl & Panther Project participants features artworks by refugees and asylees from Bhutan, Chile, Congo, Ethiopia, Guatemala, Jordan, Mali, Mexico, and Nepal, who now live in Tucson. The artworks on view include self-portraits, kites, sketchbooks, sculpture, drawings, landscapes, and illustrations created at the Museum. \nCelebrating its 20 th anniversary this year, Owl & Panther Project serves refugees and asylees affected by traumatic dislocation, by providing expressive arts programs, trips into nature, and service opportunities that foster resilience and community acceptance. \nRefugees are a large and growing population in Tucson. \nARIZONA REFUGEE STATISTICS Thousands of refugees are resettled in Arizona each year from nearly every world region From 2012 to 2014 there was a 35% increase in refugees being resettled in Arizona \nSource: Arizona Refugee Resettlement Program, https://www.azdes.gov/uploadedFiles/Aging_and_Adult_Services/Refugee_Resettlement_Program/REFREPT.pdf \nThis collaboration grew into the first Museum as Sanctuary exhibition in 2013, to celebrate the growing rich diversity in the Tucson community by providing a place for extraordinary people to come together within the Museum's walls to tell their stories. \nAccording to Marge Pellegrino, Program Manager of Owl & Panther Project , \"Tucson Museum of Art has provided Owl & Panther Project with the gift of art -- both the appreciation of the Museum's exhibitions as well as the opportunity for the project participants to create their own. Their works illustrate the transformative quality of art.\" \n\"It has changed my attitude about art. I used to not like art, but now I think art is kind of a language,\" Rasoul, a refugee from Iraq, said. \"Drawing my ideas and feelings says more than when I write them down in words.\" \n\"Our relationship with the Owl & Panther Project participants has grown over the years into a community; it's a place where all of us feel at home when we are together,\" said Morgan Wells, TMA Curator of Education. \nMarianna Pegno, TMA Associate Curator of Education said, \" Museum as Sanctuary: Perspectives of Resilience broadens and enriches the stories and interpretations shared within the Museum's walls.\" \nRasoul wrote a song about the Museum titled \"Talk about Life\": \nTalk about life, I was born for a reason In the hot desert, in the summer season Life is like art, and I'm the museum My art is like my feelings, and everyone can see 'em \nThe Museum as Sanctuary: Perspectives of Resilience exhibition will remain on view until January 3, 2016. \nRelated Event: Owl & Panther Project 20 th Anniversary Celebration Saturday, September 12, 5:00 PM - 8:00 PM Join Owl & Panther Project for its 20 th Anniversary Celebration featuring the Peruvian ensemble Entre Peruanos , plus light fare and refreshments in the Tucson Museum of Art lobby. \nTickets are $35 in advance. For more information or to purchase tickets contact Abby Hungwe at OwlAndPanther@HopiFoundation.org . Ticket sales will benefit both Owl & Panther Project and Tucson Museum of Art. \nRelated Educational Event: Write On! Saturday, October 10, 10:00 AM - 12:00 PM Explore the Museum as Sanctuary: Perspectives of Resilience exhibition with award-winning writer and Owl & Panther Project Program Manager, Marge Pellegrino. Respond to a variety of prompts tied to the powerful exhibition by refugees in the Tucson community. Cost is $25/members, $35/non-members. \nUpcoming selected exhibitions: Shen Wei in Black, White, and Gray , organized by the Tucson Museum of Art, October 9, 2015 - December 6, 2015 \nWestern Heroes of Pulp Fiction: Dime Novel to Pop Culture , organized by the Tucson Museum of Art, October 24, 2015 - February 14, 2016 \nAi Weiwei: Circle of Animals / Zodiac Heads: Gold, February 13, 2016 - June 26, 2016 \nInto the Night: Modern and Contemporary Art and the Nocturne Tradition , organized by the Tucson Museum of Art, opening February 27, 2016 - July 3, 2016. \nMuseum Directions and Parking The Museum is located at 140 N. Main Avenue in historic downtown Tucson, at the crossroads of W. Alameda and N. Main Avenue. Parking is free for visitors in the Museum lot on Washington Street between N. Main Avenue and N. Meyer Avenue. \nMuseum Hours Tuesday, Wednesday, Friday, Saturday: 10 AM - 5 PM Open Late Thursday*: 10 AM - 8 PM (first Thursday of each month is free from 5 PM - 8PM) Sunday: 12 PM - 5 PM (first Sunday of each month is half-price admission) Closed Monday *See website for Thursday hours in June, July, and August. \nAdmission Adult/$12; Senior (65+)/$10; Student (with college ID)/$7; Youth (13-17)/$7; Child (12 and under)/Free; Veteran with ID/Free; Museum Member/Free. TMA joins the National Endowment for the Arts, Blue Star Families, and the Department of Defense to offer free admission to the nation's active duty military personnel and their families from Memorial Day to Labor Day. \nAbout the Tucson Museum of Art and Historic Block The Tucson Museum of Art and Historic Block's mission is Connecting Art to Life . The Museum was founded 1924 in the El Presidio Historic District of downtown Tucson. It is Southern Arizona's premier presenter of fine art and art education programs. \nThe Museum features permanent and traveling exhibitions of Modern and Contemporary, Native American, American West, Latin American, and Asian art. The Museum offers tours of exhibits, public education programs, and studio art classes for all ages. \nThe main Museum occupies a contemporary building with nearly 20,000 square feet of exhibition space. The Museum's Historic Block of 19 th and 20 th C. adobe and Mission Revival-style buildings, encompassing an entire four-acre city block, includes the John K. Goodman Pavilion of Western Art, displaying the Museum's notable art of the American West collection, the Museum restaurant Café a la C'Art, and additional exhibition spaces. \nFor more information, please visit www.TucsonMuseumofArt.org or call (520) 624-2333. Keep current on the latest events by following the Museum on Facebook.", "external_links": [], "published": "2015-07-02T17:00:00.000+03:00", "crawled": "2015-07-02T17:47:33.000+03:00", "highlightTitle": ""}