{"organizations": [], "uuid": "f022995916850c33f6ab907e515f6a20ab3db630", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eglobaltravelmedia.com.au", "main_image": "http://www.eglobaltravelmedia.com.au/wp-content/uploads/2015/07/501307_num1090914_600x600-300x300.jpg", "site_section": "http://www.eglobaltravelmedia.com.au/feed/", "section_title": "Global Travel Media", "url": "http://www.eglobaltravelmedia.com.au/hotel-verde-in-cape-town-south-africa-achieves-a-global-first/", "country": "US", "title": "Hotel Verde in Cape Town South Africa Achieves a Global First", "performance_score": 0, "site": "eglobaltravelmedia.com.au", "participants_count": 1, "title_full": "Hotel Verde in Cape Town South Africa Achieves a Global First", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T17:55:00.000+03:00", "replies_count": 0, "uuid": "f022995916850c33f6ab907e515f6a20ab3db630"}, "author": "Chisa Boonmee", "url": "http://www.eglobaltravelmedia.com.au/hotel-verde-in-cape-town-south-africa-achieves-a-global-first/", "ord_in_thread": 0, "title": "Hotel Verde in Cape Town South Africa Achieves a Global First", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email \nHotel Verde , by BON has just been awarded a second LEED® Platinum Green Building Certification by the United States Green Building Council (USGBC) making Hotel Verde the first hotel globally to achieve a double Platinum certification for LEED®. (Leadership in Energy and Environmental Design). \nThe first Platinum certification was awarded in May 2014 for New Construction in the Green Building Design & Construction category. This established Hotel Verde as one of only 6 hotels in the world and the only hotel in Africa, to receive this accolade, at the time. The second and most recent certification was awarded for the Existing Building Operations & Maintenance of the hotel, giving Hotel Verde their double Platinum status and proving that Hotel Verde is, in fact, Africa’s greenest hotel. \nSustainability consultants for Hotel Verde on the LEED submission, André Harms of Ecolution Consulting and Jutta Berns-Mumbi of Ecocentric, targeted several strategies to obtain the second Platinum Certification in the category for Existing Buildings: Operations & Maintenance (v2009). \nLEED Category Hotel Verde Score Card \nSUSTAINABLE SITES 21 OF 26 \nINDOOR ENVIRONMENTAL QUALITY 8 OF 15 \nWATER EFFICIENCY 12 OF 14 \nENERGY AND ATMOSPHERE 32 OF 35 \nMATERIALS AND RESOURCES 7 OF 10 \nINNOVATION IN OPERATIONS 5 OF 6 \nREGIONAL PRIORITY CREDITS 4 OF 4 \nTOTAL SCORE 89 / 110 \nHotel Verde’s ardent team have collectively gone above and beyond conventional industry practices by dedicating themselves to a sustainable work lifestyle. From stringent waste management and procurement policies to corporate responsibility campaigns, departmental sustainability, biodiversity maintenance and offering a carbon neutral hotel experience. Most importantly, it is the hotels aim to create an eco-friendly working environment in which staff health, happiness and productivity is optimized. \n“I quickly realised that my dream to provide something luxurious and sustainable was not only possible, but it was also a business model worth sharing, with the potential to change lives and the industry as we know it,” says Mario Delicio, owner of both Hotel Verde, Cape Town Airport and Verde Hotels. \nLaunched during the World Travel Market Africa tourism trade show, Verde Hotels is leading hotel management solutions that are not just sustainable, but thrivable. Thrivability is the new frontier of sustainability. It encompasses all that is associated with sustainability but supersedes it by maximising the triple bottom line of people, profit and planet. It is on these principles that Verde Hotels bases its core foundation. \n“We had the opportunity at Hotel Verde, Cape Town Airport, to look at everything from the ground up with regard to sustainability and efficiency with the commitment to operate sustainability. But The latest accolade showcases that Verde Hotels is ready to also optimise the operation and maintenance of existing buildings” said André Harms, Sustainability Manager and founder of Ecolution Consulting, a trained mechanical engineer and the expertise behind some of the more technical aspects of Hotel Verde. \n“As a hotel management company, this certification has been fundamental in allowing us to provide our potential clients with the assurance that we deliver truly sustainable and commercially viable hospitality solutions,” says Delicio, “Managing a thrivable hotel means a higher return on investment, lower operational costs, better environmental quality, a lower carbon footprint and a higher PR and marketing value, all whilst safeguarding natural resources and uplifting local communities. Share this:", "external_links": [], "published": "2015-07-22T17:55:00.000+03:00", "crawled": "2015-07-23T08:22:39.411+03:00", "highlightTitle": ""}