{"organizations": [], "uuid": "350f4f785e9ffca5f89f43bbf54518c6b50e2d15", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "honeymoons.about.com", "main_image": "http://f.tqn.com/y/honeymoons/1/S/m/a/2/dollywood-dreamore.png", "site_section": "http://z.about.com/6/g/honeymoons/b/index.rdf", "section_title": "About Honeymoons &amp; Romantic Travel", "url": "http://honeymoons.about.com/od/tennessee/fl/Dolly-Partons-DreamMore-Resort-in-the-Great-Smoky-Mountains.htm", "country": "US", "title": "Dolly Parton's DreamMore Resort in the Great Smoky Mountains", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Dolly Parton's DreamMore Resort in the Great Smoky Mountains", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T23:09:00.000+03:00", "replies_count": 0, "uuid": "350f4f785e9ffca5f89f43bbf54518c6b50e2d15"}, "author": "", "url": "http://honeymoons.about.com/od/tennessee/fl/Dolly-Partons-DreamMore-Resort-in-the-Great-Smoky-Mountains.htm", "ord_in_thread": 0, "title": "Dolly Parton's DreamMore Resort in the Great Smoky Mountains", "locations": ["Dollywood", "Great Smoky Mountains"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Dolly Parton"], "text": "Expert Videos The hotel resembles a train passing through the Great Smoky Mountains. Dollywood. \nJust about everyone loves Dolly Parton . Couples who want to bask in that loving feeling may find her first hotel, DreamMore Resort , a fine place to overnight in order to take in the attractions at her Dollywood theme park in Tennessee . \nAs Dolly said in a recent interview, \"Our hosts lead with their heart\" — so expect to be greeted and served with traditional Southern hospitality at her resort adjacent to Dollywood’s Splash Country. \nOpened in 2015, DreamMore Resort realizes Dolly's vision to create a place that she's been dreaming about since the day Dollywood opened. A spire marks the entrance to Dolly's hotel and the architecture of the family-friendly resort resembles a train crossing the Great Smoky Mountains . The three-story window in the airy lobby frames a view of Mt. LeConte in the distance. \nThe resort is inspired by Dolly’s childhood memories of growing up in the mountains and time spent singing, laughing, and dreaming on her family’s front porch. Multiple \"front porch\" areas at the hotel offer rocking chairs to sit a spell and spin a tale. Scattered around the 100-acre grounds are landscaped gardens, storytelling spots, fire pits, hammocks and swings that couples may find enchanting after the youngest visitors are tucked in their beds. \nInside the DreamMore Resort The hotel holds 307 guest rooms in a variety of configurations. As Dolly is adamantly family friendly, she's designed \"reunion suites,\" rooms with connecting doors. So you can expect to be surrounded by multi-generational groups and lots of families with kids during your stay. \nDolly has her own top-floor personal suite that she occupies when she is in the area. When she is away, Dolly's Suite Dreams celebrity suite can be rented and could be an amazing place for a small wedding to be held. \nThe resort also contains event spaces that can be customized for a wedding with flowers and romantic touches. For couples with a large guest list, the event lawn will be the logical choice as it can accommodate up to 400 people for a banquet. \nOne of the many amenities is a spa with a hair salon. We can only wonder if a selection of Dolly's famous wigs will be on display and for sale. And, upon request, could a guest have her tresses concocted into one of Dolly's distinctive big hair coiffeures? \nThe resort's indoor and outdoor pools will appeal to swimmers and those who like to lounge around a water hole. \nAn onsite restaurant offers casual fare, and tables for two are available. \nGuests at DreamMore resort receive exclusive park privileges including door-to-door shuttle service to Dollywood parks, which receive some five million visitors a year. \nThe Dream Box Display Adding to the unique charm of the hotel is a Dolly Parton Dream Box that will be on display. It holds several of her most meaningful personal items. As Dolly explained, \"My new resort is a dream 30 years in the making, and the items I picked for my Dream Box are closely tied to special people who encouraged me and certain events in my life where that encouragement paid off. My dream is that families who stay with us will be reminded that encouraging and loving each other is a powerful way to connect with one another.” The Dream Box box includes a song written by Parton about her hopes for the future, to be released in 2045. There's also a sealed chestnut \"mystery\" box. \nOfficial Hotel Website \nP.S. Think that DreamMore Resort actually might be a nightmare for the two of you, with so many kids present? Consider staying instead at one of the Dollywood Cabins, a few minutes away from the theme park. You can rent an individual, one-bedroom cabin with a rustic wood interior. Amenities include an indoor spa tub, fireplace, fully equipped kitchen, and no one to intrude on your private Tennessee Mountain space.", "external_links": [], "published": "2015-07-21T23:09:00.000+03:00", "crawled": "2015-07-22T11:22:38.766+03:00", "highlightTitle": ""}