{"organizations": [], "uuid": "4193983d564cd5b7dc6c2de55320c14ade00aba0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150706WomensCup.jpg", "site_section": "http://www.ticotimes.net/categories/topics/sports", "section_title": "Sports Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/06/womens-world-cup-financially-a-low-scoring-affair", "country": "US", "title": "Women's World Cup: financially, a low-scoring affair", "performance_score": 0, "site": "ticotimes.net", "participants_count": 3, "title_full": "Women's World Cup: financially, a low-scoring affair -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T11:04:00.000+03:00", "replies_count": 2, "uuid": "4193983d564cd5b7dc6c2de55320c14ade00aba0"}, "author": "Drew Harwell | The Washington Post", "url": "http://www.ticotimes.net/2015/07/06/womens-world-cup-financially-a-low-scoring-affair", "ord_in_thread": 0, "title": "Women's World Cup: financially, a low-scoring affair", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For the U.S. national team’s stunning 5-2 win over Japan at the Women’s World Cup on Sunday, a rout that made the Americans the first team ever to win three women’s world championships, soccer’s global governing body will award the team $2 million — about 5 percent of the $35 million FIFA gave to the German victors of last year’s men’s World Cup.\nAnd while viewers made the Sunday match by far the most-watched soccer game in American TV history, little of that excitement could be seen in the tourney’s marketing deals. Fox grabbed an estimated $17 million in ads from corporate sponsors of the elite women’s matches — a tiny fraction of the $529 million ESPN pocketed in sponsorship revenue from last year’s tournament in Brazil.\nThe World Cup matches over the past month proved to be a showcase of dominance for international women’s soccer, led by the powerhouse U.S. team and such stars as Abby Wambach, the game’s all-time leading scorer, regardless of gender. Attendance for the games in Canada surpassed 1.2 million, a Women’s World Cup record, while U.S. viewership of the live games hit huge new highs.\nBut the financial details also showed how some of the ugliest imbalances between the sexes still prevail, even in “the Beautiful Game.” The Women’s World Cup attracted far fewer of the marketing blitzes or mega-deals seen in men’s tournaments, and far less of the cash or corporate support, a glaring loss for players and fans of the world’s most popular sport.\nCritics have slammed the tournament from the start for the strange disparity between men’s and women’s play. While male World Cup players ran across fields of grass, women’s teams played on artificial turf, leaving them with nasty turf burns (and sparking an ongoing gender-discrimination lawsuit from some of last year’s top players).\nBut the financial rewards for women’s teams and their players at the end of the tourney revealed a more subtle gulf. The $2 million prize, though double the purse for the 2011 Women’s World Cup, is only a quarter of the $8 million earned by men’s teams that lost in the first round of last year’s World Cup.\nMen’s teams played for a total of $576 million in World Cup prizes last year, compared with $15 million up for grabs for women’s teams this year. For perspective, that’s less than what FIFA paid to make “United Passions,” the association’s $27 million history film, which was almost universally panned and made only $918 (yes, less than $1,000) at the box office in the United States.\nFIFA has defended its bigger prize pool by pointing to the mens’ tournament’s size and age: The World Cup brings in $4.5 billion in direct revenue and has been played 20 times, compared with the seven Women’s World Cups.\nThat disparity has led some companies to change the way they roll out offerings for a growing pool of fans. For the first time this year, Nike sold jerseys for the Women’s World Cup-winning team in men’s sizes, quashing a long-running double standard; men’s team jerseys have sold in women’s sizes for years.\nMeanwhile, other changes have helped highlight just how far the sport still has to go. Video-game giant EA Sports said it will, for the first time, include women’s national teams in its latest edition of one of the world’s best-selling video-game franchises, FIFA 16.\nThe change was announced after years of petitions in which signers said they wanted young girls “to be able see themselves in the games they love.” Still, only a smattering will be included: 12 women’s teams are expected, compared with the more than 600 men’s teams (and more than 16,000 male players) in last year’s edition, FIFA 15.\nThe business of this year’s Women’s World Cup saw some big gains over the 2011 tourney. Fox aired 16 matches live, with ads from more than 20 corporate sponsors, including Fiat and Nationwide Insurance, and brought in sponsorship revenue that was nearly three times as much as in 2011.\nBut companies that invested exhaustively in ad blitzes and social media around last year’s tournament, such as Adidas, proved staggeringly quiet during the Women’s World Cup. And some of the ones who took up the slack, a Fox executive told Ad Age, were “nontraditional” advertisers relatively unseen in sports broadcasts, including grooming and personal-care products from companies such as Clorox and brands such as Tampax.\nMany companies, analysts said, remain skittish about spending money on a sport without the proven returns of a bigger spectacle, such as professional football, or the market power other sports can command on shelves.\n“The fan base is growing for the Women’s World Cup, but it will take some more time,” Ellen Schmidt-Devlin, director of the University of Oregon Sports Product Management Program, told the Oregonian newspaper. “Translating watching sports into buying sports products is more direct for men than women.”", "external_links": [], "published": "2015-07-07T11:04:00.000+03:00", "crawled": "2015-07-09T00:38:04.000+03:00", "highlightTitle": ""}