{"organizations": [], "uuid": "6f7364008e9efcb336fef4d3796c9515e238cc16", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/CAET212-76_2015_172157_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/game-of-brands-comic-con-installations-engulf-downtown-san-diego-312552811.html", "country": "US", "title": "Game of Brands: Comic-Con installations engulf downtown San Diego", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Game of Brands: Comic-Con installations engulf downtown San Diego - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T14:57:00.000+03:00", "replies_count": 0, "uuid": "6f7364008e9efcb336fef4d3796c9515e238cc16"}, "author": "Derrik J. Lang, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/game-of-brands-comic-con-installations-engulf-downtown-san-diego-312552811.html", "ord_in_thread": 0, "title": "Game of Brands: Comic-Con installations engulf downtown San Diego", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SAN DIEGO - When it comes to hyping the latest pop culture spectacles, few are coloring inside the lines at Comic-Con.\nThe frenzied celebration of fantastical fiction has long drawn comparisons to a carnival. In recent years, downtown San Diego has literally been transformed into an amusement park with dozens of temporary themed attractions occupying nearby parks, event venues, parking lots and just about any place with free space outside the San Diego Convention Center.\n\nThis image provided by Activision shows a rendering of one of the rooms, themed after a vintage burlesque venue, that is part of the \"Call of Duty: Black Ops 3 Zombies Escape Room Challenge,\" which runs from July 9-11, 2015, at 450 Second Avenue, in San Diego. (Activision via AP) \nDuring this year's four-day extravaganza, which kicked off Wednesday, such offsite activities include a virtual reality experience inspired by the upcoming NBC series \"Heroes Reborn,\" a petting zoo populated by puppy beagles to promote \"The Peanuts Movie\" and a laser tag arena themed after the forthcoming 2K Games multiplayer video game \"Battleborn.\"\nFor most fans, the temporary amusements simply serve as a chance for some free fun, swag and selfies that don't require a Comic-Con badge. However, all these inflatable rides, photo opps and food trucks are actually well orchestrated \"brand activations\" — a term used by marketers to describe installations promoting films, TV shows, games and products.\n\"For us, Comic-Con is a place we want to be because there will be a concentrated audience that is open to receiving our messages,\" said Kenya Hardaway, vice-president of integrated promotions at FX, which is taking over a park next to the convention centre for attractions based on \"American Horror Story,\" ''The Strain,\" ''Fargo\" and \"The Bastard Executioner.\"\n\"Just Dance\" and \"Far Cry\" game publisher Ubisoft is returning to a lawn across the street from the 205,000-square-foot expo space to host an obstacle course modeled after the latest entry in the \"Assassin's Creed\" series. Ubisoft lured about 30,000 participants to run — and many more spectators to gawk at — last year's parkour-inspired course.\n\"It was the single biggest video game activation at Comic-Con in recent years,\" said Adam Novickas, vice-president of brand management at Ubisoft, which is releasing the London-set \"Assassin's Creed: Syndicate\" later this year. \"It made sense to bring it back, but we really wanted to do it in a way that felt fresh and more exciting than last year's course.\"\nThe military shooter series \"Call of Duty\" is deploying to Comic-Con for the first time with an escape room attraction based on the zombies mode from developer Treyarch's forthcoming \"Call of Duty: Black Ops 3.\" Activision tapped the event marketing agency NCompass to construct the experience in a parking lot around the corner from the convention centre.\n\"Activision and Treyarch set a really high bar when it comes to the adrenaline and fear that's expressed when people play the zombies mode of 'Call of Duty,' so trying to live up to that in a format that can be replicated over the course of three days is a big challenge,\" said Ryan Fitzpatrick, vice-president of marketing and branded entertainment at NCompass.\nOther free pop-up installations set for this week include an interactive \"Game of Thrones\" experience featuring props from the HBO fantasy series, a 120-foot-tall ride themed after the Fox show \"Scream Queens,\" a museum exhibit inspired by the truTV hidden camera show \"Impractical Jokers\" and video game lounges sponsored by Nintendo and Microsoft.\nWhile the pop-culture convention annually draws 130,000 fans for presentations, autograph sessions, exhibits and more inside the San Diego Convention Center, the open-to-the-public attractions are built to further raise awareness about upcoming entertainment releases for everyone, not just those who snagged Comic-Con badges and access to specific panels.\n\"It's important to be everywhere without doing something that's massively expensive,\" said Elizabeth Luciano, vice-president of marketing at A&E Networks, which is returning to the Comic-Con periphery to hand out \"Vikings\" horn-shaped cups and sponsor land-sea vehicles to provide rides to fans of the History Channel series. \"That's our strategy for this Comic-Con.\"\nThe marketers interviewed for this story declined to say just how much their companies are paying to produce these pop-up Comic-Con exhibits, but they each agreed the cost is worth it based on the impressions — social media and otherwise — that are generated during Comic-Con, which annually brings in more than $135 million to the city of San Diego.\n___\nFollow AP Entertainment Writer Derrik J. Lang on Twitter at http://www.twitter.com/derrikjlang.\nReport Error Submit a Tip Refund Refund", "external_links": [], "published": "2015-07-09T14:57:00.000+03:00", "crawled": "2015-07-09T01:50:29.000+03:00", "highlightTitle": ""}