{"organizations": [], "uuid": "5a8acd428b6c17fa40ab8e51a494f6f6e7c61921", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freepressjournal.in", "main_image": "http://www.freepressjournal.in/wp-content/uploads/2015/07/lake-300x200.jpg", "site_section": "http://freepressjournal.in/?cat=1231&feed=rss2", "section_title": "Free Press Journal » Travel", "url": "http://www.freepressjournal.in/have-you-discovered-the-lakes-of-maharashtra/", "country": "IN", "title": "Have you discovered the Lakes of Maharashtra?", "performance_score": 0, "site": "freepressjournal.in", "participants_count": 1, "title_full": "Have you discovered the Lakes of Maharashtra?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T08:52:00.000+03:00", "replies_count": 0, "uuid": "5a8acd428b6c17fa40ab8e51a494f6f6e7c61921"}, "author": "FPJ Bureau", "url": "http://www.freepressjournal.in/have-you-discovered-the-lakes-of-maharashtra/", "ord_in_thread": 0, "title": "Have you discovered the Lakes of Maharashtra?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home / Travel / Have you discovered the Lakes of Maharashtra? Have you discovered the Lakes of Maharashtra? — By FPJ Bureau | Jul 01, 2015 05:52 pm \nThe gushing showers of monsoon bring in fresh water that quenches our thirst. The earth gets drenched and soaked in these showers which allow us to see the true beauty of nature. Lakes are one such part of our arena which can’t be missed. Give yourself a break from the city life and enjoy the fresh waters of these beautiful lakes of Maharashtra. The lakes are surrounded by all kinds of flora, fauna. The existence of these lakes can be traced back in time of various historical eras. Lonar Lake \nIt is located at Lonar in Buldana district. The fascinating part about this lake is that it was created by a meteor impact during the Pleistocene Epoch. The lake is both saline and alkaline in nature. There are many temples around the lake which are kind of ruined. However the temple of Daitya Sudan was built in honor of Vishnu’s victory over the giant Lonasur. It is surrounded by birds such as black-winged stilts, brahminy ducks, grebes, shelducks, shovellers, teals, herons, red-wattled lapwings, rollers or blue jays, baya weavers, parakeet hoopoes, larks, tailorbirds, magpies, robins and swallows. The other kinds of fauna found here are monitor lizard, peafowls, chinkara and gazelles. Top view of the Lonar Lake \nVenna Lake \nIt is a famous attraction of Mahabaleshwar. It was constructed by Shri Appasaheb Maharaj, who was Raja of Satara in the year 1842. There are tall trees on all sides of the lake. Boat ride and Horse ride are some tourist attractions here. The S.T bus stand is about 2km from the lake. Anchored boats at Venna Lake Rankala Lake \nA natural beauty situated in the Kolhapur district. The area around the lake is converted into a garden. You will find the local street food stalls which serve Bhel-Puri, Ragda Patis and various mouth-watering snacks like roasted corns etc. Towards the west bank of the lake you can see The Shalini Palace which has been turned into a hotel. Beautiful dawn at Rankala Vihar Lake \nIt is near Vihar village on the Mithi River and lies within the Sanjay Gandhi National Park, Mumbai. During the 60’s it was considered as the largest lake in Mumbai. Drinking water of South Mumbai is taken from here. There are high hills on all sides of the lake. You will also find fresh water crocodiles here. Vihar Lake surrounded by lush green vegetation Upvan \nAlso known as Upavan is a lake located at Thane. It is famous for hosting the Sanskruti Arts Festival. It is surrounded by Yeoor Hills which give a serene view of the beautiful landscape. The Upvan Lake is also called as Thane’s ‘lover’s paradise’. The crescent bank of Upvan Lake Tulsi Lake \nIt is said to be the second largest lake of Mumbai and caters to the city’s needs of fresh water. It is surrounded by lush green vegetation. You will find fresh water crocodiles here as well but very rare to spot. Hence, a Crocodile Park has been set up to view these reptiles. Beautiful clear waters of the Tulsi Lake Talao Pali \nIt is also known as Masunda Lake and is located at Thane. It rests between roads on all sides and is about 600 m west of Thane creek. It also offers boating and water scooter facilities. Beautiful temple amidst Talao Pali Salim Ali Sarovar \nIt is popularly known as Salim Ali Talab is located near Delhi Gate, opposite Himayat Bagh, Aurangabad. It has been named after great ornithologist, naturalist Salim Ali and also known as birdman of India. The surrounding of this lake has rich biodiversity that contains different kinds of species of trees, shrubs, climbers, insects, fish, reptiles etc. Sunrise at Salim Ali Lake Khindsi Lake \nIt is situated near the city of Ramtek in the Nagpur. The lake offers various water sports and boating facilities. The restaurant and resort here is operated by Rajkamal Tourism and Olive Resorts. It is central India’s largest boating center and amusement park with lakhs of tourists visiting every year. Boats resting at the banks of Khindsi Lake Shivasagar Lake \nIt is a reservoir in Maharashtra. The lake was formed after the Koyna River was impounded by the Koyna Dam. It spreads across 50 km of length and is 262 ft deep. The still waters of Shivasagar Lake \nIf you have any of your travel pictures to share send them to us at webeditor@fpj.co.in Top view of the Lonar Lake Anchored boats at Venna Lake Beautiful dawn at Rankala Boats resting at the banks of Khindsi Lake Sunrise at Salim Ali Lake Amazing centre piece amidst Talao Pali Beautiful clear waters of the Tulsi Lake The crescent bank of Upvan Lake Vihar Lake surrounded by lush green vegetation The still waters of Shivasagar Lake Share this Post:", "external_links": [], "published": "2015-07-01T08:52:00.000+03:00", "crawled": "2015-07-01T19:16:38.000+03:00", "highlightTitle": ""}