{"organizations": [], "uuid": "2769686ad3b21154ab53678959ed4a4ef3a86330", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources0.news.com.au/images/2015/07/28/1227460/962848-f00046a6-34c5-11e5-9c8f-aecce85b5e15.jpg", "site_section": "http://www.adelaidenow.com.au//travel", "section_title": "Travel | Travel News and Holiday Deals | The Advertiser", "url": "http://www.adelaidenow.com.au/business/work/there-may-be-a-method-to-the-madness-we-just-have-to-ask-what-the-donald-is-really-up-to/story-fnkjjewf-1227460963432", "country": "US", "title": "Donald Trump: leads Republicans in US Presidential race | Business News | Business and Finance News |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Donald Trump: leads Republicans in US Presidential race | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T07:20:00.000+03:00", "replies_count": 0, "uuid": "2769686ad3b21154ab53678959ed4a4ef3a86330"}, "author": "NICK WHIGHAM", "url": "http://www.adelaidenow.com.au/business/work/there-may-be-a-method-to-the-madness-we-just-have-to-ask-what-the-donald-is-really-up-to/story-fnkjjewf-1227460963432", "ord_in_thread": 0, "title": "Donald Trump: leads Republicans in US Presidential race | Business News | Business and Finance News |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT MAY seem like a joke, but fewer and fewer people are laughing.\nWeeks after announcing his campaign for the Presidency of the world’s most powerful country, Donald Trump continues to enjoy a considerable lead in the polls against his Republican Party rivals.\nThis seemingly inexplicable state of affairs has pundits and commentators scrambling to answer a whole range of questions: How is this happening? How far can he really go? And perhaps most importantly, what’s the Donald really up to?\nHOW IS THIS HAPPENING?\nAmong his many claims to fame and fortune is a successful reality TV show, and so far his campaign has had all the characteristics of the genre famed for its contrived drama.\nFirstly, while announcing his nomination for the GOP candidacy he casually delivered jaw-droppingly racist remarks against Mexicans calling them “rapists” who “bring drugs into the country”.\nNot content with offending an entire nation of people, he followed it up by going after America’s patriotic touchstone — those in the armed forces.\nA serial draft dodger himself, Trump attacked fellow Republican John McCain saying he wasn’t a war hero because he was captured and spent time as a POW in Vietnam. His comments were met with a unanimously fierce reaction from his rivals.\nHot off the heels of his disparaging remarks, he then made the comical move of giving out the phone number of presidential candidate Lindsey Graham while at a rally in South Carolina. The immature stunt came after Graham repeatedly called him a “jackass” in an interview pertaining to the McCain comments.\nThrough all this bombastic behaviour, Trump has enjoyed a ride to the front of the pack.\nHis Mexican comments may have been heavily condemned, but they have resonated with the Republican base concerned over immigration policy. Trump made a splash with his incendiary comments, and as the BBC notes , “for conservatives who care about the issue, he’s become their guy.”\nAs for the theatrical nature of his larger-than-life personality, he’s in the right place. America’s love of celebrity knows no bounds and you only have to look at Arnold Schwarzenegger and Ronald Reagan to know that a certain amount of celebrity can be translated into votes.\nBacked up by his immense credentials in business, he’s highly visible public profile has so far been enough to make him a viable threat and the unlikely frontrunner.\nRepublican presidential hopeful businessman Donald Trump finishes a rally on July 25, 2015 in Oskaloosa, Iowa. Source: AFP\nHOW FAR CAN HE REALLY GO?\nAccording to a CCN/ORC poll published on Monday, Trump holds a substantial lead: 24 per cent support him versus 13 per cent for former Florida governor Jeb Bush, with the rest of the field at 8 per cent or less.\nThese figures were mirrored by a Washington Post poll last week which also showed him capturing 24 per cent of the Republican vote — the biggest lead recorded by a GOP candidate this year.\nIt’s still early days, but it’s a noteworthy and durable lead.\nTrump also has the funds (and the hubris) to bankroll his own campaign. So unlike many other candidates, he’s not hamstrung by donors or an imperative to constantly fundraise.\nAt the very least, his lead, bank account, and profile will ensure he gets a podium at the debates — the first of which is just ten days away.\nTrump has also slipped into a timeless mould of political campaigning — the outsider. By assuming the role of the outspoken interloper who’s not afraid to speak his mind, his campaign has developed the weapon of (seemingly) being impervious to embarrassment.\nIf revelations that he paid people to attend his rallies didn’t slow him down, it’s gonna take something much bigger than that.\nDonald Trump talks to media from his car wearing a, \"Make America Great Again,\" hat during his trip to the border on July 23, 2015 in Laredo, Texas. Source: AFP\nWHAT’S THE DONALD REALLY UP TO?\nIt’s still very difficult for anyone to picture Trump in the White House, but that might not be what he actually wants.\nWhile the Economist noted the “improvisational spirit” of his campaign, likening him to a dog chasing a car, the magazine posed the idea that he’s already caught it.\nHis lead in the polls has afforded the candidate some serious political leverage, and he wasted no time in hinting that he’d use it. When asked if he would seek a third party nomination if he fails to secure the GOP candidacy, his response was far from subtle.\n“So many people want me to, if I don’t win,” he said. “I’ll have to see how I’m being treated by the Republicans.”\nIf Trump did make a third-party bid, it could prove disastrous for the Republican’s chances of regaining the White House. He would likely cannibalise votes for the party by drawing them away from the eventual GOP candidate. Such a scenario would pave the way for an easy Democratic victory and the Republicans would be forced to seek a deal to avoid such an outcome.\nThe terms of such a deal would be anyone’s guess but in the red-tape filled world of corporate real estate which Trump calls home, political favours can be worth millions.\nIf his motives for joining the race were in fact to strike a deal some have conceded it would amount to a stroke of “buffoonish genius.”\nYou don’t get to having a net worth of four billion dollars without a tremendous amount of foresight.\nAnd if this does turn out to be the case, Donald Trump has already won.\nREALITY CHECK 2:08 Play video\nDonald Trump, a warning to Australia.\nnews.com.au 26 Jul 2015 News/Bolt Report Originally published as What is Trump really up to?", "external_links": ["http://www.washingtonpost.com/politics/poll-trump-surges-to-big-lead-in-gop-presidential-race/2015/07/20/efd2e0d0-2ef8-11e5-8f36-18d1d501920d_story.html", "http://www.news.com.au/finance/work/there-may-be-a-method-to-the-madness-we-just-have-to-ask-what-the-donald-is-really-up-to/story-fn5tas5k-1227460963432", "http://www.bbc.com/news/world-us-canada-33660969", "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/V3N3lodjqmyfTyot3PeFJnD18PYIymHz/promo262143556&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://www.economist.com/blogs/democracyinamerica/2015/07/politics-and-deal-making", "http://i2.cdn.turner.com/cnn/2015/images/07/26/72715cnnorc.pdf", "http://resources0.news.com.au/images/2015/07/28/1227460/962876-0b09dba6-34c6-11e5-9c8f-aecce85b5e15.jpg", "http://resources0.news.com.au/images/2015/07/28/1227460/963380-fbefdb34-34c5-11e5-9c8f-aecce85b5e15.jpg", "http://www.hollywoodreporter.com/news/donald-trump-campaign-offered-actors-803161", "http://www.theguardian.com/us-news/2015/jul/19/donald-trump-john-mccain-vietnam-prisoner-of-war"], "published": "2015-07-29T07:20:00.000+03:00", "crawled": "2015-07-28T20:10:44.878+03:00", "highlightTitle": ""}