{"organizations": ["Central Coast", "Point San Luis Lighthouse Keepers"], "uuid": "7d45589c8755fb4bf20357699e89f4d969d84b8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellaonline.com", "main_image": "http://www.bellaonline.com/images/editors/california.jpg", "site_section": "http://www.bellaonline.com/channel.rss?id=15", "section_title": "Travel and Culture @ BellaOnline", "url": "http://www.bellaonline.com/articles/art15815.asp", "country": "US", "title": "Point San Luis Lighthouse", "performance_score": 0, "site": "bellaonline.com", "participants_count": 0, "title_full": "Point San Luis Lighthouse", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T09:00:00.000+03:00", "replies_count": 0, "uuid": "7d45589c8755fb4bf20357699e89f4d969d84b8d"}, "author": "", "url": "http://www.bellaonline.com/articles/art15815.asp", "ord_in_thread": 0, "title": "Point San Luis Lighthouse", "locations": ["Avila Beach", "California", "California Coast", "San Luis", "San Luis Lighthouse"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BellaOnline's California Editor Point San Luis Lighthouse Those interested in the history of California would do well to schedule a tour of the Point San Luis Lighthouse in Avila Beach, California. Completed in 1890, the lighthouse protected the Central Coast until 1974. Today, the premises have been restored by a local nonprofit group, the Point San Luis Lighthouse Keepers, which give the tours. A visit allows the traveler to step back in time and see the California Coast as it existed before the supremacy of the automobile. Visitors must reserve in advance, but cannot drive to the lighthouse. A trolley provides transportation from the parking lot to the lighthouse site; those who wish to can also stretch their legs on a docent led hike up a trail which parallels the road next to Diablo Canyon. The fifteen minute trolley ride also boasts a docent, and stunning views can be glimpsed on the fifteen minute ride to the lighthouse buildings. Once on the premises, tours are given in groups of eight. A docent takes the group through the main lighthouse building, which has been refinished to showcase the lives of the lighthouse keepers and their families. The tour, which takes approximately forty minutes, is given by docents well acquainted with the areas history. Between two buildings (a duplex and a main house), three families lived on the peninsula, with only marine access to the rest of California. There was no electricity or running water during the first few decades that the lighthouse was in operation. Children of the wickers (so named because one of their duties was to trim the wick of the lamp inside the lens) walked two miles each way to the one room schoolhouse in nearby Avila Beach. Supplies were brought in by boat. Many people do not realize that the Central Coast of California was attacked by the Japanese during World War II. In the Avila region, an oil tanker was torpedoed and sank. In 1942, a radio listening station was added to the complex to allow for greater protection of the oil fields in the vicinity. One of the highlights of the tour is the chance to examine the Fresnel lens, which was removed from the premises when the lighthouse closed but has been returned to the facility. Like all Fresnel lenses, this apparatus refracted light in such a way as to make it visible much farther across the ocean. The Point San Luis lens is of the fourth order, which gives it a focal length of 250 mm. Those passionate about lighthouses or maritime history can donate to or even join the Lighthouse Keepers. More information about the area and the tour can be found at www.sanluislighthouse.org.", "external_links": [], "published": "2015-07-05T09:00:00.000+03:00", "crawled": "2015-07-05T14:36:22.000+03:00", "highlightTitle": ""}