{"organizations": [], "uuid": "a4586bcfe072f2b8bc2c7a1437f689cef1e0f96d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03392/lakesuperior-us_3392162k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-30.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/northamerica/11772443/The-Great-Lakes-Trip-of-a-Lifetime.html", "country": "US", "title": "The Great Lakes: Trip of a Lifetime", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "The Great Lakes: Trip of a Lifetime - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T20:20:00.000+03:00", "replies_count": 0, "uuid": "a4586bcfe072f2b8bc2c7a1437f689cef1e0f96d"}, "author": "Chris Moss", "url": "http://www.telegraph.co.uk/travel/destinations/northamerica/11772443/The-Great-Lakes-Trip-of-a-Lifetime.html", "ord_in_thread": 0, "title": "The Great Lakes: Trip of a Lifetime", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "With a fifth of the world’s freshwater and covering an area of around 95,000 square miles, North America’s five Great Lakes are like inland seas, with major cities on their fringes – including Chicago, Toronto and Detroit – as well as fishing ports and surfing beaches and historic lighthouses, highways and car-free islands. The southern shores harbour port cities were built around epoch-making industries; some have seen better days, but there’s much to fascinate among the ruins of the Rust Belt. Shimmering architecture, hearty gastronomy, a passion for sports and civic pride are mainstays of the Midwestern experience. The region’s musical legacy – notably the blues and Bob Dylan – and authors as varied as Ernest Hemingway and Kurt Vonnegut are celebrated in museums, trails and libraries. • Minnesota: Bob Dylan's back pages The Rock and Roll Hall of Fame museum in Cleveland (photo: Alamy) Natural beauty is in abundance, especially around Lake Superior and Lake Michigan, where rugged cliffs, rocky peninsulas and towering dunes are occasionally punctuated by townships. Less famous – and more tranquil – than Yellowstone or Yosemite, forested national parks and protected areas provide pristine habitats for black bear, moose and white-tailed deer. Spectacular hiking can be had in mountainous areas such as the Porcupine Mountains. • US cities: readers' tips, recommendations and travel advice See more from our Trip of a Lifetime series It’s worth heading to a high place to get a sense of the scale of the Great Lakes. Ringed by thousands of lagoons, they were formed about 20,000 years ago when the last continental ice sheet retreated; the same process led to the formation of the escarpment over which the Niagara Falls tumble. Great weather systems form over this immense water land; on occasions, the aurora borealis drapes itself across the night sky. The Midwest, once the heartland of American identity as well as the motor of its industry, doesn’t always get a fair press. The Great Lakes provide an opportunity to explore the culture of some fascinating cities and towns, overturn a few stereotypes, and go inland to drive through the corn fields, dairy farms and fruit groves that blanket the region. The Horshoe Fall at Lake Ontario (photo: Alamy) Where to go The five Great Lakes – east to west they are Ontario, Erie, Huron, Michigan and Superior – are spread across eight states in America: Illinois, Michigan, Minnesota, Ohio, Wisconsin, Indiana, New York and Pennsylvania and, in Canada, Ontario. Wise visitors choose a region and explore it at a leisurely pace. Museum and gallery lovers who want some upscale gastronomy should head for the cities. For flora and fauna, Minnesota has more than 1,400 designated wildlife areas. For watersports, base yourself in south-western Ontario. Michigan has 1,300 miles of bike trails. More than 72  million fish a year are caught in Wisconsin’s 15,000 inland lakes and 42,000 rivers and streams. • 10 great US activity holidays The Great Lakes present a wonderful opportunity for a driving holiday – which is why many tour firms offer this. With competitive prices, pickups at the main arrival airports – Chicago, Detroit, Minneapolis-St Paul, Toronto – and many routes, the roads around the Great Lakes are wide open. Lake Huron (photo: Alamy) When to go Warm temperatures during summer make beaches and islands attractive, though rainfall is highest then. Spring and autumn are ideal, with impressive displays of foliage in the forested areas, and shoulder-season bargains to be had. Winter can be very cold, with a risk of heavy snows and travel delays. Lake Ontario and Lake Erie The smallest in surface area of the Great Lakes, Lake Ontario’s tourism revolves around Niagara Falls, formed by the dramatic drop of the Niagara River – at Horsehoe Fall, it’s 165ft – from Lake Erie to Ontario. Most people come on day trips, but if you’re touring the area you can combine a thrilling boat trip on the Maid of the Mist with visits to the once-prosperous blue-collar city of Buffalo, and tidier, trimmer Rochester, famous for the Kodak company – the International Museum of Photography has a top-class exhibition dedicated to the history of the art form. • Canada holidays: exploring Ontario Until the arrival of the railway, the Erie Canal – which runs 363 miles between Albany and Buffalo – was the principal means for transporting goods between the Atlantic and the Great Lakes. It’s now a popular waterway for pleasure craft – with 36 locks allowing plenty of opportunity for slow gazing at the varied rural and post-industrial landscapes. Toronto is a lakeside city, though its skyscrapers try to hide the fact. One of the world’s most multicultural melting pots, its cuisine, pubs, art galleries, music and museums rival any across the border; summer is festival season, winter is dreadful. The Erie Canal (photo: Alamy) This shallowest of the Great Lakes, Lake Erie is in a populated, industrialised zone. Cleveland was once best known for its sprawling port (hence the nickname the “Mistake on the Lake”). But the city is home to the well-regarded Rock and Roll Hall of Fame and in recent years has seen a hipster food and retail scene around Ohio City and Tremont. In 2014 it was host city for the Gay Games. Detroit gets namechecked mainly for crime and decline. But it boasts a vigorous music scene, and incomers are turning abandoned warehouses into hostels and art spaces. It’s worth pit-stopping here to see the enormous Henry Ford Museum, full of oddities as well as vintage cars, and The Motown Museum, housed in Hitsville USA – the Motown label’s recording studio from 1959 to 1972. • Mary Wilson's Detroit: My Kind of Town The Lake Erie islands – Kelleys Island and the Bass Islands, to the north – were used by the Iroquois as stepping stones en route to Ontario and were later developed for winemaking. They’re popular with party people, bathers and anglers. Pelee Island on the Canadian side has mellow bike tours to see migrant bird populations, salamanders and turtles. Best for : island stays, big city fun, gastronomy, Niagara Falls, musical memories, Rust Belt ruins. Lake Michigan-Huron Forming a huge horseshoe, joined by the Mackinac Straits, these two lakes are often grouped together. The Upper Peninsula, isolated from Michigan state by the straits, is home to some of the lake’s most beguiling natural attractions. One of the most photogenic is the Pictured Rocks National Lakeshore, a rich mix of swampland, limestone hills, rolling dunes and multicoloured cliffs – the dramatic forms of the latter carved by ice, wind, rain and sun over millennia. • Chicago: High times in the Windy City Chicago’s reputation blows like the winds off Lake Michigan. While no longer an economic and cultural powerhouse, the city has an enviable rock, jazz and blues live music scene, a world-class gallery in the Art Institute of Chicago and one of the most impressive skylines on the planet. Heading north out of the city, Lake Michigan’s western shore is best known for its beach towns, and Milwaukee, home to an excellent lakeside art gallery – featuring a spectacular wave-inspired extension designed by Santiago Calatrava – and the Harley Davidson Museum. The Chicago skyline over Lake Michigan (photo: Alamy) Highway 31 skirts the eastern shoreline for 366 miles. On a bluff jutting out into the lake, quaint St Joseph is the first of several small port towns that have evolved into resorts. Chicago escapees and locals descend on Traverse City for the beautiful beaches, cherry orchards and easy access to the stunning Sleeping Bear Dunes National Lakeshore. Lake Huron, which has some of the cleanest waters in the Great Lakes, is best explored from Canada. The 140-mile Highway 21 weaves its way through the farms and forests hugging the shoreline, with some idyllic campsites en route as well as period mansions turned into b & bs. A two-hour ride on the car-ferry from Tobermory takes visitors to Manitoulin Island, the largest freshwater island in the world. See ontarioswestcoast.ca for more ideas. Best for : art, architecture, big city fun, beaches, camping, landscapes Lake Superior More than 300 miles from east to west and covering an area equivalent to Austria, Lake Superior is connected to the Atlantic by the St Lawrence seaway – there’s a popular six-day river cruise from Kingston, Ontario, to Quebec City via Montreal. Minnesota, the state that wraps around the lake’s westernmost end, is a Sioux word for “land of sky-tinted water”. It is fed by more than 200 rivers and, thanks to the gusting winds, waves can reach heights of 20ft. For such an immense body of water, the lake boasts relatively few conurbations. Duluth expanded first around the fur trade and later as a trading port for timber and iron ore; now it’s probably best known to outsiders as the birthplace of Bob Dylan, though he was raised in Hibbing – inland, 75 miles to the north, and site of a Dylan display in the local museum. The Lutsen Mountain Resort at Lake Superior (photo: Alamy) If you want to spend a night with a big window from which to ogle the biggest lake, the luxurious log cabins at Grand Superior Lodge ( grandsuperior.com ), just south of Gooseberry Falls State Park, and the more contemporary Surfside on Superior ( surfsideonsuperior.com ) at ski-resort town Lutsen are both on the north shore and easily reached from Duluth. • 10 of America's best state parks Huge forested parks line the border with Canada. Voyageurs National Park is at the southern tip of the Northern Boreal Forest – comprising about a third of the circumpolar forest – and is a watery wonderland, with osprey and eagles feasting on walleye, bears roaming the riverbanks, and the shimmering, silent lakeside. On the Canadian side, sea kayaking, boating, fishing and diving operations cluster around Thunder Bay, with some 50 miles of hiking trails in the nearby Sleeping Giant Provincial Park, where there’s chance of seeing moose, wolf, fox, lynx and up to 200 bird species. Best for : lakeside lodging, watersports, wildlife watching. How to book Fly-drive: Virgin Holidays’ (0844 557 3859; virginholidays.co.uk ) 15-night Great Cities of the Lakes self-drive tour includes Chicago, Green Bay, Marquette, Traverse City, Detroit, Toronto, Niagara Falls, Cleveland and Nappanee. From £1,799pp including car hire, accommodation and flights. Many firms offer fly-drives, featuring a range of accommodation – compare options at Audley Travel (01993 838650; audley.co.uk ) and Trailfinders (020 7368 1200; trailfinders.com ). Fully guided tour: Grand American Adventures’ (0333 999 7965; grandamericanadventures.com ) 14-day Great Lakes Tour, by private vehicle for groups of up to 13, begins and ends in Chicago, taking in Toronto, Detroit, Traverse City, Milwaukee, Indiana and the Sleeping Bear Dunes National Lakeshore. Wine-tasting, a blues concert, and a visit to an Amish town included. Swimming and hiking opportunities en route. From £2,948 per person, including 3‑star accommodation (room only) and flights. On the water: My America Holiday’s (020 8290 9797; myamericaholiday.co.uk ) nine-night Historic St Lawrence and Great Lakes cruise aboard the 210-berth MS Saint Laurent starts in Montreal and visits Chicago with stops in Niagara Falls, Detroit, Manitoulin Island, Sault Ste Marie and Mackinac Island. The cruise operates in both directions. From £2,845pp including accommodation in a Category H twin cabin, all meals, drinks, tours and port charges. Various dates available for summer 2015. Flights are extra. Advance reading Coast to Coast. Jan Morris’s 1956 travelogue, in which she reflects on the changing fortunes of the Midwest. The excellent official website greatlakesusa.co.uk provides clearly illustrated state-by-state information. For Canada, see the attractive Ontario tourism site ontariotravel.net . The Toronto harbour (photo: Alamy) Listen out for A Midwest/Great Lakes music selection should include: Bob Dylan’s raw 1964 album The Times They Are a‑Changin’, Muskegon-born Iggy Pop’s Kill City, Detroit-raised Eminem’s The Marshall Mathers LP. What to pack Sunblock, hat with a strap, windproof jacket, good maps, binoculars. The inside track If starting a fly-drive in Toronto, you may not be able to drop-off in America – or be charged an extortionate amount to do so. Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-07-30T20:20:00.000+03:00", "crawled": "2015-07-30T14:46:41.005+03:00", "highlightTitle": ""}