{"organizations": [], "uuid": "bb9d08fa9cea6fd7251b0e7b470de68dfb8b6342", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://www.independent.co.uk/incoming/article10392909.ece/binary/original/vijitt-phuket.jpg", "site_section": "http://www.independent.co.uk/travel/rss", "section_title": "- Travel RSS Feed", "url": "http://www.independent.co.uk/travel/asia/mastering-muay-thai-in-phuket-from-an-east-london-gym-to-a-holiday-island-in-thailand-10395720.html", "country": "IE", "title": "Mastering Muay Thai in Phuket: From an East London gym to a holiday island in Thailand - Asia - Travel", "performance_score": 0, "site": "independent.co.uk", "participants_count": 2, "title_full": "Mastering Muay Thai in Phuket: From an East London gym to a holiday island in Thailand - Asia - Travel - The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 1, "uuid": "ed1defc1a525d3d8216bb68da09a588ffcba370e"}, "author": "David Lewis", "url": "http://www.independent.co.uk/travel/asia/mastering-muay-thai-in-phuket-from-an-east-london-gym-to-a-holiday-island-in-thailand-10395720.html#post-0", "ord_in_thread": 0, "title": "Mastering Muay Thai in Phuket: From an East London gym to a holiday island in Thailand - Asia - Travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The enormity of what I'm about to do hits me as I lumber up the rickety iron steps and into the ring. Bemused-looking holidaymakers have taken a break from their combat training and are craning their necks, curious as to why there is a cameraman trailing me across the canvas. \"This is Tup,\" my instructor tells me, gesturing to the sculpted boxer jumping up and down in front of me. \"He'll be fighting you today.\" I nod and can barely look at him. \"Go easy on him, Tup.\" Tup is all kind-eyes and smiles. But I don't think he understands what \"go easy\" means ...\nPART ONE: London, England \nMy Muay Thai journey begins in the most unlikely location; a gym below an underpass in east London. London Shootfighters East is just a fly kick away from the bottomless wealth of Canary Wharf. I arrive on what I fear is a naive quest; to master some kickboxing skills in my home town before jetting off to convert them for real in Thailand.\nI'm half expecting to walk into some kind of a Rocky montage, Adonis-like men shadow-boxing and sullen meatheads pounding punchballs. Instead I'm greeted warmly by the jolly receptionist. He beams that my instructor is on his way.\nIt's an alien place on first inspection. A raised boxing ring flanked by swaying punchbags dominates the training space and there's a wall of mesh and netting for those keen to master cage fighting if that is their bent. A picture of Muhammed Ali, in all his pugilist pomp, looks down on us all from the wall. The place is buzzing – vaguely intimidating tattooed pros are sparring city boy types who could have come straight from a nearby trading floor. It seems to cater for all fitness levels, from the seasoned pro ... right down to the freelance travel writer.\n\nMy instructor is Alex Reid. Yes, that Alex Reid, who is back from reality television to focus on the day job of perfecting his – and now other people's – combat skills. He offers me a giant paw and I let him in on my mission. Alex grins and seems surprisngly upbeat about my chance of success.\nWe go over the basics – how Muay Thai differs from Western boxing. The Siamese style is described as the Art Of The Eight Limbs, since fighters are free to use four major points of contact; fists, elbows, knees and kicks. The sport can be traced back to medieval times, when the soldiers of Siam fought in hand-to-hand combat and limbs were used as weapons. Europeans introduced regular boxing gloves last century, and these have endured since.\nElbow room: David practises his skills (Michael Davis) Alex starts me off with some trouble-free routines on the soft ringside matting; the correct stance – more hunched over than a Western boxer, ready to sway back away from an incoming blow – the correct way to punch and block, work on grappling. He marks out the importance of locking eye contact with your opponent. \"The punch that knocks you out is the punch you're not expecting,\" he assures me, matter-of-factly. It's unsettling but I pick up some key skills and my confidence soon spikes.\nSoon there is a handful of us hopping over the ropes and into the ring to try out some basic sparring. It's all pretty safe and as a newbie I'm cosseted from any real harm. But I still feel vulnerable. I'm a lanky six-footer and I outreach a couple of my shorter opponents, keeping them at bay. I even try out a few (badly co-ordinated) kicks for good measure. I exert great energy punching and wrestling and my game soon slows.\nI step out of the fighting square relieved and bruised, but buoyed. I've sweated buckets but instinctively feel I could now hold my own overseas. Alex asks if I was scared or had fun. I answer positively to both. \"That's good, you're learning!\" he cackles, optimistically. He's right. I just hope this introduction is sufficient once I'm in the home of Muay Thai.\nPART TWO: Phuket, Thailand \nMy plan was to convert my maverick skills at a specialist gym in Phuket, the sun-drenched holiday island out in the Andaman Sea. Tourists have been coming here for decades in search of dreamy beaches and party vibes. But things are changing; more and more of Thailand's 25 million annual visitors are also coming here to keep fit – and kickbox.\nI join some of them at Tiger Muay Thai, which is tucked down a dusty side street, shaded by coconut palms a 15-minute scooter hop inland from the grimy bars of Phuket Town. It's vast, with six rings and an array of combat classes. The boxers seem to hail from all parts; chiselled chaps from Scandinavia, toned women from the Urals, gap-year travellers from the Home Counties.\nUnlike London, there's the climate to contend with – namely, the sweltering, stifling, stultifying heat. Average temperatures sit stubbornly in the high twenties in this rump of the tropics and the unforgiving humidity is a burden to my first morning training session.\nThere are two dozen mixed-ability enthusiasts in my cluster. We start slowly with yoga-like floor techniques, followed by 10 press-ups. Next, breathy barefoot laps of our matted training area. Then 10 press-ups. Correct ways to land blows on a punchbag. Then 10 press-ups. Rounded off with 10 more press-ups.\nThe Thai teachers snake between us farangs (foreigners) to advise. They have us jabbing like locals and coach us on how to block incoming elbows and knees. My helper Em barks orders as he holds punch pads aloft. \"LEFT UPPERCUT! RIGHT KICK!\" he yells, as I thwack soft leather with fists and feet. The session lasts an hour and by the end, I'm invigorated, my T-shirt dripping with perspiration.\nI need a break and slink off back to my hotel. Tiger has dorm facilities on site, but I have opted for a beach setting at Vijitt Resort out on the island's southern tip. I clamber on to the bathroom scales and see that I've lost 2kg in a morning's work.\nAnd so the train-drink-eat-repeat cycle goes on. On an exercise-free night off, I venture out to a nearby Muay Thai stadium to see how it's really done. It's a fascinating insight. There is none of the loopy machismo synonymous with Western boxing. Before each bout, fighters – mostly Thai, some farang – amble silently around the ring, heads bowed, solemn, saluting the audience. Opponents repeat this show of reverence once the fight is over.\nIt is agreed that my spar partner, Tup, will tone it down during the three informal rounds (Michael Davis) My guide and fellow Tiger fighter, Stan, tells me that the notion of trash-talking your opponent, Floyd Mayweather-style, simply doesn't wash. Muay Thai contests are about tradition, respect and artistry. Tickets are cheap (most less than £10) and the tourist-heavy crowd is vocal, if boozy.\nThere are seven fights on tonight's card. The general rule of thumb is; the boxer who lands the most kicks and knees on their opponent's body wins that particular round. Just like the mega-money bouts in Las Vegas, a kickboxer can also win by knockout. After the match, I decline going for a beer. I know that the merest hint of hangover could scupper my chances in the ring.\nBack at Tiger Muay Thai, it is agreed that my spar partner, Tup, will tone it down during the three informal rounds – a fight light. I size up my taut-framed opponent as he limbers up against the ropes and I think of the Woody Allen quote from Play It Again, Sam where he laments his recent whooping: \"I snapped my chin down on to some guy's fist and hit another one in the knee with my nose.\" Quite.\nSquaring up against Tup is a bit like trying vainly to swat a fly; a supremely athletic, lightning quick bluebottle. And one that swats back. My challenger is shorter than me so I bank on being able to keep him distant with my longer reach. But he's a real pocket rocket and is getting up close with near effortless ease. Quickly my arm's-length tactics are undone as my flimsy fight style is exposed.\nOur tête-à-tête becomes a blur of body hits and controlled aggression (him) and missed punches and flailing kicks (me). Tup follows me round the ring, casually grinning and landing blows at will. The last few moments feel a little like facing down E Honda's thunderous Hundred Hand Slap from Street Fighter II. And then, my humiliation is over. My body isn't bruised, but my pride is. I step out of the ring, head bowed and humbled.\n\nGetting there \nDavid Lewis was a guest of Trayvale Travel Muay Thai Holidays (020 7580 2928; trayvale.com ; muaythaiholidays.com ) and Tourism Thailand ( tourismthailand.co.uk ).\nMuay Thai Holidays cost from £800pp including Thai Airways flights from Heathrow to Phuket via Bangkok, a week in a one-bedroom apartment and training at Tiger Muay Thai Phuket.\nStaying there \nVijitt Resort Phuket ( vijittresort.com ).\nMore information \nmuaythaiholidays.com/gympartners", "external_links": [], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-17T15:52:46.000+03:00", "highlightTitle": ""}