{"organizations": ["Insite Guides Great Gardens of Britain"], "uuid": "6d8bca27a7d32ff3be9adfc2bac0b1aa87471e05", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeurope.about.com", "main_image": "", "site_section": "http://z.about.com/6/o/m/goeurope_t2.xml", "section_title": "About.com Europe Travel: What's Hot Now", "url": "http://goeurope.about.com/cs/ireland/l/bl_ireland_map.htm", "country": "US", "title": "Ireland Map - Map and Travel Information for...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Ireland Map - Map and Travel Information for...", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T14:10:00.000+03:00", "replies_count": 0, "uuid": "6d8bca27a7d32ff3be9adfc2bac0b1aa87471e05"}, "author": "", "url": "http://goeurope.about.com/cs/ireland/l/bl_ireland_map.htm", "ord_in_thread": 0, "title": "Ireland Map - Map and Travel Information for...", "locations": ["Ireland Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Insite Guides Great Gardens of Britain and Ireland Ireland In General \nThe island of Ireland is the second largest island in Europe. Ireland is divided into Northern Ireland , a part of the United Kingdom, and The Republic of Ireland , a separate country. Both are part of the European Union. The Republic of Ireland occupies about five sixths of the Island of Ireland. \nThis page deals mostly with information for the Republic of Ireland. Northern Ireland is covered in our UK Map and Travel Resources page . Ireland: Language: \nEnglish is the language generally used, Irish ( Gaeilge or Gaelic) is spoken, especially in areas located along the western seaboard. Gaelic arrived with the Celts. Getting around Ireland: Transportation Options \nIrish Rail , or Iarnród Éireann, has information for rail travel within Ireland, as well as information access to bus services and CIE tours , an Ireland and Britain tourism organization. (for Northern Ireland, you'll find similar transit information at Translink Online .) \nTrains go mainly between urban centers. Use busses to get to small villages. For great information on getting around Ireland on public transportation, see Around Ireland Without a Car . \nIf you're arriving from an international destination, you will probably arrive at Shannon International Airport on Ireland's west coast, 15 miles from Limerick City and Ennis, and 56 miles from Galway City, or Dublin Airport . Total Ireland has a list of all the airports in Ireland. \nBeing an island, Ireland is served by several ferry companies. Irish Ferries is one of the largest. Other ferry companies can get you and your freight or car to other places in Ireland, Great Britain or France as well. Ireland Weather: When to Go \nIreland has a temperate maritime climate that's modified by a North Atlantic Current. You'll enjoy mild winters, cool summers; consistently humid; overcast about half the time. Thus, the temperature won't change much, but the wetness will be unpredictable. The southwestern coast has the best weather, with the east being wetter and cooler. In general, winter has the worst weather, the best is May through August. For historic climate and current weather conditions for various locations in Ireland, see Ireland Travel Weather . \nFor commentary on Ireland's weather, see Visiting Ireland, The Irish Weather . Ireland: Currency \nThe Republic of Ireland uses the Euro. The value of the Euro was set to 0.787564 Irish pounds. Northern Ireland uses the British Pound. Tipping in Ireland \nTipping, as in the UK, is a rather spotty issue. In restaurants, a tip of 10-15% for good service is common, unless the menu mentions a service charge. Watch others and do what they do. Ireland Travel offers some Ireland Tipping Basics . Opening Hours in Ireland \nShops are usually open Monday to Saturday 9am-5:30pm. In rural areas these hours are approximate. Public Holidays in Ireland \nPublic holidays can be confusing in Ireland. Here's the definitive list: Public Holidays in Ireland . More information on Ireland \nIreland and the UK are covered more extensively in About's Ireland for Visitors . Other Maps on Europe for Visitors", "external_links": [], "published": "2015-07-10T14:10:00.000+03:00", "crawled": "2015-07-11T05:22:08.000+03:00", "highlightTitle": ""}