{"organizations": ["Kansas Department of Transportation", "Renner Boulevard"], "uuid": "ccd30c74df29c016093fb9e4461bc24679723f07", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.infozine.com", "main_image": "http://www.infozine.com/news/images/articles/15/07/2_62443_1437615487.jpg", "site_section": "http://rss.infozine.com/kc/travel.xml", "section_title": "infoZine Travel/ Headlines", "url": "http://www.infozine.com/news/stories/op/storiesView/sid/62443/", "country": "US", "title": "Full Interchange Closure at K-10 and Renner Boulevard", "performance_score": 0, "site": "infozine.com", "participants_count": 0, "title_full": "Full Interchange Closure at K-10 and Renner Boulevard", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T14:30:00.000+03:00", "replies_count": 0, "uuid": "ccd30c74df29c016093fb9e4461bc24679723f07"}, "author": "", "url": "http://www.infozine.com/news/stories/op/storiesView/sid/62443/", "ord_in_thread": 0, "title": "Full Interchange Closure at K-10 and Renner Boulevard", "locations": ["Renner Boulevard", "Lenexa", "KS"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Renner Boulevard"], "text": "Thursday, July 23,   Map shows full interchange closure at K-10 and Renner Boulevard, as well as detour routes Lenexa, KS - infoZine - The Kansas Department of Transportation is rebuilding the K-10 and Renner Boulevard interchange this year as part of the Johnson County Gateway Project. The following ramps and roadways will be closed to all traffic starting at 1 a.m. on Thursday, July 23, and lasting through Saturday, Sept. 5, 2015 (weather permitting) to complete reconstruction work: CLOSED: All lanes of Renner Boulevard north of the westbound K-10 ramps (extending an existing closure already in place on Renner Boulevard). CLOSED: Westbound K-10 to Renner Boulevard exit ramp. CLOSED: Renner Boulevard to westbound K-10 entrance ramp. Map showing full interchange closure at K-10 and Renner Boulevard, as well as detour routes. Map courtesy of Lenexa All lanes of Renner Boulevard at K-10, as well as the eastbound K-10 to Renner Boulevard exit ramp and the Renner Boulevard to eastbound K-10 entrance ramp- and off-ramps have been closed to all traffic since April 14. They will remain closed during the new closures listed above. The eastbound K-10 on- and off-ramps are scheduled to reopen in August, weather permitting. **SPECIAL NOTE: Eastbound and westbound K-10 over the Renner Boulevard bridges will remain open to all traffic during this time, though there will be varying daily lane closures on K-10 in this area. ** Advance message boards will alert traffic to the ramp and roadway closures. Marked detours will be provided. Traffic will be directed through the project work zone via signs and cones. Drivers should expect delays and must use alternate routes during these long-term ramp and roadway closures. Sign up for text alerts to stay informed about construction work construction work on I-435, I-35 and K-10. #JoCoGateway", "external_links": [], "published": "2015-07-23T14:30:00.000+03:00", "crawled": "2015-07-23T18:03:55.251+03:00", "highlightTitle": ""}