{"organizations": [], "uuid": "7f518d995ecbaac7ff6096910de98c403f0aa90a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03376/lourdes_3376649k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-15.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/women/mother-tongue/11741645/Septum-rings-the-craze-you-wont-want-your-daughter-to-follow-this-summer.html", "country": "US", "title": "Septum rings - the craze you won't want your daughter to follow this summer", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 6, "title_full": "Septum rings - the craze you won't want your daughter to follow this summer - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:30:00.000+03:00", "replies_count": 5, "uuid": "ba2fe5109e1071b32f09214efbc56daaba43b4cb"}, "author": "Alice Audley", "url": "http://www.telegraph.co.uk/women/mother-tongue/11741645/Septum-rings-the-craze-you-wont-want-your-daughter-to-follow-this-summer.html#post-0", "ord_in_thread": 0, "title": "Septum rings - the craze you won't want your daughter to follow this summer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Piercing your septum used to be something that only happened to punks and cows. But the look – let’s call it bovine chic... – has gone mainstream, with herds of young women keen to have bolts, rings and spikes put through the fleshy bit in their nasal passage. She's got a nose for trends! Madonna, 56, copies teenage daughter Lourdes, 18, as she debuts a new septum piercing pic.twitter.com/wwi9an8w3O — Noorani Tejani (@NooraniTejani) July 15, 2015 Parents who used to wonder what their offspring got up to during the summer holidays no longer have to worry about them coming home with a tattoo. This year, the damage will be more immediately obvious. In fact, there has been such demand for this nasal adornment that, according to a study published earlier this year by the Northwestern University, the septum is now one of the five most common body parts for piercing, both for men and women, in the UK. The current movement started, in usual fashion, with celebrities. Earlier this week, Madonna revealed a septum piercing on her Instagram page – a gold stone-set ring featuring the letter ‘M’. She was following in the footsteps of her 18-year-old daughter, Lourdes, who in May wore a nose ring to the Met Gala after part y . Singers Lady Gaga and FKA Twigs are also fans of the septum piercing, as is Ellie Goulding, whose has been pictured sporting a nose ring at the gym. Jessica Biel and Rihanna have worn them at red carpet events – though it’s unclear who opted for a faux, clip-on ring, and who went the whole hog (or should that be bull…?). Lady Gaga was seen sporting a septum piercing while out and about in Italy “We’ve definitely seen a rise in people asking for septum piercings over the last six months,” says Francieli Franke, a septum-piercing specialist at Angelic Hell in south-west London. “I’d say out one in 10 people who come through the door want one.” Franke, who has the piercing herself, agrees that celebrities have influenced the septum ring market, but also thinks that many people want it purely “because it’s such a beautiful piercing”. Indeed, she spoke so highly of septum rings and how good they look, that I decided to go under the needle myself. My procedure took place in a brightly lit subterranean studio, performed by a smoky-smelling fellow, inked to the eyeballs. First, my piercer fetched a big silver clamp and attached it to my septum. This took two attempts; the first time he clamped it too high, nipping my cartilage before it slipped off. With the clamp eventually attached, he then picked up a frighteningly big needle – the kind you’d need to rebutton a macintosh. As I was sat upright for the the procedure , rather than lying down, I could see the weapon very clearly. The sight of it made me feel decidedly faint. Alice said the procedure was \"by far the most painful piercing I've ever had\" He then inserted it, with a sickening crunch, through my nasal wall. My eyes streamed, my arms twitched and my stomach churned. I also broke out in a cold, panic-induced sweat . It was, by far, the most painful piercing I’ve ever had. Worse than the ears (school), the eyebrow (Thailand), the nostril (India), and even the tongue (Essex). Through the nausea, I then had a delicate little ring threaded through the puncture wound, which crunched again. It was at this point that my smoky companion decided it would be a good time to say: “I really don’t know why people have this done.” For the first few days after my ordeal, I hated the piercing. I couldn’t understand why so many people were getting it done. I found myself apologising for it at events and trying my best to conceal it (by twisting it up inside my sore nose). The reaction from family and friends didn’t help. “You look hideous,” wrote my mother underneath a picture I posted on Facebook. “Seriously minging,” added a friend underneath. Even a vague acquaintance thought it prudent to write: “Not a fan”. I decided to take it out. Your parents, family and friends may think it looks hideously bovine, but you think it looks fabulous But then I ran into a woman who also had one, and she told me how pretty it made me look, that it really suited me and that it would grow on me. And, by jove, she was right. I’ve started to really love it. The piercing really does grow on you. Indeed, this is why the septum trend continues to spread. Your parents, family and friends may think it looks hideously bovine, but you think it looks fabulous – and won’t be told otherwise. On the plus side for parents getting worried about their rebellious teens spearing their septums, however, if they're being temperamental this summer, now you have the perfect remedy: all you need to do is give the ring a tug. It works for cows. Follow @telewonderwomen", "external_links": [], "published": "2015-07-16T03:30:00.000+03:00", "crawled": "2015-07-16T02:55:53.000+03:00", "highlightTitle": ""}