{"organizations": [], "uuid": "864081831017d3b6f8f6bda7b603ab899c92f095", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03392/Tweet-button-keypa_3392883k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-30.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/tech-myths/11774049/debunking-start-up-cost-myths.html", "country": "US", "title": "Debunking start-up cost myths", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Debunking start-up cost myths - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T01:23:00.000+03:00", "replies_count": 0, "uuid": "864081831017d3b6f8f6bda7b603ab899c92f095"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/tech-myths/11774049/debunking-start-up-cost-myths.html", "ord_in_thread": 0, "title": "Debunking start-up cost myths", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more business news and opinion » With confidence growing in the state of the economy, there has never been a better time to try to get your new business off the ground, but prioritising expenditure and getting the best value for money is going to be key to your success. The following guide debunks five myths about start-up costs... We’ll need an office in the city The wonder of modern technology is that you don’t. Not only do you not need to be in the city centre, you may not need an office at all. Virtual meetings, cloud technology and mobile devices mean that you can run your business from almost anywhere. If you do need to impress, consider using a virtual office. \"Keeping the initial set-up costs down while starting a new business can prove difficult, so choosing a virtual office can really help. With a prestigious business address and a range of services including mail forwarding and call answering, start-ups can get off the ground without the overheads of a traditional office,” says Charlie Beck, head of sales at flexible office provider Bruntwood. We need to have an exit plan There’s something fundamentally flawed in founding a company simply to sell it. You risk demotivating your staff and stifling investment decisions. If your idea is good enough and you’ve studied the market potential, you will, by definition, make money. It would be far better to follow the example set by start-ups such as Imgur, the US-based image-hosting site, which was profitable from the start. If these bootstrapped start-ups concentrate on building value and connecting with potential customers, they will ultimately attract investors wishing to nurture a desirable and profitable business. We’ll need a big pot of seed money from Venture Capital Jim Belosic, co-founder and CEO of US brand development company ShortStack, likens the way entrepreneurs compete for venture capital to the way that carrion birds compete for roadkill. But he believes staying hungry keeps you sharp. He says if you’re not worried about investors looking over your shoulder, you will spend your days far more productively. “Taking venture capital can shift your focus away from your initial idea, dull your drive and encourage you to increase your staff more rapidly than is necessary,” he says. Making money relies on secrecy Entrepreneurs often assume that the idea for their start-up has to be kept in stealth mode for it to have any chance of success, but very often the absolute opposite is the case. Unless there is a genuine risk of somebody infringing your intellectual property rights, being open with your ideas will help you in many different ways. By talking about it, you’ll get a good idea of people’s reaction, you’ll learn about competitive products and you’ll be able to create a buzz around it. You might even find ways to improve on your concept. We need to be constantly in the media to be a success You could waste a lot of money trying to attract the attention of the wrong media. Focusing on social media instead will mean you can tailor your efforts in a much more targeted way. If ever a business was testament to the power of such a strategy, it must be sportswear retailer Zaggora. Within 18 months of its launch, it had grown sales to one million products, with a customer base of 600,000, using Twitter and Facebook as the principal ways of reaching its target market. The company says its social media following is so strong because it was built on genuine conversations with fans. • For more advice on preparing your business for the tech challenges of the future, visit HP BusinessNow You may also be interested in: • Top five security issues that every SME should know about • Five tips for growing your company • How to prepare staff for big news • Making flexible working work • Building the right team for your SME", "external_links": [], "published": "2015-07-31T01:23:00.000+03:00", "crawled": "2015-07-30T22:48:42.597+03:00", "highlightTitle": ""}