{"organizations": [], "uuid": "d22d3b3952b05c7c3f53cdd3ca177b9e8e560285", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/cd/resizer/2.0/FIT_TO_WIDTH-w540/3938156d8b03d6aa07a87638cfb4d0f77696eec5.png", "site_section": "https://www.yahoo.com/travel/rss", "section_title": "Yahoo Travel", "url": "https://www.yahoo.com/travel/snowmageddon-2015-cabin-fever-hits-hard-in-123462240287.html?src=rss", "country": "US", "title": "Snowmageddon 2015: Cabin Fever Hits Hard in Greenland", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Snowmageddon 2015: Cabin Fever Hits Hard in Greenland", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T17:33:00.000+03:00", "replies_count": 0, "uuid": "d22d3b3952b05c7c3f53cdd3ca177b9e8e560285"}, "author": "", "url": "https://www.yahoo.com/travel/snowmageddon-2015-cabin-fever-hits-hard-in-123462240287.html?src=rss", "ord_in_thread": 0, "title": "Snowmageddon 2015: Cabin Fever Hits Hard in Greenland", "locations": ["Greenland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Travel. \n  Snowmageddon 2015: Cabin Fever Hits Hard in Greenland Paula Froelich Editor in Chief July 7, 2015 \nAs anyone living on the East Coast can tell you: This past winter was rough. I thought I’d seen it all — snow for days, snowdrifts several feet high, icy sidewalks — you name it. But apparently, in the Arctic Circle, what we call Snowmageddon is just another Tuesday in April. Or May. Or, you know, whenever. And when you’re in the Arctic Circle, all plans are speculative. \nI went to Greenland in April, with dreams of dog mushing, ice fishing, Northern Lights viewing, and hanging with polar bears and Inuit, possibly in an igloo. I was supposed to fly into the capital city of Nuuk (population 17,000) for a few days before heading north to Illulisat and my adventures. Little did I know a blizzard was on the way. And by blizzard, I mean a snow dump that lasted three and a half days — as in, it didn’t stop snowing for one hot second for three and half days. All flights were canceled and my A Broad Abroad crew and I were stranded — granted, we were stranded at the lovely Hans Egede Hotel, but when the power goes out intermittently for three and a half days, all hallways, no matter how nice, get real creepy, real fast. \nNow, I don’t know if you know this, but there’s not much to do in a town of 17,000 people — especially when you can’t walk anywhere due to low visibility and spotty electricity. But, just in case you are ever in the same situation, I have made a handy-dandy list of things to do when snowed in — and, even better, I captured all the randomness on video. So, watch the video and read the list. \n1. Make new friends. Or try to… \nJust so you know, there are three — count ’em, three — guys on Tinder in Nuuk. And not one of them wanted to hang with me … possibly because in my not-so-subtle message I asked for an interview instead of a date, typing, “Hey! Just in town for a hot second with a film crew — want to be on camera and talk about how to date in Greenland???” \nRelated: How to Dress for the Arctic in 13 Easy Steps \n2. Ask for suggestions of what to do on Twitter and Facebook \nWhich leads to things like making snow angels (and getting snow down your pants), building snow caves (and getting snow down your pants), snowball fights with strangers (fun fact: Locals in Greenland are much, much better at snowball fighting than anyone from 49 out of 50 United States — funny, that), and karaoke/sing-alongs with the guy playing piano at the hotel bar. A lot of karaoke and sing-alongs. \n3. Have a drink. Or five. \nSpeaking of hotel bars, when the sun is blocked out for days on end and every hour bleeds into the next, there’s not much else to do but drink. Thankfully, Greenland has a lively craft brewery scene, and the beer is not only delicious but locally made (unlike everything else in the country, which is imported), so it isn’t insanely expensive. \n4. Just give in to cabin fever — start talking to yourself and filming homages to The Shining \nAll work and no play makes Paula a dull girl. \nEventually, the snow stopped, the sun came out, and I ventured into what looked like the ice planet Hoth ( that’s a Star Wars reference, in case anyone under the age of 30 was wondering). There were snowbanks 14 feet high. And while it was beautiful, there was a hidden danger. \n“It’s all good,” Niels, my bartender from the Hans Egede Hotel, said as we watched some locals take a shortcut home over a particularly high snowbank that dwarfed a local house. “Except when you fall in and can’t crawl out. A few people have died that way. Best to just take the long way on the roads.” \nNoted.", "external_links": [], "published": "2015-07-07T17:33:00.000+03:00", "crawled": "2015-07-07T17:58:15.000+03:00", "highlightTitle": ""}