{"organizations": [], "uuid": "36771a5ab15a660cff54fe1e66c6a0b099bca0fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/Etihad-Airways.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-launches-community-outreach-activities-kenya/", "country": "US", "title": "Etihad Airways Launches community outreach activities in KenyaTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Etihad Airways Launches community outreach activities in KenyaTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "36771a5ab15a660cff54fe1e66c6a0b099bca0fd"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-launches-community-outreach-activities-kenya/", "ord_in_thread": 0, "title": "Etihad Airways Launches community outreach activities in KenyaTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Etihad Airways initiates community outreach activities in Kenya Published on : Saturday, July 11, 2015\nEtihad Airways, the national airline of the United Arab Emirates, in collaboration with the National Bank of Abu Dhabi (NBAD), today launched two community outreach activities in Kenya with donations of blankets and school supplies to the Dream Children’s Home, and the Children in Freedom organisation.\nLocated between Ngong and Matasia just outside Nairobi, the Dream Children’s Home was established by Rachel Gichia in 2004 to restore hope and support the basic needs of orphans and vulnerable children in Kenya.\nBlankets were collected through the Blankets 4 Africa initiative, which collects donations of used airline cabin blankets, toiletry bags and bedding, and works together with The Order of Malta in Kenya, to distribute these to charities in Africa.\nMrs Gichia welcomed the donation from Etihad Airways, saying: “This donation represents the kindness and generosity of Etihad Airways, the National Bank of Abu Dhabi, the Blankets 4 Africa Initiative and The Order of Malta in Kenya. Their contribution will help in alleviating the suffering of the poor and the vulnerable in Africa.\n“The Dream Children’s Home currently looks after nearly 100 children and this generosity is highly appreciated by all.”\nLinden Coppell, Etihad Airways Head of Sustainability, said: “As an airline we are committed to making a difference to the communities in which we operate. The Dream Children’s Home and Children in Freedom organisation stand out as beacons of hope for underprivileged children in Kenya and we are pleased to be able to support these two important causes.”\nOver 700 blankets were handed over to the orphanage during a visit to the Dream Children’s Home attended by Hassan Issa Al Hosani, Minister Plenipotentiary at the UAE Embassy in Kenya, Joan Mwaniki, Etihad Airways’ General Manager, Kenya, Luzelle Boado Etihad Airways’ Sustainability Officer and Priscilla Chomba, Etihad Airways’ Marketing Coordinator in Kenya.\nNine members of Etihad Airways’ iVolunteer initiative flew to Kenya to provide their time and skills to support the activities which included the task of painting part of the orphanage’s interior with paint donated by the British High Commission in Kenya.\nThe Children in Freedom organisation provides free education, mentorship and support to over 40 young children in several schools in and around Nairobi that will now benefit from the donation of school supplies including literature books and writing materials.\nSource:- Etihad Airways\nRelated Posts Etihad Airways to boost frequency and capacity of flight to Athens and Larnaca Etihad Airways Posts Fourth Consecutive Year of Net Profit, Up 52 Per Cent To US$ 73 Million BOC Aviation Marks 20th Year With Record Net Profit in 2013 Etihad Airways celebrates arrival of inaugural Alitalia flights from Venice And Milan Antalya Gazipasa Airport opens new terminal building", "external_links": [], "published": "2015-07-11T03:00:00.000+03:00", "crawled": "2015-07-11T08:57:25.000+03:00", "highlightTitle": ""}