{"organizations": [], "uuid": "75e90bb83a7af9723bda7db3de79e134e9c495ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/05/14/102680198-480985941.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000739/device/rss/rss.html", "section_title": "Travel", "url": "http://www.cnbc.com/id/102802652", "country": "US", "title": "Online travel industry is booming: Report", "performance_score": 0, "site": "cnbc.com", "participants_count": 1, "title_full": "Online travel industry is booming: Report", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "75e90bb83a7af9723bda7db3de79e134e9c495ae"}, "author": "Reem Nasr", "url": "http://www.cnbc.com/id/102802652", "ord_in_thread": 0, "title": "Online travel industry is booming: Report", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Online travel hits $35B\nGian Fulgoni, comScore Inc. executive chairman, co-founder & YPO member discusses the online travel space and how digital commerce performed in Q1.\nAccording to AAA, about 42 million people are expected to travel this holiday weekend. Many of those travel plans will be made through online travel agencies (OTAs).\nA report by ComScore, a U.S. Internet analytics company, released exclusively to CNBC on Wednesday, details online travel industry performance in the first quarter of 2015. Co-founder Gian Fulgoni said that the data proves \"it is exciting times in the travel industry.\"\nRead More It's time to crack down on Airbnb\n\"It's an example of the Internet providing consumers with terrific services,\" he said in an interview on Wednesday with CNBC's \" Squawk on the Street .\" \"It's very easy for them to use the online travel agencies to compare prices, feature and services and then pick the one that suits them best.\"\nHowever, he said, more people end up booking on brand sites, rather than OTAs. This could be due to loyalty plans that some airlines and hotels have, Fulgoni said. Changing a flight could also be easier if done though the airline itself rather than through an OTA.\nAmong the major findings:\nThe report found that about 180 million people visited online travel sites in a month. That is a 27 percent increase from the year-earlier period.\nThe industry as a whole has improved since the previous year. Total bookings of air, hotel and rental cars in the first quarter was $35.1 billion, about 11 percent higher from the same period last year. Online travel agencies are very popular led by Expedia , Priceline , Orbitz and Kayak. In April, 36 million U.S. visitors checked Expedia, the higher than the largest number visiting any individual airline site ( Southwest at 16 million) or hotel site ( Hilton with 10 million).\nThe demographics for ride-sharing services such as Uber and Lyft include both males and females but there is a clear skew towards men under 55 years of age. This could mean that women still feel uneasy about safety within the sharing economy. Roberto Westbrook | Getty Images Read More World's first 'airport resort' comes to Cebu: Report\n\"The Internet has put pricing power in the hands of the consumer,\" he said. \"And that's another reason why I think the branded travel sites want to see that booking occurring on their own sites because then they don't have to pay the commission to the OTAs.\"\nAirlines have been doing more to hold on to that booking revenue than hotels, he added.", "external_links": [], "published": "2015-07-02T03:00:00.000+03:00", "crawled": "2015-07-02T00:05:37.000+03:00", "highlightTitle": ""}