{"organizations": [], "uuid": "3854ac58d1783ae545e9383ef09d09d51511bad1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bootsnall.com", "main_image": "http://www.bootsnall.com/articles/wp-content/uploads/thumbs/37827-thumb-37827-621x379.jpg", "site_section": "http://www.bootsnall.com/articles/feed", "section_title": "BootsnAll Travel Articles", "url": "http://www.bootsnall.com/articles/11-02/8-ways-to-stay-healthy-while-traveling.html", "country": "US", "title": "8 Ways to Stay Healthy While Traveling", "performance_score": 0, "site": "bootsnall.com", "participants_count": 1, "title_full": "8 Ways to Stay Healthy While Traveling", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T11:03:00.000+03:00", "replies_count": 0, "uuid": "3854ac58d1783ae545e9383ef09d09d51511bad1"}, "author": "admin", "url": "http://www.bootsnall.com/articles/11-02/8-ways-to-stay-healthy-while-traveling.html", "ord_in_thread": 0, "title": "8 Ways to Stay Healthy While Traveling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "8 Ways to Stay Healthy While Traveling By Christine Garvin on July 9th, 2015 Whether embarking on a week-long getaway to Hawaii, or trekking for months in India, people often get sick while traveling. This happens for a variety of reasons, from changes in sleep patterns to changes in bacteria patterns. If you travel often, you are bound to fall prey to phlegm-inducing colds or get some not-so-friendly bugs swimming around in your stomach at some point, but there are steps you can take to keep those suckers at bay.\nKeeping your immune system – which has to work twice as hard as you change times zones – in good working order will not only make your trip better, but may keep you from spending too many hours laying in a hotel bed or stuck in the shared hostel bathroom. Here are eight ways to stay healthy on the road: Add electrolytes Dehydration is common while traveling, whether from a long plane flight, a new climate, or being scared of the local water and imbibing too many Cokes to make up for it. You can also become easily dehydrated after eating local food that leaves the contents of your stomach in the toilet.\nBring along plenty of electrolyte packets or tablets, which you can easily stuff into a backpack or suitcase, to add to your water and help keep your system fully functioning minus headaches, nausea, and energy depletion. EmergenC is sold in most US stores nowadays, but there are also other good choices at health food stores around the world. Try homeopathic remedies Whether or not you believe in homeopathy, I recommend trying a jet lag remedy at least once. Homeopathy works to trigger your body’s immune response to fight what ails you. This can include doing a number on your internal clock. No Jet Lag was a godsend to me for my flight between Sydney and San Francisco, followed by another flight six hours later between San Francisco and London . I felt great when I woke up in my London hostel the next morning, after putting in some serious flight time the two days prior. Pay attention to food allergies It’s easy to get caught up eating new food concoctions when arriving in a foreign land – who doesn’t want to try street food in Bangkok or an Ethiopian platter in the actual country? But allergies to foods have become commonplace for most Westerners, partly due to a fast-food-based diet that wreaks havoc on digestion, and partly because of foods that are genetically engineered and filled with additives. Even if you don’t have an immediate external reaction to a food doesn’t mean there’s not an internal reaction happening. Some people don’t necessarily notice that creamy soups will bother them right away, but a few hours later, their intestines are in shambles.\nThe more you eat a variety of foods your body is not used to, combined with eating foods that your body already doesn’t like, you set yourself up for some serious stomach issues for at least the latter half of your trip. And probably for a week once you return home. Not worth it. Limit alcohol intake Drinking alcohol in some form or another is a ritual in almost every country. It’s not just ordering a stein of Hefeweizen in Germany; it’s sipping absinthe in Prague , downing a caipirinha in Brazil , or trying a local South African brew. It’s hard to find your way out of it, and most of us don’t necessarily want to. “Set a two drink maximum per night, with some days of no drinking.” But there is a difference between having one or two drinks every couple of nights vs. downing a minimum of nine pints an evening and closing down the pub. Your body will have it in for you after a few days, even if you are 18 and burn through beer like quarters in a slot machine. Set a two drink maximum per night, with some days of no drinking.\nThe point of traveling is to see all parts of a place and its culture, and if you’re hungover everyday, you’re going to miss out on gorgeous hikes, biking in the country, or the ability to notice massive historical inaccuracies on guided tours. And you’re certainly not gonna enjoy the afternoon Tuscan wine tasting after pounding bottles of Chianti the night before. Eat Less Going on vacation, or any kind of a getaway, often leads to excesses of all kinds, including some serious over-consuming of food. It’s hard not to partake in all the available cuisine under the guise, “Well, I’m only here once. Gotta try it all” (I’ve certainly uttered this sentiment more than once). But the time it is most important to not eat too much is when you are on the road. Over-eating hurts the digestive system, which can magically appear in many ways, including indigestion, nausea, and the ever-popular bouts of diarrhea. “Eating too much also overworks your pancreas, which in turn can hurt your immunity.” Plus, it makes you sluggish and less apt to get through everything you want to do while on your getaway to Greece or South American tour. Eating too much also overworks your pancreas, which in turn can hurt your immunity. Take small bites of everything if you want to try a plethora of options, then go walk it off on the streets of London that like to change without any notice. Take naps whenever you can Sleep is the single most important part of staying healthy, and it’s usually the first thing to go when we are having a good time. Travel takes up more mind and body energy than the daily routine of working in an office and coming home to eat dinner, so sleep is even more necessary to replenish the system. You’re going to have a lot of late nights on the road, I guarantee it, so it is best to try and schedule some kind of down time everyday.\nAround 3 or 4 o’clock corresponds nicely with your body’s natural rhythms and calls for less energy output (why do you think so many European countries take siestas?). If you can get enough sleep, you will undoubtedly have a leg up on protecting yourself from the many germs flying around on buses, trains, planes, and hostel rooms. Take advantage of health enhancers Health care in countries outside of the US is usually cheap and reliable, even in many developing countries. Beyond this, though, is the availability of what I like to call “health enhancers” in certain parts of the world, such as acupuncture in Asia, massage in Thailand or Africa, and hot springs throughout the world. These “health enhancers” should be used before you get sick to keep you from falling ill. Besides the fact that they increase your immune system’s ability to fight off crazy bacteria, they also generally feel really, really good.\nAcupuncture and acupressure calm the mind and body from the stress of constantly shuttling here and there, and massage works out those tired muscles from lugging around a backpack for weeks on end. Lounging in natural hot springs is worth the hike in that many require, and bringing a picnic and some blankets to relax on can make a day of it. Don’t forget the many soaking tubs available throughout Japan, or even the hot tub next to the pool in almost any hotel. Meditate Although in some ways meditation has become a buzz word that seems to be prescribed for just about everything, it really does positively impact your health. A recent study found that practicing mindfulness meditation for eight weeks changed the brain structure, improving memory, sense of self, empathy, and stress. “Calming the mind, even if it’s ten minutes a day first thing in the morning, can have a long-lasting positive impact on your health.” With travel, stress just comes with the territory, even if it feels like the good stress that gets the adrenaline pumping. Too much adrenaline coursing through your veins means fluctuations in blood sugar, leading to fatigue, irritability, and ravenousness. Calming the mind, even if it’s ten minutes a day first thing in the morning, can have a long-lasting positive impact on your health. Plus, you might feel a little less irritated waiting for that next train out of Paris because you just missed the last one. Ready to get serious about taking a RTW trip?", "external_links": [], "published": "2015-07-09T11:03:00.000+03:00", "crawled": "2015-07-09T16:19:07.000+03:00", "highlightTitle": ""}