{"organizations": [], "uuid": "8697a3126f4c3caf6bebb9831ec93ed2ac7a0218", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gogirlguides.com", "main_image": "http://gogirlguides.com/wp-content/uploads/2014/06/2914224434_b6c284a7f3.jpg", "site_section": "http://feeds.feedburner.com/GoGirlGuides", "section_title": "Go! Girl Guides - Helping Women Travel The World", "url": "http://gogirlguides.com/safe-travel/how-dangerous-is-venezuela-a-2014-perspective/", "country": "US", "title": "How Dangerous is Venezuela? A 2014 Perspective.", "performance_score": 0, "site": "gogirlguides.com", "participants_count": 1, "title_full": "How Dangerous is Venezuela? A 2014 Perspective.", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T11:18:00.000+03:00", "replies_count": 0, "uuid": "8697a3126f4c3caf6bebb9831ec93ed2ac7a0218"}, "author": "Jenna", "url": "http://gogirlguides.com/safe-travel/how-dangerous-is-venezuela-a-2014-perspective/", "ord_in_thread": 0, "title": "How Dangerous is Venezuela? A 2014 Perspective.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How Dangerous is Venezuela? A 2014 Perspective. by Jenna on July 29, 2015 \nWith a report by Channel 4 news, stating that Venezuela is now considered the most dangerous country in the world as well as a flood of internet stories reporting tourists who have been mixed up in fatal crimes, its hard to justify a trip down to this turbulent, yet beautiful country. \nSo how dangerous is Venezuela really? Well I have a few friends traveling there at the moment, but they are not American, (which some say is a nationality that makes a person more lucrative to robbers, criminals etc). With that said, Venezuela’s crime does not discriminate and there has also been numerous reports of tourists from all nationalities who have ended up at the brunt of both petty and violent crime. \nIf you go on the Internet you may very well be scared out of a trip to Venezuela, and although in my personal opinion, I feel as thought that’s exactly what the news is trying to do (for political reasons I wont go into), I also think that there is room for concern. \nBelow, I have outlined a few places to avoid and things to consider before traveling to Venezuela \nCaracas, Venezuela is considered, by far one of the most dangerous cities to visit. If you don’t bring a reliable guide you could end up on the wrong side of town, or worse, playing monkey-in-the-middle in the midst of some riot. Mugging, pickpockets, and reports of serious crimes have been reported here, so it’s best to avoid this city all together. If you fly into the airport, that’s fine, just make sure to research a safe place to stay beforehand, or make your way out of the city immediately upon landing. \nYellow Fever is common in Venezuela, except in the northern coastal areas such as Margarita Island, and more populated cities such as Caracas and Valencia. Still, it’s best not to skip this vaccination especially if you are planning to travel to neighboring South American countries, where proof of vaccination is mandatory. A good bug repellant is also recommended containing DEET. If you are planning a trip to Venezuela, consult your local travel clinic and schedule your vaccine. Also make sure you receive your shot at least two weeks prior to departure, as it takes awhile to build up immunity. \nLike with any robbery or mugging, if you are accosted, don’t rebel. Give the robber what he/or she wants, knowing that your life is way more important then your expensive camera or knapsack that was hand-knit by your grandma. Having been robbed before, I understand how much it, “really sucks” but after all is said and done, it wont be the end of the world. In Venezuela, the most common petty crimes against tourists include taking valuables such as watches, phones, and cameras. There have also been reports of thieves who just go for your entire backpack. It’s best in Venezuela to be extremely mindful of your personal belongings and stashing a secret cash reserve behind in your room. \nAccording to the U.S department of State, “thousands of U.S citizens travel to Venezuela safely each year.” It’s a gorgeous country, with pristine beaches, peachy islands, and a mesmerizing interior landscape as well. In my confident advice, if you were to ask me, “Should I stay or should I go?”, I would say: GO!, just do your research beforehand, invest in a good guidebook, and talk to people who have been there before. The touristy areas are safest, so check in with sites such as Tripadvisor to see where people are traveling. Always listen to your gut but have fun, and try to focus on why Venezuela is considered one of the most beautiful countries in South America. \nHave you, or are you planning on traveling to Venezuela? Article by Jenna \nSince a young age Jenna has always had an undeviating desire to explore the world and all its hidden niches. This desire has catapulted her willingly into some of the most memorable experiences of her life! Starting with delivering shoes to underserved villages in the Dominican Republic to bussing it down through Mexico and Central America, she currently lives and works in Cochabamba, Bolivia and believes experiencing first hand what foreign culture is really like, serves as her ultimate passion.", "external_links": [], "published": "2015-07-29T11:18:00.000+03:00", "crawled": "2015-07-29T18:21:46.904+03:00", "highlightTitle": ""}