{"organizations": [], "uuid": "7a285d2f53ef356b2027f44c83615cab1511203b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsday.com", "main_image": "http://cdn.newsday.com/polopoly_fs/1.10629083.1436542779!/httpImage/image.JPG_gen/derivatives/display_600/image.JPG", "site_section": "http://www.newsday.com/travel", "section_title": "Travel - Newsday - News, Destinations, Travel Ideas, &amp; NYC Sightseeing | Newsday", "url": "http://www.newsday.com/travel/long-island-getaways/hamptons/you-know-you-re-from-the-hamptons-when-1.10549279", "country": "US", "title": "You know you're from the Hamptons when... |", "performance_score": 0, "site": "newsday.com", "participants_count": 4, "title_full": "You know you're from the Hamptons when... | Newsday", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T14:43:00.000+03:00", "replies_count": 3, "uuid": "b0f7ab3693448334bb402fb27da37086fd349c26"}, "author": "NEWSDAY.COM STAFF", "url": "http://www.newsday.com/travel/long-island-getaways/hamptons/you-know-you-re-from-the-hamptons-when-1.10549279#post-0", "ord_in_thread": 0, "title": "You know you're from the Hamptons when... |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Credit: Aaron Zebrook) ... you get to the Surf Lodge early, or not at all. Even longing-for-yesteryear locals can't deny the Surf Lodge's appeal: Great food, great views, great music. But the nightlife hotspot gets crowded, so locals know they can make the best of it by beating the summer partygoers to the punch and then retreating for a more low-key late-night locale.\nYou know you're from the Hamptons when... Updated July 31, 2015 6:43 AM\nBy NEWSDAY.COM STAFF\n... you get to the Surf Lodge early, or not at all. Even longing-for-yesteryear locals can't deny the Surf Lodge's appeal: Great food, great views, great music. But the nightlife hotspot gets crowded, so locals know they can make the best of it by beating the summer partygoers to the punch and then retreating for a more low-key late-night locale. (Credit: Aaron Zebrook)\nWe all know Long Island is divided into two counties -- Nassau and Suffolk -- but when you live in the Hamptons, it can feel like you're in another place completely (\"Bonackers\" even have their own accent, after all). Navigating the summer crowds, finding a deal and appreciating the true beauty of all the South Fork has to offer are just a few examples of how you know you're really from the Hamptons....\nOptimum Online customers get unlimited digital access\nLog in There's more to the story! Subscribe now.\nGet unlimited digital access $14.99 A MONTH Join Now Advertisement\nAdvertise here We all know Long Island is divided into two counties -- Nassau and Suffolk -- but when you live in the Hamptons, it can feel like you're in another place completely (\"Bonackers\" even have their own accent, after all). Navigating the summer crowds, finding a deal and appreciating the true beauty of all the South Fork has to offer are just a few examples of how you know you're really from the Hamptons. Send more suggestions to litowns@newsday.com.\n(Credit: David Reich-Hale; Joseph D. Sullivan) ...your summer sporting event of choice is a Hamptons Collegiate League game. While out-of-towners may show up for the star-studded Artists and Writers charity softball game, a Hamptons local knows there's fun to be had at the regular collegiate league games, like this one (left) between the Southampton Breakers and Sag Harbor Whalers at Stony Brook-Southampton on Friday, July 10, 2015. Pictured at right, Alec Baldwin participates in the charity game on Aug. 4, 2010.\n(Credit: David Reich-Hale) ...you chuckle at the idea of overcrowded beaches because this is your morning walk. Pictured: The shore at Shinnecock Bay in Southampton on Saturday, July 11, 2015.\n(Credit: Newsday / J. Conrad Williams Jr.) ...you know how to beat the summer traffic. Whether you avoid driving at certain times or follow your preferred maze of winding back roads, locals need to know how to skirt the congestion. This traffic was building up on Montauk Highway in May 2007.\nADVERTISEMENT\nADVERTISE HERE (Credit: Erin Geismar) ... you recognize Tate's Bake Shop's signature thin cookies from your local markets. Now, you can find Tate's all over the place -- they are distributed in more than 40 states -- but locals remember when they felt like a secret gem.\n(Credit: Ian J. Stark) ... you're constantly asked what it's like \"out there\" in the off-season. Well, the crowds leave, the traffic subsides, there's the Hamptons International Film Festival, holiday celebrations, empty beaches, restaurants don't require reservations ... it's still pretty good. Pictured is Rowdy Hall, in East Hampton, decorated for Halloween on Oct. 20, 2014.\n(Credit: Flickr / scotchbroom) ... you've eaten clams you caught yourself earlier that day. Locals know where to find them, how to cook them, and of course, how to shuck them. Pictured, a sign outside Shagwong Restaurant in Montauk advertises for very specific skills.\n(Credit: Twitter) ... if you're stuck in traffic, you know it's just as likely as anything else that there's a piece of farm equipment riding slowly somewhere ahead of you. Locals never forget that the South Fork of Long Island was farmland before it was a playground for the rich and famous.\n(Credit: Erin Geismar) ... your last name is a street name, or you know someone whose last name is a street name. The Town of Southampton was settled in 1640 and East Hampton was settled shortly after that. A number of original and early families still live in the area.\nADVERTISEMENT\nADVERTISE HERE (Credit: David Reich-Hale) ... some of your favorite radio stations are broadcasting from Connecticut or Rhode Island. The Hamptons does maintain a New England-like nautical feel and its radio frequencies seem to agree. You're just as likely to find a clear station from our northern neighbors than you are from farther west.\nBuy photo (Credit: Aaron Zebrook) ... you get to the Surf Lodge early, or not at all. Even longing-for-yesteryear locals can't deny the Surf Lodge's appeal: Great food, great views, great music. But the nightlife hotspot gets crowded, so locals know they can make the best of it by beating the summer partygoers to the punch and then retreating for a more low-key late-night locale.\n(Credit: Erin Geismar) ... The Golden Pear Cafe is the green-awning coffee shop you see everywhere you go. The cafe chain exclusive to the Hamptons first opened its doors in 1987 and now has four locations in four different hamlets.\n(Credit: Twitter) ... Tuesday is your favorite day of the week because all the weekenders vacate the area. \"Tumbleweed Tuesday,\" the day after Labor Day, is a holiday in its own right.\n(Credit: Google) ... walking 4 to 5 miles doesn't seem that bad compared to how much a cab might have cost you.\nADVERTISEMENT\nADVERTISE HERE (Credit: Erin Geismar) ... you remember a bar or restaurant by the name it had last summer, or the summer before that ... or the summer before that. Hamptons locals are used the varying roster of businesses that pop up from year to year. It's easiest to just remember your old favorite and refer to everything else as \"that place that used to be ...\" Pictured is Phillipe, the club and restaurant at 44 Three Mile Harbor in East Hampton that has changed hands at least three times in the last five years.\nSign up for Newsday's Travel newsletter to plan small day trips, big getaways and more.\n Click here to read or post comments Comments Newsday.com now uses Facebook for our comment boards. Please read our guidelines and connect your Facebook account to comment.\nLike it? Share it!", "external_links": ["http://nwsdy.li/1MITsw3", "https://twitter.com/intent/tweet?url=/1.10549279&text=You", "http://www.facebook.com/sharer/sharer.php?u=/1.10549279", "http://myli.mycapture.com/mycapture/remoteimage.asp?image=http://cdn.newsday.com/polopoly_fs/1.10629083.1438339431!/httpImage/image.JPG_gen/derivatives/display_960/image.JPG"], "published": "2015-07-31T14:43:00.000+03:00", "crawled": "2015-07-31T22:47:26.922+03:00", "highlightTitle": ""}