{"organizations": [], "uuid": "cd976e6ae9d6391d74dd938687fd841d26430c5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297719591176_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.torontosun.com/2015/07/02/calgary-stampede-2015-the-shows-the-food-and-everything-you-need-to-know", "country": "CA", "title": "Calgary Stampede 2015: The shows, the food and everything you need to know", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Calgary Stampede 2015: The shows, the food and everything you need to know", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T22:52:00.000+03:00", "replies_count": 0, "uuid": "cd976e6ae9d6391d74dd938687fd841d26430c5b"}, "author": "", "url": "http://www.torontosun.com/2015/07/02/calgary-stampede-2015-the-shows-the-food-and-everything-you-need-to-know", "ord_in_thread": 0, "title": "Calgary Stampede 2015: The shows, the food and everything you need to know", "locations": ["Earth"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For the next 10 days, Calgarians will be tipping their hats and tapping their boots as the city hosts the Greatest Outdoor Show on Earth, more than 100 years running. \n“I’m hugely excited,” said Bill Gray, Stampede president and CEO. \n“I think notwithstanding the economy, and I recognize this is a hard time for some people, but our ticket sales have been very well so far and we’re still on track with last year, which was our second-best year ever. \n“And we just sold out our advance ticket sale for our Stampede lottery, which is a terrific accomplishment by that committee.” \nNot to mention the Stampede has managed to lasso in some sunny skies and warm temperatures, sure to draw the expected 1.3 million people through the grounds between July 3 and 12. \nDaily highs are expected to reach the mid-to-low twenties with only a few days calling for rain, according to The Weather Network. \nThe Stampede kicks off Friday with a forecast high of 29C under a clear sky. \nWhile activity options abound, Stampede public relations manager Jennifer Booth said there are a few new items to the party this year people may want to check out, including the three-times daily Cirque Éloize Enmax Corral Show, the expanded Nashville North venue, and the Grandstand Show. \n“Our TransAlta Grandstand Show this year is Canadian Classic, and it’s going to be a return to the classic grand spectacle that audiences have really enjoyed for the last few decades,” said Booth. \n“We’re bringing back the flying over the audiences, a lot of pyrotechnics … I don’t have a better word for it than spectacular, in the true sense of the word. \n“There’ll be lots of guest performers … specifically the Alberta Ballet is going to be premiering one of their new works.” \nAlso new to the park this summer are a few tasty treats sure to tempt the palate. \n“There’s a lobster dog, which actually sounds delicious,” said Booth. \n“Instead of a hotdog, it’s a lobster tail and then dipped in corn batter and deep fried.” \nFor peanut butter and jam lovers, there’s a plethora of options including a deep-fried sandwich, and another with more filling than you can imagine, she said. \n“And then we have our cockroach pizza if you’re into that sort of thing,” said Booth. \nWhile there’s plenty of new to the park this year, there’s also century-old fan favourites including the daily rodeo competition, the chuckwagon races, and the agricultural showcases. \n“We have lots of great exhibits in agriculture and so many different competitions and events that happen in both the Saddledome, for the first five days, and then in our Agricultural Discovery Zone for the rest of the Stampede,” said Booth. \n“Everything from our Agrium Ag-tivity in the City to the Heavy Horse Pull.” \nOnce your Stampede agenda has been set following Thursday evening’s Sneak-a-Peek, it’s up and at ’em Friday morning. \n“Bright and early at 9 o’clock sharp the Stampede Parade starts and that’s not to be missed , ” said Booth. \n“It’s a two-hour long-parade with lots of entries and marching bands and floats.” \nThe parade will be led this year by Olympian Kaillie Humphries , and will also be part of the pre-Pan Am Games torch relay. \nTickets for Stampede are available on site or online at calgarystampede.com . \nAdmission is $18 for those ages 13 to 64; $8 for those seven to 12 years, and free for those six years and under. \nOn Twitter: @SUNLauraBooth Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions and our netiquette rules . Sponsored Links", "external_links": [], "published": "2015-07-03T22:52:00.000+03:00", "crawled": "2015-07-04T00:11:28.000+03:00", "highlightTitle": ""}