{"organizations": [], "uuid": "0837d75ab8b728cecc670fab1652ddc6a00b79ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/BSE-Sensex-EPs.jpg", "site_section": "http://www.financialexpress.com/section/lifestyle/travel-tourism/", "section_title": "Travel News:Travel and Tourism,Latest Travel News,Tourism News Today,Latest Travel News Articles | The Financial Express", "url": "http://www.financialexpress.com/article/fe-columnist/p-note-action-will-curb-black-money-but-hit-markets/108765", "country": "IE", "title": "P-Note action will curb black money but hit markets", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "P-Note action will curb black money but hit markets | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T02:39:00.000+03:00", "replies_count": 0, "uuid": "0837d75ab8b728cecc670fab1652ddc6a00b79ca"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/fe-columnist/p-note-action-will-curb-black-money-but-hit-markets/108765", "ord_in_thread": 0, "title": "P-Note action will curb black money but hit markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Other Articles Early birds aren’t flying: With slow recovery, the market looks over-priced Human DNA Profiling Bill: A tool that could be misused Exclusive: Sebi not to give P-Note holders’ details to the taxman It is just as well that the government has said that it will not be precipitate in taking action on the Special Investigative Team (SIT) on black money ’s recommendations on participatory notes (P-Notes). With investments through P-Notes comprising around 11-12% of all FII investments in the stock markets, asking Sebi to do a thorough KYC can spook them and send the market crashing as happened some years ago when Sebi banned P-Note investments; the decision was later reversed. Monday’s collapse in the market—it ended 551 points down after falling 259 points on Friday—had more to do with the China collapse, but the P-Note recommendation also had a bearing.\nThat a large part of FII investments come in via P-Notes where the identity of the ultimate beneficiary is hidden is well-known—Sebi has tightened KYC norms, but its KYC is limited to the names of companies who are invested in P-Notes. That is why the SIT has said Sebi needs to “come up with regulations where the ‘final beneficial owner’ of P-Notes/ODI are known … In no case should the KYC information end with name of a company … SEBI should have information of its promoters/directors who exercise effective control …”.\nIt is widely suspected that a large part of the P-Note investment may be Indian black money being round-tripped. Indeed, the SIT report’s recommendations on P-Notes itself refers to a CBDT committee report of 2012. The fact that the Cayman Islands cannot possibly support the kind of investment that comes in from there—this has irked the SIT tremendously—is also well-known. But each time there has been any attempt to plug such loopholes, there has been an outflow of FII funds —that is also the reason why both this and the previous government have put off GAAR provisions for so many years on investments through countries like Mauritius.\nLaunching a crusade against black money—with some highly doubtful numbers, it has to be added —is one thing, but dealing with the implications of it quite another. If the government is serious about tackling black money, it has to crack down on P-Notes and ensure Sebi gets full details of beneficial ownerships—after all, such money may not just be black money, it could be drug/militancy money also. Which is why applying of GAAR is also important. The problem, however, is that when other countries offer an easier tax regime, India has no option but to play the same game. And there is always the likelihood that Indian black money will find its way to such low-tax routes. But if tackling this hits FII investments, the repercussions will be quite serious. As far as the government’s black money crusade is concerned, this is its rubber-meets-road moment.\n 6:39 pm © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-07-28T02:39:00.000+03:00", "crawled": "2015-07-27T18:12:30.621+03:00", "highlightTitle": ""}