{"organizations": [], "uuid": "397cc0b3031b43a6887a0aa7f2d92e2d6f594c56", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/07/15/travel/images/30264465-01_big.jpg", "site_section": "http://www.nationmultimedia.com/home/rss/travel.rss", "section_title": "NationMultimedia.com - Travel", "url": "http://www.nationmultimedia.com/travel/BALI-KITE-FESTIVAL-30264465.html", "country": "TH", "title": "BALI KITE FESTIVAL", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "BALI KITE FESTIVAL", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T21:00:00.000+03:00", "replies_count": 0, "uuid": "397cc0b3031b43a6887a0aa7f2d92e2d6f594c56"}, "author": "", "url": "http://www.nationmultimedia.com/travel/BALI-KITE-FESTIVAL-30264465.html", "ord_in_thread": 0, "title": "BALI KITE FESTIVAL", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » travel » BALI KITE FESTIVAL FESTIVAL DIARY BALI KITE FESTIVAL THE NATION July 15, 2015 1:00 am \nBALI KITE FESTIVAL carries spiritual meaning as flying kites are a means of offering prayers to the gods for a bountiful harvest. The skies of Sanur Beach will be decorated with all sorts of colourful objects this weekend as Bali celebrates its annual kite festival. BALI KITE FESTIVAL July 18 to 20, Bali, Indonesia The skies of Sanur Beach will be decorated with all sorts of colourful objects this weekend as Bali celebrates its annual kite festival. The celebration carries spiritual meaning as flying kites are a means of offering prayers to the gods for a bountiful harvest. Kites of all different shapes, sizes and colours take to the skies above the island, with some of the kites measuring up to 10 metres in length. Teams from local villages battle it out in competitions for best launch and longest flight. There is live music in the form of a Gamelan orchestra throughout the festival and hundreds of spectators. FUJI ROCK FESTIVAL July 24 to 26, Naeba, Japan The line-up for this year's Fuji Rock Festival is nothing short of sensational with big names such as Foo Fighters, Muse, Motorhead, Owl City, deadmau5, Ride and Noel Gallagher's High Flying Birds set to perform at Naeba Ski Resort, Yuzawa-cho, Niigata Prefecture. Tickets cost around Bt4,600 per day. Visit www.FujiRock-eng.com. SUMIDA RIVER FIREWORKS DISPLAY July 25, Tokyo, Japan People in Tokyo keep their fingers crossed for no rain on the last Saturday of July so that the Sumidagawa Hanabi Taikai, one of Tokyo's major fireworks displays, goes without a hitch and thousands of dazzling firework can spout skywards along the Sumida River. The show includes a competition between rival firework companies, so expect state-of-the-art pyrotechnics. The best viewing locations are the boats on the river, but places are limited so most of the spectators head for Asakusa's Sumida Park. GILROY GARLIC FESTIVAL July 24 to 26, California, USA Every last weekend of July, a small city in Santa Clara County hosts the Burning Man of the garlic world. Established in 1979, this three-day summertime celebration requires the work of 4,000 community volunteers. More than two tonnes of fresh garlic are ploughed into aromatic feasts over the long weekend. Visitors to \"Gourmet Alley\" can fill up on garlic bread, garlic sausages, garlic seafood and even garlic ice cream. Some 65,000 portions of garlicky grub are served. Millions of people have visited Gilroy for the festival, which has raised millions of dollars for charity. Don't forget to take some breath fresheners. Visit www.GilroyGarlicFestival.com. THE FOOD SHOW July 30 to August 2, Auckland, New Zealand Auckland's edition of The Food Show at ASB Showgrounds is a place you can eat, drink and watch cookery demonstrations by local and celebrity chefs. The event brings together in one show more top chefs, more food and wine, more organics, more Fairtrade, and more kitchen gear than any other show in New Zealand. Get new taste sensations, new dinner party menu ideas, the inside line on the latest wine releases, and even new gadgets for the kitchen. Visit www.FoodShow.co.nz. DUSSELDORF - BENRATH BIERBORSE July 31 to August 2, Dusseldorf, Germany Beer tasters and lovers alike drink to their hearts' content at the annual Dusseldorf - BenrathBierborse. Benrath, which sees the pedestrianised zone of the city, transformed into a big beer garden. Major and smaller international brewers offer hundreds of beer for samples and for sale. Numerous beers from around the world are available: German and international, bitter and sweet, light and dark, there's plenty for the serious beer buff to collect, from glasses and clothing to beer mats and bottles. The event attracts around 100,000 visitors every year so it is best to get there early. 269 Viewed", "external_links": [], "published": "2015-07-14T21:00:00.000+03:00", "crawled": "2015-07-15T03:13:13.000+03:00", "highlightTitle": ""}