{"organizations": [], "uuid": "cfd72fffe5024380c6019c0c681f30a5fafee9dd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03358/magicmike2_3358120k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/men/the-filter/11730753/Revealed-the-reason-why-men-and-women-turn-to-stripping.html", "country": "US", "title": "Revealed: the reason why men and women turn to stripping", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Revealed: the reason why men and women turn to stripping - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T18:32:00.000+03:00", "replies_count": 0, "uuid": "cfd72fffe5024380c6019c0c681f30a5fafee9dd"}, "author": "Telegraph Men", "url": "http://www.telegraph.co.uk/men/the-filter/11730753/Revealed-the-reason-why-men-and-women-turn-to-stripping.html", "ord_in_thread": 0, "title": "Revealed: the reason why men and women turn to stripping", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It takes a certain type of person to take their clothes off in front of other people for money. But, according to new research, that person's motivation changes depending on whether they are male or female. While women turn to 'exotic dancing' due to a need for cash and, often, a diminished sense of self-worth, men tend to strip to fuel their egos . Dr Maren Scull of the University of Colorado, Denver spent just under two years studying the behaviour of American strippers, and found that the two genders react differently to the negative connotations that society attaches to public shows of flesh. Her results were published this month in Deviant Behavior, a scientific journal that publishes research into behaviours that run against the grain of social norms. \"Because stripping is a stigmatising occupation, it has the capacity to negatively affect exotic dancers' self-definitions,\" Dr. Scull explained. \"I looked into what motivates men to continue dancing and found that stripping led to feelings of mattering, mastery and enhanced self-esteem.\" \"Initially women who dance for men may experience a boost in self-esteem, but after time they suffer from a diminished self-concept.\" The discrepancy, according to Dr Scull, could be due to the different reactions men and women experience from objectification . While women experience objectification more frequently than men and are therefore more likely to construe it as negative, men find it an exciting novelty. • READ: Meet the real-life Magic Mikes Follow @TelegraphMen", "external_links": [], "published": "2015-07-10T18:32:00.000+03:00", "crawled": "2015-07-10T14:55:21.000+03:00", "highlightTitle": ""}