{"organizations": [], "uuid": "5d21027f97eaff282de60cfcccdba31c2a144606", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/k/v/o/x/image.related.StuffLandscapeSixteenByNine.620x349.15kuuv.png/1435634851878.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/australia/69837367/Discover-Queenslands-best-kept-beach-secret", "country": "AU", "title": "Discover Queensland's best-kept beach secret", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Discover Queensland's best-kept beach secret", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T06:27:00.000+03:00", "replies_count": 0, "uuid": "5d21027f97eaff282de60cfcccdba31c2a144606"}, "author": "Sheriden Rhodes", "url": "http://www.stuff.co.nz/travel/destinations/australia/69837367/Discover-Queenslands-best-kept-beach-secret", "ord_in_thread": 0, "title": "Discover Queensland's best-kept beach secret", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Discover Queensland's best-kept beach secret SHERIDEN RHODES Last updated 05:00, July 1 2015 Tourism Queensland \nThere is plenty of raw beauty to be discovered around the town of 1770. \nIt's early morning as we meander along the bush trail to the pristine Workman's Beach at Agnes Water, Queensland's most northerly surfing beach. \nThe wind is blowing a gale on the other side of the peninsula, and the sand is cool beneath our bare feet. Here, however, it's protected from the biting wind. We unroll our yoga mats and sit for a moment, eyes closed, feeling the fresh air and the warmth of the sun on our faces. As I open my eyes, a huge fish leaps exuberantly from the Coral Sea as waves crash on the shore. \nI'm doing a beach yoga class with Mel Thomson from Vitality Fitness, who swapped city life for the laid-back lifestyle of Seventeen Seventy in Queensland after her father had a health scare. She loves the raw beauty of her hometown, six hours' drive north of Brisbane. \nWhile Agnes Water is still relatively undiscovered by southerners, international backpackers have long known of its charm through word of mouth. \nThey come here to learn to ride on the gentle surfing waves; access the southern tip of the Great Barrier Reef; and see migrating humpback whales, pods of dolphins, the resident dugong colony and sea turtles. It takes a little getting to, being 60 kilometres off the Bruce Highway, yet it's well worth the detour. \nDo yoga on the beach with Mel Thomsom from Vitality Fitness. \nFor some time, Agnes Water has been touted as the new Noosa, or an early Byron Bay. Yet for all the hype, Agnes Water remains a sleepy beachside town and one of Queensland's best-kept secrets. \nLocals will tell you they've never seen a crowd, and if you stand at the southern end you can see a spectacular sunset due to the beach's curve, which is rare on the east coast. One of the best places to catch the famed sunset is from the Tree Bar at the 1770 Beach Hotel – the first store to open in the town, in 1973. \nI arrive just as the sun is slipping into Bustard Bay, enjoying a sundowner with the locals. Just down the road is the marina where Cook's ship, the Endeavour, anchored in May of 1770. Ad Feedback \nIt's there I head the following day for a tour aboard the LARC (Lighter Amphibious Resupply Cargo), which takes visitors to Bustard Light Station, crossing waterways and 27 kilometres of pristine coastline normally only accessible by boat. We see schools of fish jumping in the shallows, and stop to collect bright pink pipi and bonnet shells. \nBack at the newly opened Lagoons 1770 Resort and Spa, I dine at its excellent onsite Plantation Restaurant, led by Ross Howell and wife Helen Johnson, who formerly ran eateries in Brisbane, including Pippin Took, Grand Orbit, and Dish Bar and Bistro. \nThe menu is seasonally driven; dishes such as the corned lamb rump with fondant potatoes, pea puree and sugar snaps reveal Ross' classic French training. \nEnjoy a quiet evening at the Lagoons 1770 Resort and Spa. \nIt's Heron Island I head to next, its reputation for wildlife, snorkelling and diving preceding it. I arrive in the best possible way, via seaplane. As I step ashore the small coral cay, my feet sink into the clear, warm water. Heron may be best known for turtles, given it's a significant breeding ground for both the green and loggerhead turtles, but by the time I arrive the hatchlings have long since departed. \nRight now, birds rule the island, thousands of them, and they're quite comical. There are herons, black noddy terns, buff-banded rails, silver gulls and wedge-tailed shearwaters (mutton birds), to name just a few. The mutton birds, which come out at night, are like drunks trying to find their way home after a night on the tiles. They stumble into walls, huddle in corners and even stagger into the bar sideways. \nAs fascinating as the birdlife is, I'm keen to see what lies beneath. Fiona Butler, a Brit who runs Heron Island's dive shop, says while the Southern Great Barrier Reef is not as colourful as the northern reef, it's far less crowded, the water is clearer, and there's always something to see. \n\"Whether it's sharks, turtles, or manta rays, every time you enter the water you see something incredible.\" Remarkably, more than 70 per cent of the Great Barrier Reef's coral species and about 60 per cent of the 1500 varieties of fish can be found off Heron's shores. \nSure enough, the diving and snorkelling doesn't disappoint. I spot my first gigantic manta ray as we make our descent to Heron Bommie, which the late Jacques Cousteau listed as one of his top 10 dive sites. It's a dive with everything – a second majestic manta ray cruises by, we see a huge green turtle, a black tip reef shark and even an octopus. \nSee the beauty of Heron Island from the air. \nThat night, another blistering sunset sets the sky on fire. I walk the entire island, the dusty pink and silver sky making it appear as if the horizon and sea are one. \nAt the jetty, Nevin, a contract chef from the Cook Islands, strums a ukulele as students from the Heron Island Research Station snorkel the wreck just offshore. \n\"Whenever I sing, the shark appears,\" Nevin says, pointing to a large black tip reef shark circling below. I don't want to burst his bubble, but a shark appears every time I walk out on to the jetty as well, so I nod and tell him they must like his music. \n\"It's a special place,\" he says, a huge smile on his face. He's right on that count. \nMORE INFO \nsoutherngreatbarrierreef.com.au \nGETTING THERE \nQantasLink and Virgin Australia operate flights from Sydney and Melbourne to Gladstone and Bundaberg via Brisbane. See qantas.com.au ; virginaustralia.com . Bundaberg is just over four hours' drive north of Brisbane. Heron Island is connected by ferry (AU$60 [NZ$68] an adult one way), or seaplane (from AU$338 an adult one way, subject to minimum numbers) from Gladstone. \nSTAYING THERE \nStudio rooms at Lagoons 1770 Resort and Spa start at AU$230 a night, including breakfast, see lagoons1770.com.au . Rooms at Heron Island Resort start at AU$320 a night, twin share, including buffet breakfast. See heronisland.com . \nSEE + DO \nTours on the LARC start from AU$38 for an afternoon sunset cruise; AU$155 for a full day tour to Bustard Head Light Station including lunch, billy tea, sandboarding and more, see 1770larctours.com.au . A private beach yoga session with Mel from Vitality Fitness costs from AU$80 for one hour, see vitalityfitness1770.com.au . \nThe writer was a guest of Southern Great Barrier Reef Tourism.", "external_links": [], "published": "2015-06-30T06:27:00.000+03:00", "crawled": "2015-07-01T00:59:52.000+03:00", "highlightTitle": ""}