{"organizations": [], "uuid": "d05f9a720adce0883e390ce0a2712813daed9766", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/3/k/3/s/image.related.StuffLandscapeSixteenByNine.620x349.163k28.png/1438291677473.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/australia/70709840/What-to-do-in-Thredbo-if-you-don-t-ski", "country": "AU", "title": "What to do in Thredbo if you don't ski", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "What to do in Thredbo if you don't ski", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T00:27:00.000+03:00", "replies_count": 0, "uuid": "d05f9a720adce0883e390ce0a2712813daed9766"}, "author": "Helen Pitt", "url": "http://www.stuff.co.nz/travel/destinations/australia/70709840/What-to-do-in-Thredbo-if-you-don-t-ski", "ord_in_thread": 0, "title": "What to do in Thredbo if you don't ski", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What to do in Thredbo if you don't ski HELEN PITT Last updated 09:27, July 31 2015 \nIn the spa at the Thredbo Alpine Hotel. \nIt might have had a shaky start, but with recent snowfalls, the 2015 ski season is in full swing at Thredbo, Australia, with virtually all the mountain open. \nNevertheless, if the weather turns against you or someone in the family has no interest in skiing or snowboarding, there's still plenty to do at the Snowy Mountains resort. Here's a selection … \nTHROW A SNOWBALL \nThe first thing you need to do upon entering the Kosciuszko National Park, is pull up the car and bundle everyone out to have a snowball fight. You are likely to have driven a long way to get to the slopes, and the first sighting of snow on the side of the road is always a magical experience. Nothing quite wakes you up more than a strategically thrown snowball landing between the shoulder blades. It sets the tone for the fun you are about to have in Thredbo. \nPlaying in the snow \nBUILD A SNOWMAN \nAs soon as you get settled in your village accommodation – race outside and build your very own snowman. One diligent family on opening weekend, brought a lunch box full of carrots chopped in half. This doubled as a healthy snack as well as noses to garnish the snowmen and snow women they built. If you've got the right snow gear – lie in the snow and create a snow angel. \nGO SLIDING Ad Feedback \nTobogganing at Thredbo. Photo: Thredbo \nThere's no excuse not to get out and have some fun in whatever snow there is. The snow play park at the base of the Thredbo chairlift, is loads of fun for toboggans and tyre tubes. Laugh your way down the slope – with a host of other young snow bunnies. \nSTAR GAZE IN THE SPA \nThroughout winter, the Thredbo Alpine Hotel, a stalwart of the Thredbo Village, hosts hot pool parties with hot cider served poolside in front of crackling fires. The outdoor pool is heated to 24 degrees so wear your boardies or bikini under your ski suit for an après-snow swim. The spa is the place everyone should be to watch the sun go down and the stars come up over the Snowy Mountains. Another way to relax at the Thredbo Alpine Hotel, whether or not you've been on the slopes, is finishing the day with a massage from the in-house masseur, Tineke Edwards. \nLEISURE TO TREASURE \nSnow or no snow, the Thredbo Leisure Centre is fun for all the family. Located halfway between the beginner slopes at Friday Flat and the village, it includes Mission Inflatable, a blow-up floating obstacle course, and indoor waterslide that can keep kids entertained for hours – whatever the weather. Parents can swim laps in the Olympic-length lanes of the heated pool or have a hit of squash. Three-day or longer ski passes include entry to the centre. \nPoolside at the Thredbo Alpine Hotel. \nSHOP AT THE BIRDSNEST \nBirdsnest is the brainchild of Jane Cay, who started a clothing store in Cooma when she moved to the country, and launched the label online in 2008. You can go to the store in downtown Thredbo for a personalised style guide, created by the friendly Birdsnest staff. The next day you can come to the store, after completing the style guide, and try out the selection of clothes the staff have chosen for you to suit your tastes and body shape. With more than 4000 clothing styles from 250 fashion labels (including four local Snowy Mountains designers) female ski bunnies can happily while away the hours with some retail therapy. \nCHECK OUT THE FIREWORKS \nEvery Saturday night a flare run and fireworks light up the night sky on the slopes opposite Thredbo Village. In the village, dining options vary from casual pizza, to fondue and a host of other dining options. Finish off the evening with a nightcap of schnapps from the local Wild Brumby distillery. \nMORE INFORMATION thredbo.com.au \nGETTING THERE Thredbo is a six-hour drive from Sydney or 2½ hours from Canberra, the closest major airport, which has coach connections in winter. \nSTAYING THERE The Thredbo Alpine Hotel has midweek accommodation deals with savings of up to 15 per cent off twin share accommodation, breakfast and lift passes; see thredbo.com.au . \nThe writer was a guest of Thredbo Alpine Village and the Thredbo Alpine Hotel.", "external_links": [], "published": "2015-07-31T00:27:00.000+03:00", "crawled": "2015-07-31T02:34:02.888+03:00", "highlightTitle": ""}