{"organizations": [], "uuid": "e8e0a40a2eef787629f84dc4be64c89fc437dc69", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eglobaltravelmedia.com.au", "main_image": "https://s0.wp.com/i/blank.jpg", "site_section": "http://www.eglobaltravelmedia.com.au/feed/", "section_title": "Global Travel Media", "url": "http://www.eglobaltravelmedia.com.au/expedia-rolls-out-routehappy-happiness-data-worldwide/", "country": "US", "title": "Expedia Rolls Out Routehappy Happiness Data Worldwide", "performance_score": 0, "site": "eglobaltravelmedia.com.au", "participants_count": 1, "title_full": "Expedia Rolls Out Routehappy Happiness Data Worldwide", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T17:56:00.000+03:00", "replies_count": 0, "uuid": "e8e0a40a2eef787629f84dc4be64c89fc437dc69"}, "author": "Chisa Boonmee", "url": "http://www.eglobaltravelmedia.com.au/expedia-rolls-out-routehappy-happiness-data-worldwide/", "ord_in_thread": 0, "title": "Expedia Rolls Out Routehappy Happiness Data Worldwide", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email \nRoutehappy and the Expedia group today announced Routehappy’s differentiated “happiness” data is now integrated into the global flight shopping experience, including most Expedia sites worldwide, Travelocity sites in North America and Wotif, lastminute.com.au and lastminute.co.nz in Australia / New Zealand. \nRoutehappy created the definitive, unbiased Flight Score, by cabin, for every flight worldwide. Flight Scores are comprised of aspects of the flight experience that flyers care about, including aircraft, seat, amenities, trip duration, and ratings. Routehappy continuously researches and validates fragmented data from hundreds of sources to offer a reliable and personalised measure of flight quality. In addition, Routehappy’s newest amenity, Fresh Food, is also now available on more than 100 airlines worldwide. Expedia’s rollout brings useful information to flight shoppers worldwide and continues to help airlines highlight their differentiated product enhancements and offerings to travellers across the globe. \n“Expedia is continuing the roll-out of our Routehappy partnership to help travellers everywhere make the most informed flight decision possible,” said Greg Schulze, Senior Vice President, Global Tour and Transport, at Expedia. “By rolling out Routehappy happiness data, we’re leading the industry to benefit consumers and airlines alike.” \n“Our partnership with Expedia underscores Routehappy’s commitment to be the industry’s source for differentiation data, content and tools to create more value in flight shopping,” said Robert Albert, CEO at Routehappy. “Flyers benefit from better information when they shop for flights, and airlines benefit from the ability to tell flyers about their product offerings and enhancements. We’re creating data, content, and tools to help the industry transform flight shopping to benefit the entire ecosystem — from flyers, to airlines, to distributors, to technology platforms. Expedia’s leadership is satisfying consumer and industry demands at jet speed.” \nFor more information on Routehappy, including a demo flight search application, information on products, and recent company news, please visit www.routehappy.com Share this:", "external_links": [], "published": "2015-07-01T17:56:00.000+03:00", "crawled": "2015-07-01T18:01:11.000+03:00", "highlightTitle": ""}