{"organizations": [], "uuid": "255817dffe57e4de79ec454390644674faecea45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/27709-europcar-partners-with-rbs-group-on-cashback-plus-loyalty-programme", "country": "US", "title": "Europcar partners with RBS Group on Cashback Plus loyalty programme", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Europcar partners with RBS Group on Cashback Plus loyalty programme", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T18:15:00.000+03:00", "replies_count": 0, "uuid": "255817dffe57e4de79ec454390644674faecea45"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/27709-europcar-partners-with-rbs-group-on-cashback-plus-loyalty-programme", "ord_in_thread": 0, "title": "Europcar partners with RBS Group on Cashback Plus loyalty programme", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Europcar partners with RBS Group on Cashback Plus loyalty programme Europcar partners with RBS Group on Cashback Plus loyalty programme Details Created on Tuesday, 14 July 2015 16:15 Customers benefit with 1% of their spend back in Rewards when hiring from Europcar Europcar, the leader in car hire services in Europe, has joined the RBS Group Cashback Plus loyalty programme, offering NatWest and Royal Bank of Scotland customers the chance to earn a minimum of 1% of their spend at Europcar back in Rewards. Rewards can be earned on purchases paid for at the time of online booking at www.europcar.co.uk and at all UK Europcar rental stations made with a card registered to a NatWest or a Royal Bank of Scotland Cashback Plus account. \nThe award winning scheme, which launched in 2013, has already seen over 1.5 million Royal Bank of Scotland and NatWest customers register. Europcar is the first and only car hire service to join the panel of participating retailers. Customers can redeem the Rewards earned on their purchases by transferring them as money to their current account, trading them for retail gift vouchers or donating them to one of the chosen charities. Under the scheme 5.00 in Rewards is equal to £5.00 when redeemed. “At Europcar we pride ourselves on developing new partnerships which give our customers more benefits whilst also achieving greater exposure for the brand”, explained Ken McCall, Managing Director, Europcar UK Group. “We are, therefore, very excited about this partnership with the RBS Group Cashback Plus loyalty programme. The emphasis that the RBS Group places on offering quality customer service, exactly matches the Europcar ethos”. Les Matheson CEO for Personal & Business Banking, added: “The Cashback Plus loyalty programme continues to go from strength to strength and has attracted a high calibre of retailers wanting to reward customers for their loyalty. We know that our customers will be excited by the benefits they will receive with Europcar joining the scheme.” Related articles", "external_links": [], "published": "2015-07-14T18:15:00.000+03:00", "crawled": "2015-07-15T08:25:07.000+03:00", "highlightTitle": ""}