{"organizations": [], "uuid": "428eb4245aa0429e7738021846bd81b511894643", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jsonline.com", "main_image": "http://media.jrn.com/images/js-for-social-200-final.jpg", "site_section": "http://www.jsonline.com/rss?c=y&path=%2Ffeatures%2Ftravel&atom=y", "section_title": "JSOnline.com Travel", "url": "http://www.jsonline.com/features/travel/taste-of-wisconsin-prairie-dog-blues-festival-brat-days-b99541102z1-318455911.html", "country": "US", "title": "Taste of Wisconsin, Prairie Dog Blues Festival, Brat Days", "performance_score": 0, "site": "jsonline.com", "participants_count": 0, "title_full": "Taste of Wisconsin, Prairie Dog Blues Festival, Brat Days", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T01:59:00.000+03:00", "replies_count": 0, "uuid": "428eb4245aa0429e7738021846bd81b511894643"}, "author": "", "url": "http://www.jsonline.com/features/travel/taste-of-wisconsin-prairie-dog-blues-festival-brat-days-b99541102z1-318455911.html", "ord_in_thread": 0, "title": "Taste of Wisconsin, Prairie Dog Blues Festival, Brat Days", "locations": ["Wisconsin"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chelsey Lewis"], "text": "Taste of Wisconsin, Prairie Dog Blues Festival, Brat Days By Chelsey Lewis of the Journal Sentinel July 26, 2015 (0) Comments \nJanesville: Tallman Arts Festival. More than 100 artists will have their works on display at this festival from 10 a.m. to 5 p.m. next Sunday at the Rock County Historical Society, 440 N. Jackson St. In addition to the art fair, there will be kids' activities, an ice cream social, a silent auction, a wine and cheese tasting and live music. Admission is $5. See rchs.us . \nKenosha: Taste of Wisconsin. Sip and sample from 40 vendors at this food festival Friday through next Sunday along the lakefront downtown. Visitors can sample while enjoying live music at four stages, food demonstrations and fun for the little ones. Admission is free; samples vary in cost. The festival is open from 3 to 11 p.m. Friday, 11 a.m. to 11 p.m. Saturday and 11 a.m. to 7 p.m. next Sunday. See tasteofwi.com . \nNeillsville: Highground Bicycle Tour Across Wisconsin. Cyclists of all skill levels are encouraged to join this bicycle tour Friday through next Sunday. Routes start in Appleton, Madison, New Richmond and Hayward and all finish by riding into the Highground Veterans Memorial Park, W7031 Ridge Road, at noon next Sunday. Registration is $100 for individuals and $200 for a family. See thehighground.org . \nPrairie du Chien: Prairie Dog Blues Festival. Visitors to St. Feriole Island on the Mississippi River will be filled with the blues — in the best way. Bring your chairs and blankets for blues and roots music on the island Friday and Saturday. Tickets are $35 for one day and $60 for two. See prairiedogblues.com. \nSheboygan: Johnsonville Brat Days. The \"Bratwurst Capital of the World\" celebrates Wisconsin's summertime staple at this festival Thursday through Saturday at Kiwanis Park. In addition to consuming brats in many forms, visitors can take part in a brat-eating contest, join a 4-mile run/walk and enjoy live music from bands such as Pat McCurdy and Rebel Grace. Admission is free. See brat-days.com . \nSt. Germain: Pig in the Pines RibFest. Fill up on mouthwatering barbecue from award-winning vendors at this festival Thursday through Saturday at St. Germain Community Park. Music headliners include rock bands Road Trip and Molly Hatchet. Daily admission is $5; three-day passes are $10. Children age 12 and under get in free. See piginthepines.com . \nMichigan: Traverse City Film Festival. The cinema takes center stage in Traverse City from Tuesday through next Sunday. In addition to screenings at local theaters, each night features a free classic film screening outside at Open Space Park. There will also be panels with filmmakers, film school classes and movies for kids. Ticket prices vary. See traversecityflimfest.org . \nIowa: Bix Beiderbecke Memorial Jazz Festival. Davenport celebrates its native jazz legend, Bix Beiderbecke, during this annual festival Thursday through next Sunday. Eighteen jazz bands are scheduled to perform along with members of the Bix Jazz Society Youth Band at the Davenport River Center, 136 E. 3rd St. Single-session tickets are $30, all-day passes are $55 Friday and $65 Saturday, and festival passes are $145. See bixsociety.org . \n— Chelsey Lewis \nPlease send notice of events three weeks in advance to: All Over the Map, Travel Section, P.O. Box 371, Milwaukee, WI 53201 or to jsfeat@journalsentinel.com, with All Over the Map as the subject. © 2015 , Journal Sentinel Inc. All rights reserved. About Chelsey Lewis \nChelsey Lewis writes about travel and things to do in Wisconsin for Wisconsin Trails and the Journal Sentinel.", "external_links": [], "published": "2015-07-31T01:59:00.000+03:00", "crawled": "2015-07-31T11:36:28.946+03:00", "highlightTitle": ""}