{"organizations": [], "uuid": "d1c3e31ead6b8e77c25b9d61a250e204aafd463a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61378/westin-debuts-second-silicon-valley-hotel", "country": "US", "title": "Westin debuts second Silicon Valley hotel", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Westin debuts second Silicon Valley hotel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T21:13:00.000+03:00", "replies_count": 0, "uuid": "d1c3e31ead6b8e77c25b9d61a250e204aafd463a"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61378/westin-debuts-second-silicon-valley-hotel", "ord_in_thread": 0, "title": "Westin debuts second Silicon Valley hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Westin debuts second Silicon Valley hotel Adv: \nJul 13, 2015 Adv: \nSAN JOSE, CA - Starwood Hotels & Resorts Worldwide, Inc today announced the opening of The Westin San Jose, a historic 171-room hotel in the center of Northern California’s largest city. Listed on the National Register of Historic Places, the hotel has undergone a guestroom, corridor, lobby and public space transformation in order to provide guests with a revitalizing stay. The Westin San Jose is the brand’s 18th hotel to open in California and one of five new openings this year in North America. \nLocated in the heart of downtown, The Westin San Jose is steps away from San Jose McEnery Convention Center and San Jose State University. The hotel is conveniently situated near Santana Row, where guests can enjoy a variety restaurants, trendy shopping and nightlife. A historic landmark with modern and elegant design, The Westin San Jose features stunning architecture and charming furnishings. Upon entering the lobby, guests are immediately transported to a relaxing space that encompasses modern features with historical elements. Original molding on the ceilings has been preserved to show off the unique beauty of the early 1900s building, while Westin brand touches, such as a soothing color palate and vertical garden, create a modern-day oasis of calm from the rigors of travel. \n“We are excited to unveil this historic building’s restoration to our guests,” said Brian Dell'Ergo, General Manager of The Westin San Jose. “While still maintaining its beauty from when it was originally constructed in 1926, The Westin San Jose will offer guests a comfortable boutique hotel experience, alongside the amenities and services that our Westin guests have come to expect.” \nThoughtfully appointed accommodations and upscale amenities ensure guests have a refreshing and comfortable stay. Each of the 171 luxurious rooms and suites feature The Westin Heavenly Bed® and Bath, complimentary high speed Internet access and large flat screen TVs. Guests can also enjoy an authentic Italian dining experience at Il Fornaio, one of the finest downtown San Jose restaurants. Located adjacent to the lobby, Il Fornaio offers private dining room space for small groups, making it convenient for both business and social gatherings. Il Fornaio also features award-winning catering options, making The Westin San Jose a superior wedding venue. \n“We are thrilled to debut Westin in San Jose, a significant market for the brand’s growth in North America,” said Bob Jacobs, Vice President Brand Management for Westin and Sheraton. “With so much activity happening in Silicon Valley, we look forward to providing guests a haven where they can unwind and re-energize.” \nThe hotel is equipped with 10,000 square feet of meeting space, including the Grande Ballroom which features vintage 1920s chandeliers, complemented by wall sconces, mirrored walls, crown molding and wooden borders. Connecting French doors lead to the covered atrium, where revitalizing food can be catered by the on-site restaurant.", "external_links": [], "published": "2015-07-13T21:13:00.000+03:00", "crawled": "2015-07-13T22:03:46.000+03:00", "highlightTitle": ""}