{"organizations": [], "uuid": "d24f603ead5cc14d539b8cf09abc0519923bb53c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/unnamed-13.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/dhisco-partners-green-focused-online-travel-agency/", "country": "US", "title": "DHISCO Partners With Green-Focused Online Travel AgencyTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "DHISCO Partners With Green-Focused Online Travel AgencyTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "d24f603ead5cc14d539b8cf09abc0519923bb53c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/dhisco-partners-green-focused-online-travel-agency/", "ord_in_thread": 0, "title": "DHISCO Partners With Green-Focused Online Travel AgencyTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DHISCO connects travelers with green hotels Published on : Tuesday, July 7, 2015\nDHISCO Inc., the world’s leading hospitality distribution company, today announced a partnership with TICATI, a fast, new online travel agency that connects travelers with green hotels around the world.Based in Taiwan, TICATI has a user-friendly, interactive site that runs as much as twice the speed of other OTAs because of an innovative search model.\nTICATI Logo.jpg“TICATI is one of a number of new OTAs using innovative technology to connect hotels with travelers based on personal preferences that go way beyond price,” said DHISCO CEO Toni Portmann. “TICATI’s system also enhances and speeds up the booking process. We are proud to provide the partnership that connects them to more than 100,000 hotels around the world.”\nTICATI CEO Shuyu Kahn said the company chose DHISCO to power its site because it believes DHISCO’s market-leading technology will deliver the best return on investment.“DHISCO matches TICATI’s demand for the latest in push technology, enabling us to quickly match socially conscious travelers with the best rates at the hotels that meet their environmental and health standards,” he said. “We are confident this collaboration will be the beginning of a mutually sustainable success story.”\nTICATI offers a broad selection of green-certified hotels around the world. The site serves the needs of travelers who are concerned not only about the environment, but also their own health, local communities, organic and vegan food choices and animal welfare. The OTA will also rank bed quality at hotels and offer information about other amenities and services.\nSource:-DHISCO\nRelated Posts 40% reduction in room rates in Grand Hyatt Taipei in July and August Melia Hotels International becomes a partner of the World Community Grid, initiative sponsored by IBM Express your love this Valentine’s Day at Calabash Cove Resort & Spa Jumeirah Creekside Hotel raises the bar on sustainability standards Preferred Hotel Gruop Announces 2013 Results", "external_links": [], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T16:51:34.000+03:00", "highlightTitle": ""}