{"organizations": [], "uuid": "a438d3d30d2573237e9d2b81e72ad897e51402ae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61318/miss-seychelles-children-s-playground-grateful-full-sponsorship-", "country": "US", "title": "Miss Seychelles children’s playground grateful for full sponsorship from local company", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Miss Seychelles children’s playground grateful for full sponsorship from local company", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T01:00:00.000+03:00", "replies_count": 0, "uuid": "a438d3d30d2573237e9d2b81e72ad897e51402ae"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61318/miss-seychelles-children-s-playground-grateful-full-sponsorship-", "ord_in_thread": 0, "title": "Miss Seychelles children’s playground grateful for full sponsorship from local company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Miss Seychelles children’s playground grateful for full sponsorship from local company Adv: \nJul 10, 2015 Adv: \nVijay Construction (PTY) Ltd. has taken on full sponsorship of the construction and refurbishment of a children’s playground at Montagne Posee Prison. \nThe project, a component of “Miss Seychelles… another world” Beauty with a Purpose Children’s Restoration’s Project, was presented last week to the Seychelles Chamber of Commerce and Industry (SCCI), to gain its members’ financial support. \nV.J. Patel, Managing Director of Vijay Construction (PTY) Ltd., said the company likes contributing to worthy causes. \n“We were touched by an article published in Seychelles Nation about the project, and we believe when there is something good being done for the community, we’re there to participate. It is not for publicity, but it’s the satisfaction we get out of it as a company,” said Mr. Patel. \nWhen Linne Freminot presented the project to Seychelles Chamber of Commerce and Industry, she disclosed a break-down of the material cost for the building of the playground that amounts to around 96,000 rupees. \nThe cost of refurbishing the playground with children’s toys was not included into the original cost. Vijay Construction (PTY) Ltd. said it will also bear the cost of refurbishing the playground. Mr. Patel said Vijay Construction (PTY) Ltd. had financed the construction of three “jungle gyms” for children at Anse Boileau, Port Glaud, and Bel Ombre schools. \nHe invited Miss Seychelles... another world to visit these schools and gain an insight of these projects, to see if the construction materials used to build the gym and the toys would be adaptable for the children’s playground at Montagne Posee prison. \nLinne Freminot, overwhelmed by the support of Vijay Construction (PTY) Ltd., thanked Mr. Patel and his team for believing in this project. \n“It’s the dream of the children to have this playground, and you’ve granted them their wishes,” said Linne Freminot. \nMr. Marco Francis, Chairperson of Seychelles Chamber of Commerce and Industry (SCCI), who had given his full support to the project expressed his thanks to Mr. Patel for making this project a success. \nSeychelles is a founding member of the International Coalition of Tourism Partners (ICTP) . Source: Seychelles Ministry of Tourism and Culture", "external_links": [], "published": "2015-07-11T01:00:00.000+03:00", "crawled": "2015-07-11T21:43:40.000+03:00", "highlightTitle": ""}