{"organizations": [], "uuid": "5be49f9dd3bba8b63e80228b6d5409f7d7deb00d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.couriermail.com.au", "main_image": "http://resources2.news.com.au/images/2015/07/27/1227459/295810-02768396-3452-11e5-87b0-1caa04e25d62.jpg", "site_section": "http://www.couriermail.com.au/travel/photos", "section_title": "Travel photos | Travel Photos and Holiday Pictures | The Courier-Mail", "url": "http://www.couriermail.com.au/travel/travel-advice/dengue-fever-cases-at-six-year-high-in-south-australia/story-fnjjv72l-1227459295838", "country": "US", "title": "Dengue fever cases at six-year high in South Australia", "performance_score": 0, "site": "couriermail.com.au", "participants_count": 1, "title_full": "Dengue fever cases at six-year high in South Australia | Travel | Travel News and Holiday Deals | | The Courier-Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "5be49f9dd3bba8b63e80228b6d5409f7d7deb00d"}, "author": "couriermail.com.au", "url": "http://www.couriermail.com.au/travel/travel-advice/dengue-fever-cases-at-six-year-high-in-south-australia/story-fnjjv72l-1227459295838", "ord_in_thread": 0, "title": "Dengue fever cases at six-year high in South Australia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Figures released by SA Health reveal dengue fever cases in South Australia are at a six-year high.\nSo far this year, 58 people have contracted the mosquito-borne disease, up from 41 cases at the same time last year and more than double the total from five years ago when only 23 cases were reported in 2010.\nDengue fever is a viral disease spread by mosquitoes which occurs in tropical and subtropical regions, including northern Australia.\nOf those infected this year, about 75 per cent contracted the disease while holidaying in Bali.\nSA Health communicable disease control branch director Dr Ann Koehler said many travellers did not realise the dangers of dengue fever.\n“What many people don’t realise is that dengue fever ... is present in a number of our neighbouring countries,” she said.\nThe disease is usually not fatal but there can be serious complications, especially in babies and young children, including dengue haemorrhagic fever, which can result in liver or heart problems, or dengue shock syndrome, which in some cases can cause death.\nDr Koehler said there was no vaccine or specific treatment for dengue fever and she urged all travellers to take precautions while holidaying overseas.\n“The most reliable way to make sure you don’t catch a mosquito-borne disease is to wear a mosquito repellent containing DEET or picaridin which will help avoid being bitten by a mosquito,” she said.\n“There are other measures you can take to avoid being bitten, including wearing light coloured, long-sleeved clothes when you’re outdoors, avoiding wearing perfume or cologne as some can attract mosquitoes and using a mosquito net at night-time.”\nDr Koehler encouraged anyone heading overseas to speak with their GP or a travel medicine expert about what precautions they should be taking.\nDengue fever symptoms include fever, an intense headache, pain behind the eyes, muscle and joint pain, loss of appetite, vomiting and diarrhoea, a skin rash and bleeding from the nose or gums.\nEarlier this month SA Health revealed the state had experienced a surge in the number of people with infectious and notifiable diseases including mumps, cryptosporidiosis, salmonellosis and zoster virus (shingles).\nkatrina.stokes@news.com.au\nViral infection\n■ Dengue fever is an infection caused by dengue viruses spread by mosquitoes.\n■ It occurs in tropical and subtropical areas of the world, including northern Australia.\n■ Symptoms include fever, an intense headache, muscle and joint pain, loss of appetite, vomiting and diarrhoea, a skin rash and bleeding, usually from the nose or gums.\n■ There is no vaccine for the disease.\nSource: SA Health\nOriginally published as Bali travellers cause rise in dengue fever cases", "external_links": ["http://www.adelaidenow.com.au/travel/travel-advice/dengue-fever-cases-at-six-year-high-in-south-australia/story-fnjjv72j-1227459295838"], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-07-28T00:56:27.677+03:00", "highlightTitle": ""}