{"organizations": [], "uuid": "34dff0e04620a5a8f7b54de4f63ee7a2d02a8664", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources2.news.com.au/images/2015/07/28/1227460/827850-fba9d86a-3500-11e5-b1c6-fce245fdac3f.jpg", "site_section": "http://www.adelaidenow.com.au//travel", "section_title": "Travel | Travel News and Holiday Deals | The Advertiser", "url": "http://www.adelaidenow.com.au/business/companies/its-not-political-grilld-worker-and-student-activist-kahlani-pyrah-says-she-just-wants-her-job-back/story-fnkjkokr-1227460827906", "country": "US", "title": "Grill’d: Kahlani Pyrah’s wage dispute is not her first battle | Business News | Business and Finance News |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Grill’d: Kahlani Pyrah’s wage dispute is not her first battle | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T04:53:00.000+03:00", "replies_count": 0, "uuid": "34dff0e04620a5a8f7b54de4f63ee7a2d02a8664"}, "author": "DANA MCCAULEY", "url": "http://www.adelaidenow.com.au/business/companies/its-not-political-grilld-worker-and-student-activist-kahlani-pyrah-says-she-just-wants-her-job-back/story-fnkjkokr-1227460827906", "ord_in_thread": 0, "title": "Grill’d: Kahlani Pyrah’s wage dispute is not her first battle | Business News | Business and Finance News |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GRILL’D worker and student activist Kahlani Pyrah has played down her political ambitions, saying she just wants to rejoin her mates at the Melbourne burger shop that sacked her.\nAfter taking on the chain for allegedly underpaying staff, Ms Pyrah, 20, has been hailed for bravely championing the rights of casual workers, with the ensuing media storm making her an industrial relations poster girl.\nIt’s a boost in profile most young, left-wing aspiring political candidates could only dream of.\nBut the environmental sciences undergraduate insists she doesn’t aim to be anything more than “a rank and file union member”, despite a fiery contribution to campus life — including a biffo at last year’s student elections.\n“Obviously I’m pretty political, but I’m just hoping now that I’ve got this experience I’ll know how to act when I’m in another workplace, if something similar happens,” she told news.com.au ahead of Thursday’s Fair Work Commission hearing.\n“I won’t be challenging Tony Abbott — although someone should.”\nAsked about her tilt at last September’s student elections at Monash University, she said her aim was to “make sure the union takes on an activist role”.\nMs Pyrah ran for Women’s Officer on a ticket with Left Hook, a student group formed after the Socialist Alternative was deregistered by the Monash University Student Association over its anti-Israel stance.\n“Kahlani is an activist around a wide array of issues, from education cuts and the environment, to queer rights and Palestine,” her promotional materials read, promising to stand against “the Abbott Government’s sexism”.\nKahlani Pyrah’s tilt at Monash University’s student elections was a colourful affair. Source: NewsComAu\nBut Ms Pyrah was suspended from the election after a poll day stoush with the student body’s returning officer Will Fowles, which became so combative that accusations of improper touching flew.\nIn a notice of disqualification published on the university website, Mr Fowles wrote that Ms Pyrah had breached regulations by flogging copies of the Socialist Alternative newspaper Red Flag.\n“I directed Ms Pyrah to return to the Campus Centre in order to conceal her T-shirt, at which time her suspension would commence,” he wrote.\nBut she allegedly refused, and ignored repeated warnings her suspension would be extended to two hours, three hours, a whole day of campaigning, or the entire election.\nMs Pyrah was so defiant that Mr Fowles threatened to suspend her from all future elections.\nHe later decided things had become a little too heated, writing that “upon reflection, and given the relatively quick escalation of the dispute”, suspension from the 2014 race would suffice.\nWhatever her future holds, Ms Pyrah has shown herself to be a determined and politically engaged young woman.\nIn July 2014, during her first midyear break, Ms Pyrah travelled to Queensland where she “organised a Bust the Budget rally in Gladstone CBD in less than 24 hours with the support of students, unions, workers and pensioners”, the Gladstone Observer reported.\nAs for the immediate future, she hopes to rejoin her Grill’d colleagues and show other Australian workers that “if it ever happens to you, you can get your job back”.\n“People are really scared, but I think every time you see another worker standing up, the more confident you feel,” Ms Pyrah said.\nOn Monday, Federal Court Judge Philip Burchardt ordered that she be temporarily reinstated , though she will remain on leave without pay until a final decision after a trial next month.\nAware of the fact only a small percentage of unlawful dismissal claimants are reinstated, Ms Pyrah remained confident about resuming her role at the Camberwell store.\n“I’ve got the backing of my colleagues at Grill’d,” she said.\n“I think it will be fine because I’m still friends with them; they all want me to come back.”\nMs Pyrah claims she was sacked after taking steps through hospitality union United Voice to end agreements that underpaid wages and penalty rates.\nBut Grill’d says she was fired after the company investigated bullying complaints made against her.\nJudge Burchardt’s decision means she will be able to attend a Fair Work Commission hearing on Thursday where she will fight to have the existing wage agreements, which underpaid her up to $4000 a year, terminated.\nGrill’d had already agreed to renegotiate contracts.\nMore than 24,000 people have signed a petition calling for Ms Pyrah to be reinstated, while her supporters have been tweeting with the hashtag #grilldandburnd.\nOriginally published as Sacked Grill’d worker’s election biffo", "external_links": ["http://www.news.com.au/national/breaking-news/grilld-forced-to-reinstate-sacked-worker/story-e6frfku9-1227458278589", "http://resources2.news.com.au/images/2015/07/28/1227460/827878-a3bbac14-3500-11e5-b1c6-fce245fdac3f.jpg", "http://www.news.com.au/finance/business/flippin-unfair-grilld-pay-dispute-heats-up/story-fnkgdftz-1227449783602", "http://www.news.com.au/finance/business/its-not-political-grilld-worker-and-student-activist-kahlani-pyrah-says-she-just-wants-her-job-back/story-fnkgdftz-1227460827906"], "published": "2015-07-29T04:53:00.000+03:00", "crawled": "2015-07-28T20:24:00.295+03:00", "highlightTitle": ""}