{"organizations": [], "uuid": "52a4f83a74471b1d566f2100fdb6b6117270d8d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/07/02/Others/Images/2015-07-02/ST-dukes15281435872425.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel: Travel News, Guides, Deals, Hotels, Vacation Ideas &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/style/lonnae-oneal-im-a-black-woman-i-loved-luke-duke-its-complicated/2015/07/02/62429bf0-20cc-11e5-84d5-eb37ee8eaa61_story.html", "country": "US", "title": "Lonnae O’Neal: I’m a black woman. I loved Luke Duke. It’s complicated.", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Lonnae O’Neal: I’m a black woman. I loved Luke Duke. It’s complicated. - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "52a4f83a74471b1d566f2100fdb6b6117270d8d8"}, "author": "By Lonnae O'Neal", "url": "http://www.washingtonpost.com/lifestyle/style/lonnae-oneal-im-a-black-woman-i-loved-luke-duke-its-complicated/2015/07/02/62429bf0-20cc-11e5-84d5-eb37ee8eaa61_story.html", "ord_in_thread": 0, "title": "Lonnae O’Neal: I’m a black woman. I loved Luke Duke. It’s complicated.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "‘Dukes of Hazzard’: At the time, cute triumphed over symbolism. (Moviestore collection Ltd / Alamy) By Lonnae O'Neal Columnist July 2 at 3:00 AM Follow @lonnaeoneal TV Land announced that it’s pulling “Dukes of Hazzard” reruns because one of the main characters, the 1969 Dodge Charger called the General Lee, has a big old Confederate flag painted across the top.\nI knew it would just be a matter of time before studio heads got riled up over Hazzard County.\nIt only took 35 years and a church massacre.\nIn the wake of the South Carolina shooting, we’ve seen national convulsions, reconsiderations, political calculations and the yanking down of all things Confederate.\nIt’s a past-due reckoning — one heavy on symbolism while leaving racial disparities (in housing, education, criminal justice, etc.) untouched — so I haven’t troubled myself much with questions of overreach. Still, this thing with Bo and Luke Duke hits me in a funny-feelin’ place.\n[Bo Duke tweets Dylan Roof photo to protest after TV Land dumps “Dukes of Hazzard.” http://www.washingtonpost.com/news/morning-mix/wp/2015/07/02/bo-duke-tweets-photo-of-dylann-roof-in-protest-after-tv-land-dumps-dukes-of-hazzard/ ]\nI mean, really — cue the theme song, please — they was: “Just ’a good ol’ boys/Never meanin’ no harm/Beats all you never saw/Been in trouble with the law/Since the day they was born.”\nSure, today I could spot the layers of entrenched denial and white privilege in that Waylon Jennings ditty from outer space. (Briefly, permit me: Populate the song with black guys, give it a folksy edge and watch how that turns out: Sheriff, don’t shoot! Marquis was just funnin’ is all. And now you done kilt him! )\nBut in the late ‘70s and early ‘80s, post-Civil Rights Movement when racial alignments were still being recalibrated, we were all less self-aware. I was hitting puberty, and them Duke boys were the dreamy stuff of girlhood. It is part of pop culture’s deep impact on the psyche. I loved me some chivalrous country white boys in a muscle car, even one that sported the Rebel flag, which I kinda thought was bad, but the show was good.\nHere’s how that happens: In the late 1970s, I didn’t have to fully consider the flag as racist totemic and its implications for blacks because there were so few blacks on the show or on television — period. I was not old enough to see that the omission and the Confederate flag on General Lee were kissin’ cousins. With no black girls in sight, I was free to daydream and in my daydreams, Luke Duke wanted me, Lonnae, for hijinks. The older, dark-haired and more cerebral Duke cousin, he was perfect fodder for a pubescent crush.\nOther black folks strongly disagreed.\nThey liked Cousin Bo. Or the General Lee.\nA recent post on Facebook read: “Shoutout to every black Gen-X’er having mixed emotions about the ‘Dukes of Hazzard.’ My inner child been dead, so that helps. Hashtag: heritagenothate.”\n“Had a pull-back General Lee that could ride on its side or pop a wheelie if you put a nickel in the back. Still vaguely remember the moment where I was like ‘oh [expletive],’ ” one black guy responded.\n“Honestly I had NO idea who General Lee was or the flag. My parents weren’t tripping that it was on. It wasn’t until our elementary carnival gave out miniature confederate flags that I first remember a rumbling. I was still pretty clueless. I think this was still after ‘Roots.’ We were people of our time,” someone else posted.Karen Parker, a D.C. project management consultant, was clear. “No mixture here. The flag was just that. I can love the show and hate what was on the car . . . or the car’s name, for that matter,” she wrote. Later, she posted a picture of John Schneider, the blond, blue-eyed heartthrob who played Bo Duke. When I wrote that I’d reached out to Tom Wompat, the actor who played Luke, Parker asked — in all caps, hurt — why I hadn’t reached out to Bo.\n“Yes, I am a black woman, but I was also a young girl with young girl sorts of attentions,” she said. Watching the show, we compartmentalized, says Parker. “It was just television from where I was sitting. That sort of existence was as real as Narnia to me.”\nLast week, Schneider told the Hollywood Reporter that the show stood for values such as honesty, courage and rebelliousness and that the focus on the flag is misplaced. “I take exception to those who say that the flag on the General Lee should always be considered a symbol of racism. Is the flag used as such in other applications? Yes, but certainly not on the Dukes.”\nPart of me sees that argument. At least sees how Schneider could make it.\nRacism is so entrenched that it passes for normal. And that belief that we can decouple one of the most loaded symbols of violence in American history from its violent symbolism is part of our racial complexity. We can even feel kind of nostalgic about it.\nThat’s the nature of history that we’ve grappled with spasmodically over the centuries. Black people have a “double consciousness,” as W.E.B. DuBois called it in 1903. We see ourselves through white eyes as well as our own, so we just pick the parts of the culture that speak to us and tune out the rest.\nStraightnin’ the curves/Flatnin’ the hills/Someday the mountain might get ‘em/But the law never will , the “Dukes” theme song goes. I smile when I hear it. ’Tweren’t neither thing that got them yanked from TV Land. It was that history of blood, cruelty and denial emblazoned atop a star car such that no amount of revisionist history and nostalgia could conceal. No matter how many times them Duke boys, or the rest of us, waxed it.\nFor more by O’Neal, visit wapo.st/lonnae .", "external_links": ["http://time.com/3944399/dukes-of-hazzard-john-schneidertv-land/?xid=rss-topheadlines", "https://twitter.com/@lonnaeoneal", "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/192903667&color=ff5500&auto_play=false&hide_related=true&show_comments=false&show_user=false&show_reposts=false", "http://wapo.st/lonnae"], "published": "2015-07-02T03:00:00.000+03:00", "crawled": "2015-07-03T02:51:28.000+03:00", "highlightTitle": ""}