{"organizations": [], "uuid": "1b08dac258b28d47be9fb84f3b411839d17acbfa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/6638fd1e-2fde-11e5-8913-4ebf8765dfab-1200x1200.jpg", "site_section": "http://seattletimes.com/rss/travelwise.xml", "section_title": "The Seattle Times » Sections » Travel", "url": "http://www.seattletimes.com/life/travel/visiting-greece-delay-or-go-amid-ongoing-economic-drama/", "country": "US", "title": "Visiting Greece: Delay or go amid ongoing economic drama?", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Visiting Greece: Delay or go amid ongoing economic drama?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T22:39:00.000+03:00", "replies_count": 0, "uuid": "1b08dac258b28d47be9fb84f3b411839d17acbfa"}, "author": "Christopher Elliott", "url": "http://www.seattletimes.com/life/travel/visiting-greece-delay-or-go-amid-ongoing-economic-drama/", "ord_in_thread": 0, "title": "Visiting Greece: Delay or go amid ongoing economic drama?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New California-owned fleet stirs the food-truck pot in Seattle area \n“Despite what we’ve read — that tourists can still use credit cards, that they are not affected by this dreadful situation — we became concerned that this is not the summer to go to Greece,” he says. “There is no way of knowing if things will get worse.” \nThe way he sees it, he could have pressed on with his plans to visit Athens, Hydra and Santorini, but he would have had to bring more cash to deal with the ATM issue. Mathews feared that might make him a robbery target. He’s waiting for the situation to calm down before rescheduling. \nEmmer, an American who owns a medical device company and lives in Lithuania, sent me a note shortly before boarding a flight for Athens. His vacation in Chania, on Crete, started three days after the referendum. Emmer visits Greece every summer and speaks the language. \n“This year, of course, we are a bit nervous about the situation,” he says. “We will be taking sufficient cash, so we will not have to depend on ATMs. I’m mostly worried about the possibility of strikes, because that is a frequent problem in Greece. Otherwise, I’m certain everything will be fine.” \nBut will it? This summer, the answer is: maybe. \n“It is important to note that Greece remains safe, warm and welcoming,” says Mina Agnos, the president of Travelive, a Bloomfield, N.J., tour operator specializing in that country. The tourism infrastructure is unaffected and the economic problems are “not being felt” by visitors, she says. \nThat’s particularly true of the Greek islands, where many summer tourists go, she adds. “There are no demonstrations on the islands. ATM lines are no longer than the ones in cities like New York or Washington, and there is no shortage of supplies, food — or wonderful experiences.” \nVisitors who were on the ground when the crisis worsened tell a different story. John Rampton is a technology entrepreneur based in Palo Alto, Calif., and he was in Athens when news of a possible Greek default sent shock waves through the global economy. \n“I got out the next day,” he says. “Problem is, no business would take my credit cards. Literally, the day it happened they only accepted cash.” \nHe ended up giving his iPad to a cabdriver in exchange for a ride to the airport. \n“I didn’t want to be stuck in the country,” he says. Bring extra euros or prepay \nThrough the end of the summer, several issues will loom large in Greece. Perhaps the largest is financial. \n“Many travelers may find themselves unable to use credit cards at hotels and restaurants, or even withdraw money from ATM machines,” warns Jason Steele, a credit card expert for CompareCards.com, a credit card resource website. \nHe says the worries are justified, and he advises bringing extra euros, which he acknowledges can be both inconvenient and risky. The workaround? Prepay for as much of your vacation as possible before you leave — for example, by taking a tour that allows you to pay in advance for special excursions or meals. \nAlthough Greece should remain relatively safe for tourists, security experts say you’ll need to take some additional precautions. In past summers, for example, you might have skipped signing up for the State Department’s STEP, or Smart Traveler Enrollment Program, which lets the government track visitors and notify them if a country becomes dangerous. This year, with the potential for demonstrations and civil unrest, you’ll want to participate in STEP. The online form can be found at step.state.gov . \n“Even though there is a potential for increased security risk for travelers to Greece, there are some precautions they can take to mitigate those risks,” says Bill Hargenrader, a security expert for the consulting firm Booz Allen Hamilton. \nHis tip: Buy a paper map of the cities you’ll be traveling to and mark the locations of your hotel, police stations, hospitals and the American embassy or consulate on the map. Why a paper map? Because cellphones run out of power, and if there are wireless service disruptions related to the turmoil, you could get lost. \nIt may, or may not, be necessary. Emmer, who decided to stick with his plans to vacation in Greece, reported back to me late last week from Crete. “The beautiful port area is bustling, crowded with tourists as well as locals,” he said. “The tavernas, shops and streets are full. There is no sign of crisis whatsoever.” \nThe long-term outlook for Greece may be a lot better than the short-term one. If Greece leaves the euro, the common European currency, the country could suddenly become a real bargain. Last week, tourists fondly remembered other currency devaluations, such as Argentina’s 12 years ago, when the dollar surged, giving them an inordinate amount of purchasing power. \n“I’m fairly optimistic,” says Nikolas Langes, the co-founder of a technology company based in Cologne, Germany. “Prices are likely to drop in the future, so tourists will continue visiting Greece if it is safe to do so.” \nIn other words, there are good reasons to keep your vacation plans to Greece, and good reasons to break them. But don’t overlook Greece next summer. It could be a real deal. Christopher Elliott", "external_links": [], "published": "2015-07-21T22:39:00.000+03:00", "crawled": "2015-07-21T23:18:15.075+03:00", "highlightTitle": ""}