{"organizations": [], "uuid": "697b44defebf602a00ee3251a566a20a046e8035", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theguardian.com", "main_image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2015/7/23/1437629988233/5359017c-8edf-437b-b634-e256ba16e7c0-2060x1236.jpeg", "site_section": "http://www.theguardian.com/travel/all", "section_title": "Travel | The Guardian", "url": "http://www.theguardian.com/travel/2015/jul/24/camping-on-top-of-a-shopping-centre-st-jeromes-rooftop-hotel-reviewed", "country": "GB", "title": "Camping on top of a shopping centre: St Jerome's rooftop hotel reviewed | Travel", "performance_score": 0, "site": "theguardian.com", "participants_count": 1, "title_full": "Camping on top of a shopping centre: St Jerome's rooftop hotel reviewed | Travel | The Guardian", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T11:47:00.000+03:00", "replies_count": 0, "uuid": "697b44defebf602a00ee3251a566a20a046e8035"}, "author": "Brigid Delaney", "url": "http://www.theguardian.com/travel/2015/jul/24/camping-on-top-of-a-shopping-centre-st-jeromes-rooftop-hotel-reviewed", "ord_in_thread": 0, "title": "Camping on top of a shopping centre: St Jerome's rooftop hotel reviewed | Travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "K itsch dessert Baked Alaska essentially works like this – a frozen blob of ice cream is baked with a blowtorch. Now imagine you are the Baked Alaska, in reverse. This is what spending the night on the roof of Melbourne Central shopping centre is like.\nIt’s the night of winter solstice and around 7C. I am FREEZING on my front half (my head is also really, really cold) but my electric blanket is raging, baking my back half on the HIGH setting.\nRelated: Drinking with altitude: Melbourne's best rooftop bars\nSleeping on the roof of Melbourne Central is a confusing experience. It’s like being on a really cool rooftop bar with only your friends (the bar on the roof is not open to the public) but then, instead of leaving the bar with everyone, you stay on the roof – all night.\nSt Jerome’s Hotel is a temporary hotel on top of Melbourne Central, with “rooms” starting from around $330 a night – about the price of a five-star hotel. To get to the hotel, you go up to the third floor of the shopping centre, then through a pair of doors which lead to the roof. Camp is 20 tents (some with outdoor patios), portable bathrooms and a general store. It’s all a bit surreal.\nAfter the bar stools at the general store have been packed away, you change into a robe and (rather self-consciously) walk across the astroturf with your toothbrush to the portable bathroom.\nUp high on the rooftop, you feel so close to the LCD billboard on a nearby building, showing on rote a Hemsworth brother Foxtel promo, that you could reach out and touch him. There is also the competing, terrible compulsion to go right to the end of the roof and jump like the Michael Keaton character in Birdman. But then you remember there are snacks in your tent.\nYou brush your teeth in the heated port-a-loos on the edge on the roof, crawl into your tent and think this is weird … I am still yet to leave this bar. It’s like Night at the Museum – but instead it’s Night at the Rooftop Bar.\nFacebook Twitter Pinterest It’s so cold! Brigid Delaney inside her luxury tent. Photograph: Tom Dobson/The Guardian. Brrrr … it’s cold.\nYou remember that tonight is also the charity fundraiser CEO Sleepout , where politicians and business leaders sleep outside, and that whatever you are feeling, Malcolm Turnbull is also feeling (except the tent here costs $300 a night) and that makes you feel close to him in a way you haven’t felt close to him before.\nMalcolm. Malcolm. Malcolm is cold too, you think, as you pull on your hiking socks and do up your hoodies over your pyjamas.\nYour tent is decked out as if you’re Boss Bedouin. As well as the snacks (and cold drinks in an esky) there’s a wicker basket at the end of the (very comfortable) bed, an iPad and a selection of books. Throw-rugs decorate the tent floor. There are ottomans, gumboots and complimentary thongs.\nBut despite the luxe touches, there’s a bit of a New York in the 70s vibe up here. Sirens wail and wail and wail all night from Elizabeth street, which is not annoying but thrilling because YOU ARE SPENDING THE NIGHT ON A ROOF IN THE CITY IN A TENT.\nThere’s also a 24-hour concierge – a very sweet American woman who is sipping from a jumbo cup of Starbucks at her desk, which is near Strike bowling alley, which seems like a very desolate place to spend the hours between 1am and 6am. But there she is in the morning, dropping breakfast boxes with salmon bagels at the “doors” of our tents.\nFacebook Twitter Pinterest The General Store at night, which doubles as a bar at St Jerome’s. Photograph: Lauren Bamford/Supplied You can barely sleep on the roof. It’s not restful. There’s the weather, and the noise and light – but also the excitement. It’s exhilarating seeing the dawn come up over the tops of Melbourne’s high rises. The sort of indescribable satisfied feeling that campers must feel when they wake up in the bush is now something urban people can experience. Instead of feeling excited about all the nature on your doorstep (the gumtrees, the morning magpies, the fire and the morning billy-tea) for the urban camper there’s the cafes, the shops (hundreds of them below you in Melbourne Central shopping centre) and the clanging of tram bells.\nUntil a couple of months ago, before local entertainment enterpeneur Jerome Borazio co-opted the 2,200 sq m rooftop space and turned it into a hotel, it was empty. At this stage the hotel is still being talked about as a pop-up, with plans for it to run at least until November.\nIt will be interesting to see how the space that has little shade deals at the height of a Melbourne summer, but then, isn’t that what camping is all about? You brave the elements, whatever they may be, because the experience is worth it.\nFacebook Twitter Pinterest Good morning from St Jerome’s – The Hotel. Photograph: Lauren Bamford/Supplied. Tent accommodation at St Jerome’s – The Hotel, from $330 per night. Level 3, Melbourne Central, 271 Little Lonsdale St, Melbourne. Phone 0412 951815\nstjeromesthehotel.com.au .\nThe writer was a guest of St Jerome’s – The Hotel.", "external_links": ["https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4aqpa%2Fsfb%23img-4&ref=responsive", "http://www.pinterest.com/pin/create/button/?description=Camping+on+top+of+a+shopping+centre%3A+St+Jerome%27s+rooftop+hotel+reviewed&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Fjul%2F24%2Fcamping-on-top-of-a-shopping-centre-st-jeromes-rooftop-hotel-reviewed&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F23%2F1437630784390%2Ff0c7062c-403e-4158-a757-dd14b3605fd3-2060x1236.jpeg", "https://www.ceosleepout.org.au/", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4aqpa%2Fsfb%23img-3&ref=responsive", "https://www.facebook.com/sharer/sharer.php?u=http%3A%2F%2Fgu.com%2Fp%2F4aqpa%2Fsfb%23img-2&ref=responsive", "https://twitter.com/intent/tweet?text=Camping+on+top+of+a+shopping+centre%3A+St+Jerome%27s+rooftop+hotel+reviewed&url=http%3A%2F%2Fgu.com%2Fp%2F4aqpa%2Fstw%23img-2", "https://twitter.com/intent/tweet?text=Camping+on+top+of+a+shopping+centre%3A+St+Jerome%27s+rooftop+hotel+reviewed&url=http%3A%2F%2Fgu.com%2Fp%2F4aqpa%2Fstw%23img-3", "https://twitter.com/intent/tweet?text=Camping+on+top+of+a+shopping+centre%3A+St+Jerome%27s+rooftop+hotel+reviewed&url=http%3A%2F%2Fgu.com%2Fp%2F4aqpa%2Fstw%23img-4", "http://www.pinterest.com/pin/create/button/?description=Camping+on+top+of+a+shopping+centre%3A+St+Jerome%27s+rooftop+hotel+reviewed&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Fjul%2F24%2Fcamping-on-top-of-a-shopping-centre-st-jeromes-rooftop-hotel-reviewed&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F23%2F1437631164280%2F42a8ded0-8019-4b99-995d-4083a7bb2888-1020x612.jpeg", "http://www.afr.com/lifestyle/travel/fivestar-camping-in-the-city-20150525-gh22vi", "http://www.pinterest.com/pin/create/button/?description=Camping+on+top+of+a+shopping+centre%3A+St+Jerome%27s+rooftop+hotel+reviewed&url=http%3A%2F%2Fwww.theguardian.com%2Ftravel%2F2015%2Fjul%2F24%2Fcamping-on-top-of-a-shopping-centre-st-jeromes-rooftop-hotel-reviewed&media=http%3A%2F%2Fstatic.guim.co.uk%2Fsys-images%2FGuardian%2FPix%2Fpictures%2F2015%2F7%2F23%2F1437624351623%2Fde73f362-19f2-43d1-bc36-e183fd892cfa-2060x1236.jpeg"], "published": "2015-07-24T11:47:00.000+03:00", "crawled": "2015-07-24T06:29:46.767+03:00", "highlightTitle": ""}