{"organizations": [], "uuid": "da1266ccea34f3248446d7ef621ccc5814758d42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/mexico-struggles-to-clean-up-surge-of-seaweed-washing-onto-beaches-around-cancun-resort-318740451.html", "country": "US", "title": "Mexico struggles to clean up surge of seaweed washing onto beaches around Cancun resort", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Mexico struggles to clean up surge of seaweed washing onto beaches around Cancun resort - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T01:40:00.000+03:00", "replies_count": 0, "uuid": "da1266ccea34f3248446d7ef621ccc5814758d42"}, "author": "The Associated Press", "url": "http://www.winnipegfreepress.com/travel/mexico-struggles-to-clean-up-surge-of-seaweed-washing-onto-beaches-around-cancun-resort-318740451.html", "ord_in_thread": 0, "title": "Mexico struggles to clean up surge of seaweed washing onto beaches around Cancun resort", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY - Authorities on Mexico's Caribbean coast said Monday they are redoubling efforts to remove tons of sargassum seaweed that has been washing ashore in recent weeks.\nThe state government of Quintana Roo, where the resort of Cancun is located, said there have been no reports of tourists cancelling visits because of the problem.\nGov. Roberto Borge said the seaweed removal efforts will focus on much of the coast, from Holbox in the north down past Tulum to the south.\nPhotos issued by the Cancun city government show piles of brown seaweed on some normally pristine white beaches. By last week, the city said it had raked or shovelled up 500 cubic meters of sargassum.\nBorge said the cause of the invasion is still unknown, though it could be due to high levels of nutrients in ocean water or changes in ocean temperatures, currents or wind patterns.\nAuthorities have to be careful, because there are two groups of visitors they don't want to disturb with overly aggressive removal efforts: nesting sea turtles that return to the Caribbean beaches to lay their eggs, and tourists.\nBorge said the effort would take care not to cause erosion on the beaches, which has been a problem in Cancun in the past.\nThe government announced the formation of a task force of naval and environmental authorities to study the problem. Authorities are also researching ways to use or dispose of the seaweed mounds.\nSargassum is an algae that grows in the Sargasso Sea, a large body of warm water in the mid-Atlantic.\nOfficials in the Caribbean island of Barbados have also struggled with seaweed washing ashore, and large piles of sargassum washed up on the shore in Galveston, Texas, in 2014 after drifting into the Gulf of Mexico.\n ", "external_links": [], "published": "2015-07-28T01:40:00.000+03:00", "crawled": "2015-07-28T09:45:26.763+03:00", "highlightTitle": ""}