{"organizations": [], "uuid": "58e5c50d379ea022b13f06590f01025dbcc8a2d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03361/Spain-GettyImages-_3361064a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-03.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/brittany-ferries-winter-sun/11711427/winter-sun-holidays.html", "country": "US", "title": "Winter sun holidays", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Winter sun holidays - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T00:51:00.000+03:00", "replies_count": 0, "uuid": "58e5c50d379ea022b13f06590f01025dbcc8a2d7"}, "author": "Stephen Donohue", "url": "http://www.telegraph.co.uk/sponsored/travel/brittany-ferries-winter-sun/11711427/winter-sun-holidays.html", "ord_in_thread": 0, "title": "Winter sun holidays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More winter sun destinations» Summer may have finally made an appearance, but with the year’s longest day already behind us, all too soon we’ll be staring at the long winter ahead. If you have the time, however, there are enticing options to escape the gloom by heading south – to Spain, Portugal or the French Riviera – that are brilliant value for money. Brittany Ferries has put together extended winter sun holidays that have so many plus points, it’s difficult to find a reason to stay at home. You can load up your car with golf clubs, hiking boots, your favourite breakfast cereal and even Fido, if he has a pet passport. Heading to France? Then hop on one of the frequent ferries sailing from Portsmouth, Poole or Plymouth to Le Havre, Caen, Cherbourg, St Malo or Roscoff. Alternatively, for the longer journey to Spain, set off on a one-night mini-cruise from Portsmouth or Plymouth to Santander or Bilbao, with your own cabin and great eating and entertainment on board. After driving down to Spain or Portugal, where the winter is mild and the days are often sunnier, you’ll settle into a comfy, fully equipped apartment for a four-week stay (longer and shorter breaks are available too). The chilly UK drizzle will soon be a distant memory. Beautiful beaches and scenery: escape and find the winter warmth in either Spain, Portugal or France You could spend those 28 days exploring picturesque villages, walking through green countryside, keeping your handicap low on the golf course, and trying the local wines and seafood. On the warmest days, the beaches will beckon. Sounds like a dream? These holidays are available from just £539pp – and that price even includes your utilities bills and regular housekeeping. Add in the favourable exchange rate and the lower cost of living in Iberia, and it really could be as cheap as staying in the grey UK. Stay in style and comfort Brittany Ferries has worked with partners in Spain, Portugal and France for many years, so the accommodation has been carefully chosen and the quality will always be high. The apartments have good access to shops, restaurants and local attractions, along with great facilities on site. There are outstanding choices on the Costa del Sol, Costa Blanca, the Algarve and a new location on the Côte d’Azur. In the low season, you’ll find the roads quiet, the resorts uncrowded and the temperature ideal for either exploring or relaxing. Yet most shops, restaurants and bars stay open throughout the year. Should you wish to break your journey south, Brittany Ferries can arrange hotel stays for extra convenience. In fact, you could even choose to stay at one or more of Spain’s luxurious Paradores or Portuguese Pousadas and the journey will become very much part of your holiday. These hotels are created out of magnificent historic buildings such as castles and monasteries, or are in spectacular natural settings. All have restaurants that serve regional cuisine. If you’ve retired (and maybe sneaked a little cash out of that pension fund), or you can work away from an office, a four-week winter sun holiday with Brittany Ferries makes so much sense – especially at a price that works out from just £135pp per week. View Brittany Ferries’ full range of Spanish hotels here To book, call the friendly reservations team on 0871 244 0633 (9am to 5.30pm; calls cst 13p per minute plus network extras) or request a call back online", "external_links": [], "published": "2015-07-04T00:51:00.000+03:00", "crawled": "2015-07-03T20:13:42.000+03:00", "highlightTitle": ""}