{"organizations": [], "uuid": "722a2df1ea5707ca062d7bb1a9dc5b0138cc08e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thenewstribune.com", "main_image": "http://www.thenewstribune.com/mistatic/images/facebook/NewsTribuneOnline.jpg", "site_section": "http://www.thenewstribune.com/164/index.rss", "section_title": "The News Tribune -- Travel", "url": "http://www.thenewstribune.com/welcome_page/?shf=/2015/07/15/3915918_bucket-list-adventure-enter-twin.html", "country": "US", "title": "Digital Savant: Should we heed the warnings of movies such as 'Terminator Genisys' and the TV show 'Humans'?", "performance_score": 0, "site": "thenewstribune.com", "participants_count": 0, "title_full": "Digital Savant: Should we heed the warnings of movies such as 'Terminator Genisys' and the TV show 'Humans'?", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T11:00:00.000+03:00", "replies_count": 0, "uuid": "722a2df1ea5707ca062d7bb1a9dc5b0138cc08e0"}, "author": "", "url": "http://www.thenewstribune.com/welcome_page/?shf=/2015/07/15/3915918_bucket-list-adventure-enter-twin.html", "ord_in_thread": 0, "title": "Digital Savant: Should we heed the warnings of movies such as 'Terminator Genisys' and the TV show 'Humans'?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Order a reprint of this story \nRemember, in 1984, when a scary robot from the future told us he'd be back? \nHe IS back, fronting the lunkheaded summer blockbuster \"Terminator Genisys,\" in which former California Gov. Arnold Schwarzenegger returns as young, middle-aged and Cialis-aged versions of the skin-on-metal synthetic life form once programmed to kill. \nBut this time, 30 years on, we're ready for him. The idea that robots will one day take over our jobs, our households, even our driving, no longer seems so sinister or remote. In fact, for many of us, it sounds great. Who wouldn't rather lean back and read an e-book than keep eyes on a congested interstate? We're now cloud-dwelling information-agers. Why not let the higher machine power take over? \nLast week, when on the same day United Airlines, the Wall Street Journal and the New York Stock Exchange were stalled by computer glitches, one analyst from the research firm Gartner seemed ready to throw in the towel on human brainpower. \n\"Our best hope may be that computers eventually will become smart enough to maintain themselves,\" said Avivah Litan in an Associated Press story. \nOur resignation and anxieties about artificial intelligence, especially the kind of AI that could eventually outsmart us, is permeating pop culture this summer. \nIn the \"Terminator\" movies, robots are either stone-cold killers determined to wipe out humans or they've been programmed to save us, mostly through blowing up other robots and trying to smile convincingly to assure us they are friendly. It never occurs to anyone in the \"Terminator\" films that a benevolent robot might be better at hacking the system by writing some decent pro-human computer code than toting shotguns and giant magnets in a futile fight against advanced robot models. \nIf the robots in \"Terminator\" are big metal hunks of stock character, the artificially intelligent beings in \"Ex-Machina\" are much more complex, though no less disturbing. \nAva, an alluring robot who has skin that appears human covering only parts of her sleek anatomy, is programmed to have emotions, to flirt, to be interesting and scared and sad. \nOr is she a well-programmed mimic? \nWithout giving the clever low-budget film's twists away, it can be said that though the film returns to robot tropes of old_ the compliant female robot companion, and the egocentric master inventor - our curiosity is piqued most by the question that's haunted us since we began anthropomorphizing objects around us: Can robots feel? Can they gain sentience? In other words, can we make robots that are more perfect humans? And why would they want us around if they existed? \nThe summer's most nuanced portrayal of our funky relationship with evolving AI may be \"Humans,\" a surprisingly thoughtful British import airing on AMC for eight episodes. In the show - not to be confused with USA's \"Mr. Robot,\" which is about hackers, not robots - convincingly life-like robots live among citizens of England as cooks, nannies, prostitutes and elder health care professionals, among other professions. \nThe people on the show have for the most part accepted robots as necessary stress-relievers and job-doers. Some, such as a sullen teen on the show, fret that there's no point in studying and achieving when a robot can be programmed as a top surgeon. In one compelling scene, a stressed-out mom is told by her young daughter that she'd rather hear a bedtime story from helper droid Anita than from Mom. \"She doesn't rush,\" the little girl says. The mother is far from thrilled. \n\"Humans\" is like a less-depressing version of the British hit anthology series \"Black Mirror,\" which treats technology as an alluring trap that will always be subject to a nightmarish worst-case scenario. \nArt Markman, a University of Texas professor of psychology who edits the journal Cognitive Science, says that over time, we've gotten more used to the idea of yielding control to computer systems, but when it comes to the idea of robots made to resemble us, we are bothered by factors we might not even be aware of. \nFor instance, the \"uncanny valley\" is the scientific theory that \"as things get more and more human-like, they get weirder for us until they're perfectly human,\" Markman said. \"We're set up to make all kinds of exquisite predictions about human behavior. When you have something that's off, it's not just off - it's off-putting.\" \nRobots that don't age or die also remind us of our own mortality, Markman said. \"The way we deal with this is clinging to the idea that though we ourselves may die, our culture may live on beyond us.\" If robots took over and didn't carry the same set of values, it's unlikely that the culture we treasure would be carried on in the same way. \nAnd lastly, we're pretty freaked out by \"the Singularity,\" the concept that machines will eventually become self-aware, self-sustaining and evolved beyond our species. \n\"The fear you see a lot in movies like the 'Terminator' films or 'The Matrix' is the point where the machines start programming themselves and undo whatever checks and balances put in by their human creators,\" Markman said. \nWould these future robots have much need for us? Would they value humanity the same way a human would? Why should they? \nIn the new \"Terminator\" movie, humanity is doomed by the Skynet global network of the previous film, but it's now being Trojan-horsed into the world's systems as \"Genisys,\" a mass-marketed operating system that promises to unify everybody's smartphones, tablets and computers, something Apple has struggled with of late with its iCloud online service. \nIn the near-future of \"Genisys,\" all the oblivious humans have their noses stuck in their phones and laptops and welcome Genisys as a life-changing, evolutionary computing step. Nobody in 2017, apparently, has learned the hard lesson that you should always wait a few days before a major software upgrade to try it out. See what happens, people? The Earth blows up and the robots take over. \nLikely scenario? Let's ask a computer scientist. Risto Miikkulainen specializes in neuroscience and \"biologically inspired computation.\" He says that while some advances, like self-driving cars, have happened faster than expected, Hollywood scaremongering about robots is unrealistic. \nThe kill-all-humans scenario, he says, is a \"very, very unlikely course of events.\" \n\"Smart machines are always designed and built to serve humans, and to augment human abilities,\" Miikkulainen said. \"Humans will be augmented with machines, and perhaps merge with them, but a situation where humans would want to replace humans is not a logical future scenario. \n\"In the very long-term future, it is of course possible that humans will become machines completely, but that will be a step in human evolution, on human terms, not an aggressive replacement of humans,\" he said. \nFeel better? \nPerhaps the biggest shift in pop culture's love affair with robots is that so little of it seems so far-fetched in an era when we can beam down maps practically anywhere on the planet and hear nearly every song ever recorded with the push of a few buttons. Artificial intelligence seems awfully real, and the fictional explorations of its morality and intent feel all the more compelling now. \nSays Markman, \"In my own experience this week, I was driving down the street and saw one of those Google self-driving cars. And this is the week I got one of those Amazon Echos. You talk to it and it does things for you,\" he said. \"I'm sort of feeling a 'future is now' moment.\" \n(Read more technology news on Omar L. Gallaga's blog at austin360.com/digitalsavant. Email him at ogallaga@statesman.com.)", "external_links": [], "published": "2015-07-15T11:00:00.000+03:00", "crawled": "2015-07-15T15:31:51.000+03:00", "highlightTitle": ""}