{"organizations": [], "uuid": "4a3b13fd1f944f90eb20203b7df28c61b59cb3bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/travel.html", "section_title": "Travel", "url": "https://www.prbuzz.com/travel/336752-elite-travel-accessories-giving-free-offer-for-new-product.html", "country": "US", "title": "Elite Travel Accessories Giving Free Offer For New Product", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Elite Travel Accessories Giving Free Offer For New Product", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a3b13fd1f944f90eb20203b7df28c61b59cb3bc"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/travel/336752-elite-travel-accessories-giving-free-offer-for-new-product.html", "ord_in_thread": 0, "title": "Elite Travel Accessories Giving Free Offer For New Product", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 13, 2015 - San Diego, CA -- Today Elite Travel Accessories announced the launch of a free promotion for their new travel dog bowl. In an effort to get honest feedback from their customer base they are giving away free dog bowls. This promotion is currently only offered with the bowls.\nElite Travel Accessories is a new start up company of travel gear in Southern California. They are focused on providing quality products and unique customer service. They offer companion coupons, free monthly give-aways, airline crew discounts and more which can be found on their website www.elitetravelaccessories.com.\nETA is utilizing the internet to launch and fulfill orders. They are contacting existing customers, sending out news articles and posting adds on Craigslist. All people taking advantage of this free promotion are required to have an Amazon account. ETA ships all products thru Amazon's distribution system leveraging the cost and speed at which they can fulfill orders, their return policy, and their online reputation.\nETA is excited for this launch because they believe their customers will end up loving this new addition to their line of accessories. They believe most of their feedback is going to be pictures of adventures from their customers. When asked, President Pat Herrington said, \"We think we have a dog bowl that is the right size, weight, and functionality that people are going to take everywhere. We are encouraging people to send us pictures and think our customers go on unique fun adventures. Even though this is our first pet accessory we already have plans for more in the near future. This promotion is exciting for us as we leap into the pet market.\"\nElite Travel Accessories is running this promotion thru the summer.\nAbout Elite Travel Accessoires\nElite Travel Accessories provides travel products for both domestic and international travelers. The company is based in San Diego and retails the products through Amazon online marketplace.\nContact\nPhil Hering\n847-807-9697\nThis email address is being protected from spambots. You need JavaScript enabled to view it.\nhttp://www.elitetravelaccessories.com", "external_links": ["http://www.amazon.com/gp/aag/main?ie=UTF8&asin=&isAmazonFulfilled=1&isCBA=&marketplaceID=ATVPDKIKX0DER&orderID=&seller=A3NGEAWXWDL62V&sshmPath=", "http://www.amazon.com/exec/obidos/ASIN/B00WS1J884"], "published": "2015-07-13T03:00:00.000+03:00", "crawled": "2015-07-14T11:59:25.000+03:00", "highlightTitle": ""}