{"organizations": [], "uuid": "77528c843e781003f7279d24568df4798a3801c8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources0.news.com.au/images/2015/07/18/1227447/095924-d178d1e0-2c54-11e5-a754-a63f13c4fffa.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/trav_top_stories_288.xml", "section_title": "NEWS.com.au | Travel | Top Stories", "url": "http://www.news.com.au/travel/travel-updates/the-hidden-costs-of-cheap-travel/story-e6frfq80-1227447099058?from=public_rss", "country": "IL", "title": "Bali a wake-up call for budget travellers", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Bali a wake-up call for budget travellers", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T14:00:00.000+03:00", "replies_count": 0, "uuid": "77528c843e781003f7279d24568df4798a3801c8"}, "author": "", "url": "http://www.news.com.au/travel/travel-updates/the-hidden-costs-of-cheap-travel/story-e6frfq80-1227447099058?from=public_rss", "ord_in_thread": 0, "title": "Bali a wake-up call for budget travellers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What are these? Hidden costs ... overseas holidays can cost more than you bargain for if you’re not careful. Source: Supplied \nDISCOUNT travel is raising the risk of a dream holiday becoming an expensive nightmare for Australians heading overseas. \nAs do-it-yourself holiday bookings boom through websites, budget airlines and new accommodation options, travel experts warn it has become easier to get slugged by unexpected costs such as excess baggage charges, inflexible no-frills airfares or being stranded overseas. \nTens of thousands of Australians were affected by the Bali volcanic ash cloud last week , many of them without travel insurance. \n“If ever you need justification for buying relatively inexpensive travel insurance, the volcanic ash cloud is a good example,” said Boomers Travel Insurance managing director Ian Jackson. \nA typical policy for 14 days in Bali — costing $100-$200 for a family or less than $80 for a single person — will pay for flight cancellations, extra accommodation, meals, injury, illness and other losses. \n“We tend to focus on medical emergency issues as being the primary reason for taking out travel insurance, but volcanic ash clouds seem to be a recurring theme in different parts of the world,” Mr Jackson said. Pays to be prepared ... the ash cloud from the Mount Raung volcano stranded many travellers to and from Bali. Picture: AFP PHOTO / WIDARSHA Source: AFP \nHe said Allianz Global Assistance, one of the travel insurance industry’s biggest players, had already received about 900 claim notifications ranging from Bali flight delays and cancellations to “extended stays for pets in catteries waiting for their owners to come home”. \nInsurance Council of Australia spokesman Campbell Fuller said research by the council’s understandinginsurance.com.au program had found that 20-25 per cent of Australians holidaying overseas did not take out travel insurance. \n“The ease of booking holidays and airfares online may be increasing the risk that other essential parts of a holiday are overlooked,” he said. \n“Traditionally, if you booked through a travel agent the travel agent would be likely to recommend you take out travel insurance. However, now that’s less common.” \nFlight Centre spokeswoman Kellie Carty said it was difficult for consumers to understand the confusing array of airfare deals, and many Bali travellers flying on no-frills fares had been left with few options last week. \n“Travel agents understand fare rules and conditions,” she said. A pretty boring way to spend holiday time ... last week’s flight delays left many stranded at airports. Picture: John Grainger Source: News Corp Australia \nOnline booking can offer travellers big savings but anyone choosing this option must read the fine print and understand the fees and rules around bookings and cancellations. \n“It’s so overwhelming for people because there is so much choice on the internet,” she said. \n“Understand what you are getting in terms of customer assistance and support. With travel agents you have 24-7 assistance but when booking direct the onus is on you to fix your own problems. \nMoney traps overseas are not limited to travel bookings and insurance. \nRecent research by the Commonwealth Bank found that nearly one-quarter of Australians who travelled overseas had experienced travel money mishaps, ranging from credit card theft or fraud to difficulties changing money. Delay doldrums ... passengers sit around the international terminal at Bali's Ngurah Rai airport in Denpasar waiting for flight information on July 10. Picture: AFP PHOTO / SONNY TUMBELAKA Source: AFP \nCBA’s executive general manager retail products and strategy, Angus Sullivan, said preparing financially for an overseas trip was at the bottom of the list of priorities for three out of four Australian travellers. \n“When you’re in an unfamiliar place, it’s better to be safe than sorry,” he said. \nMr Sullivan said travellers should take extra precautions, keep a close eye on their accounts and take a variety of payment options. “It’s always advisable to carry some local cash alongside your credit card and travel money card,” he said. Holiday from hell ... passengers queue at Ngurah airport in Denpasar on July 14. Picture: AFP PHOTO / SONNY TUMBELAKA Source: AFP \nBali is the second most popular overseas destination for Australian tourists, after New Zealand. \nFigures from the Department of Foreign Affairs and Trade show 48 Aussies lost their lives in Bali in 2013-14, about one death every eight days , while many more were admitted to hospital and 20 were arrested. Medical costs overseas can be massive. \n“There’s a tendency for people, when it is closer destinations, to not be quite as emphatic about taking out travel insurance,” Mr Jackson said. \nHe said travellers should beware that their insurance claims might be rejected if they were affected by alcohol or drugs at the time of the incident. “That’s a biggie, especially for younger adventure travellers,” he said. \nIn Bali last week some Australians tried to head home through other countries, but this could cause problems with their travel insurance policies, Mr Jackson said.", "external_links": [], "published": "2015-07-18T14:00:00.000+03:00", "crawled": "2015-07-18T16:36:42.000+03:00", "highlightTitle": ""}