{"organizations": [], "uuid": "406dc9821f73aedb28e1659d7215d97efc0a8f7f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03379/whale-donsol_3379739k.jpg", "site_section": "http://www.telegraph.co.uk/newsfeed/rss/travel_main.xml", "section_title": "Telegraph Travel", "url": "http://www.telegraph.co.uk/travel/safariandwildlifeholidays/11747219/Where-to-see-whale-sharks-around-the-world.html", "country": "CH", "title": "Where to see whale sharks around the world", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Where to see whale sharks around the world", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T10:00:00.000+03:00", "replies_count": 0, "uuid": "406dc9821f73aedb28e1659d7215d97efc0a8f7f"}, "author": "Andrew Purvis", "url": "http://www.telegraph.co.uk/travel/safariandwildlifeholidays/11747219/Where-to-see-whale-sharks-around-the-world.html", "ord_in_thread": 0, "title": "Where to see whale sharks around the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Safari and wildlife holidays Where to see whale sharks around the world The world's largest fish can be seen in all of the world's oceans - apart from the Mediterranean - at the right times of year Whale sharks congregate off Luzon island in the Philippines, particularly near Donsol Photo: AP By Andrew Purvis Comments \nThe world’s biggest fish is a global phenomenon, dispersed throughout all tropical and warm temperate seas except the Mediterranean (see map below) but with the largest aggregations in seven key areas. In these it is usually possible to snorkel with these gentle giants, and often to dive with them. \nUp to 1,000 congregate seasonally off the Yucatan Peninsula, Mexico – but as with other large groups, 70 per cent of them are male. Where do the females go? For years this remained a mystery, but satellite tracking suggests they migrate vast distances to mid-ocean sea mounts and remote islands where they give birth. One pregnant female, Rio Lady, is known to have set off from Brazil to Africa on a 4,800-mile trip. 1 The Pacific \nWhale sharks appear almost year-round in the Sea of Cortez, Mexico (see main story), and in the Galápagos Islands from May to October, peaking in July. Pregnant females gather at Darwin Island then head out into the Pacific Ocean. 2 The Caribbean \nThe best time for encounters off the Yucatan Peninsula, Mexico, is June to September, at Isla Holbox, Quintana Roo and Isla Mujeres. Off Belize, the spawning of red snapper from April to June attracts whale sharks hungry for their roe, notably to Gladden Spit, a protected area of the Belize Barrier Reef. 3 Mozambique \nWhale sharks migrate along the coast of East Africa from November through to March, with good sightings likely in the Bazaruto Archipelago and off Tofo Beach. 4 Arabian Gulf/ Horn of Africa \nGroups of up to 150 whale sharks have been observed from oil rigs off Qatar. From January to March they gather off Oman, particularly the Musandam Peninsula, and from October to February in the Gulf of Tadjoura, Djibouti. 5 Indian Ocean \nThe most reliable months in the Seychelles are July and August, sometimes December. To see whale sharks in the Maldives , try the western atolls are best during the South West monsoon (May-December) and the eastern atolls from December to April. 6 ­ Western Australia \nOn Ningaloo Reef, they are abundant from mid-March to mid-May, but are sometimes spotted as late as August. 7 South-east Asia \nWhale sharks congregate off Luzon island in the Philippines, particularly near the village of Donsol, from December through to May. Peak months are December and January, when currents bring plankton blooms close to shore.", "external_links": [], "published": "2015-07-18T10:00:00.000+03:00", "crawled": "2015-07-18T11:47:13.000+03:00", "highlightTitle": ""}