{"organizations": [], "uuid": "e0a28d3e545c75cb645b2d2830778f61a9194894", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61960/xenia-hotels-resorts-acquires-three-boutique-properties", "country": "US", "title": "Xenia Hotels & Resorts acquires three boutique properties", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Xenia Hotels & Resorts acquires three boutique properties", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T03:10:00.000+03:00", "replies_count": 0, "uuid": "e0a28d3e545c75cb645b2d2830778f61a9194894"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61960/xenia-hotels-resorts-acquires-three-boutique-properties", "ord_in_thread": 0, "title": "Xenia Hotels & Resorts acquires three boutique properties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Xenia Hotels & Resorts acquires three boutique properties Adv: \nJul 29, 2015 Adv: \nORLANDO, FL - Xenia Hotels & Resorts, Inc today announced that it has acquired the fee simple interests in three high-quality lifestyle boutique hotels for a combined purchase price of $245 million. The 84-room RiverPlace Hotel is located in downtown Portland, Oregon in a scenic riverfront location, directly adjacent to the popular Tom McCall Waterfront Park. The 97-room Canary Hotel is located in a prime location in downtown Santa Barbara, California. The 230-room Hotel Palomar is located within the heart of downtown Philadelphia's Center City District near Rittenhouse Square. The Company currently forecasts that the hotels will generate EBITDA of $7 to $8 million for the remainder of 2015 and $18.5 to $20.5 million in 2016. All three lifestyle hotels will continue to be managed by Kimpton Hotels & Restaurants (\"Kimpton\"). \n\"We are thrilled to have acquired the RiverPlace Hotel, the Canary Hotel and the Hotel Palomar, three luxury lifestyle boutique hotels located in high barrier to entry markets with diverse demand generators,\" said Marcel Verbaas, President and Chief Executive Officer of Xenia Hotels & Resorts. \"The acquisition of these distinctive hotels further exemplifies our strategy of continually enhancing our portfolio by investing in high-quality assets in major lodging markets and key leisure destinations.\" \n\"I am very pleased that we were able to execute on the opportunity to acquire three assets that are an excellent strategic fit, enhance our portfolio quality and are located in desirable lodging markets where we were not previously represented,\" Verbaas continued. \nThe three hotels have exhibited consistently strong operating results, as illustrated by the portfolio's average RevPAR of $224.59, comprised of average occupancy of 85.4% and an average daily rate of $262.93, during the trailing 12 months ending June 30, 2015. \nAdditionally, the portfolio has generated RevPAR growth of 10.1% year to date through June 30, 2015. \nThe RiverPlace Hotel in Portland, OR, features 84 guestrooms including 36 expansive suites and 10 riverfront 1 and 2 bedroom condominiums. Recently renovated, the RiverPlace has become the established market leader with its irreplaceable riverfront location. \nAdditionally, the hotel features the Three Degrees Waterfront Bar & Grill, a popular choice among guests and locals. Portland represents an attractive, diverse economy with a concentration of established corporate demand generators. With robust levels of corporate and tourist activity driving lodging demand, the Portland hotel market has continued to accelerate, as evidenced by the strong RevPAR growth of 11.7% in 2014 and 15.2% year to date through June 2015. \nThe Canary Hotel in Santa Barbara, CA, opened in 2005 and is a leading boutique lifestyle hotel in Santa Barbara. The hotel features 97 guestrooms including 23 suites. The Canary Hotel is the tallest and only full-service hotel in downtown Santa Barbara allowing the Hotel to offer unobstructed 360-degree views of Santa Barbara, the Santa Ynez Mountains, and the Pacific Ocean from the rooftop terrace and pool. The hotel recently underwent a $10 million capital investment to further position the property as a premier luxury boutique hotel allowing the property to consistently achieve high occupancy levels and rates, and continue to outperform its competitive set. The hotel's popular Finch & Fork Restaurant drives a high level of demand from both locals and hotel guests through a combination of culinary excellence and its prime location at the Corner of Chapala and Carrillo Streets amidst downtown Santa Barbara's primary commercial office, high-end retail, dining and cultural district. \nThe Hotel Palomar in Philadelphia, PA, opened in October 2009 after a comprehensive transformation and renovation of a former historic office building near the Rittenhouse Square area of downtown Philadelphia. The Hotel features 230 guest rooms including 36 suites. \nLocated in the heart of Philadelphia, the nation's fifth largest city, the Palomar is located one block from Philadelphia's high-end Walnut Street shopping, dining, and entertainment district. Lodging demand in Philadelphia is strong and diverse, being driven by corporate, leisure and convention business, backed by the recently completed $800 million expansion of the Pennsylvania Convention Center and substantial office space development in close proximity to the hotel. \nAll three hotels will continue to be managed by Kimpton, which has managed both the RiverPlace Hotel and the Canary Hotel since 2012, and the Hotel Palomar since its opening. In addition to these three hotels, Kimpton currently manages four other Xenia hotels, the Lorien Hotel in Alexandria, VA, and three Hotel Monaco properties in Chicago, IL, Denver, CO, and Salt Lake City, UT. \n'We are excited to expand our relationship with Kimpton Hotels & Restaurants,\" continued Mr. Verbaas. \"Kimpton's exemplary results have established the company as a leading choice for the management of high-quality boutique properties such as these three hotels. Our relationship with Kimpton gives us confidence that we will be able to achieve continued positive results and growth during our ownership of these hotels.\" \nThe Company funded the acquisitions with cash and its line of credit.", "external_links": [], "published": "2015-07-29T03:10:00.000+03:00", "crawled": "2015-07-29T03:33:29.167+03:00", "highlightTitle": ""}