{"organizations": [], "uuid": "b40d3c134393018a362fbc4318fa20cbd410b59a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150727164924-hugh-hefner-playboy-plane-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/07/28/travel/milehi-app-tinder-of-skies/index.html", "country": "US", "title": "An app that lets you hook up in the air?", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "An app that lets you hook up in the air? - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:18:00.000+03:00", "replies_count": 0, "uuid": "b40d3c134393018a362fbc4318fa20cbd410b59a"}, "author": "Matilda Egere-Cooper", "url": "http://edition.cnn.com/2015/07/28/travel/milehi-app-tinder-of-skies/index.html", "ord_in_thread": 0, "title": "An app that lets you hook up in the air?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) Solo travel can be a boring and lonesome enterprise. One new travel app to the market is hoping to change that. The saucily-named MileHi app is hoping to take some of the tedium out of the process by allowing fliers to meet-up (and possibly hook up) before, during and after the journey.\nFor a new kid on the market, the app is performing well. Within two weeks of its launch, it's already clocked up 3,000 downloads -- not least in part to its attention-grabbing name. Innuendos aside, Richard Lloyd, the app's founder insists it's not a Tinder for the Sky.\n\"MileHi is a very good name; it's very catchy,\" he says. \"Obviously it's got a connotation, but the idea of the app was really around business or networking, not dating.\"\nMileHi founder Richard Lloyd came up with the idea for the app when he was waiting to catch a flight from Marseille airport. Indeed, MileHi's functions can be used for a number of purposes. Passengers can chat via private messages or in a group forum, and can find and track each other via flight number (this differs to other social networking sites, that rely on GPS). Lloyd reckons this will be the key to its success, as the app can be used to scope out who's on specific flights, including your own.\n\"There's a huge global exhibition conference circuit that people go around,\" he says. \"There's also a lot of sporting events that this app could be relevant to, like when people are flying together to World Cup finals or European Cups. People can talk about sharing a taxi at the other end.\"\nCatering to a niche\nAdmittedly, social networking apps for jetsetters aren't new. Though many ( Planely , BTSocial and Facebelt, to name a few) launched onto the scene with the best of intentions only to ultimately fall into obscurity.\nPamela Clark-Dickson , a senior analyst at London tech firm Ovum , notes the market for location-based apps for travelers might be too niche to be sustainable.\n\"People already have apps that they're using in order to make those connections,\" she says. \"And then you have some people who don't necessarily want to be social when they're traveling.\"\nStill, it's early days for MileHi, and with 6,000 airlines on its database, Lloyd is already moving forward with plans to monetize it as he firmly believes he's onto a winner in catering to travelers.\n\"I don't think there's any bigger niche than the travel market, with all the numbers of people that do travel for all their differing reasons,\" he says. \"This is very much about a distinct group of people that are flying from the same place to the same destination. And that's really sort of what we're of honing in on.\"\nRead more: Flying on Goodyear's anti-gravity machine\nRead more: The rise of the silent airport", "external_links": ["https://twitter.com/pamelac_d", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722163224-richard-lloyd-milehi-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722163224-richard-lloyd-milehi-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722163224-richard-lloyd-milehi-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722163224-richard-lloyd-milehi-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722163224-richard-lloyd-milehi-large-169.jpg", "http://www.milehi.me/", "http://www.planely.com/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722163224-richard-lloyd-milehi-super-169.jpg", "http://www.ovum.com/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150722163224-richard-lloyd-milehi-exlarge-169.jpg"], "published": "2015-07-28T19:18:00.000+03:00", "crawled": "2015-07-28T20:41:52.162+03:00", "highlightTitle": ""}