{"organizations": [], "uuid": "66aa377779295d0af42de2410e994f7578b0a575", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-07/PR_507870012.jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094282117/Live-entertainment-performances-and-shows-at-Al-Montazah-during-Eid-Al-Fitr-celebrations?src=RSS", "country": "", "title": "Live entertainment performances and shows at Al Montazah during Eid Al Fitr celebrations", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Live entertainment performances and shows at Al Montazah during Eid Al Fitr celebrations | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "66aa377779295d0af42de2410e994f7578b0a575"}, "author": "Press", "url": "http://www.menafn.com/1094282117/Live-entertainment-performances-and-shows-at-Al-Montazah-during-Eid-Al-Fitr-celebrations?src=RSS", "ord_in_thread": 0, "title": "Live entertainment performances and shows at Al Montazah during Eid Al Fitr celebrations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) entertainment shows in celebration of Eid Al Fitr and bring joy to its visitors for four days starting from 17th until 20th of July.\n\nEid celebration programme include the Levitation Statues, with three 60-minute shows, performed by two acrobats who will amaze the crowds with their aerial stunts. The second act, the \"Living Statutes\", will be performed by two artists who will wow the crowds with their ability to act like living statues. The 20-minute acts will run four times a day. \n\nKhalid Ibrahim Al Qaseer, General Manager of Al Montazah, said: \"Eid Al Fitr is one of the most important celebrations of the year and is a special occasion to be celebrated with family and friends, and this is why we have put together a host of activities and entertainment shows that visitors from all nationalities and ages can enjoy.\" \n\n\"The Eid celebration programme has been designed to suit all family members, offering a very special four- day celebrations to mark this glorious occasion. Al Montazah is always keen on rolling out special celebration programmes during religious and national occasions to attract visitors and increase the footfall to the park during holidays,\" Al Qaseer added.\n\nEid celebration programme includes the \"Bubble Show\", three 20-minute performances that will take place on the first and third day of Eid Al Fitr, and the \"Stomp Drummers\" show, a 10- minute performance by five artists three times a day, which will take place on the second and fourth day of Eid. The celebrations will also include specially designed shows for family members and children to entertain visitors. \n\nAl Montazah “ Amusement and Water Park, formerly known as \"Al Jazeera Park\", is spread over an impressive 126 000 square metres, and offers thrilling water rides and a lavish leisure park, with new leisure amenities continuously being added to the park, Al Montazah is Sharjah's number one family destination. Al Montazah consists of two main sections; the Water Park which offers world-class facilities and water rides, and the Amusement Park that offers a variety of electronic games, it also includes kart racing, two mini football playgrounds, sports areas, and a venue for celebrating special occasions. The park's newest attraction, 'Al Montazah Adventures', consists of various games and obstacle courses that strengthen the body and mind. This series of outdoor activities, which caters to both sport novices and seasoned athletes alike, provides visitors with the opportunity to climb ropes, mount walls and cross trails, encouraging an exciting combination of teamwork and exploration.\n\nRecently, Al Montazah has won the Sharjah Tourism Excellence Award for 2014 as the best new tourist destination in the emirate in recognition of its world-class facilities and services, making it a unique tourist destination for families and tourists. \n\nAbout Al Montazah \nAl Montazah", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-16T09:56:27.000+03:00", "highlightTitle": ""}