{"organizations": [], "uuid": "3ca89e81e179ed6df73b8352a76520996665b470", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03351/surfing-newquay_3351139a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-22.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/why-not/11694111/best-beaches-for-surfing-uk.html", "country": "US", "title": "Britain’s six best beaches for surfing", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Britain’s six best beaches for surfing - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T22:07:00.000+03:00", "replies_count": 0, "uuid": "3ca89e81e179ed6df73b8352a76520996665b470"}, "author": "Felix Lowe", "url": "http://www.telegraph.co.uk/sponsored/why-not/11694111/best-beaches-for-surfing-uk.html", "ord_in_thread": 0, "title": "Britain’s six best beaches for surfing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "#WhyNot get moving by going surfing? Keanu Reeve's character, Johnny Utah, in the timeless classic Point Break is evidence that it is never too late to take up surfing. Most men can recall a moment in their (perhaps not so distant) past when they have dreamed of Bondi Beach, Malibu or Hawaii – usually to a Beach Boys soundtrack and with misplaced delusions of salty grandeur. But you need not travel to the four corners of the Earth to answer your Bodhi-esque calling – and we don't mean robbing banks. UK coastal waters are ideal for learning how to understand the ocean and its currents, rips, undertows and swells – a key mindset for any aspiring surfer. Once you’ve caught the surfing bug, you’ll want to explore all the waves Britain has to offer Just don't do a Johnny Utah and ignore the measured nuances of surfing etiquette – priceless if you want to avoid being punched in the face by a long-haired dude looking remarkably like the lead singer of the Red Hot Chili Peppers... There are numerous online guides on how to surf – including some cheesy videos on YouTube – but nothing beats simply being in the water. To get good on the waves it takes a lot of practice and an element of innate ability, so take some lessons and fine-tune those techniques. Not all of us are born to ride big waves but we can have a lot of fun trying. Once you’ve caught the surfing bug, you’ll want to start exploring all the waves Britain has to offer - so here are six of the best surfing areas in the UK. The British surfing season runs from autumn to spring, with consistent surf of 4-12ft (1.2-3.6m), and as high as 40ft at times. In summer the swells are much smaller. Luckily, that gives you plenty of time to watch those YouTube videos - and get yourself a decent wetsuit. Newquay, north Cornwall The spiritual centre of the UK surf scene, Fistral Beach is one of the most famous stretches of sand in the British Isles. West-facing and exposed to Atlantic swells, Fistral hosts numerous international competitions and guarantees waves all year round. Nearby \"ski resort on the sea\" Watergate Bay, with its two miles of golden sand surrounded by cliffs, caves and crystal-clear Gulf Stream waters, has equally reliable surf – and an outpost of Jamie Oliver's Fifteen restaurant. On the opposite, south, side of Newquay, Crantock offers a super longboard wave by the Gannel Estuary. Polzeath, north Cornwall David Cameron may go on holiday here but fortunately the Prime Minister is more of a bodyboard type of guy than a fully fledged surfer. An exposed beach and point break, old faithful Polzeath has fairly consistent surf that will take massive swells when conditions are right. If it is overcrowded or windy then head to nearby Harlyn Bay. Croyde Bay, north Devon The best performance wave in Devon is found at Croyde, where experienced shortboarders rule the roost on a reliable and challenging swell. If you are newer to surfing then visit less crowded Saunton Beach, a renowned longboard hangout. Also ideal for beginners is the sheltered Putsborough, where gentle Atlantic rollers combine with an endless expanse of gradual shelved sands. Cayton Bay, North Yorkshire Located just south of Scarborough, the quiet and unspoilt Cayton boasts excellent all-year surfing from three key locations – the Point (for more experienced surfers), Pump House (renowned for its fast wave) and Bunkers (with its world-class A-frame peaks) – and promises waves when everywhere else is flat. Further up the coast, Saltburn in Cleveland is a friendly surf area with a mellow beach break either side of the pier. The centre of the flourishing Geordie surf scene can be found at Longsands in Tynemouth. Gower Peninsula, South Wales With beach breaks rolling in along its three-mile length, Llangennith is the most popular surf spot in Wales – although you may have to paddle far out for the best waves and brave the notorious rips. Further west in Pembrokeshire, Freshwater West is a huge beach with one of the most notorious reef breaks in Wales. Thurso, north-east Scotland On the rugged Caithness coast, the northernmost town of the British Isles boasts one of Europe's best waves in the long, walling right-hander known as Thurso East. Described as \"pretty damned perfect\" by Hawaiian big-wave pro Love Hodel, the wave – and the Thurso surfing scene in general – should be tackled by experts only. ADVERTISEMENT The joy of movement Whether you’re pushing your body to its limits or just enjoying the great outdoors, trying new activities can sometimes lead to aches and pains. Voltarol relieves pain at its source and reduces inflammation, which speeds up recovery — so you can enjoy moving again. Visit www.voltarol.co.uk/keep-moving to find out how Voltarol can help you enjoy the freedom of movement in your life. Voltarol® Pain-eze emulgel® for the relief of pain and inflammation. Contains diclofenac diethylammonium. Always read the label.", "external_links": [], "published": "2015-07-22T22:07:00.000+03:00", "crawled": "2015-07-22T16:43:02.013+03:00", "highlightTitle": ""}