{"organizations": [], "uuid": "dca9a2793803aac140647cef76a3f6c4f9fb3f37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 12:08 a.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_SMITHSONIAN_AEROSPACE_INNOVATION_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "High-tech aerospace exhibit starts world tour at Smithsonian", "performance_score": 0, "site": "ap.org", "participants_count": 1, "title_full": "High-tech aerospace exhibit starts world tour at Smithsonian", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T07:04:00.000+03:00", "replies_count": 0, "uuid": "dca9a2793803aac140647cef76a3f6c4f9fb3f37"}, "author": "By BRETT ZONGKER", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_SMITHSONIAN_AEROSPACE_INNOVATION_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "High-tech aerospace exhibit starts world tour at Smithsonian", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Links Yesterday's Places WASHINGTON (AP) -- With space shuttles now housed in history museums, innovators in aerospace are thinking of newer, better ways humans could reach space. One idea: What about a space elevator? This real idea is one simulation that's part of a new high-tech interactive exhibition about the future of flight opening Aug. 1 at the Smithsonian's National Air and Space Museum. The exhibit also will serve as an important test case for new technologies to overhaul the popular museum with more interactives. Designers at Evergreen Exhibitions in San Antonio, Texas, have been developing the new exhibition \"Above and Beyond: The Ultimate Interactive Flight Exhibition\" with Boeing, NASA and the Smithsonian to explore new innovations and ideas. It uses immersive videos, simulations, virtual reality, touch-tables and a 180-degree theater experience to create a hands-on, immersive experience. Curators said it is more interactive technology than the Smithsonian has ever had in an aerospace exhibit. \"Above and Beyond\" will debut at one of the nation's most popular museums. The National Air and Space Museum draws nearly 7 million visitors each year on the National Mall. The exhibit runs until early January and then begins a worldwide tour through 2020. Stops will include museums in Dubai; St. Louis; Charleston, South Carolina; Riyadh, Saudi Arabia; London, Tokyo and Chicago. One exhibit capsule will simulate the idea of a space elevator with video screens surrounding visitors to give them the feel of rising above Earth. Researchers are developing such an idea to see if it's possible to create a real capsule that could crawl up a cord from the ground to the level of orbiting the Earth. The Smithsonian's Air and Space Museum is planning to overhaul all of its exhibit galleries in the coming years, and the temporary exhibit will help the museum test what works. Some current galleries date back to the museum's opening in 1976. The museum has mostly shied away from integrating much technology into its exhibits because the galleries receive heavy traffic, and technology tends to break down, said Roger Launius, the museum's associate director of collections and curatorial affairs. \"In the future as we're re-envisioning the museum, we're putting more and more of these kinds of things in, but this is sort of taking us to a level we haven't had,\" Launius said. \"One of the things we want to do is kind of test the technologies.\" Beyond the gee-whiz technology, the exhibit is rooted in the themes of how to fly higher, farther, faster and smarter to challenge visitors with the real problems of how to make space flight more efficient and less expensive, Launius said. Curators planning the museum's overhaul are also looking at how to use new technology to give visitors a better look at space history. The museum is considering a future simulation that could recreate what it was like to land on the moon during the Apollo era. John Tracy, the chief technology officer for Boeing, which is funding the \"Above and Beyond\" exhibit and part of the museum's overhaul, said the company wants to work with the museum to inspire the next generation of innovators. \"The aerospace workforce in general has a large demographic of baby boomers,\" he said. \"As they begin to retire, we need to make sure there's a generation prepared to take over.\" --- Above and Beyond Exhibition: http://aboveandbeyondexhibition.com/ --- Follow Brett Zongker on Twitter at https://twitter.com/DCArtBeat .", "external_links": [], "published": "2015-07-20T07:04:00.000+03:00", "crawled": "2015-07-20T07:10:59.189+03:00", "highlightTitle": ""}