{"organizations": [], "uuid": "a7a5b34babf5a0682af5f3425f2e53534d429f9d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/n/j/v/y/image.related.StuffLandscapeSixteenByNine.620x349.15njvh.png/1435962968565.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/usa/69963101/The-new-attractions-coming-to-Disney-World", "country": "AU", "title": "The new attractions coming to Disney World", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "The new attractions coming to Disney World", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T01:36:00.000+03:00", "replies_count": 0, "uuid": "a7a5b34babf5a0682af5f3425f2e53534d429f9d"}, "author": "Matt Mauney", "url": "http://www.stuff.co.nz/travel/destinations/usa/69963101/The-new-attractions-coming-to-Disney-World", "ord_in_thread": 0, "title": "The new attractions coming to Disney World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The new attractions coming to Disney World MATT MAUNEY Last updated 10:36, July 4 2015 Handout \nWalt Disney Imagineering in collaboration with filmmaker James Cameron and Lightstorm Entertainment is bringing to life the mythical world of Pandora, inspired by Avatar. It will open in 2017. \nAvatar, Frozen and Star Wars rides are coming to the Orlando theme park. We're going to start saving now... \nMany areas of Walt Disney World Resort spent months of 2014 and early 2015 under construction. \nConstruction of some kind is ongoing at all four theme parks and Downtown Disney, which is undergoing its largest expansion in history as it transforms into Disney Springs. Handout \nThe Avatar-inspired Pandora land featured in this concept art will be part of the largest expansion in Disney's Animal Kingdom history. \nAreas of Disney Springs, like The Landing, are nearly complete, while three other \"neighbourhoods\" which make up the new theme will be complete in 2016. The expansion will double the shopping, dining and entertainment experiences at Downtown Disney. Each of Disney's four theme parks have new attractions or expansions in the works, the largest of which is the Avatar- themed expansion coming to Disney's Animal Kingdom in 2017. \nHere's what's on tap for Walt Disney World in the coming months and years. \nREAD MOREComing to Walt Disney Handout \nWhen completed in 2016, Disney Springs will double the shopping, dining and entertainment experiences of Disney World, with an eclectic and contemporary mix from Disney and other noteworthy brands. \nWalt Disney Imagineering is teaming up with filmmaker James Cameron and Lightstorm Entertainment to bring Pandora - the moon featured in Avatar - to life. The land will be part of the largest expansion of Animal Kingdom since the park opened in 1998. According to reports, the land will feature a 3D ride where guests ride on the backs of banshees, along with a boat-based attraction. The land will feature Pandora's floating mountains and bioluminescent plants, along with shopping and dining options. \nThe expansion is part of Animal Kingdom's transition into a true full-day park. The park plans to extend hours on par with the other three parks and will debut a nighttime spectacular event called Rivers of Light. Coming to Epcot Frozen Ever After is heading to Epcot, replacing Maelstrom at the Norway pavilion. The slow boat ride attraction will feature scenes from the hit animated movie, including one where Elsa sings Let It Go . \nDisney plans to open the new attraction in early 2016. Handout \nPirates of the Caribbean in the Magic Kingdom at Walt Disney World Resort will be closed from May 11-Sept. 25, 2015, for refurbishment. \nSoarin', one of the park's most popular attractions, will receive an additional theatre and upgrades to its screen and projection system. \nThe attraction debuted at Epcot 10 years ago and still routinely sees wait times exceeding 90 minutes. \nComing to Hollywood Studios Like Soarin', one of the most popular attractions at Disney's Hollywood Studios is getting an update and expansion. Toy Story Midway Mania, a 3-D ride and arcade game combo attraction, will be getting an additional track in an effort to shorten wait times. The park recently debuted updates to The Great Movie Ride and is bringing back its Frozen Summer Fun Live! event that features a Frozen -themed parade, sing-along and more. The park has been in a transition for a while now. The American Idol Experience closed last year and the sorcerer's hat centrepiece of the park was removed earlier this year. Disney executives have also referenced more Star Wars attractions coming to the park, which would be a logical fit at Hollywood Studios with the existing Star Tours ride and its annual Star Wars Weekends event. Handout \nA rendering of Disney Springs, which will double the shopping, dining and entertainment experiences at Disney World. \nNothing official has been announced, however. \nComing to Magic Kingdom \nThe smallest changes are coming to Disney World's most popular theme park. The area known as \"the hub\" in front of Cinderella Castle continues to undergo improvements, including renovated walking paths and viewing areas for stage shows and nightly fireworks. Handout \nAn artist's imagining of the Pandora land coming to Disney World. \nDisney refers to the area as Central Plaza. \nAlso, new turrents are being added, flanking Cinderella Castle and expanding the royal look. \nThere are no plans for new attractions at Magic Kingdom, but the Pirates of the Caribbean ride is closed for refurbishment until Sept. 25. - MCT", "external_links": [], "published": "2015-07-04T01:36:00.000+03:00", "crawled": "2015-07-04T02:18:37.000+03:00", "highlightTitle": ""}