{"organizations": [], "uuid": "271c03968e79de231aa2f093dae25ecabcc88f65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/08/02/travel/02POLAND1/02POLAND1-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT &gt; Travel", "url": "http://www.nytimes.com/2015/08/02/travel/poland-jewish-heritage.html", "country": "US", "title": "In Poland, Searching for Jewish Heritage", "performance_score": 2, "site": "nytimes.com", "participants_count": 1, "title_full": "In Poland, Searching for Jewish Heritage - The New York Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T21:16:00.000+03:00", "replies_count": 0, "uuid": "271c03968e79de231aa2f093dae25ecabcc88f65"}, "author": "Joseph Berger", "url": "http://www.nytimes.com/2015/08/02/travel/poland-jewish-heritage.html", "ord_in_thread": 0, "title": "In Poland, Searching for Jewish Heritage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " When I was growing up, my mother filled me with visions of her hometown, Otwock in Poland, describing it as a kind of Brigadoon without actually using that American word.\nIt seemed like an enchanted spot graced by tall pine trees, lush lilac bushes and bracing air. In an era when anti-Semitic discrimination seemed laced into the national fabric, the Jews of Otwock managed to squeeze much sweetness out of their hardscrabble lives through timeless religious habits and the pleasures of a resort that attracted bourgeois vacationers and Hasidim.\nMy sister and I recently visited the town for the first time. It was lilac season and the pine trees were still tall, the air as bracing. But we found with palpable certainty that the Jews are all gone — there were 10,000 of them — and only a few traces are left of the touchstones of my mother’s girlhood.\nAll four synagogues, including those where her father was a cantor on Rosh Hashana and Yom Kippur, were destroyed by the Germans. The wooden “villa” where her family had a cramped apartment had been replaced by a retirement home for priests. Even the cemetery where her mother was buried when our mother was only 6 was an overgrown shambles of crooked, broken headstones.\nContinue reading the main story Slide Show In our father’s hometown, Borynya, across the border in Ukraine, we learned firsthand that we come from poor hill people — Berger means “mountain person” — who subsisted on farming and lumber from Carpathian spruces. We spoke to an 86-year-old woman who remembered when the sprawling village had 300 Jews; she even vaguely recalled the Bergers. But we understood more firmly how painful recounting the past must have been for our father, who lost his parents and six sisters to the Nazis. He not only did not speak about those sisters, he couldn’t even tell us how beautiful the Carpathian countryside was.\nOur parents’ hometowns had receded into a dim past. Nevertheless, we, like many others now making this particular kind of roots journey, were enriched by the trip because we discovered a new Poland. Jews, some of them impassioned American expatriates, have planted the seeds of a reviving community in Warsaw and Krakow, and an astonishing corps of Polish gentiles have made it their mission to rediscover a people that had been so entwined with their own. We met a dozen such trailblazers who enlightened us about Jewish remnants and helped us locate cemeteries and repurposed synagogues.\nI had seldom thought about actually visiting Poland, but after my mother’s death in 2009 my curiosity seemed aroused and so did that of my sister, Dr. Evelyn Hartman (my wife’s need for a family visit to Australia made the timing ideal).\nAdvertisement\nContinue reading the main story We started our trip in Warsaw, most of which was leveled in the September 1939 blitzkrieg and in the retaliations for 1943 and 1944 uprisings. The Poles have recreated, brick by brick, the picturesque Old Town, where we had lunch with Maria Bukowska, a Polish Mary Poppins who cared with such tenderness for my Alzheimer’s-ridden mother. At the elegant Literatka Cafe I confirmed that what I thought was Jewish food — an earthy mushroom soup and meat-filled ears of dough that I call kreplach and Poles call pirogi — is actually Polish food.\nMy mother, Rachel Golant Berger, lived in Warsaw from age 14, when her father sent her there to help put food on the table, until she was 20, when the Germans invaded in September 1939. In a memoir she hand-wrote in old age, she described the pleasures of shopping for shoes on chic Marszalkowska Street, attending Yiddish plays at the 2,000-seat Nowosci Theater, catching American movies, and savoring the cerebral hubbub at clubs for writers, socialists and Zionists.\nMarszalkowska Street has been rebuilt and is still a modish boulevard. But the clubs and theaters were destroyed.\nWhen the bombing began, my mother’s half-brother Simcha advised her to avoid basement shelters — they might collapse — and dodge with him through the city’s parks. My sister and I visited the two parks she named, Krasinski and Saxon Gardens, both throwbacks to a stately Warsaw past. Lilacs were in bloom, ducks paddled in a pond, lovers kissed on benches. It was hard to imagine the human corpses and horse carcasses my mother saw.\nWe looked for the market at Zelaznej Bramy (the Iron Gate), where her brother stumbled across an abandoned sack of prunes that fed them during the monthlong bombing. The market has been shifted, but it was bustling with stalls of fresh strawberries, sausages and flowers, a far cry from wartime and Communist-era austerity.\nPhoto The remains of hundreds of barracks where Jewish prisoners lived. Only the chimneys remained after the Nazis destroyed the barracks at the war’s end. Credit Daniel Rodrigues for The New York Times At the shelling’s tail end, my mother retreated to an aunt’s home at 26 Franciszkanska, closer to the Vistula River, on her brother’s theory that they would be nearer a source of water they could drink. My mother described the building’s terrified tenants huddled in a courtyard.\nMy sister and I saw a pleasant street where all the prewar buildings had been replaced by ascetic apartment blocks. There was no Number 26. What was left of the addresses we searched for was a four-story plain gray building at 16 Krasinaskiego where my parents and I, their infant son, lived in 1946 after returning to Poland from their wartime refuge in the Soviet Union.\nAdvertisement\nContinue reading the main story They stayed a few months, fleeing when news broke of the Kielce pogrom that left 42 Jews dead and making their way to the Allied displaced persons camps. Like tens of thousands of other Jews, they gave up on Poland.\nSo my mother’s Warsaw is no longer there, but we took time to enjoy contemporary Warsaw, which is a cosmopolitan city that can rival other European capitals in charm, intriguing shops and fine restaurants like Dawne Smaki on Nowe Swiat, where we ate pierogi while a woman played Chopin.\nAs important to us, it is a city that has made an effort to underscore its tragic Jewish past and rebuild. A New Yorker, Michael J. Schudrich, 60, is officially Poland’s chief rabbi and has reignited Sabbath services at the Nozyk Synagogue, a surviving classic, with financing by the Taube Foundation for Jewish Life and Culture .\nHelise Lieberman, another New Yorker, started a Jewish school 20 years ago with financing from the Ronald S. Lauder Foundation. It has 240 students, half of them non-Jewish. A modest community center has been set up by the American Jewish Joint Distribution Committee.\nMs. Lieberman, now director of Taube’s Warsaw office, pointed out bricks inlaid in sidewalks demarcating the Warsaw Ghetto’s wall and a monument to the Umschlagplatz (German for collection point), the square from which 300,000 Jews were shipped by freight cars to Treblinka. With muffled sorrow, we read the Yiddish names on an otherwise blank wall.\nAdvertisement\nContinue reading the main story Advertisement Advertisement\nContinue reading the main story The new Polin Museum, too, with its inventively illuminating survey of the thousand-year history of Poland’s Jews, seems a monument of atonement. As we entered, Jewish students from several countries stood outside singing “Hatikvah,” Israel’s national anthem.\nPhoto The author, right foreground, with his parents, Marcus and Rachel Berger, and his brother, Joshua, about 1949 when they lived in a displaced persons camp. On the ride southeast to Otwock, I could not help but recall that my mother walked 17 miles from Warsaw lugging the remainder of her prunes to make sure her father, Joshua Golant, a struggling Hebrew teacher, and the three small children still living at home, Esther, Chana and Shimele, were unharmed.\nJakub Lysiak, our resourceful guide, took us to where 17 Lesna Street, my mother’s childhood home, stood. On this country lane hacked out of the pine woods, there are still wooden houses in a gingerbread style known as Swidermajer after Otwock’s Swider River. But my mother’s address no longer exists.\nAt the priests’ residence we met the Rev. Jan Swierzewski, who informed us that an Otwock priest, the Rev. Ludwik Wolski, had been honored as “righteous” by Yad Vashem in Jerusalem for saving Jewish children by issuing baptismal certificates.\nAdvertisement\nContinue reading the main story The wooden public schoolhouse for Jewish children that my mother attended until seventh grade — Christian children had a separate one — was demolished years ago. The Cukiernia Lapaty bakery that provided a memorable torte of chocolate marzipan for her school’s graduates, is now a commercial building.\nAlmost all evidence of the presence of Jews has vanished. They were herded into a ghetto, starved and brutally beaten, the men humiliated by having beards cut off. Most were sent to Treblinka, among them very likely (my mother never knew for certain) my grandfather and his family.\nTwo spots are still suffused with memory. Hidden deep in a wood is the tumbledown cemetery. We spent an hour looking for the gravestone of my grandmother before giving up. Another is a small but ambitious museum that contains artifacts from Otwock’s Jewish heyday found in houses where Jews had lived: a High Holy Days prayer book, a white Yom Kippur robe, a letter from a Zionist organization.\nWe asked the museum’s director, Sebastian Rakowski, why he was interested in preserving Jewish traces, and he replied that he could not allow Jews to disappear from the town’s collective memory. His own mother was born in 1944 “and she didn’t know there were Jews in Otwock.”\nThere was one other spot where for my sister and me ghosts walked: the venerable Otwock train station with its bold clock tower. After the war, my mother returned to search for relatives. At that station, someone told her the Jews had all been slaughtered. She never left the platform and took the next train back to Warsaw.\nPhoto At Auschwitz, an old water tank, part of the sewage system. Credit Daniel Rodrigues for The New York Times Between two visits to Otwock, we traveled to Treblinka. It is a haunted place because nothing of the death camp remains, though a tiny museum has a model camp that explains how speedily all of its 900,000 victims were dispatched in gas chambers. What has taken the place of the actual camp resembles a kind of Stonehenge, a field of stone markers arrayed almost higgledy-piggledy like a ravaged cemetery, each marker bearing the name of a locality whose Jews were deported there. We found the stone for Otwock, laid pebbles atop and recited Kaddish, the Jewish prayer for the dead.\nTo see what a concentration camp was actually like required visiting Auschwitz-Birkenau, which we did while in Krakow. We do not know of any relatives who ended up there. But we viewed with anguish the tiered bunks where 1,000 slaves per barrack — there were 350 barracks — were jammed in nightly; the heaps of shoes, glasses, even prosthetic legs that the Germans collected in their demonic meticulousness; and the grim gas chambers.\nAdvertisement\nContinue reading the main story A few days later, we made the trek to the hometown of my father, Marcus Berger, in what was then Poland but is now Ukraine. And trek it was. While Poland is a 21st-century nation, the slice of Ukraine we saw is mired in the 19th, with roads so rutted it took three hours to drive some 30 miles. Cows and horses drew carts of supplies; roosters and stray dogs wandered about; ramshackle bungalows with corrugated roofs and outhouses are common; and gardens are pruned by women with long scythes.\nIn Borynya, one scythe-bearer took us to her 86-year-old toothless grandmother, Jaroslawa Kachaj. She was 12 when the Germans occupied Borynya and remembered Jewish neighbors: the Stuhlbauchs, Liebermans and, yes, Bergers, who lived in three houses on the other side of town.\nFrom her and others we gathered a collection of disjointed facts. One Berger, perhaps my father’s uncle, owned a tavern. Another was a talented seamstress. The mayor was named Friedman. The old woman’s father was hired to sell merchandise on the Sabbath. A kindly Jewish physician, Dr. Ungst, tended to all.\nAlex Denisenko, our Ukrainian-speaking guide, later sent me a 1929 Polish business directory and sure enough it had names Mrs. Kachaj mentioned. An M. Berger owned a lumber business and “spirits” were sold by an N. Berger. Other townspeople pointed out a modest evangelical church and told us that it had been the site of the synagogue, where no doubt my father was bar mitzvahed.\nWhen the Nazis arrived in 1941, Borynya’s Jews were subjected to beatings and indignities, with Ukrainian policemen assisting. A girl named Chaika, the grandmother said, came to her house pleading for bread. “My mother said ‘Please eat quickly and leave or they will kill all of us.’ ” Then in 1942 there were mass executions. In one, two dozen Jews were forced to sing while marching in procession and then were shot in front of open graves.\n“There was a large woman named Stuhlbauch,” the grandmother told us. “They took her away in a convoy. She saw me and started crying. I saw another woman, they took away her clothes. She had only a nightgown. She was killed by a well.”\nPhoto A pine forest in Turka. Credit Daniel Rodrigues for The New York Times Tetiana Wolczanska, a tempestuous retired schoolteacher who said she lived in a house once owned by a Jew, led us on a half-mile climb up a steep wooded hillside, requiring several crossings of a narrow stream, to a sloping meadow topped by an electric pole.\n“In that field the Jews were killed,” she said.\nMy sister and I looked up, struck by the field’s quiet innocence. Here, too, we said Kaddish. Painful as it was, the moment again allowed my sister and me to share our legacy and brought us closer together; in our version of a roots trip, the bond we achieved along the way, as my sister said, was “one root we actually found.”\nAdvertisement\nContinue reading the main story Advertisement\nContinue reading the main story On our way back, we stopped in Turka, Borynya’s biggest neighbor, and were heartsick to see that one synagogue was being used as a sawmill, another as a car repair shop. Yet in Poland such buildings seem to be cared for with more dignity. In Lesko, Poland, a well-maintained 17th-century synagogue draws tourists even if it is used as an art gallery that sells Christian icons. So does an even more elegant 18th-century synagogue in Lancut, where biblical passages decorate the walls surrounding a Baroque four-pillared bimah, or platform from which prayers were led. A synagogue guide, Miroslaw Kedzior, taught himself Hebrew to better understand Judaism.\n“The Hasidim tell me I have a Yiddish soul,” he said.\nAs we made several such stops on our return to Krakow, we came to grips with what we had known abstractly: that Poland had been almost depleted of Jews both by the Nazis, the postwar pogroms and the Communist persecutions. There are 20,000 Jews left in a country that once had 3.3 million, according to Ms. Lieberman.\nYet shards of Judaism are being restored. Part of the effort is no doubt aimed at tourism. In medieval Krakow, largely intact, there are a half-dozen ancient synagogues, some that hold services, a well-preserved cemetery and a street with a dozen cafes that serve gefilte fish and matzo ball soup while gentile klezmer bands play Yiddish chestnuts. While charming, it was hard not to think of it as a Jewish Disneyland without actual Jews.\nYet cynicism aside, such efforts remind people that Jews were entwined in Poland’s soul. As in Warsaw, a New Yorker, Jonathan Ornstein, has led a revival, setting up a Jewish community center that boasts 550 members, some people who have discovered that they had Jewish grandparents who harbored them with Christian families then perished.\n“Poland has had periods of estrangement and persecution,” Mr. Ornstein told us. “Let’s take advantage of a good period.”\nWhile we were there, the center held a triumphant “Ride of the Living” along the 55 miles from Auschwitz to Krakow, with 70 cyclists taking part to underscore the hopeful future of Poland’s Jews. One was Marcel Zielinski, an 80-year-old Montreal man. He last walked the route as a 10-year-old liberated from Auschwitz and hunting for his parents.\nWhen he arrived on his bicycle in his Day-Glo green outfit alongside his son and two granddaughters, his face a jubilant grin, it was hard not to be overcome.", "external_links": ["http://static01.nyt.com/images/2015/08/02/travel/02POLANDJP7/02POLANDJP7-articleLarge.jpg", "http://static01.nyt.com/images/2015/08/02/travel/02POLANDJP8/02POLANDJP8-superJumbo.jpg", "http://muzeum.ock.com.pl/", "http://static01.nyt.com/images/2015/08/02/travel/02POLAND2/02POLAND2-master180.jpg", "http://www.jdc.org/", "http://static01.nyt.com/images/2015/08/02/travel/02POLANDJP7/02POLANDJP7-superJumbo.jpg", "http://www.dawnesmaki.pl/en/", "https://lauderfoundation.com/", "http://static01.nyt.com/images/2015/08/02/travel/02POLANDJP9/02POLANDJP9-master1050.jpg", "http://static01.nyt.com/images/2015/08/02/travel/02POLANDJP9/02POLANDJP9-superJumbo.jpg", "http://www.taubephilanthropies.org/", "http://www.literatka.com.pl/", "http://static01.nyt.com/images/2015/08/02/travel/02POLAND2/02POLAND2-superJumbo.jpg", "http://www.polin.pl/en", "http://static01.nyt.com/images/2015/08/02/travel/02POLANDJP8/02POLANDJP8-master1050.jpg", "http://www.ushmm.org/wlc/en/article.php?ModuleId=10007941"], "published": "2015-07-30T21:16:00.000+03:00", "crawled": "2015-07-31T06:06:05.874+03:00", "highlightTitle": ""}