{"organizations": [], "uuid": "deadb33432eaed0eb9947175981ca96a66a0925c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03390/Trunki_3390076k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/case-studies/11768225/trunki-original-best-for-business.html", "country": "US", "title": "Trunki shows so why being original is best", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Trunki shows so why being original is best - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T23:15:00.000+03:00", "replies_count": 0, "uuid": "deadb33432eaed0eb9947175981ca96a66a0925c"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/sme-home/case-studies/11768225/trunki-original-best-for-business.html", "ord_in_thread": 0, "title": "Trunki shows so why being original is best", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more business news and opinion » Heartlessly chewed up and spat out by the business “experts” on the BBC’s Dragons’ Den , Trunki founder Rob Law has gone on to make around £7m a year with his colourful children’s suitcases. The 38-year-old’s multi-coloured carry-on luggage was derided by Theo Paphitis as “worthless” on the hit business show in a particularly cruel episode called “Wheelie Rubbish” almost a decade ago. But Bristol-based Law has since gone from underdog to business heavyweight, thanks to an unshakeable self-belief in the fun and originality of his product. Still, Law’s top rule for wannabe CEOs is to be ruthlessly realistic about how good your idea really is. “I get contacted every day by inventors who think they’ve got a great concept,” he says. “But actually it’s an idea they think is great and no-one else does.” It’s a notion that friends and co-business owners Charlie Purdie and Dash Lilley, both 32, can easily relate to after setting up a business selling fresh coconuts direct from Thailand. Start small, try it out on people and soak up that all too valuable early feedback When the boys accepted a home delivery of a truckload of the fruit at four o’clock one morning three years ago, they admit they had a big moment of doubt. “At first we thought: ‘What the hell are we going to do with all these bloody coconuts?’” says English-Australian Purdie, the now multi-millionaire co-founder of Cocoface. But they persevered, taking their bounty to a summer food fair in London Bridge and selling out of their fresh Thai coconut juice. Within a year they were stocked in trendy supermarket health chain Whole Foods. But their now hit business was not without its initial detractors. “Even people I considered fantastic mentors did not think this would go anywhere,” says Purdie. “They saw raw fresh coconuts as a commodity business that was very difficult to scale with too many obstacles to overcome.” The boys spent around £1,400 of their own savings on their initial batch of fruits, sourced from a Dutch importer. Purdie strongly advises anyone else with a burning business idea to also adopt this have-a-go attitude. “If you really like your idea and it feels right to you, give it a spin or you might kick yourself later,” he says. “You don’t have to have loads of cash or remortgage the house. Start small, try it out on people and soak up that all too valuable early feedback.” Fearlessness is a trait that has worked well for newcomer entrepreneur Jessica Patterson. The 31-year-old former athlete, originally from California, set up a luxury-brands-only PR company in London in 2014 and has turned it into a £250,000 profit in less than a year, despite “significant” student debts. “I set up JPR with around £2,500 of savings but a lot of debt,” she admits. “I now employ five full-time staff and a team of freelancers, working on brands such as Raffles and Open Aero private jets.” As for those who want to, or have to, start with nothing, public finding projects like Kickstarter or Crowdcube can work. That was the route of FarmDrop CEO Ben Pugh, 37, who quit a lucrative but “unfulfilling” job in the City to start up his now award-winning food supply business. FarmDrop, which sells directly from small producers to customers without middlemen, was turned down by “countless” investors. “If I had listened to every naysayer I would never have quit my job but I’ve not looked back,” he says. “Alongside my co-founder Ben (Patten), people told us we were mad to even think of taking on big supermarket chains. Follow your gut, I say.” See how technology is helping to transform other businesses at HP BusinessNow You may also be interested in: • Changing lanes: when diversity in business pays off • Efficient doctors need IT prescription • Earwig expands its schools curriculum • What is lean start-up philosophy? • Consider it signed, sealed and sent with Sendy • Gaming and gambling: a new cocktail from Geonomics", "external_links": [], "published": "2015-07-28T23:15:00.000+03:00", "crawled": "2015-07-28T18:52:45.212+03:00", "highlightTitle": ""}