{"organizations": [], "uuid": "6a968f181e2271a4a6e02ae1027783211b83e79a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03370/Jeff-Gilbert-Alan-_3370269k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-12.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11724264/Alan-Titchmarshs-guide-to-the-perfect-Sunday.html", "country": "US", "title": "Alan Titchmarsh's guide to the perfect Sunday", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Alan Titchmarsh's guide to the perfect Sunday - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T16:01:00.000+03:00", "replies_count": 0, "uuid": "6a968f181e2271a4a6e02ae1027783211b83e79a"}, "author": "Alan Titchmarsh", "url": "http://www.telegraph.co.uk/goodlife/11724264/Alan-Titchmarshs-guide-to-the-perfect-Sunday.html", "ord_in_thread": 0, "title": "Alan Titchmarsh's guide to the perfect Sunday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I have enormous sympathy with those who see the prospect of increased Sunday trading hours as yet another nail in the coffin of that one quiet day of the week. And yet, to be honest, it has long since ceased to be that quiet day at all – the roads are clogged with folk on their way to the mother-in-laws or Ikea and most town centre shops are open – albeit for fewer hours than in the rest of the week. Ikea can be the place of a regular Sunday outing (Getty) Sunday has become indistinguishable from Saturday nowadays, unless you are one of those wise households who makes a Unilateral Declaration of Independence and decides that Sundays will, indeed be special. Moan as much as you like about the Chancellor opening the floodgates ; what you do on a Sunday, and just how special it remains is, when all said and done, down to you. You don’t have to go to the shops . You can stay at home and enjoy a spot on peace and quiet in the garden or (heaven forbid) in front of the telly. But perhaps the real way to keep Sunday special is to set aside certain things that are done on that day and no other. Moan all you like about the Chancellor, but Sundays are for you (Bloomberg) Church ? It doesn’t have to be dreary and humdrum. There is a magic and a calmness to village services and an uplifting grandeur to those held in a Cathedral. There will be one not too far away from you whose choral music will lift you to the skies regardless of the shakiness of your faith. Just give yourself the time and the space to sit back and let the music flow over you. A couple of weeks ago I was lucky enough to attend evensong at Wells Cathedral on a Saturday at 5.15. The effect saw me float through the rest of the weekend on a tide of calm. Wells Cathedral: church needn't be fusty (Handout) You might try pottering in the garden – nothing too strenuous, but perhaps a little deadheading of the roses. The result will be a brighter view, a sense of virtuousness with the song of the birds as your accompaniment. Sit and look at your handiwork and smile. Sundays are a time for slowing down, for reading a book without feeling guilty – not just before you go to sleep, but in the morning with a mug of coffee or in the afternoon with a cup of Earl Grey tea. And read for an hour or more, not ten minutes. Sundays are for spending time with your grandchildren (Alamy) Make time to see your children or your grandchildren. Have them round for a Sunday roast or afternoon tea – in the garden if it’s fine. Go for a family walk – by the river, up in the hills, or take the car for a run to the local beauty spot and get out and breathe the fresh air. Talk, converse, chew the fat…and laugh together. Don’t use power tools, don’t go shopping, don’t do the washing and the ironing, even if it’s piling up. Sundays are as special as you want to make them, and Monday will come round soon enough. Follow @telegoodlife", "external_links": [], "published": "2015-07-12T16:01:00.000+03:00", "crawled": "2015-07-12T10:34:57.000+03:00", "highlightTitle": ""}