{"organizations": [], "uuid": "77b5d2b15ac0889d511b16515b2df2b12fc5ba8e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn4.scmp.com/sites/default/files/styles/620x356/public/2015/07/16/7c0b2c6514f905fe21c6c9b15c70c62e.jpg?itok=MR7RI_gx", "site_section": "http://scmp.com//rss/37/feed", "section_title": "South China Morning Post - Travel & Leisure feed", "url": "http://www.scmp.com/lifestyle/fashion-luxury/article/1840216/dolce-gabbanas-alta-moda-show-midsummer-nights-dream-come", "country": "HK", "title": "Dolce & Gabbana's Alta Moda show A Midsummer Night's Dream come true", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "Dolce & Gabbana's Alta Moda show A Midsummer Night's Dream come true", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T01:38:00.000+03:00", "replies_count": 0, "uuid": "77b5d2b15ac0889d511b16515b2df2b12fc5ba8e"}, "author": "pauljbuck", "url": "http://www.scmp.com/lifestyle/fashion-luxury/article/1840216/dolce-gabbanas-alta-moda-show-midsummer-nights-dream-come", "ord_in_thread": 0, "title": "Dolce & Gabbana's Alta Moda show A Midsummer Night's Dream come true", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Looks from Dolce & Gabbana's Alta Moda autumn 2015 show in Portofino. Photos: Dolce & Gabbana \nAs a small group of us glide into harbour on a speedboat on a blisteringly hot day in Portofino, we spot Russian billionaire Roman Abramovich's 557-foot luxury vessel. It's one of several days dedicated to Dolce & Gabbana's Alta Moda (couture) shows, with women's and men's high jewellery unveiled each evening before leisurely sundowners. \nStefano Gabbana's silver superyacht, La Regina d'Italia, is docked in the glamorous resort. A few select journalists walk up the ramp to talk shop with the designer, while his business partner of 30 years, Domenico Dolce, puts the final touches to the collections showing over the next two days. \nSince the design duo launched their Alta Moda women's couture line 3½ years ago in Taormina, Sicily, invitations to summer destination shows (as well as winter shows in Milan) have become much sought after but hard to come by. One reason for this is that no bloggers are allowed at either the women's or men's (Alta Sartoria) shows. \nThis time, the brand has taken over Portofino, hosting guests in Dolce and Gabbana's own villas. Gabbana opens up his spectacular and eccentric abode for the high jewellery cocktail party (jewellery sales have been slow, as the line is new), keen to show off one small building with a pagoda roof. \nThe main Alta Moda show takes place in Dolce's garden. About 300 couture clients, along with 20 to 40 journalists, are transported into a dream world. Social media posting of the collections is discouraged, but, inevitably, pictures begin slipping out. \n\"I repost on Instagram if I see something posted from the customer,\" Gabbana says. \"The decision is with the customer always, not just from us. For Alta the system is totally different. \n\"Our customers don't want to see everything on social networks,\" he says. \"That's why we try this policy. They don't want to see a pop star in an Alta Moda dress. There's just one per design with the Alta items, and if they want it, it is unique to them.\" \nSome clients leave immediately after selecting a piece rather than stay around for the Gatsby-esque evening celebrations. \"The super rich,\" Gabbana adds, \"many don't want to stay in the spotlight.\" \nThe Alta Moda show is delayed to allow for the heat to subside. Billionaires and millionaires schlep up the hill to Dolce's cliffside villa. Male models in Shakespearean garb flank the pathway, holding garlands of flowers, as women in iridescent silver scatter rose petals and swing acrobatically from hoops suspended in the air. Surreal doesn't begin to describe the scene. \n\"We were inspired by A Midsummer Night's Dream ,\" Dolce says later. \"Fashion is totally a dream, a fantasy,\" Gabbana says. This is ever more true for couture, and ever more surreal at a time where the rest of Europe is gripped with terrifying news of Islamic State or austerity and the ripple effects of Greece's bitter bailout. \nDoes the world of high fashion seem almost embarrassingly disengaged during such times? Most certainly, but the designers might argue that, here in Portofino, that is the point for these four days. Rich embroidery, feathers climbing high on extravagant headdresses or layered in perfect harmony over a gigantic ballgown skirt, with sheer tulle creating halos of light around models: this season's Alta Moda explores \"what is real and what is fantasy\" - a theme central to Shakespeare's play. Titania would have approved of these outfits. \n\"We play 100 per cent,\" adds Gabbana. \"The Alta Moda is totally a serious game, but for us everything is possible through fantasy, mostly because we make everything in Italy. If you have an idea, we have a lot of artisans who can make everything.\" \nColourful brocade suits, pretty sheer dresses, exquisite point flats and chunky heels were among items selling well. It's evident that each season, the designs are evolving based on client feedback and popularity. Here they have the luxury of last season's demand fuelling this season's supply. \n\"We know what our customers want, the men too,\" Gabbana says, \"we have a clear idea. And many don't care about trends.\" \nThe brand's signature silhouettes are always flattering, and here embellished with remarkably detailed craft. Off-the-shoulder is sensual and popular, suiting is impeccably tailored, hourglass and chic. \nAn entire chapter of Asian-inspired outfits put those on the red carpet at the recent Met Gala to shame: Chinese motifs, laces, imperial gowns and furred cuffs on wide sleeves that recalled Chinese robes; dramatic Japanese kimonos worked with Italian flair and a fair amount of creative licence. Then comes the corset and regal gowns inspired by the 17th century French court, printed with trompe l'oeil, exotic gardens, smashed watermelons. Eccentric, bold and almost dizzyingly dramatic; if it was fantasy they were going for, then mission accomplished. \nThe ethnically diverse roster of models may have been chosen to reflect the global nature of the brand's clientele. They are the jet set from China, Europe, Russia, the Middle East, the United States and, notable by their number this year, from Africa; the brand recently opened a flagship store in Johannesburg and has attracted the attention of the continent's uber rich. Chinese clients have almost doubled from last year, although no exact numbers are revealed. It's clear just by being there that some markets are growing fast for the Alta lines. \nClients always come first with couture lines; many eventually become friends from meeting at private buying sessions, over dinners, during fittings and at these seasonal VIP shows and parties. On average each dress or full men's suit takes about a month to make. Prices, although kept private, are high enough to be relevant only to the world's wealthiest - the 1 per cent of the 1 per cent. \nThis special treatment means that, unlike with prêt-à-porter, designers always talk directly to the customers. \"It's different from the [usual] system. During regular fashion week, it's less than one hour for one show and a rush to go,\" Gabbana says. \"Here we have the possibility to stay four days with our customers, it's more fun.\" \nIt's almost unheard of for designers to host shows in their own houses, \"but that's the point\", Gabbana says aboard his yacht. \"In Italy, we give guests the best of the best, that's our tradition. So we literally squeezed to give everything to our guests.\" \nThey say that the Alta events are more like extended family gatherings than normal fashion shows. They're not too dissimilar to a wedding of epic proportions, with two powerhouse families coming together. It leaves the rest of us wishing our relatives were wealthier. \n\"Usually, when we talk about couture you think about older people, but now a lot of our clients are younger. Women in their 30s or 40s will come, and some even ask for dresses for their children,\" Gabbana says. Scattered across the globe, these clients might be culturally different but they all want to the same thing, says Gabbana. \"They want the best of the best. And they love to party. \n\"You love to party?\" he asks. \n\"Yeah, me too. I love to do it this fun way,\" he says, waving an arm at nothing in particular. \nThe scene speaks for itself: the yacht, the blinding sunshine outside, the washed pastels of Portofino townhouses all lined up in a row, and luxury villas clinging to the hillside. \n\"The legendary Italian style of life: this is the fantasy, this is the dream.\" This article appeared in the South China Morning Post print edition as Wildest dreams Share", "external_links": [], "published": "2015-07-17T01:38:00.000+03:00", "crawled": "2015-07-17T05:23:22.000+03:00", "highlightTitle": ""}