{"organizations": [], "uuid": "beaf1333de14384cabd66370ea08e724e19325f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03369/josh_3369414a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sport/othersports/polo/11727777/Polo-Gold-Cup-2015-No-teenage-wasteland-for-Josh-Cork-in-shadow-of-Dubais-Adolfo-Cambiaso.html", "country": "US", "title": "Polo Gold Cup 2015: No teenage wasteland for Josh Cork in shadow of Dubai’s Adolfo Cambiaso", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Polo Gold Cup 2015: No teenage wasteland for Josh Cork in shadow of Dubai’s Adolfo Cambiaso - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T14:27:00.000+03:00", "replies_count": 0, "uuid": "beaf1333de14384cabd66370ea08e724e19325f5"}, "author": "Gareth A Davies", "url": "http://www.telegraph.co.uk/sport/othersports/polo/11727777/Polo-Gold-Cup-2015-No-teenage-wasteland-for-Josh-Cork-in-shadow-of-Dubais-Adolfo-Cambiaso.html", "ord_in_thread": 0, "title": "Polo Gold Cup 2015: No teenage wasteland for Josh Cork in shadow of Dubai’s Adolfo Cambiaso", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "• Read our interviews with Britain's Gold Cup-competing players Teenager Josh Cork has been the happiest zero goal polo player in the world in the last three weeks. After four winters in Argentina, this summer, the Hertfordshire lad has enjoyed four matches alongside the masterful shadow of the world's leading player Adolfo Cambiaso. Four matches, four marches to victory. Easy game this, he might be thinking. The 2015 Jaeger-LeCoultre Gold Cup for the British Open is reaching its knock-out stages now, and the English teenager will probably not play in the final stages, with patron Rashid Albwardy likely to be drafted in for his team. But the key is that Cork has flourished in his high-goal debut on the biggest stage in England. \"Playing the Gold Cup is amazing, but playing with one of the best teams is the best,\" said Cork, who’s studying marketing at college in Cambridge. \"It's really good. You learn a lot and it's great playing with them.\" • Young Brits: Ralph Richardson | Ollie Cudmore | Tom Brodie There is a thrill playing alongside Cambiaso, not to mention Martin Valent and Diego Cavanagh. \"There’s lots of things to learn from him. He'll instruct you little by little and he'll make you make the right plays. It's really good. He'll guide you that little step and it will help you so much. It's a dream come true.\" Cambiaso has a succinct report on the young charge. \"I don't say much to him. He's just a guy who understands what he's doing. In polo you either have it or you don't. I think he has it. He'll be a really good player,” the 10-goal legend said. Cork has been saddled up for polo since he was nine. \"I've been playing ten years. My parents and brothers are also involved. Everybody except for my mum. I'm the oldest. My dad only started playing ten years ago as well. We all started playing at the same time,\" he explained. His father plays in Hertfordshire at Silver Leys, a local polo club. \"My dad Andy's off zero. My brothers Marcus and Ollie are off zero and minus one. Hopefully Ollie will get a chance next year.\" Cork had talent in other sports growing up. \"I was quite good at football at a young age. I went to Monks Walk in Llewellyn Garden City. It's in Hertfordshire. It was a public school. I played cricket as well. I could bat all right, but bowling wasn't my strength.\" • Cambiaso - the greatest sportsman you've never heard of? But polo has gradually taken over his life. \"At the start you never know what will happen. But the last couple of years I've been pushing really hard to play well and improve my polo. I try to be well-disciplined, listen to all the players and carry out what they say. That's the best you can do really. I'm now based at Ambersham, just five minutes down the road.\" Cork also took part in the match last week for Dubai against King Power. It was over 30 degrees, and to save the ponies uncomfortable journeys, Cowdray Park manager Chris Bethell agreed for the match to be diverted to Billingbear, to save the ponies 90 minutes of travel time. Dubai won that match 17-9, with Cambiaso \"on very top form”. \"I was absolutely dead after the game. Exhausted. I was out for the count,\" explained Cork, who goes to Argentina every winter. \"I've been there nearly five years now. It's very hard for an English player to get to six goals, let alone ten goals.\" The crucial aspect of his improvement, though, have been those last four years. \"I've been going to Argentina for the last four winters. You can improve your ball skills a lot in Argentina. It's mainly loads of practices over there – not so much tournaments. If you can be with the right people, it's always good.\" Cork is a true lesson for any young developing professional. And with the understated praise of the world's leading playing ringing in his ears, it has been a coming of age season for young Josh Cork. Follow @telegraphsport", "external_links": [], "published": "2015-07-09T14:27:00.000+03:00", "crawled": "2015-07-09T12:12:47.000+03:00", "highlightTitle": ""}