{"organizations": [], "uuid": "19de6209ddb1a0385a85c26686ec5445723a7b0c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27763-susan-katz-joins-pcma-s-executive-team", "country": "US", "title": "Susan Katz joins PCMA’s Executive Team", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Susan Katz joins PCMA’s Executive Team", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T18:15:00.000+03:00", "replies_count": 0, "uuid": "19de6209ddb1a0385a85c26686ec5445723a7b0c"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27763-susan-katz-joins-pcma-s-executive-team", "ord_in_thread": 0, "title": "Susan Katz joins PCMA’s Executive Team", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Susan Katz joins PCMA’s Executive Team Susan Katz joins PCMA’s Executive Team Details Category: Appointments   16:15 The Professional Convention Management Association (PCMA) has announced the appointment of Susan Katz to the newly created position of Senior Vice President, Operations. Susan has been in the meetings and events industry for over 30 years. Most recently as Director of Corporate Events & Travel for the True Value Company. Prior to joining True Value, she worked for several non-profit organizations including the National Safety Council and the American Dental Association. \nSusan comes to PCMA with a wealth of organizational knowledge; previously serving on the PCMA Foundation Board, the PCMA Board of Directors, and Chair of the Board of Directors in 2011. She was honored by PCMA with the Distinguished Meeting Professional Award at the 2009 Convening Leaders Annual Meeting. Additionally, Susan is a respected collaborator and has sat on several industry advisory boards including the San Diego Convention and Visitors Bureau, InterContinental Hotel Group, Chicago Convention and Tourism Bureau Advisory Council, Atlanta Customer Advisory Board, New Orleans, Orlando, Anaheim and Philadelphia Advisory Boards. “We couldn’t be more excited about Susan joining the PCMA executive team,” said Deborah Sexton, President and CEO. “She knows our organization well and will make an immediate positive impact with both our members and industry. Susan is a remarkable consensus builder, her addition to the PCMA team helps ensure that we remain relevant with our audience and continue to 'walk the talk' of the meeting professional.” Susan and her husband Richard have been married 38 years. Her daughter, Rachel and son-in-law Jerry Pecka are both in the hospitality industry in southern California, and her son Nathan is in food service management in the Chicago area. In addition, her two furry children, Houdini and Taffy join the PCMA staff four-footed clan. Related articles", "external_links": [], "published": "2015-07-16T18:15:00.000+03:00", "crawled": "2015-07-16T18:43:26.000+03:00", "highlightTitle": ""}