{"organizations": [], "uuid": "3dd35c0eeb444620c028a5a0073cfb2439b84e45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://www.independent.co.uk/incoming/article10378106.ece/binary/original/camp-powys.jpg", "site_section": "http://www.independent.co.uk/travel/rss", "section_title": "- Travel RSS Feed", "url": "http://www.independent.co.uk/travel/hotels/british-campsites-from-tree-pods-to-tepees-where-to-camp-in-style-10379858.html", "country": "IE", "title": "British campsites: From tree pods to tepees, where to camp in style - Hotels - Travel", "performance_score": 0, "site": "independent.co.uk", "participants_count": 1, "title_full": "British campsites: From tree pods to tepees, where to camp in style - Hotels - Travel - The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "3dd35c0eeb444620c028a5a0073cfb2439b84e45"}, "author": "Chloë Hamilton", "url": "http://www.independent.co.uk/travel/hotels/british-campsites-from-tree-pods-to-tepees-where-to-camp-in-style-10379858.html", "ord_in_thread": 0, "title": "British campsites: From tree pods to tepees, where to camp in style - Hotels - Travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Red Kite Tree Tent, Powys \nThis innovative, spherical canvas pod, suspended between trees, can only be accessed via a rope bridge. The secluded pod, which hangs in 80 acres of woodland near Llandrindod Wells, accommodates two adults, with a double bed that folds into a sofa. The Tree Tent even has electric lights that run on solar power. Outside, there's private decking with running water, a hot shower, and gas stove. A brook also runs behind the pod, where guests can paddle in summer.\nNear Builth Wells, Powys, Mid Wales (01865 764087; bit.ly/RedKiteTree ). Three-night stays from £385 for two. \nAlde Garden, Suffolk \nThere's lots of choice at this small campsite in the heart of Suffolk. Campers can either pitch up on one of the five traditional tent spaces or choose something a little more exotic, from bell tents to tepees, or a restored gypsy wagon. The yurts are all hand-crafted from locally sourced wood covered in thick canvas. They have wood-burning stoves, ground sheets, carpets, furniture, and solar powered fairy lights. The tepees come with cow-skin rugs and a wood burner in the middle. The wagon is believed to be around 100 years old and is completely renovated. It looks as though it's been plucked from a fairy tale with its green exterior, yellow shutters, and decorative front door framed by flowers.\nAlde Garden, White Horse Inn, Low Road, Sweffling, Suffolk IP17 2BB (01728 664178; aldegarden.co.uk ). Tent pitches from £14 per night. \nAlde Garden, Suffolk Cornish Tipi Holidays, Cornwall \nThis site offers 40 traditional tepees set in 16 acres of woodland and meadow, with a quarry lake in which to swim, canoe or fish. The canvas tepees come in medium, large and extra-large, the biggest reaching 18ft tall. They have camping mats, stoves, cool boxes, and kitchen utensils, but guests will need their own sleeping bags and pillows. Outdoor activities in the surrounding area include kayaking and surfing.\nTregildrans Quarry, Trelill, St Kew, Bodmin, Cornwall PL30 3LW (01208 880781; cornishtipiholidays.co.uk ). Medium tipis from £310 for three nights. \nCornish Tipi Holidays, Cornwall Kinloch Village Campsite, Isle of Rum \nOne of the best parts of camping is being close to nature, and this site puts you at the heart of it. The community-run site on the shores of Loch Scresort, on the Isle of Rum, makes up for in views what it lacks in luxury. It is just a 10-minute walk from Kinloch Castle and it also has views of the hilly mainland. Basic facilities include toilets, showers, wooden shelters, taps, and picnic benches. There's no need to book, just turn up and pitch.\nThe Isle of Rum, Inner Hebrides, Scotland (01687 460328; isleofrum.com ). Tent pitches from £6 per adult per night. \nKinloch Village Campsite, Isle of Rum The Fire Pit Camp, Norfolk \nThe most impressive feature of this site in Wendling, Norfolk, is a two-level dome, The Wren's Nest, that's hand-made from local hazel wood. It sleeps eight and has a small kitchen, living area, wood-burning stove, and solar panel for lighting. It's homely, with throws and freshly-picked flowers, an old double-decker bus where children can do arts and crafts, and a communal fire pit.\nThe Firs, Hulver Street, Wendling, Norfolk NR19 2LT (07917 406953; thefirepitcamp.co.uk ). Tent pitches £15 for adults, £7 for children, per night. The Wren's Nest costs from £130 per night. \nThe Fire Pit Camp, Norfolk Eskdale Camping and Caravan Club, Cumbria \nThis site is well-placed for climbing Scafell Pike, England's highest mountain. It's large, with space for 100 tents, all surrounded by woodland and bordered by a small stream. As well as tent pitches there are 10 wooden camping pods and a camping barn, which sleeps eight. The pods have portable indoor heaters, locking doors, and battery lights. The barn is centrally heated with a wood stove, eight beds, basic kitchen, and large dining table. The Ravenglass and Eskdale Railway is nearby.\nHolmrook, Cumbria CA19 1TH (019467 23253; bit.ly/EskdaleCampsite ). Tent pitches from £7.70pp, per night.", "external_links": [], "published": "2015-07-10T03:00:00.000+03:00", "crawled": "2015-07-10T14:32:22.000+03:00", "highlightTitle": ""}