{"organizations": [], "uuid": "db9c62fd4828b5d86cd091ac13d76e5cd0a6ff0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.independent.ie/incoming/article31346095.ece/ALTERNATES/h342/Pas.jpg", "site_section": "http://www.herald.ie/news/children-to-travel-on-public-transport-for-free-for-two-weeks-31344003.html", "section_title": "Children to travel on public transport for free for two weeks - Herald.ie", "url": "http://www.herald.ie/news/kids-leap-into-new-adventures-with-free-travel-for-two-weeks-31345559.html", "country": "", "title": "Kids Leap into new adventures with", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "Kids Leap into new adventures with free travel for two weeks - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T11:00:00.000+03:00", "replies_count": 0, "uuid": "db9c62fd4828b5d86cd091ac13d76e5cd0a6ff0e"}, "author": "Laura Larkin", "url": "http://www.herald.ie/news/kids-leap-into-new-adventures-with-free-travel-for-two-weeks-31345559.html", "ord_in_thread": 0, "title": "Kids Leap into new adventures with", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AS the summer holidays get underway, there was some light relief for parents with the news that children can avail of free public transport for two weeks. Minister for Transport, Tourism and Sport Paschal Donohoe Laura Larkin – 02 July 2015 03:00 AM\nKids who travel on Leap cards will be able to use all public transport covered by the card for free. The free travel period will run from July 6 to July 19.\nThis is the second year that the NTA (National Transport Authority) and the Department of Transport has rolled out of the initiative to encourage more families to in Dublin and around the country.\nIt will come as good news for parents who are trying to keep their kids busy during their time off.\n was on hand yesterday to announce the plan.\nThe Fine Gael TD praised the smart card scheme, which has continually grown since its inception.\nsuccess\n\"The Leap card project has been a huge success,\" he said.\n\"Very recently we issued the millionth Leap card and a huge number of public transport journeys are taken by people who own a card.\"\nMr Donohoe was joined by Anne Graham, CEO of the NTA who has spearheaded the Kids Go Free promotion.\n\"It was a very successful project last year and that's why we decided to run it again,\" she said.\nChildren are entitled to travel for free during the period of the promotion.\nThis year there are more options available for parents as more operators are on board with the Leap scheme.\nIn the capital Dublin Bus services as well as the LUAS and DART will be covered.\nMeanwhile, city buses in Limerick, Cork, Galway and Waterford will also be accepting young passengers for free.\nThe scheme covers some bus routes that travel to towns near Dublin, excluding expressways services.\nThe Leap card scheme was first introduced in Dublin in December 2011.\nDublin Bus has been steadily winding down its paper ticket system in favour of the smart card.", "external_links": ["http://www.independent.ie/incoming/article31346095.ece/c83de/ALTERNATES/h342/Pas.jpg"], "published": "2015-07-02T11:00:00.000+03:00", "crawled": "2015-07-04T05:24:01.000+03:00", "highlightTitle": ""}