{"organizations": [], "uuid": "786023e392a33dbb1bdcc6e1c130965ddfd460a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thecultureist.com", "main_image": "http://www.thecultureist.com/wp-content/uploads/2015/07/Stand4-App-Shot-1-e1436472127520.png", "site_section": "http://feeds.feedburner.com/culture-ist", "section_title": "The Culture-ist - An online travel & culture magazine for the socially conscious citizen", "url": "http://www.thecultureist.com/2015/07/10/disrupting-philanthropy-stand4-app-give-back-fun/", "country": "US", "title": "Disrupting Philanthropy: The New Stand4 App Makes Giving Back Fun", "performance_score": 0, "site": "thecultureist.com", "participants_count": 1, "title_full": "Disrupting Philanthropy: The New Stand4 App Makes Giving Back Fun", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T19:00:00.000+03:00", "replies_count": 0, "uuid": "786023e392a33dbb1bdcc6e1c130965ddfd460a6"}, "author": "culture-ist", "url": "http://www.thecultureist.com/2015/07/10/disrupting-philanthropy-stand4-app-give-back-fun/", "ord_in_thread": 0, "title": "Disrupting Philanthropy: The New Stand4 App Makes Giving Back Fun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Disrupting Philanthropy: The New Stand4 App Makes Giving Back Fun July 10, 2015 by culture-ist Leave a Comment Being charitable can take many forms. From making the choice to shop from a social enterprise to participating in voluntourism or organizing a local fundraiser – the idea of philanthropy has evolved to be one that includes active engagement. Supporting the trend of involved activism, Stand4, a new app that allows people to take a stand for the cause of their choice by taking an everyday action, is making the process of advocating for a cause fun and engaging. “Instead of me having to donate a dollar or an hour of time, I can just take Stands like drinking a beer or answering a trivia question about Bill Murray. Every time I do, Stand4 makes a donation for me” says Lyndie Mays, a Stand4 Beta user. Once the Stand is taken, the user will begin receiving updates from the Story (the cause) being supported, which track and show the exact impact made from the Stand. “Footprints are one of our favorite features” says, Andy Hill, Founder & CEO of Stand4. “On the user’s profile, we collect and compile every Stand they’ve ever taken so at any time, from anywhere, people can see all the lives they’ve touched, problems they’ve helped solve, and overall impact they’ve made on the world, all in one place…” Wondering where the donations come from? According to Stand4, the company’s brand partners sponsor the campaigns. The partners believe their advertising dollars can make a significant difference if allocated correctly, so they leave it up to the Stand4 users to decide what kind of impact will be made. The Stand4 app is available on iOS and Android . To learn more about how to get involved check out the Stand4 website .", "external_links": [], "published": "2015-07-10T19:00:00.000+03:00", "crawled": "2015-07-11T08:23:56.000+03:00", "highlightTitle": ""}