{"organizations": [], "uuid": "71aa66d768f8d0a549622c8ba8291505549582ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/7/5222ef49-60c5-451a-a2a1-374e66a8c2ccMediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Travel\r", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/travel/paradise-on-your-plate-a-gourmet-guide-to-kashmir/article1-1373321.aspx", "country": "IN", "title": "Paradise on your plate: A gourmet guide to Kashmir", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Paradise on your plate: A gourmet guide to Kashmir", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T10:37:00.000+03:00", "replies_count": 0, "uuid": "71aa66d768f8d0a549622c8ba8291505549582ed"}, "author": "", "url": "http://www.hindustantimes.com/travel/paradise-on-your-plate-a-gourmet-guide-to-kashmir/article1-1373321.aspx", "ord_in_thread": 0, "title": "Paradise on your plate: A gourmet guide to Kashmir", "locations": ["Kashmir"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated: Jul 26, 2015 13:28 IST The scenic Nigeen lake in Kashmir. (HT photo/Lubna Khatri) \nMajestic mountains, spectacular sunsets, serene lakes, fruit-laden orchards and flowers in bloom, Srinagar has all that. Beauty envelops you as soon as you land in this city of houseboats, grand chinars and the Dal and Nigeen lakes. Sitting in a houseboat surrounded by the sounds of silence and facing the mountains truly nourishes the soul. The local food, though, also amply nourishes the body while spectacularly seducing taste buds.For locals living near the lake, the day begins with sweet warm halwa and lavassa along with noon chai. Multiple rounds of noon chai are brewed and consumed through the day. Accompanying these cups are a variety of breads like the puffed bakarkhani, flat sheermaal, krip, sweet or salty kulchas, sweet roats and the bagel like chochwor, among others. Local breads of Kashmir. Every region of India has its own highly evolved cuisine with a unique character that manifests itself in both formal feasts and more plebeian street food. The Valley is no different. Take the magnificent multi-course wazwan that takes an entire day to prepare and is served at weddings and celebrations. An afternoon spent at a waza's (professional chef) home allowed this writer to witness a wazwan being prepared by a team of six cooks with a dozen utensils placed on burning logs arranged around a courtyard. Later, sitting on a mattress to have a meal at the waza's home, dastarkhan style, you are transported by the taste of haak saag (collard greens), the white dhobi dal and the aloo bukhara kukur, a chicken curry that's superlative when eaten with Kashmiri rice. While rogan josh (lamb curry) and the richly flavoured tabak maaz (lamb ribs) are international favourites, gushtaba and rista (white and red meat balls), waza kukur, tamatar paneer and haak are lesser known delicacies. A chef making wedding speciality wazwan. And then there are the subtle pleasures of Kashmiri Pandit cuisine, which doesn't use onions and garlic and is light on the palate and stomach. Curd plays a major role in the preparation of the community's meat dishes. Formal spreads are always enjoyable, but its best to hunt down the true spirit of a cuisine at streetside stalls. Numerous dhabas ensure that the streets of Srinagar are always bustling. The carts outside the Khanqah mosque in Zaina Kadal sell mouth-watering fish nuggets, fried Nadru (lotus stem) and chips, all served in big round thaalis. And then there is Krishna Vaishno Dhaba at Sonawar that serves rajma (kidney beans) with rice and curry pakora prepared in the Jammu style. But be warned, this dish fills your stomach but does not satisfy your cravings. So you just have to have another plateful.From the tranquility of the majestic Hazratbal shrine to the time-honoured Shankaracharya temple on Sulaiman Hill, from the rows of beautiful poplars and traditional wooden houses with projecting windows to the bustling food stalls selling lip-smacking food, Srinagar really does have it all. Tags", "external_links": [], "published": "2015-07-26T10:37:00.000+03:00", "crawled": "2015-07-26T13:10:48.153+03:00", "highlightTitle": ""}