{"organizations": [], "uuid": "182a19e80e9f221144b2a1fbf9bebffd37c6d709", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 9:14 a.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_GRAND_CANYON_WATCHING_WILDLIFE_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "Grand Canyon biologist sets up cameras to document wildlife", "performance_score": 0, "site": "ap.org", "participants_count": 1, "title_full": "Grand Canyon biologist sets up cameras to document wildlife", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T16:14:00.000+03:00", "replies_count": 0, "uuid": "182a19e80e9f221144b2a1fbf9bebffd37c6d709"}, "author": "By FELICIA FONSECA", "url": "http://hosted.ap.org/dynamic/stories/U/US_TRAVEL_GRAND_CANYON_WATCHING_WILDLIFE_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "Grand Canyon biologist sets up cameras to document wildlife", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  FLAGSTAFF, Ariz. (AP) -- A biologist has installed more than two dozen motion-sensing cameras along a 50-mile stretch of the Grand Canyon in pursuit of images of an elusive skunk species. Grand Canyon National Park has documented hog-nosed skunk tracks and found signs of them burrowing for insects along the Colorado River, but they're rarely seen and not known to make their home in northern Arizona, especially not on the north side of the river. Park biologist Brandon Holton spent two weeks in June setting up the cameras in hopes of learning more about how the skunk got to the park and if more exist. \"This essentially is a new species for Grand Canyon. Whether it's overlooked or whether it's a new arrival, we don't really know yet,\" he said. A group of rafters camping along the north side of the river captured an adult hog-nosed skunk on camera in August 2012. A juvenile skunk was photographed the following year about 10 miles upstream on the south side of the river. Holton says that could be a sign the skunks are breeding. The western spotted skunk and the striped skunk are common at the park, but the hog-nosed skunk isn't. The animal - with an entirely white back and tail, largely naked snout and long claws - is typically found in southeastern Arizona, Texas and Mexico, and roams at night. Their sightings at the Grand Canyon represent the northwestern extent of their documented range. The cameras are in tamarisk thickets where Holton has found skunk scat, and high above the water line to ensure they won't get washed away by man-made floods and to capture larger animals. Only two of the cameras are in areas that might photograph people at camping sites, but signs make campers aware, Hamilton said. He's also asked river rafters to help change batteries and memory cards in the cameras. Holton's cameras aren't the only ones along the river. Another 43 cameras are maintained by the U.S. Geological Survey's Grand Canyon Research and Monitoring Center to study the effects of the man-made floods on beaches and sandbars. The center's acting chief, Scott Vanderkooi, said the digital cameras are far enough away from the river banks that \"even a person standing on it, there's no way you could identify an individual.\" Holton is planning to keep his cameras out for a year. They were paid for by the Grand Canyon Association, the park's fundraising arm. John Dillon, executive director of the Grand Canyon River Outfitters Association, said he'll ask guides to watch for the hog-nosed skunk. The rafting community often volunteers to document sightings of specific animals in the river corridor, like bighorn sheep, birds and snakes. \"Anything that's unusual or something the veteran guides have never seen before, they usually gather that up or take pictures for the park,\" he said. Holton isn't picky about whatever else is captured on camera. \"Anything and everything - nothing specifically,\" he said. \"I have a couple lost collared bighorn sheep and mountain lions.\"", "external_links": [], "published": "2015-07-27T16:14:00.000+03:00", "crawled": "2015-07-27T16:52:30.726+03:00", "highlightTitle": ""}