{"organizations": [], "uuid": "978750757f8d66078a81b90a184b80011b103991", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03374/Deborah_Meaden_wit_3374084k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-14.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/ultra-low-emission-vehicles/11736668/electric-company-cars.html", "country": "US", "title": "Electric company cars are a step in the right direction", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Electric company cars are a step in the right direction - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T18:00:00.000+03:00", "replies_count": 0, "uuid": "978750757f8d66078a81b90a184b80011b103991"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/ultra-low-emission-vehicles/11736668/electric-company-cars.html", "ord_in_thread": 0, "title": "Electric company cars are a step in the right direction", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When I consider investing in a small business, the first question I ask is: what do you care about? What do you want your employees to care about? I never call it “corporate” social responsibility, because that sounds impersonal. My view is that you should simply clear the way for people to behave properly. The younger generation, in particular, are concerned about carbon emissions because it’s in their lifetime that the results will be felt. I’ve never liked waste and, really, that’s all that “environmentally friendly” means – not wasting resources. I’ve sat in board meetings and pointed out: “Guys, we waste stuff. We’re burning electricity. Can we afford to throw that money away?” I’ve always lived that way, both at home and in business. One of my firms won a green award 20 years ago, long before most people had heard of social responsibility. It’s easy being green Here at GripIt (a former Dragons’ Den contestant in which Deborah Meaden holds a 25 per cent stake), we make the world’s strongest plasterboard fixing. We thought about having them made in China, but decided to keep the jobs in the UK so as not to waste fuel and money transporting them. We re-melt and recycle all the plastic off-cuts, so it’s as environmentally friendly as possible. If you do care about the environment, driving an ultra-low emission company car is a great advertisement for your company’s values. It says you care. These days, the Government will go out of its way to help small companies that are environmentally friendly – that includes the Government grants available to help businesses buy and run an electric fleet. It’s the first thing any small company should consider doing. There are lots of things that count towards being certified as “green”. Solar energy is a great one to invest in. Solar panels are getting cheaper and more efficient all the time and, while the sun is shining, it’s all free energy. If you’re running a plug-in fleet off solar energy, you could be virtually running it for free. Electric performance We’ve got solar panels at home, which means we’re a carbon-neutral household. It also means I’ve been able to connect the Toyota Prius Plug-in during the day and charge it up completely free, which is immensely satisfying. I go horse riding every day at my sister’s house, which is seven miles away, and it was brilliant to be able to get there and back on one electric charge, completely free and with zero emissions. Whenever I go to London, I use environmentally friendly car-hire firms, so I was familiar with the Prius, but I hadn’t driven one before. The start-up process is the biggest difference I noticed from a petrol car. There’s no key to turn, no noise and no clutch. You just press a button and go. You quickly get used to that. The second thing I noticed was the acceleration. In any petrol car, when you put your foot down there’s a very slight delay before it responds. With the Prius Plug-in, however, the response from the electric motor is genuinely instant. I’m a sporty driver, so I like that. It means you’re engaged straight away. The only thing I miss is the manual gearstick: electric cars don’t have them. Backing excellence This Prius is a world apart from the cars I grew up with. I learnt to drive in Brighton and passed first time, then promptly crashed my yellow Fiat 850 into a boat, probably while looking at boys. I’ve always really enjoyed driving and I’m definitely toying with the idea of getting a second plug-in car. This Toyota Prius Plug-in can do 135 miles to the gallon, and that’s fantastic. I’ve always believed in backing excellence. If the Government is backing this kind of technology, it would be daft not to take advantage of it. Ultra-low overheads How green cars make sense for small businesses Cheaper to run Since ultra-low emission vehicles can cost just 2p per mile to run, company car drivers could save up to £300 per month: a significant boost to their pay cheque. Capital allowance If you buy an ultra-low emission vehicle for your company you can offset 100 per cent of its value as a capital allowance, compared to 8-18 per cent of a petrol car’s value. Government grants Businesses can benefit from plug-in grants worth up to £5,000 for cars and £8,000 for vans. Search “plugged-in fleets” for more advice for small businesses. Thrifty business NIssan Leaf On a full charge, the Leaf can carry you for up to 124 miles, and the battery can be 80 per cent charged in 30 minutes. Using a dedicated home charge point, it takes around four hours to fully charge. Acceleration to 60mph is rated at around 11.5 seconds while the top speed is 89mph. Now in its second generation, the Leaf looks and feels like a normal, genuine five-seat family hatchback. Volkswagen E-Golf There is no petrol engine at all in this E-Golf, but it’s a handy performer, with a top speed of 87mph. The car’s range of 118 miles depends on how you’re driving, but is none the less impressive. Everything else about it – from the LED lighting to the alloy wheels – is the same as on a normal VW Golf. The battery can be rapid-charged from flat to 80 per cent capacity in around 30 minutes. Find out more about ultra-low emission vehicles at goultralow.com", "external_links": [], "published": "2015-07-14T18:00:00.000+03:00", "crawled": "2015-07-14T14:27:50.000+03:00", "highlightTitle": ""}