{"organizations": [], "uuid": "c9672af46994a9817f4481f46439be512bc2946d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/b5501a4ce7db7b52a6483997d739964b83d5a0ab/c=0-0-756-427&amp;r=x633&amp;c=1200x630/local/-/media/2015/07/30/USATODAY/USATODAY/635738502109404108-Untitled-1.jpg", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/travel/destinations/2015/07/30/windows-around--world/30834005/", "country": "US", "title": "Window views: An amazing photographic voyage around the world", "performance_score": 1, "site": "usatoday.com", "participants_count": 2, "title_full": "Window views: An amazing photographic voyage around the world", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T16:31:00.000+03:00", "replies_count": 1, "uuid": "ccc3bd7c3ffd1c9edd436ccac06ef1fab0d2d5c6"}, "author": "Ben Abramson , USA TODAY", "url": "http://www.usatoday.com/story/travel/destinations/2015/07/30/windows-around--world/30834005/#post-0", "ord_in_thread": 0, "title": "Window views: An amazing photographic voyage around the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The website Somfy gave people a simple task -- take a photo out of your window and describe how it makes you feel. The results make for a mesmerizing virtual voyage around the world. Easter Island, Chile: From my window I can see Ahu Tahai, the island's sunset spot in the distance. This place makes me feel so calm, I can hear the sound of the waves breaking on the rocks and smell the sea breeze. -- Juan Somfy Fullscreen Easter Island, Chile:I feel very lucky to be here, in the middle of the ocean. I love the peace and how calm this island makes me feel. However there's also a sad feeling: I ask myself why is time passing so quickly? -- Juan Somfy Fullscreen London:Currently facing me is a huge block of local authority flats; but they're due for demolition soon. They're set to be replaced with a new block of flats. While I understand and can empathize with the housing crisis we have, there's a selfish part of me that's looking forward to not having to look out onto this rather ugly building and instead be able to see more of the beautiful park that's directly to the right of it. -- Vicke Somfy Fullscreen London:I have the great fortune (for London standards) of having an extremely large floor to ceiling window, with a door leading out on to the balcony. It's also east-facing, which means that on the days the sun does decide to come out in full-swing, brilliant light comes through in the mornings and afternoon. When the door's closed, I can't hear much, but when it's open in the summer, I hear all the hustle and bustle from the main road down below me. -- Vicke Somfy Fullscreen Bucharest, Romania:During spring and summer the green of the trees breaks up the uniform pattern of the concrete apartment blocks. From 6am-8am time slows down, there's little traffic and the cool morning breeze goes perfectly with a fresh cup of coffee. This view represents my childhood, home & love - my girlfriend lives right across the street. -- Cristian Somfy Fullscreen Bucharest, Romania:Usually the evening is the best time to enjoy the view, especially during June when the Linden trees are in full bloom. The smell is incredible and it sweeps over the whole neighborhood. -- Cristian Somfy Fullscreen Miami:This morning as I stood to take this photo, the air was fresh and Ms. Smith from next door was having her morning coffee under the tree which is home to a family of iguanas. As the day progresses more iguanas will come down from the tree, but fortunately not many come on our side of the fence. I don't really like how close the iguana tree is, because I fear one may fall on me if I sit out there, even though it is probably unlikely. -- Melissa Somfy Fullscreen Miami:I love the amount of animals that live in this lake. There's a often a turtle just under the iguana tree, and as I look up a gaulin is snatching a fish and taking him away for his meal. -- Melissa Somfy Fullscreen Murray, Utah:From my window I can see into many others. The building opposite is close enough that I can see there are flowers in almost every apartment window. -- Danielle Somfy Fullscreen Murray, Utah:At night I can hear people laughing, and the sound of silverware on plates in the small cafe below. This sound combined with the twinkly lights makes me feel serene as the tempting aroma of their food wafts up to the open window. I can also hear a bell ringing in the nearby church and the sound of cars rushing by below. I love the activity and life on my street. -- Danielle Somfy Fullscreen Abu Dhabi, United Arab Emirates:I'm on the 26th floor of a 50 story building - not too high and not too low: just right. I'm low enough that I can still see and hear everything going on in the street, and high enough that there is always a breeze on my balcony, and there are no mosquitoes. -- Uros Somfy Fullscreen Abu Dhabi, United Arab Emirates:From here I can look over the whole city. My window faces east and every morning I feel like I'm looking at the best scenery ever and it's never going to be any better than this. But then the night comes, and the view just pulls you in with a million colors and its New York-like soul. Sometimes I feel like I have a huge virtual reality screen and the scenery is changing just for me. -- Uros Somfy Fullscreen Estarreja, Portugal:I can see the salt fields from my window. My street is always windy and most of the time it smells like the ocean. At the end of the street there is a walkway that goes along the river where many people run and walk throughout the day. In the sky I can see storks, seagulls, and during the day I hear the swallows too. -- Bruno Somfy Fullscreen Estarreja, Portugal:At night I can hear the crickets and the frogs. This view always makes me feel happy because it's quiet and peaceful, it was actually one of the reasons I moved here. I love it. -- Bruno Somfy Fullscreen Lahore, Pakistan:I don't like this area much. I came here because I didn't have any other option. My apartment is situated in a mini market, which is semi residential, semi commercial area. From my window I see the top of a plaza which is still being developed, some houses, and minaret of a mosque. I can also see a burger shop sign. Being a market, this area is quite noisy, and I hear all sorts of voices and noises throughout the day. -- Waqar Somfy Fullscreen Lahore, Pakistan:The scenery and sounds change at night. By 8pm shops start closing, and by midnight everything becomes peaceful. Except for a few street lights, the area becomes dark. This view does not make me think or feel anything good. Sometimes I look outside just to have an idea of the weather and heat. -- Waqar Somfy Fullscreen Salé, Morocco:Heavy traffic ceaselessly flows up and down this street. Vehicles and motorcycles of all shapes, sizes and colors. The noise of these vehicles is the first and last thing I hear every day. -- Hachim Somfy Fullscreen Salé, Morocco:In the mornings I see the housewives washing clothes through the windows opposite me, and I hear the sound of dealers opening up their shops and cleaning vigorously. The activity of the dealers and housewives makes me feel optimistic for the new day, even though the vehicle noise makes me wake up early and feel sad. -- Hachim Somfy Fullscreen Kuala Lumpur, Malaysia:This main road is very busy in the morning and evening, because all the workers use this road to reach their offices located in Shah Alam. My wife and I hate the noise from the cars, lorries and motorcycles, however, the sound disappears when we close the windows. -- Mohd Somfy Fullscreen Kuala Lumpur, Malaysia:The view from my window is very beautiful in the morning, and at night the light shimmers into our house from the outside, it makes me feel inspired and relaxed. -- Mohd Somfy Fullscreen Ragaciems, Latvia:I live in a very small village next to the sea, there are only a few people left here. The streets are empty, it's very calm and quiet. My view is very lush, it's as if the plants want to make up for the lost time in winter and autumn. -- Janis Somfy Fullscreen Ragaciems, Latvia:It's quite windy and the only sound I can hear is the trees swaying in the wind. I can smell the freshly cut grass from the lot next to me. My neighbor takes good care of it, as he wants to sell it; the land prices have been rising in the last few years. I feel very calm here, that is why I love it so much. -- Janis Somfy Fullscreen Kolkata, India: Crows patrol outside the century old house we call home, a home that we are about to lose. We have to sell because the maintenance costs are rising day by day. From my window I can see the adjacent houses situated on the north side, I can hear my neighbors talking, the dogs barking, and there are birds that sing. But it smells of dogs, as there are 9 dogs living in the gap between my house and the house next to mine. -- Debapriya Somfy Fullscreen Kolkata, India:Whenever I am in this room, I can't help but think about my childhood because this is the room I used to share with my brother. I love everything about it, this secret window and the unique view. As darkness falls you can barely see the distant houses. I hate the fact that most of the old houses in this neighborhood are being replaced by new apartments. These old houses have been here since Calcutta was the capital of British India. -- Debapriya Somfy Fullscreen Glasgow, Scotland:I see tiny houses and roads around me throughout the day from a height. There are many people and vehicles going about their business, but I feel disconnected from them, as though I am watching a silent movie. I love to spend my time near the window especially on a sunny day, but sunny days are few and far between here. -- Manali Somfy Fullscreen Glasgow, Scotland:As the sun sets, I can see lights flickering as though in a time lapse. As peaceful as it is, I miss waving a hand to a neighbour and hearing children play. At night as much as I love the silence, I wish I could sense some activity around to make me feel less isolated. -- Manali Somfy Fullscreen Koprivnica, Croatia:I live at the very edge of the city and all my windows face west, to the last few buildings. I look out over sky, birds, and beautiful sunsets all year long. I'm not sure anything except seasons will ever change here - the view is just the same as it was ten years ago. Still, I could stand by my window all day long without getting bored. -- Kristina Somfy Fullscreen Koprivnica, Croatia:The air here is fresh and clean, it's nice and quiet without city noise, the sky is always beautiful and sunsets are simply amazing. If I could, I'd keep this view forever. -- Kristina Somfy Fullscreen Salento, Colombia:From my window I can see the Colombian mountains laid out before me. This is the beginning of the dry season so I can smell grass and horses, and hear birdsong. The landscape is very dramatic. -- Juan Somfy Fullscreen Salento, Colombia:It's in sharp contrast to the rainy season when it often rains for 24 hours or more at a time. The rain feels endless. The seasons here are so determinant in all aspects of life. But I feel very comfortable here, living very simply with just the basic things I need, and I love the people here, they are so friendly and helpful.-- Juan Somfy Fullscreen Viña del Mar, Chile:Rows of high-rise buildings separate me from the Pacific Ocean. This is my first day in the city, and I am anxious to go out and see what it has to show me. This will only be my home for a few days as we're on the road at the moment. I hope for clear skies so we can enjoy the city tour we've booked. I cannot wait to get out there. -- Mar Somfy Fullscreen Viña del Mar, Chile:Nine hours later I am back, city tour completed. After a quick shower, I sit on the bed and watch the lights flick on in windows across the city as the dusk comes. -- Mar Somfy Fullscreen Uberlândia, Brazil:I love the view from my window because I can see my neighborhood evolving. The large building has just been built, therefore we can see newcomers gradually settling in. Conversely, the backyard below my window is filled with chickens and ducks, so it’s often possible to see new chicks and ducklings, and to see them growing over time. This neighborhood is never truly quiet, as no matter which part of the day it is you can hear traffic, the neighbors and chickens and dogs making all kind of noises. -- Guillaume Somfy Fullscreen Uberlândia, Brazil:When I come back home by the end of the day, before sunset, the view is very relaxing, as the orange sun illuminates the street. The view at night is breathtaking, as the city lights shine in the night sky. -- Guillaume Somfy Fullscreen Cochabamba cita, Bolivia:When I was a little girl this view was of trees and grass, but now I see house, after house, after house, and far away the buildings merge into each other. Far away, on the left I can see Concordia's Christ, the biggest monument in my country. I can hear cars passing by, the wind, and the little birds making noise on the roof. I smell the city, a mixture of pollution and soil. -- Veronica Somfy Fullscreen Cochabamba cita, Bolivia: At sunset, the colors of the landscape look more beautiful than morning, and the wind picks up. This view makes me feel peaceful and I am happy to live here. I appreciate the landscape still, even with all the new houses and buildings. -- Veronica Somfy Fullscreen Like this topic? You may also like these photo galleries: Replay Autoplay Show Thumbnails Show Captions Last Slide Next Slide A view of Ragaciems, Latvia, during the day, top, and as night falls. (Photo: Somfy)\n100 CONNECT 84 TWEET 3 LINKEDIN 1 COMMENT EMAIL MORE In the Travel section, we often focus on famous landmarks and epic adventures. But as all travelers know, there's often equal beauty and meaning in the quotidian. The most memorable moment of your trip could be a trip to the local market, or a soccer game in a town square, or even just a great view from your hotel room.\nThe website Somfy gave people a simple task -- take a photo out of your window and describe how it makes you feel. The results, in the carousel above, make for a mesmerizing virtual voyage around the world.\nRead or Share this story: http://usat.ly/1I48lIP TOP VIDEOS", "external_links": ["http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737788555694876-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737789897468078-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737790365474078-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737793034668298-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737788318415834-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737788555694876-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737793034668298-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737787754312602-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737793520926532-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737789703089586-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737793034980302-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737787754156600-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737789897156074-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737790365474078-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737787481465104-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737788555694876-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737790365474078-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737789897156074-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737791094939430-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737788821366282-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737793309231818-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737790578104804-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737787754312602-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737787481465104-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737788318415834-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737788821366282-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737791094939430-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737788318415834-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737790578104804-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737788555694876-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737789703089586-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737788024352064-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737787222033778-UK-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737793520614528-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737793781761876-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737786503644568-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737792553558130-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737791094939430-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737793781917878-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737787222033778-UK-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737793520614528-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737793781917878-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737787481465104-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737790578416808-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737786503644568-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737793781761876-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737792553558130-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737789703089586-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737792553714132-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737793309231818-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737786503176562-night.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1I48lIP&text=Window%20views%3A%20An%20amazing%20photographic%20voyage%20around%20the%20world&via=usatoday", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737793520614528-night.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1I48lIP&mini=true", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737787473977008-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737789897156074-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737788024352064-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737793781761876-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737792553558130-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737788555694876-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737788023728056-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737791094939430-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737787754156600-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737793309231818-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737793520926532-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737789897468078-night.jpg", "http://www.gannett-cdn.com/media/", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737788555694876-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737787754312602-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737791094939430-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737793034980302-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737790578416808-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737793520926532-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737791094939430-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737790365474078-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737791094939430-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737788318415834-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737793781761876-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737793309231818-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737790578104804-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737787473977008-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737790365474078-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737788821210280-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737787754156600-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737793520614528-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737790578416808-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737787222033778-UK-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737787222033778-UK-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737793034668298-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737789897468078-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737793309231818-night.jpg", "http://www.gannett-cdn.com/-mm-/c26a51e38d5b56c3577c9e1c1bbf6e9b224ad853/c=0-3-760-1016&r=537&c=0-0-534-712/local/-/media/2015/07/30/USATODAY/USATODAY/635738502109404108-Untitled-1.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737787222033778-UK-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737788821210280-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737793034668298-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737787754312602-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737790365474078-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737793309231818-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737788821210280-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737793781917878-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737786503644568-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737791094939430-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737789703401590-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737786503644568-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737788318415834-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737786503176562-night.jpg", "https://www.somfysystems.com/the-view-from-here/", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737788023728056-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737792553558130-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737788318415834-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737787222033778-UK-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737788023728056-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737788555694876-day.jpg", "http://usat.ly/1I48lIP", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737789703089586-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737788318415834-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737789703401590-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737786503176562-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737789703401590-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737788555694876-night.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737792553714132-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737793781917878-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737788821210280-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737788024352064-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737793520926532-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737790365474078-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737792553714132-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737789897468078-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737788821366282-night.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737787473977008-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737788318415834-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737790365474078-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737793309231818-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737787222033778-UK-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737787222033778-UK-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737793034980302-night.jpg", "http://www.gannett-cdn.com/media/2015/07/30/USATODAY/USATODAY/635738502109404108-Untitled-1.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737787754156600-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737792553714132-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737789703401590-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737787473977008-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737789897156074-day.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737786503176562-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737788821366282-night.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737790578416808-day.jpg", "http://www.gannett-cdn.com/-mm-/6aad64e8e8f59587fbbe11a3809040adbf65d2d6/c=335-0-1665-1000&r=x1443&c=1920x1440/local/-/media/2015/07/29/USATODAY/USATODAY/635737788023728056-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737793309231818-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737788024352064-day.jpg", "http://www.gannett-cdn.com/-mm-/2bd85755c5bb9711ff7cb24b5cd17317c1d24996/c=335-0-1665-1000&r=x513&c=680x510/local/-/media/2015/07/29/USATODAY/USATODAY/635737793034980302-night.jpg", "http://www.gannett-cdn.com/media/2015/07/29/USATODAY/USATODAY/635737787481465104-day.jpg", "http://www.gannett-cdn.com/-mm-/1062e4ba1bd079a20bdca344113e1993f5902ab7/c=115-0-1885-1000&r=x48&c=80x45/local/-/media/2015/07/29/USATODAY/USATODAY/635737790578104804-night.jpg"], "published": "2015-07-30T16:31:00.000+03:00", "crawled": "2015-07-31T03:18:55.667+03:00", "highlightTitle": ""}