{"organizations": [], "uuid": "2915a76f9761a45fa359c9de638372dc6c636097", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61787/it-started-single-ransom-note-african-pride-melrose-arch-hotel", "country": "US", "title": "It started with a single ransom note : African Pride Melrose Arch Hotel", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "It started with a single ransom note : African Pride Melrose Arch Hotel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T12:50:00.000+03:00", "replies_count": 0, "uuid": "2915a76f9761a45fa359c9de638372dc6c636097"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61787/it-started-single-ransom-note-african-pride-melrose-arch-hotel", "ord_in_thread": 0, "title": "It started with a single ransom note : African Pride Melrose Arch Hotel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It started with a single ransom note : African Pride Melrose Arch Hotel Adv: \nJul 24, 2015 Adv: \nMarriott in Johannesburg at its African Pride Melrose Arch Hotel is asking Where is the duck? \nIt started with a single ransom note in the winter of 2003. The note appeared suddenly and mysteriously in the General Manager’s office at the African Pride Melrose Arch Hotel. It read simply: “if you want to see the duck again it’ll cost you a voucher for a weekend stay.” Since then there have been numerous notes. \n“Admittedly not all of them have been ransom notes,” says Nicholas Barenblatt, Group Marketing Manager of Protea Hotels. ”Some of the notes are quite warm and friendly, just letting us know that the little guy is being well taken care of. That he’s happy and enjoying a life full of shenanigans ranging from the life of luxury to the simple things like enjoying a good old bubble bath.” \nEver since the African Pride Melrose Arch Hotel was launched more than a decade ago GUESTS have been welcomed and made to feel at home by a bright yellow rubber duck on the bath tub. And ever since the hotel launched, GUESTS have been abducting that bright yellow fellow dubbed ‘AP Duck’ by the team at the hotel. \n“That duck has seen more of the world than I ever will,’ admits Barenblatt a little ruefully. ’I was on my honeymoon in a tropical paradise feeling pretty good about my life when I was sent yet another photo of AP Duck. He was jumping out of a plane somewhere over the Amazon with a world famous celebrity. Who can compete with that?” \nThe hotel has finally decided to admit defeat and accept that AP Duck will forever be stolen from the lap of luxury in the hotel and taken on decadent adventures. They just want to be kept up to date with where he is and what he’s up to. \nBarenblatt sounds only one note of caution:” We are absolutely not responsible for the hijinks he gets up to and we cannot send bail money for AP Duck. He’s a wild one and, once you abduct him, he’s all yours.” \nAs befits a duck of modern international intrigue, AP Duck, of course, has his own social media accounts. Anyone wanting to follow his exploits can see what this meister- of- sass gets up to by following him on social media platforms.", "external_links": [], "published": "2015-07-24T12:50:00.000+03:00", "crawled": "2015-07-24T22:25:30.380+03:00", "highlightTitle": ""}