{"organizations": [], "uuid": "4474cceb0c5b9e02c21862d3610b1ef054b2da53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27669-four-seasons-resort-langkawi-welcomes-general-manager-andrew-harrison", "country": "US", "title": "Four Seasons Resort Langkawi welcomes General Manager, Andrew Harrison", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Four Seasons Resort Langkawi welcomes General Manager, Andrew Harrison", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T17:45:00.000+03:00", "replies_count": 0, "uuid": "4474cceb0c5b9e02c21862d3610b1ef054b2da53"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/27669-four-seasons-resort-langkawi-welcomes-general-manager-andrew-harrison", "ord_in_thread": 0, "title": "Four Seasons Resort Langkawi welcomes General Manager, Andrew Harrison", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Four Seasons Resort Langkawi welcomes General Manager, Andrew Harrison Four Seasons Resort Langkawi welcomes General Manager, Andrew Harrison Details Category: Appointments   15:45 From a population of 22 million in Mumbai to 100,000 on Langkawi, Andrew Harrison joins as General Manager of the UNESCO Geopark’s Four Seasons Resort Langkawi. As a boy, Harrison would watch Whicker's World on TV, intrigued by the glitz of five-star hotels and exotic destinations. Having worked alongside his mother from an early age in her outside catering business, his first job was in his hometown of Harrogate, UK, where he started his career working in the restaurants, bars and banquets of The Old Swan Hotel. \nFrom then on he has since become a citizen of the world having worked in 10 countries and travelled to more than 60. He has spent the last 20 years as a Four Seasons \"nomad\" in paradisiacal islands and vibrant cities starting with Four Seasons in Bali, Kuala Lumpur, Florida and California, then becoming General Manager in Chiang Mai and opening the Tented Camp in the Golden Triangle, followed by further openings in Mauritius and Mumbai. With a passion for languages, Harrison is fluent in English, French and German. Over the years he has found a love for Russian and Indonesian, and his return to Peninsular Malaysia means he’s already working on perfecting his Bahasa Melayu. His latest move has also re-opened the doors to two of his main sporting hobbies: golf and cycling. Having opened Four Seasons Resort Mauritius at Anahita (complete with a spectacular Ernie Els-designed course), he’s in familiar territory with Langkawi’s award-winning Els Club, just 25 minutes from the Resort. And while traffic-choked Mumbai made cycling a harrowing experience, he is already enjoying switching gears through the glistening padi fields and traditional kampongs (villages), and is eagerly anticipating the archipelago’s annual Le Tour de Langkawi, Malaysia’s equivalent of Le Tour de France. \"It's great to return to Langkawi – this time to work,\" comments Harrison. \"It's a relatively undiscovered destination with amazing offerings beyond the postcard beaches. The UNESCO Geopark with its 550-million year old limestone cliffs, rainforest, mangroves, phenomenal birdlife and other indigenous wildlife is a gem to discover.\" Related articles", "external_links": [], "published": "2015-07-10T17:45:00.000+03:00", "crawled": "2015-07-10T17:49:58.000+03:00", "highlightTitle": ""}