{"organizations": ["American Express Global Business Travel"], "uuid": "17640157070d853977cce7cdbe8ac818b626ce4b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtTWQ==", "section_title": "Business Wire Travel: Lodging News", "url": "http://www.businesswire.com/news/home/20150722006489/en/American-Express-Global-Business-Travel-Appoints-Cindy", "country": "US", "title": "American Express Global Business Travel Appoints Cindy Allen as Chief Marketing Officer", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "American Express Global Business Travel Appoints Cindy Allen as Chief Marketing Officer", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T00:40:00.000+03:00", "replies_count": 0, "uuid": "17640157070d853977cce7cdbe8ac818b626ce4b"}, "author": "", "url": "http://www.businesswire.com/news/home/20150722006489/en/American-Express-Global-Business-Travel-Appoints-Cindy", "ord_in_thread": 0, "title": "American Express Global Business Travel Appoints Cindy Allen as Chief Marketing Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cindy Allen"], "text": "American Express Global Business Travel Appoints Cindy Allen as Chief Marketing Officer July 22, 2015 05:40 PM   \nNEW YORK-  American Express Global Business Travel (“GBT”) today announced the appointment of Cindy Allen as Chief Marketing Officer. In this role, Ms. Allen will oversee the Company’s brand positioning, marketing, product marketing and corporate communications and industry relations functions on a global level. Ms. Allen will report to GBT’s Chief Strategy Officer, Steve Curts. \n“Cindy is a highly regarded leader in the business travel industry, known for being a strategic visionary who can build strong brands, startups and teams,” said Mr. Curts. “As we continue to focus on creating differentiated value for our customers, Cindy will be a strong asset in monitoring and measuring their expectations and improving their experiences to realize our growth vision.” \nSince 2013, Ms. Allen has served as Vice President, Travel Management Company (TMC) Services, at Concur, where she was responsible for establishing and growing strong relationships with Concur’s TMC partners, as well as enhancing TMC technology offerings. Ms. Allen worked as the Chief Executive Officer and Chief Operating Officer for GDSX for five years until it became part of Concur, leading product diversification, establishing the company as a global brand, and significantly growing annual revenue. \nMs. Allen began her career in 1993 as Vice President and Co-Founder of StoneEagle.com, which provided the first real-time connections between enterprise insurance administration systems and the internet. During her time at StoneEagle.com, Ms. Allen worked in a variety of functions, including technology development, sales, implementation and support, and she helped to lead the company through three major waves of industry-changing innovation. \nMs. Allen serves on a variety of industry committees, including the Global Business Travel Association (GBTA) Technology and Peer Review committees, and she is a founding leader of WINiT – Women in Travel. \nAbout American Express Global Business Travel \nAmerican Express Global Business Travel enables corporations and empowers business travelers with insights, connections and exceptional customer service on a global scale. Through technology and information, American Express Global Business Travel provides leading travel solutions, integrated consulting services, proprietary research, and end-to-end meetings and events capabilities. These innovative offerings enable clients to optimize the return on their travel and meetings investments. \nAmerican Express Global Business Travel has operations and network partners in nearly 140 countries worldwide with approximately 12,000 employees. American Express Global Business Travel ranked first among corporate travel providers in the 2014 Corporate Travel 100 (“CT100”), an annual listing compiled by Business Travel News which ranks companies with the largest volume of U.S. air bookings. Learn more about how American Express Global Business Travel connects the world at amexglobalbusinesstravel.com and twitter.com/amexgbt . \nAmerican Express Global Business Travel (“GBT”) is a joint venture that is not wholly-owned by American Express Company or any of its subsidiaries (“American Express”). “American Express Global Business Travel”, “American Express” and the American Express logo are trademarks of American Express, and are used under limited license. Contacts \nFor American Express Global Business Travel Americas", "external_links": [], "published": "2015-07-23T00:40:00.000+03:00", "crawled": "2015-07-23T05:05:38.667+03:00", "highlightTitle": ""}