{"organizations": [], "uuid": "70edfd0a589da1f62b6228df9e5122097e528f3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://www.marketwire.com/library/MwGo/2015/7/28/11G048974/Panera_Bread_Company-1326078763551.jpg", "site_section": "http://www.marketwire.com/rss/mwTravelandHospitality.xml", "section_title": "Marketwired - Travel and Hospitality", "url": "http://www.marketwired.com/press-release/panera-bread-company-reports-q2-2015-diluted-eps-of-161-excluding-one-time-items-nasdaq-pnra-2042670.htm", "country": "CA", "title": "Panera Bread Company Reports Q2 2015 Diluted EPS of $1.61, Excluding One-Time Items", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Panera Bread Company Reports Q2 2015 Diluted EPS of $1.61, Excluding One-Time Items", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T23:58:00.000+03:00", "replies_count": 0, "uuid": "70edfd0a589da1f62b6228df9e5122097e528f3d"}, "author": "", "url": "http://www.marketwired.com/press-release/panera-bread-company-reports-q2-2015-diluted-eps-of-161-excluding-one-time-items-nasdaq-pnra-2042670.htm", "ord_in_thread": 0, "title": "Panera Bread Company Reports Q2 2015 Diluted EPS of $1.61, Excluding One-Time Items", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 28, 2015 16:58 ET Panera Bread Company Reports Q2 2015 Diluted EPS of $1.61, Excluding One-Time Items ST. LOUIS, MO --(Marketwired - July 28, 2015) - Panera Bread Company ( NASDAQ Q2 2015 Revenue increased 7% to $677 million Q2 2015 Company-owned comparable net bakery-cafe sales up 2.4% Q3 2015 (first 27 days) Company-owned comparable net bakery-cafe sales up 4.7% \nPanera Bread Company ( NASDAQ : PNRA ) today reported net income of $42 million, or $1.60 per diluted share, for fiscal Q2 2015. Diluted EPS for fiscal Q2 2015 was $1.61 or down 7%, excluding charges recorded in fiscal Q2 2015 related to the Company's previously announced refranchising initiative of $0.01 per diluted share, and excluding the $0.08 per diluted share benefit in fiscal Q2 2014 from a favorable resolution of an insurance coverage matter. The fiscal Q2 2015 results compare to reported net income of $49 million, or $1.82 per diluted share, for fiscal Q2 2014. A reconciliation of GAAP and non-GAAP information is attached to this release as Schedule V. \nThe Company's fiscal Q2 2015 consolidated statements of comprehensive income and margin analyses are attached to this release as Schedule I. The following table sets forth, for the periods indicated, certain items included in the Company's consolidated statements of comprehensive income (in thousands, except per share data and percentages), including net income and diluted EPS, excluding charges related to the Company's refranchising initiative and the benefit from favorable resolution of an insurance coverage matter, and net income and diluted EPS, as reported: For the 13 Weeks Ended Net income, excluding certain items Resolution of insurance coverage matter, after-tax Diluted EPS, excluding certain items Resolution of insurance coverage matter Shares used in diluted EPS \nFiscal Q2 2015 Results and Business Review \nComparable Net Bakery-Cafe Sales Growth \nIn fiscal Q2 2015, Company-owned comparable net bakery-cafe sales increased 2.4%, franchise-operated comparable net bakery-cafe sales increased 1.1%, and system-wide comparable net bakery-cafe sales increased 1.8% compared to the same period in fiscal 2014. \nThe Company-owned comparable net bakery-cafe sales increase of 2.4% in fiscal Q2 2015 was comprised of year-over-year transaction growth of 1.1% and average check growth of 1.3%. A schedule of comparable net bakery-cafe sales information is attached to this release as Schedule III. \nOperating Margin \nOperating margin for fiscal Q2 2015 declined approximately 150 basis points versus fiscal Q2 2014, excluding charges related to the Company's refranchising initiative, as outlined in Schedule V. This decline was primarily the result of structural wage increases and costs related to our strategic initiatives, partially offset by lower general and administrative expenses reflecting the Company's previously announced initiative to reduce core general and administrative expenses in fiscal 2015. \nNew Bakery-Cafe Development and AWS \nDuring fiscal Q2 2015, the Company opened 18 new bakery-cafes and its franchisees opened 12 new bakery-cafes. As a result, there were 1,926 bakery-cafes open system-wide as of June 30, 2015. Bakery-cafes as of March 31, 2015 Bakery-cafes as of June 30, 2015 \nAverage weekly sales (\"AWS\") for Company-owned \"Class of 2015\" bakery-cafes through fiscal Q2 2015 was $44,967. AWS for franchise-operated \"Class of 2015\" bakery-cafes through fiscal Q2 2015 was $49,683. \nA schedule of fiscal Q2 2015 AWS, including AWS information for bakery-cafes based on their designation as either a traditional or non-traditional bakery-cafe, is attached to this release as Schedule II. Non-traditional bakery-cafes refers to a range of alternate formats that the Company believes will allow it to more deeply penetrate existing and new territories with a range of different formats. \nUpdate on Key Value Enhancing Initiatives \nUse of Capital and Debt Financing \nDuring fiscal Q2 2015, the Company repurchased 680,379 shares at an average price of $183.69 per share for an aggregate purchase price of approximately $125.0 million. The Company had approximately $533.4 million available under the $750 million repurchase authorization as of Q2 2015. \nOn July 16, 2015, the Company secured a five-year, amortizing $300 million term loan. This term loan is incremental to the Company's $100 million term loan due June 11, 2019. To hedge exposure to variability in cash flows due to the impact of changes in interest rates, concurrent with the issuance of the $300 million term loan, the Company entered into forward-starting interest rate swaps with total initial notional value of $242.5 million. Considering the interest rate swaps, the combined effective rate of the term loans is expected to average approximately 3% over the life of the loans. \nRefranchising \nThe Company continues to make significant progress on its plan to refranchise 50 to 150 bakery-cafes. On July 14, 2015, the Company completed the sale of 29 bakery-cafes to an existing franchisee, bringing the year-to-date total to 30 bakery-cafes. The Company remains on track to reach its refranchising goal and expects to refranchise approximately 50 additional bakery-cafes by the end of fiscal Q3 2015. \nPanera 2.0 Conversions and Supplemental Information \nAs of fiscal Q2 2015, the Company had completed the conversion of 183 bakery-cafes to Panera 2.0, with 77 conversions completed year-to-date. The Company is releasing supplemental information, attached to this release as Schedule IV, detailing the performance of Company-owned bakery-cafes converted to Panera 2.0. \nFiscal Q3 2015 Comparable Net Bakery-Cafe Sales Growth \nThe Company announced today that Company-owned comparable net bakery-cafe sales in the first 27 days of fiscal Q3 2015 were up 4.7%. \nFull Year Fiscal 2015 Outlook \nDiluted EPS \nThe Company today reiterated its full year fiscal 2015 diluted earnings per share growth target of flat to down mid- to high-single digits when compared to full year fiscal 2014, excluding charges in fiscal 2015 for the Company's refranchising initiative and certain items for full year fiscal 2014, as disclosed in our fiscal Q4 2014 earnings release. \nComparable Net Bakery-Cafe Sales Growth \nThe Company reiterated its targeted range for fiscal 2015 Company-owned comparable net bakery-cafe sales growth of 2.0% to 3.5%. \nOperating Margin \nFor fiscal 2015, the Company continues to expect operating margin will be down 100 to 175 basis points when compared to fiscal 2014, excluding the impact of charges related to the Company's refranchising initiative. \nNew Bakery-Cafe Development \nThe Company continues to expect 105 to 115 system-wide new bakery-cafe openings in fiscal 2015 and is reconfirming its average weekly net sales performance target for new Company-owned bakery-cafes of $43,000 to $45,000. \nPanera 2.0 Conversions The Company continues to expect the conversion of approximately 300 Company-owned bakery-cafes to Panera 2.0 during fiscal 2015. \nConcluding Comment \nRon Shaich, Chairman and CEO, commented, \"Our strategic plan to generate increased shareholder value by making Panera a better competitive alternative with expanded growth opportunities is making a difference. Leading indicators are showing just that. Comp-store sales growth increased sequentially every month in Q2 2015 and reached 4.7% for the first 27 days of Q3. Panera 2.0, inclusive of digital access and improved operations, is working. Innovation in food, marketing and store design are having a positive impact on Panera's competitive position. Our initiatives to expand into several $1B+ adjacent businesses, including catering, delivery and CPG, are generating powerful sales growth and show increasing promise. However, the impact of the startup and ramp up costs associated with the hundreds of Panera 2.0 conversions expected in the third and fourth quarters of 2015 and the hundreds more expected in 2016, along with the dozens of delivery hubs opened in the past eighteen months, will dampen near-term profit growth. In our history, sales have led and profits have followed, and we believe that will again be the case at Panera. In fact, our leading indicators give us increased confidence in our strategic plan and in our potential to reignite significant earnings growth.\" \nNotes: \nThe Company will host a conference call that will be broadcast on the Internet at 8:30 A.M. Eastern Time on Wednesday, July 29, 2015 to discuss the fiscal Q2 2015 results, preliminary comparable net bakery-cafe sales results for the first 27 days of fiscal Q3 2015, and earnings targets and business outlook for the full year fiscal 2015. To access the call or view a copy of this release, go to http://www.panerabread.com/investor . Access to the call will be made available for 14 days, and the release will be archived for one year. \nThe Company includes in this release information on Company-owned, franchise-operated, and system-wide comparable net bakery-cafe sales percentages. Company-owned comparable net bakery-cafe sales percentages are based on net sales from Company-owned bakery-cafes included in base store bakery-cafes. Franchise-operated comparable net bakery-cafe sales percentages are based on net sales from franchised bakery-cafes, as reported by franchisees, that are included in base store bakery-cafes. Acquired Company-owned and franchise-operated bakery-cafes and other restaurant or bakery-cafe concepts are included in the Company's comparable net bakery-cafe sales percentages after it has acquired a 100 percent ownership interest and if such acquisition occurred prior to the first day of the Company's prior fiscal year. Comparable net bakery-cafe sales exclude closed locations. \nThe Company does not record franchise-operated net bakery-cafe sales as revenues. However, royalty revenues are calculated based on a percentage of franchise-operated net bakery-cafe sales, as reported by franchisees. The Company uses franchise-operated and net system-wide sales information internally in connection with store development decisions, planning, and budgeting analyses. The Company believes franchise-operated and net system-wide sales information is useful in assessing consumer acceptance of its brand; facilitates an understanding of its financial performance and the overall direction and trends of sales and operating income; helps the Company appreciate the effectiveness of its advertising and marketing initiatives which its franchisees also contribute based on a percentage of their net sales; and provides information that is relevant for comparison within the industry. \nAbout Panera Bread Company \n30 years ago, at a time when quick service meant low quality, Panera set out to challenge this expectation. We believed that food that was good and that you could feel good about, served in a warm and welcoming environment by people who cared, could bring out the best in all of us. To us, that is food as it should be and that is why we exist. \nSo we began with a simple commitment: to bake fresh bread from fresh dough in every bakery-cafe, every day. No artificial preservatives or short cuts, just bakers with simple ingredients and hot ovens. Each night, any unsold bread and baked goods were shared with neighbors in need. \nThese traditions carry on today, as we have continued to find ways to be an ally to our guests. That means crafting a menu of soups, salads and sandwiches that we are proud to feed our families. Like poultry and pork raised without antibiotics on our salads and sandwiches. A commitment to transparency and options that empower our guests to eat the way they want. Seasonal flavors and whole grains. And a commitment to removing artificial additives (flavors, colors, sweeteners and preservatives) from the food in our bakery-cafes. Why? Because we think that simpler is better and we believe in serving food as it should be. Because when you don't have to compromise to eat well, all that is left is the joy of eating. \nWe're also focused on improving quality and convenience. With investments in technology and operations, we now offer new ways to enjoy your Panera favorites -- like mobile ordering and Rapid Pick-Up for to-go orders -- all designed to make things easier for our guests. As of June 30, 2015, there were 1,926 bakery-cafes in 46 states and in Ontario, Canada operating under the Panera Bread ® , Saint Louis Bread Co. ® or Paradise Bakery & Cafe ® names. For more information, visit panerabread.com or find us on Twitter ( @panerabread ), Facebook ( facebook.com/panerabread ) or Instagram ( @panerabread ). \nMatters discussed in this news release and in our public disclosures, whether written or oral, relating to future events or our future performance, including any discussion, express or implied, regarding our intention to repurchase shares from time to time under the share repurchase program and the source of funding of such repurchases, our refranchising activities, our anticipated growth, operating results, plans, objectives, future earnings per share, and the impact of our investments in sales-building initiatives and operational capabilities on future sales and earnings, including Panera 2.0, contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These statements are often identified by the words \"believe,\" \"positioned,\" \"estimate,\" \"project,\" \"target,\" \"plan,\" \"goal,\" \"assumption,\" \"continue,\" \"intend,\" \"expect,\" \"future,\" \"anticipate,\" and other similar expressions, whether in the negative or the affirmative, that are not statements of historical fact. These forward-looking statements are not guarantees of future performance and involve certain risks, uncertainties, and assumptions that are difficult to predict, and you should not place undue reliance on our forward-looking statements. Our actual results and timing of certain events could differ materially from those anticipated in these forward-looking statements as a result of certain factors, including, but not limited to, those discussed from time to time in our reports filed with the Securities and Exchange Commission, including our Annual Report on Form 10-K for the fiscal year ended December 30, 2014 and our quarterly reports on Form 10-Q. All forward-looking statements and the internal projections and beliefs upon which we base our expectations included in this release are made only as of the date of this release and may change. While we may elect to update forward-looking statements at some point in the future, we expressly disclaim any obligation to update any forward-looking statements, whether as a result of new information, future events, or otherwise.", "external_links": [], "published": "2015-07-28T23:58:00.000+03:00", "crawled": "2015-07-29T00:24:19.247+03:00", "highlightTitle": ""}