{"organizations": [], "uuid": "f238773bab45afd81a1edc628d9c48f5c9a61215", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/travel.html", "section_title": "Travel", "url": "https://www.prbuzz.com/travel/335398-travel-navigator-offering-gifts-for-travelers-in-exchange-for-feedback.html", "country": "US", "title": "Travel Navigator Offering Gifts For Travelers In Exchange For Feedback", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Travel Navigator Offering Gifts For Travelers In Exchange For Feedback", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "f238773bab45afd81a1edc628d9c48f5c9a61215"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/travel/335398-travel-navigator-offering-gifts-for-travelers-in-exchange-for-feedback.html", "ord_in_thread": 0, "title": "Travel Navigator Offering Gifts For Travelers In Exchange For Feedback", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 9, 2015 - Dover, PA -- Travel Navigator, founded in 2015, has launched a VIP Club that will offer free products and extreme discounts on new travel accessories with the goal of getting increased user feedback. The company will launch its first product, a travel neck wallet on Amazon.com in July, 2015 and they will be offering a limited quantity of free units to VIP Club members, with deep discounts available for any VIPs that are not able to get the free item.\nIn exchange for the free or discounted product, Travel Navigator is looking for feedback in the form of an unbiased product review on Amazon.com, in compliance with Amazon's policies for user reviews (the reviewer must state that the product was received for free or at a discount).\nTravel Navigator will continue to offer freebies and discounts to the VIP Club in the future for upcoming product launches and for product testing in development. The VIP Club is free to join, members just need to leave their email address in the signup form and they will be notified when an offer is available.\nCharles Hynes of Travel Navigator spoke of the VIP Club by saying, \"We're excited to be able to offer avid travelers the opportunity to join our VIP Club for free. Club membership will give them access to great new products at very minimal prices, and it will help us to get user feedback from our target demographic. We'll be able to use this data to help with the development of future products, and hopefully it will be a great way for us to really connect with our most loyal fans and customers.\"\nTravel Navigator plans to expand its product line to include other styles of travel wallets, money belts, luggage tags, luggage straps, and other accessories for travels. The expansion is currently planned for late 2015 and throughout 2016. Information is available at the Travel Navigator website or on Facebook .\nAbout Travel Navigator\nTravel Navigator is a newly formed company that is currently developing an RFID-blocking passport holder to prevent pickpocketing and identity theft. The company is focused on providing safety and convenience-oriented travel accessories for both men and women.\nContact\nCharles Hynes\n7174674679\nThis email address is being protected from spambots. You need JavaScript enabled to view it.\nhttp://www.travelnavigatoraccessories.com/", "external_links": ["https://www.facebook.com/travelnavigatoraccessories/posts/438684932960184", "http://www.travelnavigatoraccessories.com/", "http://www.travelnavigatoraccessories.com/vip.html"], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-09T22:12:20.000+03:00", "highlightTitle": ""}