{"organizations": [], "uuid": "951ac2991236b034f25eecc4cc396fb6698d2eb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61981/greece-tourist-numbers-are-so-are-hotel-prices", "country": "US", "title": "Greece: Tourist numbers are up. So are hotel prices", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Greece: Tourist numbers are up. So are hotel prices", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T19:19:00.000+03:00", "replies_count": 0, "uuid": "951ac2991236b034f25eecc4cc396fb6698d2eb6"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61981/greece-tourist-numbers-are-so-are-hotel-prices", "ord_in_thread": 0, "title": "Greece: Tourist numbers are up. So are hotel prices", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greece: Tourist numbers are up. So are hotel prices Adv: \nJul 29, 2015 Adv: \nATHENS, Greece - A recent bailout package approved by the Greek parliament includes hefty austerity measures. The meat of the deal involves Greece dividing and selling $54 billion of the country's assets to the private sector in order to recapitalize its banking sector, on top of raising the pension age and cutting payouts. \nBut while the country sorts out its financial problems, inbound tourism may bring in much-needed funds. According to MeetPie, Greek DMCs say bookings are still coming in, while new airport figures show that inbound visitation from the UK has remained stable. \nGFK Ascent's Leisure Travel Monitor reported that throughout Greece's negotiations with the Eurozone, bookings from the UK for summer - taken January to the end of June - had risen 3 percent. \nLikewise, the number of bookings made in the month of June, when compared to June 2014, had also risen 3 per cent. \nIt comes after the government increased VAT on food and beverage and transportation on Monday from 13 per cent to 23 percent, in order to kickstart the country's bailout package. Hotels are starting to recoup these costs immediately, increasing prices for guests who are already staying in hotels and even further if their rates include meals. \nIn June, the head of the association of restaurant chains SEPOA, Thanassis Papanikolaou, warned in the Greek press that the VAT hike would cost thousands of jobs and businesses. \n\"We have the experience from 2011 when the increase from 13 to 23 percent in food service brought the shutdown of 4,500 enterprises and the loss of 40,000 jobs,\" Papanikolaou said to Greek news outlet Ekathimerini.", "external_links": [], "published": "2015-07-29T19:19:00.000+03:00", "crawled": "2015-07-29T22:30:53.206+03:00", "highlightTitle": ""}