{"organizations": [], "uuid": "9d81a2da986be65db77e252f3a2d62bd2f739708", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources3.news.com.au/images/2015/07/11/1227437/911751-76d45976-26b9-11e5-b33b-dc629bef0d9a.jpg", "site_section": "http://www.adelaidenow.com.au/travel/australia/victoria", "section_title": "Victoria | Travel Victoria | Melbourne Travel and VIC Holidays | The Advertiser", "url": "http://www.adelaidenow.com.au/business/china-crash-is-our-government-even-worried/story-fni0d2cp-1227437911777", "country": "US", "title": "Chinese stock market crash | Iron ore price volatility | Business News | Business and Finance News | |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Chinese stock market crash | Iron ore price volatility | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T20:33:00.000+03:00", "replies_count": 0, "uuid": "9d81a2da986be65db77e252f3a2d62bd2f739708"}, "author": "MALCOLM FARR", "url": "http://www.adelaidenow.com.au/business/china-crash-is-our-government-even-worried/story-fni0d2cp-1227437911777", "ord_in_thread": 0, "title": "Chinese stock market crash | Iron ore price volatility | Business News | Business and Finance News | |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AUSTRALIA has just been through what was potentially a major economic crisis, but don’t feel alone if you missed it.\nOn the surface at least, there was a surprising calm among our leaders despite the rather alarming realisation this week that some US$3 trillion had simply evaporated from the stock markets of China.\nTo put it in perspective, that’s roughly twice Australia’s annual GDP — our total national output. Much of it vanished in just three weeks from our most important trading destination, triggering warnings from economists of effects on everything from our exports to real estate prices .\nOur iron ore prices went south in rhythm with the collapsing Chinese markets. The price dipped to just US$44 a tonne, an 11 per cent drop in a short time, which made some smaller Australian miners unviable. The offshore price picked up to just above US$48 on Friday and a fall in the exchange rate of the Aussie dollar further helped exporters.\nAnd don’t forget all this was happening just while Greece was trying to duck its debt obligations, rattling all of Europe and most other points in the industrialised world.\nThere was no major statement from the Government. Had it been needed, it would have been difficult to find a senior minister to make one, as the Treasurer, the Assistant Treasurer and the\nFinance Minister were all on holidays, leaving Small Business Minister Bruce Bilson as Acting-Treasurer.\nOn Wednesday, Prime Minister Tony Abbott was asked about the China-Greek pincer move on our economy. Mr Abbott had just launched a grocery code and wasn’t going to be bumped off message by the major slump in the stocks of the world’s second biggest economy.\n“The important thing is to do whatever we can to build a strong and prosperous economy locally, and again I get back to the Grocery Code of Conduct,” said the Prime Minister, sticking firmly to the script.\n“This is about ensuring that we have the strongest possible local businesses to supply the strongest possible local businesses.”\nAustralian markets were more agitated than the Government, certainly more than the Prime Minister appeared to be, and were looking for relief from somewhere other than well-run supermarkets.\nANZ chief economist Warren Hogan was rattled enough to tweet: “on a serious note Aus can’t leverage consumer the way we did post Asia crisis so a global downturn now may require fiscal stimulus.\n“For Aus the key now is impact of China equity rout on China growth prospects and extent to which this hurts bulk commodity mkts.”\nThere were two factors which tended to ease some of the anxiety. One is that the Chinese economy is a massive beast and, even with a collapse in its stock exchanges, there is still a lot of money left to buy things from us.\nThe second was the expectations the centrally commanded Chinese economy would simply be ordered to fix itself. China works along capitalist lines but it is a type of capitalism that does what it is told.\nTrade was suspended in close to half the marketed stocks and the Chinese government, though a state-directed fund, began buying up shares to fire up the exchanges.\nHowever, the crash made clear even the most powerful communist government in the world can’t control the forces unleashed by capitalism, not even on home turf.\nThe stock market mess came after years of widespread speculation by ordinary Chinese, who borrowed dangerously at times to pay for their shares. It was an over-inflated market and there had to be a painful release of pressure.\nThe problem has not been eliminated and Australia remains vulnerable to further shocks from within the nation, which takes about 30 per cent of our exports. Opinion Journal: Could China Crash Global Markets? 3:34 Play video\nMorgan Stanley Investment Management Emerging Markets Head Ruchir Sharma on whether Chinas economic stumbles will affect the U.S. and Europe. Photo: Getty Images\nWSJ Live 11 Jul 2015 News/World Originally published as China crash: should we be worried?", "external_links": ["http://www.news.com.au/finance/economy/china-crash-could-hit-house-prices/story-e6frflo9-1227435671518", "http://www.news.com.au/finance/economy/chinese-chaos-worse-than-greece/story-fnu2pycd-1227430761673", "http://www.news.com.au/finance/economy/china-crash-is-our-government-even-worried/story-fnu2pwk8-1227437911777", "http://cdn.newsapi.com.au/image/v1/external?url=http://m.wsj.net/video/20150710/071015opinionstock/071015opinionstock_1280x720.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc"], "published": "2015-07-11T20:33:00.000+03:00", "crawled": "2015-07-11T13:54:00.000+03:00", "highlightTitle": ""}