{"organizations": [], "uuid": "14c6869a32655da049aed8e9602ceed58943bd86", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/20150712/c1_620512_620x413.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/news-and-pr/620512/bali-airport-reopens-after-volcano-ash-shutdown", "country": "TH", "title": "Bali airport reopens after volcano ash shutdown", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Bali airport reopens after volcano ash shutdown", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T13:55:00.000+03:00", "replies_count": 0, "uuid": "14c6869a32655da049aed8e9602ceed58943bd86"}, "author": "", "url": "http://www.bangkokpost.com/travel/news-and-pr/620512/bali-airport-reopens-after-volcano-ash-shutdown", "ord_in_thread": 0, "title": "Bali airport reopens after volcano ash shutdown", "locations": ["Bali"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bali airport reopens after volcano ash shutdown 12 Jul 2015 at 17:55 133 viewed 0 comments WRITER: AFP \nTravellers wait as flights are cancelled due to the eruption of Mount Raung in East Java, at Ngurah Rai International Airport in Bali, Indonesia, on Sunday. (AFP photo) - + DENPASAR — The airport on the Indonesian resort island of Bali reopened Sunday after an erupting volcano forced its closure for the second time in just a few days and caused fresh travel misery for stranded holidaymakers. \nMount Raung on Indonesia's main island of Java has been erupting for weeks, and on Thursday a cloud of drifting ash forced the closure of Bali airport during peak holiday season, and four others. \nThe airport on the resort island, a top holiday destination that attracts millions of foreign tourists every year, reopened two days later as the ash drifted away, allowing some passengers to board flights home and others to arrive. \nThe 3,300-metre Mount Raung volcano emits a column of ash and steam as seen from Banyuwangi, located in eastern Java island on Sunday. (AFP photo) \nHowever the cloud returned Sunday morning, forcing authorities to shut the airport again. But the new closure lasted just a few hours and the airport was reopened in the afternoon as the ash shifted, the government said. \n\"Full, normal operations have resumed, however planes are to fly in and out from a westerly direction to avoid the ash,\" Indonesian Transport Ministry spokesman J. A. Barata told AFP. \nThousands of tourists who were visiting the tropical island famed for its palm-fringed beaches found themselves waiting for days at Bali's Ngurah Rai airport, near the island's capital Denpasar, anxiously watching departure boards, sitting and sleeping on the floor. \nThe second closure added to the sense of chaos as many holidaymakers had headed to the airport to catch flights which had been delayed by the first shutdown. \n\"Someone just said the airport was closed for at least six hours ... gotta be kidding,\" said one stranded tourist, Steve Dunthorne, on Twitter, after hearing the news about the second closure. \n\"Standing in queue for check-in like a lemon. Staff look as confused as passengers.\" \nThe disruption comes at a bad time, with many Australians stuck in Bali after heading there for the school break and millions of Indonesian tourists setting off on holiday ahead of the Muslim celebration of Eid next week. \nGet full Bangkok Post printed newspaper experience on your digital devices with Bangkok Post e-newspaper . Try it out, it's totally free for 7 days.   0 people liked / 0  ", "external_links": [], "published": "2015-07-12T13:55:00.000+03:00", "crawled": "2015-07-12T14:35:22.000+03:00", "highlightTitle": ""}