{"organizations": ["Wyndham Vacation Rentals", "Avis"], "uuid": "1d308e9a2acd367f79e2ab9d7f518fb3cdc3228b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_9_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13225753/1/last-minute-travel-deals-from-wyndham-vacation-rentals-can-get-you-on-the-road-this-summer.html?cm_ven=RSSFeed", "country": "US", "title": "Last-minute Travel Deals From Wyndham Vacation Rentals Can Get You On The Road This Summer", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Last-minute Travel Deals From Wyndham Vacation Rentals Can Get You On The Road This Summer", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T18:39:00.000+03:00", "replies_count": 0, "uuid": "1d308e9a2acd367f79e2ab9d7f518fb3cdc3228b"}, "author": "", "url": "http://www.thestreet.com/story/13225753/1/last-minute-travel-deals-from-wyndham-vacation-rentals-can-get-you-on-the-road-this-summer.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Last-minute Travel Deals From Wyndham Vacation Rentals Can Get You On The Road This Summer", "locations": ["Charleston's Islands", "Steamboat Springs", "South Carolina", "Beaver Creek", "Hilton Head", "Tennessee", "Northwest Florida", "Colorado", "Alabama", "N.J.", "PARSIPPANY"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Reprint PARSIPPANY, N.J. , July 21, 2015 /PRNewswire/ -- Procrastinators: rejoice! It's not too late to book your summer vacation. Wyndham Vacation Rentals is offering a number of ways to get away in celebration of National Vacation Rental Month , from a road trip vacation sweepstakes to amazing last-minute deals at some of the most visited summer destinations. Road trips are one of the most popular types of summer vacations. In fact, a recent study 1 from Wyndham Vacation Rentals showed that nearly 90 percent of respondents were planning a road trip this summer. Through its Road to Happiness Sweepstakes *, Wyndham Vacation Rentals is giving one lucky winner the ultimate road trip vacation experience. You can enter for a grand prize getaway valued at more than $6,000 USD , including a Wyndham Vacation Rentals ® voucher, a car rental from Avis ® , a gas card, a mountable camera, and a cooler for road trip snacks. There are also daily prizes including road trip and vacation themed gifts like, sunglasses, luggage and a game package, now through July 31, 2015 when the sweepstakes closes. To enter the sweepstakes, follow these easy steps: Enter for a chance to win the grand prize in one easy step. Participate in daily social media challenges for a chance to win fun daily prizes (optional). Share the sweepstakes with your friends and family for additional grand prize entries (optional). While only one traveler will win the road trip grand prize vacation package, anyone can take advantage of the latest deals on WyndhamVacationRentals.com . Here's a peek at some of the current offers**: Save up to 25 percent off three or more nights at select locations in Northwest Florida (book until 7/31/15, travel by 9/30/15) Save up to 25 percent on your summer holiday in Steamboat Springs or Beaver Creek, Colorado (book until 9/5/15, travel by 9/7/15) Enjoy two free nights in beach homes on the Gulf Coast of Alabama (book until 7/31/15, travel by 8/17/15) Save 15 percent on summer cabin rentals in the Smoky Mountains of Tennessee (book until 7/31/15, travel by 8/9/15) Save 20 percent on summer getaways in Hilton Head , South Carolina (book until 8/4/15, travel by 8/8/15) Save 25 percent on properties on Charleston's Islands in South Carolina (book until 7/30/15, travel by 8/15/15) National Vacation Rental Month is observed during July because it is the most popular time of year for travelers to enjoy this type of accommodation. Throughout the month, vacation rentals are recognized as a better way to get away with more space, privacy and in-home amenities like kitchens and living rooms. 1 of 2", "external_links": [], "published": "2015-07-21T18:39:00.000+03:00", "crawled": "2015-07-21T18:55:12.119+03:00", "highlightTitle": ""}