{"organizations": ["CAA"], "uuid": "79acf31b80e99c1e6a6b0fe62618e780d0cee931", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/caa-postpones-atol-reporting-arrangements/4697803.article", "country": "GB", "title": "CAA postpones Atol reporting arrangements", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "CAA postpones Atol reporting arrangements", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T18:00:00.000+03:00", "replies_count": 0, "uuid": "79acf31b80e99c1e6a6b0fe62618e780d0cee931"}, "author": "", "url": "http://www.ttgdigital.com/news/caa-postpones-atol-reporting-arrangements/4697803.article", "ord_in_thread": 0, "title": "CAA postpones Atol reporting arrangements", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CAA postpones Atol reporting arrangements 7 July 2015 Save \nThe CAA has postponed its introduction of new financial reporting arrangements for Atol holders until next year. \nThe more stringent tests, which had been due to be introduced on October 1, have now been delayed until April 1, 2016, when any new Atol applicant will need to pass them. \nCurrent Atol holders will then have to pass the new tests until the Atol renewal round which ends in September 2016. \nA spokesman said in a statement: “The reason for this delay is that the CAA believes it is essential that the new tests are appropriate to the size of business and can be introduced in the planned online format without disruption to licence holders. \n“Our decision to retain the Small Business Atol (SBA) licence category has meant that the development of the tests has been more complex than expected and although this has resulted in only a limited delay, we judged it best not to rush the change to the potential detriment of Atol holders. \n“We will announce the full details of the new tests before the end of September, providing at least 12 months’ notice to companies affected by the changes. \n“The announcement will include an updated Financial Policy note that sets out the new tests applicable to SBAs and standard Atol holders licensed for less than £5 million.” \nThe statement added the CAA would continue to work with travel trade organisations to make sure the new test are fully understood while the new SBA solvency test will require certain licence holders to change their ATOL renewal date to fit in with their financial reporting cycle. \nLicence holders who are affected will be contacted about this change when they next renew their licence. \nAll other changes to ATOL announced as part of the rebalancing programme are proceeding as planned.", "external_links": [], "published": "2015-07-07T18:00:00.000+03:00", "crawled": "2015-07-07T21:22:02.000+03:00", "highlightTitle": ""}