{"organizations": [], "uuid": "6c5a0123dafa79a98a94b6eb3132c465edcf9f4d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://seattletimes.com/rss/destinations.xml", "section_title": "The Seattle Times » Sections » Travel", "url": "http://www.seattletimes.com/business/investors-pulling-back-as-gold-prices-plunge/", "country": "US", "title": "Investors pulling back as gold prices plunge", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Investors pulling back as gold prices plunge", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T00:06:00.000+03:00", "replies_count": 0, "uuid": "6c5a0123dafa79a98a94b6eb3132c465edcf9f4d"}, "author": "Seattle Times staff", "url": "http://www.seattletimes.com/business/investors-pulling-back-as-gold-prices-plunge/", "ord_in_thread": 0, "title": "Investors pulling back as gold prices plunge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Investors pulling back as gold prices plunge Originally published July 23, 2015 at 2:06 pm Speculators in July amassed record short holdings in the metal, meaning they’re wagering that the price has further to fall. By Seattle Times staff Bloomberg News \nWith gold prices tumbling to a five-year low, investors aren’t just getting out of gold, they’re betting against it. \nSpeculators in July amassed record short holdings in the metal, meaning they’re wagering that the price has further to fall. Also telling, the number of hedge funds that are hoping to profit from declines is near a record high. \nAltegris Investments’ $513 million Futures Evolution Strategy Fund has increased its bets that gold will fall. \n“The only place to be right now is short,” said Lara Magnusen, a La Jolla, California-based portfolio strategist at Altegris. “We’ve been in persistently downward price action for gold, but it’s been exacerbated, certainly, this year by a host of fundamental reasons.” Most Read Stories Glacier National Park wildfire forces tourists to leave cars \nIt’s been a painful two years for gold bulls, who by the end of 2012 had accumulated a record position after piling into gold exchange-traded funds and similar investments backed by the metal. Since then, more than $84 billion has been erased from the funds’ value, and their assets have dropped to the lowest level since March 2009. \nAfter drifting lower for most of 2015, prices plunged in July, dropping every week this month. Gold futures for August delivery rose 0.3 percent to $1,094.50 an ounce on the Comex on Thursday. The price touched $1,080 on Monday, the lowest since February 2010. \nOne factor in the decline was Federal Reserve Chair Janet Yellen confirming that the U.S. central bank will raise interest rates this year. Higher rates can draw investors toward bonds and away from gold. The prospect of higher rates is also boosting the dollar. A strong dollar tends to keep a lid on inflation, which also diminishes gold’s appeal as a hedge against rising prices. \nThe collapse in gold prices is part of a general commodities slump. Prices for everything from copper to oil to sugar are in a meltdown that’s signaling inflation will probably stay subdued. Seattle Times staff", "external_links": [], "published": "2015-07-24T00:06:00.000+03:00", "crawled": "2015-07-24T00:14:26.097+03:00", "highlightTitle": ""}