{"organizations": [], "uuid": "b8746d39f76fb8588aee8ea497abc36c1329ab87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/travel-new-and-now-arkansas-amazeum-beer-wine-and-shine-in-nc-oklahoma-spa-318641721.html", "country": "US", "title": "Travel new and now: Arkansas Amazeum; beer, wine and 'shine in NC; Oklahoma spa", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Travel new and now: Arkansas Amazeum; beer, wine and 'shine in NC; Oklahoma spa - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T11:57:00.000+03:00", "replies_count": 0, "uuid": "b8746d39f76fb8588aee8ea497abc36c1329ab87"}, "author": "Beth J. Harpaz, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/travel-new-and-now-arkansas-amazeum-beer-wine-and-shine-in-nc-oklahoma-spa-318641721.html", "ord_in_thread": 0, "title": "Travel new and now: Arkansas Amazeum; beer, wine and 'shine in NC; Oklahoma spa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ARKANSAS CHILDREN'S MUSEUM\nIt's a science museum. It's a children's museum. It's the Scott Family Amazeum.\nThe 50,000-square-foot Amazeum opened in July in Bentonville, Arkansas, where Crystal Bridges Museum of American Art opened in 2011. The city in northwest Arkansas is also home to the headquarters of Wal-Mart. Crystal Bridges was founded by Wal-Mart heir Alice Walton.\nThe Amazeum offers hands-on activities and interactive exhibits with a variety of themes ranging from pop culture to science. Exhibits include a mock neighbourhood market, a water play centre, a pioneer-style cabin and farm, a chocolate learning lab sponsored by Hershey's, a play area with Nickelodeon characters like SpongeBob SquarePants and a \"Tinkering Hub\" sponsored by 3M where kids can explore technology and create art. Details at http://www.amazeum.org/ .\nAdmission to the Amazeum is $9.50 for visitors age 2 and over.\nThe Scott family for whom the Amazeum is named includes former Wal-Mart CEO Lee Scott.\nThe region is also home to the Razorback Regional Greenway, a 36-mile bike-pedestrian trail running through seven Northwest Arkansas cities that opened in May.\n___\nBEER, WINE AND 'SHINE TRAIL IN NORTH CAROLINA\nHere's a catchy name for a themed trail in North Carolina: the Beer, Wine and 'Shine Trail.\nIt's located southeast of Raleigh in Johnston County, which is home to the largest number of working farms in North Carolina.\nThe term \"'shine\" refers to moonshine — legal, of course.\nFor wine, head to Gregory Vineyards, 275 Bowling Springs Drive, in Angier, and Hinnant Family Vineyards, 826 Pine Level-Micro Road, in Pine Level. For craft beer, check out Deep River Brewing Co., 700 W. Main St., in Clayton, and Double Barley Brewing, 3174 Highway 70 West, in Smithfield. And for the 'shine, there's Broadslab Distillery, 4682 NC Highway 50 South, in Benson, which offers tours and tastings.\nDetails at http://beerwineshinetrail.com/ .\n___\nOKLAHOMA SPA\nAn Oklahoma ranch that's now a hotel and Ayurvedic spa has just completed a $2 million expansion.\nThe Canebrake in Wagoner, Oklahoma, added 9,000 square feet for spa rooms, pool and other amenities.\nThe Canebrake is also the first hotel property in the state to receive the Oklahoma Department of Environmental Quality's gold-level certification for environmental sustainability. The expansion reused materials from the property's original structure and former riding arena and also uses LED lighting and low-energy appliances.\nAlso onsite are a yoga barn, conference facilities, a restaurant, hiking trails, fishing pond and a FEMA-approved storm shelter.\nThe Canebrake is located about 45 minutes from Tulsa.\nDetails at http://www.thecanebrake.com .\n ", "external_links": [], "published": "2015-07-27T11:57:00.000+03:00", "crawled": "2015-07-28T03:17:44.516+03:00", "highlightTitle": ""}