{"organizations": [], "uuid": "ee23957a191e036b1e8c11910e75372dc6136477", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61452/taiwan-makes-medical-insurance-mandatory-chinese-tourists", "country": "US", "title": "Taiwan makes medical insurance mandatory for Chinese tourists", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Taiwan makes medical insurance mandatory for Chinese tourists", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T05:45:00.000+03:00", "replies_count": 0, "uuid": "ee23957a191e036b1e8c11910e75372dc6136477"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61452/taiwan-makes-medical-insurance-mandatory-chinese-tourists", "ord_in_thread": 0, "title": "Taiwan makes medical insurance mandatory for Chinese tourists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Taiwan makes medical insurance mandatory for Chinese tourists Adv: \nJul 15, 2015 Adv: \nTAIPEI, Taiwan - Chinese tourists will from October not be able to obtain entry permits to Taiwan if they do not enclose in their applications valid documents proving they have purchased insurance covering unexpected illnesses or injuries sustained while traveling in Taiwan, the Tourism Bureau said yesterday. \nThe bureau said the new regulations are contained in the amended Regulations Governing Permits for People from the Mainland Area Engaging in Tourism Activities in Taiwan, adding that the policy would take effect on Oct. 1. \nTourism Bureau statistics show that more than 11 million Chinese tourists visited the nation in the past few years. \nWhile the increase in tourists coming from the other side of the Taiwan Strait has boosted the nation’s tourism revenue, the bureau said that it has created other issues, including the in rise in medical service charges owed by Chinese tourists. \nThe bureau said that Taiwanese travel agencies volunteered to pay the medical bills on behalf of their clients when the government had just relaxed its policy on Chinese tourists. \nHowever, they have gradually stopped picking up the tab because many Chinese tourists refused to pay what they owed after they left hospital, the bureau said. \nAccording to the Ministry of Health and Welfare, the accumulated medical fees owed by Chinese tourists have reached NT$5 million (US$160,256) in the past five years. \nThe bills topped NT$4 million last year alone. \nTravel Quality Assurance Association in Taiwan secretary-general Chen Yi-chuan said travel agencies are obligated to purchase liability insurance covering NT$2 million for each tourist. \nDefaults on medical bills usually occur after the tourists check out of hospital, he said.", "external_links": [], "published": "2015-07-15T05:45:00.000+03:00", "crawled": "2015-07-15T09:23:18.000+03:00", "highlightTitle": ""}