{"organizations": [], "uuid": "9dff11332f73785d81df2365bee8c02b95f6879e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.ca", "main_image": "http://i.huffpost.com/gen/3196900/images/o-ILES-facebook.jpg", "site_section": "http://www.huffingtonpost.ca/feeds/verticals/canada-travel/index.xml", "section_title": "Canada Travel - The Huffington Post", "url": "http://www.huffingtonpost.ca/trivagoca/french-landscapes_b_7807910.html", "country": "US", "title": "Off the Beaten Path: Explore Canada's French Landscapes", "performance_score": 0, "site": "huffingtonpost.ca", "participants_count": 1, "title_full": "Off the Beaten Path: Explore Canada's French Landscapes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T18:44:00.000+03:00", "replies_count": 0, "uuid": "9dff11332f73785d81df2365bee8c02b95f6879e"}, "author": "Trivago.ca", "url": "http://www.huffingtonpost.ca/trivagoca/french-landscapes_b_7807910.html", "ord_in_thread": 0, "title": "Off the Beaten Path: Explore Canada's French Landscapes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit trivago \nDreaming about practicing that hard-earned high school French, but your wallet is feeling a little too empty for a cross-Atlantic flight? Then it's time to head to Québec. \nFor an authentic French Canadian experience, take a step off the overly beaten path, and let trivago.ca guide you to five of the most beautiful towns and areas in La Belle Province where you can embrace our French and Acadian culture. \nÎles de la Madeleines ©Tourisme Îles de la Madeleines \nRed cliffs, crescent-shaped beaches, underwater caves, and classical French maritime architecture are just the start of what makes the Magdalen Islands so charming. Stay in the largest town Cap-aux-Meules and join into the local Acadian nightlife at a boîte à chansons , or kayak, windsurf, hike and whale watch as you explore the 12 islands that make up the archipelago. \nCharlevoix ©Tourisme Québec / Benoit Cecile \nStay in Charlevoix's charming towns of Baie St. Paul or La Malbaie to explore fjords, headlands, bays, and hills of this UNESCO World Biosphere Reserve. The Charlevoix region is a gourmand's dream, and the famous Route des Saveurs (Flavor Trail) -- starting in Petite-Rivière Saint-François and ending in La Malbaie -- is a must-try for any traveling foodie. \nTadoussac ©Luc Baron \nPerhaps the single best place to whale watch in Canada, Tadoussac is alive with marine wildlife and home to Canada's first marine national park. Step inside the petite chapelle de Tadoussac , the oldest church in the US and Canada, or hike up to Islet Point for a view of the Saguenay Fjord that will leave you breathless. \nPercé ©Tourisme Québec / Marc Loiselle \nThe town of Percé is home to one of the world's largest natural water arches, the Rocher Percé (Percé Rock). Visit at low tide, and walk right up to the hole in the rock. A favourite with bird lovers, visitors to the town can also take a ferry to Bonaventure Island, the world's largest and most accessible bird sanctuary. \nMont-Tremblant ©Association villégiature Tremblant \nThere's more to this crown jewel of the Laurentians than its winter ski slopes. Come summer in Mont-Tremblant, it's time to boat and swim Lac Tremblant, hike (or gondola) up the mountain, fish, enjoy the music of Les Rythmes Tremblant festival, or practice your French as you explore le petit village . MORE ON HUFFPOST:", "external_links": [], "published": "2015-07-16T18:44:00.000+03:00", "crawled": "2015-07-17T00:44:43.000+03:00", "highlightTitle": ""}