{"organizations": [], "uuid": "c2cd78c488e6bd1abc80b1bcb2164aec5f7139cb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/designimages/fb-og-image.png", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/new-orleans-own-trombone-shorty-on-main-stage-at-essence-fest-gives-others-locals-shot-too-311737931.html", "country": "US", "title": "New Orleans' own 'Trombone Shorty' on main stage at Essence, fest gives others locals shot too", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "New Orleans' own 'Trombone Shorty' on main stage at Essence, fest gives others locals shot too - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T10:58:00.000+03:00", "replies_count": 0, "uuid": "c2cd78c488e6bd1abc80b1bcb2164aec5f7139cb"}, "author": "Chevel Johnson, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/new-orleans-own-trombone-shorty-on-main-stage-at-essence-fest-gives-others-locals-shot-too-311737931.html", "ord_in_thread": 0, "title": "New Orleans' own 'Trombone Shorty' on main stage at Essence, fest gives others locals shot too", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS - He's no stranger to huge audiences and national exposure, but Troy \"Trombone Shorty\" Andrews says his upcoming performance at the Essence Festival is a dream come true.\nAndrews, known for high-energy shows with his band Orleans Avenue, regularly plays to big crowds. On Saturday, he performed with the Foo Fighters in Washington, D.C., and for the past few years he's been the closer for the final day of the New Orleans Jazz and Heritage Festival's largest stage.\nAndrews played in one of the Essence Festival smaller lounges — set up inside the Superdome's cavernous corridors — in 2009 and had a cameo on the main stage with Prince last year. But he didn't realize Sunday's Essence hometown performance would be on the big stage.\n\"That's big,\" he said in an interview with The Associated Press. \"I'm looking forward to it. I'm just gonna go out there and have some fun. I plan to bring a big party and joy to the stage and show them the way we do it in New Orleans.\n\"We're not scared at all. It can sometimes be frightening to perform before such massive audiences but we all dreamed as kids for just this kind of opportunity and we've prepared ourselves for this. We're ready.\"\nAndrews is the first local act to get an individual set on the festival's main stage.\n\"I'm happy to open the door and hopefully will give other local artists the opportunity to get out there,\" he said. \"I'm very excited about getting to represent the city on such a large stage. This festival brings a different demographic than others, such as Jazz Fest. Local artists have the chance to be discovered by a fan base that might never have heard of them. It's a great platform for musicians to meet people and jam with other musicians from around the world. It's pretty wonderful.\"\nEssence General Manager Joy Profet notes that Andrews is just one of many New Orleans-based artists who are sharing their gifts with festival fans this year. Others included rappers Mystikal and Dee-1, singers Teedra Moses, former \"Voice\" contestant Tonya Boyd Cannon and Tank and the Bangas and funk and jam band Dumpstaphunk, which includes Ivan and Ian Neville, the sons of Neville Brothers Aaron and Art Neville respectively.\n\"What makes the festival extraordinary is the deep penetration of New Orleans' music, food, culture and art, which is integral to our party and purpose,\" Profet said when asked about their inclusion in the lineup.\nDee-1, an LSU graduate and former middle school math teacher in Baker, Louisiana, is set to give fans a taste of his motivational rap-style honed to, as he said, help change lives.\n\"My content is used to help inspire people to maximize their potential in life,\" said Dee-1, whose real name is David Augustine. \"It's a like a bowl of gumbo, a bunch of different ingredients that makes clear I'm overtly positive and obvious that I'm a man of God and a Christian but my lyrics are also permeating and penetrating main stream hip-hop and I'm not relegated to just being a Christian rapper. That's what has people talking.\n\"I'm able to challenge people to step their game up as artists to accept our responsibility as role models and take their platforms more seriously.\"\nRCA Inspiration earlier this year released his major-label debut, \"3's Up,\" which was followed by his first headlining tour. Previously he opened for such acts as Macklemore and Lupe Fiasco.\nHe said he loves to perform before fans who know his music but isn't afraid to woo those who don't.\n\"This is an opportunity for me to prove myself,\" he said of his festival debut. \"For those who don't know me, I have the element of surprise. And though they might not know me when they come in, they're gonna be walking away saying 'Who is this guy? I need to find out.' And then when I see my fans reciting my lyrics, that just does something to me, I promise you, that never gets old.\"\n ", "external_links": [], "published": "2015-07-06T10:58:00.000+03:00", "crawled": "2015-07-06T16:47:54.000+03:00", "highlightTitle": ""}