{"organizations": [], "uuid": "c3dce84ad3c7bebf086dca5ba4996f394beee9d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-07/spain_travel_1_24072015.jpeg", "site_section": "http://www.themalaymailonline.com/feed/rss/travel", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/insider-tips-for-visiting-granada-from-a-singapore-expat", "country": "MY", "title": "Insider tips for visiting Granada from a Singapore expat", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Insider tips for visiting Granada from a Singapore expat", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T09:32:00.000+03:00", "replies_count": 0, "uuid": "c3dce84ad3c7bebf086dca5ba4996f394beee9d2"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/insider-tips-for-visiting-granada-from-a-singapore-expat", "ord_in_thread": 0, "title": "Insider tips for visiting Granada from a Singapore expat", "locations": ["Singapore"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Granada"], "text": "Insider tips for visiting Granada from a Singapore expat Friday July 24, 2015 Print Article \nLas Alpujarras, a rustic region filled with white-washed buildings. — TODAY pic MADRID, July 24 — Singapore-born travel writer Nellie Huang has called Granada home for five years. The 32-year-old avid traveller and her Granada-born husband Alberto finds this part of Spain the “most comfortable and welcoming”. \n“It is also very close to the mountains of Sierra Nevada as well as the beaches of Costa Tropical,” she said. \nWhere are we likely to find you on weekends? \nAlberto and I will head out to the nearby valleys and mountains. We especially love going to Los Cahorros, a ravine where you can hike on the valley bed or climb up the slopes for a view. \nAlberto’s family has a rural home in Las Alpujarras, a region that flanks the slopes of Sierra Nevada, and home to a series of white-washed villages where people still live in a natural and rural setting. It’s great for a weekend getaway. \nWhere are the hidden gems to check out? \nMost tourists tend to spend their time in touristy Albayzin, an area filled with white-washed houses perched on a hilltop. I recommend heading further up the hill to Sacromonte, a gypsy area packed with flamenco tablaos and caves rich in history. \nTravel writer, Nellie Huang, has called Granada home for five years. — Picture via TODAY What do the locals know about that the tourists don’t? \nThe tapas are free. Whether it’s an upscale lounge bar or a hole-in-the-world tapas bar, you’ll be served a small platter of food with any alcoholic or non-alcoholic drink you order. \nSome of my favourite tapas are berejenas al miel (deep-fried aubergine drenched with honey), boquerones fritos (fried anchovies) and seafood paella. I also like migas , a typical Granadian dish made of fried breadcrumbs tossed with chorizo sausage and green pepper. \nA drink costs no more than €2 (RM8.50) here. Order the tinto de verano (it means summer wine), which is a version of sangria made of red wine, tonic water and a slice of lemon. It tastes almost as good as sangria but costs much less. Only tourists order sangria. \nWhat’s a good place to stay? \nTry one of the cave hotels in Sacromonte. It may be a steep climb from the city centre, but it definitely offers visitors unique accommodation and spectacular views of the Alhambra and the city. There are a few to choose from, like Cuevas Montesclaros. Most are affordable, rustic and full of character. You can also find quite a few private cave apartments for rent on Airbnb. \nAny recommendations for good souvenirs? \nFlamenco is authentic and pure here, so getting a tailor-made flamenco dress would make for a good souvenir. — TODAY More Stories for You:", "external_links": [], "published": "2015-07-24T09:32:00.000+03:00", "crawled": "2015-07-24T11:14:27.653+03:00", "highlightTitle": ""}