{"organizations": [], "uuid": "2dd07fc2b51641e942a25eed09ac93181a02badc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.denverpost.com", "main_image": "http://extras.mnginteractive.com/live/media/site36/2015/0716/20150716__20150719_E9_TR19DERBYSHIRE~p1.jpg", "site_section": "http://www.denverpost.com/travel", "section_title": "Travel - The Denver Post", "url": "http://www.denverpost.com/travel/ci_28495486/peak-experiences-englands-derbyshire", "country": "US", "title": "Peak experiences in England's Derbyshire", "performance_score": 0, "site": "denverpost.com", "participants_count": 1, "title_full": "Peak experiences in England's Derbyshire - The Denver Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T10:45:00.000+03:00", "replies_count": 0, "uuid": "2dd07fc2b51641e942a25eed09ac93181a02badc"}, "author": "Alina Hartounian", "url": "http://www.denverpost.com/travel/ci_28495486/peak-experiences-englands-derbyshire", "ord_in_thread": 0, "title": "Peak experiences in England's Derbyshire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "DERBY, England — Snug in England's midsection, just under a 90-minute train ride away from London, sits the unassuming city of Derby (pronounced DAHR-bee). It may lack the name recognition of other British tourist magnets, but Derby's past helped shape the modern world. Derbyshire — the county in which Derby sits — gave birth to the Industrial Revolution with the opening of its Silk Mill, the first modern factory. It thrived in the Age of Enlightenment, and elements of its rich past have been carefully preserved in small museums, enormous stately homes and even centuries-old pubs.\nLand of Mr. Darcy\nOne of Derbyshire's most famous residents never actually existed. Mr. Darcy, of Jane Austen's \"Pride and Prejudice,\" hailed from the county. Local lore says that Austen based Darcy's home of Pemberley on Chatsworth House, one of England's most lavish stately homes. Filmmakers have taken note, using Chatsworth as a backdrop for 2005's \"Pride and Prejudice,\" and the more recent BBC miniseries aired on PBS, \"Death Comes to Pemberley.\" Within its towering walls is an impressive art collection built up over five centuries by the family that still lives there and opens its doors to visitors. Equally breathtaking are the surrounding grounds, which include a 19th century gravity-powered fountain that can shoot a stream of water about 295 feet. Advertisement Other highlights include a deceptively difficult hedge maze, a brass willow tree that spouts water from its branches, and hedges fashioned into furnishings from a home.\nPlague Village\nAmong the many picture-postcard villages tucked in Derbyshire's countryside is Eyam, also known as the Plague Village.\nThe disease came to Eyam via London in a rolled-up cloth and quickly spread in 1665, killing 260 villagers within 14 months. What made Eyam different was a local rector's decision to quarantine the village, a move that kept the pestilence from spreading across northern England. Church gatherings were held outside, the dead were buried in backyards instead of the churchyard and money was exchanged with other villages on a boundary stone where it could be washed in vinegar.\nVestiges of these heroics are all over the village, including the boundary stone and the cottages where the plague first took hold. The church includes a list of the plague dead and the grave of a single plague victim, the wife of the rector who called for the quarantine. A museum tells the villagers' stories, and plaques dotted around Eyam give slices of its history.\nExploring peaks\nMillions flock to Derbyshire to explore the towering Peak District, England's first national park. Walking trails wind throughout the Peaks, including the bike-friendly Monsal Trail and the Dovedale Trail, which leads to an isolated village.\nBakewell provides a convenient hopping-off point for hikers, especially those with a sweet tooth. The town is known for its eponymous Bakewell Tart and Bakewell Pudding. The tasty pastries are said to have been invented by a local hotel cook who mixed up a recipe.\nDrinking tour of Derby\nFor Peak District explorers parched at the end of a hard day's walk, Derby's city center offers a thriving pub scene steeped in history. The recently redone Silk Mill, a nod to Derby's industrial past, has plenty of flat English beers to wash down decadent pub grub. The Greyhound, which once sported all the hallmarks of an Old Man's Pub, is now a vibrant nightspot with an array of ales and lagers on tap. The oldest pub in Derby, and one of the oldest in England, is Ye Olde Dolphin Inn, circa 1530. Its rooms, warped by the centuries, are often crammed with both beer gourmets and gourmands. Tourists can also go on ghost walks that crawl through the city's pubs and underbelly, during which they can take in history lessons alongside other-worldly tales.\nAlso worth a visit:\n• The still-in-progress Silk Mill Museum — if just for a chat with its infinitely knowledgeable staff.\n• Pickford's House, for a glimpse of middle-class living in the 1700s.\n• The impossibly green grounds of Elvaston Castle, on the outskirts of the city.\nIf you go\nDerby: visitderby.co.uk . About 90 minutes by train from London, with frequent departures. Trains and buses that go through the Peak District: visitpeakdistrict.com/ peakconnections.\nChatsworth: chatsworth.org .", "external_links": ["http://visitpeakdistrict.com/"], "published": "2015-07-17T10:45:00.000+03:00", "crawled": "2015-07-18T06:26:12.000+03:00", "highlightTitle": ""}