{"organizations": [], "uuid": "c22a5d840c7ce542db3f698c83f56ae18e7995d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gofrance.about.com", "main_image": "http://f.tqn.com/y/gofrance/1/S/z/e/marseillenewmuscath20149079.JPG", "site_section": "http://z.about.com/6/g/gofrance/b/index.rdf", "section_title": "About France Travel", "url": "http://gofrance.about.com/od/Museums-and-Galleries/fl/Museum-of-the-Civilisations-of-Europe-and-the-Mediterranean-in-Marseille.htm", "country": "US", "title": "Museum of the Civilisations of Europe and the Mediterranean in Marseille", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Museum of the Civilisations of Europe and the Mediterranean in Marseille", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T22:04:00.000+03:00", "replies_count": 0, "uuid": "c22a5d840c7ce542db3f698c83f56ae18e7995d2"}, "author": "", "url": "http://gofrance.about.com/od/Museums-and-Galleries/fl/Museum-of-the-Civilisations-of-Europe-and-the-Mediterranean-in-Marseille.htm", "ord_in_thread": 0, "title": "Museum of the Civilisations of Europe and the Mediterranean in Marseille", "locations": ["Mediterranean", "Europe", "Marseille"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rudi Ricchoetti"], "text": "MuCem designed by Rudi Ricchoetti. Atout France/CØdric Helsly Introduction \nThe Museum of the Civilisations of Europe and the Mediterranean (MuCEM), is housed in a striking modern building in Marseille. Designed by Rudy Ricciotto, it was opened in 2013 at the entrance to the old Port. It's very much a symbol of the resurrection of this ancient Mediterranean port in the last few years. Today Marseille is an exciting, vibrant, lively city. And as it is now only 6 hours 27 minutes away by train from London Stl Pancras (without a change of trains), Marseille is a very attractive proposition for a short break in the sunshine of the south of France. (See information below.) The Site \nThe Museum is housed in both the new building, known as J4, and the historic Fort Saint-Jean, connected by a slender footbridge. There are two entrances, both through the Fort. You can enter via the Panier footbridge above the main road, or by the Vieux Port entrance. Fort Saint-Jean \nMarseille was strategically placed on the Mediterranean, an important port that was run by the Military Order of the Knights Hospitaller of Saint John of Jerusalem during the Crusades . The buildings were expanded in the mid 15 th century by King René of Provence who built the square tower by the water. But it wasn’t until 100 years later that the main fort was built by Louis XIV after a local rebellion by the people of Marseille. \nThe fort remained a military building up to the French Revolution when it became a prison. It then remained in the ownership of the French Army who used it for the African Army and the French Foreign Legion on their way to Algeria. During World War II, the Germans established an arsenal for ammunition against an air attack. In August 1944, the ammunition exploded, destroying much of the old fort. \nThe French government took over the fort after the war, but it wasn’t until 1960 that it passed to the Ministry of Cultural Affairs which classed it as a historical monument 4 years later. Fort Saint-Jean Exhibitions \nThe fort is used for temporary exhibitions, housed in the Georges-Henri Rivière building. You go through brick arcades and vaulted rooms, passing through the main courtyard and the guardhouse which shows a little of the military history of the building. Outside a series of terraces house different gardens, a Mediterranean kitchen garden, a cluster of oaks, and orange tree courtyard and more. The gardens are still in their early stages but what you get here and from the footbridge is a spectacular view over the harbour and out to sea. J4 \nJ4, the modern building on the site of an old pier houses the permanent Gallery of the Mediterranean, temporary exhibitions, a children’s area and an auditorium for films, concerts and performances. There’s also a bookstore, a brasserie and a restaurant with a panoramic terrace. Gallery of the Mediterranean \nHoused on level 0, the main exhibition is an ambitious one. Covering all the countries of the Mediterranean from east to west, it takes four major themes using a huge variety of art and artefacts. \nThe Birth of Agriculture shows the basis of our ancestors’ world. It goes from the prehistory of the Mediterranean through the development of arable farming and particularly the development of the all-important wheat grain. It explains the importance of water and how it was harnessed, shows a hut for semi-nomadic shepherds who took part in the transhumance, taking animals from their winter to their summer pastures. \nJerusalem, Holy City of Three Religions , is the story of this remarkable place. Claimed by Judaism, Christianity and Islam, the exhibits show how each religion regarded the city in the lives of the prophets that they all honoured. It’s thought-provoking, given the present day conflicts. \nCitizenship and Human Rights goes into the idea of citizenship: What does it mean? What rights does it give us? What responsibilities do we have? It dips into the idea of free cities and, naturally, places the French Revolution firmly in the middle of the history of France and Europe. \nBeyond the Known World starts with the ideas of exploring the unknown world through the instruments that early sailors used, pushing the bounds of knowledge and taking the ships into waters that they thought were full of strange monsters and sea creatures. A little psychology appears in our fear of the unknown section, a fear that was conquered by the lure of treasures from the Indes, of gold and spices, of precious textiles and delicate porcelain. It puts the Mediterranean into context; this was just one world among many and emphasises the importance of Greece and Athens in the ancient world. \nThe Museum takes you on a whirlwind tour in both time – it stretches over centuries, and in space – it takes a very wide area. It introduces a lot of ideas and does make you think outside the box. However, it's quite confusing as you walk from idea to idea, so make sure you take a gallery guide with you. Practical Information", "external_links": [], "published": "2015-07-29T22:04:00.000+03:00", "crawled": "2015-07-30T00:03:30.941+03:00", "highlightTitle": ""}