{"organizations": [], "uuid": "860b0e73f8f8fec4a05ca4a36ad46c6a50e90ad1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61521/mitsubishi-apologize-us-pows-forced-labor-wwii", "country": "US", "title": "Mitsubishi to apologize to US POWs for forced labor in WWII", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Mitsubishi to apologize to US POWs for forced labor in WWII", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T02:19:00.000+03:00", "replies_count": 0, "uuid": "860b0e73f8f8fec4a05ca4a36ad46c6a50e90ad1"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61521/mitsubishi-apologize-us-pows-forced-labor-wwii", "ord_in_thread": 0, "title": "Mitsubishi to apologize to US POWs for forced labor in WWII", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mitsubishi to apologize to US POWs for forced labor in WWII Adv: \nJul 16, 2015 Adv: \nNEW ORLEANS, LA - Attorneys of Herman, Herman & Katz began litigation in 1999 against Japanese corporation Mitsui Mining Co. Ltd. and related business entities, Mitsui & Co., Ltd., Mitsui & Co. (USA) Inc. and Mitsui Mining Co. USA, Inc. for subjecting Lester Tenney to slave labor at Mitsui mines from 1943 to 1945. Attorneys filed over 11 different actions in state court under a California state law enacted in July of 1999, allowing claims to be brought against those who had engaged in forced or slave labor in World War II. On October 6, 2003, the Supreme Court refused to review the decision of the federal trial court and court of appeals denying payment of fair wages to our veterans who were enslaved by Mitsubishi and other multibillion-dollar companies during WWII. \nLester Tenney was the first suit to be filed. Tenney's causes of action in the suit included forced labor, slavery/involuntary servitude, as well as civil assault and battery. \n\"It's about time, said Tenney, \"We fought this long not because we were denied money, food or medical care, it was about inhumane treatment, beatings and torture then that ran rampant while a prisoner of war. During the old days of Japan the samurai would commit Heri Keri rather than face the shame of doing these unthinkable things. I would like to thank the legal team who worked pro bono and members of Congress who worked for many years on behalf of our WWII soldiers who were victims of the unbelievably inhuman treatment of the Japanese government, Mitsubishi and other Japanese companies while my brethren and I were prisoners of war. I will never forget what you and the rest of our legal team did for us.\" \nMany in the news media came to the support of American POWs seeking justice. Articles appeared in Parade Magazine, Reader's Digest, USA Today, The New York Times and hundreds of other publications around the country. The Japanese press has extensively covered the American POWs' battle for justice. Led by then Sen. Joe Biden and Sen. Orrin Hatch, Congress passed a bill, which would have prevented further funding to the state department which intervened in the lawsuits on behalf of our veterans. At the last minute, the administration blocked passage. According to Herman, Herman & Katz partner Maury Herman, \"The apology from Mitsubishi is long overdue but welcomed.\" \nHerman Herman & Katz of New Orleans and its sister firm Herman Gerel in Atlanta were co-lead counsel in this effort along with the Washington DC based law firms of Patton Boggs and Greenberg Traurig, and California firms, The Law Offices of James Parkinson and the Casey Gerry firm. In addition, the Mississippi firm, Kitchens & Ellis of Jackson, Mississippi whose senior member is now Justice James Kitchens of the Mississippi Supreme Court, assisted in the effort. \nAll the law firms acted Pro Bono in the litigation and the legislative battle to seek justice for our WWII veterans imprisoned by the Japanese.", "external_links": [], "published": "2015-07-17T02:19:00.000+03:00", "crawled": "2015-07-17T11:08:51.000+03:00", "highlightTitle": ""}