{"organizations": [], "uuid": "14d2afd942fb9a921b93dba6791c76f8fbbfdc1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.egyptindependent.com", "main_image": "", "site_section": "http://www.egyptindependent.com/rss-feed-term/154/rss.xml", "section_title": "Egypt Independent: Travel", "url": "http://www.egyptindependent.com//news/eco-tourism-foreigners-unite-clean-dahab-s-beaches", "country": "US", "title": "Eco-tourism: Foreigners unite to clean Dahab’s beaches", "performance_score": 0, "site": "egyptindependent.com", "participants_count": 1, "title_full": "Eco-tourism: Foreigners unite to clean Dahab’s beaches", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T14:15:00.000+03:00", "replies_count": 0, "uuid": "14d2afd942fb9a921b93dba6791c76f8fbbfdc1e"}, "author": "Leita Boucicaut", "url": "http://www.egyptindependent.com//news/eco-tourism-foreigners-unite-clean-dahab-s-beaches", "ord_in_thread": 0, "title": "Eco-tourism: Foreigners unite to clean Dahab’s beaches", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Leita Boucicaut On a warm but breezy morning, seven people headed off from the Blue Hole, about 10 km north of Dahab, to clean up the 7 km beach that stretches from one of the world’s best known diving spots to the Ras Abu Gallum protectorate, home to crystal clear blue waters and reefs teeming with flora and fauna largely untouched by tourism. Clean-up group on July 3, 2015 The day’s activity was organized by local legend, Jimmy Dahab, who has been organizing guided trips and adventures in the area for almost 15 years. Originally from Monufiya, Jimmy fell in love with Dahab in 1999 and built his business from scratch there, currently operating Bishibishi Garden Village at the southern end of Dahab town. The intrepid group of people who were to spend five hours cleaning 5 km of shoreline, consisted of two Canadians, one Dutch, two Ukrainians, one Brit and Jimmy. Three of the seven people traveled up to Dahab from Cairo, while the others are based in Dahab and have already participated in unrelated clean-up efforts in and around the town. Sheila Hanney, a British woman who has been coming to Dahab since 2006, started a Facebook page called Plastic Free Planet along with other concerned conservationists in 2014. She has already organized six different clean-ups in and around the town and knows that one of the biggest complaints tourists have upon arrival is the amount of plastic strewn around the area, making it hazardous for marine life. “I would love to see the Sinai litter free,” she said. “The walk from Blue Hole to Ras Abu Gallum is so beautiful but is spoilt by the rubbish. I went to Ras Mohammed National Park this week and it’s so clean it’s spotless, it can be done! “Our oceans are literally our life blood,” she added. “We need to keep them as clean as possible.” A five-hour job Upon arrival at the Blue Hole on Friday, July 3, the participants were treated to free tea seasoned with mint and sage at a local cafe. The shop manager, aware that foreigners were going to clean up a beach in his country, refused to let them pay, as it was his duty to show his appreciation for their efforts. The group set off to the beach along with four camels that would carry the recycled rice bags full of refuse and plastics. Trash on the beach. Photo courtesy of Andre Hoeijmakers Jimmy, who was fasting on that warm Ramadan day, had organized bags in two sections, one bag for garbage and the other for recyclables. The bags were to be left at a fisherman’s hut which would later be picked up by the camels, brought to a recycling bin in Dahab and then sent on to Suez where they will be recycled into plumbing pipes. Approximately 30 bags were filled along the 5km distance over a period of five hours, approximately two thirds of the distance the group had hoped to clean up. The heat, exhaustion and lack of extra bags forced the group to stop, though all were satisfied with the work that had been done. A few of the bags filled with plastics and garbage. Photo courtesy of Andre Hoeijmakers Among the items found on the beach were plastic bottle caps, plastic water bottles, plastic bags that often disintegrated when picked up due to the sun and salt, odd shoes, bits and pieces of cloth or old rugs, jerry cans that held remnants of oil probably used to refill fishing boats and even medical waste, such as old medication and a syringe. Bottle caps were the most commonly found item on the beach. Photo courtesy of Andre Hoeijmakers As the participants approached fishermens’ huts, areas that were uninhabited but used as stop gaps for the men to rest and prepare seafood, the amount of trash increased exponentially, making it clear that the locals were responsible for a lot of the garbage found. Other rubbish most likely came in from the Gulf of Aqaba, either from Saudi Arabia, from boats passing through or downstream from other communities along the coast. The group naturally split into two groups. One that scoured the shoreline and another that searched further inland. Photo courtesy of Andre Hoeijmakers Ukrainian couple Katya Tsekhmister and Max Vreshch had only planned to come to Dahab for a short vacation, but fell in love with the area and have been here for six months. They have participated in four clean-ups since their arrival and have launched a YouTube channel with videos from each of their clean-ups. “We think it’s important (to clean up) all over the world but especially you think about this when you see a lot of trash around you. And it seems that the authorities and local people don’t care much about this, which is a real pity,” said Tsekhmister. “At every clean-up we make a video about the event and try to encourage people not to throw trash and care about nature. We understand that just cleaning can’t solve this problem as the main point is to educate people not to make the streets dirty.” The group arrived in Ras Abu Gallum around 2:00 pm and all the members immediately headed to the cool, blue water to wash off the sweat and fatigue. Ras Abu Gallum Protectorate in South Sinai. Photo courtesy of Andre Hoeijmakers Those who had joined from Dahab later returned home, while the group from Cairo started the touristic part of this first eco-tourism trip organized by Jimmy. Video of July 3, 2015 beach clean-up in Dahab courtesy of Max Vreshch Eco-tourism Eco-tourism is not all about work for the clean-up crew, as they also reserved time to enjoy the newly-cleaned coastline. The trip consisted of a bus ride to Dahab, followed by the clean-up, an afternoon eating and snorkeling at Ras Abu Gallum and a night at the Blue Lagoon. The next day, the group returned to Ras Abu Gallum where a boat took them back to the Blue Hole. They were able to see the fruits of their labor as they passed by the same coastline they had cleaned up less than 24 hours earlier. The three from Cairo were then dropped off in Dahab where they had a few hours to walk around and shop before taking the bus back to Cairo. Kite surfing at the Blue Lagoon. Photo by Leita Boucicaut When asked about his decision to join the group from Cairo, Andre Hoeijmakers, a Dutch man, said, “I believe it is important to keep fragile, pristine and relatively undisturbed natural areas clean from litter as this has a negative impact on the environment, as well as on the perception of tourists, especially areas used for low-impact and small scale tourism. “Cleaning the coastline from the Blue Hole to Abu Gallum will educate not only the travelers and the local fishermen, but it will also directly benefit the economic development of the local community as people want to keep coming back to this beautiful place,” added Hoeijmakers. Since tourism is one of the only elements that help the local Bedouins survive in South Sinai, the youth are sent out to sell handmade trinkets to tourists. Bracelets, necklaces, wallets and pendants made out of shells from the sea are common items sold in the area and the youngsters are enthusiastic salespeople. Unlike the Blue Hole, where there are many other tourists to watch out for and swim around, one of the many attractions offered by Ras Abu Gallum is the quietude and the opportunity to go snorkeling or scuba diving which some, like Jimmy, say is a nicer place for sea life as the reefs there are less affected by humans. The ocean life includes beds of live sponge and large coral colored in dusty blues and purples, muted yellows and greens as backdrops to extraordinarily bright fish, such as napoleon fish, parrotfish and lionfish, a very different sight from warmer water coral reefs located closer to the equator. The Blue Lagoon at dusk. Photo by Leita Boucicaut Approximately 3-4 km north of Ras Abu Gallum is the Blue Lagoon. The energy and landscape changes yet again there as 10 to 15 basic huts hug a bay with turquoise, glassy water, the perfect place to learn kite surfing, a trendy aquatic activity that tourists from around the world have become enamored with. At night, the distant lights of Dahab and small villages along the coast of Saudi Arabia line the horizon, but the biggest source of light is either the moon above or the majesty of the Milky Way Galaxy. The huts are simple, with wooden walls and palm leaf roofs, the cool air and the sound of the waves crashing against the shore easily lulling people to sleep. Jimmy the Legend Though Jimmy has been running guided tours in and around Dahab for over a decade, he feels that the time may be right to offer a new kind of tourism: eco-tourism. The concept would be to combine traditional activities, such as hiking, snorkeling and sightseeing, with a slant towards improving the environment. “I love Dahab and I want everyone to benefit from its beauty,” he said. “I do believe what we have here is a gift and we need to take care of it and protect it. I see us and the environment as one family.” Though Dahab is the poorer brother of Sharm el-Sheikh or Hurghada, according to many foreigners who have visited those places it offers a certain individuality and relaxed atmosphere that the richer resort towns lack. It is a haven for individual travelers, those that want to experience something different from the often soul-less resorts found throughout the world. Tsekhmister agrees. “(Dahab) is totally different from Sharm or Hurghada and perfectly suits people who are looking for adventure and active rest, not just staying at the hotel’s beach.” It is this unique quality to Dahab that has people returning again and again. If Jimmy can combine the instant love for the place with an environmental spin, it could become a new avenue for income the area has yet to see. Jimmy holding some of the plastic bottles recovered from the beach. Photo courtesy of Andre Hoeijmakers When asked why foreigners tend to be more likely to be involved in clean-up efforts, Jimmy was matter of fact. “It is more in the foreigners’ education and culture (to take care of the environment). There are and there have been a lot of problems in Egypt and the biggest one is education. It all boils down to education and culture.” Jimmy hopes to be able to incorporate clean-up efforts in all of his trips, whether at the beach, in the mountains or in the desert. “I am connected to the environment, like the fish are to the sea,” Jimmy said. “I hope Dahab and Egypt will be stable and fruitful. Moreover, I hope Dahab will be tourists’ first taste of Egypt, as it is a simple, beautiful and magical paradise.” To contact Jimmy and organize trips of this kind in and around Dahab, visit his website at Bishibishi Garden Village or contact him by email at [email protected] .", "external_links": [], "published": "2015-07-12T14:15:00.000+03:00", "crawled": "2015-07-12T15:15:55.000+03:00", "highlightTitle": ""}