{"organizations": [], "uuid": "d0d7da334bf138bdd29c19526491089320e48f5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.palmbeachpost.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/07/01/66/69/Grand-Funk-Railroad.jpg", "site_section": "http://www.palmbeachpost.com/s/travel/", "section_title": "Florida Travel | www.palmbeachpost.com", "url": "http://www.palmbeachpost.com/news/travel/rock-music-cruise-at-ft-lauderdale-cruise-lines-ce/nmqNR/", "country": "US", "title": "Rock music cruise at Ft. Lauderdale; cruise lines celebrate...", "performance_score": 0, "site": "palmbeachpost.com", "participants_count": 1, "title_full": "Rock music cruise at Ft. Lauderdale; cruise lines celebrate... | www.palmbeachpost.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T00:50:00.000+03:00", "replies_count": 0, "uuid": "d0d7da334bf138bdd29c19526491089320e48f5a"}, "author": "Sy O'Neill", "url": "http://www.palmbeachpost.com/news/travel/rock-music-cruise-at-ft-lauderdale-cruise-lines-ce/nmqNR/", "ord_in_thread": 0, "title": "Rock music cruise at Ft. Lauderdale; cruise lines celebrate...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MAJOR MILESTONES: European shipyards are so busy with new builds, it’s getting hard to keep track of what’s on the horizon.\nLast week Carnival Vista’s exterior outfitting was completed at the Fincantieri shipyard in Monfalcone, Italy. The 133,500-ton ship — the line’s newest, largest and most innovative vessel — is set to debut in Europe May 1 and will begin year-round Caribbean cruises from PortMiami in November 2016.\nGrand Funk Railroad will be among the headliners on the Rock Legends Cruise IV sailing out of Fort Lauderdale Jan. 21. (Contributed) To mark the occasion, a ceremony was held during which a commemorative coin was welded to the ship’s mast. The tradition dates back to the ancient Romans, who believed that attaching coins to a ship provided divine protection.\nAnother tradition is to select a godmother to preside over the ceremony. That honor went to 6-year-old Kye Heald, daughter of the cruise line’s Senior Cruise Director and Brand Ambassador John Heald.\nCarnival Vista will feature the first IMAX Theater on a cruise ship; a suspended cycling experience called SkyRide; the line’s first on-board brewery; and Carnival’s first inner-tube raft slide, the 455-foot-long Kaleid-o-Slide.\nGet up to date on the new ship with a preview video and construction footage at www.carnival.com/carnivalvista .\nFincantieri’s shipyard in Ancona, Italy was just as busy last week, floating out Viking Sea, the second ship for Viking Ocean Cruises.\nThe float-out ceremony — significant because it denotes a ship moving into its final stage of construction — began with the maritime tradition of welding coins under the ship mast.\nKarine Hagen, Viking’s senior vice president of product and daughter of Viking’s chairman and CEO Torstein Hagen, will be godmother and officially name the ship during the christening ceremony in early 2016.\nThe 930-passenger Viking Sea follows sister ship Viking Star, which debuted in April. A third ship, Viking Sky, is also under construction in Ancona and will debut in 2017.\nAll three ships will sail popular routes in Scandinavia and the Baltic, and the Western and Eastern Mediterranean.\nDetails are at www.vikingoceancruises.com .\nMUSICAL NOTES: Grammy Award-winning vocalist Natalie Cole will headline the inaugural Blue Note jazz-themed cruise, which will debut on Cunard’s flagship, Queen Mary 2 on Oct. 29 from New York City.\nCole will join a roster of jazz musicians on this transatlantic crossing, including jazz pianist and record producer Robert Glasper; trumpet player Keyon Harrold; tenor saxophonist Marcus Strickland; guitarist Lionel Loueke; bassist Derrick Hodge; and drummer Kendrick Scott.\nThe cruise also will feature intimate jazz performances by Blue Note’s 75th anniversary supergroup, Our Point of View, as well as a Q&A with Grammy Award-winning producer and president of Blue Note, Don Was.\nMore information is at www.cunard.com , under “destinations” on the menu.\nIf rock is more your taste in music, the Rock Legends Cruise IV, sponsored by the Native American Heritage Association, still has staterooms available for its Jan. 21-25 sailing.\nHeadliners include Peter Frampton, Grand Funk Railroad, America, Foghat, Gregg Allman, The Marshall Tucker Band and The Outlaws.\nSail on Royal Caribbean’s Independence of the Seas, leaving Fort Lauderdale for a four-night voyage that includes a stop in Grand Turk. Two sea days offer the opportunity for lots of music!\nBook through www.rocklegendscruise.com .\n</span", "external_links": ["http://www.carnival.com/carnivalvista", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/07/01/66/69/Grand-Funk-Railroad.jpg"], "published": "2015-07-03T00:50:00.000+03:00", "crawled": "2015-07-03T05:35:01.000+03:00", "highlightTitle": ""}