{"organizations": [], "uuid": "ddbcd1f838e3453183a25e82cd2260c967f655fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/MSC-Cruises-300x216.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-technology-news/", "section_title": "Travel Technology news | Travel and Tour World | Online technology news | distributive system | mobile application |travel trade professionalsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/interglobe-technologies-strengthens-its-cruise-industry-solutions-to-deliver-expertise-and-innovation/", "country": "US", "title": "InterGlobe Technologies Strengthens Its Cruise Industry Solutions to Deliver Expertise and Innovation - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "InterGlobe Technologies Strengthens Its Cruise Industry Solutions to Deliver Expertise and Innovation - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "ddbcd1f838e3453183a25e82cd2260c967f655fe"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/interglobe-technologies-strengthens-its-cruise-industry-solutions-to-deliver-expertise-and-innovation/", "ord_in_thread": 0, "title": "InterGlobe Technologies Strengthens Its Cruise Industry Solutions to Deliver Expertise and Innovation - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "InterGlobe Technologies Strengthens Its Cruise Industry Solutions to Deliver Expertise and Innovation Published on : Tuesday, July 21, 2015\nInterGlobe Technologies (IGT), a leading global provider of travel technology and outsourcing solutions for the travel and hospitality industry, announced enhancements to its range of cruise, transport and hospitality industry solutions, aimed at enriching the passenger experience and delivering specialized processes and expertise. Highlights include integrating innovative technologies like smart drones, social media analytics and integrated IT and BPM for on-board and on-shore based operations to enable tremendous cost savings and competitive edge.\nRanked among the world’s top 3 travel technology solution providers, with 7000+ experts, and 11 global delivery centers, IGT employs a global delivery approach to seamlessly manage their customer’s operations anywhere in the world. Its enhanced offerings will enable cruise liners to effectively manage passenger and crew handling, and optimize big data and inventory control.\n“Our focus is to provide advanced solutions, with integrated IT-BPM services, and tailored for our cruise industry and offshore shipping customers. We work with some of the largest cruise operators, and our continuous effort is to propel a strong partnership both in building world-class cruise experience and in their operations management.” adds Vipul Doshi, CEO, IGT.\nIGT’s established presence in the travel industry spans over fifteen years, and they work with the world’s two biggest cruise liners, among others. Strengthening service delivery will bring travel expertise closer to customers to enable quicker services and stronger support for operations as it forms a seamless innovative network, one of the first in the cruise industry on this scale.\nBy enabling the best talent and technologies to serve the needs of the cruise market, IGT will target some of the industry’s most critical areas such as customer experience, big data, business intelligence, social media and analytics. IGT recently expanded its global operations with its 11th global delivery center in Manila, Philippines earlier this month. IGT is currently engaged in projects for some of the largest travel brands in the world and holds strategic alliances with key travel technology partners.\nRelated Posts TripAdvisor Antalya Akaryn Hospitality Management Services Selects Agilysys Solution Suite Siemens to realign regional organization and strengthen corporate units Tourism Australia boasts 5 million Facebook page fans worldwide", "external_links": [], "published": "2015-07-21T03:00:00.000+03:00", "crawled": "2015-07-21T23:46:14.775+03:00", "highlightTitle": ""}