{"organizations": [], "uuid": "cf47ca212257e27ab431d60bca8c3dd46a7fa58c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "travelerfolio.com", "main_image": "http://travelerfolio.com/tf4/photos/2015/07/real-madrid-fc-stadium.jpg", "site_section": "http://travelerfolio.com/feed/", "section_title": "Travelerfolio - Travel Blog Singapore", "url": "http://travelerfolio.com/madrid-spain/", "country": "US", "title": "Spain (Day 7, 8): Madrid", "performance_score": 0, "site": "travelerfolio.com", "participants_count": 1, "title_full": "Spain (Day 7, 8): Madrid", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T10:59:00.000+03:00", "replies_count": 0, "uuid": "cf47ca212257e27ab431d60bca8c3dd46a7fa58c"}, "author": "Eunice Khong", "url": "http://travelerfolio.com/madrid-spain/", "ord_in_thread": 0, "title": "Spain (Day 7, 8): Madrid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spain (Day 7, 8): Madrid \nWords & Photos by Kelly Khong \nContinued from Spain (Day 6): Segovia \nThe final leg of our trip was to Madrid, the capital and largest city of Spain. \nStarting off from Plaza Mayor, the central plaza in the city of Madrid today. It was built during Philip III’s reign (1598–1621). \nThe plaza is bustling with life. Buskers are entertaining, as usual, and tourists stroll around the square surrounded by three-storey residential buildings having 237 balconies facing the Plaza. It has a total of nine entranceways. The Casa de la Panadería is a municipal and cultural building on the north side of the Plaza Mayor in Madrid. \nFrom a stone’s throw away, our guide brought us to Mercado San Miguel (The Market of San Miguel) which offers a pleasing selection of Spanish delicacies and premium ingredients. \nOne of Madrid’s oldest markets, this enigma building used to be a traditional market which has been reinvented into one trendy marketplace. Soak into the atmosphere of Spanish food culture as stalls, shops and bars offer everything that can possibly please your tastebuds. \nOur guide later brought us around to the quiet corners and neighborhoods of Madrid to show us the life of a typical Spainian living through the past heritage and modern today. \nSpanish people sitting out – al fresco style to enjoy a cup of coffee and soak in the warm sun. \nTraditional grocery stores in Madrid \nCapturing everyday’s life in the city of Madrid. A man having a haircut in a traditional barber shop. \nTake a stroll in the neighbourhood park. \nIn Madrid, you can find amazing legacy – Sobrino de Botín, founded in 1725, is the oldest restaurant still running in the world. \nHere is the Guinness World Records certificate. Opened in 1725 and still operating, the world’s oldest restaurant even retains the original 18th century firewood oven! \nSuckling pigs at ‘Sobrino de Botin’– the oldest restaurant in the world. \nMadrid is also a shopper’s paradise. Fashion lovers will find everything they want here. For the ultimate “one-stop” shopping experience, visit El Corte Inglés de Castellana, located in central Madrid, Paseo de la Castellana. With advertising slogan ‘The store for all your purchases’, El Corte Inglés de Castellana lives up to its name as the largest Spanish retail group and one of the world leaders in department stores, housing well-known European brands such as Loewe, Cartier, Bottega Veneta, Bulgari, Gucci, Hermes, Miu Miu, LV, Prada, Yves Saint Laurent, Burberry, Rolex, Piaget and many more. \nAnd the main reason for shopping in Spain – it has the highest tax refund in Europe. Enjoy retail therapy while you are there! \nThe department stores also pride their customer services as part of the shopping experience, especially for tourists. There are a group of dedicated international professional consultants with specific training and mastery of languages such as Chinese, Russian, Portuguese and English – feel at home as you splurge for your favorite brand! \nVisit the tourist information desk and the friendly staff can advise you for VAT refunds, shipments of merchandise and many more. For non-resident foreign tourist, get yourself a 10% reward card in addition to the tax refunds, where you can redeem the balance in your following purchases. \nApart from shopping, as your hunger pangs kick in, the Gourmet Experience space offers fine dining and top cuisine selections. Our lunch was so satisfying at Gourmet Experience. \nWhether you are a football fan or not, when you are in Madrid, the Santiago Bernabéu Stadium tour is worth a visit for the world famous football club – Real Madrid. \nThe entry ticket is 19.00 € for adult, which takes about 1 to 2 hours tour. Real Madrid, here I come! \nWith a current capacity of 81,044 spectators, Santiago Bernabéu Stadium looks spectacular even when it is empty. In the tour, you will get to walk through the changing rooms, player’s tunnel, benches, coaching area, press room and lastly the souvenir stores to take home the official jerseys and memorabilia. \nTo end off the exciting day, we had the opportunity to appreciate Flamenco dance at Tablao Las Carboneras during dinner time. Flamenco dance is a form of Spanish folk music and dance. The Flamenco dancers and singers were very passionate, and the vitality of the dance, music and singing really brought out the Spanish invigorating personality and their love for life. \nPacking up to leave Spain for home… It was a wonderful journey exploring world heritage sites, colourful culture and meeting interesting people. The country has a plethora of magnificent places with steep history, picturesque landscapes and exciting city lifestyles. Let Spain be your next European holiday destination. \n**Special thanks to Spain Tourism Board for the invitation to Madrid and discovering the World Heritage Sites in Spain.", "external_links": [], "published": "2015-07-24T10:59:00.000+03:00", "crawled": "2015-07-25T06:07:25.581+03:00", "highlightTitle": ""}