{"organizations": [], "uuid": "5ca1344c995c6901c11058a43f12ce0952555b1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61288/south-africa-may-introduce-3-year-visa-indian-tourists", "country": "US", "title": "South Africa may introduce 3-year visa for Indian tourists", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "South Africa may introduce 3-year visa for Indian tourists", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T06:15:00.000+03:00", "replies_count": 0, "uuid": "5ca1344c995c6901c11058a43f12ce0952555b1d"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61288/south-africa-may-introduce-3-year-visa-indian-tourists", "ord_in_thread": 0, "title": "South Africa may introduce 3-year visa for Indian tourists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South Africa may introduce 3-year visa for Indian tourists Adv: \nJul 10, 2015 Adv: \nMUMBAI, India - South Africa is mulling the introduction of tourist visas with 3 years validity for Indians to bolster traffic to the country, its minister of home affairs said on Thursday. \nIndians currently get tourist visas with a validity of 30 days. \nMalugi Gigaba met his Indian counterpart Rajnath Singh to discuss the initiative. He also requested that South Africa be included in India's list of countries that can avail of e-visa facilities. \nIndia last year opened up e-visa facilitation to 43 countries. In May this year, 15,659 foreign tourists arrived on the e-visa to India compared to 1,833 last year. More than a lakh arrived between January and May on e-visas, compared to less than 10,000 last year. \nSouth Africa also currently allows a business visa with 10-year validity for Indians. Gigaba proposed this be reciprocated for South African corporates coming to India. \n\"We expect these plans to be implemented by next year,\" Gigaba told reporters in Mumbai. \nIndia is the 15th biggest contributor of tourism inflows to South Africa, one position ahead of China. Indian tourists have been flocking to South Africa, especially in the past two years, as the country's stable currency provided a welcome alternative to dollar-denominated nations. According to the South Africa tourism board, Indian tourist arrivals to the country doubled between 2009 and 2013 to 133,000. But recent numbers have tapered down. Indian tourists in February to South Africa totaled 4,989, down 26% on year. \nOverall tourist inflows to South Africa this year have slowed down, thanks to new rules that increase documentation for tourists who are taking children along. The rule, that came into effect on June 1, says that if both parents are travelling with children below 18 years of age, they have to submit birth certificates for each child in addition to their passports and visas at the port of entry. This is aimed protecting children from human trafficking, instances of which are high in the country. \nFor India however, the government has clarified that the parents' passport should be enough documentation for the children. \"We shouldn't be so ambitious so as not to expect a drop (in tourism numbers),\" Gigaba said, but added there has to be a balance between \"voracious desire for tourists and a desire to secure the country.\"", "external_links": [], "published": "2015-07-10T06:15:00.000+03:00", "crawled": "2015-07-10T07:41:19.000+03:00", "highlightTitle": ""}