{"organizations": ["Egyptian Ministry of Tourism"], "uuid": "3c54b3fb3d5ffe4e7639d4e6ddf575e22fc4c61c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/pr/images/2015/hurg_2015_07_07.jpg", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/Arab_tourism_to_Egypt_rises_214-ZAWYA20150707083250/", "country": "AE", "title": "Arab tourism to Egypt rises 21.4%", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Arab tourism to Egypt rises 21.4%", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T11:49:00.000+03:00", "replies_count": 0, "uuid": "3c54b3fb3d5ffe4e7639d4e6ddf575e22fc4c61c"}, "author": "", "url": "http://www.zawya.com/story/Arab_tourism_to_Egypt_rises_214-ZAWYA20150707083250/", "ord_in_thread": 0, "title": "Arab tourism to Egypt rises 21.4%", "locations": ["Egypt", "Kuwaiti", "Middle East Arab", "Dubai", "Egyptsince", "Beirut"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Arab"], "text": "Beirut hotel occupancy second lowest in Middle East Arab tourists increase by 21.4% during the first five months of 2015 compared with the same period in 2014•The number of tourists from around the world who visited Egypt during the first five months of 2015has increased by 9% compared with the same period last year•The number of tourists from around the world who visited Egypt in May 2015has increased by 16.5% comparedwith the same period in 2014•The number of Arab tourists in May 2015 has increased by 23.1% comparedwith the same period in 2014•Arab tourists comprised 17% of the total number of tourists who visited Egypt during the first five months of 2015, comparedwith 15% in the same period in 2014•The number of Emirati tourists has increased by 48.3% during the first five month of 2015, compared to the same period in 2014 •The number of Saudi tourists has increasedby 67.2% during the first five months of 2015,comparedwiththe same period in 2014•The number of Kuwaiti tourists has increased by 48.6% during the first five months of 2015, compared to the same period in 2014 Dubai - Efforts by the Egyptian Ministry of Tourism and the Egyptian Tourism Authority (ETA) to revive tourism to the country continue to be reflected in the sustained growth of visitors to Egyptsince early 2015. May 2015 statistics indicate a steady increase in the number of tourists compared with the same period last year.The number of visitors who traveled to Egypt inMay 2015 increased by 16.5% from the number of visitors in May 2014. In a similar trend, the number of Arab tourists who visited Egypt in May 2015also increased by 23.1% from the number of Arab tourists in May 2014. \nThese statistics demonstrate the positive impact of recently launched campaigns that aim to attract more tourists from all over the world to Egypt.This increase in visitors is in line with the objectives of the Ministry of Tourism's\"Masr Qariba\" (\"Egypt is close\") campaign which specifically targets Arab tourists from Saudi Arabia, UAE and Kuwait.Both the Ministry and the Authority are ramping up efforts prior to the launch of their forthcoming global advertising and publicity campaignwhich will focus on cultural tourism in the country. This new campaign aims to promote the importance of Egypt's cultural destinations among family and youth demographics. Bycreating tourist packages that combine visits to cultural destinations with opportunities to stay at beach resorts, the campaign hopes to highlight all that Egypt has to offer. \nStatistics reflect an increase in the number of Emirati tourists by 48.3% during the first five months of 2015 compared with the same period in 2014. In May 2015, the number of Emirati tourists who visited Egypt increased by 43.5% compared to May 2014. Statistics also demonstrate an increase in the number of Saudi tourists by 67.2% during the first five months of 2015 compared with the same period last year. In May 2015, the number of Saudi tourists who visited Egypt increased by 58.2% compared to May 2014. Moreover, Saudi Arabia has been ranked fourth in terms of the number of tourists and nights spent in Egypt during May 2015. In addition, the Saudi Arabia tourists who stayed in Egypt's hotels increased by 53.7% in May 2015 compared to same period in 2014. \nFurthermore, the number of Kuwaiti tourists increased by 48.6% in the first five months of 2015 compared with the same period last year. In May 2015, the number of Kuwaiti tourists who visited Egypt increased by 74.4% compared to May 2014. Moreover, Kuwait is ranked ninth in terms of the number oftouristsand nights spent in Egypt during May 2015. ETA Chairman, Mr.Sami Mahmoud, expressed his enthusiasm about these developments:\"These positive results reflect that Egypt has fans from all over the world, particularly from our Arab neighbors. The steady increase in Arab tourists demonstrates their trust and belief in Egypt'sability to provide its visitors with opportunities to enjoy the most beautiful touristic destinations. Specifically, the 'Masr Qariba' campaign will continue to play a key role in attracting tourists and welcome them in their second home, Egypt.\" \n-Ends-", "external_links": [], "published": "2015-07-07T11:49:00.000+03:00", "crawled": "2015-07-08T08:18:02.000+03:00", "highlightTitle": ""}