{"organizations": [], "uuid": "21933526fdfb5bd18d22feba365f5f6648c54ff1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/l/p/q/s/image.related.StuffLandscapeSixteenByNine.620x349.15ccc7.png/1435874564171.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/themes/short-breaks/69440119/Weekender-In-hot-water-in-Hanmer", "country": "AU", "title": "Weekender: In hot water in Hanmer", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Weekender: In hot water in Hanmer", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T01:02:00.000+03:00", "replies_count": 0, "uuid": "21933526fdfb5bd18d22feba365f5f6648c54ff1"}, "author": "Abbie Napier", "url": "http://www.stuff.co.nz/travel/themes/short-breaks/69440119/Weekender-In-hot-water-in-Hanmer", "ord_in_thread": 0, "title": "Weekender: In hot water in Hanmer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Weekender: In hot water in Hanmer ABBIE NAPIER Last updated 05:00, July 5 2015 Supplied \nThe Heritage Hanmer Springs against a classic Hanmer sunset. \nHanmer is just a short drive from Christchurch and offers the chance to properly unwind. \nTHE SETTING Hanmer Springs sits snuggly under Conical Hill. The little township is popular with tourists and less than 10 kilometres off State Highway 7 if you're travelling between Christchurch and the West Coast via Lewis Pass. tJust 90 minutes north of Christchurch, it's a convenient getaway for city slickers looking to entertain the kids during winter school holidays or breathe some fresh mountain air For a luxury accommodation option, the Heritage is right in the centre of town with views of the mountains and sweeping landscaped gardens. THE SPACE Stepping in from blustering wind whipping up the grand entrance driveway, the lobby at the Heritage is warm and calm. The property has been popular with visitors to the area since the late 1800s, when a lodge was built on the site. In 1932, a proper hotel was built, with a nod to Spanish style in its arches and sweeping facade. The original hotel remains today, albeit with significant upgrades, and welcomes guests year-round. As the township developed its adventure tourism options and hot pools , more modern villas were built on the grounds In the main hotel, there are heritage-style carpets, a large central staircase and a cavernous dining room with garden views. It is grand without being overdone and it's easy to feel comfortable here. If you're after some pampering, the hotel is just a few minutes' walk from the Hanmer Springs Thermal Pools and Spa, where guests can book massage or beauty treatments or just kick back and luxuriate in the soothing mountain waters. THE KIT Our room in the main lodge is spacious, complete with a lounge area, main bedroom and ensuite. The furnishings are modern takes on older styles – high wingback chairs and flowing curtains hooked back from the windows. The balcony offers a tranquil vantage point over the rear garden, sheltered from the wind. The ensuite is white on white with all the standard offerings. The towelling robes are a nice touch for those venturing to and from the hot pools. You can also enjoy the hotel pool, pentanque and tennis court should the weather suit. COMFORT FACTOR The Heritage offers everything a hotel in its price range should. The beds are comfortable and the shower hot and high pressure. Our room has plenty of heating and we actually need to open the balcony doors to prevent cooking in our skins. The lounge furniture could be more comfortable, but who is sitting around in their hotel room when the springs beckon? \nFOOD \nStepping into the hotel restaurant, Isobel's, we resist the urge for a glass of red wine in front of the huge fireplace. The restaurant's grandiose proportions conjure up images of lavish soirees held under the high ceilings. Isobel's has a new chef, Polish-born Mirek Karpowicz, who favours a classic menu paired with modern presentation. A lamb trio and the Canterbury-bred Angus steak are beautifully prepared and immaculately presented on charcoal tiles. We accept the waiter's suggestion to finish the meal with the chocolate lava cake and he is bang on in his recommendation.The hotel offers a standard buffet breakfast as well as an a la carte menu. \nWORTH STEPPING OUT FOR Hanmer is a town begging to be strolled around. Finding a good coffee is a tall order but if you do, use it to warm the cockles while you take in the cutesy little side streets and merino clothing shops. Hanmer seems to be home to some of the best sunsets around so make it your mission to see at least one from a high vantage point during your stay. The place is very child friendly and thus suited to family breaks. \nTHE VERDICT Hanmer has much to offer and the Heritage certainly provides all the comforts a tourist or city-escapee could hope for. GETTING THERE If you love small planes, Hanmer does have an airport. For those not completely unhinged, driving is the way to go. From Christchurch, head north on State Highway 1 to Waipara and consider stopping for a wine tasting on the way. Hang a left at the junction just after Pegasus Bay Winery . Travel late in the day for the full glory of the mountain sunset. Turn off where the Waiau River almosts touches the highway at the 7A junction and continue another 10 minutes to the Hanmer township. \nESSENTIALS Rooms at the Heritage range in price from $159 to $300-plus in winter, but some packages include meals or pamper treatments at the spa down the road. The hotel caters to families as well as singles and couples, there is wheelchair access and conference facilities. heritagehotels.co.nz \nWHILE YOU ARE THERE Swim The whole town is geared around the thermal pools, which are packed from morning to night in winter. The streets are dotted with chilled tourists dashing about in towels, robes and damp winter clothing. Entry $22 per adult and $11 per child, not including access to the waterslides, which is another $10 per person. For those wanting to go truly pruney, the hottest pools are the raised sulphur soakers, which are about 40 degrees Celsius. A race between these and the cooler options is probably your best bet. \nSpa The neighbouring spa offers a whole host of body treatments from facials and manicures through to deeply relaxing massages. Conveniently, spa guests can pop out to the pools straight from the spa, thus eliminating the dash down the footpath out the front. Treatment prices vary but massages start at $85 and body treatments from $120. It's a slick operation complete with white robes, soft slippers and herbal teas. Ad Feedback \nExplore If you're not the group-bathing kind of holiday-maker, you might like to venture into the great outdoors. Hanmer is known for its walks and running tracks, mountain-biking adventures and fly fishing. A true treat and one out of the box is a trek with Hanmer Llamas. The llamas carry the packs (not you) and walks range from two hours ($40) through to multi-day hikes. Apparently there are naturally occurring hot springs about 10 hours from town and the llamas will carry your bottle of wine! \nRisk it For those with a desire to throw themselves off, under or into things, Thrillseekers is the local adventure tourism outfit. It offers jet boating, bungy jumping, canoe safaris, paintball and so on. Its base is just after the turn-off to Hanmer – you'll know you've gone too far when you see someone leaping off the side of the tiny bridge outside your car door. TThe perfect choice for some hardcore family bonding in a dinghy or on a quad bike. \nIn town For the more sedate visitor, perhaps a round of two of mini-golf or visit to The Lolly Pot to indulge the sweet tooth. Hanmer has two mini-golf courses, both of which are pretty central. There's also a proper golf course a short walk from the village centre. \nCrafty How about an embroidery getawayStash Palace does weekend retreats for creative souls including workshops, stitching sessions and even provides information about local wineries. Speaking of, Marble Point Winery is about 13 kilometres away if you want to escape the village for an hour and do a tasting. If you're too lazy, there is a bottle shop next to the Four Square in town. - Stuff", "external_links": [], "published": "2015-07-03T01:02:00.000+03:00", "crawled": "2015-07-04T22:34:13.000+03:00", "highlightTitle": ""}