{"organizations": [], "uuid": "540adf307d7abefdd330f4e0b82131adfa31de0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/08/South-Africa-tourism.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tourist-arrival-south-africa-falls-46-5in-1st-q-of-2015/", "country": "US", "title": "Tourist arrival to South Africa falls by 46.5% in 1st Q of 2015", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Tourist arrival to South Africa falls by 46.5% in 1st Q of 2015 - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:00:00.000+03:00", "replies_count": 0, "uuid": "540adf307d7abefdd330f4e0b82131adfa31de0e"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/tourist-arrival-south-africa-falls-46-5in-1st-q-of-2015/", "ord_in_thread": 0, "title": "Tourist arrival to South Africa falls by 46.5% in 1st Q of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tourist arrival to South Africa falls by 46.5% in 1st Q of 2015 Published on : Wednesday, July 15, 2015\nTourists arriving from Russia to South Africa fell to 46.5% in the first quarter of 2015 as observed by the Southern African Tourism Services Association. The trend is quite the same in China and India, where tourist traffic has plummeted by 37.9% and 15% respectively. South Africa’s stringent new visa regulations are being blamed for this huge difference. Deputy Home Affairs Minister Fatima is planning to visit China to help improve the situation.\nA workshop organized by Wesgro-organised workshop on the new visa regulations this week, Cullinan Holdings CEO Michael Tollman challenged Ms Chohan to accompany him to China. He said the deputy minister would see firsthand how the downward slide in visitor numbers could be curbed. The systematic drop is specially being observed from the Brics source market.\nThe South African consulates in Beijing and Shanghai had not installed the biometric machines required to capture visa applicants’ details, as stipulated in the new regulations according to the CEO David Frost. “Arrivals from Russia, where prospective tourists have to travel to Moscow to apply for a visa, have plummeted 46.5% in the first quarter of 2015. The decline in arrivals from China for the same period was 37.9%. “\nCompetitor destination like Mauritius is receiving more Chinese tourists and observing strong tourism growth from the Brics. In the last five months the growth escalated to 26.6%.\nAccording to estimates, SA could lose about R1.2bn in direct tourist spending because of the decline.Ms Chohan said: “Let us implement them (visa regulations) and then mitigate afterwards. It is about how we communicate when we put issues on the table. I think we can have a 50% growth in tourism numbers if we all work together.”\nHome Affairs Minister Malusi Gigaba said on Thursday that while he expected the new visa rules to dent tourism in the first year, they would not hurt the sector in the long term.\n“We don’t think we should be so ambitious as to not expect a drop,” Mr Gigaba said during a visit to India. He did not provide numbers, but said the initial dip was not significant.\nThe South African officials are working on resolving issues with Air China which had already decided to suspend flights to the region owing to the low passenger traffic.\nRelated Posts Egypt’s tour guides’ new business: Producing opium South Africa’s new tourism campaign covers significant Indian cities Inbound tourist arrivals from emerging markets to China surged year on year Spotlight on the BRICS – emerging powerhouses of the world travel industry Foreign media and tour agents witness the grand launch of Visit Malaysia Year 2014", "external_links": [], "published": "2015-07-15T03:00:00.000+03:00", "crawled": "2015-07-15T10:02:51.000+03:00", "highlightTitle": ""}