{"organizations": [], "uuid": "706ab1af93f0dbc957b6f759f85f875e071aa0de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/648*432/NY115-56_2015_135321_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/researchers-think-lake-erie-in-store-for-another-severe-toxic-algae-outbreak-this-summer-312897131.html", "country": "US", "title": "Researchers think Lake Erie in store for another severe toxic algae outbreak this summer", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "Researchers think Lake Erie in store for another severe toxic algae outbreak this summer - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T13:22:00.000+03:00", "replies_count": 0, "uuid": "706ab1af93f0dbc957b6f759f85f875e071aa0de"}, "author": "John Seewer, The Associated Press", "url": "http://www.winnipegfreepress.com/travel/researchers-think-lake-erie-in-store-for-another-severe-toxic-algae-outbreak-this-summer-312897131.html", "ord_in_thread": 0, "title": "Researchers think Lake Erie in store for another severe toxic algae outbreak this summer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "TOLEDO, Ohio - Lake Erie will see one of the most severe toxic algae outbreaks in recent years this summer, a year after toxins contaminated the drinking water for 400,000 people in northwestern Ohio and southeastern Michigan, researchers predicted Thursday.\nScientists who issued their forecast for the lake think this year's algae bloom could be second only to one in 2011, when the algae stretched more than 100 miles from Toledo to Cleveland.\n\nFILE- This Aug. 3, 2014 file photo shows Algae near the City of Toledo water intake crib, in Lake Erie, about 2.5 miles off the shore of Curtice, Ohio. Researchers who have been keeping a close eye on Lake Erie say they think this summer will bring one of the most severe toxic algae outbreaks in recent years. It was almost a year ago that toxins from the algae contaminated the drinking water for 400,000 people in northwestern Ohio and southeastern Michigan. (AP Photo/Haraz N. Ghanbari, File) \nHeavy rains across northern Ohio over the past month have washed huge amounts of algae-feeding phosphorus into the lake.\nThe prediction for an algae bloom bigger than a year ago doesn't necessarily mean there will be more drinking-water trouble because wind and water temperatures play a role, too.\n\"While we are forecasting a severe bloom, much of the lake will be fine most of the time,\" said Richard Stumpf, of the National Oceanic and Atmospheric Administration.\nAlgae blooms — linked to phosphorus from farm fertilizers, livestock manure and sewage treatment plants — have taken hold in the western third of the lake over the last decade and colored some of its waters a shade of green that looks like pea soup.\nOver the past two summers, toxins in the lake fouled the water supply in Toledo and in a neighbouring township. Toledo's drinking water was off-limits for just over two days last August.\nThe algae blooms also have been blamed for contributing to oxygen-deprived dead zones where fish can't survive.\nOhio, along with Michigan and the Canadian province of Ontario, agreed in June to sharply reduce the amount of phosphorus flowing into western Lake Erie within the next 10 years.\nSome changes limiting when farmers can spread fertilizer and manure on fields already have been made, but it will take at least a few years to see significant improvements.\nAbout half the phosphorus in the lake comes down the Maumee River, which drains 3 million acres of farmland before flowing through Toledo and into the lake.\nSo far this year, about 2.5 million pounds of phosphorus has washed down the river — the highest since 2011, said Laura Johnson, a research scientist at the National Center for Water Quality Research at Heidelberg University.\nNearly half of this year's total in June came after storms dumped 8 inches of rain across northwestern Ohio and parts of Indiana that also drain into the lake.\nResearchers who have been out on the lake already have seen the toxic algae in the water, which is a little earlier than usual, Tom Bridgeman, of the University of Toledo's Lake Erie Center.\nBut the toxins have not been detected in the water Toledo uses, city officials said this week.\n ", "external_links": [], "published": "2015-07-09T13:22:00.000+03:00", "crawled": "2015-07-09T22:32:38.000+03:00", "highlightTitle": ""}