{"organizations": [], "uuid": "ace07f488f42cea89e9d91ae5d00529b68e23307", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/Preferred-Hotels.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/preferred-hotels-inspire-families-go-educational-experiences-travel/", "country": "US", "title": "Preferred Hotels inspire families to go through educational experiences during travel - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Preferred Hotels inspire families to go through educational experiences during travel - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "ace07f488f42cea89e9d91ae5d00529b68e23307"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/preferred-hotels-inspire-families-go-educational-experiences-travel/", "ord_in_thread": 0, "title": "Preferred Hotels inspire families to go through educational experiences during travel - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Preferred Hotels inspire families to go through educational experiences during travel Published on : Wednesday, July 8, 2015\nPreferred Hotels & Resorts continues to inspire families to take learning out of the classroom and pursue priceless educational experiences during their travels around the world by offering more than 280 family-friendly certified hotels and resorts in far-flung and familiar destinations alike. Travelers of all ages can enjoy exhilarating hands-on learning journeys during stays at any Preferred Family member property 365 days of the year. Recommendations for fun family adventures during the upcoming summer season include:\nA Cultural Immersion – Chiang Mai, Thailand\nWhere to Stay: The Dhara Dhevi Chiang Mai\nFamilies can head up to northern Thailand’s tropical countryside, rich with culture and tradition, to participate in The Dhara Dhevi Chiang Mai’s Lanna Kids Club, which provides lessons on local arts and crafts such as paper making and umbrella painting, classes such as Thai boxing or Yoga for kids, and tutorials on Thai music and dance. Travelers who prefer the great outdoors can go riding on the back of a water buffalo or learn how rice is planted and processed from start to end in the resort’s organic rice fields.\nFamily Fun Package from US$583 per night, inclusive of stay in the Colonial Suite, daily buffet breakfast for 2 adults and 2 children, and a 60-minute spa treatment for 2 adults.\nIslandic Aqua-ventures – Florida Keys, USA\nWhere to Stay: Hawks Cay Florida Keys Resort\nSurrounded by clear aquamarine waters of the Atlantic Ocean and the Gulf of Mexico, this idyllic island resort in the Florida Keys is the perfect family holiday destination for watersports enthusiasts. Children age five to 12 can enjoy a full schedule of supervised activities from nature hikes to scavengers hunts and fish feedings, or have a splash at one of the resort’s five themed swimming pools. Teens can pick up a new water sport like kiteboarding, kayaking and snorkeling, or just hang out at Coral Cay Club, a lounge and game room where they can meet new friends over a game of Wii or XBox. Room rates from US$189 per night.\nA Spanish “Inquisition” – Marbella, Spain\nWhere to Stay: Hotel Don Carlos Leisure Resort & Spa\nThe Club Mare Kid’s Club at Hotel Don Carlos Leisure Resort & Spa will satisfy even the most energetic and inquisitive little ones on holiday, offering an array of activities like environment education and recycling workshops, painting and music lessons, handicrafts, and juggling and balloon-twisting classes, alongside sports like tennis, basketball and beach volleyball. This beautiful beachside resort also offers Mums and Dads access to the Orange Beach Club, an exclusive area with avant-garde outdoor furnishings and attentive personalized service, poolside and beachside. Room Rates from US$300 per night, inclusive of daily breakfast.\nTravelers can enjoy additional benefits by enrolling in the iPrefer guest loyalty program, which extends points redeemable for free nights and other expenditures, elite status, and special benefits such as complimentary Internet upon every eligible stay at more than 550 participating properties worldwide.\nRelated Posts Jason Pomeranc, hotelier announces launch of new brand of hotel Sixty Hotels Gravity Thailand 2014 presents Arcadia The Bangkok Landing – the First in Asia Washington to shine with the National Christmas Tree Lights on Dec 4 Spain ranked third best in the global tourism map – 60.6 mn foreign arrivals recorded Cebu needs to upgrade its tourism strategy to attract tourists", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-08T20:11:22.000+03:00", "highlightTitle": ""}