{"organizations": ["Hindustan Times"], "uuid": "1df3b9ae7b8be937359a56940d8b91a73ae5cce7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/7/a512029f-e620-47ee-8a1a-918e00f95b87MediumRes.JPG", "site_section": "http://feeds.feedburner.com/HT-Wellness\r", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/wellness/diabetes-hypertension-biggest-killers-in-mumbai/article1-1371748.aspx", "country": "IN", "title": "Diabetes, hypertension biggest killers in Mumbai", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Diabetes, hypertension biggest killers in Mumbai", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T20:43:00.000+03:00", "replies_count": 0, "uuid": "1df3b9ae7b8be937359a56940d8b91a73ae5cce7"}, "author": "", "url": "http://www.hindustantimes.com/wellness/diabetes-hypertension-biggest-killers-in-mumbai/article1-1371748.aspx", "ord_in_thread": 0, "title": "Diabetes, hypertension biggest killers in Mumbai", "locations": ["Mumbai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HT Correspondent, Hindustan Times , Mumbai | Updated: Jul 21, 2015 23:14 IST \nMore Mumbaiites are falling ill and dying of diabetes and hypertension, the most common lifestyle diseases, according to a recent report. In the past two years, the number of diabetics in the city increased by 19%, while hypertension cases grew by 8%, according to Praja Foundation, a non-profit working for civic and health issues. \n“Across the world in urban metros, diabetes and hypertension are in the top five or ten causes of deaths,” said, Dr Shashank Joshi, endocrinologist, Dr LH Hiranandani Hospital, Powai, adding pollution and dietary habits has reduced the city’s average life expectancy. “An average Mumbai resident lives seven years lesser than people in other parts of the world.” \nThe report titled ‘State of Health of Mumbai’ also stated tuberculosis (TB) continued to remain the top cause of mortality among all the diseases. Of the 90,552 deaths recorded in the city by the civic body in 2014-15, 7% of the deaths (6,496) were attributed to TB. The report further said 37,501 people have died of the bacterial infection in the past five years in Mumbai. \nAfter tuberculosis, most people died of hypertension, followed by diabetes, according to the report. In the past five years, 21 people died of TB every day. “The worrisome part is that most people dying of treatable infectious diseases, including malaria, dengue and TB are between the age group of 20 and 39 years. The working population in the productive age of treatable infectious diseases is not healthy,” said Milind Mhaske, project director, Praja Foundation. \nThe report by the foundation, which collects data from the civic body using the Right to Information (RTI) Act, also looked at incidence of diseases across 24 municipal wards in the city. It found Andheri (East) (K-east), followed by parts of Borivli, Kandivli (West) (R-South) and Kurla (L ward) have reported a higher incidence of diseases such as malaria, dengue, tuberculosis, diabetes, hypertension and diarrhoea. “Water contamination is one of the major contributing factors for ill health. Andheri, Kurla and Ghatkopar have reported the maximum cases of diarrhoea,” said Nitai Mehta, managing trustee of the foundation. The report found 36.2% of deaths caused by diarrhoea were reported in children below four years. \nThough the study said the deaths owing to dengue have marginally dropped in the past two years, cases have increased 633% in the past five years. Last year (2014-15), 10,299 dengue cases were reported at various public and state hospitals. In 2010-2011, the city reported 1,404 dengue cases. \nAnother interesting observation was made thanks to a survey, which was part of the study, conducted by the non-profit to understand the accessibility to healthcare. It showed 71% of people don’t have medical insurance, but half the respondents visited private facilities for their health needs, thanks to the poor health infrastructure at public health facilities. The report found an average family spends Rs48,321 on health expenses. Tags", "external_links": [], "published": "2015-07-21T20:43:00.000+03:00", "crawled": "2015-07-22T04:18:25.614+03:00", "highlightTitle": ""}