{"organizations": [], "uuid": "5bc830e9e960d13f2f6e49353f53da929195da8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61225/holiday-inn-express-hires-comedian-creative-director-and-breakfa", "country": "US", "title": "Holiday Inn Express hires comedian as Creative Director and Breakfast Excellence Honcho", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Holiday Inn Express hires comedian as Creative Director and Breakfast Excellence Honcho", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T23:32:00.000+03:00", "replies_count": 0, "uuid": "5bc830e9e960d13f2f6e49353f53da929195da8c"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61225/holiday-inn-express-hires-comedian-creative-director-and-breakfa", "ord_in_thread": 0, "title": "Holiday Inn Express hires comedian as Creative Director and Breakfast Excellence Honcho", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Holiday Inn Express hires comedian as Creative Director and Breakfast Excellence Honcho Adv: Rob Riggle is Holiday Inn Express brand's first Creative Director and Breakfast Excellence Honcho Adv: \nATLANTA, GA - InterContinental Hotels Group today announces a massive leap in the field of breakfast superiority with the hiring of actor/comedian Rob Riggle as the Holiday Inn Express brand's very first Creative Director and Breakfast Excellence Honcho. In this newly created and very important role, Riggle will be responsible for delivering comedic genius and driving Express Start breakfast enthusiasm for the brand through a variety of unique programs and content rolling out over the summer and fall of 2015. \nJennifer Gribble, Vice President, Holiday Inn Express® Brand, Americas, IHG commented: \"Guests have told us that breakfast is one of the most influential factors when choosing where they stay, so the creation of this new position was a no brainer. In this role, Rob's sole focus is to tell the world about our Express Start breakfast bar experience in the humorous and engaging way guests have come to expect from the Holiday Inn Express brand. His creativity, wit and colossal appetite for pancakes make him the perfect addition to the Holiday Inn Express team.\" \nThe Holiday Inn Express brand will feature Riggle – actor, comedian and super smart man – in its latest Stay Smart® campaign spots, launching today. As his first order of breakfast business, Riggle is crowdsourcing a name for the brand's incredibly smart, one-touch pancake machine – the first of several contributions to follow. \nThroughout the month of July, Riggle is challenging pancake lovers and breakfast aficionados to submit their best ideas for a chance to win a trip to Montreal or Vermont, or as Riggle calls them, \"maple syrup Valhalla.\" Entries will be judged based on their creativity, humor and breakfast-relevancy. \nRob Riggle, Creative Director and Breakfast Excellence Honcho, Holiday Inn Express® Brand, Americas, IHG said: \"I've eaten breakfast my entire life, so I feel like I've been training for this job for quite some time, and it's that commitment to the morning meal that has prepared me for brilliance in this role. I'm excited to use the skills I've been honing for years to bring breakfast at Holiday Inn Express hotels to the next level, starting with their freaking awesome one-touch pancake machine.\" \nRiggle is collaborating with the brand to contribute big ideas around when, where and how travelers experience the Holiday Inn Express brand's delicious breakfast, which will be introduced in the coming months. Over the summer and fall, Riggle's groundbreaking breakfast innovations will be featured on staysmart.com as well as the Holiday Inn Express brand's YouTube, Instagram, Twitter and Facebook.", "external_links": [], "published": "2015-07-08T23:32:00.000+03:00", "crawled": "2015-07-09T21:25:23.000+03:00", "highlightTitle": ""}