{"organizations": [], "uuid": "f0f481b54116c5f7ce37bba46327ae19cc94ce23", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/dt.common.streams.StreamServer.jpeg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/07/08/costa-rica-draws-jamaica-gold-cup-opener-remain-winless-wanchope", "country": "US", "title": "Costa Rica draws with Jamaica in Gold Cup opener", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rica draws with Jamaica in Gold Cup opener", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T06:58:00.000+03:00", "replies_count": 0, "uuid": "f0f481b54116c5f7ce37bba46327ae19cc94ce23"}, "author": "Michael Krumholtz", "url": "http://www.ticotimes.net/2015/07/08/costa-rica-draws-jamaica-gold-cup-opener-remain-winless-wanchope", "ord_in_thread": 0, "title": "Costa Rica draws with Jamaica in Gold Cup opener", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nCosta Rica is now 0-3-3 under Paulo Cesar Wanchope after Wednesday’s tie with Jamaica in its Gold Cup opener, July 8, 2015 AFP \nA fingertip was enough to measure the length between bearable disappointment and outright disaster for the Costa Rican men’s football team on Wednesday. \nLa Sele ‘s 2-2 draw with Jamaica in its Gold Cup opener in Los Angeles, California was nearly a loss, but goalie Esteban Alvarado dove for a game-saving stop in the 88th minute to allow his side to escape with one point in group play. \nA team that previously built its success around the pillars of a lockdown defense is now searching for some identity in its fragile back line. Defender Júnior Díaz had an especially rough game on Wednesday, allowing Jamaica’s first goal and getting faked out on what would have been the game-clinching goal if not for the incredible, diving save by Alvarado. \nWhile starting in goal for injured star Keylor Navas, Alvarado did an admirable job in his first tournament action for Costa Rica. Jamaica’s forwards were able to find consistent holes in a Costa Rican backline that has yet to find the form that made it so impenetrable a year ago. \n“Jamaica played well, it’s not like we were playing against little boys out there,” Alvarado told a television reporter after the game. “They made a lot of stuff complicated for us.” \nThe latest stagnant performance puts La Sele under some immediate pressure to find its first win since last October if it is to escape from Group B and advance to the tournament’s knockout rounds. Under head coach Paulo Cesar Wanchope, Costa Rica is 0-3-3 in international play. \nIn a group that includes El Salvador and Canada, the Ticos remain favored to win Group B. But a defense that can’t seem to gel under Wanchope leaves them vulnerable going forward. \nJamaica struck first on Wednesday when Garath McCleary netted a goal in the 12th minute from a gorgeous inbound pass near the corner. Costa Rica’s Roy Miller struck back with a goal in the 32nd minute to tie the match. The New York Red Bulls defender was set up after Johan Venegas lofted up a nice pass off a free kick. \nFive minutes later, David Ramírez ran down a ball from Celso Borges near the sideline just in time to flick it over the Jamaican goalie’s outstretched arms for Costa Rica’s second goal. \nRamírez, who was one of four players making their competitive debut with the men’s national team on Wednesday, showed the potential to be a fixture on this team for years to come. As lifeless as Costa Rica’s defense seemed to be at times, it was the offense that kept sparking the Ticos, namely the young star from Saprissa. \nVeteran Álvaro Saborío, who replaced Johan Venegas in the second half, nearly put home two headers that could have swung the match but Jamaican goalie Dwayne Miller rejected both, including a diving save of his own. \nCosta Rica, which is slated to drop from 14th to 41st in Thursday’s newest batch of FIFA rankings , could use a win in its next game against El Salvador to jump atop the Group B rankings. La Sele kicks off against the team’s Central American rival at 7 p.m. on Saturday.", "external_links": [], "published": "2015-07-09T06:58:00.000+03:00", "crawled": "2015-07-09T08:26:15.000+03:00", "highlightTitle": ""}