{"organizations": [], "uuid": "8a6c5fba8e04ca37a2d9fda36d77cc782eb5cbb5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/6518492/barnstormer-by-harrison-covington-in-airside-c*1200xx4064-2286-0-209.jpg", "site_section": "http://dayton.bizjournals.com/rss/feed/vertical_subtopic/65", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/tampabay/news/2015/07/23/tia-to-issue-call-for-public-art-with-budgeted-3.html", "country": "US", "title": "TIA to issue call for public art with budgeted $3.5M", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "TIA to issue call for public art with budgeted $3.5M", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T18:10:00.000+03:00", "replies_count": 0, "uuid": "8a6c5fba8e04ca37a2d9fda36d77cc782eb5cbb5"}, "author": "Eric Snider", "url": "http://www.bizjournals.com/tampabay/news/2015/07/23/tia-to-issue-call-for-public-art-with-budgeted-3.html", "ord_in_thread": 0, "title": "TIA to issue call for public art with budgeted $3.5M", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "David Lawrence Harris Covington's sculpture \"Barnstormer\" is currently on display in Airside C. With $3.5 million to spend, Tampa International Airport will issue a call to artists on Aug. 17 . The airport is seeking a dozen new pieces as part of its major expansion. The Public Art Committee will consider a wide range of media, including freestanding sculpture, wall-mounted or ceiling-hung art, and functional elements. TIA spokesperson Danny Valentine said the competition is wide open and characterized the airport’s aesthetic emphasis as depicting the region’s “abundant natural resources, rich cultural heritage and celebrating the region as the birthplace of commercial aviation.” The new works will add to an existing art inventory that includes 30 different collections throughout the facility’s public spaces. Unlike the airport’s recent concessions redevelopment program that emphasized participation from local operators , the public art call does not tilt in favor of Bay area artists. “We certainly encourage local artists to participate,” Valentine said. “This is a major call and we anticipate interest form nationally known and internationally known artists as well.” A workshop to provide information, important dates and answer questions is scheduled for Aug. 14 at 3 p.m. in the airport’s boardroom, located on the third floor of the main terminal. Artists can also attend online. \nWant Tampa Bay Travel news in your inbox? Sign up for our free email newsletters. Courtesy of Tampa International Airport Tampa International Airport… more", "external_links": [], "published": "2015-07-23T18:10:00.000+03:00", "crawled": "2015-07-23T18:38:43.446+03:00", "highlightTitle": ""}