{"organizations": [], "uuid": "26103ce5ec540b3f0adc4279ebe43e7ccd9344aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.egyptindependent.com", "main_image": "", "site_section": "http://www.egyptindependent.com/rss-feed-term/154/rss.xml", "section_title": "Egypt Independent: Travel", "url": "http://www.egyptindependent.com//news/montreal-canada-s-city-every-kind-traveler", "country": "US", "title": "Montreal: Canada's city for every kind of traveler", "performance_score": 0, "site": "egyptindependent.com", "participants_count": 1, "title_full": "Montreal: Canada's city for every kind of traveler", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T19:00:00.000+03:00", "replies_count": 0, "uuid": "26103ce5ec540b3f0adc4279ebe43e7ccd9344aa"}, "author": "CNN", "url": "http://www.egyptindependent.com//news/montreal-canada-s-city-every-kind-traveler", "ord_in_thread": 0, "title": "Montreal: Canada's city for every kind of traveler", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Perhaps you might recognize yourself in one of the people below. The festival junkie Their hands are tattooed with entry stamps, their arms decorated with neon wristbands from concerts, food festivals and art fairs. The festival junkie flourishes in crowds and loves to dance to the beat of the hot new DJ mix or find a spot to stand among hundreds of people, sometimes for no reason at all other than to be able to say: \"Yeah, bro, I was there!\" Montreal has more than 100 festivals each year, many of which draw an international crowd. High above the city at Mount Royal, crowds groove to live music and check out local artists' creations at Festival Chromatic . While the Montreal Jazz Festival reels in music lovers from every part of the world, lesser-known festivals like Magic of Lanterns in September features over 1,000 traditional Chinese lights that illuminate the city's Botanical Garden. DJs spin tunes at the Chromatic Festival. The insatiable muncher Addicted to phrases like \"farm to table,\"\"craft cocktails\" and \"locally sourced,\" the insatiable muncher is determined to please their palate, even if it means waiting three months for a restaurant reservation to do so. Always looking to upload a perfect food photo on Instagram with the hashtag \"foodporn\" or craft a witty Yelp review, the insatiable muncher is not afraid to let food move him or her to tears or sheer rage. Chinatown is home to a thriving immigrant community and international cuisine, including Vietnamese pho and Cantonese BBQ. There are nearly 4,000 restaurants in Montreal, including some true greats. These include Restaurant Gus , where Chef David Ferguson takes dishes like foie gras nachos and a tender lamb sirloin buried in fresh mint to fuse the best of classical French cuisine with surprising twists. Or the ever crowded L'Avenue, which offers more than 40 kinds of eggs benedict, including a duck confit and sirloin steak version so tender that diners will want to eat breakfast twice in one day. For locally sourced flavor, there's French Bistro La Recolte , where dishes include morel mushrooms, filled with fresh cheese curds and barley, and fresh peas and a white wine demi-glace sauce. For a late night cocktail, Le Lab gets playful with the jerky lab jack: a whiskey concoction served with suspended sweet and spicy beef jerky. Gus Restaurant stands out in the crowd with dishes like succulent lamb topped with mint.", "external_links": [], "published": "2015-07-16T19:00:00.000+03:00", "crawled": "2015-07-17T00:05:30.000+03:00", "highlightTitle": ""}