{"organizations": [], "uuid": "ffcbbe350c480fcb5d8df181463dd786b9f1e386", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61440/eu-response-ebola-outbreak-west-africa", "country": "US", "title": "EU response to Ebola outbreak in West Africa", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "EU response to Ebola outbreak in West Africa", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T01:52:00.000+03:00", "replies_count": 0, "uuid": "ffcbbe350c480fcb5d8df181463dd786b9f1e386"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61440/eu-response-ebola-outbreak-west-africa", "ord_in_thread": 0, "title": "EU response to Ebola outbreak in West Africa", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "EU response to Ebola outbreak in West Africa Adv: \nJul 14, 2015 Adv: \nBRUSSELS, Belgium - West Africa is facing the largest and most complex Ebola epidemic on record. Guinea, Liberia and Sierra Leone have been the most affected countries. Over 27, 514 people have been infected, more than 11,220 of whom have died. \nThe EU's total financial contribution to date to fight the epidemic is over €1.8 billion. This amount includes previous funding from the Member States and the European Commission as well as the European Commission's new pledge of €450 million announced at the UN's International Ebola Recovery Conference in July. It excludes, however, further potential pledges made by individual EU Member States at the same UN conference in July. \nAccording to the World Health Organisation (WHO), the decline in the number of cases and the contraction of the geographic area affected by Ebola has stalled during the last weeks. Both in Guinea and Sierra Leone new confirmed cases are still being identified and people continue to be diagnosed with Ebola post mortem. These patterns indicate that the disease is circulating in unrecognised chains of transmission. In order to achieve zero cases, there is a need for strong community engagement, improved contact tracing and earlier identification of cases. \nThe recent cases in Liberia highlight the importance of maintaining the capacity of early case detection and enhanced vigilance regarding deaths with unknown causes, even in countries that have been declared Ebola free. \nThe European Union has been active in the response to the Ebola emergency from the start. It has mobilised all available political, financial and scientific resources to help contain, control, treat and ultimately defeat Ebola. In October 2014 the European Council appointed Christos Stylianides, EU Commissioner for Humanitarian Aid and Crisis Management, as EU Ebola Coordinator. \nCommissioners Christos Stylianides, Vytenis Andriukaitis and Neven Mimica visited the affected countries in late 2014 to reaffirm the EU's support for the fight against the disease and to announce support measures. \nOn March 3 2015, the European Union organised a high-level conference on the Ebola epidemic. The purpose was two-fold: first, to take stock of the ongoing emergency response and adapt it to the evolving situation on the ground, leading to eradication of the disease; second, to plan for the long term and support the recovery and resilience of the affected countries, including the development of their health systems. The event was co-chaired by the EU, Guinea, Sierra Leone and Liberia, the United Nations, the African Union, and the Economic Community of West African States (ECOWAS). The Statement of the Co-Chairs from the conference was endorsed by the European Council on 16th March. \nIn July 2015, a new conference will take place, hosted by UN Secretary General Ban Ki Moon in cooperation with the Governments of Guinea, Liberia and Sierra Leone, and in partnership with the European Union, African Union, the African Development Bank, and the World Bank. This pledging conference will bring together the international community and Heads of State from the three countries affected, to ensure that recovery efforts help the countries to build back better and ensure greater resilience going forward. \nThe Commission will examine the lessons learnt from the Ebola epidemic in a conference that will be held in October in Luxembourg under the Luxembourg Presidency. The outcome of the conference will be the basis of Council conclusions to be adopted in December this year. \nHumanitarian Aid \nSince March 2014, the European Commission has allocated more than €70 million in humanitarian funding to address the most urgent needs. These funds are channelled through humanitarian partner organisations, such as Médecins Sans Frontières, the International Federation of the Red Cross and Red Crescent societies, International Medical Corps, Save the Children, the International Rescue Committee, Alima, the World Food Programme's Humanitarian Air Service, UNICEF and the World Health Organization. \nEU aid contributes to epidemic surveillance, diagnostics, treatment and medical supplies; deployment of doctors and nurses and training of health workers; raising awareness among the population and the promotion of safe burials. \nDevelopment Aid \nThe Commission is already providing over €210 million in development and early recovery assistance. Most of this money is provided to stabilise the countries and assist them in recovering from the crisis and beyond. \nIn addition, the EU is helping to strengthen health systems in the affected countries before the outbreak, as part of its long term support, and is now redirecting existing programmes wherever it is necessary towards the Ebola efforts and crisis context. \nBudget support is provided to Guinea, Liberia and Sierra Leone to help them deliver urgently needed public services - in particular health care - and also cushion the economic impact of the epidemic. Development funding is also being used to strengthen other important areas like healthcare, education, water and sanitation. \nFour mobile laboratories, deployed in Guinea and Sierra Leone, help with the detection of the virus and training of health workers. The labs can process up to 70 samples each day, seven days a week. \nFurthermore, the EU supports the African Union's medical mission in West Africa (ASEOWA), contributing EUR 5 million to pay civil and medical staff. This has so far allowed to cover the costs of the first 90 medical professionals and support staff, and to subsequently increase the total number of staff to about 150 people. The European Commission has also deployed health professionals to Guinea from the European Centre for Diseases Prevention and control. As of 29 June 2015, ECDC has deployed 85 health experts in relation to the Ebola response within and outside the EU, including 77 deployed in the West African region. Currently 16 ECDC mobilised experts are in the field. In addition, 9 experts from national fellowship programmes associated with the ECDC training programmes were also deployed by their organisations in the region by EU Member States. \nThe EU is equally working to strengthen preparedness against the epidemic. The EU has supported national plans in six countries for some €10.6million and has, for example: \nHelped to refurbish and equip an Ebola treatment unit at the central hospital in Ivory Coast \nHelped to provide a water and sanitation programme with hygiene messages on Ebola prevention in Guinea Bissau \nSet up a facility in Burkina Faso to support the national preparedness plan \nIn addition, the EU is also contributing to the regional preparedness through support to WHO and the International Red Cross with a €6 million contract for each, for activities aimed at preventing the further spread of Ebola disease in West Africa. \nMedical Research \nThe European Commission has promptly and strongly supported urgent Ebola research on potential treatments, vaccines and diagnostic tests with almost €140 million from Horizon 2020, the EU's research and innovation funding program. \nAn initial €24.4 million were deployed to fund five projects that look to develop potential vaccines and medication against Ebola and translate their findings into available treatments. Work on these projects started in October 2014, and some have already begun producing results applicable to the current outbreak. Most promisingly, the EU-funded REACTION project announced encouraging evidence that favipiravir, an antiviral drug, is an effective treatment against early Ebola disease (Fact sheet). Another project called EVIDENT confirmed that the Ebola virus was mutated at a lower rate than feared and concluded that the diagnostic methods, treatments and vaccines under development should still be effective against the disease.More information on EU-funded projects can be found at the EU Research on Ebola website. \nAdditionally, the European Commission and the European pharmaceutical industry are funding eight research projects on the development of vaccines and rapid diagnostics tests, which are key to overcoming the current Ebola crisis. These projects are run under the new 'Ebola+' programme of the Innovative Medicines Initiative (IMI) and funded with a total of €215 million, €114 million of which come from Horizon 2020. \nThe EU is also supporting clinical research on Ebola through the European Developing Countries Clinical Trials Partnership (EDCTP), a joint effort by European and Sub-Saharan African countries to develop promising treatments for poverty-related diseases like malaria, HIV/AIDS, and tuberculosis. EDCTP recently added Ebola to this list and launched a call to develop new diagnostic tools for these diseases. The Commission has also urged EDCTP to mobilise funding from the Participating States to increase the EDCTP budget for 2014 and 2015 and to coordinate relevant research activities. \nThe Ebola outbreak demonstrates that 'rapid reaction' research and innovation in health crises is needed. In this context, the European Commission and other major funders have recently founded the 'Global Research Collaboration for Infectious Disease Preparedness' (GloPID-R) which will facilitate launching a coordinated emergency research response within 48 hours in case of a significant new or re-emerging outbreak. \nEmergency supplies and expertise \nAs part of its coordinated response, the EU has provided emergency supplies and sent experts to the affected countries. The EU Civil Protection Mechanism facilitates the delivery of material support from the Member states. They have provided mobile laboratories, treatment centres, ambulances and field hospitals. The EU has organised logistical support including multiple airlifting operations and supports the deployment of navy ships to transport emergency supplies provided by the Member States, such as food aid, medical kits, clean blankets and chlorine for sanitations. EU humanitarian experts, including specialists in hazardous diseases, have been deployed to the three most affected countries. \nMedical Evacuation \nInternational health workers are the backbone of the response to the Ebola epidemic. To support their mobilisation and protection, the EU has established a medical evacuation system. Member States are making capacity available for this. \nSince the beginning of the epidemic and as of 2 July 2015, 65 individuals have been evacuated or repatriated worldwide from the EVD-affected countries. Of these, 38 individuals have been evacuated or repatriated to Europe. Thirteen were medical evacuations of confirmed EVD-infected patients to: Germany (3), Spain (2), France (2), UK (2), Norway (1), Italy (1), Netherlands(1) and Switzerland (1). Twenty-five asymptomatic persons have been repatriated to Europe as a result of exposure to Ebola in West Africa: UK (13), Denmark (4), Sweden (3), Netherlands (2), Germany (1), Spain (1) and Switzerland (1). No new medical evacuations have taken place since 18 March 2015. The medevac system ensures evacuation to an equipped hospital in Europe for international health workers and other EU nationals diagnosed with the virus. Evacuation requests are made by WHO to the health department of the Commission (DG SANTE) which identifies medical facilities available in EU Member States through communications in the EU's Early Warning and Response System (EWRS). Transport to Europe is then coordinated by the ERCC. To date, a total of 39 people suffering from Ebola or having had a high risk exposure to the virus, have been medically evacuated to Europe. \nAdvocacy, coordination and diplomatic outreach \nFrom the onset of the crisis, the EU has been in constant contact with the United Nations, relief agencies on the ground, the governments in the region as well as with regional organisations such as the African Union and ECOWAS. \nThe appointment by the European Council of an EU Ebola Coordinator, Commissioner Christos Stylianides, aims to ensure that EU institutions and Member States act in a coordinated manner with each other and with international partners. To this end, an EU Ebola Task Force has been set up and meets three times a week, bringing together the Member States, Commission services, the European External Action Service (EEAS) and representatives of the UN, the Red Cross and NGOs.", "external_links": [], "published": "2015-07-15T01:52:00.000+03:00", "crawled": "2015-07-15T02:05:02.000+03:00", "highlightTitle": ""}