{"organizations": [], "uuid": "c62660f8598879132d5556e59d6d89088820894d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/opinion/building-attention-span-gaining-intelligence/", "country": "EU", "title": "Building attention span, gaining intelligence", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Building attention span, gaining intelligence | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T00:05:00.000+03:00", "replies_count": 0, "uuid": "c62660f8598879132d5556e59d6d89088820894d"}, "author": "David Brooks", "url": "http://www.seattletimes.com/opinion/building-attention-span-gaining-intelligence/", "ord_in_thread": 0, "title": "Building attention span, gaining intelligence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you’re like most of us, you’re wondering what the Internet is doing to your attention span. You toggle over to check your phone during even the smallest pause in real life. You feel those phantom vibrations even when no one is texting you. You have trouble concentrating for long periods.\nOver the past few years researchers have done a lot of work on attention span, and how the brain is being re-sculpted by all those hours a day spent online. One of the conclusions that some of them are coming to is that the online life nurtures fluid intelligence and offline life is better at nurturing crystallizing intelligence.\nBeing online is like being a part of the greatest cocktail party ever and it is going on all the time. If you email, text, tweet, Facebook, Instagram or just follow Internet links you have access to an ever-changing universe of social touch-points. It’s like you’re circulating within an infinite throng, with instant access to people you’d seldom meet in real life.\nOnline life is so delicious because it is socializing with almost no friction. You can share bon mots, photographs, videos or random moments of insight, encouragement, solidarity or goodwill. You live in a state of perpetual anticipation because the next social encounter is just a second away. You can control your badinage and click yourself away when boredom lurks.\nMost Read Stories How Edgar Martinez is already making Mariners hitters better Traffic death of boy stirs outcry in Issaquah The jury’s in: ‘True Detective’ Season 2 is not so hot Mount St. Helens, still steaming, holds the world’s newest glacier Bush’s 'work longer hours’ remark may follow him for a long time This form of social circulation takes the pressure off. I know some people who are relaxed and their best selves only when online. Since they feel more in control of the communication, they are more communicative, vulnerable and carefree.\nThis mode of interaction nurtures mental agility. The ease of movement on the Web encourages you to skim ahead and get the gist. You do well in social media and interactive gaming when you can engage and then disengage with grace. This fast, frictionless world rewards the quick perception, the instant evaluation and the clever performance. As neuroscientist Susan Greenfield writes in her book “Mind Change,” expert online gamers have a great capacity for short-term memory, to process multiple objects simultaneously, to switch flexibly between tasks and to quickly process rapidly presented information.\nFluid intelligence is a set of skills that exist in the moment. It’s the ability to perceive situations and navigate to solutions, independent of long experience.\nOffline learning, at its best, is more like being a member of a book club than a cocktail party. When you’re offline you’re not in constant contact with the universe. There are periods of solitary reading and thinking and intentional gatherings to talk and compare.\nResearch at the University of Oslo and elsewhere suggests that people read a printed page differently than they read off a screen. They are more linear, more intentional, less likely to multitask or browse for keywords.\nThe slowness of solitary reading or thinking means you are not as concerned with each individual piece of data. You’re more concerned with how different pieces of data fit together. How does this relate to that? You’re concerned with the narrative shape, the synthesizing theory or the overall context. You have time to see how one thing layers onto another, producing mixed emotions, ironies and paradoxes. You have time to lose yourself in another’s complex environment.\nWhen people in this slower world gather to try to understand connections and context, they gravitate toward a different set of questions. These questions are less about sensation than about meaning. They argue about how events unfold and how context influences behavior. They are more likely to make moral evaluations. They want to know where it is all headed and what are the ultimate ends.\nCrystallized intelligence is the ability to use experience, knowledge and the products of lifelong education that have been stored in long-term memory. It is the ability to make analogies and comparisons about things you have studied before. Crystallized intelligence accumulates over the years and leads ultimately to understanding and wisdom.\nThe online world is brand-new, but it feels more fun, effortless and natural than the offline world of reading and discussion. It nurtures agility, but there is clear evidence by now that it encourages a fast mental rhythm that undermines the ability to explore narrative, and place people, ideas and events in wider contexts.\nThe playwright Richard Foreman once described people with cathedral-like personalities — with complex, inner density, people with distinctive personalities, and capable of strong permanent attachments. These days that requires an act of rebellion, among friends who assign one another reading and set up times to explore narrative and cultivate crystallized intelligence.", "external_links": [], "published": "2015-07-12T00:05:00.000+03:00", "crawled": "2015-07-12T06:14:36.000+03:00", "highlightTitle": ""}