{"organizations": ["AirAsia"], "uuid": "9f731814c9c8315a4c39f26ba2ad507e75ba84f4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources0.news.com.au/images/2015/07/28/1227460/728232-9304cb04-34e6-11e5-b1c6-fce245fdac3f.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-updates/airasia-has-been-accused-of-flying-alarmingly-close-to-indonesian-volcano/story-fnizu68q-1227460729218?from=public_rss", "country": "IL", "title": "AirAsia flight to close for comfort", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "AirAsia flight to close for comfort", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T15:00:00.000+03:00", "replies_count": 0, "uuid": "9f731814c9c8315a4c39f26ba2ad507e75ba84f4"}, "author": "", "url": "http://www.news.com.au/travel/travel-updates/airasia-has-been-accused-of-flying-alarmingly-close-to-indonesian-volcano/story-fnizu68q-1227460729218?from=public_rss", "ord_in_thread": 0, "title": "AirAsia flight to close for comfort", "locations": ["Indonesia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rob Maccoll"], "text": "What are these? Indonesia’s Mount Ruang erupting smoke and ash ... The picture Rob Maccoll snapped mid flight. Picture: Rob Maccoll Source: Supplied \nAIRASIA has been accused of flying dangerously close to Indonesia’s volcanic ash cloud, on a flight from Denpasar to Yogyakarta. \nFreelance photographer Rob Maccoll was on flight QZ8448 with partner Margie, and snapped this stunning picture of Mount Raung blowing its top. \nHe said the flight path was to the north of the volcano and the ash cloud appeared to be heading west. \n“I couldn’t really see from my seat but Margie had the window and reckons we went through it,” said Mr Maccoll. Causing chaos ... Mount Raung has caused massive disruption on flights in and out of Indonesia. Picture: AP Source: AP \n“We certainly must have crossed it but how it was at that stage was a bit hard to tell as there’s a lot of burning off here as well. \n“They’re probably used to it as Indonesia has the highest number of volcanoes in the world.” \nVolcanic ash is silica based, which is corrosive to metal and can cause aircraft engines to shut down. \nThe Monday morning flight path of QZ8448 showed the A320 going deliberately north of Mount Raung, instead of the more direct route to the south. \nMaps supplied by the Volcanic Ash Advisory Centre in Darwin , forecast the ash cloud to blow northwest of the volcano, suggesting the flight would have almost certainly passed through. \nSenior Meteorologist with the VAAC, Stephanie Bond, said their job was not to tell planes where to fly. Massive risks ... Volcanic ash is silica based, which is corrosive to metal and can cause aircraft engines to shut down. Picture: Supplied. Source: Supplied \n“We advise the aviation industry where there is discernible ash and the forecast of the ash,” said Ms Bond. \n“The airlines decide where to fly based on their own risk management strategy taking in the information from aviation warnings issued by Indonesian authorities based on the VAAC’s advisories.” \nMount Raung has been erupting since late June, causing extensive disruption to air traffic throughout Indonesia , and particularly in Bali. \nDenpasar Airport was forced to close for extended periods over the weekend of July 10 to 12, resulting in mass flight cancellations. \nLast week, flights were again cancelled en masse when the ash plume returned to Bali. \nConditions improved on Thursday and airlines have been operating to schedule in and out of Bali. \nAn AirAsia spokesman said the airline was not aware of any issues with flight QZ8448.", "external_links": [], "published": "2015-07-28T15:00:00.000+03:00", "crawled": "2015-07-28T20:15:42.857+03:00", "highlightTitle": ""}