{"organizations": [], "uuid": "62e3ad788a4271c9ed8cd057d6d21eba0226eaad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/l/r/b/j/image.related.StuffLandscapeSixteenByNine.620x349.15lq7f.png/1435821310896.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/world/asia/69877995/Indonesia-to-call-off-search-for-victims-in-deadly-military-plane-crash", "country": "AU", "title": "Indonesia to call off search for victims in deadly military plane crash", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 0, "title_full": "Indonesia to call off search for victims in deadly military plane crash", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T11:17:00.000+03:00", "replies_count": 0, "uuid": "62e3ad788a4271c9ed8cd057d6d21eba0226eaad"}, "author": "", "url": "http://www.stuff.co.nz/world/asia/69877995/Indonesia-to-call-off-search-for-victims-in-deadly-military-plane-crash", "ord_in_thread": 0, "title": "Indonesia to call off search for victims in deadly military plane crash", "locations": ["Indonesia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indonesia to call off search for victims in deadly military plane crash Last updated 20:17, July 1 2015 \nAmateur video footage shows an Indonesian plane that crashed in Medan on fire. \nIndonesian authorities will call off a two-day search for victims on Thursday after a military transport plane crashed into a residential area in Sumatra, killing around 140 people, the military said. \nThe Hercules C-130B was carrying 122 passengers when it crashed into houses in the northern city of Medan shortly after takeoff on Tuesday, killing all on board and more on the ground. \n\"We have not found any bodies since yesterday, so hopefully, we will be able to finish the search-and-rescue operation today,\" military spokesman Fuad Basya said. RONI BINTANG/REUTERS ED WRAY/GETTY IMAGES ED WRAY/GETTY IMAGES ED WRAY/GETTY IMAGES RONI BINTANG/REUTERS RONI BINTANG/REUTERS RONI BINTANG/REUTERS ANTARA FOTO/REUTERS ANTARA FOTO/REUTERS ANTARA FOTO/REUTERS BEAWIHARTA/REUTERS BEAWIHARTA/REUTERS BEAWIHARTA/REUTERS BEAWIHARTA/REUTERS \nIndonesian soldiers and search and rescue teams remove debris from the crash site of a military C-130 transport plane. \nMilitary personnel and search and rescue teams comb through the wreckage of a military transport plane in Medan. \nMilitary personnel and search and rescue teams comb through the wreckage of a military transport plane which crashed into a building in Medan, Indonesia. \nMilitary personnel and search and rescue teams comb through the wreckage of a military transport plane in Medan, Indonesia. \nSecurity forces and rescue workers search the wreckage of an Indonesian military C-130 Hercules transport plane. \nSecurity forces and rescue workers search the wreckage of an Indonesian military C-130 Hercules transport plane. \nSecurity forces and rescue workers remove the body of a victim from the wreckage of an Indonesian military C-130 Hercules transport plane in Medan. \nFiremen attempt to extinguish the fire surrounding the wreckage of an Indonesian military transport plane. \nSecurity forces and firemen attempt to extinguish the wreckage of an Indonesian military transport plane. \nPeople view the wreckage of an Indonesian military C-130 Hercules transport plane after it crashed into a residential area in Medan. \nFamily members sit outside Adam Malik hospital as they wait for the bodies of victims of an Indonesian military C-130 Hercules transport plane crash. \nFamily members sit outside Adam Malik hospital as they wait for the bodies of victims of an Hercules crash in Medan, Indonesia. \nIndonesian soldiers prepare coffins outside Adam Malik hospital for victims of an military C-130 Hercules transport plane crash. \nA child attempts to look inside a mortuary at Adam Malik hospital in Medan, Indonesia. 1 of 14 « Previous « Previous Next » Next » \nBasya said 135 people were confirmed dead, although Indonesian media reported on Thursday at least 141 bodies had been recovered from the crash site. \nThe incident is the latest in a string of aviation disasters to hit Indonesia and prompted President Joko Widodo to order a review of its aging air force fleet. The type of plane that crashed in Medan went into service half a century ago. \nThe Indonesian air force has now lost four C-130Bs, a model that forms the backbone of its transport fleet. Jakarta has grounded its remaining eight C-130Bs until investigators discover the cause of the crash. \nRescuers search through the wreckage of a plane crash in Indonesia that killed more than 140 people. \nThe crash could spur Southeast Asia's largest country to boost military spending, currently the lowest in the region at just 0.8 percent of GDP. \n\"The incident in Medan shows that the military's transport equipment needs to be renewed soon,\" parliamentarian T.B. Hasanuddin told reporters. \n\"We advise the government to buy newer aircraft rather than used ones even if they are more expensive,\" he said. ANTARA FOTO/REUTERS \nFiremen and security forces attempt to extinguish the fire surrounding the wreckage of an Indonesian military transport plane after it crashed in the North Sumatra city of Medan. \nSome victims' families said passengers, many of whom are believed to have been civilians, had paid to get on the flight, which was headed to Tanjung Pinang in Riau Islands off Sumatra. Ad Feedback \nThe air force has denied the allegations and said it will investigate any possible breach of rules. \nLast December, an AirAsia passenger jet crashed en route from the Indonesian city of Surabaya to Singapore, killing all 162 people on board.", "external_links": [], "published": "2015-07-01T11:17:00.000+03:00", "crawled": "2015-07-02T13:53:11.000+03:00", "highlightTitle": ""}