{"organizations": [], "uuid": "5c1054d9f2f9ce2f0d1f825893b49b63da4f046e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/99b1aa7e-2fd9-11e5-8913-4ebf8765dfab-1200x630.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/entertainment/home-viewing-before-we-go-rocky-the-newsroom/", "country": "EU", "title": "Home viewing: ‘Before We Go,’ ‘Rocky,’ ‘The Newsroom’", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Home viewing: ‘Before We Go,’ ‘Rocky,’ ‘The Newsroom’ | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T23:00:00.000+03:00", "replies_count": 0, "uuid": "5c1054d9f2f9ce2f0d1f825893b49b63da4f046e"}, "author": "Sean Axmaker", "url": "http://www.seattletimes.com/entertainment/home-viewing-before-we-go-rocky-the-newsroom/", "ord_in_thread": 0, "title": "Home viewing: ‘Before We Go,’ ‘Rocky,’ ‘The Newsroom’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Here’s what’s new for home viewing on video-on-demand and Netflix, Amazon Prime and Hulu, beginning the week of Friday, July 24.\nPay-Per-View / Video-On-Demand Chris Evans makes his directorial debut with “Before We Go,” a romantic comedy with Evans and Alice Eve as uncommonly beautiful strangers who spend the night walking and talking through the streets of New York City. It’s PG-13 for language and suggestive scenes and arrives on VOD before theaters.\nMuch weirder is “ Felt ,” about an artist (played by Amy Everson) who battles her traumas by channeling her anger and confusion into art. On select cable systems and VOD services. Not rated but features adult material.\nAvailable same day as select theaters nationwide is “ Unexpected ,” starring Cobie Smulders as a high-school teacher who discovers she’s pregnant at the same time as one of her students. It opens in Seattle at Sundance Cinemas (21+). R for language.\nNetflix Most Read Stories Video from bus driver’s body camera could cost 2 deputies their jobs Donnie Chin, Chinatown ID's 'frontline hero,' killed in early morning shooting Time for Mariners to face reality as trade deadline nears 2 killed in drive-by shooting on I-5 in Mount Vernon Lifestyle changes may guard aging brain against memory loss “Scrotal Recall” is a terrible title for a sweet British sitcom, a romantic comedy starring Johnny Flynn as a hapless single tracking down former partners after he’s diagnosed with a venereal disease. It sounds crude, but he’s a romantic, and the flashbacks are glimpses into the bittersweet pleasures of dating, courtship and the ways we touch one another’s lives even in brief encounters. Nothing explicit, but it’s definitely for adults.\n“ Glee: Season 6 ,” the final 13-episode season of the “hey kids, let’s put on a concert” of network TV, is available to both Netflix and Amazon Prime customers.\nHave you seen the trailer for the “Rocky” spinoff “Creed” in theaters? Netflix has the Oscar-winning underdog drama “Rocky” (1976) and its sequels — and the first four feature Creed’s daddy, Apollo Creed (Carl Weathers). It’s not necessary homework for “Creed,” just a little backstory.\nAmazon Instant Prime Amazon adds another HBO show to its Prime service: Aaron Sorkin’s “The Newsroom: The Complete Series,” his entertaining and often frustrating take on cable news featuring a cast of brilliant professionals who act like hormonal teenagers whenever emotion comes into the picture. There are 25 episodes of top-rate actors delivering Sorkin’s brand of liberal idealism.\nDwayne Johnson is “ Hercules ” in the 2014 film version of the ancient myth turned costume adventure, playing the legendary muscleman hero as a sword for hire. It’s PG-13 for battle scenes and violence.\nHulu Plus BBC America’s “Intruders: Season 1,” about a secret society that chases immortality through possessing the bodies of others, is the only season of the supernatural show.\nAll 23 episodes of “Agatha Christie’s Marple: Seasons 1-6,” the BBC mystery series with Geraldine McEwan (and later Julia McKenzie) as the spinster sleuth, are also available to nonsubscribers.\nOn disc this week “What We Do in the Shadows,” “Kung Fu Killer,” “My Beautiful Laundrette.”\nSean Axmaker is a Seattle film critic and writer. His work appears in Parallax View, Turner Classic Movies online, Keyframe and at http://streamondemandathome.com", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/B00R5WE7A0"], "published": "2015-07-23T23:00:00.000+03:00", "crawled": "2015-07-25T08:35:11.699+03:00", "highlightTitle": ""}