{"organizations": [], "uuid": "84178259ae68f22d5a0e2b51b0b154bef75f895c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61319/after-100-injured-and-dozens-dead-russia-launches-safe-selfie-ca", "country": "US", "title": "After 100 injured and dozens dead Russia launches 'safe selfie' campaign", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "After 100 injured and dozens dead Russia launches 'safe selfie' campaign", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T01:51:00.000+03:00", "replies_count": 0, "uuid": "84178259ae68f22d5a0e2b51b0b154bef75f895c"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61319/after-100-injured-and-dozens-dead-russia-launches-safe-selfie-ca", "ord_in_thread": 0, "title": "After 100 injured and dozens dead Russia launches 'safe selfie' campaign", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Russian police: A cool selfie could cost you your life After 100 injured and dozens dead Russia launches 'safe selfie' campaign Adv: \nJul 10, 2015 Adv: \nMOSCOW, Russia - Russian police have launched a campaign urging people to take safer selfies after about 100 were injured and dozens died this year in gruesome accidents while striking high-risk poses. \nTuesday’s warning comes after a 21-year-old woman in Moscow accidentally shot herself in the head in May while taking a selfie while holding a pistol. She suffered head injuries but survived. \nThat was just one in a string of recent selfie-related accidents. \n\"A cool selfie could cost you your life,\" the interior ministry warned in a new leaflet packed with tips such as \"a selfie with a weapon kills\". \nIn January, two young men blew themselves up in the Ural Mountains while taking a selfie holding a hand grenade with the pin pulled out. The mobile phone with the selfie survived as a record. \nIn May, a teenager in the Ryazan region died while attempting to take a selfie as he climbed on a railway bridge and accidentally came into contact with live wires. \n\"Unfortunately we have noted recently that the number of accidents caused by lovers of self-photography is constantly increasing,\" said Yelena Alexeyeva, an aide to the interior minister. \n\"Since the beginning of the year we are talking about some hundred cases of injuries for sure.\" \nSelfies have also led to \"dozens of deadly accidents,\" Alexeyeva added. \n\"The problem really exists and leads to very unfortunate consequences.\" \nThe new campaign includes leaflets, a video and online advice on the ministry's website. \n\"Before taking a selfie, everyone should think about the fact that racing after a high number of 'likes' could lead him on a journey to death and his last extreme photo could turn out to be posthumous,\" Alexeyeva warned.", "external_links": [], "published": "2015-07-11T01:51:00.000+03:00", "crawled": "2015-07-11T21:42:24.000+03:00", "highlightTitle": ""}