{"organizations": [], "uuid": "e0785825d3609a018e2e063bb4b8762589efee64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25445", "country": "", "title": "3 groups of travellers you should be targeting this summer", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "3 groups of travellers you should be targeting this summer", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "e0785825d3609a018e2e063bb4b8762589efee64"}, "author": "Singapore, July 7, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25445", "ord_in_thread": 0, "title": "3 groups of travellers you should be targeting this summer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "3 groups of travellers you should be targeting this summer Singapore, July 7, 2015 \nSUMMER is here and the timing is ripe for travel marketers who want to make the most of this peak season to engage customers. \n\nIn a summer-themed op-ed entitled Get ready for the Grand Wanderlusters this summer , Collinson Latitude draws on its six traveller profiles to highlight the opportunities for travel marketing and highlights three personas in particular. \n\nThe first are the Nesters. These family-focused, time-starved travellers are looking for value in terms of cost and experiences. Summer is the key holiday period for them due to the school holidays. \n\nTo reach this group, include built-in experiences in their packages to achieve value, offer flexible and long-term rewards they can share or use this summer or next. Once marketers have claimed the Nester’s loyalty, they are likely to become repeat customers. \n\nThe second group are the On-Demanders, usually aged between 20-34. Instant gratification and stylishness are crucial to winning the hearts of these career-oriented introverts, who are also most likely to take spontaneous trips. \n\nTarget this demographic with last-minute price deals and getaway offers, but keep them happy lest they take to social media to vent their frustrations. On-Demanders use aggregator sites and are twice as likely to include wellness activities as part of their itineraries, so it is good to highlight these when targeting this group. \n\nLast but not least are the time-rich Safeguarders who tend to splash out on one main holiday during the year in the summer on high-value and high points-value trips. Preferring traditional methods of engagement, they are most likely to book offline. \n\nTo reach this group, allow them to redeem their reward points throughout the year and offer them the chance to tailor-make their trips. \n\nThe Collinson Latitude op-ed stated: “The need for brands to understand their customers has always been true. But even more so now, is the importance for brands to translate this understanding into the products, services and offers provided. Not understanding your customers and using a blanket method could not only reduce effectiveness, but actually damage their perception of your brand and reduce the likelihood of them choosing you as their travel provider in the future.” \n\nCollinson Latitude identified six distinct traveller profiles in the report T he Grand Wanderluster: A New Perspective for the modern day travel reward programme .", "external_links": [], "published": "2015-07-07T03:00:00.000+03:00", "crawled": "2015-07-07T17:13:32.000+03:00", "highlightTitle": ""}