{"organizations": [], "uuid": "928cad39199633a0813919895e9f0673ed75e1ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61776/japan-airlines-opens-sakura-lounge-osaka-airport", "country": "US", "title": "Japan Airlines opens Sakura Lounge at Osaka Airport", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Japan Airlines opens Sakura Lounge at Osaka Airport", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T04:29:00.000+03:00", "replies_count": 0, "uuid": "928cad39199633a0813919895e9f0673ed75e1ee"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61776/japan-airlines-opens-sakura-lounge-osaka-airport", "ord_in_thread": 0, "title": "Japan Airlines opens Sakura Lounge at Osaka Airport", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Japan Airlines opens Sakura Lounge at Osaka Airport Adv: \nJul 24, 2015 Adv: \nOSAKA, Japan - Japan Airlines (JAL) opened its newly-renovated Sakura lounge for international flights at Osaka (Kansai) Airport. Located near Gate 37, the updated facilities offer customers a relaxing place to have a rest while traveling though Kansai Airport. \nJAL is operating seven daily flights between Osaka (Kansai) and Honolulu, Bangkok, Shanghai and Taipei, in addition to the latest non-stop flight to Los Angeles. \nRedesigned with the concept of \"Modern Japanese Style\", the airline is dedicating to create a comfortable environment in its lounges to deliver a message of the \"Heart of Japan\" and \"Japanese Hospitality\" to customers. \nJAL is striving to provide customers with the most innovative products and high-quality services. The airline will be continuing to embrace new challenges in order to become the most preferred and valued airline in the world. \nThe new Sakura Lounge boasts up-to date facilities such as: \n- Newly designed entrance and interiors \n- Seating for 177 guests (excluding seats in private room and massage chairs) \n- Smoking room with seats \n- Two massage chairs \n- Improved amenities like as new baggage storage with electric locks, spacious dining area with extensive table in the middle, enlarged and improved buffet counter, new make-up corner in ladies restroom, more power outlets around each seat, and bigger displays for flight information \nEnhanced food offering along with renewal of facilities \n- All day offering of two kinds of popular curries \nDomestic beef curry developed with a chef of Hotel Nikko Kansai Airport is served (limited offer) \n- Freshly prepared salad bar \n- Enhanced menu depends on the time of day \n- Special dishes cooked at Halal certified kitchen* (Dinner time) \n* Not guaranteed as Halal for all ingredients", "external_links": [], "published": "2015-07-24T04:29:00.000+03:00", "crawled": "2015-07-24T05:01:53.228+03:00", "highlightTitle": ""}