{"organizations": [], "uuid": "241fa3509f748d26158a47a53debc0006fa7f2fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/Romeria-2013-13.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/07/31/catholic-faithful-begin-annual-pilgrimage-to-costa-ricas-basilica-de-los-angeles", "country": "US", "title": "Catholic faithful begin annual pilgrimage to Costa Rica's Basilica de Los Ángeles", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Catholic faithful begin annual pilgrimage to Costa Rica's Basilica de Los Ángeles", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T12:00:00.000+03:00", "replies_count": 0, "uuid": "241fa3509f748d26158a47a53debc0006fa7f2fd"}, "author": "Amanda Zuniga", "url": "http://www.ticotimes.net/2015/07/31/catholic-faithful-begin-annual-pilgrimage-to-costa-ricas-basilica-de-los-angeles", "ord_in_thread": 0, "title": "Catholic faithful begin annual pilgrimage to Costa Rica's Basilica de Los Ángeles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nA barefooted pilgrim pays her respect to the Virgin of Los Ángeles during the annual romería in 2013. Albero Font/The Tico Times \nThis weekend, pilgrims from across Costa Rica will begin walking – if they haven’t already – to the Basílica de Nuestra Señora de Los Ángeles for an annual pilgrimage of faith known as the r omería . The purpose of their journey: to pay their respects to, and ask for favors from, the country’s patron saint: the Virgin of Los Ángeles, or La Negrita . \nApproximately 2 million people are expected to walk the annual romería. Many pilgrims already have begun their grueling trek to the church in recent days, but the majority of devotees will make the journey on Friday and Saturday, when special ceremonies are held. \nThe nationwide tradition, which also draws thousands from across the Central American region and beyond, is based on the 17th century legend of the Virgin, in which an indigenous woman discovered in the forest a small statue of a woman carrying a baby in her arms. The woman took the statue to her home, but something unusual happened: the next day, the statue was gone. The indigenous woman again found the statue in the middle of the woods, in the same spot as before. She again took it home for the second time, and by the next day, to everyone’s surprise, the small statue vanished once more, reappearing at its spot in the woods. The woman decided to tell the town’s priest, and after witnessing the phenomenon, he declared it a message from the Virgin Mary. The priest said villagers should build a church at the place where the statue appeared. \nThat church is the Basílica de Los Ángeles, in Cartago, about 25 kilometers southeast of the Costa Rican capital. Since the 19th century, millions of pilgrims have embarked on the journey to Our Lady of Los Ángeles; some cover hundreds of kilometers on foot, while others make the trek barefoot or on their knees to show their devotion. \nA relatively new part of this tradition is the “ EcoRomería, ” in which the Costa Rican Red Cross and Health Ministry carry out the difficult task of reducing trash and other pollution generated by the event. During last year’s pilgrimage this initiative managed to recycle 95 percent of the waste generated by the pilgrims, earning the romería a coveted environmental “ Blue Flag ” recognition. \nThis year, the project plans to cover romeros in San Pedro, Curridabat, La Unión and Cartago, where 41 recycling posts will be located. The Red Cross will also establish 10 permanent posts where ambulances and personnel will be able to care for injured pilgrims, and 25 posts on main streets where auxiliary committees will take care of public security. Planning on walking in this year’s romería? Here are some tips: Wear comfortable clothing and fluorescent colors so drivers can easily see you. Don’t forget your coat, as Cartago can get cold! Wear a hat to avoid sunlight, and thus, a headache. Don’t forget to use sunscreen. Wear comfortable shoes (make sure you have used them before to prevent blisters). Bring extra socks and change them if they get wet. Carry an umbrella for both the rain and the sun. If you are sick, ask your doctor if it is wise to make the trek. Make sure to carry an ID, and try not to travel alone. If you travel with children, look after them at all times and give them a document stating where to contact you in case they get lost. Carry enough water and energy drinks. Try to eat foods rich in potassium, such as bananas and citrus.", "external_links": [], "published": "2015-07-31T12:00:00.000+03:00", "crawled": "2015-07-31T12:06:37.785+03:00", "highlightTitle": ""}