{"organizations": [], "uuid": "03f52a62467d530d0f8990a13fd2c49389bb79de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61293/15-above-2014-tourism-arrivals-numbers-expected-seychelles", "country": "US", "title": "15% above 2014 tourism arrivals numbers expected for the Seychelles", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "15% above 2014 tourism arrivals numbers expected for the Seychelles", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T09:33:00.000+03:00", "replies_count": 0, "uuid": "03f52a62467d530d0f8990a13fd2c49389bb79de"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61293/15-above-2014-tourism-arrivals-numbers-expected-seychelles", "ord_in_thread": 0, "title": "15% above 2014 tourism arrivals numbers expected for the Seychelles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seychelles Tourism Board forecasts closing the year 15 % above 2014 tourism arrival figures 15% above 2014 tourism arrivals numbers expected for the Seychelles Adv: \nJul 10, 2015 Adv: \nSeychelles Tourism Board (STB) is forecasting closing the year, with a tourism arrival figure which will be 15% above that of 2014. \nIn 2014, Seychelles Tourism Board managed to consolidate its tourism arrival figures from its traditional European markets and its new emerging ones, bringing the destination to 1 % above the 2013 arrival figures. \nThis feat happened despite the numerous challenges the industry faced in 2014, such as the loss of air connectivity from Emirates’ reduced flights when works were being carried out to Dubai Airport, as well the loss of Air Austral and Ethiopian airlines for certain period of the year, together with the suspension of flights to the island by Qatar Airways. \nDespite, last year being a volatile year for tourism industry, Seychelles Tourism Board closed the business year, forecasting 5 % above 2014 tourism arrival figure. \nSherin Naiken Chief Executive of Seychelles Tourism Board, said “mainly all markets are showing signs of rebound except for Russia struck by domestic politico-economic crisis’’. \nShe added countries like Spain, high yield market which its arrival figures are not as significant as the leading markets is also showing signs of growth. \nTourism arrival figures for the second quarter of the year (January- June) published by the National Bureau of Statistics reflect an increase of 13% compared to the same period in 2014 (16, 864) \nBy end of the Sunday 28th June, tourism arrival figures were 15% above that of 2014. \nThe CEO of Seychelles Tourism Board said 2015 will end with a 15% increase in tourism arrival figures compared to the previous year. \n“The second quarter of the year has been positive for Seychelles Tourism Board. For the remaining third and fourth quarter of the year, with forward bookings coming in we believe we will close on a positive note. We should also bear in mind October was the strongest month on record for 2014 with 23,312 visitors, 197 more arrival than the second best April”, noted Sherin Naiken, Chief Executive Officer of Seychelles Tourism Board.", "external_links": [], "published": "2015-07-10T09:33:00.000+03:00", "crawled": "2015-07-10T18:01:44.000+03:00", "highlightTitle": ""}