{"organizations": [], "uuid": "cce8a6869dca632db5bbd4257c953792db55dd39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03370/coastalamy_3370109k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11728487/Our-coast-is-beautiful.-We-need-to-protect-it.html", "country": "US", "title": "Our coast is beautiful. We need to protect it", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Our coast is beautiful. We need to protect it - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T19:54:00.000+03:00", "replies_count": 0, "uuid": "cce8a6869dca632db5bbd4257c953792db55dd39"}, "author": "Dr John Cooper Clarke", "url": "http://www.telegraph.co.uk/goodlife/11728487/Our-coast-is-beautiful.-We-need-to-protect-it.html", "ord_in_thread": 0, "title": "Our coast is beautiful. We need to protect it", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The coast has long had healing powers for me and is something I associate with memories from my childhood. When I was a boy, I was unwell and left Salford and the city life behind to recuperate in Rhyl, a coastal town in the north east of Wales . I remember the saltiness of the air, people walking slowly, and the drumbeat of the waves on the beach. Everything just seemed to move at a slower pace. From my window I could see the sea, and how it never stopped, but simply turned into sky like a glimpse of eternity. My own memories of the coast revolve mainly around the seaside. People having fun in brightly coloured clothes, the smell of fried onions, ice cream and the big event that was the fairground. It was there that I first heard rock and roll emanating from the pier . Seaside fish and chips (Alamy) Fish and chips with newspaper print stuck to them, windy hair and rugged cliffs, crashing waves, scooping a crab up with a green net. It’s those fragments of memories you hold onto, but they build a picture, and it’s the smallest sights, sounds and smells that come back to you in fleeting moments. That’s why I’m right behind the National Trust on conserving it, keeping it beautiful and also maintaining the coast’s pathways for future generations to enjoy. The sea has long been a rich source of inspiration to me as a poet, and I’m not the alone in thinking that way. There is a great tradition of drawing on the sea for inspiration for literature – people like Robert Louis Stevenson , Herman Melville , Nordhoff and Hall and particularly Joseph Conrad , whose trips to the coast inspired his love for ocean navigation. The coast surrounds us as a nation, and saturates our culture through poetry, prose, music and art. That’s one of the reasons why I was keen to create the Nation’s Ode to the Coast with the National Trust as it’s the perfect way to convey the metaphysical nature of the sea. The lighthouse signal marks the beginning and end of the land. A touchstone for landlubbers and seafarers alike. All is well. #lovethecoast — Twi$t (@nigeltwist) July 9, 2015 Throughout summer, the Trust is asking people to contribute their own memories and pictures of the coast through Twitter, Facebook and Instagram using #lovethecoast. The final poem will be written for the nation, by the nation, and I think that’s what’s important. It’s our collective experience that makes up our memories of the coast – you can’t have a beach with only one pebble. For me, there’s nothing more healing than a long, pointless walk along the coast. And when the sun shines on the sea, there’s nothing more beautiful in the world. Follow @telegoodlife", "external_links": [], "published": "2015-07-10T19:54:00.000+03:00", "crawled": "2015-07-10T14:56:01.000+03:00", "highlightTitle": ""}