{"organizations": [], "uuid": "63b96674d654b7670132157f4617f1c90c61bd68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/breakaway-duo-getaway-for-a-honeymoon-cruise/4697948.article", "country": "GB", "title": "Breakaway duo Getaway for a honeymoon cruise", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Breakaway duo Getaway for a honeymoon cruise", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T11:00:00.000+03:00", "replies_count": 0, "uuid": "63b96674d654b7670132157f4617f1c90c61bd68"}, "author": "", "url": "http://www.ttgdigital.com/news/breakaway-duo-getaway-for-a-honeymoon-cruise/4697948.article", "ord_in_thread": 0, "title": "Breakaway duo Getaway for a honeymoon cruise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Save \nA former agent who used a cruise he won in a competition with TTG and Norwegian Cruise Line to propose to his girlfriend has celebrated their love of cruising - with a honeymoon onboard the sister ship. \nAaron Fletcher, then a travel agent at Belfast-based Oasis Travel, and also a Norwegian Ambassador, won a sailing on the maiden voyage of Norwegian Breakaway in 2013,where he popped the question to his girlfriend, Jennifer Keith, who is also a travel agent. \nThe couple then began preparing for their wedding, with Keith instructing Fletcher to plan the honeymoon. And what else could he choose, but a cruise on Breakaway’s sister ship, Norwegian Getaway. \n“We first met on a ship visit and I just thought it would tie it all together,” Fletcher told TTG. “Jennifer said she wanted it to be a surprise, so I had to do it all in secret - it took a lot of planning. I managed to fly her over to London from Ireland before I revealed what we were going to be doing on our honeymoon.” \nEven the pilot of the plane that carried them to London was in on the act, announcing to the rest of the passengers that he was unable to reveal the plane’s destination as it was a secret for Fletcher’s new wife. \nThe couple first flew to Las Vegas, before heading to Miami to embark on a voyage around the Bahamas. \nNorwegian Cruise Line also endeavoured to make the holiday special for the newlyweds, providing them with onboard credit to enjoy the ship’s facilities. \n“Norwegian will always have a special place in our hearts,” Fletcher said. “There was one restaurant onboard that was particularly special as well - on the night we got engaged, we ate in Tepanyaki restaurant, and we wanted to make sure that we ate there again. \n“As it turned out, we ended up sitting in exactly the same seats that we had sat in on Breakaway.” \nFletcher, who is now a cruise specialist at Belfast tour operator World Travel Centre, where his new wife also works, said the couple were now planning which Norwegian ship they wanted to spend their next holiday on. \n“We just love it - there’s something for everyone. We want to do one of the older ships in the fleet, and one of the smaller ones, as we’ve heard people say how lovely and intimate they can be,” he added.", "external_links": [], "published": "2015-07-23T11:00:00.000+03:00", "crawled": "2015-07-23T19:22:28.308+03:00", "highlightTitle": ""}