{"organizations": [], "uuid": "f9da99adbb30256d15b81edf67eee1c2261889b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/3842721/fivethingsnew*1200xx1800-1013-0-153.jpg", "site_section": "http://louisville.bizjournals.com/rss/feed/vertical_subtopic/65", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/cincinnati/feature/5-things/2015/07/five-things-you-need-to-know-today-and-a.html", "country": "US", "title": "Five things you need to know today, and a Cincinnati boy gets his BBQ education", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "Five things you need to know today, and a Cincinnati boy gets his BBQ education", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T14:50:00.000+03:00", "replies_count": 0, "uuid": "f9da99adbb30256d15b81edf67eee1c2261889b4"}, "author": "Rob Daumeyer", "url": "http://www.bizjournals.com/cincinnati/feature/5-things/2015/07/five-things-you-need-to-know-today-and-a.html", "ord_in_thread": 0, "title": "Five things you need to know today, and a Cincinnati boy gets his BBQ education", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Five things you need to know today, and a Cincinnati boy gets his BBQ education Jul 22, 2015, 7:50am EDT Share Rob Daumeyer Editor Cincinnati Business Courier Home of the Day Good morning, Cincinnati! Here are the five most important things you need to know to help start your busy business day: Mercy reveals plans for East Side medical center Mercy Health-Cincinnati will build a medical center in Clermont County's Union Township that could include facilities for cancer care and women’s health, Barrett J. Brunsman reports. The center will be built off Interstate 275 near the headquarters of Total Quality Logistics and accessible via nearby Ohio State Route 32. Don't take good health for granted: Here are 5 reasons to schedule your annual preventative visit , a sponsored message from The Christ Hospital Health Network . Jet firm leases former P&G hangar at Lunken for expansion Tatum Hunter reports that aircraft management and charter company Reynolds Jet signed a lease to occupy Hangar 4 at Cincinnati’s Lunken Airport, the former dwelling place of Procter & Gamble’s corporate jet fleet. Reynolds looks after private jets for their owners and offers jet charter services. The firm was founded in 2008 by J. Mercer Reynolds and also has offices in Austin, Texas. It has seven planes in its fleet, and six of them are available for charter. Sewer district chief to leave for Louisville Tony Parrott , the former Greater Cincinnati Water Works director who was serving as sewer district director following a restructuring, has been hired as the next executive director of the Louisville Metropolitan Sewer District. Parrott was named the leader of the Metropolitan Sewer District of Greater Cincinnati in 2005. Could Macy's be dethroned? Macy's could lose its title as the king of clothing retail. A new report from Cowen & Co. expects Amazon to become the No. 1 retailer of clothing in the U.S. by 2017, a spot currently held by Macy's. Macy's is expected to have apparel revenue of $22.2 billion this year, but Amazon is catching up with expected apparel revenue of $16.34 billion this year. Cowen expects that Amazon's apparel revenue will grow to $27.8 billion by 2017, jumping to $52 billion by 2020. Chipotle embarks on next food makeover Satisfied with positive reaction to its decision to make all menu items GMO-free, Chipotle Mexican Grill Inc. is launching an effort now to create its own tortillas in order to avoid the artificial additives found in the mass-produced tortillas it currently serves. I Spy Cincinnati Here's the latest clue in our weekly photo quiz. This day in history On this day 500 years ago, the First Congress of Vienna settled issues between Poland and the Holy Roman Empire. It marked the beginning of real Habsburgs influence on Vienna, which made it the greatest city in the world (according to me). Trending on Google Business News", "external_links": [], "published": "2015-07-22T14:50:00.000+03:00", "crawled": "2015-07-22T15:03:57.368+03:00", "highlightTitle": ""}