{"organizations": [], "uuid": "2d65b75f39ded44e8e0c95dc8ce596e209e764c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/download15.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/bacara-resort-spa-one-carat-diamond-necklace-given-away-asae-annual-august/", "country": "US", "title": "'Bacara Resort & Spa One-Carat Diamond Necklace' To Be Given Away at ASAE Annual in AugustTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "'Bacara Resort & Spa One-Carat Diamond Necklace' To Be Given Away at ASAE Annual in AugustTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "2d65b75f39ded44e8e0c95dc8ce596e209e764c3"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/bacara-resort-spa-one-carat-diamond-necklace-given-away-asae-annual-august/", "ord_in_thread": 0, "title": "'Bacara Resort & Spa One-Carat Diamond Necklace' To Be Given Away at ASAE Annual in AugustTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "‘Bacara Resort & Spa One-Carat Diamond Necklace’ To Be Given Away at ASAE Annual in August Published on : Saturday, July 18, 2015\nIf you are attending the ASAE Annual Meeting & Exposition in Detroit in August, you should be sure to visit Associated Luxury Hotels International’s “Luxury Lane” area. The reason? In addition to finding out about ALHI’s diamond-studded portfolio of more than 170 Four- and Five-Diamond quality hotels and resorts worldwide which specialize in serving the meetings and incentive marketplace, you will have the chance to register for the chance to win a dazzling one-carat diamond necklace. ALHI is giving away the stunning one-carat “Bacara Resort & Spa Diamond Necklace,” representing the Four- and Five-Diamond ALHI portfolio at the convention, which is being held August 8-11, 2015 at Cobo Center in Detroit.\nThe diamond necklace is named in honor of Santa Barbara, California’s extraordinary, newly renovated and reimagined oceanfront Bacara Resort & Spa, a distinguished Member of ALHI’s worldwide portfolio. The gem is being given away by ALHI as a means to recognize its exceptional Four- and Five-Diamond quality portfolio ideal for meetings, conventions, and incentive programs. Association executives, meeting professionals, incentive/recognition specialists, and business executives in attendance simply need to stop by ALHI’s “Luxury Lane” area (anchored at Booth #1023), in order to register for the chance to win the bling.\nFeaturing a truly beautiful coastal setting overlooking the Pacific, Bacara Resort & Spa just completed an impressive multi-million dollar renovation of its 360 guest rooms and suites, with an inviting Spanish Colonial feel. Other recent improvements include a Foley Wine Tasting Room, a new coffee bar, a refreshed seaside restaurant, and an upgraded poolside bar. In addition to its new guestrooms, the resort also offers 70,000 square feet of meeting and event space. Plus, groups and guests also enjoy a 42,000-square-foot spa and wellness center, three zero-edge swimming pools (two with ocean views), direct beach access, four Har-tru clay tennis courts, onsite nature trails, and four restaurants and lounges. The resort is nestled on the bluff and beaches of the Gaviota coast, just 40 miles from Santa Ynez Wine Country and five miles from the Santa Barbara Airport.\n“The ‘Bacara Resort & Spa Diamond’ is quite remarkable, just like its namesake resort,” said ALHI President Jim Schultenover. “The talented General Manager and industry veteran Kathleen Cochran leads a remarkable team ready to serve up successful programs of all types in this remarkable resort and beautiful destination in Santa Barbara, California.”\nSource:-Bacara Resort\nRelated Posts Lisa Lewis Joins Associated Luxury Hotels As National Sales Manager In The U.S. West Region 40% reduction in room rates in Grand Hyatt Taipei in July and August Express your love this Valentine’s Day at Calabash Cove Resort & Spa Jason Pomeranc, hotelier announces launch of new brand of hotel Sixty Hotels Celebrate the holiday season at Moon Dance Cliffs Hotel & Spa", "external_links": [], "published": "2015-07-18T03:00:00.000+03:00", "crawled": "2015-07-19T01:27:11.000+03:00", "highlightTitle": ""}