{"organizations": [], "uuid": "07d1835ab57e227454265372af06bdccd512e9b5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03368/Gastronomy-Restaur_3368491a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/dubai-holidays/11713537/best-food-in-dubai.html", "country": "US", "title": "Dubai restaurants: sample the world on a plate", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Dubai restaurants: sample the world on a plate - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T23:48:00.000+03:00", "replies_count": 0, "uuid": "07d1835ab57e227454265372af06bdccd512e9b5"}, "author": "James Litston", "url": "http://www.telegraph.co.uk/sponsored/travel/dubai-holidays/11713537/best-food-in-dubai.html", "ord_in_thread": 0, "title": "Dubai restaurants: sample the world on a plate", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dubai is perfectly positioned at a global crossroads, between north, south, east and west. This privileged location has opened the country to influences from all compass points, and nowhere is this more evident than in Dubai's diverse dining scene. The varied world flavours of Peru, China, Lebanon, India, Thailand, France and Spain are all here, providing an unmatched taste sensation that truly spans the globe. From emirati street food costing just a few pounds through to gourmet greatness from famed, Michelin-starred chefs, Dubai has thousands of eateries to suit all tastes and palates. Everything from home-grown diners to international brands and chains are represented, with more outlets expanding and opening frequently. Many restaurants are affiliated with celebrity chefs like Gary Rhodes or Wolfgang Puck. In addition to his existing restaurants in Grosvenor House and Le Royal Méridien, Rhodes is due to open Vox Theatre (an upscale dinner-and-movie concept) this autumn at the new Vox Mall of the Emirates, the Middle East's largest cinema. Other high-profile newcomers in the pipeline for this autumn include Gordon Ramsay's Bread Street Kitchen at Atlantis, The Palm, and Tom Aikens' Pots, Pans and Boards at The Walk, said to be Dubai’s most up-and-coming dining destination. Emirati street food can be sampled city-wide, but is best discovered in Dubai's historic Old Town A good many of Dubai's best restaurants are located within the city's vast portfolio of hotels. Beyond those with celebrity chef endorsement are others that are truly unique. Armani/Ristorante, for example, enjoys privileged views from within Burj Khalifa, the world's tallest building. Ossiano, a seafood restaurant at Atlantis, The Palm, is at the other end of the spectrum - underwater, looking into a fish-filled lagoon. And of course, many hotels offer nightlife where those that wish can continue to live the high life long into the night. Hotel restaurants are also among the best places to enjoy Friday brunch. This has become a Dubai institution, and there's no better way to celebrate the start of the Arab weekend in style. Many hotels lay on particularly lavish spreads, and some also provide themed entertainment. Among the most talked-about brunch spots is Imperium at Jumeirah Zabeel Saray, where the Emperor's Brunch, complete with live jazz performance, will set you back around £78 per person, including drinks. Other popular Friday haunts include Bubbalicious at the Westin Mina Seyahi, or Saffron at Atlantis, The Palm, where cooking stations add to the theatrical opulence of the event. For something more authentic, Emirati street food can be sampled city-wide, but is best discovered in Dubai's historic Old Town. It's even possible to take a foodie walking tour through this lovely and characterful quarter to taste grilled shawarma and sip cups of Arabic coffee. With so many delicious temptations spanning the full, global culinary spectrum, visitors to Dubai are truly spoiled for choice when it comes to eating out. Lunch, brunch and dinner options cover every imaginable cuisine… the only catch is not being able to fit everything into one trip! For more information, visit valueaddedtravel.com Dubai in five days:", "external_links": [], "published": "2015-07-09T23:48:00.000+03:00", "crawled": "2015-07-09T20:40:46.000+03:00", "highlightTitle": ""}