{"organizations": [], "uuid": "5cd833813ba625518681ef15f035e0ff3d50141d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61484/seaworld-issues-statement-alleged-undercover-animal-activist", "country": "US", "title": "SeaWorld issues statement on alleged \"undercover animal activist\"", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "SeaWorld issues statement on alleged \"undercover animal activist\"", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T04:10:00.000+03:00", "replies_count": 0, "uuid": "5cd833813ba625518681ef15f035e0ff3d50141d"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61484/seaworld-issues-statement-alleged-undercover-animal-activist", "ord_in_thread": 0, "title": "SeaWorld issues statement on alleged \"undercover animal activist\"", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SeaWorld issues statement on alleged \"undercover animal activist\" Adv: SeaWorld Entertainment CEO Joel Manby Adv: \nORLANDO, FL - SeaWorld Entertainment, Inc today issued the following statement from CEO Joel Manby in response to recent news reports: \n\"The allegations made yesterday against a SeaWorld employee are very concerning. These allegations, if true, are not consistent with the values of the SeaWorld organization and will not be tolerated. The SeaWorld Board of Directors and I have initiated an investigation into this matter which will be led by independent outside counsel, Ron Olson of Munger, Tolles & Olson, whose firm will have full access to our organization and people. In addition, we have placed the employee in question on paid administrative leave pending the findings of the investigation. We will take all appropriate actions based on the results of the investigation to ensure that the integrity and values of the SeaWorld organization are upheld.\" \nPeople for the Ethical Treatment of Animals said this week that SeaWorld employee Paul McComb had masqueraded as an animal-rights activist named Thomas Jones for three years, holding anti-SeaWorld signs in front of the company’s San Diego theme park and getting hauled away by police during a protest at the Rose Parade in Pasadena, California, last year. \nPeta, which has been protesting SeaWorld’s use of killer whales in shows for decades, said McComb used the alias to gain information about events and to goad activists to take more aggressive action against the company.", "external_links": [], "published": "2015-07-16T04:10:00.000+03:00", "crawled": "2015-07-16T04:34:03.000+03:00", "highlightTitle": ""}