{"organizations": ["MSC"], "uuid": "c7d62e745b6f84500c7b4e093fdd2e5afecf9720", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/msc-predicts-seaside-will-draw-brits-to-miami/4697727.article", "country": "GB", "title": "MSC predicts Seaside will draw Brits to Miami", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "MSC predicts Seaside will draw Brits to Miami", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T11:00:00.000+03:00", "replies_count": 0, "uuid": "c7d62e745b6f84500c7b4e093fdd2e5afecf9720"}, "author": "", "url": "http://www.ttgdigital.com/news/msc-predicts-seaside-will-draw-brits-to-miami/4697727.article", "ord_in_thread": 0, "title": "MSC predicts Seaside will draw Brits to Miami", "locations": ["Miami"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Save \nMSC’s new Miami-based ship will prove “a significant opportunity” for UK agents, according to the cruise line’s UK boss. \nGiles Hawke, executive director, UK, Ireland and Australia, said that while America would be the number one source market for MSC Seaside when it launches in November 2017, he also expected it to be popular with British cruisers. \n“We know Brits love going to the Caribbean, and fly-cruise to the Caribbean is already a huge market,” he said. “I expect that, by 2018, we’ll be sending 10,000-15,000 passengers a year from the UK to Miami,” he said. \nBy 2018, MSC will have sufficiently grown its presence in the UK market to make those kind of numbers possible, he added. \nHawke said he expected the 4,140 passenger-MSC Seaside to go on sale before the end of the year, well in advance of its first sailing, and that it “could be a challenge getting on it at first” since existing cruisers will be so keen to try this different product. \n“A similar thing happened to Royal Caribbean when it brought out Oasis of the Seas; that’s what will happen for us, because the product’s just so different.” \nBut he denied clients might hold off booking other cruises until Seaside comes at the end of 2017. \n“I don’t think it will cannibalise demand in the short and medium term,” he insisted. “I don’t think anyone will say, ‘I’m going to wait’.” \nHawke admitted some UK agents still had reservations about the MSC brand, but he said the fact the cruise line has two new classes of ship under development should challenge negative perceptions. \n“We may not have got everything right as we grew [over the past 10 years]. Some agents might have historic perceptions from some of our older tonnage. But with Meraviglia [the first of a new Vista class of “mega-ship”] coming and Seaside coming, it’s a statement… We’re saying we’re a serious company with serious capability,” he explained. \nMeraviglia and Seaside will offer four new cabin categories: duplex suites; family cabins for up to six comprising two interconnecting cabins, one bathroom and one balcony; “superfamily” cabins for up to six also, comprising two cabins, two bathrooms and two balconies; and “superfamily plus” cabins for up to 10 passengers, comprising three cabins, three bathrooms, and two balconies.", "external_links": [], "published": "2015-07-02T11:00:00.000+03:00", "crawled": "2015-07-03T10:16:57.000+03:00", "highlightTitle": ""}