{"organizations": [], "uuid": "5ce2d5b8555462b4453a648545c5f209f6757035", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources1.news.com.au/images/2015/07/16/1227444/244853-f91d99ce-26af-11e5-b33b-dc629bef0d9a.jpg", "site_section": "http://www.adelaidenow.com.au/travel/australia/south-australia", "section_title": "South Australia | South Australian Holidays | Adelaide Holiday Travel SA | The Advertiser", "url": "http://www.adelaidenow.com.au/travel/travel-news/a-message-to-those-who-shot-down-malaysian-airlines-flight-mh-17/story-fni0biep-1227444247518", "country": "US", "title": "MH17 victim Jack O’Brien: Parents Jon Meryn share statement | Travel | Travel News and Holiday Deals | |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "MH17 victim Jack O’Brien: Parents Jon and Meryn share statement | Travel | Travel News and Holiday Deals | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T21:35:00.000+03:00", "replies_count": 0, "uuid": "5ce2d5b8555462b4453a648545c5f209f6757035"}, "author": "Jon and Meryn O’Brien", "url": "http://www.adelaidenow.com.au/travel/travel-news/a-message-to-those-who-shot-down-malaysian-airlines-flight-mh-17/story-fni0biep-1227444247518", "ord_in_thread": 0, "title": "MH17 victim Jack O’Brien: Parents Jon Meryn share statement | Travel | Travel News and Holiday Deals | |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT HAS been a year since Malaysian Airlines flight MH17 was shot down over Ukraine, killing all 298 people on board. Here, Jon and Meryn O’Brien, whose son Jack was among those who died, share their message to those responsible.\n—\nOur names are Jon and Meryn O’Brien. We live in Sydney, Australia.\nOn July 17 last year, in Ukrainian airspace, our only son Jack was killed when Malaysia Airlines flight MH17 was shot down.\nJack was 25.\nWe make this statement on behalf of our son who would be outraged that his life was snatched away, and because it is one thing we can do in response to the evil that has occurred. We do not speak for the families of all the others on board. We don’t know them personally, though we are now bound together by this wilful act of violence.\nThe passengers and crew on MH17 were ordinary people going about their lives. Many of the more than 6000 people killed in this undeclared war were civilians, also just going about their normal lives. With their families we share bewilderment and grief at the futile loss of people we love.\nIt is this grief we want you, the people who shot down flight MH17, to know about. We want you, and the people who gave you orders and armed you, to be aware of the pain you have inflicted.\nIn May last year the opportunity came up for Jack to travel. With money he had saved from his work in the fitness industry, Jack travelled from Amsterdam around Iceland, and then on to Russia, England and Spain and finally back to Amsterdam. He was on his way home to us after seven weeks away. It had already seemed a long time.\nJack during his travels. Source: Supplied\nWe woke that morning to the news that a Malaysia Airlines flight from Amsterdam to Kuala Lumpur had been shot down over Ukraine. We cried out in disbelief. That was Jack’s flight. Then came the phone calls and agonising wait while our government officials confirmed what we feared. We heard the news that every parent dreads. Your child is dead.\nJack had so much life ahead of him. He loved football and had been following the World Cup while he was away. He played with friends in a local team and had done so since he was a boy.\nHe had finished a degree in business. He had triumphed over health problems that plagued him for more than a year and was studying to become a personal trainer. We had been so relieved at his recovery and proud of our son’s determination and discipline. He also encouraged others to reach their goals. He was embracing life and eager for what was next.\nOur joy has turned to sorrow and disbelief. Our world seems drained of meaning and hope.\nNow, nearly a year later, we do our best to get up and live each day, but inside we are broken. We miss Jack so deeply. The unique person he was, is gone. We can only remember him. We will never again see him and know him as he is.\nIt is heartbreaking to think of all the things he might have done that we will not witness.\nHe will never win a championship with his football team. He won’t ever become a personal trainer. He will never marry or have children of his own. When our beloved daughter, Jack’s sister, marries, he will not be there. She now feels alone, without the promise of that lifelong relationship and blood connection that only a brother or sister can provide.\n‘Jack had so much life ahead of him’. Source: Supplied\nFor us, grief comes in enveloping waves. At other times there is just emptiness. The yearning for Jack — to hear his car pull up outside, to see him walk through our door — is almost unbearable.\nAnd so we ask ourselves — what happened that afternoon?\nDid you intend to shoot down a passenger plane?\nIf not, why did the missile enter international airspace? Did one of you make a mistake or was there a problem with the weapons system?\nWere you following orders, or had you taken matters into your own hands?\nWhatever your reasons for fighting or your belief in the rightness of your cause, how can you justify killing innocent civilians?\nHow did each one of you feel when you realised you had shot down a passenger plane and saw the bodies of the people you had killed, including 80 children?\nWe said that Jack would be outraged that his and others’ lives were taken. We too are deeply angry. Despite this, any revenge, even if we could accomplish it, would be futile. It would just add to the violence and callous indifference that has cost Jack and so many others their lives.\nBut we do seek justice. We want you, the crew who fired the missile, to be held accountable and dealt with accordingly.\nWe want your military leaders, who are responsible for your conduct, to answer for what happened.\nBut most of all, we want the political leaders who, from a distance, armed you and moved you as pawns on a chessboard, to be called to account for this crime against humanity.\nAll those aboard flight MH17 deserve at least that.\nMore: www.ourmh17story.com/\nOriginally published as ‘We want you to be aware of the pain’", "external_links": ["http://resources2.news.com.au/images/2015/07/16/1227444/247490-0bb1b760-26af-11e5-b33b-dc629bef0d9a.jpg", "http://www.news.com.au/national/nsw-act/a-message-to-those-who-shot-down-malaysian-airlines-flight-mh-17/story-fnj3rq0y-1227444247518", "http://resources0.news.com.au/images/2015/07/16/1227444/244912-0b06a28a-26af-11e5-b33b-dc629bef0d9a.jpg", "http://www.ourmh17story.com/"], "published": "2015-07-16T21:35:00.000+03:00", "crawled": "2015-07-16T08:07:30.000+03:00", "highlightTitle": ""}