{"organizations": [], "uuid": "672b85cf5b9101107419714861655b5d5699a2cd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/239399?filename=239399.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/07/22/754282/10142751/en/The-Travel-Corporation-s-Team-Members-Celebrate-Digital-Transformation-with-Their-Personal-TTCTopTen-Bucket-Lists.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "The Travel Corporation's Team Members Celebrate Digital Transformation with Their Personal #TTCTopTen Bucket Lists", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "The Travel Corporation's Team Members Celebrate Digital Transformation with Their Personal #TTCTopTen Bucket Lists", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T22:29:00.000+03:00", "replies_count": 0, "uuid": "672b85cf5b9101107419714861655b5d5699a2cd"}, "author": "", "url": "http://globenewswire.com/news-release/2015/07/22/754282/10142751/en/The-Travel-Corporation-s-Team-Members-Celebrate-Digital-Transformation-with-Their-Personal-TTCTopTen-Bucket-Lists.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "The Travel Corporation's Team Members Celebrate Digital Transformation with Their Personal #TTCTopTen Bucket Lists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Travel Corporation's Team Members Celebrate Digital Transformation with Their Personal #TTCTopTen Bucket Lists ~ Creating a highly engaged and transparent company culture worldwide with their passion for travel ~ July 22, 2015 15:29 ET | Source: The Travel Corporation USA \nDELRAY BEACH, FL, July 22,   Brand awareness is often thought of as an outward looking approach, where companies look to raise the level of consumer recognition of their image and experiences as well as their products and services to the public. However, in today's interconnected world, employee engagement is crucial in an era in which brands can play a larger role in offering a deeper understanding of its core values. In order to convey a truly meaningful experience that resonates, companies must look within their own organization, as brands are built from the inside. \nAccording to a Gallup study, only 13 percent of the global workforce reported being \"highly engaged.\" For legacy brands with teams working in different regions of the world, employee engagement can prove to be a challenge. As one of the top challenges faced by 87 percent of global organizations according to The Human Capital Trends 2015 report, a fourth-generation family-owned business is leading the way in employee engagement that has yielded remarkable results. The Travel Corporation , and their brands, sought to redefine the travel experience by leveraging its 10,000 strong, diverse workforce and embracing innovation with the use of LinkedIn for its \"TTC Top Ten\" Bucket List campaign. As a result, the company netted a measurable increase in sales and generated greater awareness of its brand and company ethos of \"putting its customers both internally and externally - at the heart of everything we do.\" \nMany studies have proven that a highly motivated staff leads to customer loyalty, providing better customer service and brand experience due to the staff feeling invested in the company and not to mention, increasing positive word of mouth to trade partners and consumers alike. With its eyes set towards creating a highly engaged workforce that conveyed its passion for travel, The Travel Corporation mobilized its team members to become brand advocates . As a group of individuals who lived and breathed travel as part of their everyday lives, the company's staff would be instrumental in attracting a highly coveted demographic of consumers - the aspirational traveler. The United Nations World Tourism Organization (UNWTO) forecasts international tourist arrivals to grow by three to four percent by the end of 2015. To engage with these potential consumers, the company saw the potential to tap into a core theme prevalent among all travelers: the bucket list. Once considered a personal list of destinations that aspiring travelers would like to travel to in their lifetime, has evolved to become a social media phenomenon that has seen travelers and wouldbe travelers sharing their lists with one another. \nUsing LinkedIn , the world's largest professional network on the Internet, The Travel Corporation leveraged the concept of inspiring aspirational travelers through the sharing of a travel bucket list by its own staff. Tapping into its team of 10,000 team members worldwide, The Travel Corporation welcomed them to share their bucket lists across LinkedIn. Hundreds of key team members from the global organization shared their lists, from CEO's, Managing Directors, Sales Managers, to Travel Directors that generated excitement for travel inside and outside the organization. With more than 364 million users worldwide, LinkedIn's news and mobile content distribution platform, LinkedIn Pulse, provided the perfect stage for staff to share their love of travel that would be seen by all of the world's professionals. Along with utilizing LinkedIn to build its \"social army\" of brand advocates, The Travel Corporation also launched new and interactive websites for many of its brands that emphasized visual storytelling of experiences shared among travelers. \nThe #TTCTopTen social media campaign was designed to spur awareness of the company's philosophy of creating enriching experiences for its guests, and in turn, became a vehicle that increased traffic and leads for The Travel Corporation and its 30 brands. Within a couple months of the #TTCTopTen campaign, TheTravelCorporation.com , saw a 40% increase in website traffic, as well as a 184% spike in mobile visits, leading directly to brand websites and specifically Ashford Castle , one of the company's signature hotels that nearly every team member featured on their Top Ten Lists, including the Global Vice President of Digital for the company which can be viewed here https://www.linkedin.com/pulse/my-ttc-top-ten-travel-bucket-list-dan-christian . \nFor more than 40 years, The Travel Corporation has been at the forefront of the travel industry offering over 1,000 trips spanning 60 countries across seven continents, including an amazing selection of guided holidays, river boutique cruises, safaris, independent bespoke travel, soft adventure experiences and luxury hotels. The company has been sending two million travelers to more than 70 countries on an annual basis. \n\"At The Travel Corporation, we pride ourselves on being a worldwide travel expert that serves two million travelers on an annual basis. But over time, we must look towards the future,\" said Brett Tollman, CEO of The Travel Corporation . \"How do we unlock the potential of the two million loyal customers who are traveling with only one out of our 30 brands? By investing in a digital transformation that includes optimized websites and a streamlined approach to cross market our various brands, will help our travel partners, from travel agents to agencies, sell more of our wonderful itineraries.\" \nMoving towards a digital future, The Travel Corporation is embarking on an unprecedented period of transformation within each of its 30 brands digital footprints. A digital team, headquartered in the company's Toronto, Canada offices was created to lead all of the global teams to realize this metamorphosis. The first phase involved a complete redesign of the company's websites, including Trafalgar , Insight Vacations , The Red Carnation Hotel Collection , and Uniworld Boutique River Cruise Collection . Together with the website redesign strategy, applying an effective cross marketing system for all of its brands will be another priority for the company. Previously, each of The Travel Corporation brands was siloed, all operating separately from one another without sharing data. It was apparent to the digital team that in today's interconnected world where loyalty is vital in capturing market share, they would need to show that each brand complemented each other. \n\"Due to The Travel Corporation having 30 brands under its portfolio, few organization experiences the same complex operational reality of a business model like ours. Our main focus is steering our entire organization to become more technology-based by introducing new advanced platforms to our global operations. Over the past year, we have introduced more than 10 major website re-launches, where we've already seen significant conversion rates increases,\" said Dan Christian, Global Vice President of Digital for The Travel Corporation . \"With our LinkedIn activity, we can continue to attract top digital talent with a passion for travel to join our ongoing digital transformation.\" \nFor the first time in The Travel Corporation's history, there is a shift in business practices among all brands that will now allow a traveler to embark on a complete travel life cycle. A traveler starting with one brand will eventually grow older, and their preferences in travel style evolve with time. As The Travel Corporation looks to cross marketing as its next phase in the transformation process, this traveler will be able to continue their vacations with the other brands and create their own Top Ten Bucket List of dream trips by visiting www.TheTravelCorporation.com . ### \nAbout The Travel Corporation The Travel Corporation is a highly successful international travel group. Our philosophy is simple. To create enriching experiences for our travelers by combining an unbeatable mix of exceptional service and quality at great value. No matter what your taste, whether you are a family or a couple, a group or traveling solo - The Travel Corporation offers something for everyone. Our multi-award-winning portfolio ranges from luxury hotels and boutique river cruises, to independent holiday package companies and a variety of guided travel experiences. \nAs a worldwide travel expert, with 40 sales offices and 10,000 team members, serving over 2 million customers annually we take our travelers to over 70 countries. \nBeing a 4th generation, family-owned business that is financially independent, we pride ourselves on taking a long-term view, with an ethos of attention to detail in all areas of the company. \nAbout The TreadRight Foundation \nCreated as a joint initiative between TTC's family of brands, The TreadRight Foundation is a not-for-profit working to encourage sustainable tourism and ensure the environment, wildlife and communities we visit remain vibrant for generations to come. By providing grants to organizations that encourage sustainability in different destinations, The TreadRight Foundation hopes to maintain the natural attractions across the world that define each unique region. Media Contacts: Susan Chou Public Relations Coordinator Susan.Chou(at)TravCorpUSA.com Twitter: @Susan_TravCorp Arnelle Kendall Vice President of Public Relations Arnelle.Kendall(at)TravCorpUSA.com Twitter: @ArnelleKendall The Travel Corporation Public Relations Office 636 East Atlantic Avenue Suite 203 Delray Beach, FL 33483 561.330.0850 Related Articles", "external_links": [], "published": "2015-07-22T22:29:00.000+03:00", "crawled": "2015-07-22T23:43:28.932+03:00", "highlightTitle": ""}