{"organizations": [], "uuid": "c3381e299ae2a1bf19489a98ed4533735b1b1105", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/operators/insight-vacations-expands-into-south-america/4697767.article", "country": "GB", "title": "Insight Vacations expands into South America", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Insight Vacations expands into South America", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T11:39:00.000+03:00", "replies_count": 0, "uuid": "c3381e299ae2a1bf19489a98ed4533735b1b1105"}, "author": "", "url": "http://www.ttgdigital.com/news/operators/insight-vacations-expands-into-south-america/4697767.article", "ord_in_thread": 0, "title": "Insight Vacations expands into South America", "locations": ["South America"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Edward Robertson"], "text": "Insight Vacations expands into South America 3 July 2015 | By Edward Robertson \nInsight Vacations has launched its new American programme covering both continents for the first time. John Boulding, chief executive of Insight Vacations \nGlobal chief executive John Boulding said the operator was testing the water with the inclusion of Peru in the 2016/17 USA, Canada and South America programme. \nIn expectation that the new destination will be well received, he is already confident that further south American destinations will make their way into future programmes. \nBoulding said: “People are always looking for new destinations and some traditional destinations are suffering at the moment like the eastern Mediterranean and particularly Egypt and north Africa. \n“People are looking further afield and South America has a strong connection to European. \n“Apart from that there is a genuine interest in it and there are so many journalists writing about it, it is now on people’s bucket lists.” \nBoulding added the new programme will be particularly popular with repeat customers looking for somewhere new and different to visit. \nAnd if the programme is as popular as he believes it will be, he is confident that soon other south American destinations like Brazil, Argentina and Chile will be featured by the operator, allowing customers to do either one massive loop of the continent or hop on and off for different stages of the trip. \nHe added next year’s programme will feature the 12-day Treasures of the Incas Luxury Gold escorted trip which leads in at £5,550pp and includes five-star accommodation, flights and all but a few meals. \nBoulding added the operator was also focusing on promoting to the trade its Luxury Gold by Insight Vacations, which seeks to offer the very best in escorted touring. \nThe brand includes private airport transfers both at the beginning and the end of a trip while the trips themselves are all-inclusive with accommodation in hand-picked hotels including the Roosevelt Hotel in New Orleans, the Royal Hawaiian and the Towers of the Waldorf-Astoria in New York. \nBoulding said: “It is about attention to detail and getting it right first time, every time.”", "external_links": [], "published": "2015-07-03T11:39:00.000+03:00", "crawled": "2015-07-03T13:00:32.000+03:00", "highlightTitle": ""}