{"organizations": [], "uuid": "8943d6a86fb3f2752743c3fda6e13eba929c261b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/WashingtonPost/Production/Libraries/Common/StandingArt/Comics/2015-07-30/HAX150730.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel: Travel News, Guides, Deals, Hotels, Vacation Ideas &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/style/carolyn-hax-brothers-affair-with-her-bff-puts-her-in-an-awkward-situation/2015/07/29/bbb760bc-2a59-11e5-a5ea-cf74396e59ec_story.html", "country": "US", "title": "Carolyn Hax: Brother’s affair with BFF puts sibling in an awkward situation", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Carolyn Hax: Brother’s affair with BFF puts sibling in an awkward situation - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "8943d6a86fb3f2752743c3fda6e13eba929c261b"}, "author": "By Carolyn Hax", "url": "http://www.washingtonpost.com/lifestyle/style/carolyn-hax-brothers-affair-with-her-bff-puts-her-in-an-awkward-situation/2015/07/29/bbb760bc-2a59-11e5-a5ea-cf74396e59ec_story.html", "ord_in_thread": 0, "title": "Carolyn Hax: Brother’s affair with BFF puts sibling in an awkward situation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Nick Galifianakis/For The Washington Post) By Carolyn Hax Columnist July 29 at 11:59 PM Follow @carolynhax Adapted from a recent online discussion.\nCarolyn Hax started her advice column in 1997, after five years as a copy editor and news editor in Style and none as a therapist. The column includes cartoons by \"relationship cartoonist\" Nick Galifianakis -- Carolyn's ex-husband -- and appears in over 200 newspapers. View Archive Facebook Google+ RSS Dear Carolyn: I have never liked my sister-in-law — we disagree on everything from abortion to zoos. However, I love my brother dearly, so I sucked it up and smiled and nodded.\nNow my brother is dating my best friend, who is the perfect addition to the family. Only problem is? He is still married to sister-in-law.\nI think it is a glass-bowl move (my sister-in-law isn’t a bad person, she just has grating views) and told him so — but what do I do now? Should I tell my sister-in-law?\nSome days I feel like I owe it to her to tell her; other days I wonder if I am just trying to speed up the breakup of her and my brother. I don’t want to fall out with my brother and best friend, but I don’t think my sister-in-law deserves to be treated like this either. I could do nothing (please tell me that is an option!), but it feels like cowardice.\nTorn\nYou can have your ulterior motive and your moral obligation, too!\n“I’d love to see you with Best Friend, and it’s your life, but you’re putting me in a terrible spot with [sister-in-law], please deal with that, thank you.” Repeat until resolved. You can also point out to your friend the awkward position you’re in.\nIn between opportunities to say this, yes, you get to do nothing. You are way too biased, and therefore compromised, to get involved.\nDear Carolyn: I knew it was coming , but I am still so angry that it happened: I had our first baby five weeks ago, and a very close friend has not yet acknowledged the happy event. She is like this. She cannot handle others’ happy life events (she said something horrible to me about my dress right before my wedding ceremony), so this was not entirely unexpected. But the sheer fact that she did it still causes me brief moments of total rage and sadness, and I am having trouble dealing with the fact that she’s doing this. I accept the friendship is over (she also cut off her best friend when she got pregnant), but how do I deal with these feelings?\nAnonymous\nYour heart told you she was a close friend, but your head knew all along there could be no such intimacy with someone that emotionally stunted. It’s sad, yes, and aggravating, yes, but rage? Are you angry at her or at yourself for wanting more from her? Please ask yourself why you thought 2 + 2 would equal 5 this time.\nI’ve got nothing invested here, so I can feel sorry for her. With time and distance, I hope you also come to see that she’s living a life so tightly boxed in by her own hang-ups that the only way she can bear having friends is if she is able to imagine they’re as unhappy as she is or more. Wow indeed. I hope her remaining friends urge her to get some help.\nRe: Friend: That parable that ends with “you knew I was a snake when you picked me up” might be a good mantra for you. It should not have come as a surprise. Apply this to the “rage and sadness” whenever they arise.\nAnonymous 2\nWrite to Carolyn Hax , Style, 1150 15th St. NW, Washington, D.C. 20071, or tellme@washpost.com . Get her column delivered to your inbox each morning at http://bit.ly/haxpost .", "external_links": ["https://plus.google.com/114762318959773115236/", "https://www.facebook.com/carolynhax", "https://twitter.com/@carolynhax", "http://bit.ly/haxpost"], "published": "2015-07-29T03:00:00.000+03:00", "crawled": "2015-07-30T08:54:04.140+03:00", "highlightTitle": ""}