{"organizations": [], "uuid": "d7f5216d678c6a807a3fe8ad39dcd05c4e01269d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61033/cunard-celebrates-175th-anniversary-halifax-july-10", "country": "US", "title": "Cunard celebrates 175th anniversary in Halifax on July 10", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Cunard celebrates 175th anniversary in Halifax on July 10", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T02:45:00.000+03:00", "replies_count": 0, "uuid": "d7f5216d678c6a807a3fe8ad39dcd05c4e01269d"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61033/cunard-celebrates-175th-anniversary-halifax-july-10", "ord_in_thread": 0, "title": "Cunard celebrates 175th anniversary in Halifax on July 10", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE LIST: 5 Star Rated by eTN Readers - and not for sale! Hotels - Airlines - CVBs - Destinations - people Cunard celebrates 175th anniversary in Halifax on July 10 Adv: Queen Mary 2 Adv: \nSOUTHAMPTON, England - Cunard will celebrate 175 years of history, tradition, and industrial achievement in Halifax, Nova Scotia, on 10 July 2015 when Queen Mary 2 calls on the ancestral home of its founder Sir Samuel Cunard. This commemorative Transatlantic Crossing will pay tribute to the original voyage made by the company's first flagship, Britannia, in 1840. The flagship vessel is scheduled to arrive in port at 6:00 a.m. A.D.T. \nCunard will mark the milestone anniversary with a series of commemorative events, beginning with a special outdoor ceremony on the Halifax waterfront. Local dignitaries, port officials, and key members of the Halifax community will be in attendance as a part of the new public space of the future waterfront development will be named in honour of Cunard. \nThe ceremony will take place on the site of an upcoming mixed use development led by Southwest Properties and in collaboration with Waterfront Development. Nova Scotia's popular Rhapsody Quintet will perform during the event. \nCunard has also joined forces with the Canadian Maritime Heritage Foundation and the Maritime Museum of the Atlantic to create the first Samuel Cunard Prize for Vision, Courage and Creativity. The prize will be given each year to an extraordinary individual who has demonstrated the qualities exemplified by Samuel Cunard throughout his life. \nCunard, together with its partners, will award the first Samuel Cunard Prize to James D. Irving, whose family enterprise has been growing business in Canada and the U.S. for more than 130 years. Working with his brother Robert and his father, J.K. Irving, the family's visionary leadership has transformed the company into a world class performer in various industries, including ship building. Irving Shipbuilding Inc. in Halifax is engaged in reinventing and revitalizing a traditional industry in ways that promise to transform the economic prospects of the region. \n\"We look forward to honouring Sir Samuel Cunard in his birthplace of Halifax, and to celebrating the company's first North American port of call,\" said Richard Meadows, president, Cunard, North America. \"Cunard is honoured to be one of the few companies who can claim a 175-year history and Halifax plays an instrumental role in that story,\" he continued. \nAs part of the celebration, the Maritime Museum of the Atlantic will re-open the Cunard portion of their Age of Steam exhibition and launch a new Samuel Cunard retrospective exhibit that will showcase the founder's impact on global business, transportation and world events. \nThe exhibit, Cunard 175: Engine for Change is the Maritime Museum of the Atlantic's celebration of Sir Samuel Cunard's vision and achievement in revolutionizing maritime travel and global communications. His drive to create an \"ocean railway\" - with comfortable, technologically advanced ships making established oceanic passages – is continued by Cunard today. The museum will be opening the exhibit on 10 July when the guests of Queen Mary 2 arrive, and at 5:00 p.m. A.D.T, the museum will be open for free for the exhibit opening reception. \nUpon departure, the Royal Canadian Navy will salute Queen Mary 2 from the Frigate HMCS Montreal as Royal Canadian Sea Cadets fire salute from the shore. The cadets are ages 12-18 and are part of a youth organization co-sponsored by the Canadian Armed Forces and the civilian Navy League of Canada. \nQueen Mary 2 will depart the berth at 8:00 p.m. A.D.T. and then conduct a counter clockwise tour of the harbour. Upon leaving the berth Queen Mary 2 will proceed in a north easterly direction leaving Georges Island to starboard as she continues on a course that will take her approximately mid harbour and directly opposite HMC Dockyard (this is also the site of the original Cunard Wharves where RMS Britannia berthed). Here she will turn to port and fall into line with the escort vessels. The convoy order will be: \n1. Theodore Tugboat 2. Tugboat Atlantic Oak (with water canons) 3. Queen Mary 2 4. HMCS Montreal \nThe procession will then proceed in a southerly direction close to the Halifax Boardwalk / Waterfront, providing ample opportunity for the public to view this ceremonial conclusion to Halifax's celebration of Cunard Line's 175th Anniversary. \nA naval artillery salute will take place shoreside from the wharf of the Maritime Museum of the Atlantic where music will be provided by the Stadacona Band. Queen Mary 2 and escort vessels will continue moving slowly southward along the Halifax sea wall and leaving Georges Island to port. \nUpon passing Pier 21 the flotilla will be joined by yachts and other pleasure craft from the Royal Nova Scotia Yacht Squadron and other yacht clubs. \nQueen Mary 2 will then continue on her commemorative Crossing sailing down to Boston and New York, with special events scheduled for each port of call.", "external_links": [], "published": "2015-07-04T02:45:00.000+03:00", "crawled": "2015-07-04T07:14:05.000+03:00", "highlightTitle": ""}