{"organizations": [], "uuid": "ff72dd326bc1f8ce082e793b091888749e457eca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rocketnews.com", "main_image": "", "site_section": "http://www.rocketnews.com/category/travel/feed/", "section_title": "» Travel", "url": "http://www.rocketnews.com/2015/07/vacationing-with-the-stars-celebrity-caribbean-vacations/", "country": "US", "title": "Vacationing with the stars: Celebrity Caribbean vacations", "performance_score": 0, "site": "rocketnews.com", "participants_count": 1, "title_full": "Vacationing with the stars: Celebrity Caribbean vacations", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T08:02:00.000+03:00", "replies_count": 0, "uuid": "ff72dd326bc1f8ce082e793b091888749e457eca"}, "author": "Editor", "url": "http://www.rocketnews.com/2015/07/vacationing-with-the-stars-celebrity-caribbean-vacations/", "ord_in_thread": 0, "title": "Vacationing with the stars: Celebrity Caribbean vacations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted on July 15, 2015 by Editor \nCelebrities have been vacationing in the Caribbean for decade upon decade. Jamaica’s Port Antonio was one of the original hotspots back in the 1930s, with classic heroes like Errol Flynn sailing down in his yacht for some down time far from the prying eyes of the press. Over the years, a variety of islands have enjoyed favor with the famous and celebrated, including Bermuda, The Dominican Republic, Mustique, Anguilla, and Cuba during its heyday during the 1950s, before the Cuban Revolution. \nSome bright stars on a Caribbean vacation do their best to blend in and attract as little notice as possible, while others broadcast every move on Instagram and Pinterest, squeezing out the maximum amount of public relations juice from their holiday. \nResorts hosting celebrities are often in a quandary. They’d love to get on the horn and let the world know that an Iggy Azalea or a Bradley Cooper was a recent guest, but out of respect for a celeb’s privacy they know they have to keep this information under wraps, especially if they want the word to spread to other famous people that their resort provides a down-low location to vacation. \nDon’t expect to see the world’s most famous celebrities at the popular mega resorts in the Caribbean. Most gravitate toward private villas and smaller, high-style and exclusive resorts. Travel Agent 007: Experience James Bond’s Caribbean \nThe privately-owned island of Mustique in the St Vincent and Grenadines group is ultra-exclusive. Mustique, which is only about two square miles, sets the bar high when it comes to separating the famous from the commoners – literally, in fact, since Mustique is a favorite with Britain’s Royal Family, including Kate Middleton and Prince Henry. In addition to private villas, there are only two small hotels on the island; the 17-suite Cotton House and five-room Firefly. The high price tag of a Mustique vacation keeps out the autograph seekers, and tight security puts the kibosh on would-be paparazzi. Those who have flown into Mustique like exotic birds of paradise include the late Amy Winehouse, David Bowie, Kate Moss and Mick Jagger. \nSt Barts in the French West Indies is just a tad less exclusive than Mustique, and is famous for attracting celebrities, who relish the island’s appealing Gallic-inflected culture, superb beaches, romantic restaurants and pocket-size resorts/ St. Barts attracts heavy hitters like Bruce Willis, Lindsay Lohan, Ivanka Trump and Uma Thurman. Consider yourself lucky if you spy one of these famous visitors – most opt to stay tucked away in private villas. \nThe island of Anguilla is a favorite of Jay-Z and Beyoncé, and reports have the couple returning time and again. Anguilla has a natural reserve about it – there are no mega resorts or huge attractions. Instead, it’s a Caribbean jewel with secluded beaches, posh villa-style resorts and a great dining scene at restaurants sprinkled across the island. Sandra Bullock, Richard Gere, and Jennifer Aniston have been visitors. Miranda Kerr and Orlando Bloom honeymooned on the island before their short-lived marriage went up in smoke. Princess Charlotte’s official royal Christening photos are here \nOver on the Mexican side of the Caribbean the luxury Viceroy Riviera Maya attracts its share of celebrities. While some celebrities make a point of staying anonymous, there are a handful of recent guests who are happy to let the world know they stayed at the Viceroy Riviera Maya, including Selma Hayak, Jamie King and Molly Sims. \nSome celebs were actually born in the Caribbean, such as the singer Rihanna, who has become something of a poster girl for her home island of Barbados, where’s she’s often photographed on the beach in one skimpy bathing suit after another. \nThe Bahamas has always been a glamorous destination, especially Harbour Island on Eleuthera. Famous visitors include Mariah Carey, Lenny Kravitz, and Cameron Diaz, who reportedly rented out every room in a resort for a friend’s over-the-top bachelorette party. \nSome islands are famous for treating celebrities like just plain folks. Tiny Montserrat became a favorite destination for Sir Paul McCartney, since the former Beatle could zip around in his jeep and mingle with islanders, without being constantly reminded how famous he was. Diana Ross, Shakira and Sting were guests at Coco Reef Resort Spa in Tobago – an island known for its great birdwatching and laidback atmosphere. \nSome celebrities fall in love with an island and decide to build or buy a home there, such as Eric Clapton in Antigua, Keith Richards in Jamaica, Michael Douglas, and Catherine Zeta Jones in Bermuda, or Denzel Washington in Anguilla.", "external_links": [], "published": "2015-07-15T08:02:00.000+03:00", "crawled": "2015-07-15T08:50:39.000+03:00", "highlightTitle": ""}