{"organizations": [], "uuid": "71e208df4c1d92b5f612761f3abb689796d62c20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content4.video.news.com.au/foxsports/prod/archive/2015/07/19/DVU_190715_AFL_ANZ_BOLTS_ON_ROUGHEAD.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/travel/holiday-ideas", "section_title": "Holiday Ideas | Travel Tips and Holiday Ideas | The Advertiser", "url": "http://www.adelaidenow.com.au/sport/afl/afl-media-watch-luke-darcys-melanoma-gag-falls-flat-bill-brownless-epic-geography-fail-plus-best-afl-commentary-gems/story-fnia3v71-1227449439456", "country": "US", "title": "AFL media watch: Luke Darcy’s melanoma gag falls flat, Bill Brownless epic geography fail plus best AFL commentary gems |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "AFL media watch: Luke Darcy’s melanoma gag falls flat, Bill Brownless epic geography fail plus best AFL commentary gems | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T00:15:00.000+03:00", "replies_count": 0, "uuid": "71e208df4c1d92b5f612761f3abb689796d62c20"}, "author": "", "url": "http://www.adelaidenow.com.au/sport/afl/afl-media-watch-luke-darcys-melanoma-gag-falls-flat-bill-brownless-epic-geography-fail-plus-best-afl-commentary-gems/story-fnia3v71-1227449439456", "ord_in_thread": 0, "title": "AFL media watch: Luke Darcy’s melanoma gag falls flat, Bill Brownless epic geography fail plus best AFL commentary gems |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT’S a generally accepted rule that cancer is not a laughing matter.\nBut Luke Darcy decided to have a friendly dig at Hawk Jarryd Roughead who had a melanoma removed from his lip following a skin cancer scare — and it didn’t go down well with viewers.\nSCROLL DOWN TO SEE BILL BROWNLESS’S HILARIOUS GEOGRAPHY FAIL, WHY A RADIO CALLER HAD TO QUIT AT THREE-QUARTER TIME PLUS THIS WEEK’S BEST COMMENTARY GEMS\nRoughead played with tape protecting the scar from his successful surgery and booted five goals in Hawthorn’s big win.\nInterviewing the Hawthorn star in the rooms after the game, Channel 7 pair Darcy and Matthew Richardson joked about what he was allowed to eat.\n“I’ll have everything — I’ve earnt it!” Roughead said. “I can open my mouth, I just can’t smile.”\nSensing the lighter mood, Darcy ribbed the big Hawk: “Richo made comment in our pre-game show that you got engaged at an opportune time, you locked Sarah away before because, let’s be honest, it’s not a great look Rough, it’s not enhancing the look.”\nRoughead took on what we think was a mock serious tone, answering: “Not even the boys have had a crack and you’re the first one to have a go at me so that’s pretty harsh, mate. I’m not happy with that.”\nThe interview ended on a friendly note, but viewers were quick to take to social media to voice their opinion.\nLuke Darcy, are you serious? Teasing @jr3502 about his scar? #poorform #cheapshot #AFLSwansHawks\n— tish (@oztish) July 18, 2015\n@7AFL Oh Luke Darcy seriously making comments about Roughheads look? He just had a malignant cancerous cell removed! #wakeup\n— Sarah. (@scollins131) July 18, 2015\nLuke Darcy, you think your comments about Roughie's looks are funny I hope you never have to go through a cancer scare\n— Craig Simpkins (@craigoblog) July 18, 2015 BILLY’S EPIC GEOGRAPHY FAIL\nFormer Cat Bill Brownless is passionate about his home town Geelong, but if he plans to travel much further he needs to go back to school for some extra geography classes.\nBrownless left Bulldogs midfielder Koby Stevens speechless during an interview on Triple M after Stevens talked about the tough “road trip” to Simonds Stadium.\nBrownless quickly protested that “it’s not that far”. After Stevens replied “it’s an hour, it’s far enough”, Brownless erupted, and somehow turned a tasty Avacado-based dip into a South American country in the process.\n“Fair dinkum, everyone thinks it’s Guacamalia!” he cried. “Even Brownyn Bishop has to get a bloody chopper, it is 45 minutes from the West Gate.”\nLISTEN TO BILL’S BIZARRE MOMENT BELOW\nNO COMMENT ON BOLTGATE\nHawthorn and Sydney players faced an extra hazard when bolts were left exposed inside the ANZ Stadium fence on Saturday night , and Channel 7’s Cameron Ling had his own issues trying to report the issue in the form of a less than co-operative ground attendant.\nAs Ling revealed the bolts for viewers, the attendant arrived and dumped a mat on top of them, grumpily standing between Ling and the camera — watch the incident in the video player above.\n“He wasn’t rapt with me talking about his bolts but I wasn’t going to move in a hurry because bad luck to him,” Ling said the next day on 3AW.\n“I actually wish now if I had my time again I would have asked him a question — while you’re over here, can you tell us why these bolts are on the ground?”\nLing’s Seven colleague Brian Taylor was less forgiving talking about the incident on Triple M.\n“Not even an ‘excuse me’. Do they think we’re stupid? We’ve already seen it, what’s the point? I thought their irrational behaviour at ANZ Stadium was really ordinary.”\nCOMMENTATOR SUBBED OUT\nThere were some bad injuries on the field in Round 16 and an unusual one off it when SEN caller Matt Granland had to pull out of North Melbourne’s win against Essendon with a quarter to go.\nGranland had an injury you just can’t carry in radio land — he lost his voice.\n“He’s done what we call in the game ‘dogged it’,” colleague Dermott Brereton joked.\nUnfortunately, Granland’s early exit robbed us of an AFL version of race caller Jimmy Jacques’ famous (on the internet, anyway) call from Globe Derby Park, South Australia in 2010 — which we present below for your enjoyment.\nHarness racing caller loses his voice\nSPECIAL COMMENTS\nBruce McAvaney — questioning Cale Hooker’s decision making after he played on after intercepting a pass 45m from goal on Friday night:\n“What are you doing Cale? ... I’m kicking a goal, that’s what I’m doing, Bruce!”\nDavid Schwarz — marvelling at the Nic Naitanui-Luke Shuey combo on SEN on Saturday:\n“Natashuey is so damn good”\nSandy Roberts — clearly not a fan of a certain TV soap opera, as revealed when Mav Weller tried to milk a 50m penalty on Sunday:\n“He cops one and Cotchin says, ‘Hey, that’s Home and Away type acting.”\nEddie McGuire — not quite nailing a famous music reference after young Tiger Ben Lennon kicked his third goal:\n“Not even Lennon would have imagined that.”\nTim Lane — describing a big Brisbane Lions tackle on 3AW:\n“I thought Big Max was Gawn there.”\nGarry Lyon — providing expert analysis of the Kangaroos’ first half against Essendon:\n“North Melbourne are playing with their head up their bum”\nAROUND THE GROUNDS\nIt wasn’t all bad news for Luke Darcy in the Hawthorn rooms thanks to a thoughtful Brian Lake.\nYoung @BrianLake17 hand delivers dinner to the @7Sport boys. Hot and free = the ultimate #briansbargains pic.twitter.com/p1kqJJmWjH\n— Hawthorn FC (@HawthornFC) July 18, 2015 Does Anthony Hudson need to talk to Frontline’s Mike Moore for some tips about signing off?\nPure GOLD from Anthony Hudson pretending to do stuff while going to a break @FOXFOOTY pic.twitter.com/q0uzGFMOeb\n— Jarrod Walsh (@jarrodwalsh) July 18, 2015 And we enjoyed this blast from the past from the Magpies Twitter department, featuring some footy media heavyweights.\nYou’ve been one of us from way back, Quarters! RT @Quartermain10 Never thought I'd say this. But GO PIES! pic.twitter.com/N9LGMPS4lx\n— Collingwood FC (@CollingwoodFC) July 18, 2015 Our Brisbane correspondent Greg Davis needs to set his watch.\nSuns to announce Harley Bennell's fate at 3pm at Metricon Stadium presser. I'm here a little early. #thoughtitwas2pm pic.twitter.com/IH5O0eIPOd\n— Greg Davis (@GregDavis_cmail) July 16, 2015 Originally published as AFL media watch: Darcy’s melanoma gag falls flat", "external_links": ["https://twitter.com/BrianLake17", "https://twitter.com/scollins131/status/622385214854074368", "https://twitter.com/hashtag/AFLSwansHawks?src=hash", "https://twitter.com/Quartermain10", "https://twitter.com/craigoblog/status/622401627324985344", "https://twitter.com/oztish/status/622380732699152384", "https://twitter.com/hashtag/cheapshot?src=hash", "https://twitter.com/GregDavis_cmail/status/621533305893076992", "http://t.co/N9LGMPS4lx", "https://twitter.com/hashtag/wakeup?src=hash", "https://twitter.com/hashtag/briansbargains?src=hash", "https://twitter.com/CollingwoodFC/status/622306891230621696", "https://twitter.com/HawthornFC/status/622387823270690816", "http://t.co/IH5O0eIPOd", "https://twitter.com/hashtag/thoughtitwas2pm?src=hash", "https://twitter.com/hashtag/poorform?src=hash", "http://t.co/p1kqJJmWjH", "http://www.youtube.com/watch?v=hY6QlC3OKa4", "http://www.heraldsun.com.au/sport/afl/afl-media-watch-luke-darcys-melanoma-gag-falls-flat-bill-brownless-epic-geography-fail-plus-best-afl-commentary-gems/story-fni5f22o-1227449439456", "https://twitter.com/FOXFOOTY", "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/215480607&color=ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false", "https://twitter.com/7AFL", "https://twitter.com/jarrodwalsh/status/622355135906254848", "http://t.co/q0uzGFMOeb", "https://twitter.com/7Sport", "https://twitter.com/jr3502"], "published": "2015-07-21T00:15:00.000+03:00", "crawled": "2015-07-20T09:52:51.578+03:00", "highlightTitle": ""}