{"organizations": [], "uuid": "1765b3fe400221108cffb378df0f892983f4b8b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/Greece_debt_crisis_unlikely_to_affect_travel_plans_for_wealthy_Arabs-GN_01072015_020737/", "country": "AE", "title": "Greece debt crisis unlikely to affect travel plans for wealthy Arabs", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Greece debt crisis unlikely to affect travel plans for wealthy Arabs", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T08:34:00.000+03:00", "replies_count": 0, "uuid": "1765b3fe400221108cffb378df0f892983f4b8b0"}, "author": "", "url": "http://www.zawya.com/story/Greece_debt_crisis_unlikely_to_affect_travel_plans_for_wealthy_Arabs-GN_01072015_020737/", "ord_in_thread": 0, "title": "Greece debt crisis unlikely to affect travel plans for wealthy Arabs", "locations": ["Greece", "Thailand"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thailand launches Muslim-friendly tourist app \nWednesday, Jul 01, 2015 \nDubai: Greece’s debt crisis is not expected to affect travel plans for wealthy Arab holidaymakers this summer, according to some travel companies. \nGreece has shut banks until July 6 — a day after a bailout referendum — and imposed capital controls. It has limited ATM withdrawals to €60 (Dh244) per day. \n“Wealthy travellers will not shift travel plans this summer even if the destination is cheaper. They have the money,” said Kulwant Singh, managing director of Dubai-based Lama Tours. Similarly, Debbie Duncan-Studart, general manager of luxury travel company, Abercrombie and Kent in the UAE, said: “The debt crisis has certainly not deterred wealthy Arab travellers, and issues such as problems with ATMS really do not affect this market.”\nShe said that demand for holidays in Greece from affluent Arabs is consistent this summer compared with the same period last year. “A great deal of our bookings demand privacy and are therefore for boutique hotels and private villas which are normally situated in places of natural beauty so away from cities where unrest or strikes might occur.” However, Themos Papalas, chief executive officer of Holidays Shop, which operates chalets and hotel apartments, says that while demand from wealthy Arab travellers is the same as last summer, that could change in the next few days. “There could be a drop in the next few days because of the crisis in Greece,” he said.\nData \nTourism is one of the biggest industries in Greece. Travel and tourism’s direct contribution to the nation’s gross domestic product (GDP) touched €11.8 billion in 2014, which is expected to grow by 3.6 per cent to €12.3 billion in the current year, according to the World Travel and Tourism Council (WTTC). More than 22 million tourists visited the country last year. \nAccording to data from online travel agent Booking.com, hotel bookings from the Middle East to Greece have increased by 80 per cent between January 1 and June 20 from the same period in 2014. \nBy Sarah Algethami Staff Reporter \nGulf News 2015. All rights reserved. © Copyright Zawya. All Rights Reserved.", "external_links": [], "published": "2015-07-02T08:34:00.000+03:00", "crawled": "2015-07-02T08:51:13.000+03:00", "highlightTitle": ""}