{"organizations": [], "uuid": "352ecc5c861f0f61a1ed9fac44c85a9c408e364a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://img.huffingtonpost.com//asset/600_450/55b651d617000026005657a8.jpeg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/entry/puerto-rico-tourism_55b6519fe4b0224d8832cd9b", "country": "US", "title": "Puerto Rico Tourism Industry Lags Rivals, Offers Little Relief From Debt Crisis", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Puerto Rico Tourism Industry Lags Rivals, Offers Little Relief From Debt Crisis", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T18:48:00.000+03:00", "replies_count": 0, "uuid": "352ecc5c861f0f61a1ed9fac44c85a9c408e364a"}, "author": "Paige Lavender", "url": "http://www.huffingtonpost.com/entry/puerto-rico-tourism_55b6519fe4b0224d8832cd9b", "ord_in_thread": 0, "title": "Puerto Rico Tourism Industry Lags Rivals, Offers Little Relief From Debt Crisis", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Puerto Rico Tourism Industry Lags Rivals, Offers Little Relief From Debt Crisis By Jessica DiNapoli Posted: 07/27/2015 \nJuly 27 (Reuters) - Puerto Rico may sport palm trees, pristine beaches and glorious weather but its tourism industry is losing out to rival Caribbean islands - and that is holding the U.S. territory back at a time when its deeply troubled economy most needs a fillip. \nHoteliers blame a variety of issues for Puerto Rico lagging in both the growth of visitors and hotel rooms: mandatory staff perks, high construction and electricity costs, as well as plenty of red tape. \nAnd those problems may increase as the island's government and the agencies it controls are struggling with a massive debt burden that could lead to default as early as this week. There is a danger that tax increases and other measures prompted by the crisis could drive hotel costs higher, even though the government supports tourism through tax breaks and credits. \nRick Newman, who owns and operates the Verdanza Hotel in the popular beachside tourist strip of Isla Verde, says it is difficult to be competitive against rivals in the Caribbean, such as Cuba or the Dominican Republic, when labor costs in Puerto Rico are so much higher. \n\"They pay the person for the week what it costs me for the day,\" Newman said. \nThe U.S. federal minimum wage of $7.25 an hour applies to Puerto Rico, meaning that a worker doing a 40-hour week will get about $290. Workers at all-inclusive resorts in the Dominican Republic run by AMResorts are paid less than $60 a week, according to Gonzalo Del Peon, the company's president. In communist-ruled Cuba, average weekly wages are a lot lower - just $4 based on government documents provided by the United Nations - though in reality the figure may be a bit higher and Cuban workers get a lot of government benefits. \nThe number of tourists visiting Puerto Rico has barely budged from around 3.2 million reported almost 20 years ago, while both the Dominican Republic and Cuba have seen demand surge - more than doubling to 5.1 million and more than tripling to 3 million a year, respectively. Cuban tourist arrivals were up another 15 percent in the first quarter of this year. Reuters \nDel Peon said AMResorts chose not to invest in Puerto Rico four to five years ago after seeing weak potential for returns on investment because of the high costs and middling room rates. \nThe total cost to develop a room in Puerto Rico would run about 30 percent higher than the $200,000 to $250,000 AMResorts spends on average in other parts of the Caribbean, Del Peon said. And labor costs - judging by the financials from a resort the company runs in another territory with the U.S. minimum wage, St. Thomas in the U.S. Virgin Islands - can eat up 45 percent of revenue against 18-20 percent elsewhere in the region. \n\"The return on investment with additional operational costs is really challenging unless the market is willing to pay more,\" he said. \nEmployers are also obligated to pay workers in Puerto Rico perks such as mandatory Christmas bonuses up to a maximum of $600, while they are banned from asking them to work split shifts, important in hospitality when employees may only be needed during meal times, said labor attorney Radames Torruella of Puerto Rico-based McConnell Valdes. \nA report by former IMF economists released last month, which details the island's fiscal and economic problems, identifies labor regulations as a major obstacle blocking economic development. \n\"As of today, the tourism industry is estimated at around 6 percent of GDP,\" said Mari Jo Laborde, chief marketing officer for the Puerto Rican Tourism Company, a government-run tourism promotion agency. \"Our goal is to take that to at least 8 percent.\" \nBy comparison, tourism contributes 27 percent of Jamaica's GDP and 16 percent to the Dominican Republic, according to the World Travel & Tourism Council. \nHOTEL ROOMS STATIC \nIn the 1970s, Puerto Rico had about 9,000 hotel rooms, while Jamaica had about 6,600, and the Dominican Republic 1,600, according to a World Bank report. Today, the Dominican Republic has about 60,000 hotel rooms, and Jamaica has around 20,000, according to tourist board annual statistics, while Puerto Rico has only 15,000. \nPuerto Rico instead diversified its economy to focus on manufacturing, but that sector has struggled since U.S. federal tax incentives expired in 2006. \nThe Puerto Rico Tourism Company is seeking to fight back with a plan to add 5,000 hotel rooms by 2020, Laborde said. Officials also say that a marketing campaign launched in late 2013 - based on the description of Puerto Rico as \"The All-Star Island\" - showed some signs of success with an increase in tourism spending recorded since then. \nPuerto Rico's luxury hospitality sector has also recently attracted some investment. Newman is building a new Four Seasons resort, and a Ritz-Carlton Reserve opened recently. Hedge fund manager John Paulson has also been investing in opulent hotels . \nAnd one bright spot in tourism development has been Puerto Rico's pursuit of cruise ship visitors. Their numbers have been rising, reaching 1.5 million in the last fiscal year, up from 1.2 million in the previous year, said Ingrid Rivera Rocafort, executive director of the Puerto Rico Tourism Company. While they aren't as lucrative for the island as holiday makers who stay in a hotel, Rivera Rocafort says that once they get a taste for Puerto Rico they do return. Joe Raedle via Getty Images \nStill, it isn't only more cost-efficient competition from the Caribbean that Puerto Rico has to worry about. Electricity rates in Puerto Rico are among the highest in the U.S., putting the island at a disadvantage to a place like Florida, where they are much lower. That is largely because the government-controlled Puerto Rico Electric Power Authority is reliant on imported oil. \nWhen oil spikes, \"you basically operate in negative numbers,\" the hotel owner and operator Newman said, forcing him to cut costs, including staff, whose ranks have fallen to about 130 from 165 in the past five-to-six years. \nTo be sure, as the oil price has plunged in the past year, Newman has enjoyed a partial reprieve from punishing electricity bills, and he is using the extra cash to make upgrades at the Verdanza. \nBut he still faces other high charges - his water bill has climbed to about $20,000 a month. \nAnd while utility charges can also be high on other islands in the Caribbean, higher room rates elsewhere often compensate. In Puerto Rico, the average hotel room could be booked for $188.53 per night last year, while rooms in Aruba and Jamaica were $90 and $20 more, according to STR, a hotel research company. \nThe potential lift of the ban on most U.S. domestic travel to Cuba could hurt American tourism in Puerto Rico, which is currently the source for about 90 percent of visitors. The Caribbean Hotel & Tourism Association expects Americans will flood into Cuba, possibly bypassing the U.S. territory. \nAMResorts does not see enough happening to create attractive opportunities in Puerto Rico, Del Peon said. Without more investment in marketing and hotel improvements, \"it becomes this vicious cycle,\" he said. (Reporting by Jessica DiNapoli; Additional reporting by Dan Trotta in Havana; Editing by Megan Davies and Martin Howell)", "external_links": [], "published": "2015-07-27T18:48:00.000+03:00", "crawled": "2015-07-27T19:03:25.529+03:00", "highlightTitle": ""}