{"organizations": [], "uuid": "e95902aa7e3f328f4d5d13661931a673f40a287b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297724625414_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/travel/international", "section_title": "International | Travel | Toronto Sun", "url": "http://www.torontosun.com/2015/07/15/at-japans-weird-hotel-receptionists-porters-concierge-are-all-robots", "country": "CA", "title": "At Japan's Weird Hotel, receptionists, porters, concierge are all robots | Inter", "performance_score": 0, "site": "torontosun.com", "participants_count": 2, "title_full": "At Japan's Weird Hotel, receptionists, porters, concierge are all robots | Inter", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T22:30:00.000+03:00", "replies_count": 1, "uuid": "91f62d2635d6fcc6bfb2c62c297d2caf18c48be1"}, "author": "Yuri Kageyama, THE ASSOCIATED PRESS", "url": "http://www.torontosun.com/2015/07/15/at-japans-weird-hotel-receptionists-porters-concierge-are-all-robots#post-0", "ord_in_thread": 0, "title": "At Japan's Weird Hotel, receptionists, porters, concierge are all robots | Inter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SASEBO, Japan -- From the receptionist that does the check-in and check-out to the porter that's an automated trolley taking luggage up to the room, this hotel in southwestern Japan, aptly called Weird Hotel, is \"manned\" almost totally by robots to save labour costs.\nHideo Sawada, who runs the hotel as part of an amusement park, insists using robots is not a gimmick, but a serious effort to utilize technology and achieve efficiency.\nThe receptionist robot that speaks in English is a vicious-looking dinosaur, and the one that speaks Japanese is a female humanoid with blinking lashes. \"If you want to check in, push one,\" the dinosaur says. The visitor still has to punch a button on the desk, and type in information on a touch panel screen.\nHenn na Hotel, as it is called in Japanese, was shown to reporters Wednesday, complete with robot demonstrations, ahead of its opening to the public Friday.\nAnother feature of the hotel is the use of facial recognition technology, instead of the standard electronic keys, by registering the digital image of the guest's face during check-in.\nThe reason? Robots aren't good at finding keys, if people happen to lose them.\nA giant robotic arm, usually seen in manufacturing, is encased in glass quarters in the corner of the lobby. It lifts one of the boxes stacked into the wall and puts it out through a space in the glass, where a guest can place an item in it, to use as a locker.\nThe arm will put the box back into the wall, until the guest wants it again. The system is called \"robot cloak room.\"\nWill robots ever replace humans?\nWhy a simple coin locker won't do isn't the point.\n\"I wanted to highlight innovation,\" Sawada told reporters. \"I also wanted to do something about hotel prices going up.\"\nStaying at Henn na Hotel starts at 9,000 yen ($80), a bargain for Japan, where a stay in one of the nicer hotels can easily cost twice or three times that much.\nThe concierge is a doll-like hairless robot with voice recognition that prattles breakfast and event information. It cannot call a cab or do other errands.\nJapan is a world leader in robotics technology, and the government is trumpeting robotics as a pillar of its growth strategy. Robots have long been used here in manufacturing. But interest is also high in exploring the potential of robots in human interaction, including helping care for the elderly.\nRobotics is also key in the decommissioning of the three reactors in Fukushima, northern Japan, which went into meltdowns in 2011, in the worst nuclear catastrophe since Chornobyl.\nOne area Henn na Hotel still relies on human beings is security.\nThe place is dotted with security cameras, and real people are watching everything through a monitor to make sure guests stay safe and no one makes off with one of the expensive robots.\n\"And they still can't make beds,\" said Sawada, who has also engineered the rise of a popular affordable Japanese travel agency.\nHe has big ambitions for his robot hotel concept and wants to open another one soon in Japan, and later abroad. He is also eager to add other languages, such as Chinese and Korean, to the robots' vocabulary.\nA block-shaped robot that was scuttling around in the lobby had been brought in to do room service, delivering beverages and simple snacks. But it wasn't ready to do that yet.\nOutdoors, Sawada also demonstrated a drone that flew in to deliver a few small jars filled with snacks. He said he wanted to eventually have drones perform in shows for guests.\nIn the hotel's rooms, a lamp-size robot in the shape of a fat pink tulip called Tuly answers simple questions like, \"What time is it?\" and \"What is the weather tomorrow?\"\nYou can also tell it to turn the room lights on or off. There are no switches on the walls.\nSawada is keeping the hotel half-filled for the first few weeks to make sure nothing goes wrong.\nHe also cancelled at the last minute the overnight stay planned for media. The robots simply weren't ready.", "external_links": ["http://static.polldaddy.com/p/6326417.js", "http://polldaddy.com/poll/6326417/"], "published": "2015-07-15T22:30:00.000+03:00", "crawled": "2015-07-15T21:35:15.000+03:00", "highlightTitle": ""}