{"organizations": [], "uuid": "625c994e7b5137de0aca56ee51db0079c1f858aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/5438671/southwest-new-paint-3*1200xx3060-1721-0-238.jpg", "site_section": "http://memphis.bizjournals.com/rss/feed/vertical_subtopic/62", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/phoenix/news/2015/07/24/sources-say-southwest-flight-attendants-reject.html", "country": "US", "title": "Sources say Southwest flight attendants reject contract, send loud message to management", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "Sources say Southwest flight attendants reject contract, send loud message to management", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T23:20:00.000+03:00", "replies_count": 0, "uuid": "625c994e7b5137de0aca56ee51db0079c1f858aa"}, "author": "Lewis Lazare", "url": "http://www.bizjournals.com/phoenix/news/2015/07/24/sources-say-southwest-flight-attendants-reject.html", "ord_in_thread": 0, "title": "Sources say Southwest flight attendants reject contract, send loud message to management", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jake Dean Southwest Airlines CEO Gary Kelly found out today what his thousands of rank and file… more Southwest Airlines CEO Gary Kelly now knows for sure what his flight attendants think of a tentative contract he wanted to get ratified. By an overwhelming majority, Southwest (NYSE: LUV) flight attendants look to have rejected a tentative new contract presented to them for ratification earlier this month. Online voting on the proposed contract ended at noon central time today across the Southwest system. Though official results won't be made public until 6 p.m. Central time Friday evening, unnamed sources report the final vote tally on the tentative contract is a whopping 9,916 \"no\" votes against the proposed contract to 1,446 \"yes\" votes in favor of ratification. That means 87 percent of the Southwest flight attendants did not like what they saw in the tentative contract. Southwest operates a hub at Phoenix Sky Harbor International Airport. Southwest Senior Vice President of Labor Relations Randy Babbitt said of the vote results: \"This agreement ensured that our flight attendants would stay atop the industry in pay and benefits. So naturally we're disappointed that it didn't pass.\" Mike Hafner , Southwest's vice president of cabin services, added in a statement: \"Together we will find a way to move forward.\" Southwest employs more than 13,500 flight attendants, and 11,362 voted. More than 1,800 Southwest F/As are based in Chicago. The vote results are not good news for Kelly, who had been hoping for a swift ratification of the contract. Kelly has been battling labor unrest for years among some of his largest and most important labor groups, including mechanics, ramp agents and pilots, in addition to flight attendants. But this tentative flight attendant contract spelled trouble for Kelly almost from the moment news of its existence first surfaced earlier this month. Many rank and file Southwest flight attendants, who belong to Transport Workers Union Local 556, said they were surprised to see a proposed new contract come to light so suddenly after two years of difficult negotiations. But once Southwest flight attendants were shown the full 219-page proposed contact several days after news of its existence first broke, the number of angry flight attendants appeared to grow exponentially. An expanded duty day and changed vacation rules were just two of the sore points in the contract for many rank-and-file F/As. Minimal pay raises also rankled many who believed they should share more generously in the record profits Southwest has been raking in in recent months. Southwest flight attendants represent the largest single unionized group employed at the low-fare behemoth. And as is well-known within the airline industry, flight attendants, more than any other worker group, are key to establishing an airline's image — for better or worse — because they interact the most with passengers. But many Southwest flight attendants who have spoken out the past couple of weeks blame Kelly to a large degree for their decision to vote down the proposed contract. They argue that a marked change for the worse in the Southwest culture fueled by Kelly in recent years only exacerbated their negative reaction to the proposed contract. Now, negotiations on a new tentative contract must start from scratch. Many Southwest flight attendants have said they will push for a shake-up in the Local 556 executive board and a new negotiating team before talks with Southwest management begin anew. Southwest management said late today it expects Transport Workers Union leadership to take some time to evaluate today's vote results prior to returning to the bargaining table. For now, Southwest flight attendants will continue to work under a contract that became amendable on May 31, 2013. \nWant Phoenix Travel   Industries", "external_links": [], "published": "2015-07-24T23:20:00.000+03:00", "crawled": "2015-07-24T23:55:52.917+03:00", "highlightTitle": ""}