{"organizations": [], "uuid": "0af0c54e1f5aea4c8031dd2399ceb78d9bed2901", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "honestcooking.com", "main_image": "http://honestcooking.com/wp-content/uploads/2015/07/Köksträdgård_foto-Asa-Dahlgren.jpg", "site_section": "http://honestcooking.com/category/culinary-travel/feed/", "section_title": "Honest Cooking » Culinary Travel", "url": "http://honestcooking.com/try-swedish-thursdays-gunnebo-time-travel/", "country": "US", "title": "Try Swedish Thursdays: Gunnebo Time Travel", "performance_score": 0, "site": "honestcooking.com", "participants_count": 1, "title_full": "Try Swedish Thursdays: Gunnebo Time Travel", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T16:00:00.000+03:00", "replies_count": 0, "uuid": "0af0c54e1f5aea4c8031dd2399ceb78d9bed2901"}, "author": "Honest Cooking", "url": "http://honestcooking.com/try-swedish-thursdays-gunnebo-time-travel/", "ord_in_thread": 0, "title": "Try Swedish Thursdays: Gunnebo Time Travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Testing Try Swedish Thursdays: Gunnebo Time Travel \nPARTNER POST — TrySwedish Thursdays is a culinary collaboration between TrySwedish, West Sweden, Gothenburg and Västerbottensost cheese. Discover the edible delights of the land. For a true farm-to-table experience amidst beautiful architectural history, visit the restored Gunnebo home in West Sweden. Being just twenty minutes south, by car, of Gothenburg, Sweden’s second largest city, it is an easy day adventure. By Maria Zihammou in SKAFFERI \nStaffan Johan \nIn the late 1700s, Gunnebo Slott och Trädgårdar ( Gunnebo House and Garden ) was once of the most modern and expensive summer houses of that period. The property was owned by the Hall family and designed by the architect Carl Willhelm Carlberg. Sadly, in the 1880s, due to a lack of investment and maintenance, it lost much of its elegance and style. In 1996, a unique restoration and reconstruction project was started, called ‘Gunnebo – back to the 18th century’, with the aim of restoring the buildings back to the architect’s original drawings. A transformation with clear environmental overtones. \nDuring the first phase of the work the old kitchen garden and elements of the formal garden and castle were redeveloped and the Conservatory was reconstructed. The Gunnebo Kaffehus och Krog (Gunnebo Café and Restaurant) is now housed in this building. The new vegetable gardens in front of the Conservatory were completed in 2008 and feature a typical 18th century collection of herbs and vegetables framed by fruit trees and bushes. \nAsa Dahlgren \nThe kitchen staff at Gunnebo harvest produce from these gardens to serve fresh to guests everyday. Gunnebo Kaffehus och Krog is A Taste of West Sweden accredited restaurant and has an organic certification from KRAV. The restaurant menu features organic produce and vegetables from Gunnebo’s own gardens. Just as in the 18th century, its ingredients change with the season. \nBefore Gunnebo Slott is completely restored to the time of the Hall family architect’s plans, some of the original buildings still have to be recreated. These are the orangery, the Hermitage and several smaller garden buildings around the Conservatory. Finally, some of the walks in the ‘English Park’ will be rebuilt. The ‘Orangery’ is a heated greenhouse where sensitive plants like orange, fig, myrtle and ornamental tropical plants can be kept for overwintering. Gunnebo’s own ambitious orangery reconstruction work is now in full swing. \n“When the heated greenhouse is rebuilt, visitors will have access to a small summer palace in miniature”, says Lena Vikström, CEO of Gunnebo House and Gardens. “In the Orangery, they will be able to enjoy the same plants that were here in the 1700s when the Hall family lived at Gunnebo all through the summer. \nThe entire reconstruction is an amazing adventure in time travel where we’re all learning as we go along. This will be a slow journey. That’s important. The process itself is fascinating — for us it is a respectful journey through time where reflection and consideration are the golden rules.” \nAsa Dahlgren \nPatrik Sewerin, chef at Gunnebo Slott och Trädgårdar, is a happy man. He’s looking over the kitchen counter at the first salad from the vegetable garden, which has just been freshly gathered. His position as a chef here is exciting because he works with produce which grows just a few meters from his kitchen. He’s able to pick form the best there is everyday — so much better than ordering ingredients from ten to hundreds of miles away. \nThere are vegetables in these gardens that are not only full of flavor, but come from fine heritage varieties. They’ve been selected to be representative of Gunnebo’s gardens back in the 18th century. Yet at the same time, Patrik likes to experiment with ingredients from other local artisan food suppliers to accompany his own fresh ingredients on the plate. “We very much like working with a few different local producers and buy vegetables that we can’t grow ourselves. We also buy Anna Kaijser’s goat cheeses from Halltorps Dairy.” says Patrik. \nIn 2014, Gunnebo Kaffehus och Krog was chosen as the ‘most sustainable café’ by the prestigious White Guide of Sweden. A seriously significant achievement in the food world. \n“We are extremely conscious about working sustainably, so it was extra special.” says Patrik. \nHe stands in the kitchen preparing some exciting new dishes for the menu. Previously he has concentrated on presenting inventive buffets but is now preparing his dishes to look as stunning on the plate as they taste. \n“A buffet can look fantastic when first prepared, but I want the food to look at its most appetizing when it’s served direct to the table. From now on we want to prepare the food on the plate to look irresistible, as well as giving our guests a complete taste of nature.” says Patrik. \nToday, beetroots are being prepared and baked to be served in a warm salad along with chickpeas, toasted almonds, and blue cheese. “There’s fresh tarragon in the dressing as that suits the beetroots particularly well.” comments Patrik. \nHe buys the salad’s cheese from another small producer a few kilometers outside Gothenburg — the Summer Hagens Dairy makes several kinds of cheese, from both goat and cow’s milk. \n“We always start with the herbs and vegetables. The last thing onto the plate is the meat. That’s our way of doing things. We think that sometimes too much importance is put on just the meat.” \n“We want to show that we can run a successful business that is not only thought highly of, but profitable as well. A simple carrot can be sumptuous, really sumptuous if you have grown the carrot yourself. There’s just so much more flavor then. And there may be even more subtle flavors coming through if the carrot is slow-grown.” adds Patrik. \nSuch a carrot’s flavor is intense, like just harvested lettuce. It makes Patrik happy to cook something so gastronomically interesting. \nAsa Dahlgren \n“This lettuce variety is exciting. It’s called Merlot — just look at the dark red leaves — they’re the color of the wine it’s named after. It’s these sorts of delicious bonuses that my job here gives me. Everyday I get to work with scrumptiously fresh vegetables. They’re the best of anywhere.” explains Patrik. \nPatrik focuses on the things that he believes are crucial. Those freshly harvested lettuce heads have to be grown sustainably and to the highest possible environmental standards. And it’s just as important to him to safeguard Gunnebo’s policies regarding the cultivation of old varieties when he serves the food to Gunnebo’s guests. \n“It’s more fun to do it this way. That’s the big difference here. I can turn up to work at Gunnebo and orchestrate something more than just a plate of food.” \nAnd there’s another way of getting his guests involved in the process, which is to let them roam around the gardens and pick out a basket of produce of their own choosing for the chefs to prepare. \n“That way we can create an interactive meal together in which the guest is intimately involved.” Says Patrik.", "external_links": [], "published": "2015-07-23T16:00:00.000+03:00", "crawled": "2015-07-23T21:44:20.362+03:00", "highlightTitle": ""}