{"organizations": [], "uuid": "474ed9d82da58054c3c54026e5431e2ad90f751e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/20150723/c1_631668_150723051142_620x413.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/in-thailand/631668/prepare-for-bans-aot-tells-airports", "country": "TH", "title": "Prepare for bans, AoT tells airports", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "Prepare for bans, AoT tells airports", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T23:29:00.000+03:00", "replies_count": 0, "uuid": "474ed9d82da58054c3c54026e5431e2ad90f751e"}, "author": "", "url": "http://www.bangkokpost.com/travel/in-thailand/631668/prepare-for-bans-aot-tells-airports", "ord_in_thread": 0, "title": "Prepare for bans, AoT tells airports", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Prepare for bans, AoT tells airports 23 Jul 2015 at 03:29 4,070 viewed 5 comments NEWSPAPER SECTION: NEWS | WRITER: AMORNRAT MAHITTHIROOK \nAirlines should be looking for parking places at U-tapao and elsewhere as safety inspections threaten to ground more and more Thai-registered aircraft. (Photo by Pattarapong Chatpattarasill) - + Prajin: No idea when DCA able to meet ICAO safety standards Airports of Thailand Plc (AoT) has asked several airport operators to reserve parking spots for aircraft in the event Thai-registered airlines are banned from flying to foreign countries. \nThe move comes after unfavourable audits on aviation safety standards by the United Nations and United States aviation agencies. \nThe AoT has urged major airport operators - the Department of Civil Aviation (DCA) which operates 28 provincial airports, the air force, and the navy which oversees U-Tapao airport in Rayong - to reserve parking areas in airport compounds in case foreign countries impose the ban, AoT chairman Nitinai Sirismatthakarn said after the AoT board meeting Wednesday. \nSome Thai-registered airlines earlier faced flight restrictions by Japan, South Korea and Indonesia, following an audit of Thailand's air operations by the UN-based International Civil Aviation Organisation (ICAO). \nIn June the agency raised a red flag over aviation safety standards and gave the country until November to tackle the issue. Meanwhile, the US Federal Aviation Administration (FAA) last Friday gave Thailand 65 days to address shortcomings it had found. \n\"We have to reserve areas for parking in preparation for the worst-case scenario in which planes will be banned,\" Mr Nitinai said. In such a case, there may be \"a large number of planes left on the ground\". \nAuthorities at U-Tapao airport in Rayong had told him it has 20 parking bays it can spare for banned planes. Mr Nitinai said airliners could also help solve the problem by changing flight routes to countries where their flights are still allowed. \nThe ICAO said Thailand fails to meet UN standards, including steps for granting air operator certificates. The FAA raised concerns about a shortage of DCA staff. Tell us what you think about this article Like dislike 61 people liked / 4 people disliked it Share this article", "external_links": [], "published": "2015-07-22T23:29:00.000+03:00", "crawled": "2015-07-23T11:43:15.677+03:00", "highlightTitle": ""}