{"organizations": [], "uuid": "f87b8c7243bbbad41bae90642936ca6ee5b973ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03366/TATA-27x8-0407_3366235a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/business-communication/11720813/innovate-evolve-in-digital-world.html", "country": "US", "title": "Innovate and evolve: staying ahead in the digital world", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Innovate and evolve: staying ahead in the digital world - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T18:52:00.000+03:00", "replies_count": 0, "uuid": "f87b8c7243bbbad41bae90642936ca6ee5b973ca"}, "author": "Oliver Pickup", "url": "http://www.telegraph.co.uk/sponsored/business/business-communication/11720813/innovate-evolve-in-digital-world.html", "ord_in_thread": 0, "title": "Innovate and evolve: staying ahead in the digital world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more on connecting your business » We are fast approaching a critical point in information technology: within five years every person on the planet will have internet access, according to industry forecasts. The prospect of a fully connected globe is both scary and thrilling. What problems and opportunities will such a scenario throw up? How best to harness such potential for the greater good? Singapore-based Vinod Kumar, managing director and chief executive of Tata Communications, is determined to tackle these questions – and is in prime position to do so. His company, part of the Indian-headquartered Tata group – which generated revenue of more than £65bn last year – may have only just celebrated its 13th birthday, yet it is striving to be in the vanguard of this brave new world. Tata Communications – whose slogan is “the new world of communications” – already provides the first round-the-world fibre-optic cable network, which allows businesses to reach 240 countries and territories. More mind-boggling numbers: 24pc of the world’s internet routes travel over the company’s networks, thanks to a £0.76bn matrix of both submarine (500,000 km) and terrestrial (210,000km) cables; and it carries 53bn minutes of wholesale voice traffic annually – the equivalent of one in 10 of every phone call. Within five years every person on the planet will have internet access But, as Mr Kumar acknowledges, the need to innovate and evolve has never been more keenly felt. “Tata Communications has been on an endless series of transformations,” the 50-year-old says. “The company has constantly shed and changed its skin. And today we are recognised as a global challenger in communications. But we see that as a limiting word; we believe the opportunity for communication providers is endless. “Designing that network for business traffic to be carried in a secure and predictable way has been the key aim of our strategy, [but] we are going beyond being a pipe provider, and actually diversifying into other industries and enabling the transformation of the business model.” An ongoing deal as the official connectivity provider and technology supplier for Formula 1 since 2012 has helped Tata Communications extend its reach far beyond its Indian roots; 77pc of the company’s revenue in 2013-14 was generated outside India. Mr Kumar continues: “F1 has been fantastic for us. We looked at it not just as a branding platform but as an ecosystem to be part of to test our technology. We wanted to be tested to the limit to prove that we should be on the global stage. Through that we have learnt a lot about technology.” Tata Communications provides the first round-the-world fibre-optic cable network, which allows businesses to reach 240 countries and territories Former F1 driver and now BBC commentator David Coulthard was invited by Mr Kumar to speak to 39 global forward-thinking chief executives at Tata Communications’ third annual Networked Enterprise Institute conference near London last month. He discussed the importance of teamwork, in racing and in business. “If one person hasn’t properly fitted a bolt to the car, I could be dead,” said Mr Coulthard. “Teamwork is what drives success. We win together; we lose together. And fundamentally F1 is all about connectivity between man and machine.” For Mr Kumar, teamwork and collective learning are fundamental to those wishing to line up at the start of the grid. “The industry is subject to huge disruptive technologies,” he says. “We all know about the internet of things, the growth of big data and the explosion of automated software development. Never before has there been a period when you have had so many macro trends influencing us.” Tata Communications is looking far and wide – and collaborating with like-minded partners – to best answer the future’s big questions. “It is unlikely that we will find solutions to these challenges on our own,” adds Mr Kumar. “Innovation happens at the intersection of diversity.” David Coulthard on innovation and technology How to use innovation to stay ahead of the competition \"Having great opportunities to compete comes from having smart people and smart systems working together. When I began F1, in 1995, pit stops were around six seconds. Now the world record is 1.9. You have to go beyond and work out opportunities to help improvement.” Importance of good leadership \"The teams I raced for – Williams, McLaren and Red Bull – all had great leadership; strong teams of people and companies collaborating which provided the ability to embrace technology and innovation. We love change in F1 because we are trying to gain an advantage over our rivals. In leading the team to success one has to communicate what is required.” Developing and retaining talent and teamwork \" My experience of winning is that it comes when the whole team is pulling together. If you win a Grand Prix, it is important to thank everyone, not just the team at the racetrack. Hundreds of other people don’t see the coalface, so recognising their contribution is important.” David Coulthard is one of the judges of Tata Communications’ F1 Connectivity Innovation Prize See how you can connect your business at tatacommunications.com", "external_links": [], "published": "2015-07-09T18:52:00.000+03:00", "crawled": "2015-07-09T20:41:27.000+03:00", "highlightTitle": ""}