{"organizations": [], "uuid": "60a753255d4a797a0f5c4b2b27c580955c1dcddd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww3.hdnux.com/photos/37/72/20/8365094/3/rawImage.jpg", "site_section": "http://www.seattlepi.com/lifestyle/travel/", "section_title": "Travel: Air, Land and Sea Guides and Resources - seattlepi.com", "url": "http://www.seattlepi.com/news/article/Scrapbooks-keep-tabs-on-lives-of-classmates-6406207.php", "country": "US", "title": "Scrapbooks keep tabs on lives of classmates", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Scrapbooks keep tabs on lives of classmates - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "60a753255d4a797a0f5c4b2b27c580955c1dcddd"}, "author": "LaRAYNE TOPP", "url": "http://www.seattlepi.com/news/article/Scrapbooks-keep-tabs-on-lives-of-classmates-6406207.php", "ord_in_thread": 0, "title": "Scrapbooks keep tabs on lives of classmates", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WISNER, Neb. (AP) — When Helen Frahm graduated from Wisner High School in 1955, she began to cut clippings from newspapers about her classmates.\nAs she married and so did her classmates, she began to collect that information on their families as well. One scrapbook led to another.\nFrahm's collection of scrapbooks was recently donated to the Wisner Heritage Museum — all 22 of them.\nGregg Moeller , president of the museum board of directors, was pleased to get them, the Norfolk Daily News ( http://bit.ly/1MmYpx1 ) reported.\n\"When I heard about them, I assumed there was a scrapbook,\" he said, not an entire collection.\nAs he began to look through them, \"it blew me away,\" he said to find his birth announcement and other clippings about his life and the lives of area friends whose parents graduated from Wisner High in 1955.\nFollowing graduation, Helen Frahm married Bennie Wilcox and the couple moved to Clearwater. They had a daughter who died in infancy in 1966.\nInstead of putting together scrapbooks about her own family, she turned to her classmates instead.\n\"The quietest of our class is the one who collected all the scrapbooks,\" said classmate Helen Blumer Moeller of Wisner.\nShe said clippings were taken from the local Wisner News-Chronicle and Norfolk Daily News. Sometimes a clipping on the front of a page had another clipping on the back Wilcox would have liked to include them both, Helen Moeller said.\nNot only are the birth announcements of classmates' children included, but also their school activities, sports write-ups and graduations. Handwritten pages includes dates of births, weddings and similar events. The scrapbooks even extend into the grandchildren of classmates, and letters Wilcox received from classmates are included.\nAn index helps readers find items, as the scrapbooks were created in chronological order. In addition, a section of one scrapbook is devoted to which of the classmates attended class reunions held every five years. The last of the entries was in 1995.\n\"It's a staggering amount of work,\" Gregg Moeller said.\nWhen Wilcox died 15 years ago, the additions to the scrapbooks ended but not their enjoyment. They ended up in the hands of Lonnie Dinslage of Elgin who continued to bring them to reunions.\nOn Memorial Day of 2015, Dinslage brought them to the 60th anniversary of the class' graduation, leading to discussion about finding a permanent location for the memorabilia.\nHelen Moeller suggested they be placed at the museum.\n\"The museum is an ideal place for them,\" Dinslage said. \"There's so much (information) in them.\"\nThe scrapbook collection is not the first to be on display at the museum. Others include a large array of city memorabilia collected by former city employee Rollie Johnson of Norfolk, plus family scrapbooks kept by Marge Holland of Albuquerque, New Mexico. Both are former Wisner residents.\n___\nInformation from: Norfolk Daily News, http://www.norfolkdailynews.com\nThis is an AP Member Exchange shared by the Norfolk Daily News", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://bit.ly/1MmYpx1", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-07-26T03:00:00.000+03:00", "crawled": "2015-07-27T02:29:49.952+03:00", "highlightTitle": ""}