{"organizations": [], "uuid": "a192f7f8b26e32755be128830a9215302f3f063c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/27938-dusitd2-to-launch-in-dabieshan-anhui-province", "country": "US", "title": "dusitD2 to launch in Dabieshan, Anhui Province", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "dusitD2 to launch in Dabieshan, Anhui Province", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T14:00:00.000+03:00", "replies_count": 0, "uuid": "a192f7f8b26e32755be128830a9215302f3f063c"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/27938-dusitd2-to-launch-in-dabieshan-anhui-province", "ord_in_thread": 0, "title": "dusitD2 to launch in Dabieshan, Anhui Province", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "dusitD2 to launch in Dabieshan, Anhui Province dusitD2 to launch in Dabieshan, Anhui Province Details Category: Hotel   12:00 Dusit Fudu Hotels and Resorts has announced the signing of a management agreement with Huoshan County Huachen Tourism Real Estate Development Co., Ltd. to manage an upscale, 300-room hot springs resort in Dabieshan, Anhui Province. Scheduled to open by the end of 2018, it will be the first internationally branded resort in Dabieshan. \nDabieshan, a major mountain range located in central China, is an ideal place for sightseeing. Famous for serene bamboo forests, tea plantations and the Dabieshan National Forest Park, visitors can enjoy spectacular vistas, especially from Heaven Valley, the range's highest peak. The dusitD2 Hot Springs Resort Dabieshan, Anhui offers 300 well-appointed guest rooms and villas, with private hot springs pools set against the tranquil landscape. The award-winning Devarana Spa, with its luxurious, Thai-inspired treatment rooms, promises to pamper guests with a full range of wellness programs. Additional recreational facilities include a gymnasium, indoor swimming pool, tennis court, kid's club/playground and an activity room. A spacious ballroom and several multi-functional rooms featuring the latest audio-visual facilities are also available for special events. Dining options at the resort range from an all-day dining restaurant to a specialty restaurant and a lobby lounge. The dusitD2 Hot Springs Resort Dabieshan, Anhui is located within the Dabieshan National Forest Park - International Tourism Zone. The area comprises a host of entertainment and recreation facilities, including natural hot springs, a golf course, a family adventure park, ski facilities, a marina and a commercial centre. It is approximately 2 hours by car from Hefei, the capital of Anhui Province, and a 40- minute drive from the Lu'an high-speed train station. \"To meet the increasing demand of new generation travellers looking for unique accommodations, Dusit Fudu Hotels and Resorts is proud to introduce the dynamic and colourful dusitD2 brand to Dabieshan,\" said Mr Lim Boon Kwee, President of Dusit Fudu Hotels and Resorts. \"The resort is a first-of-its-kind in the area, offering a distinctive combination of comfort, convenience, technology and warm gracious service that the Dusit brand is world-renowned for.\" Expressing his confidence in the management and hospitality expertise of Dusit Fudu Hotels and Resorts, Mr. Zhu Bin, Chairman of Huoshan County Huachen Tourism Real Estate Development Co., Ltd. adds, \"We are excited to partner with Dusit Fudu Hotels and Resorts on the development of this region and are confident that the dusitD2 Hot Springs Resort, Dabieshan will be an excellent addition to the area.\" Related articles", "external_links": [], "published": "2015-07-29T14:00:00.000+03:00", "crawled": "2015-07-29T14:05:24.480+03:00", "highlightTitle": ""}