{"organizations": [], "uuid": "d4e3ce649fd47cc3f1ebf1e4903fbd51cf116939", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/17/11/2A9EDCD300000578-0-image-a-93_1437130635485.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3165119/The-breathtaking-beauty-Britain-Spectacular-photos-country-s-amazing-summer-landscapes.html", "country": "GB", "title": "Britain's breathtaking beauty in spectacular photos of summer landscapes", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Britain's breathtaking beauty in spectacular photos of summer landscapes | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T19:45:00.000+03:00", "replies_count": 1, "uuid": "7376eaeeaa7ca92a4a500526b926e01b72c487ff"}, "author": "Katie Amey for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3165119/The-breathtaking-beauty-Britain-Spectacular-photos-country-s-amazing-summer-landscapes.html#post-0", "ord_in_thread": 0, "title": "Britain's breathtaking beauty in spectacular photos of summer landscapes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "34 shares 1\nView\ncomments\nThese photos of some of the most beautiful summer scenery across Britain will make holidaymakers want to ditch their holiday abroad for a staycation.\nJames Grant, a photographer based in the Peak District, captured 16 stunning views in a new photo series that acts as a love letter to Britain.\nHe lives just a short distance from the Peak District's border in the former spa town of Matlock, and has travelled the country to showcase the very best it has to offer.\nSixteen of the most beautiful British landscapes have been photographed by James Grant. Pictured: Winster Barn in Derbyshire\nRows of vibrant red poppies are snapped at sunrise by the talented landscape photographer, who also has a book of his work\nFairbrooke Naze is illuminated by a gorgeous red light in the country's Peak District, which is where Grant is based\nWindgather Light Rock, pictured, is located in Derbyshire and is a popular location among rock climbers\nNot just a talented landscape photographer however, James manages music and has a leading global sports management agency. His other captivating work can be seen in his book called Peak District Through a Lens.\nThese spectacular landscape pictures show the beauty of Britain's rolling hills and farmland, with some of the best shots taken at sunset and sunrise, and many in this collection were taken not far from his home.\n No hipsters and no pop music... but prepare to run for your... Holidaymaker accuses Thomas Cook of trying to 'short change'... A third of British holidaymakers targeted by thieves at... Rather than just the average blue skies, James has caught the vibrant mix of colours in the sky at different times of the day, and the beauty can be felt through the images.\nThese images have only been taken in the last three months, so the luck of having an early British summer has paid off with the intricate detailing in the cloud linings that James has managed to photograph.\nThe rolling hills of Littin Fields were photographed by James Grant, who also owns a global sports management agency\nSeveral small cottages and a two lane highway is visible in this unique image, captured by looking over the edge tree\nThe bright yellow rapeseed fields in Derbyshire can be seen for miles and appear shocking in front of a stately home (left)\nCotton grass and the Greenfield reservoir, which is located in Greater Manchester, are pictured in this summery shot\nRobin Hood's Stride (also known as Mock Beggar's Mansion) is a rock formation on the Limestone Way in Derbyshire\nA tilted tree and a crumbling old stone barn are pictured in this image, also shot in the Peak District\nTake a look at the breathtaking beauty of the Peak District more videos 1 2 3 4 Watch video The entire Magaluf strip unites to do the Toure dance!\nWatch video Man proposes to girlfriend with FLASH MOB choir at airport\nWatch video Edge of Stability: 70,000 awe-inspiring photos in one film\nWatch video The terrifying moment light aircraft lands on a highway\nWatch video All aboard! On the water in the world's first floating...\nWatch video Drunk canal leap goes horrible and hilariously wrong\nWatch video Could this be the greatest wedding toast of all time?\nWatch video Singer's hygiene pad falls from between her legs on live TV\nWatch video Violent road rage attack against motorcyclist escalates fast\nWatch video Amanda Holden overcome with emotion as she leaves This...\nWatch video Lily-Rose Depp revealed as new face of Chanel campaign\nWatch video Smoke billows from Egyptian Mediterranean patrol ship hit by...\nIn the early morning sun, Grant photographed Alport Height, a popular picnic hill near Wirksworth in Derbyshire\nBack Tor (pictured) is a rock formation that lies above the Upper Derwent Valley in the Peak District National Park\nIn the Peak District, bright yellow crops starkly contrast the crumbling Lodge Farm structure behind\nAs the sun sets, Grant photographed this breathtaking image of the light perfectly framed by the gap in the stone wall\nA favourite for Grant, the Robin Hood's Stride summit is pictured again in this shot overlooking the vast English countryside", "external_links": ["http://dailym.ai/1CL6FVb"], "published": "2015-07-17T19:45:00.000+03:00", "crawled": "2015-07-18T06:12:39.000+03:00", "highlightTitle": ""}