{"organizations": ["Hindustan Times"], "uuid": "3a8d366136a23fe1ac0ff1ae6152341d170440ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/7/47a6e519-fb17-49f1-b9a3-92f51a8dd575MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Fashion", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/fashion/how-to-wear-blue-jeans/article1-1369612.aspx", "country": "US", "title": "Can't live without your jeans? Here's how to up your denim game", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Can't live without your jeans? Here's how to up your denim game", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T17:35:00.000+03:00", "replies_count": 0, "uuid": "3a8d366136a23fe1ac0ff1ae6152341d170440ce"}, "author": "", "url": "http://www.hindustantimes.com/fashion/how-to-wear-blue-jeans/article1-1369612.aspx", "ord_in_thread": 0, "title": "Can't live without your jeans? Here's how to up your denim game", "locations": ["New Delhi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Deekshita Baruah"], "text": "Deekshita Baruah, Hindustan Times , New Delhi | Updated: Jul 16, 2015 19:57 IST Denims are big this season! Both luxury and high street brands are paying homage, rediscovering the traditional workwear fabric's potential and producing them in a myriad of washes. (Shutterstock photo) \nDenims have come a long way from being just the go-to thing to being the 'hottest' outfit this season. It might sound cliched if we tell you that they are beating the blues, but they really are! \nThere are a few fabrics you have fallen head over heels in love with, but isn't denim just incredible? Remarkably versatile and comfortable to wear, it is one of those rare materials that not only doesn't lose its appeal with repeated wear but also gets better with time. \n\"This season, both luxury and high street brands are paying homage, rediscovering the traditional workwear fabric's potential and producing them in a myriad of washes and finishes -- from raw indigo to washed-out tones, chambray topatchwork, rips to bleached,\" says fashion blogger Sarang Patil. \nIf you've already mastered the timeless and classic T-shirt and jeans combination, then here's a guide to up your denim game. \n*Go retro The retro look is back and how! If you are not scared to experiment then bring out those distressed denims and pair them with a suspender. \n(Photo courtesy: Myntra) \n\"Distressed denims, bright suspenders and a ditsy-printed shirt can create an old-school look that is charming in every way. Complete your look with simple black brogues and you are all set for that party,\" says Myntra LookGood Advisor. \n*Layer-it-up Layering and texturing can surprisingly be quite a complex skill to master. But we will tell you how to be a pro. \nGo for stone-washed denim, a printed shirt and derby shoes to give an illusion of texture. If this look is too simple for you then add a pop of colour with your pocket square. \nYou can also layer your faded floral T-shirt with a polka dot jacket. Matching your watch and shoes will just polish your look. \n*Get rolling Another way to wear your denim is to fold them and add style with a pair of good shoes. \n\"For a casual summer day, roll up those jeans and pair them with a linen shirt and leather sandals,\" says stylist Bhaavya Bhatnagar. \nAmit Singh, design head, SpykarLifestyles adds, \"You can also fold your jeans till your ankle and add either a contrasting pair of socks or shoes. It's easy to carry and good for a day of shopping or a comfort ride in the city.\" \n(Photo courtesy: Spykar) \n*Casual cool Inspired by the hip-hop culture in the West, A-line tees exude a casual, relaxed vibe. Pair your ripped denims and sneakers for that perfect laidback look. You can go for camouflage T-shirts too! \nIf you are a fan of the denim-with-shirt look then we have some advice for you too! \nAccording to stylists at American Swan, \"Pairing your blue denims with a formal linen shirt works very well. It gives you a look that's not too severe, nor is it too unceremonious.\" \n*Be rain-ready With the rain beating down hard, you can make your denims do the magic by teaming it up with either the classic white or a dash of colour. \nManjula Gandhi, general manager (planning and supply chain) at Numero Uno Clothing Ltd says, \"Pick a pair of aquamarine shaded denim and pair it with a superhero T-shirt for a casual monsoon Friday. Complete the look with loafers and you are rain ready.\" \nLight blue faded denim with a crisp white shirt is a classic and can be pulled off at any event and any season. \n(Photo courtesy: AFP, Spykar, AFP) \n\"There is no compromise to style when you have a pair of a stunning blue jeans and a plain white cotton shirt. Tuck it in or out depending on your mood. This look makes girls go bonkers,\" says American Swan stylist. \nAn Indo-western look with a kurta and a Nehru jacket with jeans also looks amazing. \n*Denim on denim Pairing denim with denim has been out of fashion for a while, but with the hipster trend taking the world by storm, this style is back with a bang. \n\"Pair light-coloured denim jeans with a dark-coloured denim shirt or vice-versa to take the edge off the monotone,\" suggest Jack & Jones' stylists. \nYou can also team this look with a pair of leather boots for a cowboy effect! Opt for those dark or chocolate brown boots. \n(Photo courtesy: Amlan Paliwal/IANS, HT photo/Parveen Kumar, IANS) \n*Be office ready For a semi-formal look, wear your denims with a T-shirt and a blazer. Soft pastels with linen blazers for the day and graphic tees and darker shades for the evening will do the trick. \nSpykarLifestyles' Singh says, \"Tonal blazers with a contrast T-shirt or shirt with blue jeans also looks good. This semi-formal look suit all body types and never goes out of style.\" \n*Dates, anyone? Pair up the combo of your favourite blue denims with an ironed sky blue shirt, leather loafers and a dark brown braided leather belt for an afternoon date. \n(Photo courtesy: Heisgotthestyle, AFP and Spykar) \n\"But if you are out on a dinner date then the best for you will be your favourite pair of denims, a striped black and white Henley T-shirt and a light coloured blazer. A complete showstopper,\" says Jack & Jones stylists. Tags", "external_links": [], "published": "2015-07-15T17:35:00.000+03:00", "crawled": "2015-07-17T01:50:36.000+03:00", "highlightTitle": ""}