{"organizations": [], "uuid": "c99f7fda41121b0be53885fa7c6589aecaa891e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/3302811/southwest-boeing-737*1200xx2034-1145-0-202.jpg", "site_section": "http://memphis.bizjournals.com/rss/feed/vertical_subtopic/62", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/chicago/news/2015/07/07/not-all-southwest-airlines-flight-attendants-are.html", "country": "US", "title": "Not all Southwest Airlines' flight attendants are smiling about news of tentative contract agreement", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "Not all Southwest Airlines' flight attendants are smiling about news of tentative contract agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T22:28:00.000+03:00", "replies_count": 0, "uuid": "c99f7fda41121b0be53885fa7c6589aecaa891e7"}, "author": "Lewis Lazare", "url": "http://www.bizjournals.com/chicago/news/2015/07/07/not-all-southwest-airlines-flight-attendants-are.html", "ord_in_thread": 0, "title": "Not all Southwest Airlines' flight attendants are smiling about news of tentative contract agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Not all Southwest Airlines' flight attendants are smiling about news of tentative contract agreement Jul 7, 2015, 2:28pm CDT Not so fast Gary Kelly . Southwest Airlines' controversial CEO Gary Kelly appears to have opened a huge hornets' nest in the wake of news about a tentative agreement on a new contract with more than 13,500 unionized flight attendants who work at the low-fare behemoth. With Southwest's largest hub at Chicago's Midway Airport, Chicago also is the domicile for the largest number of Southwest flight attendants, more than 1,800 altogether, according to a spokesman for Transport Workers Union Local 556 that represents Southwest flight attendants. Local 556's executive board, comprised of 17 members with varying degrees of seniority within the Southwest flight attendant ranks, voted by a margin of 12 to 5 in favor of the new contract, signaling the move to present the new contract to rank and file membership to consider and vote on starting Wednesday. But even before Local 556 members see the proposed contract, news of a tentative deal has exposed deep rifts within the Local 556 membership, as well as questions about the possible motives of the union's own executive board and of Southwest Airlines management, including Kelly. In an email to this reporter, one Southwest flight attendant who has clocked more than two decades with the airline, claimed \"some of this union leadership, as well as the negotiating team, have a long history of self-service, bullying and not always acting in the best interest of the flight attendants. Also there is a strong belief among flight attendants that this union is in bed with the company and that they will sell us out.\" Another flight attendant with more than a decade of work at Southwest offered a similar sentiment in an email: \"The (Local 556) union does appear to be too cozy with management.\" Though so-called \"educators\" have been used by Local 556 in the past to help members sort through and understand details of proposed contracts, some flight attendants questioned that procedure this time around, suggesting it could be another means of influencing— or pressuring — union members to vote in favor of a new contract. Noted one Southwest flight attendant: \"Our union handpicked 100 people to fly into Dallas for 'tentative agreement' training with our union dollars for two days so they could 'educate' the rest of us on the tentative agreement.\" Some flight attendants also wondered why Southwest management was suddenly able to come to tentative terms with flight attendants, while other major unions, including those representing pilots, ramp agents and mechanics, have been unable to get even a tentative deal. Ramp agents, in particular, have been in talks for some four years. Flight attendant contract negotiations had been ongoing for two years. The rank and file members of Local 556 will be able to get their first look at the full contract starting tomorrow. Then they will have 16 days to obtain the proposed contract, read it, digest it and then vote — a shorter time frame than the 30-day window for previous contracts, according to some flight attendants who wonder why this is all suddenly so rushed. A Local 556 spokesman said the contract would be ratified if a majority of those who actually vote cast a vote in favor of ratification. As for the vocal backlash among some rank and file union members to news of the tentative contract, a Local 556 spokesman noted: \"We are a large group and not everyone is going to see things the same way.\" By the end of July, however, it should be clear whether enough flight attendants see the proposed contract the same way Southwest Airlines management and Local 556's executive board apparently do. \nWant Chicago Travel news in your inbox? Sign up for our free email newsletters. Industries", "external_links": [], "published": "2015-07-07T22:28:00.000+03:00", "crawled": "2015-07-07T23:43:36.000+03:00", "highlightTitle": ""}