{"organizations": [], "uuid": "6b1d401cb33cf36dda3159fdc1c7b7f684765723", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/0/u/4/h/image.related.StuffLandscapeSixteenByNine.620x349.160th1.png/1437965794231.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/pacific-islands/70582069/Marquesas-Islands-The-remote-fabled-and-little-visited-islands-of-Tahiti", "country": "AU", "title": "Marquesas Islands: The remote, fabled and little-visited islands of Tahiti", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Marquesas Islands: The remote, fabled and little-visited islands of Tahiti", "spam_score": 0.0, "site_type": "news", "published": "2015-07-27T05:56:00.000+03:00", "replies_count": 0, "uuid": "6b1d401cb33cf36dda3159fdc1c7b7f684765723"}, "author": "Harriet Upjohn", "url": "http://www.stuff.co.nz/travel/destinations/pacific-islands/70582069/Marquesas-Islands-The-remote-fabled-and-little-visited-islands-of-Tahiti", "ord_in_thread": 0, "title": "Marquesas Islands: The remote, fabled and little-visited islands of Tahiti", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marquesas Islands: The remote, fabled and little-visited islands of Tahiti HARRIET UPJOHN Last updated 05:00, July 28 2015 Andoni Canela \nA tiki sculpture at Hiva Oa. \nWe have been slicing through the Pacific Ocean at a steady 15 knots for almost two days and a quick check of our coordinates confirms what my inner GPS is telling me. At 12ºS, 143ºW, we're about as close to the middle of nowhere as you can get. \nWe're thousands of kilometres from the nearest continent and our destination, a far-flung archipelago that you need a magnifying glass to find on a map, is still 24 hours away. \nI am pacing the deck, pausing every now and then to gaze into the inky depths, when a flash of silver catches my eye. We have company. Hundreds of flying fish are leaping beside the ship and stretching out their long, wing-like fins before skimming across the tops of the waves and disappearing. It is a welcome distraction; clearly I'm not the only one feeling like a fish out of water in this vast ocean. \nWe're heading for the Marquesas Islands at the north-eastern extremity of French Polynesia. Along with about 160 others, I have joined the Aranui 3 passenger-freighter on its regular supply voyage from Tahiti. It is a 3000-kilometre round trip the ship makes every three weeks. \nThere are other ways of getting to the Marquesas – some cruise ships call at a couple of the bigger islands or you can take a 3.5-hour flight from Tahiti (four of the islands have small airstrips) and stay in simple homestays or lodge-style accommodation. But for the last 30 years Aranui ships have been offering something a bit different – the chance to experience life on board a freighter while visiting all six of the Marquesas' inhabited islands. \nThe scent of the land: Taiohae Bay on Nuku Hiva. Photo: Darren Robb \nMade up of 12 ancient volcanoes, the islands have long captivated artists, writers, adventurers and explorers – Robert Louis Stevenson, Herman Melville and Paul Gauguin to name a few – and their striking jagged pinnacles give them a mystical allure. So it is with some anticipation that we gather on deck at sunrise to get our first glimpse of these fabled islands. \nThe soaring crags of Nuku Hiva, the largest of the islands, are bathed in an eerie pink light as we enter the bay formed from a volcanic crater at Taiohae, the capital. After days of salty sea air, we are enveloped by a warm breeze that carries with it a wonderfully fragrant scent. It is as the Scottish writer Robert Louis Stevenson described on his arrival here in 1888: \"The scent of the land and of a hundred fruits or flowers flowed forth to meet us.\" \nIn the distance are cathedral-like volcanic peaks, some crowned with garlands of misty, swirling cloud. Below these are wide buttresses that appear to be cloaked in soft folds of green velvet. Ad Feedback \nThree jet-black frigate birds herald our arrival, circling in wide arcs above us as we lean over the deck railing and watch people gathering on the dock beside a little fleet of forklifts and trucks. By the time we head down the gangway, the ship's yellow cranes have swung into action and everything from small trucks to refrigerated containers and bundles of building materials are being hoisted into the air and lowered onto the quay. It is a kaleidoscope of activity that will be repeated many times over the coming days. \nREAD MORE \n* Home alone in paradise \nAranui 3 at anchor off Takapoto in Tuamotu Archipelago en route to Marquesas Islands. Photo: Harriet Upjohn \nPretty much everything you see in the Marquesas, from roads and houses to churches and even hydro-electric power stations, has been made with materials delivered by Aranui ships. And it's not just one-way traffic. On the return leg, our ship will be loaded to the gunwales with the islands' main sources of income: tonnes of copra (dried coconut), fruit, meat and fish. \nAs our Polynesian crew unload and load cargo, a process that can take most of the day, Aranui's guides take us ashore. In the villages we wander past ramshackle houses, many almost hidden behind drifts of hibiscus and bougainvillea. Chickens, goats and pigs forage in front gardens and sleepy dogs lie and scratch themselves in the sun. The French tricolour flutters alongside the Marquesan flag above administrative buildings and in most villages there is a neat little Catholic church tucked somewhere between the dwellings. A couple of the islands even have cathedrals – one of these, in Nuku Hiva, has a rosewood carving depicting the local Hinano beer as one of the seven deadly sins. \nOn some islands we pile into jeeps and are taken up winding mountain roads where, around every bend, views of the Marquesas' trademark volcanic spires get steadily more breathtaking. We pass wild horses grazing on cliff tops and drive through jungle-like valleys where the trees are laden with fruit and flowers – bananas, mangoes, breadfruit, limes, papaya, grapefruit and, of course, coconuts. \nWild horses grazing in the Marquesas. Photo: LEMAIRE Stephane/hemis.f \nOften, we get the chance to explore on foot. A highlight is a 16-kilometre hike on Fatu Hiva, the most remote of the islands, that takes us past steep ravines, sharp ridges and dramatic peaks, and through rainforests where mango trees grow like weeds. \nWherever we go I fill my bag with mangoes to feast on later. My most memorable picnic spot is in the shade of a frangipani tree beside Paul Gauguin's grave on the island of Hiva Oa. It's a sultry afternoon and the rest of the group has gone. Sitting there in that flower-strewn hillside cemetery overlooking the sea – just me, Gauguin and a bag of mangoes – I feel as if I'm dreaming with my eyes open. \nDeep in the valleys, we are taken to sacred sites in dark glades where daunting stone tiki statues stare out at us from the undergrowth. At one, a group of men wearing ti leaves and boar-tooth necklaces performs the traditional pig dance to a rhythmic drum beat beneath a 400-year-old banyan tree. From somewhere behind, smoke curls up from a small fire. The mana, or spiritual energy, is powerful. \nOn Ua Pou, we feast on poisson cru (marinated raw fish), goat, pork, breadfruit, taro and sweet red bananas at a village restaurant before returning to the dock to find a gang of long-limbed children hanging off our ship's lines, shrieking with delight as the ropes rise and fall. \nA dancer on Ua Pou. The mana, or spiritual energy of the Marquesas is powerful. Photo: David Hoyle \nWherever we go, the familiar soundtrack of the South Seas rings in our ears as village men wearing colourful shirts and garlands of flowers serenade us with ukuleles and guitars. \nBut life here wasn't always so good. At the end of the 19th century missionaries banned all forms of traditional cultural expression including dancing, singing and tattoos. By the time Gauguin died in 1903, the once 100,000-strong Marquesan population had been all but decimated by the South American slave trade and disease brought by Europeans. \nToday, there are just over 9000 people living in the islands and they celebrate a resurgence of their culture with an arts festival every four years. \nWhile many of the original customs and traditions have been lost, some of the ancient skills are still very much in evidence in the exquisite wood, bone and stone carving and tattoo art that you see today. \nA tattoo is high on my souvenir wish list but, alas, I've not left enough time. A little flying fish on my ankle would have been just perfect. \nFIVE FACTS ABOUT THE MARQUESAS \n1 The islands were named after the Marquis of Canete​ by the Spanish, who stumbled across the islands by mistake in 1595 while searching for the Solomon Islands. They were on the right latitude but nearly 7000 kilometres too far to the east. \n2 After the Spanish left, the Marquesas were \"lost\" for almost 200 years. The next Europeans to land there were the British, led by Captain James Cook in 1774. \n3 The Marquesas have been on UNESCO's Tentative World Heritage List since 2010. \n4 Paul Gauguin died, impoverished and suffering from syphilis, at the age of 54 on the island of Hiva Oa in 1903. None of his original works remain in French Polynesia. \n5 Transvestites, known as \"mahu\" or \"rae rae\" are a common sight in the Marquesas. In the Polynesian culture they are regarded as gifted and divine. \nMORE INFORMATION tahiti-tourisme.com ; aranuicruises.com \nCRUISING THERE Aranui 3 carries up to 200 passengers. It offers a high level of comfort albeit minus some of the frills of a standard cruise ship. Accommodation ranges from basic dormitories with shared facilities to large suites with bathrooms and balconies. \nThe more luxurious, 300-passenger Aranui 5 will replace Aranui 3 from January next year.", "external_links": [], "published": "2015-07-27T05:56:00.000+03:00", "crawled": "2015-07-28T03:43:11.874+03:00", "highlightTitle": ""}