{"organizations": [], "uuid": "ac6dcde8148b704e25e34056a3e84fafea7bb2d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.pr.com", "main_image": "", "site_section": "http://www.pr.com/rss/press-releases-1/168.xml", "section_title": "PR.com Press Releases: Travel Arrangement & Reservation Services News", "url": "http://www.pr.com/press-release/629303", "country": "US", "title": "Discovery Adventures Adds New Itineraries to Its Luxury Travel Services", "performance_score": 0, "site": "pr.com", "participants_count": 1, "title_full": "Discovery Adventures Adds New Itineraries to Its Luxury Travel Services", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T10:00:00.000+03:00", "replies_count": 0, "uuid": "ac6dcde8148b704e25e34056a3e84fafea7bb2d3"}, "author": "Discovery Adventures", "url": "http://www.pr.com/press-release/629303", "ord_in_thread": 0, "title": "Discovery Adventures Adds New Itineraries to Its Luxury Travel Services", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Receive press releases from Discovery Adventures: By Email RSS Feeds: Discovery Adventures Adds New Itineraries to Its Luxury Travel Services Besides 4- or 5-star luxury accommodation and transportation, Discovery Adventures offers activities to immerse travelers in the atmosphere of the visited countries and cities. London, United Kingdom, July 20, 2015 --( PR.com )-- The Company offers new itineraries in Europe, Asia, North and South America, Africa and Australia. Discovery Adventures trips include luxury 4-5* star hotel or apartment accommodation, transport, a great amount of activities and entertainment and are focused to immerse travelers into the atmosphere of the visited countries and cities.Discovery Adventures create different types of adventures like City Discovery, Road Trips, Sailing or Skiing and Safari.\"Discovery Adventures was created by experienced travelers, who have visited more than 90 countries, to share their passion for new experiences in travelling and exploring what our planet has to offer,” says a travel advisor at Discovery Adventures, who adds, “We understand that each traveler enjoys a different experience. Some prefer breathtaking beaches with white sands, surfing, and huge waves, while others prefer getting lost in a huge city, living on the rooftop, and having a morning run in Central Park.”About Discovery AdventuresDiscovery Adventures offers more than 50 guaranteed adventures around the world. Each of them is designed as an individual or if travelers would like to go with friends or family, as a private group trip. The travelers will explore the chosen route without nerving tour leaders and large touristic groups, but just meet local guides when visiting certain attractions. The motivation behind this was to give an opportunity for luxury travelers not just to go on perfectly organized adventure but also to escape from touristic crowds, learn local language, live like a local going to the best restaurants and bars advised by our team and privately exploring the countries. Contact Information", "external_links": [], "published": "2015-07-20T10:00:00.000+03:00", "crawled": "2015-07-20T12:22:15.159+03:00", "highlightTitle": ""}