{"organizations": [], "uuid": "2732608d3e14618bc37b92016fb2c9040f4c5dbe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61095/terrorist-was-member-travel-and-tourism-industry", "country": "US", "title": "Terrorist was a member of the travel and tourism industry", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Terrorist was a member of the travel and tourism industry", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T10:33:00.000+03:00", "replies_count": 0, "uuid": "2732608d3e14618bc37b92016fb2c9040f4c5dbe"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61095/terrorist-was-member-travel-and-tourism-industry", "ord_in_thread": 0, "title": "Terrorist was a member of the travel and tourism industry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Terrorist was a member of the travel and tourism industry Adv: \nJul 06, 2015 Adv: \nThe Tunisian jihadist behind the recent massacre of foreign tourists at a seaside resort in Tunisia was a member of the travel and tourism industry when he previously worked in tourism. He was a member of a dance club and was familiar with the tourism sector, having worked in it as an events organizer \nMeanwhile, the mother of the 23-year-old terror suspect Seifeddine Rezgui, insisted her son was \"brainwashed\", the report said. \nIn an interview on Sunday, Prime Minister Habib Essid revealed more details about Rezgui, who gunned down 38 foreign tourists in the June 26 attack. Tourists fled in horror as Rezgui pulled a Kalashnikov assault rifle from inside a furled beach umbrella and went on a shooting spree outside a five-star hotel. \nAuthorities and relatives later described him as having been an apparently normal young man who had been keen on breakdancing. \nThe terrorist mother wanted the world to know: \"God bless the victims, all those people and their poor families, and I feel so sorry but I want to tell them it wasn't my son who did this, it was another Seifeddine,\" she said. \nThe attack on the beach and around the swimming pools of the Riu Imperial Marhaba Hotel was claimed by the Islamic State group. \nAuthorities have admitted that the transformation of an apparently normal young man caused amazement in Tunisia. \nEssid pledged to La Presse \"substantive work... on culture and education\", in addition to economic reforms. \nISIS has encouraged its followers to carry out attacks during the Muslim holy month of Ramadan.", "external_links": [], "published": "2015-07-06T10:33:00.000+03:00", "crawled": "2015-07-06T13:21:13.000+03:00", "highlightTitle": ""}