{"organizations": [], "uuid": "e4cd61a19738690d7deb1b95a2a688c3a6ade203", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buyingbusinesstravel.com", "main_image": "", "site_section": "http://buyingbusinesstravel.com/channel/all/feed", "section_title": "Buying Business Travel news", "url": "http://buyingbusinesstravel.com/news/1024425-ba-opens-flight-data-part-ndc-pilot", "country": "US", "title": "BA opens up flight data as part of NDC pilot", "performance_score": 0, "site": "buyingbusinesstravel.com", "participants_count": 1, "title_full": "BA opens up flight data as part of NDC pilot", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T21:02:00.000+03:00", "replies_count": 0, "uuid": "e4cd61a19738690d7deb1b95a2a688c3a6ade203"}, "author": "Buying Business Travel", "url": "http://buyingbusinesstravel.com/news/1024425-ba-opens-flight-data-part-ndc-pilot", "ord_in_thread": 0, "title": "BA opens up flight data as part of NDC pilot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BA opens up flight data as part of NDC pilot 1 comment Follow @thomasnewcombe \nBritish Airways is opening up some of its flight information to IT developers in a pilot of IATA’s New Distribution Capability ( NDC ). \nFor a trial period, BA is providing access to three APIs that will allow developers access to content and data to build new channels so customers can search for flights, prices and to complete bookings. \nThe trial is open to IT developers from all sectors of the travel industry including start ups, travel agents and established GDSs. \nBA said the move is part of the industry-wide NDC as it looks to add more ‘richer content’ beyond just pricing and flight schedules, such as whether customers can expect fully flat beds and lounge access. \nReferring to the announcement from Lufthansa around the airline charging €16 for non-direct bookings , Paul Tilstone, CEO and founder of consultancy Festive Road, told BBT : “This is the second big airline within three weeks to emerge with a strategy which appears to offer a wider distribution strategy and we can expect more before the summer is out. \n“I say wider rather than alternative because while Lufthansa’s definitely does not include the GDS, BA’s API is available and encouraged for GDS use.” \nTilstone added that both developments are “clearly to ensure” distribution options are not limited to GDS and they have “greater control” over what is presented to the customer and to “potentially explore reduced distribution costs”. \nHowever, a spokesperson for BA told BBT that it’s understandable there might be a “degree of nervousness” around the move but added that GDSs are “absolutely crucial” to the airline. \n“I don’t see why there would be any resistance to this move, it’s a way to create more channels and give people more choice.” \nHe added: “It’s not about getting customers to book direct it’s about opening up more channels and making the content available to more providers.” \nAs part of the trial BA has developed three separate APIs: Air Shopping – will allow users to search for availability and pricing Flight Price – which validates a price quote and provides payment options Order and Create – completes the booking, accepts payments and issues the ticket \nIan Luck, distribution strategy manager at British Airways, said: “British Airways is proud to be one of the first airlines to take part in this game-changing industry-wide collaborative initiative led by IATA . \n“These APIs help us to support innovation in the market and encourage new entrants by lowering the barriers to entry and developing new and exciting selling channels.” \nBBT has approached Travelport, Sabre and Amadeus for comment but all three have yet to reply.", "external_links": [], "published": "2015-07-10T21:02:00.000+03:00", "crawled": "2015-07-10T23:17:36.000+03:00", "highlightTitle": ""}