{"organizations": [], "uuid": "03b84703f22d9807b9f7eca8f503fbdc99a79cd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03363/Massachusetts-CRED_3363553a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-03.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/usa-holidays/11716199/usa-garden-hampton-court-palace-garden-show.html", "country": "US", "title": "USA garden at RHS Hampton Court Palace garden show", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "USA garden at RHS Hampton Court Palace garden show - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T22:49:00.000+03:00", "replies_count": 0, "uuid": "03b84703f22d9807b9f7eca8f503fbdc99a79cd0"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/usa-holidays/11716199/usa-garden-hampton-court-palace-garden-show.html", "ord_in_thread": 0, "title": "USA garden at RHS Hampton Court Palace garden show", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Discover more of the USA » The dual garden heritage of Charleston, South Carolina, and Boston, Massachusetts, was celebrated this week at the RHS Hampton Court Palace Flower show with two gardens from the USA appearing in the World Gardens exhibition at the event. Both the gardens were designed by British garden designer Sadie May Stowell in conjunction with expert garden designers from Charleston and Boston. Stowell researched the “hidden gardens” of Charleston for the first garden of the Great Gardens of the USA exhibit. Bloming marvellous: the Massachusetts garden formed part of the Great Gardens of the USA exhibit “I was trying to capture the feeling and the tapestry of the materials used in the private gardens of the city, behind the wrought iron gates,” said Stowell. “I have used brick, sandstone and crazy paving and from my research I found out that the gardens are highly scented - so have used gardenias, trachelospermum [star jasmine], camellias and hydrangeas.” The garden is structured with box hedging and set around an antique water fountain centrepiece, specially selected for its Charlestonian heritage. In contrast, the Massachusetts garden next door is based on the first public botanical garden in the USA - the Boston Public Garden. An L-shaped water pool surrounds a grassy area with a bench, while the planting features blazing red canna shooting up from beautifully packed flower boxes alongside the all-important rhododendrons, which feature heavily in Massachusetts environs. Cobblestones were also used, to emulate Boston’s traditional cobbled streets. “Putting the gardens together was a really great experience,” Ms Stowell. “The palette of plants was not the normal palette I’m used to working with, which made it an interesting challenge.” 'Charleston’s early garden designers were inspired by Italy and England,' says designer Sheila Wertimer Charleston-based garden designer Sheila Wertimer worked with Stowell on the plans for the Charleston garden, and was at the official opening of the gardens at Hampton Court this week. “Charleston has always been a peninsula,” said Wertimer, “and the population has always been high, so garden space is coveted. The city is full of small formal gardens which is atypical of the United States and much closer to what you would find in the UK. “A lot of Charleston’s early garden designers, the people who owned the properties there, would look to Italy and England for inspiration about how to create their garden, so it is quite fitting to have a Charleston garden here today, and Sadie has thoroughly researched and done an excellent job.” The pair of garden designers had plenty of tips on hand for those who want to bring a bit of pizazz to their own plot. “Open your eyes,” said Wertimer. “Visit as many garden spaces as you can and look at spaces that are similar in size and shape to your own plot before you begin. You’ll be surprised how much you pick up just by being focused. “Also, make sure you draw a detailed plan of what you intend to do before you begin.” Stowell advises budding gardeners to live with their garden as it is for a while before rushing in to redesign. “Find out where the sun goes,” she said, “where the areas of shade are, where you like sitting in the garden. Really get to know your garden and start planning according to how you like to use it.” Great Gardens of the USA will be on show until July 6 at the RHS Hampton Court Palace Flower Show. For more information on USA holidays and gardens visit discoveramerica.com You may also be interested in: • Five of the best cycle routes in the USA » • Outdoor leisure pursuits for families in the USA » • Three classic food-themed road trips in the USA » • Special deals and free attractions in New York City » • Eight of the best cafés in the USA »", "external_links": [], "published": "2015-07-03T22:49:00.000+03:00", "crawled": "2015-07-03T17:47:37.000+03:00", "highlightTitle": ""}