{"organizations": [], "uuid": "c1266de4cf2bfd939406b57871ea13d4e9ee93db", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/10/lufthansa-150x102.jpeg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lufthansa-airlines-publishes-its-21st-sustainbility-report/", "country": "US", "title": "Lufthansa Airlines Publishes its 21st Sustainbility ReportTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Lufthansa Airlines Publishes its 21st Sustainbility ReportTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "c1266de4cf2bfd939406b57871ea13d4e9ee93db"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lufthansa-airlines-publishes-its-21st-sustainbility-report/", "ord_in_thread": 0, "title": "Lufthansa Airlines Publishes its 21st Sustainbility ReportTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lufthansa Airlines Publishes its 21st Sustainbility Report Published on : Tuesday, July 21, 2015\nIn order to make travelling an even more efficient, sustainable and attractive experience for its passengers, the Lufthansa Group is increasing its focus on networked innovation management and invests 500 million euros in innovations by 2020. The Group’s Sustainability Report, “Balance”, which was presented today, therefore places particularly high value on the topic of “Innovation – the key to a successful future”. A special section of the report provides a detailed insight into the huge importance of innovation management at the world’s largest aviation company. “Innovation and Digitalisation” is one of seven central fields of activity of the strategic work program “7to1 – Our way forward”, which was launched by the Group in the year 2014.\n“After safety it is future viability that has the highest priority for us. With our new work program, we have created the basis for a sustainable improvement of results and a successful evolution of the Lufthansa Group. With this program, we also set the course for an even more climate-compatible form of air transport”, explains Carsten Spohr, Chairman of the Executive Board and CEO of Deutsche Lufthansa AG, in the foreword to the report.\nWith its current Sustainability Report, “Balance”, the Lufthansa Group provides readers with transparent information on its wide range of activities, goals and advances in the areas of business, social responsibility, environment, product and corporate citizenship.\nIn 2014, the aircraft in the Group’s passenger fleets consumed an average of just 3.84 litres of kerosene (2013: 3.91l/100pkm) per passenger transported over a distance of 100 kilometres. This is a new efficiency record and represents an improvement of 1.6 percent compared to last year. The Company’s fuel efficiency experts have now developed more than 1,300 ideas and projects for fuel savings to date. In 2014, the year of the report, alone, the group implemented 145 projects in this area. In connection with the most comprehensive fleet modernisation in the history of the Lufthansa Group, which will receive 272 modern and fuel-efficient aircraft between 2015 and 2025, a further reduction in the Group’s specific kerosene consumption is now already foreseeable.\nIn the reporting year, the Company also extended its commitment in the field of active noise protection. Since November 2014, Lufthansa has been the first airline in the world to equip its Airbus A319, A320 and A321 short and medium-haul aircraft with noise-reducing components on the underside of the wings. A total of more than 200 Lufthansa jets can therefore now fly much more quietly, which is a particular relief for residents living close to airports. On top of this, Lufthansa has also extended its commitment in the climate research project IAGOS (In-service Aircraft for a Global Observing System) and fitted a second aircraft with a climate research laboratory. This aircraft now gathers data on atmospheric trace elements and cloud particles at cruising altitude on all of its flights. These data are then used by numerous research facilities worldwide. At the beginning of 2015, the Lufthansa Group was presented with the renowned “Eco-Airline of the Year” award from the American trade magazine Air Transport World for its pioneering role in the field of climate protection for an impressive second time in three years.\nIn 2014, the Group also introduced new processes and tools in the field of human resources, including a new talent management system. Identifying internal and external talents at an early stage is an essential factor for corporate success. Supporting talents will additionally become a stronger focus within the group as one of the central tasks of its executive staff in the future. In another development in the reporting year, the Lufthansa Group signed the “Diversity Charter”, a corporate initiative aiming to promote diversity in companies and institutions. By signing this charter, Lufthansa has yet again underlined the diversity in the corporate culture of the globally operating aviation company, which employs around 119,000 members of staff representing 143 different nationalities.\nThe Lufthansa Group is additionally taking more responsibility for social matters. At the beginning of 2015, the Company introduced the reorientation of its corporate citizenship activities under the name “Lufthansa Group Social Care”. The Group aims to put an even stronger focus on social and humanitarian projects to significantly increase its performance in this important area.\nSource:- Lufthansa\nRelated Posts Antalya Gazipasa Airport opens new terminal building BOC Aviation Marks 20th Year With Record Net Profit in 2013 Lufthansa Group increases result in core business Qatar Executive To Exhibit At Leading Business Aviation Show In Dubai Lufthansa Group offers career transition assistance programme", "external_links": [], "published": "2015-07-21T03:00:00.000+03:00", "crawled": "2015-07-21T15:21:42.300+03:00", "highlightTitle": ""}