{"organizations": [], "uuid": "de0475eaea9a0075bd6892ae9eaf0b58d528ef50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03383/Getty-web_3383053k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11746501/Six-most-stylish-Instagram-accounts-for-the-over-50s.html", "country": "US", "title": "Six most stylish Instagram accounts for the over-50s", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Six most stylish Instagram accounts for the over-50s - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T15:01:00.000+03:00", "replies_count": 0, "uuid": "de0475eaea9a0075bd6892ae9eaf0b58d528ef50"}, "author": "Eleanor Doughty", "url": "http://www.telegraph.co.uk/goodlife/11746501/Six-most-stylish-Instagram-accounts-for-the-over-50s.html", "ord_in_thread": 0, "title": "Six most stylish Instagram accounts for the over-50s", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Age is no barrier to personal style - or at least, it shouldn't be, and in this age of social media, there's no excuse for not telling the world all about it. Whether it's the clothes you put on every day that most interest you, or the way you style your hair, Instagram is ready and waiting for your snapshots. As Dr Jill Biden, the US educator and Second Lady of the United States joins Instagram , we have a look at who else is out there for the stylish over 50s. Get following! Style at a Certain Age <in the pink> #beautiful #summerday #tgif #ootd #whatiworetoday #styleatacertainage #instadaily #love #fashion #fashionover50 #fourthofjuly #fashionpost #bethdjalali A photo posted by Beth Djalali (@styleatacertainage) on Jul 3, 2015 at 5:26pm PDT Meet 56 year old Beth Djalali, a style blogger and writer from San Francisco. \"My hope is to encourage other women to embrace their own personal style as well,\" she says, and posts outfit photographs on her blog as often as possible. She's on Instagram at styleatacertainage and if you pop over there, you can see her elegantly put together outfits for all the world to see. \"I hope my daily ootd [outfit of the day] posts will inspire you to try something new because at the end of the day, getting dressed in the morning should be fun.\" Vanity and Me Keeping cool in this @fandfclothing dress.Have a good week everyone #over40style #stylediary #ootd #fashionblogger #fashionwatch #mydailycapture A photo posted by vanityandmeblog.blogspot.com (@vanity_and_me) on Jul 6, 2015 at 5:18am PDT Laurie, the 52 year old stylish lady behind Vanity and Me, hails from Essex and is a hairdresser by trade. Her blog, Vanity and Me was started after was \"blown away\", reading about blogging in a magazine, and just knew she had to give it a go. She is on Instagram at vanity_and_me where you can find her taking outfit selfies, and going about her daily life. Thats Not My Age The summer jacket #style #wiwtd #ootd #styleblogger #marksandspencer #amwearing #summer In partnership with @marksandspencer photo by Dvora @fashionistable A photo posted by That's Not My Age (@thatsnotmyage) on Jul 7, 2015 at 12:31am PDT Freelance journalist, former fashion editor and author of Style Forever Alyson Walsh is behind That's Not My Age. Her blog was begun from the strong belief that \"you don't have to have youth to have style\" and it's really taken off. She's a top follow for Instagram fans, and you can find her posting snapshots of her day at thatsnotmyage . Jill Biden Hello, @Instagram! Excited to start gramming. Running through my briefing papers before traveling to Asia to promote economic empowerment and educational opportunities for women and girls. #LetGirlsLearn –Jill A photo posted by Dr. Jill Biden (@drbiden) on Jul 16, 2015 at 12:18pm PDT The fabulous Second Lady of the United States Jill started her Instagram account just last week, and it's already a charming success. Her husband Joe also has an account - a little more corporate, mind - but it's still the Instagram account of the Vice President of the United States, which is pretty cool. Catch Jill on Instagram at drbiden and see how she rolls. Advanced Style At Villa Laetitia last night advancedstyle.blogspot.com A photo posted by Ari Seth Cohen (@advancedstyle) on Jul 14, 2015 at 3:32pm PDT The ever-cool street style photographer Ari Seth Cohen is responsible for Advanced Style. While he's not actually a stylish woman (or man) over 50, he is photographing them all the time, and really coming up with the goods. The blog Advanced Style acts as a complete guide to the most stylish \"older folks\", as Cohen puts it. \"Respect your elders and let these ladies and gents teach you a thing or two about living life to the fullest,\" he says. Good advice - these are the most stylish over 50s out there. You can follow Cohen's stylish antics on Instagram here . Anna dello Russo #currentmood @emiliopucci dress @victoriabeckham sunglasses @ruebellemauiparis necklace A photo posted by Anna Dello Russo (@anna_dello_russo) on Jul 18, 2015 at 3:33am PDT Anna dello Russo, the 53 year old fashion editor of Vogue Italia is one of the street style family's highest ticket shots. Known for parading the very finest wares in London, New York, Paris and Milan in and around the fashion shows, this woman proves that age is no barrier to looking absolutely fabulous all the time. Posting snapshots of her life, and the wardrobe choices that have made her more than just a little bit famous, she's one to get following now - here - if you don't already. telegraph.co.uk Follow @telegoodlife", "external_links": [], "published": "2015-07-28T15:01:00.000+03:00", "crawled": "2015-07-28T09:43:32.389+03:00", "highlightTitle": ""}