{"organizations": [], "uuid": "760de3039f4fac2b3a9184ef27beaa9ff0eff26d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/20/09/2AB091F200000578-0-image-a-25_1437382485082.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3167946/Confident-Britons-spending-holidays-summer-taking-six-extra-days-sun.html", "country": "GB", "title": "Britons spending more on their holidays this summer and taking six extra days", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Britons spending more on their holidays this summer and taking six extra days | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T17:56:00.000+03:00", "replies_count": 1, "uuid": "9eb02b3c47a832e3ee8943e02abbcff194d66b8d"}, "author": "John Hutchinson for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3167946/Confident-Britons-spending-holidays-summer-taking-six-extra-days-sun.html#post-0", "ord_in_thread": 0, "title": "Britons spending more on their holidays this summer and taking six extra days", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "8 shares 1\nView\ncomments\nBritons will spend more money on their summer holidays this year as well as have more time abroad as the strong pound leaves holidaymakers 'feeling better off.'\nA survey of over 2,000 people found that almost a third will be taking extra money with them on holiday this year, compared to just 12 per cent who will take less.\nAnd a staggering 73 per cent of travel agents admitted that they believe Britons will spend more this year than the summer of 2014.\nBritons will spend longer on their summer holidays due to a feeling of being 'better off'\nSimon Taylor, head of Travel Money at Sainsburys Bank, who carried out the research, said: 'Consumer confidence appears to be increasing, this coupled with the fact that Sterling is worth more against the Euro than last summer, could explain why many people could be planning to spend more time and money on their summer holiday this year.\n Next Life in the land of the golden temples: A mesmerising tour... The world's longest pier, the oldest rollercoaster and THAT... Traveller chronicles stunning Pacific Crest Trail by... What you need to know before travelling to Greece (and other... 'Of those people who went abroad for their summer holiday last year and plan to do the same this year, a staggering 43 per cent intend to spend on average £848 or more on the entire cost of their holiday, this year.\n'This compares to around 14 per cent who expect to have a smaller summer vacation budget.'\nTravel agents are confident that Britons' spending on their summer holidays this year will rise sharply\nOne in three will also spend on average six extra days abroad this summer.\nThe research reveals that 21 per cent of those planning to go on holiday this summer will make use of an all-inclusive package.\nAnd Britons are keen to take advantage of money-off deals - four out of 10 holidaymakers will use vouchers or special promotions to save money.\nOn average, those who admitted to taking more money with them on holiday will take an extra £157 with them, 15 per cent will carry £100 or more extra and eight per cent will have £200 or more extra.\nOne of the main reasons why people will be spending more on their summer vacations this year is because one in three say they'll have on average six days extra abroad than they did in 2014. Just 11 per cent say on average they'll have five fewer days than last year.\nA spokesman for Sainsbury's Bank added: 'We found from the survey that people are generally feeling better off, and that's definitely a factor when heading on their summer holidays.'", "external_links": ["http://dailym.ai/1JbeapS"], "published": "2015-07-20T17:56:00.000+03:00", "crawled": "2015-07-20T17:37:33.794+03:00", "highlightTitle": ""}