{"organizations": [], "uuid": "0f962e1ca4d4fad49f9bbe46786f40a4945b063b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://m.wsj.net/video/20150720/072015clawyers/072015clawyers_1280x720.jpg&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/travel/travel-advice/air-travel", "section_title": "Air Travel | Air Travel and Flights | Airline Flights and Travel | The Advertiser", "url": "http://www.adelaidenow.com.au/business/work/teenage-son-of-chinese-lawyer-arrested-as-crackdown-sweeps-china/story-fnkjjewf-1227451766026", "country": "US", "title": "China’s lawyer crackdown: son of human rights lawyer detained | Business News | Business and Finance News | |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "China’s lawyer crackdown: son of human rights lawyer detained | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T16:43:00.000+03:00", "replies_count": 0, "uuid": "0f962e1ca4d4fad49f9bbe46786f40a4945b063b"}, "author": "LAUREN McMAH", "url": "http://www.adelaidenow.com.au/business/work/teenage-son-of-chinese-lawyer-arrested-as-crackdown-sweeps-china/story-fnkjjewf-1227451766026", "ord_in_thread": 0, "title": "China’s lawyer crackdown: son of human rights lawyer detained | Business News | Business and Finance News | |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A TEENAGE boy said goodbye to his mother at a Chinese airport as he waited to board a flight to Australia.\nThe boy, 16-year-old Bao Mengmeng, was due to start at a high school in Australia, and his dad Bao Longjun was joining him on the trip.\nBut the pair didn’t make their flight. Instead, they were bundled up by authorities and held under detention.\nThis was July 9, one week after China’s tough new national security laws were passed , prompting fears about ever-tighter limits on human rights in the communist country.\nAfter two days in detention the boy was released under police surveillance and stripped of his passport.\nNo one knows where his father is.\nHis mother, prominent Chinese human rights lawyer Wang Yu, has also disappeared, having been arrested by police shortly after getting home from the airport after dropping off her husband and son.\nShe managed to fire off two text messages to friends, saying her internet and electricity had been cut off, and that people were trying to break into her house.\nShe hasn’t been heard from since.\nThe arrest of three members of the same family on July 9 kicked off what is being described as a terrifying purge of lawyers and activists across China. Lawyer Wang Yu has been detained by Chinese authorities as part of a national crackdown on human rights lawyers. Her husband has also been detained and her son is under police surveillance. Picture: Mark Schiefelbein / AP Source: AP\nAuthorities are targeting individuals and law firms that have taken on cases of “political sensitivity”. So far 209 lawyers and activists have been questioned or detained in the crackdown, according to human rights watchdog Amnesty International. As of Friday, 24 are still missing or in police custody.\nProminent lawyers Xie Yang, Sui Muqing and activist Gou Honggou are being held on suspicion of “inciting subversion of state power” , which carries a jail sentence of 15 years. Amnesty International says the men are at “grave risk of torture and other ill-treatment”, and are being held without access to lawyers or family.\nThe other detained lawyers and activists are expected to face similar charges.\nMany of them were arrested after signing a petition calling for Ms Wang’s release after her July 9 arrest. Others include family members of those suspected of crimes, such as Ms Wang’s son Bao Mengmeng, who has since been ordered not to contact lawyers or ask about where his missing parents are.\nMengmeng was arrested a second time on Friday, and interrogated three times, Amnesty International said. They said authorities were probably doing that to pressure his parents into confessing their alleged crimes.\nAmnesty International said the scale and severity of the crackdown was unprecedented.\n“The use of state security charges is chilling, and only underlines the ferocity of the attack against rights lawyers,” William Nee, a Hong Kong-based China researcher at Amnesty International, said.\n“The authorities appear intent on destroying the growing network of human rights lawyers and activists, and on spreading fear among those willing to stand up for human rights.”\nThe crackdown began when China’s Ministry for Public Security accused lawyers at a Beijing law firm, Fengrui, of “provoking trouble” and disturbing public order .\nFengrui has defended individuals in high-profile human rights cases, such as the case against prominent Uighur academic Ilham Tohti , who is currently serving a life sentence for separatism.\nIn an article in China’s official state newspaper Xinhua, lawyers, support staff and others at Fengrui were accused of forming a “criminal group” that plotted to “stir up” more than 40 legal cases since July 2012. Xinhua said the group seriously interfered with the regular administration of justice and severely disrupted social order.\n“The authorities are demonstrating their contempt for the rule of law and using every tactic possible to try and build a case against the Fengrui law firm,” Nee said. The Beijing building housing law firm Fengru has been targeted by Chinese authorities. Picture: Mark Schiefelbein / AP Source: AP\nMs Wang is one of Fengrui’s lawyers. Her notable clients include Cao Shunli, a human-rights activist who died after being denied medical care in custody and protest organiser Wu Gan.\nShe was one of nine lawyers, two administrative assistants and an associate arrested at Fengrui.\nAnother prominent Fengrui lawyer, Li Shuyun, was arrested on July 10 after her home was raided by about 10 plain-clothed officers.\nThe firm’s director, lawyer Zhou Shifeng, was also arrested on July 10. He was reportedly dragged from his hotel room with a black hood over his head.\nIn a stunning development overnight, Chinese state media has claimed Mr Zhou has confessed to being part of the alleged criminal gang .\nXinhua reported that Mr Zhou was one of several lawyers who admitted to wrongdoing, ranging from hyping up legal cases to spreading smears against China’s legal system.\nMr Zhou pleaded for a “second chance”, Xinhua reported, according to AFP.\n“Some things about my actions at the law firm were illegal ... my mistakes were serious,” Xinhua reported Mr Zhou as saying, apparently while in police custody.\nBut human rights groups says the airing of alleged pre-trial “confessions” was a tactic increasingly used by Chinese authorities to shape public opinion on politically sensitive cases.\n“The whole tone of the state-media reports presents the case against the alleged ‘criminal gang’ as established fact, rather than allowing a fair and impartial court process to decide this,” Nee said.\n“The confessions that they’ve obtained seem like they are fitting the government’s pre approved narrative.”\nThe international community have strongly criticised China over its crackdown.\nThe Department of Foreign Affairs has urged China to release those detained.\n“Freedom of expression and peaceful assembly are guaranteed under China’s constitution,” the department said in a statement released on Friday. Detained Fengrui lawyer Wang Yu had defended prominent Uighur economist Ilham Tohti, who was jailed for life for separatism. Picture: Elizabeth Dalziel / AP Source: AP\n“The Australian Government firmly believes these rights support domestic stability and progress in all societies.\n“We urge China to release all those detained for peacefully exercising these rights, or for lawfully defending others that have been detained for exercising these rights.”\nThe Law Council of Australia has expressed its “deep concern” over the crackdown, with president-elect Stuart Clark saying lawyers must be able to carry out their professional duties without fear of retribution.\n“The reports we are getting from China are deeply disturbing,” Mr Clark said.\n“An independent legal profession is fundamental to the promotion and protection of the rule of law. No lawyer should have to face intimidation, hindrance or improper interference in their work.\n“All lawyers, regardless of the country in which they work, should be treated in a manner consistent with international human rights law and the United Nations Basic Principles on the Role of Lawyers.”\nMr Clark also said the Australian legal profession had a responsibility to monitor and promote the rule of law in the region.\n“On behalf of lawyers in Australia and our colleagues across the region, the Law Council of Australia will continue to monitor these events carefully and will consult with the Australian Government and our counterparts globally.”\nThe US State Department has also condemned the detentions, and expressed concern China’s new national security laws were being used as “a facade the commit human rights abuses”.\nThe crackdown on the legal system is part of a wider purge President Xi Jinping has carried out against civil society since 2012.\nPolitical dissidents, non-government organisations, government petitioners, underground churches, internet users, news agencies and universities have also been targeted by Beijing’s increasingly aggressive campaign.\nNews of the crackdown has coincided with reports this month that more than 100 Muslim Uighurs had been repatriated to China, accused of fleeing the country to join the jihad in the Middle East . Chinese President Xi Jinping has been accused of stifling human rights in China. Picture: AP Source: AP\nThailand has since come under fire for sending the Uighurs back to China, where they face persecution and possible execution or torture over their alleged crimes.\nAmnesty International’s William Nee told news.com.au the need for the detained Uighurs to be defended in a fair trial made the current purge of lawyers especially concerning.\n“It makes a mockery of the rule of law,” he said.\n“Many of these lawyers were people who were willing to defend Uighur clients. To think Thailand (has been) sending people back to a country that is purging its lawyers, going into lawyers’ houses at 3am, putting them in black hoods ... And this is how they’re treating people who are respected members of the community.\n“So just imagine how they will treat people who they suspect of terrorism.” Abduction - The Megumi Yokota Story 1:15:50 Play video\nAbduction is the astonishing true story of a 13-year-old Japanese girl abducted on her way home from school by North Korean spies in 1977. For 20 years, her parents had no idea what had happened to their daughter, or if she was even alive.\nOovvuu 06 Apr 2015 TV/Investigation TV/Conspiracy TV/Society and Culture TV/Documentary\nOriginally published as This nation’s people are vanishing", "external_links": ["http://resources0.news.com.au/images/2015/07/22/1227451/764440-7b734992-2e98-11e5-a24e-db314d4219bf.jpg", "http://resources0.news.com.au/images/2015/07/22/1227451/765108-e044b1da-2e98-11e5-a24e-db314d4219bf.jpg", "http://cdn.newsapi.com.au/image/v1/external?url=http://videomam.news.com.au.s3.amazonaws.com/generated/prod/05/06/2015/33923/image1024x768.jpg?count=1&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://resources2.news.com.au/images/2015/07/22/1227451/765162-2f1fab0c-2e99-11e5-a24e-db314d4219bf.jpg", "http://www.news.com.au/finance/business/human-rights-groups-hold-fears-for-chinese-uighurs-accused-of-trying-to-fight-with-jihadis-the-middle-east/story-fnki1jcy-1227441915623", "http://www.theguardian.com/world/2015/jul/01/china-national-security-law-internet-regulation-cyberspace-xi-jinping", "http://www.theguardian.com/world/2014/mar/14/china-activist-cao-shunli-dies-human-rights", "http://www.wsj.com/articles/human-rights-lawyers-detained-in-china-confess-state-media-reports-1437307686", "http://www.news.com.au/finance/work/teenage-son-of-chinese-lawyer-arrested-as-crackdown-sweeps-china/story-fn5tas5k-1227451766026", "http://resources2.news.com.au/images/2015/07/22/1227451/765998-847f1556-2e99-11e5-a24e-db314d4219bf.jpg", "http://www.abc.net.au/news/2015-07-13/human-rights-lawyers-activists-still-missing-in-china/6616198", "http://www.bbc.com/news/world-asia-29321701", "https://au.news.yahoo.com/world/a/28842132/china-suspects-rights-lawyers-of-inciting-subversion-of-state-power/"], "published": "2015-07-22T16:43:00.000+03:00", "crawled": "2015-07-22T03:41:39.620+03:00", "highlightTitle": ""}