{"organizations": [], "uuid": "48b089384e178ff313bb5f4f9438b77d5abdb579", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vancouversun.com", "main_image": "http://www.vancouversun.com/cms/binary/11191637.jpg", "site_section": "http://rss.canada.com/get/?F7439", "section_title": "Vancouver Sun - Travel", "url": "http://www.vancouversun.com/travel/Explore+Italy+colourful+Cinque+Terre+foot/11191636/story.html", "country": "CA", "title": "Explore Italy's colourful Cinque Terre on foot", "performance_score": 0, "site": "vancouversun.com", "participants_count": 0, "title_full": "Explore Italy's colourful Cinque Terre on foot", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T23:38:00.000+03:00", "replies_count": 0, "uuid": "48b089384e178ff313bb5f4f9438b77d5abdb579"}, "author": "", "url": "http://www.vancouversun.com/travel/Explore+Italy+colourful+Cinque+Terre+foot/11191636/story.html", "ord_in_thread": 0, "title": "Explore Italy's colourful Cinque Terre on foot", "locations": ["Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Barbara Gunn"], "text": "Explore Italy's colourful Cinque Terre on foot By Barbara Gunn, Vancouver Sun One of the villages at Cinque Terre, a collection of centuries-old houses and shops clinging to the coastal cliffs of northern Italy. \nGood walking shoes are advisable. A good camera is a must. Head to Cinque Terre , those five centuries-old hamlets clinging to the rugged coast of the Italian Riviera in northern Italy, and you’ll be exploring on foot – and pausing at every turn to take shots of the craggy seascapes, the terraced hills and the crazy, colourful houses. \nEach of Cinque Terre’s five villages – Monterosso , Riomaggiore , Vernazza , Corniglia and Manarola – has a distinct personality, yet each shares dramatic scenery and a notable lack of chain stores, museums and automobiles. \nVisitors – and they come by the masses – can travel between the villages by train or on the hiking paths that have made Cinque Terre (“five lands”) hugely popular with the backpacking set. \nAll day long, small ferries ply the coastline, carrying tourists from one village to another. (Corniglia, however, is the only village not accessible by water, and therefore ever-so-slightly quieter than its neighbours.) \nSo what to do in Cinque Terre, a UNESCO World Heritage Site since 1997? You won’t be going to a show or shopping for designer clothing, but you’ll likely be sampling the locally made wine and the abundant fresh seafood. \nYou’ll probably be relaxing on the beach at Monterosso and testing the waters of the Mediterranean. And you’ll no doubt be walking the towns and the trails that connect them; high above the water, they wind through the vineyards and olive trees on the terraced mountainside. \nJust don’t forget your camera.", "external_links": [], "published": "2015-07-06T23:38:00.000+03:00", "crawled": "2015-07-07T02:45:07.000+03:00", "highlightTitle": ""}