{"organizations": [], "uuid": "9711c13e4a486cf475bd673230b3af42f4591016", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/opinion/opinion-why-we-mustnt-forget-the-humble-brochure/4697852.article", "country": "GB", "title": "Opinion: Why we mustn’t forget the humble brochure", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Opinion: Why we mustn’t forget the humble brochure", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T15:57:00.000+03:00", "replies_count": 0, "uuid": "9711c13e4a486cf475bd673230b3af42f4591016"}, "author": "", "url": "http://www.ttgdigital.com/news/opinion/opinion-why-we-mustnt-forget-the-humble-brochure/4697852.article", "ord_in_thread": 0, "title": "Opinion: Why we mustn’t forget the humble brochure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Save \nThe holiday brochure is persuasive, reassuring and unpressured - and more importantly holidaymakers still want them, argues Funway Holidays’ Nick Talbot. \nSome believe the “brochure is dead” but demand at Funway continues to prove the very opposite. Brochure orders from travel agents are not declining with our brochure requests seeing a modest 3% increase from this time last year. \nListening to our agents it’s clear customers switch between online and traditional channels during the booking process so it’s important a tour operator gives equal prominence to both offline and online channels and ensure cohesion between the two. \nWhile we’ve redeveloped our dedicated trade website and improve our social media activity with more innovative competitions we will not forget the brochure. \nBut the over-riding message is that there will always be customers who want to make, what is perhaps their biggest purchase of the year, in person, with the expertise, knowledge and assurance offered by an agent. \nIt is certainly one of the most relaxing ways to decide on a holiday destination or a hotel. Sitting back with a biscuit and a cup of tea and leafing through a glossy brochure for your fortnight of sun. And researching your holiday should be a positive experience. \nDue to the nature of some of our holidays, for example the more crafted and tailor-made itineraries including fly-drives, multi-centres, rail holidays and escorted tours, customers tend to benefit from using a brochure to guide them. \nOur brochure style is evolving to meet customer needs, with a focus on providing much more detailed information such as comprehensive maps, weather and climate, top experiences and useful information such as flight times. \nWe will continue to listen to feedback from our travel agents to evolve our brochures to ensure they provide their clients with the inspiration for their next holiday. \nIt’s true consumers utilise many more information sources nowadays before making their purchase decisions and a multi-media approach is essential. However travel shops and brochures go hand in hand; brochures are an integral part of most high street holiday sales. Consumers still want printed brochures, and it’s important to recognise that the holiday brochure is still very much alive and kicking and if a company chooses not to provide them - their competitors will! \nIn light of the combined way of browsing for holidays, all Funway brochures can be downloaded online as a digital brochure app, which can be browsed on a tablet, smartphone, or computer, providing the best of both worlds. \nEven with huge websites full of content, print still captures the imagination. It’s persuasive, reassuring, unpressured and helps people make that final decision on what to buy. Brochures are also part of the post-booking holiday anticipation process. \nPrint is still important and we mustn’t forget the humble brochure! \n#longlivebrochures", "external_links": [], "published": "2015-07-14T15:57:00.000+03:00", "crawled": "2015-07-15T01:44:56.000+03:00", "highlightTitle": ""}