{"organizations": ["United Airlines"], "uuid": "1727311066fc51adaf689edc327d11b3c5879157", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297713147216_LARGE_BOX.jpg?quality=80&stmp=1437672380423&size=100x", "site_section": "http://www.torontosun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.torontosun.com/2015/07/23/united-airlines-steps-up-backup-plans-in-wake-of-tech-glitches", "country": "CA", "title": "United Airlines steps up backup plans in wake of tech glitches", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "United Airlines steps up backup plans in wake of tech glitches", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T20:17:00.000+03:00", "replies_count": 0, "uuid": "1727311066fc51adaf689edc327d11b3c5879157"}, "author": "", "url": "http://www.torontosun.com/2015/07/23/united-airlines-steps-up-backup-plans-in-wake-of-tech-glitches", "ord_in_thread": 0, "title": "United Airlines steps up backup plans in wake of tech glitches", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airports, Airlines & Security \nUnited Continental Holdings Inc has invested in backup plans for disruptions in the wake of tech glitches that have grounded its planes twice since early June, the airline's Chief Executive Officer Jeff Smisek said on Thursday. \n\"We know areas where we can beef up backups,\" Smisek said on a call with investors, adding that the airline was investing \"a significant amount of time and money\" into making sure the bugs are a thing of the past. \nTechnology is the airline's second-largest capital expenditure after spending on its fleet, Smisek said. \nUnited said it has made investments that add more backup systems to its operations, and it plans additional spending in the future to keep its planes safely in the air. \nAs airlines switch to electronic luggage tags and more travelers swap paper tickets for boarding passes stored on smartphones, industry consultants have said the impact of technology disruptions will keep growing. \nThat potentially means that more money will be lost for airlines and more passengers' travel plans thwarted if glitches occur. \nThe first recent incident at United occurred on June 2, when software needed to dispatch the airline's flight plan briefly lost functionality. \nThen on July 8, a computer router error locked United out of its reservations records, blocking both check-in and boarding and grounding all of its flights for nearly two hours. \nUnited is so far the only U.S. air carrier to offer a \"bug bounty,\" or free frequent flier miles rewarded to researchers who flag problems on its website before malicious hackers can exploit them. Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions . Sponsored Links", "external_links": [], "published": "2015-07-23T20:17:00.000+03:00", "crawled": "2015-07-24T01:23:05.118+03:00", "highlightTitle": ""}