{"organizations": [], "uuid": "e48b9f8f257c4090d25b4c8231e128d91c175fca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/14/15/2A86847600000578-0-image-a-34_1436884971902.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3160936/Ryanair-asks-court-halt-illegal-strike-baggage-handlers-walked-job-Madrid-airport-dispute-working-conditions-pay.html", "country": "GB", "title": "Ryanair asks court to halt 'illegal' strike by baggage handlers in Madrid", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 1, "title_full": "Ryanair asks court to halt 'illegal' strike by baggage handlers in Madrid | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T22:48:00.000+03:00", "replies_count": 0, "uuid": "e48b9f8f257c4090d25b4c8231e128d91c175fca"}, "author": "Chris Kitching for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3160936/Ryanair-asks-court-halt-illegal-strike-baggage-handlers-walked-job-Madrid-airport-dispute-working-conditions-pay.html", "ord_in_thread": 0, "title": "Ryanair asks court to halt 'illegal' strike by baggage handlers in Madrid", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View\ncomments\nRyanair is taking legal action against a group of baggage handlers who have been on strike at Spain’s busiest airport for more than a month.\nEurope’s largest budget carrier says the ongoing walkout by a ‘small minority of’ its ground crew at Madrid’s international airport is illegal, and is asking a labour court to bring it to an end.\nThe workers, hired by the Dublin-based airline to handle checked luggage, called an indefinite strike in late May in a dispute over pay and working conditions.\nRyanair says the indefinite strike is illegal and has asked a Madrid labour court to bring it to an end\nMembers of four trade unions walked off the job, but workers with one union, the CTA, have not returned to work, the Irish Independent reported.\nA Ryanair spokesman told MailOnline Travel: ‘A small minority of baggage handlers in Madrid are continuing to engage in industrial action but our Madrid flights and baggage services are operating as normal.\n Next Forget sunny Spain, enchanting Thailand and the romance of... Tourist who carved her initials into a stone pillar at... Mine! Seagull steals GoPro from tourist and takes it for... British holidaymakers spend £1billion worth of foreign... ‘We have lodged legal proceedings to prevent any such future illegal disruption to our customers.’\nUnion leaders claimed the strike was called in protest of plans to slash workers’ pay by up to 30 per cent, in addition to concerns about changes to shifts, annual leave and safety equipment.\nThe CTA claimed employees were also upset by the ‘working conditions, abuse and threats’ they are subjected to.\nThe unions also accused Ryanair of refusing to negotiate on salaries.\nRyanair says its baggage services at Madrid's airport are operating as normal despite the strike\nAs the strike entered its second week, all unions except the CTA signed an agreement accepting Ryanair’s employment conditions, the Irish Independent reported.\nRyanair denied the union’s claim that it is looking to replace the baggage handlers with lower paid workers.\nThe labour dispute in Spain has coincided with strife in Denmark, where the airline has closed its bases in Copenhagen and Billund due to unionised workers’ plans to hold a strike.\nIn northern Italy, Ryanair cancelled more than a dozen flights into and out of Bologna Airport today due to an ‘airport and ground handling strike’.\nInbound flights that weren’t cancelled were diverted to Milan Bergamo Airport, where the affected passengers boarded buses and completed their journey to Bologna with a nearly three-hour drive.\nRead more: Ryanair sues its Spanish staff for strike action - Independent.ie", "external_links": ["http://dailym.ai/1Rwt4MW", "http://www.independent.ie/business/irish/ryanair-sues-its-spanish-staff-for-strike-action-31373917.html"], "published": "2015-07-14T22:48:00.000+03:00", "crawled": "2015-07-14T20:33:25.000+03:00", "highlightTitle": ""}