{"organizations": [], "uuid": "ad995ab091174eae1d0f87d88c8e2af60942959c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1464944/images/o-US_UK_CA-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/melissa-fenton/three-family-friendly-spe_b_7825332.html", "country": "US", "title": "Three Family Friendly, Special Needs Accomodating, and Active Outings in the Smoky Mountains", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Three Family Friendly, Special Needs Accomodating, and Active Outings in the Smoky Mountains", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T21:03:00.000+03:00", "replies_count": 0, "uuid": "ad995ab091174eae1d0f87d88c8e2af60942959c"}, "author": "Melissa Fenton", "url": "http://www.huffingtonpost.com/melissa-fenton/three-family-friendly-spe_b_7825332.html", "ord_in_thread": 0, "title": "Three Family Friendly, Special Needs Accomodating, and Active Outings in the Smoky Mountains", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nReady to get out of the summer theme park rut? Want to get your kids physically active and learning while having a blast? Check out these three summer destinations all perfect for families of all ages, and all within two hours of Atlanta. \nAsheville Treetops Adventure Park/ Nantahala White Water Rafting \nGrab the kids and head over to this hidden gem in the mountains of western North Carolina. Third generation family owned by the Greiner family, the Asheville Treetops Adventure Park is a zip lining adventure park like no other. With zip lining options for children as young as four, known as \"KidZips,\" as well as two hour long zip tours zipping through the mountains, and a bike park, there is something for everyone at Treetops. \nWall climbing thirty feet in the air on the Treetops Course \nIn addition, plan to spend two hours in the tree adventure park, where several \"tree\" based obstacle courses from beginner to very advanced will have you climbing, swinging, tight roping, rappelling, and zipping your day away through over 30 trees. Accommodations can also be made for special needs children, including those hearing and visually impaired (call ahead with specific needs.) And each year Treetops holds a Zipping for Autism event, the first of its kind in the country. Teams of 10 or more swing through the trees and raise money for the Autism Society of North Carolina. \nKidZip line guide Liz helps get a guest started. \nJust a few short hours away from its Asheville center, sits its sister center, Wildwater Nantahala Adventure Center. Also available here are \"KidZips\" or zip lines for those ages 4- and up, and like Treetops Park, accommodations can be made for special needs children by phoning ahead with your request. Also at the Adventure Center is a two hour long zip course through the mountains for those ages 12-up. Located directly across the street is the Nantahala Wildwater River Rafting Center. Here adults and children ages 7-up or 60 pounds can tackle the class II rapids of the Nantahala River, courtesy of very experienced and extremely friendly guides, all there to ensure you have a safe and memorable ride down the river. The center also employs a rafting guide who is ASL certified, and can accommodate visually and hearing impaired adults and children. Call ahead for specific special needs requests. \nRafting down the Nantahala River \nVisit any one of the five locations of Wildwater Adventure Centers in Western North Carolina, N. Georgia/Upstate SC, & Southeastern Tennessee. \nTennessee Aquarium, Chattanooga, Tennessee. \nTennessee Aquarium, Chattanooga, TN. \nThe world class Tennessee Aquarium, located smack dab in downtown Chattanooga, TN on the Tennessee River, is not to be missed. Taking up two beautifully designed buildings, one themed fresh water and named River Journey, and one salt water, or Ocean Journey, this aquarium first opened in 1992 and features one of the largest fresh water aquariums in the world. \nFollowing the path of water flow from the mountains to the sea, both buildings collectively house over 10,000 animals. Also on site is an IMAX theatre, and the River Gorge Explorer. The Explorer is a two hour tour down to the Tennessee River Gorge, and is guided by an Aquarium naturalist. Climate controlled, smooth, and very scenic, this river tour on the Explorer is a wonderful compliment to the aquarium, and the guide is as knowledgeable about nature as she is about American history, as she points out landmarks along the way that were vital to the Civil War. \nRiver Gorge Explorer \nWilderness at the Smokies Waterpark Resort and Family Adventure Center \nWilderness in the Smokies \nBoasting both an indoor and outdoor water park, and located in Sevierville, TN, Wilderness at the Smokies Resort is an all in one family vacation destination. With the water parks accessible by resort guests only, crowds are manageable. When inclement weather arrives, the indoor water park as well as an indoor adventure center with ropes course and climbing wall are great alternatives and will keep the kids moving. \nIndoor water park at Wilderness Resort \nLocated just minutes from Pigeon Forge and Gatlinburg, Wilderness guests can day trip to many other vacation destinations in the Smoky Mountains, including the Great Smoky Mountain National Park. Also available at the resort are spacious meeting facilities for corporate and private events. \nFollow Melissa Fenton on Twitter: www.twitter.com/melissarunsaway More:", "external_links": [], "published": "2015-07-22T21:03:00.000+03:00", "crawled": "2015-07-22T21:39:31.740+03:00", "highlightTitle": ""}