{"organizations": [], "uuid": "d5b773e6f71d468e0c4ed4658bb4bcdd6c5b0f14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/07/04/Travel/Images/81436043555.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel: Travel News, Guides, Deals, Hotels, Vacation Ideas &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/travel/knowing-the-score-for-group-travel/2015/07/09/fa531104-1f50-11e5-84d5-eb37ee8eaa61_story.html", "country": "US", "title": "Think the logistics of a family trip are tough? Try 2 weeks in China for 100 singers.", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Think the logistics of a family trip are tough? Try 2 weeks in China for 100 singers. - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "d5b773e6f71d468e0c4ed4658bb4bcdd6c5b0f14"}, "author": "By Melanie D.G. Kaplan", "url": "http://www.washingtonpost.com/lifestyle/travel/knowing-the-score-for-group-travel/2015/07/09/fa531104-1f50-11e5-84d5-eb37ee8eaa61_story.html", "ord_in_thread": 0, "title": "Think the logistics of a family trip are tough? Try 2 weeks in China for 100 singers.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Melanie D.G. Kaplan July 9 at 7:15 PM When Steve Capanna travels, he drinks tap water in countries where he knows it to be safe. But on a recent trip to China, where tap water is undrinkable, Capanna resorted to bottled water and felt a twinge of remorse not only because of the three plastic bottles he consumed daily but also because of the hundreds consumed every day by his companions. He was touring with the Choral Arts Society of Washington, and this was but one of the large-scale nuisances of group travel.\n“As someone who works on environmental issues, this was a nagging source of guilt for me,” said the tenor, who works for the Department of Energy. The solution for him and others, he joked, was substituting Tsingtao beer whenever possible.\nIf you’ve ever been exasperated by rallying and shepherding friends or family for early flights or late performances in distant lands, consider trying it with a group of 100. In May, Choral Arts members flew from Washington to China for a five-city, two-week tour called “Two Countries One Stage.” The singers joined the 100-person Qingdao Symphony Orchestra in performing Carl Orff’s “Carmina Burana” and reaching a total of 10,000 Chinese arts patrons.\nThe whole chorus and staff at the Qingdao Grand Theatre entrance. The volunteer choir of 100, whose members range in age from 20s to 70s, made stops there, Beijing, Shanghai, Guangzhou and in Hong Kong. (Courtesy of Debra Kraft)\nThe choir, now in its 50th season, had traveled internationally before, but this was its first Asian tour. The group was invited by China’s Ministry of Culture after it performed “Porgy and Bess” with the Qingdao Symphony on its 2009 U.S. tour. Upon learning of the invitation, some choristers immediately voiced concerns about China’s air quality; others were worried about Internet access, traffic, long lines and crowds.\n“It’s a country that — whenever we read about it — is not necessarily couched in the positive,” said Anne Keiser, a first alto and freelance travel photographer who has sung with the choir for 40 years. “Whether it’s politics, pollution, Tiananmen Square, hacking — these are the things that first come to mind.”\nKeiser and some of her fellow choristers also cringed at the idea of group travel. But the desire to explore the culture and collaborate artistically with a Chinese orchestra in some of the country’s most impressive concert halls trumped any worries about what mostly amounted to inconveniences.\n“When you’re traveling as a group, it’s an individual experience within a group context, within cultural diplomacy,” said Choral Arts Executive Director Debra Kraft. “We were communicating through music, and when you can share that experience, it’s an incredible high.”\nA couple waits for a taxi under the rain in Beijing. (Fred Dufour/AFP/Getty Images)\nThe challenge What’s involved in coordinating travel for 100 — plus an additional 20 staff, family and friends?\nKen Grundy is a group travel expert with a couple dozen China visits under his belt, but this job was unusual for him. When his Liverpool, England-based company, Maestro Tour Management, plans trips for performing artists, most of them are professionals, such as the London Philharmonic or the Bolshoi Ballet. Choral Arts, however, is an unsalaried, volunteer choir. Each singer paid his or her own way — about $4,000 a person, which included flights, in-country transportation, 13 hotel nights, daily breakfast, four lunches and three dinners.\n“You have a group of talented musicians who also have full-time jobs and who have funded themselves to have not only a wonderful concert tour but also a touristic experience,” Grundy said. “The challenge was to include as much as we possibly could.” Having worked with Choral Arts before, he knew members were enthusiastic about new experiences. Salaried performers, in contrast, “just want to get to their hotels and rest, and having to do anything organized during their down time just appalls them,” he said.\nWorkers prepare a traditional junk ahead of a tourist cruise in Hong Kong's Victoria Harbour. (Anthony Wallace/AFP/Getty Images)\nGrundy joined Kraft in May 2014 for a two-week scouting trip. At the time, the sky was yellow with pollution, leading them to make contingency plans in case the singers needed to move some activities inside. Kraft visited concert halls; she also tested the pools and fitness facilities in each hotel as an indicator of general cleanliness. She ended up booking chiefly with Hyatt, which offered an affordable rate, an accommodating liaison for most of their city stops and colossal breakfasts with offerings from raw fish to scones and marmalade.\nThe tour kicked off May 17 at the Kennedy Center with a sold-out performance of “Carmina Burana.” Later that week, the group began its journey to Qingdao, Beijing, Shanghai, Guangzhou and Hong Kong.\nThe concert hall where the Choral Arts Society performed in Shanghai. (Courtesy of Debra Kraft)\nThe travelers ranged in age from early 20s to late 70s, and each had completed a questionnaire with dietary restrictions and airline seating requests. Staff distributed itineraries, which included details such as “Set watches forward 12 hours,” notes on when their coach would make pit stops (and whether the toilets were Western- or Chinese-style) and reminders to keep passports in hand baggage.\nThe Hong Kong skyline. (Philippe Lopez/AFP/Getty Images)\nBetween rehearsals and performances were family-style meals (with vegetarian and gluten­-free tables), walking tours (in groups of 25) and visits to attractions such as the Forbidden City, Tiananmen Square and Hong Kong’s Stanley Market. Ski lifts and cable cars took participants up the Great Wall for stunning views, and a number of choristers couldn’t pass up the opportunity to take a toboggan-like ride down.\nTiananmen Square, Beijing. (Wu Hong/EPA) Between Chinese cities, most group transportation was by tour bus or bullet train — a spotlessly clean and efficient system that made Washingtonians reconsider their fondness for Acela. This avoided potential airport delays and hassles and allowed travelers to see the countryside, but it presented a another quandary: The trains aren’t equipped to store luggage. So Grundy hired a sealed Chinese postal truck to transport bags. The trucks needed 30 hours to make the trip, versus five for the train — and they had to reach each destination before the start of the city’s truck curfew (established to reduce traffic in the busy cities), so participants could reclaim their bags. The train fare included snack bags with what looked liked dried pineapple but turned out to be shredded cuttlefish.\nPlanners and participants alike expected hiccups along the way. Although the air quality was better than predicted, the traffic wasn’t: The hotel in Beijing was just two-thirds of a mile from the China National Center for the Performing Arts, but it took 24 minutes for the choristers’ bus to get there. Then, the bus couldn’t pull up to the stage door, so everyone had to walk in what Kraft described as incredible heat, wearing long black dresses and tuxedos. In another city, they discovered that the room where they rested before their performance began — hydrating and breathing in supposedly clean air — was also used by the orchestra for smoke breaks.\nA signature way to add levity But choristers have more memories of delight than frustration. In a Shanghai park, they ran into a gathering of elderly locals practicing their own singing. Despite language barriers, an impromptu concert ensued, climaxing with a dual-language version of “Jingle Bells.” At a farewell dinner, the chorus sang a thank-you song to the host orchestra, with lyrics written to part of Beethoven’s Ninth.\nDuring the trip, Kraft said, choristers didn’t complain; rather, they did what they do best. “When the going got rough,” she said, “they broke into song.”\nGlen Howard, a tenor and retired general counsel, said he had some trepidation about a group trip and even bet a fellow singer as to who would explode first. “We questioned whether tour rage would get the best of us,” Howard said. But in the end, “the musical experience and cultural diplomacy was so great, it outweighed the challenges of traveling with 100 people.”\nHoward celebrated his 65th birthday in Beijing with Peking duck and a small group from the choir, and on his birthday eve, a larger group sang to him in the hotel lobby, and another group serenaded him on the bus. “When you’re getting ‘Happy Birthday’ in about 35-part harmony,” he said, “it’s pretty glorious.”\nSome participants, especially the self-described introverts, made an effort to break off from the group to recharge their batteries. They’d take the subway or Uber to inexpensive alley restaurants where they found themselves the only Caucasians, communicating with servers using the translation app on their smartphones.\nThe real magic, however, occurred around the performances. Grundy said that a decade ago, performing arts audiences in China were all expatriates. Five years ago, Chinese would talk on their mobile phones during shows. Today, he said, that’s changed. On this tour, the largely Chinese audiences showed such admiration for performers that at each venue, they applauded vigorously during the entire five minutes choristers filed onstage (done without ceremony at home).\nEach show ended with thunderous applause, and when the singers exited the stage after the final show, they lined up on both sides of the backstage hallway, cheering and high-fiving the members of the orchestra as they left the building.\n“We all shared an art form, and we all found ways to appreciate each other,” Keiser said. “Even though we didn’t speak the same language, an enormous amount of communication took place.”\nKaplan is a freelance writer in Washington. Her Web site is www.melaniedgkaplan.com .\nMore from Travel :\nHiking the Great Wall of China, the wild and free way\nA traveler with disabilities takes on China\nThe week’s best travel deals from around the globe", "external_links": [], "published": "2015-07-09T03:00:00.000+03:00", "crawled": "2015-07-10T02:34:24.000+03:00", "highlightTitle": ""}