{"organizations": [], "uuid": "5368bf37a91358c0ad2af21f938765ff79e62dd8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelmole.com", "main_image": "", "site_section": "http://www.travelmole.com/feeds/7_2.xml", "section_title": "TravelMole Media Group, L.L.C. | UK Travel Agent News", "url": "http://www.travelmole.com/news_feature.php?news_id=2017757", "country": "US", "title": "Friendship poll surprises Holiday Hypermarket", "performance_score": 0, "site": "travelmole.com", "participants_count": 0, "title_full": "Friendship poll surprises Holiday Hypermarket", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T17:57:00.000+03:00", "replies_count": 0, "uuid": "5368bf37a91358c0ad2af21f938765ff79e62dd8"}, "author": "", "url": "http://www.travelmole.com/news_feature.php?news_id=2017757", "ord_in_thread": 0, "title": "Friendship poll surprises Holiday Hypermarket", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Friendship poll surprises Holiday Hypermarket \nA poll on holiday friendship by Holiday Hypermarket found that only 3% of its customers make friends with couples with children while away. The survey of 3345 British holidaymakers found that although 82.5% said they had made friends on their last holiday, only 3% had made friends with families with children. \"This was the most surprising figure for us,\" said marketing manager Ian Crawford. \"We expected to find that families are more open to socialising with one another, particularly as kids often play together no matter what nationality or background they come from. \"It suggests that families are more interested in spending quality time together on holiday than getting to know new people.\"The survey also found: - 13.8% said they had no intentions of meeting new people while away - 66.2% said they made friends with other British tourists, whereas 23% claimed to make friends with those working where they were staying - Customers were least likely to socialise with European tourists and local people (at 17.2% and 17.8% respectively) - 65.9% of holidaymakers made friends with people of the same or similar age - 40.2% of friends who met on holiday added each other on social media and 34.4% exchanged email addresses - While 31.5% of people have not spoken to the friends they made on holiday since returning home, a total of 46.5% still speak to their friends at least once a month. These survey was carried out to coincide with International Friendship Day, which falls on July 30. \nSunday, July 26, 2015", "external_links": [], "published": "2015-07-26T17:57:00.000+03:00", "crawled": "2015-07-26T18:10:41.623+03:00", "highlightTitle": ""}