{"organizations": [], "uuid": "421081654ed8d49de5a4bca8e0575670f1519271", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/didgeridoo_2711.JPG", "site_section": "http://www.themalaymailonline.com/feed/rss/travel\r", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/australia-tourism-seeks-to-break-out-of-crocodile-dundee-time-warp", "country": "MY", "title": "Australia tourism seeks to break out of ‘Crocodile Dundee’ time warp", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Australia tourism seeks to break out of ‘Crocodile Dundee’ time warp", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T05:41:00.000+03:00", "replies_count": 0, "uuid": "421081654ed8d49de5a4bca8e0575670f1519271"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/australia-tourism-seeks-to-break-out-of-crocodile-dundee-time-warp", "ord_in_thread": 0, "title": "Australia tourism seeks to break out of ‘Crocodile Dundee’ time warp", "locations": ["Australia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australia tourism seeks to break out of ‘Crocodile Dundee’ time warp Friday July 24, 2015 Print Article \nAn Aboriginal man plays a traditional muscial instrument called a didgeridoo as he performs a 'Welcome to Country' ceremony in front of the Sydney Opera House November 27, 2013. — Reuters pic SYDNEY, July 24 — “Crocodile Dundee” star Paul Hogan enticed Americans to holiday Down Under 30 years ago by promising to throw another shrimp on the barbie for them. Not much has changed since then. \nTired hotels, outdated attractions like Sydney’s Darling Harbour and mediocre customer service mean Australia’s tourism industry isn’t making the most of a booming Chinese travel market at a time when it needs all the economic help it can get. \n“Most people who arrive in Sydney do not like the hotels, even the 5-star hotels,” said Melinda Cai of Great Holidays Pty, which brings Chinese tourists to Australia. “Four-star hotels in Sydney are too small and old, they’re more like a motel than a hotel.” \nAustralia’s tourism industry is stuck in a 20th-century time warp after the nation diverted spending to the resources industry to cash in on Chinese demand for iron ore and coal. Now, as commodity prices tumble, mining investment dries up and the currency falls, the country is hunting for new sources of growth. \nTourism is an obvious candidate — but it’s going to take time to polish the country’s status as an attractive destination, according to Andrew Charlton, director of consultancy AlphaBeta in Sydney. \n“The tourism industry is such a reflection of the rest of Australia,” said Charlton, who earlier served as economic adviser to former Prime Minister Kevin Rudd. There was “massive investment in the mining-related boom geographies and sectors. At the same time, there was massive underinvestment in those industries that didn’t have a boom shining on them and suffered from the high dollar and rising wage costs.” \nDundee country \nAustralia’s pristine coastline, sparkling Sydney harbour and the vast Outback showcased in Hogan’s 1986 comedy “Crocodile Dundee” proved a magnet for US and Japanese tourists late last century and they remain a major lure for visitors. \nIn TripAdvisor’s 2015 travellers’ choice awards, Sydney and its opera house still ranked in a list of the world’s top 25 destinations and landmarks, while Whitsunday Island off the Queensland coast was the ninth-best beach in the world. \nNow, it’s the Chinese who are coming in increasing numbers — with more than 1 million arriving in the 12 months through May, a 17 per cent increase. They spent A$5.7 billion (RM15.9 billion) in 2014, a figure forecast to more than double to A$13 billion, said Tourism Australia. \nBiggest spender \nBut the country will need to do better to really capitalise on China, which last year is estimated to have surpassed the US as the world’s biggest spender on tourism. Australia’s hotels and resorts and their level of service are nowhere to be seen in TripAdvisor’s list of the world’s best. \n“Chinese visitors aren’t going to come here for hotels and resorts built in the 1980s and 1990s,” former Prime Minister Paul Keating said in e-mailed comments that expanded on a speech last week. “They will drift off to bigger and better things, along the lines of what’s being done in China itself and in countries like Vietnam.” \nWhile the lower currency is giving the industry a natural boost, the world has got a lot more competitive, he said. \n“We will have to lift the bar in terms of the quality of what we have to offer,” Keating said. “This will be a challenge for the next five to seven years given incomes in China will continue to rise and expectations with it. The capital stock in Australian tourism will require large increments.” \nTourism Australia recognised about four years ago the issues raised by Keating, according to the group’s managing director, John O’Sullivan. Since then, it has been marketing tourism projects to Chinese and Southeast Asian investors. \nIncreased competition \nHe cited Dalian Wanda Commercial Properties Co’s plans to invest about A$2 billion on Sydney and Queensland’s Gold Coast developments that include hotels and Sunshine Insurance Group Ltd’s purchase of Sydney’s Sheraton on the Park hotel. \n“That all said, we compete against 130 destinations in mainland China for their attention,” O’Sullivan said. “A lot of those places, like Singapore, like the US, have a lot of new properties coming online all the time.” \nAustralia earned A$18 billion from tourism exports in the year through June 2014, central bank research shows, making it one of the most valuable exports after iron ore and coal. Chinese tourism has also helped offset a more than halving of Japanese visitors in the past decade. \nCurrency tailwind \nAustralia’s currency has fallen more than 30 per cent against the US dollar in the past four years, increasing the spending power of tourists. \nYet, O’Sullivan said Tourism Australia’s research shows consumer confidence in the visitor’s home country is a bigger determinant in deciding to come to a country like Australia. He cites the US, where the economy’s return toward full employment has led to a spike in American visitors Down Under. \n“When they get here there’s obviously the impact of a favourable exchange rate, you’re more likely to spend more than you normally would have,” he said. “So it definitely provides a tailwind, but it’s not the primary driver.” \nEither way, Chinese visitors are big shoppers in Australia. \n“Chinese people love shopping in Australia, especially for health products, and brands like iPhone, shoes, handbags and make up,” said travel agent Cai. “In China, those things are much more expensive and people do not trust the quality in China as there are many fake products.” — Bloomberg More Stories for You:", "external_links": [], "published": "2015-07-24T05:41:00.000+03:00", "crawled": "2015-07-24T08:17:58.454+03:00", "highlightTitle": ""}