{"organizations": [], "uuid": "fee58ac69d7166cd772ba624b42d546ff30ee005", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/08/Gulf-Air1.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/gulf-air-brings-aaco-business-technology-forum-manama/", "country": "US", "title": "Gulf Air Brings AACO Business Technology Forum to ManamaTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Gulf Air Brings AACO Business Technology Forum to ManamaTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "fee58ac69d7166cd772ba624b42d546ff30ee005"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/gulf-air-brings-aaco-business-technology-forum-manama/", "ord_in_thread": 0, "title": "Gulf Air Brings AACO Business Technology Forum to ManamaTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gulf Air Brings AACO Business Technology Forum to Manama Published on : Wednesday, July 8, 2015\nGulf Air, the Kingdom of Bahrain’s national carrier, has announced it will be the official airline partner of the upcoming Arab Air Carriers’ Organization (AACO) Business Technology Forum that will be held in Manama, Bahrain on 5-6 October 2015. To be held under the theme of ‘Empowerment through Mobile Technology’, the forum promises to shed light on game-changing technology solutions and their positive impact on the passenger travel experience and the aviation industry as a whole.\nMr. Maher Salman Al Musallam, Gulf Air A/Chief Executive Officer spoke of the upcoming forum and Gulf Air’s support of it: “We are delighted to join forces with AACO – a key industry partner for Gulf Air – as they continue to strengthen partnerships and cooperation among Arab carriers in various fields. We welcome this industry event to Bahrain as a critical knowledge platform from which we can exchange tools and ideas on information technology and communications for the development of airlines performance and enhancement of the passenger experience.”\nMr. Abdul Wahab Teffaha, AACO Secretary General said: “With recent studies indicating that 97% of passengers travel with a mobile device we recognize the importance of utilizing this channel for continuous engagement and as a tool to further customize the passenger experience. Airports and airlines around the world have made significant investments in mobile services and this forum will shed light on further developments in future. We extend our sincerest thanks to Gulf Air for their invaluable support in hosting this forum in the Kingdom of Bahrain, and we also thank Rockwell Collins for being the primary sponsor of this forum.”\nAACO Business Technology Forum 2015 will bring together airlines, consultants, social media and mobile technology providers to highlight the prospects of available technology and what the providers have on their development agendas to empower airlines, airports and passengers with mobile technology. The forum will be a platform for AACO members and partners to share and discuss mobile technology and how best to deploy it to better serve the customer and meet the future prospects of this trend.\nAs a key national infrastructure asset, Gulf Air connects Bahrain to the world serving as a powerful driver for the economy and supporting the Kingdom’s ongoing economic growth. In line with this, Bahrain’s national carrier was, most recently, official carrier of 2015 Routes Middle East & Africa and has been Official Airline and Sponsor of the Gulf Air Bahrain Grand Prix ever since it made history as the first Formula One Grand Prix to be held in the Middle East in 2004. Gulf Air has also held the coveted title of Official Airline and Sponsor of the biennial Bahrain International Airshow since it was first held in 2010.\nRelated Posts Gulf Air Recognized at iTECH Gulf 2014 TripAdvisor touches mark of 100 million downloads for free app for iPhone and Android Qatar Executive To Exhibit At Leading Business Aviation Show In Dubai Gulf Air Suspends Sana’a Operations Antalya Gazipasa Airport opens new terminal building", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-08T20:05:29.000+03:00", "highlightTitle": ""}