{"organizations": [], "uuid": "42ccbea73f03e4fafb2c7f18d5a5e1ecab5b1ce0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/market_story_10_article_600px.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13199403/1/july-6-premarket-briefing-10-things-you-should-know.html?cm_ven=RSSFeed", "country": "US", "title": "July 6 Premarket Briefing: 10 Things You Should Know", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "July 6 Premarket Briefing: 10 Things You Should Know", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T16:12:00.000+03:00", "replies_count": 0, "uuid": "42ccbea73f03e4fafb2c7f18d5a5e1ecab5b1ce0"}, "author": "", "url": "http://www.thestreet.com/story/13199403/1/july-6-premarket-briefing-10-things-you-should-know.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "July 6 Premarket Briefing: 10 Things You Should Know", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated from 7:03 a.m. \nNEW YORK ( TheStreet ) -- Here are 10 things you should know for Monday, July 6: \n1. -- U.S. stock futures were sinking as investors tried to determine what Greece could do about its heavy debt load, and wondered how a default might harm the wider markets. \nEuropean markets opened sharply lower after the Greek people voted by a landslide to reject the austerity measures demanded by their eurozone and International Monetary Fund creditors. French and German leaders will meet later today to discuss the way forward, amid divisions about whether now to press for Greece's exit from the euro. Other eurozone leaders will likely come together tomorrow. London's FTSE 100 was down 0.59%, while in Paris the CAC 40 was down 1.32%. In Frankfurt, the DAX fell 1.09%. In Greece, the Athens General Index rose 2.03%. \nMust Read: Warren Buffett's Top 10 Dividend Stocks \nIn China, the Shanghai and Shenzhen indices roiled after the Chinese government announced measures to try to halt the three-week rout that has left the markets firmly in bear territory. The moves had mixed effect, as the Shanghai Composite finished the day up 2.4%, but Shenzhen was off 2.7%. \nTokyo's Nikkei 225 closed down 2.08%. In Hong Kong, the Hang Seng was down 3.18%. \n2. -- The economic calendar in the U.S. on Monday includes Gallup's U.S. consumer spending data at 8:30 a.m., the Purchasing Managers' Index for services at 9:45 a.m., and the ISM non-manufacturing index at 10 a.m. \n3. -- U.S. stocks on Thursday fell ahead of Greece's vote whether to accept European terms for much-needed debt relief. \nFriday was a market holiday to celebrate Independence Day. \nThe Dow Jones Industrial Average ( DIA ) dropped 0.16% to 17,730.11. The S&P 500 ( SPY ) shaved off 0.03% to 2,076.78. The Nasdaq ( QQQ ) edged downward 0.08% to 5,009.21. \n4. -- In Sunday's vote about whether to accept eurozone members' offer for debt relief -- and austerity measures -- Greeks voted no . The decisive vote, with 61% of voters against the bailout terms and 39% for, leaves Greece in a difficult position. The country cannot afford to pay its debts, yet it also seems unwilling to make the concessions needed for it to remain on the euro currency. \nAlexis Tsipras, the Greek prime minister, was elected on an anti-austerity platform. Now voters have reiterated that they oppose austerity measures. \nYanis Varoufakis, the combative finance minister, has also stepped down in an effort for Greece to make nice with its creditors. Varoufakis said he thought Greece would have a better chance at fresh negotiations without him. European negotiators have objected to his brash style. \nMeanwhile, an official at the European Central Bank said that Greece's debt to it cannot be restructured , according to ECB rules. \nThe question is what Greece will do now. That response will likely have a strong impact on market movements. \n5. -- Amazon ( AMZN - Get Report ) is trying to goose its online sales with Prime Day , a 20th anniversary sale that is focused on its subscription delivery service, Amazon Prime . The company said it would have more and better deals than on Black Friday, the biggest shopping day of the year. Amazon will hit age 20 on July 15. It charges $99 for Prime membership, which also includes access to streaming video content and some other perks. \nIn premarket trading, Amazon stock was tipping lower by 0.64%. \n6. -- Hedge fund Elliott Management has bought a stake in Samsung Fire & Marine Insurance , in what looks like a bid to prevent a merger between two other Samsung businesses. South Korea-based Samsung Fire & Marine holds shares in Samsung C&T , which Elliott wants to prevent from being bought by Cheil Industries , another Samsung-related business. \nSamsung's many subcompanies are in the midst of restructuring after the heart attack of Lee Kun-hee , its head. \n7. -- The open outcry futures trading pits at the Chicago Board of Trade will close after the trading day Monday , ending an era in the markets. Trading in the pits was producing less than 1% of trades, as most trading has migrated to computers. The agricultural pits will be turned into cubicles for rent to traders. \nCME ( CME - Get Report ) , formerly the Chicago Mercantile Exchange, merged with the Chicago Board of Trade in 2007. \nThe CBOT options pits will remain open, as they still see sufficient volume to make them worth maintaining. 1 of 2", "external_links": [], "published": "2015-07-06T16:12:00.000+03:00", "crawled": "2015-07-06T16:20:25.000+03:00", "highlightTitle": ""}