{"organizations": [], "uuid": "b1a6827c6df1bb0cc996df865186ff14aa311bf2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "budgettravel.about.com", "main_image": "", "site_section": "http://z.about.com/6/o/m/budgettravel_t2.xml", "section_title": "About.com Budget Travel: What's Hot Now", "url": "http://budgettravel.about.com/lw/Travel/Asia-and-Pacific-Rim/Seoul-on-a-Budget.htm", "country": "US", "title": "Seoul on a Budget", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Seoul on a Budget", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T14:04:00.000+03:00", "replies_count": 0, "uuid": "b1a6827c6df1bb0cc996df865186ff14aa311bf2"}, "author": "", "url": "http://budgettravel.about.com/lw/Travel/Asia-and-Pacific-Rim/Seoul-on-a-Budget.htm", "ord_in_thread": 0, "title": "Seoul on a Budget", "locations": ["Seoul"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Like most tourist meccas, Seoul offers plenty of opportunities to pay top dollar for things that won't necessarily enhance your trip. Here are some smart ways to enjoy Seoul on a budget. \nWhen to Visit: \nThe best times to visit Seoul are during the fall, when the heat of the summer abates, the weather is clear and dry and fall foliage is at its peak (usually in October); and during the spring, when temperatures warm up and the trees burst with colorful blossoms. Summers are hot and wet, with monsoon rains from the end of June to mid- to late July; the city is also crowded with tourists, and rates are at their highest. Find flights to Seoul \nGetting Around: \nPublic transportation in Seoul is reliable and inexpensive; the fastest and most efficient way to get around the city is by subway. A plus for Westerners: Subway station names and transit signs are marked in English, unlike the bus system, where all signage is written in hanguel (the Korean alphabet). You can buy rechargeable transportation cards for both subways and buses in subway stations and bus booths; the pre-paid fare is automatically deducted from the card every time you use it. \nTaxis are also relatively inexpensive and easy to find-you can hail one on the street or at one of the many taxi stands. Taxis cost 2,400 won ($2.15 USD) for the first 2 kilometers and 100 won (10 cents) for each additional 144 meters. \nWhere to Stay: \nIn this business-centric city, Seoul hotels see a lot of traffic during the week, so search for good deals on weekends. Consider staying in hotels just outside the downtown area; they tend to have lower rates. Seoul has plenty of upscale international brands, such as the Ritz-Carlton, the InterContinental and even a W, but it also has a number of midrange modern chains, including Marriott and Novotel. \nWhere to Eat: \nYou don't have to spend a lot of money to eat well in Seoul; in fact, if your budget is tight, you can subsist nicely on Korean comfort food (such as hearty soups and noodle or rice stir-fries) and street snacks. \nRice is a major staple of Seoul's cuisine, as are an array of vegetables, both fresh and fermented. Boiled rice ( bap ) and cooked veggies are served together in a big bowl in the classic bibimbap . Marinated meat barbecued at tableside grills ( bulgogi ) is another typical dish. \nA great place to eat in a festive atmosphere (and without breaking the bank) is on Let's Eat Alley, one of the many side streets off Sinchon Street, a vibrant university neighborhood with lots of shopping, dining and nightlife options. Sinchon Street is also a good place to find Korean street vendors selling tasty skewered fish cakes and rice rolls. \nSeoul Sights and Attractions: \nThe National Museum of Korea is the sixth-largest museum in the world, with 6.6 acres of exhibitions on 76 acres of land. The collection spans Paleolithic artifacts, stone pagodas, giant Buddhas and traditional Korean painting. Highlights include a gold crown studded with jade, the world's oldest printed scripture and ancient porcelain jars decorated with delicate brushwork. Note that admission is free on the fourth Saturday of each month. \nThe 14th-century Gyeongbokgung Palace, the oldest palace of the Joseon Dynasty, is set in a garden landscape that also holds the National Folk Museum of Korea. Admission to the palace is free to seniors age 65 and over and children under age six. \nMore Seoul Tips: Internet access is cheap, fast and widely available : Often called \"the most wired city in the world,\" Seoul is packed with wireless Internet (Wi-Fi) hotspots and cybercafes. Internet cafes/gaming areas (called \"PC bangs\") offer cheap ($1/hr) online access. High-speed Internet service is found in hotels, airports and train stations-even subway trains will be wired in the near future. Lost in translation: If you find yourself struggling to communicate, just call the BBB. The 2,400 volunteer members of the Before Babel Brigade are available by cell phone to help with translations in 17 different languages, including English. Call 1588-5644 and press the number listed for the language you need. Palms down, not up : When calling over a waiter or a service person, do so with your palms down, then flutter your hand up and down with your fingers touching. It's impolite to do so with your palms up, especially pointing with one finger-which is how Koreans summon their dogs. Save on gratuities : In general, tipping is not expected in South Korea, although Western-style tipping practices are trickling in at upscale restaurants, which may add a 10% service charge to the bill, and hotels, where it's advisable to tip porters around 100 to 500 won (10 to 50 cents) per bag. Call 120 for information : The Seoul Metropolitan Government has set up a telephone line to help visitors and international residents . Call 1-2-0 for information about local events and festivals, hotels, public transportation and other general questions about the city. Operators speak in English, Japanese, and Chinese. Related Articles", "external_links": [], "published": "2015-07-03T14:04:00.000+03:00", "crawled": "2015-07-03T18:01:05.000+03:00", "highlightTitle": ""}