{"organizations": [], "uuid": "e3fa8a9f9fc19c31bb2c608b6218f3addad05369", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03371/Gaokao-revamp_3371408a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-17.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/china-watch/society/11732022/chinese-gaokao-exams.html", "country": "US", "title": "Gaokao revamp to stress better English", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Gaokao revamp to stress better English - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T18:40:00.000+03:00", "replies_count": 0, "uuid": "e3fa8a9f9fc19c31bb2c608b6218f3addad05369"}, "author": "Tang Yue", "url": "http://www.telegraph.co.uk/sponsored/china-watch/society/11732022/chinese-gaokao-exams.html", "ord_in_thread": 0, "title": "Gaokao revamp to stress better English", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More Chinese news and features at telegraph.co.uk/chinawatch The most popular weekly publication in China isn't produced in Beijing or Shanghai, but in Taiyuan, the capital of Shanxi, a province better known for coal mining than literary endeavour. Nevertheless, with a circulation of 16 million, English Weekly is shaping the English skills of Chinese students like no other book or newspaper－its editions aimed at senior high-school students garner more than eight million readers a week, accounting for a third of all children in China's senior high schools. According to the editors of English Weekly , one of the reasons the paper is so popular is that the exercises it provides are based on its long experience of the gaokao, the national college entrance exam, and that can help give students the edge in the life-changing test. A recent edition aimed at grade-one senior high school students is a good example of the paper's output. Five of the eight pages contain tests, two focus on after-school reading, and the other features review lists of useful words and expressions. Some of the material is based on the textbooks the children use at school, but some comes from left field. “We always want to include more extracurricular material that will broaden the students' horizons and introduce more of the culture of the English-speaking world. But I'm afraid the teachers won't be happy, because their priority is to prepare the students for the gaokao,” Cao Yu, editor-in-chief of the senior high-school edition, said. Concentration: students reading English Weekly at a senior high school in Taiyuan Sun Xing, who is also an editor on the edition, said with a smile: “Sometimes my younger brothers and sisters tell me their classmates joke that I'm the one who gives them so many tests. They are tired of doing so many exercises, but they have no choice if they want to take the gaokao.” Now, though, English Weekly's editors are preparing for changes. Last September, the State Council, China's cabinet, released details of proposed reforms to the gaokao that will underline the importance of English in the exam. Students will also be allowed two bites at the cherry because they will be allowed to take the English test twice if they choose to do so－in January and June－and will be permitted to use the higher of the two scores as their gaokao English test result. The proposals also suggested long-term, continuing assessment of students' English language skills to indicate the full range of their ability. The proposals will be tested in two areas, Shanghai and Zhejiang province, but the reforms will not be expanded across the country until 2017. As yet, details of specific reforms in each province are unknown, but the English exam is widely expected to place greater emphasis on communication skills, a striking departure from the old days when－according to experts－too much attention was paid to grammar. The 2014 English Proficiency Index, compiled by Education First, a global English-language education company, estimated that the market for English teaching in China is worth about $7.5 billion a year. The index classified proficiency in English among Chinese people as \"low\", and China was ranked 37th out of the 64 countries in the list where English is not the mother tongue. By contrast, South Korea was ranked 24th, while Japan was 26th. Speaking skills Since March, English Weekly has been working with the British Council Beijing, which operates as the cultural and education section of the British Embassy, to prepare for the forthcoming reforms. They have invited experts from the UK to give personal tuition and online training related to designing tests to assess students' communication skills. “Testing is all about making inferences about real-life performance based on test performance. A good test is one for which we can defend the inferences made,” said Greg Selby, the British Council's director of examinations for East Asia. Liu Yongjun, English Weekly's deputy editor-in-chief, said that has rarely been the case in the history of English education and testing in China. “There was even dialogue like 'Are you a boy?', 'Yes, I am' in the test, something that would be obvious to any observer and not worth asking in the first place,” Liu said, adding that the authenticity and contextualisation of the tests have improved greatly over the years. However, a serious problem with the gaokao as it currently stands is the low level of testing of comprehension and speaking skills because only a few provinces include a listening test in their exam, while speaking skills are only tested in Guangdong province, or if a student wants to major in foreign-language studies. “Usually, when people say 'I know English', it means 'I can speak English', so it's kind of ironic that the most important component gets the least attention at the moment,” said Jeff Stanford, an applied linguist at the University of Leicester who lectures on the training programme. Beyond learning “[The lack of speaking tests] is common around the world, because they are difficult to set up and extremely costly. But if there was one change that could be achieved in the college entrance exam, it would be to include the speaking component, even if you start with the minimum, just a few sentences, then it will grow,” said the British national, who has worked at national English-testing centres in Tajikistan, Armenia and Lithuania. On a positive note, as one of two chosen pilot regions for gaokao reform, Shanghai plans to include a speaking test from 2017. When Stanford entered the English Weekly classroom in March, the first thing he did was rearrange the desks, which had been set out in formal rows, into small informal groups. \"One challenge posed by the teaching of communicative skills is that it asks students to be more responsible for their learning. From what I've read, teachers have a dominant role in the Chinese classroom and they are given so much respect,\" he said. Although the changes have been officially mooted, Cao Yu, the English Weekly editor, warned students and teachers not to expect too much too soon. Even though the reform is expected to drive the transformation of English-language education in China, the remaining bottlenecks in the classroom mean that change will not happen overnight. It's impossible to give every student a chance to speak up in class, so teachers have to be really creative to ensure the students practise after school Cao worked as an English teacher at a senior high school in Yangquan, Shanxi province, between 1992 and 2005. She said the classes were large - one of them had about 80 students - which makes teachers' workloads far heavier than those shouldered by their counterparts in China's big cities and Western countries. “It's impossible to give every student a chance to speak up in class, so teachers have to be really creative to ensure the students practise after school,” she said. However, when Cao was working at the chalkboard, not every teacher could speak good English, and she was only one of two teachers in her school who taught the students exclusively in English. “But at least the English textbook has started to include more up-to-date information about the real world; it used to be all about small animals or historical figures like Karl Marx, but now there are facts about the prevention of HIV,” the 46-year-old said. Yang Huiying, another editor at English Weekly , was also eager to modernise the information provided to students, so in addition to simply using stories about the history of the Olympic Games when sport is featured in the paper, she sometimes also includes pieces about Western sports, such as baseball. “It probably won't appear in the gaokao, but I think learning more about the culture of the English-speaking world will really help the students to communicate with native speakers and the outside world. After all, that's why we learn languages in the first place, isn't it?” she said. This article was originally produced and published by China Daily. View the original article at www.chinadaily.com.cn • Read more about Chinese current affairs at China Watch", "external_links": [], "published": "2015-07-17T18:40:00.000+03:00", "crawled": "2015-07-17T13:02:32.000+03:00", "highlightTitle": ""}