{"organizations": [], "uuid": "def764f4f9a7ef1af5cb1ee05372c82c6882db6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/cq5dam.web_.press_.722.keepaspectratio3.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/shot-lifetime-preeminent-surf-photographer-peter-joli-wilson-four-seasons-resort-maldives-kuda-huraa/", "country": "US", "title": "A Shot of a Lifetime with Preeminent Surf Photographer Peter \"Joli\" Wilson at Four Seasons Resort Maldives at Kuda HuraaTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "A Shot of a Lifetime with Preeminent Surf Photographer Peter \"Joli\" Wilson at Four Seasons Resort Maldives at Kuda HuraaTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "def764f4f9a7ef1af5cb1ee05372c82c6882db6a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/shot-lifetime-preeminent-surf-photographer-peter-joli-wilson-four-seasons-resort-maldives-kuda-huraa/", "ord_in_thread": 0, "title": "A Shot of a Lifetime with Preeminent Surf Photographer Peter \"Joli\" Wilson at Four Seasons Resort Maldives at Kuda HuraaTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Four Seasons Resort Maldives at Kuda Huraa to host photoshoot by Peter “Joli” Wilson Published on : Thursday, July 16, 2015\nAs prime surfing season approaches, Four Seasons Resort Maldives at Kuda Huraa announces that world famous Australian photojournalist Peter “Joli” Wilson will be making the island paradise – and surf hub – his base for the months of July and August 2015. As a rare opportunity, and truly unique service, Kuda Huraa guests will be able to hire Joli’s highly-sought after, award-winning photographic skills to capture their best surfing moments both in spirit and print.\nHosted in conjunction with surf pros Tropicsurf, and prelude to the Resort’s Champions Trophy and Domestic Champions Trophy events, the arrival of Joli is firmly cementing Kuda Huraa’s status as the coolest surf scene in the Maldives.\nMark Winson of Tropicsurf comments, “We’re stoked to once again partner with Kuda Huraa to make surfing greatness happen! Joli’s shots are fantastic. He’s been shooting the best surfers in the world for more than 30 years, in demand by leading magazines, surf brands and pros alike. This is sell-out stuff – keen surfers better get in there quickly!”\nJoli’s experience behind the lens is unsurpassed in the industry and the catalyst for the lifelong friendships he shares with world champions such as Kelly Slater, Sunny Garcia and Mick Fanning. His professional photography career has seen him traverse the globe capturing nature and culture, in addition to the sphere of surfing. Joli has followed his passion in a variety of photographic permutations – from working at Backdoor Surfing Magazine; to surf brand Quiksilver as advertising and promotional manager; taking PR shots for the Australian Defense Force; following Prime Ministers, rock stars and even the Dalai Lama; holding the position of head photographer at Deakin University; andsetting up Joli Productions with his wife Jan.\nJoli attributes his early interest in photography to his grandfather – a successful amateur filmmaker and photographer – whose surname, Jolly, was the inspiration behind naming his freelance venture Joli Productions; in his words, “Jolly with a French twist.” From processing his first black and white film at age 14 (that included an image of him holding a surfboard) to working for a perfectionist German photographer for nearly two years before being allowed to take a single shot, Joli’s enthusiasm for the art of photography hasn’t waned, enabling him to carve his own line as one of surfing’s greats. Joli photographs have graced magazines, websites and books; been exhibited around the world; and won numerous awards – and now they can grace the holiday albums of Kuda Huraa’s guests too.\nSource:-Four Seasons\nRelated Posts 40% reduction in room rates in Grand Hyatt Taipei in July and August Express your love this Valentine’s Day at Calabash Cove Resort & Spa Melia Hotels International becomes a partner of the World Community Grid, initiative sponsored by IBM Jumeirah Creekside Hotel raises the bar on sustainability standards Hyatt Place Columbia/Downtown/The Vista Celebrates Opening", "external_links": [], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-17T11:14:16.000+03:00", "highlightTitle": ""}