{"organizations": [], "uuid": "df517c876dcb09739fe628531b54583656dd411a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.zawya.com", "main_image": "http://images.zawya.com/images/ui/img-logo-zawya.png", "site_section": "http://www.zawya.com/rssfeeds/tourism.xml", "section_title": "Zawya.com - Travel & Tourism News", "url": "http://www.zawya.com/story/Dubai_Summer_Surprises_2015_to_begin_on_July_23-GN_01072015_020733/", "country": "AE", "title": "Dubai Summer Surprises 2015 to begin on July 23", "performance_score": 0, "site": "zawya.com", "participants_count": 0, "title_full": "Dubai Summer Surprises 2015 to begin on July 23", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T07:13:00.000+03:00", "replies_count": 0, "uuid": "df517c876dcb09739fe628531b54583656dd411a"}, "author": "", "url": "http://www.zawya.com/story/Dubai_Summer_Surprises_2015_to_begin_on_July_23-GN_01072015_020733/", "ord_in_thread": 0, "title": "Dubai Summer Surprises 2015 to begin on July 23", "locations": ["Thailand", "Dubai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thailand launches Muslim-friendly tourist app \nWednesday, Jul 01, 2015 \nDubai: Dubai Summer Surprises (DSS) is back in its 18th edition to entertain residents and visitors from July 23-September 5. \nDubai Festival and Retails Establishment (DFRE), an arm of the Department of Commerce and Tourism Marketing, unveiled the calendar of events for the 45 days of celebration that promise family entertainment for all. \nUnder an exciting slogan, ‘45 days Of Summer’, DSS 2015 is offering residents and visitors from around the world the opportunity to enjoy a diverse range of events, from international celebrity appearances and shows to world premieres featuring internationally renowned children’s cartoon characters, in addition to the summer promotions that will reward shoppers with millions of dirhams worth of prizes. Among the celebrities who will arrive in Dubai to celebrate DSS are Jaden and Willow Smith, Nancy Ajram and Arab teen star Hala Turk, while global entertainment concepts such as Bugs Bunny, Tweety & Sylvester, Power Rangers, Sonic the Hedgehog and Gumball will be launching their world premieres during this year’s family extravaganza.\nLaila Mohammad Suhail, Chief Executive Officer of DFRE, said: “Since its inception in 1998, DSS has capitalised on the city’s rapid development and growing prosperity to become a summer festival that has set a retail benchmark in the region and played a major role in transforming the challenging summer into a fruitful and lucrative season across Dubai’s main sectors. With its focus on families and children, DSS has no doubt helped position Dubai as the place to be for the perfect summer holiday and would add to the efforts that are being made to realise Dubai’s Tourism Vision 2020. All this would not have been possible without the strong support of our partners in the private sector, a level of collaboration that is further evident in the number of retail promotions that will be run this summer in Dubai.” Staff Report \nGulf News 2015. All rights reserved. © Copyright Zawya. All Rights Reserved.", "external_links": [], "published": "2015-07-02T07:13:00.000+03:00", "crawled": "2015-07-02T07:43:49.000+03:00", "highlightTitle": ""}