{"organizations": [], "uuid": "6a04d74c9ad221d0de59413339277770ca5e65ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150712ChapoGuzmanTunnel.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/07/12/undermining-mexico-how-el-chapo-built-a-criminal-empire-and-escaped-prison-by-digging-deep", "country": "US", "title": "Undermining Mexico: How 'El Chapo' built a criminal empire, and escaped prison, by digging deep", "performance_score": 0, "site": "ticotimes.net", "participants_count": 2, "title_full": "Undermining Mexico: How 'El Chapo' built a criminal empire, and escaped prison, by digging deep -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T09:06:00.000+03:00", "replies_count": 1, "uuid": "6a04d74c9ad221d0de59413339277770ca5e65ad"}, "author": "Nick Miroff | THE WASHINGTON POST", "url": "http://www.ticotimes.net/2015/07/12/undermining-mexico-how-el-chapo-built-a-criminal-empire-and-escaped-prison-by-digging-deep", "ord_in_thread": 0, "title": "Undermining Mexico: How 'El Chapo' built a criminal empire, and escaped prison, by digging deep", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Joaquín “El Chapo” Guzmán built the world’s most powerful drug trafficking organization by digging — quietly, efficiently, patiently.\nWhile he used his money and corrupting influence to burrow into the highest reaches of Mexico’s government, Guzmán deployed engineering brigades and construction crews to develop the perfect smuggling system: the drug tunnel.\nMore than 100 have been discovered along the United States-Mexico border since the 1990s, and it’s no accident that they are almost entirely in California and Arizona — the western border region where Guzmán’s Sinaloa cartel remains the supreme criminal power.\nThe tunnel Guzmán allegedly used Saturday to escape from Mexico’s Altiplano maximum security prison certainly ranks among his organization’s most impressive engineering feats, if only for the length — nearly a mile long — and its location.\nThough many of Mexico’s most notorious and dangerous drug bosses are held at Altiplano, built in 1990, none has escaped until now.\nSee also: Adiós, El Chapo\nMexican authorities said Sunday that the tunnel Guzmán used to escape led from a hole under his shower area and about 35 feet down a ladder, where it continued horizontally. There was no need for Guzmán to crawl: The passage was taller than the 5-foot-6 Guzmán, more than roomy enough for him to run through standing up.\nThough it is difficult to imagine Guzmán’s accomplices digging under the prison for so long while avoiding detection, his engineers have been doing it for years right under the noses of U.S. border agents and their sophisticated technology.\nThese tunnels are not the dark, dirty caverns one might imagine. They are well-lit corridors with structural reinforcement and ventilation systems. The most advanced have rails and little carts for quickly shuttling drugs, guns, cash, people and practically anything else from one end to the other.\nOne tunnel busted earlier this year by U.S. agents near Bisbee, Arizona, was tall enough for an adult to walk through standing up. It even had a hydraulic lift to spare the traffickers from backache.\nThe border versions typically start in a home or warehouse on the Mexican side and end in another building in the United States. At border crossings like Nogales, or near Otay Mesa, south of San Diego, tunnel-building is facilitated by the fact that structures on either side of the border are separated by short distances.\nThe tunnel-builders hide earth they remove within the structure on the Mexican side, or carry it out quietly in vehicles, carefully mapping their trajectory to avoid being caught or making too much of a ruckus.\nThe tunnels are viewed as a major security threat by U.S. Homeland Security, though there is no evidence to date that the versions operated by Mexican traffickers have been used by terrorist groups.\nDrug-tunnel engineers are believed to use compasses to guide them, not GPS devices, which wouldn’t function underground because they depend on satellite guidance. Still, even the most advanced burrowers would need detailed knowledge of the prison’s design in order to find their way to under its walls and right to Guzmán’s cell.\nThe one Guzmán used to sneak out of prison is not the first built far from the border. A few days before Guzmán’s capture in 2014 , he evaded Mexican authorities by escaping into the sewers of Culiacan, Sinaloa’s capital, after slipping down a shaft through a safe house bathroom.\n© 2015, The Washington Post", "external_links": [], "published": "2015-07-13T09:06:00.000+03:00", "crawled": "2015-07-14T05:22:39.000+03:00", "highlightTitle": ""}