{"organizations": [], "uuid": "cab843a86ce161e094573ee50a139674c9f89c25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/28133ea095213092b91553d084e609060013535e/c=0-163-3000-1858&amp;r=x633&amp;c=1200x630/local/-/media/2015/07/16/Phoenix/Phoenix/635726834301591901-TrumpHeatedRhetoric.jpg", "site_section": "http://www.azcentral.com/travel-explore/", "section_title": "Phoenix Arizona Travel Guide, Hotels, Sightseeing - azcentral.com ", "url": "http://www.azcentral.com/story/laurieroberts/2015/07/21/donald-trump-president-republican-party-polls/30465313/", "country": "US", "title": "Breathe America, Donald Trump will slump on the stump (eventually)", "performance_score": 0, "site": "azcentral.com", "participants_count": 1, "title_full": "Breathe America, Donald Trump will slump on the stump (eventually)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T18:08:00.000+03:00", "replies_count": 0, "uuid": "cab843a86ce161e094573ee50a139674c9f89c25"}, "author": "Laurie Roberts", "url": "http://www.azcentral.com/story/laurieroberts/2015/07/21/donald-trump-president-republican-party-polls/30465313/", "ord_in_thread": 0, "title": "Breathe America, Donald Trump will slump on the stump (eventually)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Des Moines Register this morning did Donald Trump a favor and called for him to drop his campaign for president.\n\"Trump, by every indication, seems wholly unqualified to sit in the White House,\" the newspaper said. \"If he had not already disqualified himself through his attempts to demonize immigrants as rapists and drug dealers, he certainly did so by questioning the war record of John McCain, the Republican senator from Arizona.\"\nI'm guessing that'll be worth another three to five points in the polls.\nIn favor of Trump, that is.\nLike it or not – and most of the media and political establishment do not like it at all – Trump has caught fire with a sizable segment of Republican voters.\nThe latest Washington Post-ABC News poll puts him ahead of the pack with 24 percent of Republicans and GOP-leaning independents favoring him – though most of that poll was done before Trump declared that Arizona Sen. John McCain's no war hero. The numbers are remarkable when you consider that he polled at 4 percent in late May. Trailing him are Wisconsin Gov. Scott Walker (13 percent), former Florida Gov. Jeb Bush (12) and a cast of thousands seeking the GOP nomination.\nTo the consternation of many, Trump's numbers seem to go up every time he opens his mouth. Somehow, I don't think it's because of The Apprentice or that killer comb-over.\nMaybe it's because the media is focused on him, driving his numbers ever skyward. More likely, he's tapping into deep-seated frustration over what's going on in Washington.\nOr more specifically, what isn't going on.\nFor years, illegal immigration has been a huge problem yet our leaders can't seem to address the problem in a logical, rational way.\nFor years, veterans have been treated like second-class citizens when it comes to health care yet our leaders have allowed it go on.\nNow along comes Trump on the stump – with no political polish, no political talking points and an exceedingly big mouth.\nHe is certainly not afraid to offend. He says what he thinks and what he thinks resonates with a sizable number of Republican voters.\nWill he win? Nah. No one really wants this guy's finger on the nuclear launch codes. He's Sarah Palin with a bankroll.\nBut Trump is delivering a message to the rest of the pack. People are sick of the same old politicians who utter the same old talking points then go to Washington and do the same old thing.\nNothing, that is.\nOf course, eventually, Trump will slump on the stump. Everybody loves a good circus act but after a while, the call of the calliope grates on your nerves.\nThe question is, who will take his place at the top of the GOP heap – and once the spotlight moves, will they have anything to say?", "external_links": [], "published": "2015-07-21T18:08:00.000+03:00", "crawled": "2015-07-21T20:16:54.467+03:00", "highlightTitle": ""}