{"organizations": [], "uuid": "39d775c937e1324aee191c3336549d29fe16b9fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/07/046c3d43402049a08286f97eb3001fbf-1200x1200.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/nation-world/eruption-of-indonesian-volcano-sparks-travel-chaos/", "country": "EU", "title": "Eruption of Indonesian volcano sparks travel chaos", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Eruption of Indonesian volcano sparks travel chaos | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T06:18:00.000+03:00", "replies_count": 0, "uuid": "39d775c937e1324aee191c3336549d29fe16b9fb"}, "author": "NINIEK KARMINI", "url": "http://www.seattletimes.com/nation-world/eruption-of-indonesian-volcano-sparks-travel-chaos/", "ord_in_thread": 0, "title": "Eruption of Indonesian volcano sparks travel chaos", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BALI, Indonesia (AP) — Ash spewing from a volcano on Indonesia’s main island of Java sparked chaos for holidaymakers as airports closed and international airlines canceled flights to tourist hotspot Bali, stranding thousands.\nMount Raung in East Java province, about 150 kilometers (95 miles) from Bali’s international airport, has been rumbling for several weeks. The level of activity increased in the past week and on Friday it blasted ash and debris 3,800 meters (12,460 feet) into the air.\nGovernment volcanologist Gede Suantika said the eruption forced authorities to close five airports due to the risks posed by volcanic ash, though two airports on Lombok island reopened Friday afternoon. The Transport Ministry told airlines to avoid routes near the mountain. It said a decision about reopening other airports would be made later Friday.\nSuantika said lava and ash fall from the 3,332-meter (10,930-feet) -high mountain on Indonesia’s most densely populated island also caused the government to urge people to stay away from a three-kilometer (two-mile) -high danger zone around the volcano.\n Evacuation of residents living near the volcano is still considered unnecessary, but authorities are urging people to wear masks.\nVolcanic eruptions can cause significant and lengthy disruption to travel. A 2010 eruption of Iceland’s Eyjafjallajokul volcano produced an ash cloud that caused a week of international aviation chaos, with more than 100,000 flights canceled.\n“Ash can clog engines and harm other parts of the aircraft,” said Transport Ministry spokesman Julius Adravida Barata.\nAirports on the islands of Bali and Lombok as well as airports at Banyuwangi and Jember in East Java were closed late Thursday. Barata said thousands of travelers were stranded.\nFlights within Indonesia were already overbooked as tens of millions of the country’s Muslims pour out of major cities to return to their villages during an annual mass exodus to celebrate the end of the Islamic holy month.\nThe volcano has proven particularly problematic for Australians, who flock to Bali during Australia’s school holidays.\nDozens of flights between Australia and Bali’s Ngurah Rai airport by Australian carriers Jetstar and Virgin Australia have been canceled over the past week, with the airlines citing safety concerns.\nBoth carriers said they are looking into adding extra flights between Australia and Bali when conditions improve to help clear the backlog.\nAt Bali’s international airport, many travelers arrived not knowing about the eruption and flight cancellations. The airport blocked access to ticket counters, adding to the confusion.\nSome tourists slept on benches or stood at flight information boards filled with “postponed” and “delayed” notifications. Others complained of a lack of information about their delayed flights.\n“The airline can’t tell us if we’re going to be here tonight or fly tomorrow or the next day,” said Charmaine Scott, an Australian holidaymaker.\n“This is really difficult for us. We have to basically find some way to stay.”\nShe said that she and her husband hadn’t heard about the eruption and flight cancellations until they arrived at the airport on Friday morning.\nRaung is among about 130 active volcanoes in Indonesia. The archipelago is prone to volcanic eruptions and earthquakes because of its location on the Pacific “Ring of Fire,” a series of fault lines stretching from the Western Hemisphere through Japan and Southeast Asia.\nAnother Indonesian volcano, Mount Sinabung in Sumatra, has been erupting for two months, forcing the evacuation of more than 10,000 people.\n___\nKarmini reported from Jakarta, Indonesia. Associated Press writer Kristen Gelineau in Sydney contributed to this report.\nHAVEN DALEY", "external_links": [], "published": "2015-07-10T06:18:00.000+03:00", "crawled": "2015-07-10T14:18:22.000+03:00", "highlightTitle": ""}