{"organizations": [], "uuid": "884877180586cf384dd208facbedeba588ec6cd4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/7/e4f49b87-9405-4c79-b84b-cf8f2b4498edMediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Wellness", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/wellness/successful-sociable-people-more-prone-to-harmful-drinking/article1-1372727.aspx", "country": "US", "title": "Successful, sociable people more prone to harmful drinking", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Successful, sociable people more prone to harmful drinking", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T15:10:00.000+03:00", "replies_count": 0, "uuid": "884877180586cf384dd208facbedeba588ec6cd4"}, "author": "", "url": "http://www.hindustantimes.com/wellness/successful-sociable-people-more-prone-to-harmful-drinking/article1-1372727.aspx", "ord_in_thread": 0, "title": "Successful, sociable people more prone to harmful drinking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "| Updated: Jul 24, 2015 17:44 IST Higher risk of harmful drinking is not linked to feelings of loneliness or depression but it is more likely among men living on their own, including those who are separated or divorced. (Shutterstock Photo) \nSuccessful, healthy and sociable 50-year-olds are more prone to harmful drinking than their less successful peers, according to a new research. \nHarmful drinking may be a hidden health and social problem in successful older people, and a middle-class phenomenon, the researchers say. \n\"We can sketch the problem of harmful drinking among people aged 50 or over as a 'middle class phenomenon'. These are healthy people with higher income, higher educational attainment, socially more active and are more likely to drink at harmful levels,\" the authors write in the BMJ Open journal. \nHigher risk of harmful drinking is not linked to feelings of loneliness or depression but it is more likely among men living on their own, including those who are separated or divorced. \nCaring responsibilities lowers the probability of being at higher risk among women, but religious belief does not - for either sex. \nEmployment status does not seem to be a significant factor but retired women are more likely to be at higher risk, the study notes. \nIncome is associated with a higher risk but only among women while smoking, higher educational attainment and good health are all linked to heightened risk in both sexes. \nThe authors analyse over 9000 responses to the English Longitudinal Survey of Ageing (ELSA) - a long term study of a representative sample of those aged 50 and above, living independently at home in England. \nThey use national guidance to define increasing risk of harmful drinking at 22-50 weekly units for men and 15 to 35 weekly units for women. \n\"The results show that the current group of over 50s may be carrying on levels of higher consumption, developed in their younger years, in later life,\" the researchers conclude. Tags", "external_links": [], "published": "2015-07-24T15:10:00.000+03:00", "crawled": "2015-07-24T18:05:26.620+03:00", "highlightTitle": ""}