{"organizations": [], "uuid": "d227d60aa51e851bf7110ae6df618a763e78a225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.financialexpress.com", "main_image": "http://www.financialexpress.com/wp-content/uploads/2015/07/BSE-Sensex-PTI-2-S.jpg", "site_section": "http://www.financialexpress.com/section/lifestyle/travel-tourism/", "section_title": "Travel News:Travel and Tourism,Latest Travel News,Tourism News Today,Latest Travel News Articles | The Financial Express", "url": "http://www.financialexpress.com/article/markets/indian-markets/market-outlook-bse-sensex-nse-nifty-likely-to-go-up-on-tcs-earnings-new-greek-proposals/98341", "country": "IE", "title": "Market Outlook: BSE Sensex, NSE Nifty likely to go up on TCS earnings, new Greek proposals", "performance_score": 0, "site": "financialexpress.com", "participants_count": 1, "title_full": "Market Outlook: BSE Sensex, NSE Nifty likely to go up on TCS earnings, new Greek proposals | The Financial Express", "spam_score": 0.0, "site_type": "news", "published": "2015-07-10T16:22:00.000+03:00", "replies_count": 0, "uuid": "d227d60aa51e851bf7110ae6df618a763e78a225"}, "author": "financialexpress.com", "url": "http://www.financialexpress.com/article/markets/indian-markets/market-outlook-bse-sensex-nse-nifty-likely-to-go-up-on-tcs-earnings-new-greek-proposals/98341", "ord_in_thread": 0, "title": "Market Outlook: BSE Sensex, NSE Nifty likely to go up on TCS earnings, new Greek proposals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The BSE Sensex and NSE Nifty extended their rout in last session ignoring some positive comments by international agencies and bucking global trend.\nToday, the start is likely to be flat-to-positive and traders will first react to the numbers of Tata Consultancy Services (TCS), whose net profit declined by 3.3% sequentially to Rs 5,709 crore in the April-June quarter. The company’s revenue guidance missed estimates for the fourth straight quarter.\nThe whole IT pack is likely to remain under pressure with TCS’ muted earnings. However, markets are likely to stabilize and move higher in latter part of trade, with an IMF report that India will be the world’s fastest growing economy for the second consecutive year in 2016 at 7.5 percent.\nIMF has retained India’s growth projection for current year at 7.5 percent which will be higher than China’s 6.8 percent.\nTraders will also be getting some encouragement with Finance Ministry statement that the negotiations on the double taxation avoidance agreement (DTAA) between India and Mauritius are in advanced stage and the pact would be revised soon. Marketmen will also be eyeing the Industrial production data slated to be announced later in the day.\nThe auto stocks are likely to remain under pressure with Society of Indian Automobile Manufacturers (Siam) reporting that car sales in June grew 1.53% from a year ago, the slowest in eight months.\nAsian shares and the euro gained on Friday as investors took heart from strength in recently volatile Chinese markets, and after Greece’s offer of a new reform plan raised hopes of a deal at a weekend summit of European leaders.\nOn Thursday, BSE benchmark Sensex fell over 114 points to close at almost a three-week low of 27,573.66 despite a recovery in global financial markets. The 50-share Nifty lost 34.50 points, or 0.41 per cent, to end at 8,328.55. Intra-day, it moved between 8,400.30 and 8,323.\nWorld market\nNEW YORK: US stocks closed higher on Thursday after Wall Street found relief in Beijing’s efforts to halt a rout in Chinese stocks, which lifted markets around the world.\nThe Dow Jones industrial average ended up 0.19 percent, while the S&P 500 rose 0.23 percent and the Nasdaq Composite ended up 0.26 percent.\nLONDON: Britain’s top equity index moved further away from this week’s six-month lows on Thursday, lifted by well-received results from Associated British Foods and Barratt Developments.\nTOKYO: The Nikkei share average rose on Friday morning as surging China markets eased worries, but gains were capped by sharp losses in Fast Retailing Co on its weak domestic sales outlook for the current quarter.\nThe Nikkei share average rose 0.4 percent to 19,939.07 points in midmorning trade after opening lower. For the week, the Nikkei has shed 3.0 percent.\nHONG KONG: Hang Seng Index up 1.94 percent.\n 8:22 am © The Indian Express Online Media Pvt Ltd", "external_links": [], "published": "2015-07-10T16:22:00.000+03:00", "crawled": "2015-07-10T15:26:06.000+03:00", "highlightTitle": ""}