{"organizations": [], "uuid": "8fe88e7f503f66604f35ef9a95921781191983a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtTWQ==", "section_title": "Business Wire Travel: Lodging News", "url": "http://www.businesswire.com/news/home/20150714006179/en/FelCor-Announces-Sale-Non-Strategic-Hotels", "country": "US", "title": "FelCor Announces Sale of Three Non-Strategic Hotels", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "FelCor Announces Sale of Three Non-Strategic Hotels", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T23:07:00.000+03:00", "replies_count": 0, "uuid": "8fe88e7f503f66604f35ef9a95921781191983a8"}, "author": "", "url": "http://www.businesswire.com/news/home/20150714006179/en/FelCor-Announces-Sale-Non-Strategic-Hotels", "ord_in_thread": 0, "title": "FelCor Announces Sale of Three Non-Strategic Hotels", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FelCor Announces Sale of Three Non-Strategic Hotels July 14, 2015 04:07 PM   \nIRVING, Texas- FelCor Lodging Trust Incorporated (NYSE: FCH) today announced that it sold the 274-room Embassy Suites Charlotte (which was owned 50% in a joint venture), the 216-room Embassy Suites San Antonio-NW I-10 and the 260-room Embassy Suites Austin-Central for aggregate gross proceeds of $90 million. FelCor is using asset sale proceeds to repay outstanding debt. \nFelCor has nearly completed its portfolio repositioning plan, with 38 non-strategic hotels sold for aggregate gross proceeds of $884 million. FelCor has executed contracts to sell the two remaining non-strategic hotels (both of which have non-refundable deposits) and expects to sell both in the third quarter of this year. \nAbout FelCor \nFelCor, a real estate investment trust, owns a diversified portfolio of primarily upper-upscale and luxury hotels that are located in major and resort markets throughout the U.S. FelCor partners with leading hotel companies to operate its hotels, which are flagged under globally renowned names and premier independent hotels. Additional information can be found on the Company's website at www.felcor.com . \nWith the exception of historical information, the matters discussed in this news release include “forward-looking statements” within the meaning of the federal securities laws that are qualified by cautionary statements herein and in FelCor’s filings with the Securities and Exchange Commission. We undertake no obligation to update any forward-looking statement to conform the statement to actual results or changes in our expectations. Contacts", "external_links": [], "published": "2015-07-14T23:07:00.000+03:00", "crawled": "2015-07-15T00:32:34.000+03:00", "highlightTitle": ""}