{"organizations": [], "uuid": "47a4f4c884e7048af3bbeb34ee4f1efdaa75cf48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150728CecilZimbabwe.jpg", "site_section": "http://www.ticotimes.net/categories/animal-cruelty-2", "section_title": "Animal cruelty Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/28/us-dentist-named-as-killer-of-zimbabwes-beloved-cecil-the-lion", "country": "US", "title": "US dentist named as killer of Zimbabwe's beloved Cecil the lion", "performance_score": 0, "site": "ticotimes.net", "participants_count": 3, "title_full": "US dentist named as killer of Zimbabwe's beloved Cecil the lion -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T05:47:00.000+03:00", "replies_count": 3, "uuid": "47a4f4c884e7048af3bbeb34ee4f1efdaa75cf48"}, "author": "Fanuel Jongwe | AFP", "url": "http://www.ticotimes.net/2015/07/28/us-dentist-named-as-killer-of-zimbabwes-beloved-cecil-the-lion", "ord_in_thread": 0, "title": "US dentist named as killer of Zimbabwe's beloved Cecil the lion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HARARE, Zimbabwe – A wealthy U.S. dentist used a bow and arrow to shoot a much-loved Zimbabwean lion called Cecil, a safari industry group said Tuesday, amid allegations that the animal had taken 40 hours to die.\nThe lion, which was a popular attraction among international visitors to the Hwange National Park , was lured outside the park’s boundaries by bait and shot earlier this month.\n“The offender is a gentleman who is an American called Walter James Palmer,” Emmanuel Fundira, president of the Safari Operators Association of Zimbabwe, said at a news conference in the capital Harare.\n“A lot of people travel long distances coming to Zimbabwe to enjoy our wildlife and obviously the absence of Cecil is a disaster.”\n(Google Maps)\nFundira described Cecil as “almost semi-domesticated” and said that Palmer had paid about $50,000 for the hunt.\nThe Zimbabwe Conservation Task Force charity said Palmer and professional Zimbabwean hunter Theo Bronkhorst had gone out at night with a spotlight and tied a dead animal to their vehicle to lure Cecil into range.\n“Palmer shot Cecil with a bow and arrow but this shot didn’t kill him. They tracked him down and found him 40 hours later when they shot him with a gun,” the charity alleged.\nIt added that the hunters unsuccessfully tried to hide the dead lion’s tracking collar, which was part of a University of Cambridge research program.\n“Cecil was skinned and beheaded. We don’t know the whereabouts of the head,” the charity alleged.\nCecil, aged about 13, was said by safari operators to be an “iconic” animal who was recognized by many visitors to Hwange due to his distinctive black mane.\nHwange attracted 50,000 visitors last year, about half of them from abroad.\nFierce criticism\nBronkhorst and local landowner Honest Ndlovu will appear in court in Victoria Falls on Wednesday to face poaching charges.\n“Both the professional hunter and land owner had no permit or quota to justify the offtake of the lion and therefore are liable for the illegal hunt,” the Zimbabwean Parks Authority said in a statement Tuesday. “[They] are being jointly charged for illegally hunting the lion.”\nThe statement made no mention of Palmer, but added that Bronkhorst’s son Zane was also wanted for questioning.\nPalmer is an experienced trophy hunter from Minnesota.\nHe is well-known in U.S. hunting circles as an expert shot with his bow and arrow, and has traveled across the world in pursuit of leopards, buffalo rhino, elk and other large mammals.\nPalmer, who reportedly pleaded guilty in 2008 to poaching a black bear in Wisconsin, said he had “relied on the expertise of my local professional guides to ensure a legal hunt.”\n“I deeply regret that my pursuit of an activity I love and practice responsibly and legally resulted in the taking of this lion,” Palmer said in a statement Tuesday. “I had no idea that the lion I took was a known, local favorite, was collared and part of a study until the end of the hunt.”\nThe Twitter and Facebook accounts and website of his dental practice — River Bluff Dental in a suburb of Minneapolis, Minnesota — were shut down Tuesday after being flooded with blistering attacks.\nSome hunting of lions and other large animals is legal in countries such as South Africa, Namibia and Zimbabwe, where permits are issued allowing hunters to kill certain older beasts that are beyond breeding age.\nIt is outlawed in Zimbabwe’s national parks.\n“We use hunting as a conservation tool,” Fundira said. “Hunting is only based on animals which have been vigorously checked in terms of qualifying.”\nThe Zimbabwe Conservation Task Force said Cecil had cubs, which were likely to be killed by the lion that took over in the group’s hierarchy.\nIn May, a Texan hunter shot an elderly black rhinoceros in Namibia after buying a government-issued licence for $350,000.", "external_links": ["http://www.zimparks.org/"], "published": "2015-07-29T05:47:00.000+03:00", "crawled": "2015-07-30T05:21:50.050+03:00", "highlightTitle": ""}