{"organizations": [], "uuid": "44cf74bc258c7ca9be01070b6e11c14126fb4c92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/travel.html", "section_title": "Travel", "url": "https://www.prbuzz.com/travel/337609-detours-gay-adventure-travel-announce-their-new-spanish-group-trips-2016.html", "country": "US", "title": "Detours Gay Adventure Travel Announce Their New Spanish Group Trips 2016", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "Detours Gay Adventure Travel Announce Their New Spanish Group Trips 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "44cf74bc258c7ca9be01070b6e11c14126fb4c92"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/travel/337609-detours-gay-adventure-travel-announce-their-new-spanish-group-trips-2016.html", "ord_in_thread": 0, "title": "Detours Gay Adventure Travel Announce Their New Spanish Group Trips 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "One of the leading Gay Adventure Tour Operators is adding a new destination to their popular trips by including Spain. It gives people looking for fun and adventures a total of five holiday destinations to experience fun and relaxation.\nDetours Travel, the Gay Adventure Tour Operator has announced they are launching a 5th destination with 12-day group trips starting in Spain in May 2016. The new destination will give their loyal customers more adventure holiday destinations to choose from.\nThe popular Gay Adventure Tour Operator already provides trips to Thailand, Costa Rica, Greece and Peru, and with 4 Spanish trips in 2016 they have become one of the leading international gay tour operators.\nSpain has so much to offer from the stunning architecture, romantic cities, white sandy beaches, great food, and amazing sports that include water sports and rock climbing. The Detours trips will give people the chance to experience everything that Spain has to offer. The new Spain 12-day trips will give travellers the chance to experience the wonders of Barcelona, Granada, Seville and Sitges. With so much fun on offer, 12 days may not seem long enough.\nA spokesman for Detours Travel said: “Our newly announced trips will continue with the same travel concept that has made us one of the leading international gay tour operators. We are more about fun and spontaneity than about a rigid daily structure.”\nWhen booking one of the four trips to Spain, there is a choice between a shared room and a single occupancy room. With the low prices and the popular destinations included in the new 12-day trip experience, Detours has warned places will be filled quickly.\nDates for the new Spanish trips in 2016 are\nMay 8th, 2016 – May 19rh 2016\nMay 21st, 2016 – June 01st 2016\nAugust 21st, 2016 – September 1st, 2016\nOctober 2nd, 2016 – October 13th, 2016\nThe price for the trip is $2190 and includes All Taxes, land transportation within Spain, Accommodations, breakfast during the stay, Group travel within Spain, Barcelona and Seville city tours.\nFor more information on the new Detours Gay Adventure Travel destination, please visit http://www.detourstravel.com or call 1-800-680-8066\nAbout Detours Gay Adventure Travel\nDetours Gay Adventure Travel has become one of the leading international tour operators. They provide value for money and great destinations to visit.", "external_links": [], "published": "2015-07-16T03:00:00.000+03:00", "crawled": "2015-07-16T18:09:32.000+03:00", "highlightTitle": ""}