{"organizations": [], "uuid": "a5fcb248968b46de3f22e4a14e69339ccc93f3df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tripideas/volterra-tuscanys-top-hill-town/ar-AAdzBpe", "country": "US", "title": "Volterra: Tuscany's top hill town", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Volterra: Tuscany's top hill town", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "a5fcb248968b46de3f22e4a14e69339ccc93f3df"}, "author": "Rick Steves, Tribune Content Agency", "url": "http://www.msn.com/en-us/travel/tripideas/volterra-tuscanys-top-hill-town/ar-AAdzBpe", "ord_in_thread": 0, "title": "Volterra: Tuscany's top hill town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Volterra: Tuscany's top hill town Tribune Content Agency 21 hrs ago Rick Steves, Tribune Content Agency © Rick Steves, Rick Steves’ Europe On Volterra’s Etruscan arch, three seriously eroded heads show what happens when you leave something outside for more than 2,000 years. © Cameron Hewitt, Rick Steves’ Eur Beautifully preserved, Volterra is small enough to be mostly traffic-free, yet big enough to have good sightseeing and plenty of restaurants. Just a two-hour drive from jammed-with-tourists Florence, you'll find what is perhaps Italy's most underrated hill town -- Volterra. With rustic vitality and surprising depth, its out-of-the-way location keeps it from being trampled by visitors.\nUnlike other famous Tuscan towns, Volterra feels real, vibrant and almost oblivious to the allure of the tourist dollar. Centuries past its prime, Volterra seems to have settled into a well-worn groove; locals are resistant to change. At a recent town meeting about whether to run high-speed Internet cable to the town, a resident grumbled, \"The Etruscans didn't need it -- why do we?\"\nEmbracing the past (along with all that Tuscan sunshine), Volterra offers the best sightseeing of all of Italy's small hill towns. Follow me with your traveler's imagination on a walk through this stony wonder, and you'll marvel -- like me -- at why there are almost no tourists here.\nIts Etruscan Museum is filled top to bottom with rare artifacts of the mysterious people whose mix of Greek-style art with Roman-style customs created a foundation for the rise of the Roman Empire. And Porta all'Arco, the Etruscan arch built of massive stones in the 4th century B.C., serves as a stately reminder of Volterra's time as a key trading center.\nThrough the arch lies Via Porta all'Arco, a steep, atmospheric lane lined with shops featuring the work of artisans and producers. Volterra has a tradition of craftsmanship, and you'll find a rich variety of handiwork, including alabaster, jewelry, etchings and bronze work.\nAt the top of Via Porta all'Arco lies Volterra's main square, Piazza dei Priori. It's dominated by the Palazzo dei Priori (City Hall), said to be the oldest of any Tuscan city-state, built about 1200. A horizontal \"cane\" cut into its wall served as the local yardstick for the town market, which was held on the square for a thousand years. Facing City Hall is the Duomo, a church whose simple 13th-century facade conceals a more intricate interior (rebuilt in the late 16th and 19th centuries).\nNearby, the town's main drag, Via Matteotti, illustrates centuries of retrofitting. At number 12, you'll find a line of doorbells on a typical palace wall; it was once the home of a single rich family and is now occupied by many middle-class families. After the social revolution in the 18th century and the rise of the middle class, former palaces were condominium-ized. Even so, the original family still lives here.\nA block off the main drag behind stone walls, Palazzo Viti's interior shows how the wealthy lived -- in this case, rich from 19th-century alabaster trade. With 12 rooms on one floor open to the public, Palazzo Viti feels remarkably lived in -- because it is. You'll often find Signora Viti herself selling admission tickets; behind the ropes you'll see intimate family photos. Your visit ends in the cellar with a short wine tasting.\nPast Palazzo Viti is the Pinacoteca and Alabaster Museum, filling a 15th-century palace with fine Florentine-esque paintings. Next to the museum, a tunnel-like passage leads you to a place where you can access the city wall. Walk along the 13th-century wall for a fine aerial view of the Roman Theater (there's no reason to pay to enter). Around the third century A.D., the town began to use the theater stones to build fancy baths instead. You can see the scant remains of the baths behind the theater, including the little round sauna in the far corner with brick supports that raised the heated floor.\nMore ruins -- the remains of the acropolis -- can be seen from Volterra's Archaeological Park. The acropolis stood here from 1500 B.C. until A.D. 1472, when Florence conquered the pesky city. The Florentines burned Volterra's political and historic center, turning it into a grassy commons and building the adjacent Medici Fortress. A symbol of Florentine dominance, it now keeps people in rather than out -- it's a prison for maximum-security inmates. The park sprawling next to the fortress (toward the town center) is a rare, grassy meadow at the top of a rustic hill town -- a favorite place for locals to relax and picnic on a sunny day.\nAt night, Volterra is pretty quiet. As they have for generations, Volterrans young and old stroll during the cool of early evening. Join in, or head to an \"enoteca\" for a glass of Tuscan wine. For a little excitement in summer, you can venture just outside the wall to La Pista, a Tuscan family-friendly, beer garden kind of hangout that includes a DJ on weekends.\nVolterra might be short on famous paintings and fast-paced nightlife, but Italy's hill towns are best enjoyed by noticing the little things and adapting to the pace of the countryside. So, slow ... down ... and savor the delights of the region -- there are plenty in my favorite Tuscan hill town.\nIF YOU VISIT...\nSLEEPING: Hotel La Locanda rents 18 stately, old-fashioned rooms in Volterra's old town (splurge, www.hotel-lalocanda.com ). Albergo Etruria, right on the main drag, offers a warm welcome and a peaceful rooftop garden (moderate, www.albergoetruria.it ).\nEATING: Try La Carabaccia for a family-meal feel and classic Tuscan comfort food (Piazza XX Settembre 4, tel. 0588-86239). A cheap lunch spot by day and a fancier restaurant at night, La Vecchia Lira is a classy self-serve eatery that's a hit with locals (Via Matteotti 19, tel. 0588-86180).\nGETTING AROUND: Volterra is compact and walkable. While the main square and main drag are fairly level, be prepared for a steep climb everywhere else.\nTOURIST INFORMATION: www.volterratur.it .\n(Rick Steves ( www.ricksteves.com ) writes European travel guidebooks and hosts travel shows on public television and public radio. Email him at rick@ricksteves.com and follow his blog on Facebook.)\n ", "external_links": [], "published": "2015-07-28T03:00:00.000+03:00", "crawled": "2015-07-29T04:28:51.861+03:00", "highlightTitle": ""}