{"organizations": [], "uuid": "df25ef5c32aaa36a6db5ca7db818000761e31a12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1259", "section_title": "Travel Trade Gazette - Destinations", "url": "http://www.ttgdigital.com/toolkit/walking-on-water/4697747.article", "country": "GB", "title": "Walking on water", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Walking on water", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T11:00:00.000+03:00", "replies_count": 0, "uuid": "df25ef5c32aaa36a6db5ca7db818000761e31a12"}, "author": "", "url": "http://www.ttgdigital.com/toolkit/walking-on-water/4697747.article", "ord_in_thread": 0, "title": "Walking on water", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Save \n﻿Firmly in the hearts of the Queen and other repeat guests, Hebridean Princess’s Footloose itineraries offer the chance to attract new ramble-loving clients onboard. Helen Ochyra laces up her boots to combine hiking and cruising \nWe can go to places other ships can’t get to”, says captain Trevor Bailey. One of these places is the Shiant Islands, and I am preparing myself for a beach landing on these Hebridean islets this morning, chatting casually with the captain as the tender is readied. \nWithin minutes I am zipping across the Atlantic waters and strolling down a gangplank on to the pebble beach. Our walking guide John takes us up the tufty grass slopes of this uninhabited privately owned island, pointing out sea eagles and native plants as we go. At the top I turn around and see the ship that brought us here, the Hebridean Princess, moored amid the seacliffs, puffins and fulmars wheeling overhead. \nI am spending a week onboard, cruising out from Oban, the ship’s home port, on a Footloose walking cruise - and it is fabulous. It doesn’t matter if the Scottish weather turns and I get soaked on a hike across Skye; my cabin has a bathtub and all the hot water I can use. It doesn’t matter if I return to the ship hungry from exploring the standing stones of Lewis; there is afternoon tea waiting and a three-course dinner ahead. And it doesn’t matter if I am just too tired for a hike one day; there is always an alternative “strolling” option, to visit a castle perhaps, or to shop for Harris Tweed. \nThis flexibility is the beauty of the Hebridean Princess. With an almost one-to-one crew-to-guest ratio nothing is too much trouble, whether that is extra pancakes for breakfast or all the maps and advice you could ask for to go off on an independent walk or bike ride. \nI make use of this to put together a ride across the Uists, calling in at stone circles and viewpoints over the expansive watery scenery before meeting up with the crew and other guests for lunch, a buffet bulging with juicy prawns the crew had come ashore to serve. They surprise us on Lewis another day too, unfurling picnic rugs and dishing up hot stew followed by strawberries and cream on Dail Mor beach. Loyal clientele \nGiven this attention to detail it is no surprise that so many of the guests are repeat customers. I speak to people who have already been onboard once before this year, and to guests who are in their ﻿20-something year of cruising with Hebridean Princess. Many even have a favourite cabin (perhaps for its location near the lounge or its private balcony) and will only cruise when it is available. \nThis ex-Cal Mac car ferry was overhauled in 1989 and launched by Hebridean Island Cruises as the smallest luxury cruise ship afloat. It is so luxurious that the Queen chartered it to celebrate her 80th birthday and awarded it a Royal Warrant. \nI certainly feel like royalty on gala dinner night. On a seven-night itinerary there are two of these, falling on the second and the last nights on my cruise, and they see guests and crew dress up in black tie and national dress. Of course in these parts that means kilts, but it is not just the kilts swishing around the Tiree Lounge that make Hebridean Princess so quintessentially Scottish. It is the tweed furnishings, it is the Borders lamb and Oban langoustines, and it is the vast range of whiskies lined up behind the bar. \nI ask hotel manager Iain Gibson for help in choosing a wee dram and discover that he grew up on Islay, Scotland’s whisky isle. He suggests peaty Islay whiskies I should try and helps me choose my favourite, a Lagavulin 16, which is a mouthful of woody peat and salty seawater. It is the perfect accompaniment to the gloaming, that peculiarly Scottish time of day when the sky glows dark blue before sunset, and the live music from a local folk band which has joined the ship for the evening. Passengers I haven’t seen interacting before are up on their feet, twirling their partners and dancing with the crew, and the party goes on well into the night. \nHebridean Princess spends much of its time in Scotland, cruising the Hebrides, the Islands of the Clyde and the Northern Isles, but it also makes its way further south occasionally and this summer will visit the Channel Islands, England’s south coast and even Normandy. \nMy heart belongs to the Hebrides though and captain Bailey can barely disguise his love either. “The west coast of Scotland is just fantastic and if you ask me what’s my favourite place, it’s wherever we are when you ask me that question,” he says. \nI know what he means. I fall for Lewis, then Benbecula, then Harris. And on the final day it is Rum that has my heart racing. This time literally, as we leap over puddles and pick our way through the bog to reach a waterfall gushing down the side of this rugged isle managed by Scottish Natural Heritage. As I sit on a rock and scan the sky for sea eagles and the hillside for red deer, I can just make out Hebridean Princess in the waters below. Without it I doubt I would ever have made it here, or to Harris where I spotted the solitary red deer of the week, or to the Shiants and their puffins. It truly does get its guests to places other ships can’t. There is no other ship like it. \nBook it : Hebridean Princess will cruise out on three Footloose itineraries in 2016. From April 26 Footloose through the Inner Isles calls at Rum, Eigg and Skye among others (from £5,300); from June 14 Hebridean Princess returns to the Outer Hebrides (from £6,240); and from July 30, it will cruise the Far North from £6,020. Prices include all activities, meals and gratuities.", "external_links": [], "published": "2015-07-03T11:00:00.000+03:00", "crawled": "2015-07-03T11:17:37.000+03:00", "highlightTitle": ""}