{"organizations": [], "uuid": "d34148169876c7154bbf5b202d7a296177409367", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deseretnews.com", "main_image": "http://img.deseretnews.com/images/article/hires/1575052/1575052.jpg", "site_section": "http://deseretnews.com/family/travel/index.rss", "section_title": "Deseret News - Daily travel articles, news and headlines for Salt Lake City and Utah | deseretnews.com", "url": "http://www.deseretnews.com/article/765678515/Beijing-selected-to-host-2022-Winter-Olympics.html", "country": "US", "title": "Beijing selected to host 2022 Winter Olympics", "performance_score": 0, "site": "deseretnews.com", "participants_count": 0, "title_full": "Beijing selected to host 2022 Winter Olympics", "spam_score": 0.0, "site_type": "news", "published": "2015-07-31T15:17:00.000+03:00", "replies_count": 0, "uuid": "d34148169876c7154bbf5b202d7a296177409367"}, "author": "", "url": "http://www.deseretnews.com/article/765678515/Beijing-selected-to-host-2022-Winter-Olympics.html", "ord_in_thread": 0, "title": "Beijing selected to host 2022 Winter Olympics", "locations": ["Beijing"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mark Schiefelbein"], "text": "Published: Friday, July 31 2015 6:15 a.m. MDT Updated: 9 minutes ago Participants celebrate following the announcement that Beijing will host the 2022 Winter Olympics at a gathering outside the Beijing Olympic Stadium, also known as the Birds Nest, in Beijing, Friday, July 31, 2015. Mark Schiefelbein, Associated Press Summary \nBeijing was selected Friday to host the 2022 Winter Olympics, defeating the bid from Almaty in a surprisingly close vote to become the first city awarded both the winter and summer games. \nKUALA LUMPUR, Malaysia — Beijing was selected Friday to host the 2022 Winter Olympics, defeating the bid from Almaty in a surprisingly close vote to become the first city awarded both the winter and summer games. \nBeijing won the secret vote of the International Olympic Committee by 44-40, with one abstention. The vote was conducted by paper ballot, after the first electronic vote experienced technical faults with the voting tablets. \nThe Chinese capital, which hosted the 2008 Summer Olympics, came in to the vote against the city from Kazakhstan as the strong favorite, despite its lack of natural snow. \nBeijing was seen by IOC members as a safe, reliable choice that also offered vast commercial opportunities in a new winter sports market of more than 300 million people in northern China. \n\"They chose certainty in Beijing,\" IOC vice president Craig Reedie of Britain said. \"But I don't think anybody would have believed that the result would have been that close.\" \nAlmaty had hoped to bring the games to Central Asia for the first time, but was a lesser-known quantity and viewed as a riskier choice by IOC members. Kazakh Prime Minister Karim Massimov made a last-minute impassioned plea for the IOC to be \"brave\" and give the games to his country, but it wasn't quite enough. \n\"Gee, you wouldn't have picked that close result a few months ago,\" IOC vice president John Coates of Australia said. \"That address by the prime minister today was brilliantly crafted. I think that's why it got close. But the size of China, the number of people that are going to be introduced to winter sport now, those were all factors.\" \nThe contest was a study in contrasts between the world's most populous nation and a former Soviet republic seeking to establish itself on the world stage. China's political and economic might was a big advantage against its northwestern neighbor, which became independent in 1991. \n\"Just as with the Beijing 2008 Summer Games, the Olympic Family has put its faith in Beijing again,\" the bid committee said. \"This will be a memorable event at the foot of the Great Wall ... that will further enhance the tremendous potential to grow winter sports in our country, in Asia and around the world.\" \nAlmaty bid vice chairman Andrey Kryukov said the city would consider bidding again. \n\"One thing I can say is Almaty was ready to host the 2022 Winter Games,\" he said. \nIn Beijing, the news was greeted with lion dancers and confetti canons at a staged government pep rally at the Bird's Nest stadium attended by about 500 preselected participants. \nIn Almaty, about 1,000 people gathered on a square to hear the result, including many students and government employees who said they had been ordered to attend by officials. When it was announced that Beijing had won, the crowd scattered almost immediately and the event came to a close with no speeches from officials. \nBeijing and Almaty had both been considered longshots when the 2022 bid race opened two years ago. But they were the only two candidates left after four European cities — including Oslo and Stockholm — pulled out for political or financial reasons. \nBeijing plans to use several venues from the 2008 Olympics, including the Bird's Nest and Water Cube arenas. But the snow and sliding events would be at venues in Yangqing and Zhangjiakou, 60 and 140 kilometers (40 and 90 miles) outside Beijing. A planned high-speed rail line to Zhangjiakou is supposed to cut travel time to 50 minutes. \nChina's mountain venues also rely heavily on man-made snow, which was considered one of the bid's main weaknesses and one that was the target of Almaty's \"Keeping it Real\" slogan. Almaty is surrounded by towering mountains and plenty of natural snow, but Beijing bid leaders insisted they have sufficient water supplies and snow-making equipment for ideal skiing conditions. \nThe vote came after final 45-minute presentations by each bid city. \nAlmaty was bidding for a second time, but this was the first time it made it to the vote after being cut in the preliminary stage for the 2014 Games. \n\"Almaty is not a risky choice for 2022,\" Massimov told the IOC delegates. \"In fact, we are quite the opposite. ... We are a golden opportunity to prove that smaller, advancing nations can successfully host the Winter Games.\" \nBeijing's presentation played much less on emotion and sought mainly to reinforce the pitch that China can be counted on to deliver, as it did for the IOC in 2008. AP Sports Writer Dennis Passa in Kuala Lumpur and Associated Press writers Christopher Bodeen in Beijing and Leila Saralayeva in Almaty contributed to this report. Recommended Stories", "external_links": [], "published": "2015-07-31T15:17:00.000+03:00", "crawled": "2015-07-31T15:29:17.384+03:00", "highlightTitle": ""}