{"organizations": [], "uuid": "114dd6d15056f37ef0822430ba16b3f4e3a81e48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/virgin-cruises.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/kuala-lumpur-convention-centre-carries-csr-drills/", "country": "US", "title": "Virgin Cruises to launch with midsize cruise ship from Miami", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Virgin Cruises to launch with midsize cruise ship from Miami", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T11:32:00.000+03:00", "replies_count": 0, "uuid": "f784596cd06c619dac433d485e0b227497337a48"}, "author": "Devansh Keshan", "url": "http://www.travelandtourworld.com/news/article/virgin-cruises-launch-midsize-cruise-ship-miami/", "ord_in_thread": 0, "title": "Virgin Cruises to launch with midsize cruise ship from Miami", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  CRUISE NEWS » Virgin Cruises to launch with midsize cruise ship from Miami Virgin Cruises to launch with midsize cruise ship from Miami   \nVirgin Cruises is set to sail from Miami in 2020 with a 2800-passenger cruise. A new cruise ship is being built by Italian based, European shipbuilder giant Fincatieri. Virgin Cruises to launch first of three cruises in 2020 and this will be followed by the other two 2800-passenger cruises in the year 2021 and 2022. \n\n\nThis announcement was made at a media event organized in Miami. Since it was a press conference organized by the ‘Virgin” group, it was extraordinary. The founder of Virgin group Richard Branson, was seen wearing a skipper’s hat arrived in great style at the downtown Miami’s Museum Park via a helicopter surrounded by a cloud of ‘Virgin-red’ smoke. \n\n\nSir Richard Branson tweeted,”I have dreamed of building cruise ships… since I was 27 years old” with hashtags #virgincruises #letsmakewaves. \n\nFincantieri said that the agreement is subject to customary conditions and is supposed to go down in the fourth quarter. Financial details were not released but Sir Richard Branson said the cost for the three cruises would be fewer than 2 billion dollars. \n\n\nBain Capital is the lead financial partner of Virgin Cruises and the Managing Director of Bain Capital said that their target is a large unnerved consumer segment, which is young at heart and adventurous; the ones who understand the excitement in cruising but haven’t yet found a home on the seas. The ships are scheduled to go for 7-day Caribbean cruises, but the exact itinerary was not disclosed. These cruises can house 2800 passengers and is considered in the midsize category. The ships are still being designed so Virgin Cruises has asked its consumers to go on the Virgin Cruises website to add their suggestions as to what they want to see and experience when they are on a Virgin Cruise ship. Related Posts", "external_links": [], "published": "2015-07-01T11:32:00.000+03:00", "crawled": "2015-07-01T13:02:54.000+03:00", "highlightTitle": ""}