{"organizations": [], "uuid": "89d11ed6719ec695ca7ce6da3be518eca6f88050", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/02928/Wimbledon_2928132k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-03.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/men/the-filter/10869472/10-things-no-one-tells-you-before-you-go-to-Wimbledon.html", "country": "US", "title": "10 things no one tells you before you go to Wimbledon", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "10 things no one tells you before you go to Wimbledon - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-03T23:23:00.000+03:00", "replies_count": 0, "uuid": "89d11ed6719ec695ca7ce6da3be518eca6f88050"}, "author": "Dave Whitehead", "url": "http://www.telegraph.co.uk/men/the-filter/10869472/10-things-no-one-tells-you-before-you-go-to-Wimbledon.html", "ord_in_thread": 0, "title": "10 things no one tells you before you go to Wimbledon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wimbledon is quite unlike any other tennis competition in the world. It’s a cross between a refined garden party and a no holds-barred, screaming, grunting, cursing display of machismo and ... whatever the female equivalent is. Fechisma? As a self-confessed American, I readily admit to feeling completely out of my depth in this hallowed sanctuary of grass, tradition, blazers, officials, rules, more rules, incessant rain and strawberries. And I haven’t even started on the rigorous dress code for the players, or the lines (sorry ‘queues’) yet. And then, of course, there’s the Royal Box. So let’s start there. 1. Don’t expect an invite to the Royal Box For visitors from a republic, the idea of a box full of royal people is a source of fascination and wonder. Why are these royal people in a box? Why can’t they sit outside this box? Who are they anyway? Where’s the Queen? Is that Princess Kate in the sunglasses and the billowing skirt? Is that Princess Pippa’s bottom? Who are those girls in the silly hats? Are they with the Duke of Yorkshire Pudding? Who’s the ginger guy scanning the babes among the spectators through his military issue binoculars? Why haven’t I got an invitation? Is there a game of tennis going on? You can see the potential for distraction. 2. Wimbledon is a long way from your hotel, or anywhere else in London The club at SW19 can be reached by bus, train, or tube from central London. The first option takes the better part of the Wimbledon fortnight to reach its destination, the second rarely works, and the third requires you to sit in stifling conditions for up to an hour at ruinous expense. Whichever option you plump for, you stand a good chance of being asphyxiated and/or suffering permanent psychological damage en route. You could walk the 8 miles or so to Wimbledon from Piccadilly, and it might take marginally less time than the bus or taxi (give or take a day or so), but your best bet is to pitch a tent on Wimbledon Common. It’s a public park for common people – so the likelihood of meeting royals in an adjoining tent is slim. 3. There is another Wimbledon You might find yourself attempting to gain entrance to an establishment called The Wimbledon Lawn Tennis Club. It won’t be the one you’re looking for. In fact, it’s a much humbler club virtually next door to the club where The Wimbledon Championships are held which is called the All England Lawn Tennis and Croquet Club, founded some 32 years after its less illustrious neighbour. Confused? Understandable. But you’ll know which is which, because one won’t have a queue outside. 4. You have to pay to watch a TV screen You might turn up to Wimbledon wanting to soak up a bit of atmosphere by joining the throngs on Murray Mound (née Henman Hill). This is a bit of high ground adjoining Court No 1, which has a big screen on the outside wall, and is the place to go if you don’t have tickets for Centre Court. But don’t expect to sit there for nothing. You still have to buy a ground admission ticket for about £20. If you'd rather earmark that £20 for beer money, forget about getting into the grounds and head to the Dog & Fox in Wimbledon Village, which shows the action on its own big screen TV. Murray Mound 5. The strawberries are a rip-off You know that lovely olde Englande tradition of eating scrumptious strawberries and cream at ‘Wimblers’? Well, it’s not that olde at all – and the strawberries aren't that scrumptious. Still, it’s all part of the experience, rather liking eating sugar-on-a-stick at the seaside. Just don’t expect to get change from a fiver. 6. You have to queue for queues The British are famed for their queuing prowess and jump at any opportunity for form one. So, there will be queues to get onto your preferred choice of transport to get to the tournament, queues to get into the grounds, queues to get into the courts, queues for refreshments, queues for toilet facilities, queues to join a queue, queues to leave a queue, etc. A day at Wimbledon is all about the tennis, but your main memory may be more about the queues. 7. Tickets are available on the day for the show courts It’s true. Wimbledon remains one of the few major sporting competitions in the world where you can turn up on the day and buy a ticket to one of the big showpiece events. But what nobody tells you at Wimbledon is that your only chance of getting one is by sleeping overnight in (yes, you guessed it) a queue of people in tents. However hard you try, you’ll almost invariably find yourself next to a nutter in a Union Jack jester hat with a worrying stare. Wimbledon tickets are available via Telegraph Tickets 8. There are queue monitors That’s right. There are volunteers who get to wear Wimbledon-logo’d jackets who tell you where to pitch your tent. Then they give you a ‘queuing card’ (this is to stop you saving a place for 20-or-so friends who are down the pub.) Once you have a card, you can leave your tent to go the pub – but you have to be back by 10pm sharp. 9. Reveille is at dawn Stewards will start kicking down your tents and shouting ‘Raus! Raus!’ at 6am. Actually, that's a slight exaggeration. They’ll be terribly polite, saying things: “I say, would you mind awfully packing up your tent, finishing your tea, and joining another queue?” Then, blinking and rubbing your eyes, you’ll find yourself shepherded off to join a queue to leave your gear at the left-luggage tent. Cost £5. 10. There are actually tennis matches being played! Hurrah, you’re finally in. And there is actually some pro tennis going on. But nobody tells you to ignore the show courts. Instead, take some advice and head for the unfashionable courts where the most cheering can be heard. At a rough guess that’ll mean that one or more of the following players is on court and being enthusiastically supported: anyone British, anyone considered an underdog, any former champions, and generally anyone who’s a bit rubbish. Dave Whitehead is the author of The Bluffer’s Guide to Tennis, £6.99. Bluffers.com Follow @TelegraphMen", "external_links": [], "published": "2015-07-03T23:23:00.000+03:00", "crawled": "2015-07-04T04:21:50.000+03:00", "highlightTitle": ""}