{"organizations": [], "uuid": "69643e9c5b848fa885047ea3a22fffbbae6b1918", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61503/munich-airport-sets-records-first-half-2015", "country": "US", "title": "Munich Airport sets records in first half of 2015", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Munich Airport sets records in first half of 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T21:15:00.000+03:00", "replies_count": 0, "uuid": "69643e9c5b848fa885047ea3a22fffbbae6b1918"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61503/munich-airport-sets-records-first-half-2015", "ord_in_thread": 0, "title": "Munich Airport sets records in first half of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Munich Airport sets records in first half of 2015 Adv: \nJul 16, 2015 Adv: \nMUNICH, Germany - Munich Airport achieved growth in all traffic segments in the first half of 2015. The 19.4 million passengers passing through the airport in the first six months of the year – 3.5 percent more than in the same period in 2014 – represented yet another record in Munich. \"As we announced in January, we're well on the way to topping the 40 million mark for the first time in a calendar year,\" said Dr. Michael Kerkloh, the President and CEO of Munich Airport at the Munich Press Club today. \nAfter three years of declining figures, the number of take-offs and landings are back on track for growth, with a 1.1 percent increase to more than 186,000 aircraft movements in the first half of the year. As various airlines complete their fleet transitions to larger aircraft, the gap between growth rates in passenger numbers and aircraft movements is beginning to close. Consequently, the airlines operating in Munich responded to the continuing growth in travel demand in the first half of the year by adding new flights. Michael Kerkloh sees this development as an \"important turning point\". \nWith its appealing and extensive network of destinations, the Munich hub is attracting steadily increasing numbers of passengers, especially on intercontinental routes. For the first time ever, this traffic segment exceeded the 3 million passenger mark in the first half of the calendar year. The result also represents a 5 percent increase over the same period in 2014. Services within Europe were used by about 11.6 million passengers: a year-on-year gain of 3 percent. Domestic traffic was also up by 3 percent to approximately 4.7 million passengers. \nGrowth in the air cargo business at Munich Airport in the first half of 2015 was even more robust than in the passenger segment. The total of 156,000 tons of flown airfreight represented an impressive 12 percent year-on-year gain in the volume of goods handled at the airport. \nIn view of the dynamic growth trend and against the backdrop of yesterday's ruling on Munich Airport's third runway project by the Federal Administrative Court, Dr. Kerkloh said that it is time to set the stage to develop the airport in line with demand. This will ensure that \"the mobility needs of the public and the business sector in Bavaria can also be met in the coming years and decades,\" he concluded. \nBreakdown of traffic figures for the first half of 2015: \n2015 2014 Change", "external_links": [], "published": "2015-07-16T21:15:00.000+03:00", "crawled": "2015-07-16T21:44:37.000+03:00", "highlightTitle": ""}