{"organizations": [], "uuid": "2e5aeff43ab3f0a04ca1bebc2069d2a49bc1bab4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/Airberlin.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/qatar-airways-lands-spice-island-zanzibar/", "country": "US", "title": "airberlin and NIKI offer flights to Colombo with oneworld partner", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "airberlin and NIKI offer flights to Colombo with oneworld partner", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T13:39:00.000+03:00", "replies_count": 0, "uuid": "d25c985fa1d961153bf9a012897a58c3614fe33a"}, "author": "Sudipto Roy", "url": "http://www.travelandtourworld.com/news/article/airberlin-niki-offer-flights-colombo-oneworld-partner/", "ord_in_thread": 0, "title": "airberlin and NIKI offer flights to Colombo with oneworld partner", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  AIRLINE NEWS » airberlin and NIKI offer flights to Colombo with oneworld partner airberlin and NIKI offer flights to Colombo with oneworld partner   \nSriLankan Airlines, the national airline of Sri Lanka, is the new codeshare partner of airberlin and NIKI. The three airlines are to operate daily codeshare flights between Germany, Austria and Sri Lanka via Abu Dhabi, which can be booked as of now. \nairberlin and NIKI will apply their flight numbers to SriLankan Airlines’ daily flights between Abu Dhabi and Colombo. SriLankan Airlines guests can now book airberlin and NIKI flights between Berlin-Tegel and Abu Dhabi and between Vienna and Abu Dhabi as a result of the codeshare agreement. \n“Sri Lanka is a fascinating tourist destination that attracts visitors with its beaches and culture. Especially among German holidaymakers it is becoming increasingly popular, as evidenced by the ever-growing visitor numbers of recent years. We’re therefore relying on our new codeshare partner and are confident that there will be strong demand for these flights in German-speaking countries”, said Stefan Pichler, CEO airberlin. \n“Holidaymakers and business travellers from Berlin and Vienna alike will benefit from our codeshare with airberlin and NIKI by making use of the fast and convenient daily flights operated by SriLankan between Abu Dhabi and Colombo. And we are also convinced that our partnership will provide a boost for tourism between Sri Lanka, Germany and Austria” said Lal Perera, Head of Worldwide Sales of SriLankan Airlines. \nHe further stated, “Germany is one of the mainstays of our European operations for decades. These new flights will create more travel options for a greater flow of travellers from the gateways in Berlin and Vienna to Sri Lanka and also citizens from Sri Lanka can now fly to these cities with seamless connectivity”. \nThe new codeshare with airberlin and NIKI will add a third destination in Germany as well as the Austrian capital of Vienna to the Airline’s global network. \nairberlin and NIKI also offer flights to Colombo under their codeshare agreement with Etihad Airways. In total, travellers can therefore choose from three daily services from Abu Dhabi to Colombo. Related Posts", "external_links": [], "published": "2015-07-02T13:39:00.000+03:00", "crawled": "2015-07-02T14:01:04.000+03:00", "highlightTitle": ""}