{"organizations": [], "uuid": "036761ecb80937aa31a90c09d067c5952532e725", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/27817-the-grand-mansion-a-luxury-collection-hotel-nanjing-is-unveiled-in-china-s-intriguing-ancient-city", "country": "US", "title": "The Grand Mansion, a Luxury Collection Hotel, Nanjing is unveiled in China’s intriguing ancient city", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "The Grand Mansion, a Luxury Collection Hotel, Nanjing is unveiled in China’s intriguing ancient city", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T11:20:00.000+03:00", "replies_count": 0, "uuid": "036761ecb80937aa31a90c09d067c5952532e725"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/27817-the-grand-mansion-a-luxury-collection-hotel-nanjing-is-unveiled-in-china-s-intriguing-ancient-city", "ord_in_thread": 0, "title": "The Grand Mansion, a Luxury Collection Hotel, Nanjing is unveiled in China’s intriguing ancient city", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Grand Mansion, a Luxury Collection Hotel, Nanjing is unveiled in China’s intriguing ancient city The Grand Mansion, a Luxury Collection Hotel, Nanjing is unveiled in China’s intriguing ancient city Details Category: Hotel Created on Wednesday, 22 July 2015 09:20 The Luxury Collection® Hotels & Resorts, part of Starwood Hotels & Resorts Worldwide, Inc., has announced the opening of The Grand Mansion, a Luxury Collection Hotel, Nanjing, in the capital of China’s Jiangsu province. Marking the brand’s seventh hotel in China, The Grand Mansion furthers the global expansion of The Luxury Collection, which will surpass 100 hotels globally by the end of this year. In China, The Grand Mansion joins a distinguished portfolio that includes The Azure Qiantang in Hangzhou, The Castle Hotel in Dalian, Twelve at Hengshan and The Hongta Hotel in Shanghai, The Royal Begonia in Sanya and the legendary Astor Hotel in Tianjin. \n“The rapid growth of The Luxury Collection brand in China reflects a robust demand for high-end hospitality from an increasingly affluent market, where domestic travel continues to thrive,” said Hoyt H. Harper II, Global Brand Leader, The Luxury Collection Hotels & Resorts. “We are thrilled to debut The Grand Mansion – a hotel that is at once a portal to the rich cultural heritage of Nanjing and a gateway to experience the city’s contemporary art, design and cuisine.” One of the original “Four Great Ancient Cities of China,” Nanjing is less than 300 miles from Shanghai, situated on the lower stretches of the Yangzi River. Considered an up-and-coming university town, the city is also a national hub for business and tourism with an impressive, enduring historical heritage. A magnificent city wall still surrounds most of Nanjing, which boasts tree-lined boulevards, chic cafes and historical museums, set amidst a beautiful landscape of lakes, forested parks and rivers. The Grand Mansion is ideally located on the historic Chanjiang Road, sharing its unparalleled location with the Oriental Metropolitan Museum on the archaeological site of the Jiankang Palace. Steps away from the iconic Presidential Palace, The Grand Mansion features 158 luxuriously appointed guestrooms, including 15 suites and an expansive Presidential Suite, designed to capture the destination’s profound history and rich cultural legacy. Led by I.M. Pei Architects with HBA Interior Design, the hotel’s design draws inspiration from Nanjing’s time as the nation’s capital during its Ming-dynasty apogee and then again as the capital of the Republic of China in the early twentieth century. Evoking the residential feel of a private noble home, such as that of the nation’s founding father Sun Yat Sen, the hotel boasts an extensive art collection, handcrafted textiles, opulent chinaware and a compelling collection of books on local history and culture. The meticulously designed public spaces of The Grand Mansion harken back to the city’s celebrated era. Sun-drenched and surrounded by rooftop windows, The Travellers’ Library is one of China’s largest hotel libraries with a vast collection of 3,000 books as well as local antiques and global treasures that pay tribute to numerous voyages by global explorers around the world. Nearby, guests can relax in the Xi Lounge, which offers an exquisite collection of teas. For dinner, the traditional Xuan Ling Ge Chinese restaurant artfully serves “Min Guo” cuisine, a culinary signature of Nanjing that fuses Huaiyang, Hangzhou, and traditional Taiwanese flavours; while The Atrium offers all-day dining option, specialising in Nanjing and international cuisines, including Min Guo-style dishes, barbecue and local snacks. The Grand Mansion also presents guests with a range of leisure facilities, such as a fitness centre, indoor heated pool and luxurious spa. It boasts flexible meeting spaces, including a grand ballroom spanning nearly 6000 square feet and seven distinct, spacious meeting rooms. As part of The Luxury Collection Hotels & Resorts, The Grand Mansion offers The Luxury Collection Concierge service to guide discerning guests in their exploration and unlocking of the very best of the destination. Each Luxury Collection Concierge is a bilingual, certified destination expert, proudly wearing the “clef d’or”, the gilt insignia of the prestigious international concierge society. These local experts are eager to reveal the indigenous treasures, which are off the typical traveller’s radar, including walking and driving tours of Min Guo-era architecture and historical residences in and around Nanjing. Related articles", "external_links": [], "published": "2015-07-22T11:20:00.000+03:00", "crawled": "2015-07-22T12:43:03.061+03:00", "highlightTitle": ""}