{"organizations": [], "uuid": "b4c38462605d7cb1f1e19f35b3952adfb8098ced", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/l/r/u/u/image.related.StuffLandscapeSixteenByNine.620x349.15lrel.png/1435723496955.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/south-america/69879549/Simple-life-meets-stunning-luxury-at-Tierra-Chiloe", "country": "AU", "title": "Simple life meets stunning luxury at Tierra Chiloe", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Simple life meets stunning luxury at Tierra Chiloe", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T07:04:00.000+03:00", "replies_count": 0, "uuid": "b4c38462605d7cb1f1e19f35b3952adfb8098ced"}, "author": "Craig Platt", "url": "http://www.stuff.co.nz/travel/destinations/south-america/69879549/Simple-life-meets-stunning-luxury-at-Tierra-Chiloe", "ord_in_thread": 0, "title": "Simple life meets stunning luxury at Tierra Chiloe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Simple life meets stunning luxury at Tierra Chiloe CRAIG PLATT Last updated 05:00, July 2 2015 \nThe Tierra Chiloe's dramatic design overlooks the water and offers amazing views. \nThe Tierra Chiloe hotel in Chile is isolated, situated on the edge of a small bay on the eastern side of Chiloe Island, the second largest island off the South American coast after Tierra del Fuego. \nThe island is about 180 kilometres long but a narrow 50 kilometres wide and is flanked on the eastern side by a gulf filled with smaller islands. The region is temperate, with warm summers and comfortable, if cool, autumns. \nWhile the temperature doesn't drop too far in winter, it does pour with rain - sometimes non-stop for weeks - making the warmer months the best time to visit \nThe space \nThe Tierra's dramatic design overlooks the water and every one of the 12 rooms offers a beautiful view of the countryside. The hotel's architecture, with its sharp angles and large windows, gives it a futuristic, modern look in stark contrast to the quaint, colourful cottages the locals live in. \nDespite the sci-fi looks, the hotel is made of wood and the interior's exposed boards are reminiscent of a Scandinavian lodge. The open-plan dining room and lounge on the ground floor offer the same gorgeous views as the bedrooms. There's a relaxation room with a sauna and spa and a small library (also with views). \nThe rooms are spacious and warm - and it's hard to beat that view. \nThe room \nThe view is gorgeous, overlooking the rolling hills of the islands and the water. There's no one to be seen for miles - just black-necked swans or perhaps a local fisherman tending one of the mussel farms. Ad Feedback \nThe room is spacious and warm and focused on the view, which can be enjoyed from your bed. The bathroom is elegant and includes a large spa bath and L'occitane toiletries. I'm welcomed with a pair of locally-made woollen slippers provided as a gift. \nComfort factor \nAs my first destination in South America, this is a perfect place to unwind and adjust to the new time zone. The atmosphere is relaxed, which suits the nature of the island and its residents. Heavy doors on the bedrooms means noise is minimal and there's a cosy atmosphere in the common dining and lounge area, where chillout music is the soundtrack. \nWhile the hotel offers plenty of activities for guests, there's no obligation to do anything. With meals and drinks included, you don't really need to leave. \nThe food \nAll meals are included at the Tierra, but even if they weren't, it's doubtful you'd want to eat anywhere else. The meals are top notch and based around local ingredients. This means plenty of fresh seafood and vegetables. \nMy first dish on arrival is Magellan mussels, simply prepared with mayonnaise, lemon and beets, and they're among the best mussels I've ever tasted. \nOther dishes include grilled salmon, clam chowder and crab claws, though chicken, pasta and lamb also appears on the menu. Lunch and dinner meals are three-course, but the selections are limited to a couple of options a course at each meal. \nStepping out \nWhile you could spend your entire stay within the hotel and its grounds, Chiloe has plenty more to offer. Visiting the island is like stepping back to a simpler time. It is idyllic in the traditional sense of the word. Most locals either run small farms or fish for a living, which means plenty of terrific local produce (food sold in the local markets must, by law, be produced organically), as well as gorgeous locally made handicrafts. \nThe Tierra Chiloe is all-inclusive right down to the excursions, with the hotel's guides taking guests on tours of the area. This includes cruising in the hotel's boat, as well as a day trip visiting some of the UNESCO World Heritage-listed churches on the island, all of which have their own unique design characteristics (there are 19 in total). The hotel also offers a visit to a local organic farm where we are given an opportunity to taste the produce at its freshest and get an insight into local life. \nTierra Chiloe has its own boat offering guests excursions in the region. \nThe verdict \nChiloe and its surrounding islands offer a distinct culture unlike that found on mainland Chile. The Tierra Chiloe is an excellent place to unwind for a few days. It offers the \"getting away from it all\" feel that resorts have, as well as opportunities to enjoy cultural experiences. \nThough the hotel is luxurious, the island itself may leave you pining for a simpler life. \nHow to get there \nLAN flies from New Zealand with connections to Mocopulli Airport on Chiloe. The hotel will transfer guests from the airport. See lan.com . \nEssentials \nThe all-inclusive rate at Tierra Chiloe, including meals, open bar, transfers and excursions, vary depending on the length of stay, but a minimum two-night stay starts from $US1150 ($1690) a person. See tierrahotels.com . \nThe writer travelled as a guest of South America Travel Centre and LAN.", "external_links": [], "published": "2015-07-01T07:04:00.000+03:00", "crawled": "2015-07-01T22:46:03.000+03:00", "highlightTitle": ""}