{"organizations": [], "uuid": "d03a289eafc6d23b08e1f115be8e296ddc367e78", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.al.com", "main_image": "http://imgick.al.com/home/bama-media/width620/img/alphotos/photo/2015/06/18/18126453-large.jpg", "site_section": "http://impact.al.com/travel/atom.xml", "section_title": "Travel Impact - al.com", "url": "http://www.al.com/living/index.ssf/2015/06/susies_wish_sends_critically_i.html", "country": "US", "title": "Susie's Wish sends critically ill patients on vacation in memory of beach-loving reporter", "performance_score": 0, "site": "al.com", "participants_count": 1, "title_full": "Susie's Wish sends critically ill patients on vacation in memory of beach-loving reporter", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T20:53:00.000+03:00", "replies_count": 0, "uuid": "d03a289eafc6d23b08e1f115be8e296ddc367e78"}, "author": "Anna Claire Vollers", "url": "http://www.al.com/living/index.ssf/2015/06/susies_wish_sends_critically_i.html", "ord_in_thread": 0, "title": "Susie's Wish sends critically ill patients on vacation in memory of beach-loving reporter", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just being in the sand, it was so peaceful. It cleansed me. \nIt had been a long time since Kevin Koskinen had seen the ocean. \n\"Just being in the sand, it was so peaceful,\" he said. \"It cleansed me.\" After spending a week in a beach condo in Panama City Beach, Fla., Koskinen returned to his life in Huntsville and a medical diagnosis he's still learning to accept. \n\"It did me wonderful,\" he said of his time at the beach. \"It seems like I've had a lot more energy (since I've been back).\" \nHaving energy and feeling at peace are things Koskinen, 49, does not take for granted. He's terminally ill with liver disease and is cared for by hospice nurses from Hospice Family Care. They're the ones who nominated Koskinen for the beach trip. \nAnd the trip itself – it has a story, too. It was given to him by Susie's Wish, a non-profit organization in Huntsville that raises money to send people with life-threatening illnesses to the beach. \nSusie's Wish was established in memory of Susie Edwards, a television news reporter in Huntsville and New Orleans who loved the beach. She was diagnosed with an aggressive form of liver cancer in 2009. She had wanted to take a beach trip one last time with family and friends, but passed away before she got the chance, in December 2010. She was 34. \n'My world was lost' \nAbout three years ago, Koskinen's friends knocked on his bedroom door at the Breaking Free Rescue Mission and found him on the floor, seemingly asleep. They woke him up and told him they hadn't seen him in a couple of days. \nOver the following days, he became increasingly confused and disoriented. Eventually an ambulance was called. \nThe doctors drained dozens of ounces of fluid from his abdomen and he was in and out of the hospital over the next couple of years. The doctors told him his liver was too badly damaged to function and hospice was called. \n\"I felt like my world was lost when I found out I was dying,\" he said. Depression settled over him, but he continued going for treatment and drainage of the fluid. The illness didn't bother him as much, he said, as the loneliness and worry over how many more times he'd get to see his two children. \nHe told God: \"I just want to see my daughter graduate, and then God, you can do whatever you want with me.\" \nHis friends at the Rescue Mission, who he calls his family, supported him and promised to be there for him through the end. He said his nurses from Hospice Family Care were family, too. And then he found out he was chosen to spend a week at the beach. \nSusie's Beach Fest \nThe Susie's Wish organization partners with the Huntsville Hospital Foundation and Hospice Family Care, Madison County's only not-for-profit hospice organization, to send patients on an all-expenses-paid trip to the beach. \nTo date, Susie's Wish has sent four patients and their families to the beach. One main source of fundraising each year is Susie's Beach Fest, a beach-themed event to be held this year on June 25. \nSeveral tons of sand are trucked in for the event to create a mini beach at A.M. Booth's Lumberyard, 6-11 p.m. Food trucks, beach cocktails and live music by CBDB – a band which made it to the final voting rounds for Bonnaroo – round out the event, which will also feature artwork for sale. \nTickets are $15 in advance and $20 at the door. They're available online at www.susiesbeachfest.eventbrite.com . \nProceeds from this year's event will send a fifth patient to the Pepsi Gulf Coast Jam in Panama City Beach, Fla. \nBetter days \nSince his beach trip, Koskinen said he has felt rejuvenated. He's taking care of himself and has felt better lately than he has in months. He's lost 100 pounds, down from the 350 pounds he weighed when he first became sick, and is working to keep his diabetes under control. \n\"My doctor came in two or three weeks ago and said, 'What happened to you? I was ready to put you in the grave,'\" he said. \"I'm stable now. I've still got the liver problem but I'm not going to overdo it.\" \nThe man who has made end-of-life plans is also hoping he can spend his time helping others. \n\"After all of these things people have done for me, I would like to give back to the community,\" he said. \"I can't do a lot but I want to help.\" \nHe hopes by sharing his story, the community will understand what an important organization Susie's Wish is, and how it has given neighbors like him a respite from living with a terminal diagnosis. He hopes to be able to attend Susie's Beach Fest this year.", "external_links": [], "published": "2015-06-30T20:53:00.000+03:00", "crawled": "2015-07-01T01:44:26.000+03:00", "highlightTitle": ""}