{"organizations": [], "uuid": "590b93eca5bf72ac44973c48f5b869b11c4f51fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/emerald-reveals-winner-in-godmother-search/4697828.article", "country": "GB", "title": "Emerald reveals winner in godmother search", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Emerald reveals winner in godmother search", "spam_score": 0.0, "site_type": "news", "published": "2015-07-09T11:00:00.000+03:00", "replies_count": 0, "uuid": "590b93eca5bf72ac44973c48f5b869b11c4f51fe"}, "author": "", "url": "http://www.ttgdigital.com/news/emerald-reveals-winner-in-godmother-search/4697828.article", "ord_in_thread": 0, "title": "Emerald reveals winner in godmother search", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Emerald reveals winner in godmother search 9 July 2015 Save \nMidcounties Co-operative Travel’s Julie Kendrick is set to follow in the footsteps of Sixties icon Twiggy when she becomes the next godmother of an Emerald Waterways ship. \nKendrick, who is head of commercial and marketing, beat off competition from 50 other agents to land the role, with entrants having to explain on social media or email why they should be godmother. \nHer entry addressed all the key selling points the line was looking to communicate, according to Emerald UK brand manager David Winterton, in an entry he described as “fantastic”. \nKendrick will now travel to Budapest, Hungary, for the naming ceremony for Emerald Sun on August 21. \nThe ship will be launched alongside sister vessel Emerald Dawn. \nWinterton said the line had also decided to increase the number of runner-up prizes after receiving such a high volume of entries for the competition. \nFifteen people will now receive a Marriott Hotels’ pamper day for two worth £120 and will have priority on a future fam trip. \n“I’m extremely excited,” Kendrick told TTG . “To actually not just be part of the naming, but to be godmother - it means I’ll become an ambassador for the ship as well as the brand. It’s just a real privilege.” \nEmerald has only been selling through the trade for a relatively short time and Winterton said the initiative was the perfect way to show how much the line values travel agents. \n“The key for us is that we are very supportive of the trade and we want to work with agents. When this opportunity came, it just was a fantastic idea for us to give something back to our travel agency friends,” he said. \nWinterton said the overall level of response had been “phenomenal”, adding: “There’s a lot of people that have been selling ocean cruising for quite some time now and they see that river cruising is a natural step for them to grow their business. We want to be there to support them.”", "external_links": [], "published": "2015-07-09T11:00:00.000+03:00", "crawled": "2015-07-10T12:12:42.000+03:00", "highlightTitle": ""}