{"organizations": [], "uuid": "092e8de3175415d4d64e130e9498ba0fb5a156c3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/07/07/11/0D6CE66800000514-0-image-a-30_1436266086172.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3151990/Londoners-adventurous-tourists-Welsh-prefer-staycation-Scots-lured-food.html", "country": "GB", "title": "Londoners found to be most adventurous tourists while Welsh prefer a staycation", "performance_score": 1, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Londoners found to be most adventurous tourists while Welsh prefer a staycation | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T18:55:00.000+03:00", "replies_count": 1, "uuid": "40e0762e1861306fcb6b42280620dbdd5c46710b"}, "author": "Katie Amey for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3151990/Londoners-adventurous-tourists-Welsh-prefer-staycation-Scots-lured-food.html#post-0", "ord_in_thread": 0, "title": "Londoners found to be most adventurous tourists while Welsh prefer a staycation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "5 shares 1\nView\ncomments\nWhere you live, it turns out, reveals a lot about how and where you like to holiday.\nAccording to a new survey, Londoners are the most adventurous travellers, but the least likely to take a UK break.\nMeanwhile, those in the North prefer to explore Britain.\nA new study has found Londoners most likely to head abroad and Northerners most likely to explore the UK\nA study conducted by touring specialists Back-Roads Touring have found that areas of the UK have very clear patterns when it comes to holiday preferences, including locations and activities.\nThose who live in the capital are more likely to go abroad than those who live in any other part of the country.\n Forget crisps and a can of Coke: The world's most... Five-figure payout for holidaymakers from Thomas Cook after... Get him to the Greek! As bookings plummet, holiday boss... Eau de tiger! Siberian big cat marks its territory by... They're also the least likely to take a UK break, with London respondents revealing that they had visited less UK counties than others polled.\nOn the other end of the spectrum, those least likely to travel appear to be the Welsh, with nearly 90 per cent of those surveyed indicating that they'd prefer a staycation.\nAnd when asked what they believed the main draw of a UK break to be, over 50 per cent agreed that it was nature and scenery.\nThe Welsh were the least likely to travel with nearly 90% indicating that they'd prefer a staycation. Pictured is Newborough in North Wales\nMeanwhile, those living in Yorkshire were revealed to be the most well-travelled - at least when it comes to the UK.\nNortherners had visited more counties in Britain than any other residents and were likewise enamoured with its scenery.\nShorter travelling times also proved to be very popular for those living in Yorkshire, with almost half of those surveyed stating that the ease of travel in the UK was most appealing to them.\nMeanwhile, those in Yorkshire had travelled the most within Britain and were enamoured with its scenery\nAnd in Scotland, being able to experience locally-sourced food and regional dishes was very important when choosing a UK-based holiday destination.\nThose from the Midlands were most interested in visiting British beaches, while those from the South East prefer cultural and historical sights.\nBut one thing that everyone was in agreement on was that the majority look for a unique experience, with 65 per cent saying that visiting places off the beaten path was important to them when choosing a holiday destination.\nAs well as visiting unusual landmarks, Britons also want to explore locations through the eyes of a local.\nWhen the Scottish people they tend to prize experiencing the local food - like brown crab (pictured)\nOne thing that all survey respondents had in common: preferring to head somewhere off the beaten path\nBack-Roads Touring general manager, Steve Reynolds, said that this is a trend that they have noticed amongst their clientele.\n'At Back-Roads Touring we specialise in 'off the beaten track' tours within the UK and Europe and we have definitely noticed an increase in interest from the UK market in the last few years,' he explained.\n'Britons are now interested in exploring not only the well-known sites but also those that they may be slightly more hidden, they want to see the way that locals live and experience that for themselves whether it's with food and wine tasting or visiting historical battlefields.\n'There has been an increased interest from our UK customers to see sights away from the tourist areas and explore their own back yards.\n'We have also seen increased interest in those who wish to explore the UK further but would prefer not to drive themselves.\n'Back-Roads Touring provides the perfect solution by driving them to each location in spacious, comfortable coaches.'", "external_links": ["http://dailym.ai/1eBQ9fc"], "published": "2015-07-07T18:55:00.000+03:00", "crawled": "2015-07-07T14:44:33.000+03:00", "highlightTitle": ""}