{"organizations": [], "uuid": "459109fd64d0a4981d4d443b5ae7ef27b9e54984", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "hosted.ap.org", "main_image": "http://www.abqjournal.com/base/twitter_facebook.png", "site_section": "http://hosted.ap.org/lineups/TRAVEL_BRIEFS-rss_1.0.xml?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "section_title": "AP Top Travel News At 12:26 p.m. EDT", "url": "http://hosted.ap.org/dynamic/stories/O/OLY_TRAVEL_RIO_2016_FILTHY_WATER_ABRIDGED_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "country": "IL", "title": "AP Investigation: Filthy Rio water a threat at 2016 Olympics", "performance_score": 0, "site": "ap.org", "participants_count": 1, "title_full": "AP Investigation: Filthy Rio water a threat at 2016 Olympics", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T19:26:00.000+03:00", "replies_count": 0, "uuid": "459109fd64d0a4981d4d443b5ae7ef27b9e54984"}, "author": "By BRAD BROOKS and JENNY BARCHFIELD", "url": "http://hosted.ap.org/dynamic/stories/O/OLY_TRAVEL_RIO_2016_FILTHY_WATER_ABRIDGED_TRVOL?SITE=NMALJ&SECTION=HOME&TEMPLATE=DEFAULT", "ord_in_thread": 0, "title": "AP Investigation: Filthy Rio water a threat at 2016 Olympics", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  RIO DE JANEIRO (AP) -- The waters where Olympians will compete in swimming and boating events next summer in South America's first games are rife with human sewage and present a serious health risk for athletes, as well as for visitors to the iconic beaches of Rio de Janeiro. An Associated Press investigation found dangerously high levels of viruses and bacteria from sewage in venues where athletes will compete in the 2016 Olympic and Paralympic water sports. In the first independent comprehensive testing for both viruses and bacteria at the Olympic sites, the AP conducted four rounds of tests starting in March. The results have alarmed international experts and dismayed competitors training in Rio, some of whom have already have fallen ill with fevers, vomiting and diarrhea. These ailments could knock an athlete out for days, potentially curtailing Olympics dreams and the years of hard training behind them. \"This is by far the worst water quality we've ever seen in our sailing careers,\" said Ivan Bulaja, a coach for the Austrian team, which has spent months training on the Guanabara Bay. \"I am quite sure if you swim in this water and it goes into your mouth or nose that quite a lot of bad things are coming inside your body.\" Sailor David Hussl has already fallen ill. \"I've had high temperatures and problems with my stomach,\" Hussl said. \"It's always one day completely in bed and then usually not sailing for two or three days.\" Water pollution has long plagued Brazil's urban areas, where most sewage isn't collected, let alone treated. In Rio, much of the waste runs through open-air ditches to fetid streams and rivers that feed the Olympic water sites and blight the city's picture postcard beaches. Dr. Richard Budgett, the medical director for the International Olympic Committee, said after seeing the AP findings that the IOC and Brazilian authorities should stick to their program of testing only for bacteria to determine whether the water is safe for athletes, as that is the accepted norm globally. \"We've had reassurances from the World Health Organization and others that there is no significant risk to athlete health,\" he told the AP on the sidelines of an IOC meeting in Malaysia. He went on to say that \"there will be people pushing for all sorts of other tests, but we follow the expert advice and official advice on how to monitor water effectively.\" Many water and health experts in the U.S. and Europe are pushing regulatory agencies to include viral testing in determining water quality because the majority of illnesses from recreational water activities are related to viruses, not bacteria. Brazilian authorities pledged that a major overhaul of the city's waterways would be among the Olympics' most significant legacies. But the stench of raw sewage still greets travelers arriving at Rio's international airport. Prime beaches remain deserted because the surf is thick with putrid sludge, and periodic die-offs leave the Olympic lake littered with rotting fish. More than 10,000 athletes hailing from over 200 countries are expected to compete in the Aug. 5-21, 2016, games. Nearly 1,400 of them will come into contact with waters contaminated by rampant sewage pollution, as they sail in the Guanabara Bay; swim off of Copacabana Beach; and canoe and row on the brackish waters of the Rodrigo de Freitas Lake. And starting next week, hundreds of athletes will take to the waters in Olympic trial events. Brazilian officials insist the waters will be safe, but the AP testing over five months found not one venue fit for swimming or boating, according to international experts, who say it's too late for a cleanup. \"What you have there is basically raw sewage,\" said John Griffith, a marine biologist at the independent Southern California Coastal Water Research Project. Griffith examined the protocols, methodology and results of the AP tests. \"It's all the water from the toilets and the showers and whatever people put down their sinks, all mixed up, and it's going out into the beach waters.\" In the U.S., Griffith said, areas with such levels of contamination \"would be shut down immediately.\" Brazilian officials who oversee water quality at the Olympic sites said they are not monitoring for viruses. But Leonardo Daemon, coordinator of water quality monitoring for the state's environmental agency, said officials are strictly following Brazilian regulations on water quality, which are all based on bacteria levels. \"What would be the standard that should be followed for the quantity of virus? Because the presence or absence of virus in the water ... needs to have a standard, a limit,\" he said. \"You don't have a standard for the quantity of virus in relation to human health when it comes to contact with water.\" Fernando Spilki, a top Brazilian virologist, carried out four rounds of viral and bacterial water testing for the AP, collecting samples at three Olympic sites. Spilki's testing looked for three different types of human adenovirus that are typical \"markers\" of human sewage in Brazil. In addition, he tested for enteroviruses, the most common cause of upper respiratory tract infections in the young, which can also lead to brain and heart ailments. He also tested for rotavirus, the main cause of gastroenteritis globally. The test results consistently found high counts of active and infectious human adenoviruses, which cause explosive diarrhea, violent vomiting, respiratory trouble and other illnesses. The concentrations of the human adenoviruses were roughly equivalent to that seen in raw sewage - even at one of the least-polluted areas tested, Copacabana Beach, where marathon and triathlon swimming will take place and where many of the expected 350,000 foreign tourists may take a dip. The AP found another Olympic site thought to have been largely cleaned up in recent years, the Rodrigo de Freitas Lake, is among the games' most polluted waters. Results ranged from 14 million adenoviruses per liter to 1.7 billion per liter. By comparison, water quality experts who monitor beaches in Southern California become alarmed by viral counts spiking to 1,000 per liter. \"Everybody runs the risk of infection in these polluted waters,\" said Dr. Carlos Terra, a hepatologist and head of a Rio-based association of doctors specializing in liver disease. Terra said approximately 60 percent of Brazilian adults have been exposed to hepatitis A, primarily because of exposure to sewage. Kristina Mena, an associate professor of public health at the University of Texas Health Science Center at Houston and an expert in water risk assessment, examined the AP data and estimated international athletes at all water venues would have a 99 percent chance of being infected by the pathogens if they ingested just three teaspoons of water, although this doesn't automatically mean a person would fall ill. That depends on immunity and many other factors. Brazilians are exposed from childhood and build up immunities. But foreign athletes and tourists won't have that protection. Dr. Alberto Chebabo, who heads Rio's Infectious Diseases Society, warned that all foreigners heading to Rio for the Olympics, whether athletes or tourists, should get vaccinated against hepatitis A. The U.S. Centers for Disease Control and Prevention also recommends travelers to Brazil get vaccinated for typhoid. --- Associated Press sports writer Stephen Wade and senior producer Yesica Fisch contributed to this report from Rio, sports writer Stephen Wilson contributed from Kuala Lumpur, Malaysia. --- Brad Brooks on Twitter: http://www.twitter.com/bradleybrooks Jenny Barchfield on Twitter: http://www.twitter.com/jennybarchfield", "external_links": [], "published": "2015-07-30T19:26:00.000+03:00", "crawled": "2015-07-30T23:40:20.038+03:00", "highlightTitle": ""}