{"organizations": [], "uuid": "1faf97abbe3bd8f2255d72289bd0f98e2a706df5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1259", "section_title": "Travel Trade Gazette - Destinations", "url": "http://www.ttgdigital.com/toolkit/on-our-radar-virginia-us/4697738.article", "country": "GB", "title": "On Our Radar: Virginia, US", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "On Our Radar: Virginia, US", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T13:59:00.000+03:00", "replies_count": 0, "uuid": "1faf97abbe3bd8f2255d72289bd0f98e2a706df5"}, "author": "", "url": "http://www.ttgdigital.com/toolkit/on-our-radar-virginia-us/4697738.article", "ord_in_thread": 0, "title": "On Our Radar: Virginia, US", "locations": ["US", "Virginia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Save \nThe Governor of Virginia, Terry McAuliffe, was not impressed when I dared suggest that Nashville was the birthplace of country music. “It’s Bristol, Virginia,” he chastised, with mock horror \nI picked up this nugget of information when we met at a Taste of Virginia event in London last month. As we tucked into the governor’s favourite dishes - incuding dark ale braised lamb spare ribs - prepared by celebrity chef Tom Kerridge (pictured below with McAuliffe), and sipped on Virginia’s wines, I found out more about the US state where the British established their first permanent settlement in North America, back in 1607. \nHistoric sites are a part of Virginia’s appeal, and Brits should also be tempted by the range of wineries (260), craft breweries (100) and craft distilleries (10). These are huge tourist attractions, explained McAuliffe, where music festivals and tasting tours by kayak turn a simple glass of wine into an experience. \nOysters and wine pairing is another of Virginia’s surprises - the Dog and Oyster Vineyard is one of those making a name for itself with this combination. “We have the best oysters in America,” said McAuliffe. “Chesapeake Bay is well known for them and you can explore the regions with the Virginia Oyster Trail.” \nVirginia now stands at fifth place in the US league of wine producers, behind California, Washington, Oregon and New York State. \nThe great outdoors is another big selling point. October is a good time to visit, said McAuliffe, for an autumnal show that rivals anything New England has to offer. “You have to take the Skyline Drive in the Blue Ridge Mountains,” he urged. \n“In the Fall, you see oranges, reds and yellows as far as the eye can see - acres of forest on fire with colour.” \nFans of cycling will want September in their diary - when the World Road Cycling Championships bring former British champion Mark Cavendish and company to state capital Richmond. “Every day there are training teams in Richmond,” said McAuliffe. “It’s pretty inspirational for the rest of us.” \nHe admitted his security detail was loathe to see him on a bike too often, but he was clearly passionate about the tourism potential of the state he presides over, and was no stranger to its charms. “You have to try the beer soaked in bourbon barrels from Hardywood Park Craft Brewery [in Richmond],” he said. “That was a fun afternoon…”", "external_links": [], "published": "2015-07-01T13:59:00.000+03:00", "crawled": "2015-07-02T01:30:10.000+03:00", "highlightTitle": ""}