{"organizations": ["Transportation"], "uuid": "9a7d7764d900bcaad8da5fc56561b5afe2dddb0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/188", "section_title": "Artipot: Travel > Destinations Articles", "url": "http://www.artipot.com/articles/1916006/bhutan-travel-a-personal-view.htm", "country": "US", "title": "Bhutan Travel - A personal View (Ivan Das)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Bhutan Travel - A personal View (Ivan Das)", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T10:03:00.000+03:00", "replies_count": 0, "uuid": "9a7d7764d900bcaad8da5fc56561b5afe2dddb0b"}, "author": "", "url": "http://www.artipot.com/articles/1916006/bhutan-travel-a-personal-view.htm", "ord_in_thread": 0, "title": "Bhutan Travel - A personal View (Ivan Das)", "locations": ["Thimphu", "Bhutan", "Nepal", "China", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Ivan Das", "Kinley Penjor"], "text": "By Ivan Das Jul 24, 2015 Many think of Bhutan as a place like in some high budget Hollywood movies, for some a mysterious place, full of wild jungles, mountains and weird looking people.But really, Bhutan is just like any other country, we just have little more mountains, some rich tradition and cultural heritage, which is still intact, if not flourishing. Yes! It's true, we are one of the last country in the world to have internet, television and modern amenities.It's also true that, we measure our National progress in terms of Gross National Happiness and not based on other economic progress indicators. Do those make Bhutanese weird? May be we are weird, May be the rest of the world is weird.Geographically located between China in the north and India in the south, its looks like as if, all the mountains, forest and rivers in Bhutan are put in place to cushion the two giant nations of any sort of tension.Culturally, Bhutan is colorful, red, green, yellow, and blue. You name it, we have every color or in a little better word, we use every color. Not very long ago, when the rest of the world was going through the industrialization process, the world wars and the great depressions. Bhutan remained hidden, inaccessible to foreigners simply because of the geographic conditions of the country and for these reason, Bhutan does not have a history of world wars, the great depression and the industrialization. It's like the Bhutanese went for a deep sleep and suddenly when the Bhutanese woke up, every this bad has flew passed them and everything good the world have to offer is made ready for the Bhutanese to choose as per their need.So why should anyone consider Bhutan as their next holiday destination? Is Bhutan worth the tariff of USD 250 per person per night?The answer to the above question is quite simple. Should you consider Bhutan as your next holiday destination, YES! You should for the clean air, for the cultural and the rich Bhutanese tradition, for the peace of mind. I can only imagine a life in all these modern cities, a concert jungle. Yes for a change you should consider Bhutan as your next destination.As for the government implemented tariff of USD 250 per person per night, it's not really that expensive, when it covers your food, accommodations, Transportation, a licensed tour guide and any other fees/tax. In fact, Many Bhutanese Tour operators make a minimum profit.What this 250$ per person per night means, is that Bhutan is not over loaded with Tourist. If it still sound expensive, may be then you should reconsider your destination choice. May be you should visit Nepal or India, Both the country are culturally rich, with lots of good places to visit, but hey! There is only one Bhutan and the magical moment many visitors experienced here is something that cannot be compensated elsewhere.Bhutan have its own share of development issue like any other country, unemployment, crime and inflation are on the rise. The number of vehicle imported in the country is increasingly steadily. Of course is not the perfect place, but we are trying, we are doing the best we can, not to be like any other country but just simply to be Bhutan.My name is Kinley Penjor, I m an ordinary Bhutanese, who is born and bred in Thimphu, Bhutan an the views expressed above is solely personal. About the Author Also read about Trekking In Bhutan and Bhutan Tourism Rating:", "external_links": [], "published": "2015-07-24T10:03:00.000+03:00", "crawled": "2015-07-24T12:39:02.067+03:00", "highlightTitle": ""}