{"organizations": [], "uuid": "8e657f504e3c2e1496edfbda37ade27ae1a179a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61890/greyhound-makes-strides-provide-stellar-service-passengers-disab", "country": "US", "title": "Greyhound makes strides to provide stellar service to passengers with disabilities", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Greyhound makes strides to provide stellar service to passengers with disabilities", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T00:25:00.000+03:00", "replies_count": 0, "uuid": "8e657f504e3c2e1496edfbda37ade27ae1a179a0"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61890/greyhound-makes-strides-provide-stellar-service-passengers-disab", "ord_in_thread": 0, "title": "Greyhound makes strides to provide stellar service to passengers with disabilities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greyhound makes strides to provide stellar service to passengers with disabilities Adv: \nJul 27, 2015 Adv: \nDALLAS, TX - In commemoration of the 25th anniversary of the Americans with Disabilities Act (ADA), Greyhound participated in the celebration on the National Mall in Washington, D.C. on Saturday, July 25. \nGreyhound displayed a wheelchair lift-equipped coach at the event, allowing guests to tour the bus and learn more about how the company serves customers with disabilities. \nAs a company that strives to meet the needs of all customers with disabilities, Greyhound has made several enhancements over the past 25 years to ensure that it was not only in compliance with ADA regulations, but also working to exceed them. The company's program to assist customers with special needs is comprehensive. Drivers, customer service staff and other terminal employees are available to meet the needs of customers with disabilities. Greyhound provides assistance with boarding and deboarding, luggage, transfers, stowage and retrieval of mobility devices, and can help a customer traveling alone or with a personal care attendant. \n\"Greyhound truly recognizes the importance of making travel easy and accessible for customers with disabilities,\" said Dave Leach, president and CEO, Greyhound Lines, Inc. \"We've always been committed to providing the best service and ensuring that customers with disabilities enjoy their entire travel experience from the time they book their trip to the time they reach their destination. We've made numerous improvements that make travel as convenient and hassle-free as possible.\" \nGreyhound offers a safe, reliable and convenient travel option for customers. Some of the most notable strides the company has made to serve customers with disabilities have been: \nAll Greyhound buses are wheelchair lift-equipped, and all drivers are trained extensively on how to operate the lifts. \nGreyhound partnered with eSSENTIAL Accessibility to provide easier access to online ticket purchasing and vital travel information for customers with physical, vision and age-related disabilities. \nThe company has a dedicated team of professionals who solely assist customers with disabilities. \nAll terminals have wheelchair-accessible parking spaces with ramped access to entrance doors. \nTerminal restrooms are fully accessible and include ADA-compliant stalls, all with accessible fixtures and fittings. \nTicket counters are fitted to meet the required height for customers in wheelchairs. In some cases, there is a lowered section of the counter for convenience. \nAccommodations for customers with service animals.", "external_links": [], "published": "2015-07-28T00:25:00.000+03:00", "crawled": "2015-07-28T00:50:37.131+03:00", "highlightTitle": ""}