{"organizations": [], "uuid": "5b429411f2a94fadf7f075fb85f3ef612691e610", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61353/minister-gujarat-become-medical-tourism-hub", "country": "US", "title": "Minister: Gujarat to become medical tourism hub", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Minister: Gujarat to become medical tourism hub", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T23:35:00.000+03:00", "replies_count": 0, "uuid": "5b429411f2a94fadf7f075fb85f3ef612691e610"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61353/minister-gujarat-become-medical-tourism-hub", "ord_in_thread": 0, "title": "Minister: Gujarat to become medical tourism hub", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Minister: Gujarat to become medical tourism hub Adv: Gujarat Health Minister Nitin Patel Adv: \nAHMEDABAD, India - With a view to develop Gujarat as a medical tourism destination, the state government will soon announce a new medical policy, a minister said today. \n\"Gujarat government is in the final stages of framing a new policy to develop the state into a medical hub, which will increase medical tourism. Our aim is to increase various medical facilities, such as hospitals, nursing homes, clinics, medical colleges and super-specialty hospitals. We will announce the policy in near future,\" state Health Minister Nitin Patel said on the sidelines of a function in Gujarat. \n\"To give a boost to medical tourism in the state, we will provide subsidy for construction of facilities in this regard. Under the policy, we will also provide subsidy for purchasing specialized medical equipment,\" Patel said. \nThe government will provide subsidy to those wanting to set up hospitals and medical colleges. \"We will provide administrative as well as financial help for setting up such facilities in the state under this new medical policy,\" he said. \nHe added that the Health Department is in talks with state Finance Department to finalize the quantum of subsidy and other financial benefits to be given to hospitals and colleges.", "external_links": [], "published": "2015-07-12T23:35:00.000+03:00", "crawled": "2015-07-13T00:20:19.000+03:00", "highlightTitle": ""}