{"organizations": [], "uuid": "6148c6b6c91813a2a6f1e39b6a3529c9cd0d43b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3134346/images/o-HEALTHCARE-IN-MEXICO-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/internationallivingcom/healthcare-in-mexico_b_7611574.html?utm_hp_ref=travel&ir=Travel", "country": "US", "title": "Leave Your Healthcare Woes Behind By Moving To Mexico", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Leave Your Healthcare Woes Behind By Moving To Mexico", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T15:25:00.000+03:00", "replies_count": 0, "uuid": "6148c6b6c91813a2a6f1e39b6a3529c9cd0d43b2"}, "author": "InternationalLiving.com", "url": "http://www.huffingtonpost.com/internationallivingcom/healthcare-in-mexico_b_7611574.html?utm_hp_ref=travel&ir=Travel", "ord_in_thread": 0, "title": "Leave Your Healthcare Woes Behind By Moving To Mexico", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Glynna Prentice, InternationalLiving.com \nThis article comes to us courtesy of InternationalLiving.com , the world's leading authority on how to live, work, invest, travel, and retire better overseas. \nRecently I spent a month in the U.S. visiting family and friends. It was my longest continuous stint \"back home\" since I moved to Mexico eight years ago. It was a great opportunity to reconnect with loved ones and enjoy the U.S., and I did. There's a lot that I love about my home country, including its beauty, the sheer convenience of life there, and, of course, its familiarity. \nI don't include the high -- indeed, exorbitant -- cost of U.S. healthcare on that list of things I love. Those who live in the U.S. don't have any choice -- that expensive healthcare is all they have. But in moving abroad I gained a choice in the matter, and it's been one of the best things about my move. \nMind you, I didn't move abroad just for access to cheaper medical care . Rather, I did it for the sheer joy and exuberance I get from the overseas experience. I also did it for lifestyle considerations that, indirectly, also improve my health. \nMoving to a less-expensive country, for instance, allowed me to retire earlier because my funds stretch further. This is a compelling motive for many expats. In the end, of course, I didn't really retire , and this is also true of many expats. But, like them, I did leave the nine-to-five rat race behind. Instead, today I work in the comfort of my own home, on my own schedule, at work that I enjoy much more than my old job. Work has become much more like play, and my stress level has dropped accordingly. \nLike other expats, I've chosen to live abroad in locations and climates that suit my tastes . For me, that means warm weather and sunny days. In the past eight years I successfully avoided winter pretty much altogether. I lived in places where exercise was as easy as stepping out my front door, and eating well as simple as a trip to the market. I spent hours, and walked miles, nearly every day, simply tending to day-to-day life. And with the constant warm weather, I felt as young, eight years later, as the day I first arrived in Mexico ... It was only my month-long return to the U.S.'s winter cold, and the occasional aching joint it produced, to remind me that time had not stood still. \nAnd the low-cost medical care I have access to has helped my health in more active ways. Naturally, I knew that the cost of medical care in Mexico -- in fact, in all the countries International Living covers regularly -- was lower than in the U.S. I factored that into my budget when I planned my move abroad. But I didn't fully appreciate the sense of control over my life that lower cost would give me. \nToo often in the U.S., I see friends seemingly at the mercy of their healthcare. Worry about coverage and cost hangs over their lifestyle choices. These are not people who have suffered a catastrophic illness and must curtail their options as a result. Rather, these are healthy people who fear what often comes with a major, unexpected illness: crippling medical costs that can deplete years' worth of savings. In this regard, healthcare cost has become the adult version of childhood's boogieman under the bed ... something to scare us in the dark of night. \nFortunately, living abroad, I can feel confident that even a major illness would not put me in the poorhouse. I have access to good, affordable healthcare and I have good health insurance. My policy even covers me in the U.S. should I choose to seek care there ... though so far I haven't. I like my care abroad -- both quality and cost -- just fine. \nHere's an example of what I mean ... Just before my trip to the States, I had a barrage of major medical tests done in Mexico. It was the usual list of preventative screenings that we're all advised to get periodically -- a full array of blood tests, as well as four diagnostic screenings and a doctor's exam. Everything was done in private, high-tech labs and clinics easily as modern as any I've used in the U.S. And the work was performed by doctors and technicians as well-trained as their U.S. counterparts. The total bill, before insurance? Well under $1,000. In the U.S., each one of those diagnostic screenings, not to mention the blood work, would have cost that much or more. \nIn fact, I figure that the total bill in Mexico was less than what I'd have paid after insurance if I lived in the U.S. Most importantly, I felt in control, no matter what the outcome. Because ultimately, my real concern was not the medical tests themselves, which I'd planned and budgeted for; it was what might happen after I got the results. I knew that, if the screenings revealed a major illness, I'd be better off in Mexico, where quality of care is high yet costs are not. \nIn the end, of course, the tests gave me a clean bill of health, as hoped for. \nI have the all-clear until my next checkup, which I expect to have done abroad as well. \nIn the meantime, you'll find me abroad, where I can cheerfully concentrate on the tenets of that old Spanish toast: \"Health, love, wealth ... and the time to enjoy them.\" Related Articles:", "external_links": [], "published": "2015-07-04T15:25:00.000+03:00", "crawled": "2015-07-04T15:50:09.000+03:00", "highlightTitle": ""}