{"organizations": [], "uuid": "fd97de7cc77df89971b69a307d7fec70bc5fc7ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03367/carnitine_DJTHHN_3367394k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-07.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/health/elder/11723620/Supplement-allows-elderly-people-to-exercise-more-rigorously.html", "country": "US", "title": "Supplement allows elderly people to exercise more rigorously", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Supplement allows elderly people to exercise more rigorously - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T01:01:00.000+03:00", "replies_count": 0, "uuid": "fd97de7cc77df89971b69a307d7fec70bc5fc7ec"}, "author": "Agency", "url": "http://www.telegraph.co.uk/news/health/elder/11723620/Supplement-allows-elderly-people-to-exercise-more-rigorously.html", "ord_in_thread": 0, "title": "Supplement allows elderly people to exercise more rigorously", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A nutritional supplement taken by world class athletes could be the key to allowing elderly people to exercise more rigorously, a study has found. The supplement, favoured by endurance athletes and used to treat men with fertility problems, plays a key role in a biological pathway that determines our ability to cope with exercise, the research suggested. Carnitine works hand-in-hand with a metabolic enzyme called CrAT to improve exercise tolerance and stamina, according to the animal study. • Are sports supplements 'a big rip off'? Scientists believe the discovery may assist the development of treatments for people who get easily fatigued, such as the elderly and diabetes sufferers. Athletes often take carnitine to improve their performance but until now scientific evidence supporting the claims made for the supplement has been lacking. The compound, which helps the body burn fat to release energy, is also taken as a stress-buster and slimming aid, and also to boost fertility in men. Researchers conducting tests on mice found that carnitine appears to work with CrAT (carnitine acetyltransferase) to optimise muscle energy metabolism during exercise. Introducing a carnitine supplement to mouse diets improved exercise tolerance - but only in animals whose muscles demonstrated normal CrAT activity. Mice lacking the CrAT gene tired quickly during exercise and could not be helped by carnitine. The scientists, whose findings appear in the journal Cell Metabolism, stress that it was not known whether carnitine has the same effect in humans. • Too much sunshine 'could lead to increased risk of heart attacks and strokes' But they point out that the amount of carnitine produced in the body declines with age and as a result of certain diseases. Lead researcher Dr Deborah Muoio, from Duke University in the US, said: \"Our priority in the near term is to determine if carnitine supplementation augments the benefits of exercise training in older individuals at risk of metabolic disease. \"The work is not meant to imply that everyone should be taking carnitine supplements. We need to move beyond the 'one-size-fits-all' approach to optimal nutrition and instead work toward more personalised prescriptions that consider underlying genetics and acquired conditions.\" • Unhealthy lifestyle can knock 23 years off lifespan Follow @telegraph", "external_links": [], "published": "2015-07-08T01:01:00.000+03:00", "crawled": "2015-07-07T20:27:37.000+03:00", "highlightTitle": ""}