{"organizations": [], "uuid": "56939f689228bdae6a75a6f9d49d974ea0dff2bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/royal-caribbean-passenger-demands-security-risk-removal-apology/4697793.article", "country": "GB", "title": "Royal Caribbean passenger demands 'security risk' removal apology", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Royal Caribbean passenger demands 'security risk' removal apology", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T12:31:00.000+03:00", "replies_count": 0, "uuid": "56939f689228bdae6a75a6f9d49d974ea0dff2bc"}, "author": "", "url": "http://www.ttgdigital.com/news/royal-caribbean-passenger-demands-security-risk-removal-apology/4697793.article", "ord_in_thread": 0, "title": "Royal Caribbean passenger demands 'security risk' removal apology", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Save \nAn elderley cruise passenger is demanding an apology from Royal Caribbean after he was removed for being a security risk when he threatened to jump ship. \nEighty-five-year-old Jack Moran from Crosby was reportedly just 24 hours into a cruise to celebrate his diamond wedding anniversary with his wife when their voyage was cut short. \nThe passenger claimed to have got wet paint on his hand and trousers after arriving in the cabin as the balcony had been recently painted. He reportedly made several complaints the BBC said, before telling a member of the restaurant staff that he wanted to “jump ship” at the next stop. \nWhen he returned, security staff and the second captain told the family that the company’s head office wanted him taken off as a “security risk”. \nA security guard was stationed outside his cabin all night and regularly checked on him, the reports said. \nRoyal Caribbean said its first priority is “the best interests of guests”. \nHowever Moran said he believed his comments were misunderstood and the cruise company overreacted. \n“Cruises are a great holiday, it’s just unfortunate that staff that were dealing with me misunderstood everything. \n“It could have been so simple, everything could have been sorted out.” \nThe couple who had been travelling with their daughter and son-in-law and his mother, left the ship at Zebrugge and made their way home to Merseyside after just 23 and a half hours on the cruise in May 2014. \nThe group was refunded the cost of the four-day holiday and the return trip home, and are hoping to receive an apology soon. \nA spokeswoman for Royal Caribbean Cruises said: “Our first priority is always to look after the best interests of our guests and crew. \n“We acknowledge Mr Moran’s ongoing concerns and have contacted him to discuss these in more detail.”", "external_links": [], "published": "2015-07-07T12:31:00.000+03:00", "crawled": "2015-07-07T14:21:55.000+03:00", "highlightTitle": ""}