{"organizations": [], "uuid": "e73b0c4b3929c863d8b48bbabaffe50c6e270cf5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/Puerto-Viejo-Demolitions-8.jpg", "site_section": "http://www.ticotimes.net/categories/topics/environment-topics", "section_title": "Environment and Wildlife Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/07/28/costa-rica-supreme-court-overturns-cantons-declaration-expat-environmentalists-personas-non-grata", "country": "US", "title": "Costa Rica's Supreme Court tells Talamanca: You can't declare environmentalist expats 'personas non grata'", "performance_score": 0, "site": "ticotimes.net", "participants_count": 6, "title_full": "Costa Rica's Supreme Court tells Talamanca: You can't declare environmentalist expats 'personas non grata' -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T05:00:00.000+03:00", "replies_count": 6, "uuid": "e73b0c4b3929c863d8b48bbabaffe50c6e270cf5"}, "author": "Zach Dyer", "url": "http://www.ticotimes.net/2015/07/28/costa-rica-supreme-court-overturns-cantons-declaration-expat-environmentalists-personas-non-grata", "ord_in_thread": 0, "title": "Costa Rica's Supreme Court tells Talamanca: You can't declare environmentalist expats 'personas non grata'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Two expats in Costa Rica have won an appeal against the local government of Talamanca, which declared the foreigners “personas non grata” in the Caribbean beach town of Puerto Viejo for being “environmentalists,” according to a statement from the Supreme Court on Tuesday.\nThe Constitutional Chamber of the Supreme Court, or the Sala IV, ruled in favor of two appeals filed by Philippe Vangoidsenhoven, a 49-year-old Belgian man, and Carol Meeds, a 68-year-old U.S. woman from Florida, calling the municipality’s declaration “an intimidatory measure that directly threatens the exercise of their fundamental rights including freedom of expression and ensuring the protection of the environment,” according to the statement.\n“I feel relief, overwhelming relief,” Meeds told The Tico Times Tuesday morning.\nOn March 6, the Talamanca Municipal Council voted unanimously to declare Vangoidsenhoven and Meeds unwelcome in the community. Vangoidsenhoven had filed more than 100 complaints against a variety of public and private individuals for alleged illegal construction and other environmental damage. Meeds supported Vangoidsenhoven’s activism on social media and in opinion columns, but has not made any formal complaints, she said.\nA copy of the appeal obtained by The Tico Times said that an April 13 report presented to Sala IV showed that Mayor Melvin Cordero and Municipal Council President Hernán Carlos Cascante acknowledged that their decision to try to expel the expats was related to their views about the management of protected areas in the southern Caribbean.\nThe Sala IV had previously ruled on April 24 that the canton had violated due process when it declared the two unwelcome.\nThe appellants told The Tico Times that they believed their support of the Maritime Zone Law, which restricts construction within 200 meters of the coast, could have contributed to the council’s action. Many coastal communities, including Puerto Viejo, have challenged attempts to enforce the 1970s law, claiming that it would strip some families of land they have held for generations along the country’s idyllic beaches.\nLegislation to reform the Maritime Zone Law has long been stalled in the Legislative Assembly.\nThe appellants’ lawyer, former Broad Front Party lawmaker and presidential candidate José María Villalta, said he celebrated the decision. Villalta said a declaration of someone as “non grata” is not regulated in Costa Rican law and constituted an abuse of authority.\n“It could be interpreted as a call for the expulsion of someone from the community,” he said. “It’s an act, in my opinion, that’s totally illegal, and now in the view of the court [it’s] unconstitutional.”\nVillalta said the decision would have consequences beyond the case of Meeds and Vangoidsenhoven. The lawyer said that the court ruling would set a precedent that protects people from “cruel punishment” regardless of nationality, political beliefs or any other characteristic that threatens their human dignity.\nMeeds and Vangoidsenhoven both said they were happy to hear the results, but that repairing their reputations in the community would be difficult. Meeds said she had been afraid to leave her home after being verbally confronted by people in a town better known for laid-back surfing and Bob Marley tunes than expelling foreigners. Vangoidsenhoven said he has been in verbal and physical confrontations with locals because of his complaints.\n“Obviously, I’m happy, but it’s not going to change anything,” Vangoidsenhoven said. “People will still call me ‘toad’ when I walk down the street.”\nIn Costa Rica, calling someone a “ sapo ,” or toad, is akin to accusing them of sticking their nose in someone else’s business, or, like a toad, having a “big mouth.”\nVangoidsenhoven, who runs a bike rental business in Puerto Viejo, said he had a gun taken away by authorities and did not feel safe without it.\n“If I don’t have my gun and go anywhere that’s not my home or work, there’s a 99 percent chance I’ll come back in an ambulance,” he said.\nVangoidsenhoven said he came to Puerto Viejo 14 years ago and fell in love with its remote, wild nature.\n“I’m a nature lover, otherwise I would have been gone a long time ago. And that’s why I’m so horrified to see how stuff is going down, how they’re destroying the whole area,” he said. “To go to another place is too late. I can’t start over someplace else.”", "external_links": [], "published": "2015-07-29T05:00:00.000+03:00", "crawled": "2015-07-31T01:20:18.396+03:00", "highlightTitle": ""}