{"organizations": [], "uuid": "87706f7043df3df59616c3b3c8a3b3f4488241bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03382/Andrew-C-pet-thera_3382575k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11420844/What-happens-to-your-pets-when-you-die.html", "country": "US", "title": "One grandmother's greatest fear: what would happen to her dogs when she died", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "One grandmother's greatest fear: what would happen to her dogs when she died - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T15:01:00.000+03:00", "replies_count": 0, "uuid": "87706f7043df3df59616c3b3c8a3b3f4488241bb"}, "author": "Eleanor Doughty", "url": "http://www.telegraph.co.uk/goodlife/11420844/What-happens-to-your-pets-when-you-die.html", "ord_in_thread": 0, "title": "One grandmother's greatest fear: what would happen to her dogs when she died", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Before my grandmother died on New Year’s Eve last year, she was worried about her dogs. An octogenarian, she had lived on her own for 20 years, the result being that those smelly, fluffy, mud-depositing animals were her nearest and dearest. Various dogs, Siamese cats and horses had been her closest companions for most of her life. When she became ‘properly’ ill 18 months ago – rather than just old and a little creaky – she worried that her death would upset them. She couldn’t die until she knew they were happy and settled. I ordered her to make it until Christmas, and my birthday two days before. She did. At the funeral – my first – my eyes leaked uncontrollably, as if cutting onions in an unventilated room. She wouldn’t have approved: she was old-fashioned and no-nonsense, from an age where much worse had happened than someone dying. Eleanor and her grandmother Nevertheless, she cared for her animals tirelessly. Some would say more than for her family, like any good toff. When my mother, aged 15, had a riding accident, shattering every bone in her left leg, foot and ankle, Granny asked – on her reappearance in the yard, “What have you done to that horse?” Some years later, when she became too frail to manage her dogs alone, my mother and aunts found the Cinnamon Trust , the national charity which seeks to relieve the anxieties faced by elderly and terminally ill people and their pets. Two volunteers, Gilly and Jenny took the dogs for walks, cared for them at home, and when Granny wasn’t sure whether she would return home from hospital or not, helped her with a few goodbyes. After a few trials to keep the dogs at home, my grandmother “was determined that this was the final goodbye”, Gilly explains. It was, one imagines, heart-breaking, but the right thing to do. Organisations like Pets as Therapy can prove hugely important to older people (Martin Pope) \"Having her dogs settled meant more to my mum than most people realised,” my own mother confirms. And without organisations like the Cinnamon Trust, difficult end-of-life decisions would be much harder. The impetus too, on long-distance families – such as my own – much more intense. My grandmother is not the only one that benefitted from the Cinnamon Trust and organisations like it. Hundreds of poorly people in the later stages of life find comfort in the kindly work that the Trust’s volunteers do. Happily, they are not alone in providing support where pets are concerned. The national charity Pets as Therapy (PAT) was founded in 1983 and serves an opposite, but equally effective purpose. PAT provide therapeutic visits to hospitals, hospices, nursing and care homes with their pet cats and dogs. Since its beginning, over 28,000 dogs have been registered with PAT, and today there are 4,500 active dogs working through the United Kingdom. One of Eleanor's grandmother's dogs (Eleanor Doughty) “I’m a strong believer that the elderly benefit from keeping their pets at home as long as possible,” Cinnamon Trust volunteer Gilly Bowden explains. “Even if they can only walk them round the block each day or let them into the garden, then a volunteer can give them a good long walk as often as needed.” The four-month journey that my Granny and the Cinnamon Trust volunteers Gilly and Jenny went on enabled all of them to get to know one another. When my grandmother left her house for the residence she would retire to, those volunteers visited her. Their support was not only for the dogs, but for her too. Right at the end of a life, the reassurance that beloved pets – so well cared for in health and happiness – will be okay, is essential. Not just for the poorly and old, but for the families too. It was our priority, to rehabilitate the dogs so that my grandmother could die peacefully and without concern. Happily, she did. If nothing else, we owe our families that much. Read more: • The miniature therapy horses of Minerva nursing home • Chickens are helping the elderly tackle loneliness • Can life in a nursing home be made uplifting?", "external_links": [], "published": "2015-07-28T15:01:00.000+03:00", "crawled": "2015-07-28T09:43:17.270+03:00", "highlightTitle": ""}