{"organizations": [], "uuid": "5af39f78504f66fd867040fdd8d67edd92faab8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03373/brownsea-boatUSE_3373502k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-13.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/activityandadventure/walkingholidays/11597198/UK-coastal-walks-Brownsea-island-Dorset.html", "country": "US", "title": "UK coastal walks: Brownsea island, Dorset", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "UK coastal walks: Brownsea island, Dorset - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T20:03:00.000+03:00", "replies_count": 0, "uuid": "5af39f78504f66fd867040fdd8d67edd92faab8c"}, "author": "Mark Rowe", "url": "http://www.telegraph.co.uk/travel/activityandadventure/walkingholidays/11597198/UK-coastal-walks-Brownsea-island-Dorset.html", "ord_in_thread": 0, "title": "UK coastal walks: Brownsea island, Dorset", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"Going to Brownsea is just like setting off on holiday,” says Phil Dyke, the National Trust’s coast and marine adviser, “You have to get there on a boat, it’s a proper journey. It feels like another world. Turn around and look at Poole and it seems miles away.” Once you have reached Brownsea Island, set spectacularly in the middle of Poole Harbour in Dorset, it will take just a short stroll to see what Phil means. • How the National Trust saved our coastline Heading west past the church, beside creeks and fallen logs mantled with ferns, it’s as if the nearby conurbations of Poole and Sandbanks occupy a different world. This is a five-mile walk – which wriggles around the contours, coast and modest hinterland of the island – and shows off the extraordinary variety of interest that Brownsea manages to shoehorn into its 500 acres. • The best hotels in Dorset Best known for its red squirrels - and as the birthplace of the scouting and guiding movements - Brownsea is set against the backdrop of the rolling Purbeck Hills and the stack-stump sentries of the Old Harry Rocks . Here you will find lowland heath, freshwater lakes, a lagoon, ponds, beaches, an abandoned village, reedbeds and wet meadows. This little island really does seem to have everything. Brownsea is set against the Purbeck Hills. You crane your neck to spot the red squirrels high in the pines, while at ground level are Emperor and Common Darter Dragonflies, as well as sky blue Skimmers. Look closely at the heathland and you might spot grasshoppers, Harvestmen, Assassin bugs, and many types of spider. • Great days out in the UK Brownsea’s history and human occupants have been just as varied. The island has been bombed, razed and subjected to attempts to create a self-sufficient Utopia. Ceramic shards dot the shoreline, remnants of the industry that once made Victorian drains and street guttering. The man behind that particular failed dream, William Waugh, built a miniature village for his workers, known as Maryland, named after his wife. Much later, Maryland was devastated by the Luftwaffe when Brownsea was illuminated with fires to divert raids destined for Poole and other south coast targets. Towering above all this though, is the shadow of the island’s former owner Mary Bonham Christie, whose motto was “wildlife first, people second”. She banned hunting and fishing, and went to considerable lengths to keep visitors from encroaching on the island. Look out across the harbour to the exclusive residential area of Sandbanks to see what the island might have become had it not been for the woman known as “the demon of Brownsea”. The only way to reach Brownsea Island is by boat Photo: AP Finally, towards the end of this walk, there is an option of a brief diversion into the land leased from the National Trust by the Dorset Wildlife Trust. A £2 entrance fee is charged here but it provides a chance to get close to the brackish lagoon, home in summer to nationally important colonies of sandwich and common terns. In winter, avocets, bar-tailed godwits, and dunlin arrive. There are three hides around the lagoon where you can take in the spectacle. “We are just half a mile from Poole” says Chris Thain, reserve manager for the Dorset Wildlife Trust. “but it’s that tiny bit of separation that makes Brownsea so phenomenal for wildlife.” Details Grade: Easy Distance: 1 mile (1.5km) Time: 20 minutes Terrain: Gentle terrain, though the paths are uneven in some places. Trail leaflets for other walks are available at the National Trust shop. Getting there By ferry: from Poole Quay and Sandbanks (every 30 minutes); also from Bournemouth and Swanage. A chain ferry travels from Shell Bay, Studland to Sandbanks every 20 minutes By foot: Poole Quay is a 0.5 mile (0.8km) walk through Poole town centre from Poole station. Shell Bay marks the eastern end of the South West Coast Path By bike: signed on-road cycle routes to Shell Bay and to Poole Quay from Poole By bus: Poole station to Poole Quay and Sandbanks, also Christchurch Quay to Sandbanks (June to September) By car: Poole Quay and Sandbanks are clearly signposted on roads approaching Poole. Shell Bay National Trust car park and non-National Trust car parks in Poole and Sandbanks Brownsea Island is in Poole Harbour Photo: Google The route Start: Path next to church, grid ref: SZ022876 1. Start the walk from the path next to the church and walk in the opposite direction from Brownsea Castle. Take the left fork in the path. Brownsea was the starting point for the Scout movement. Baden-Powell, the Scout founder, held the first camp here in 1907. The walk starts beside Brownsea Church Photo: AP 2. In autumn, this is a good place to see red squirrels as they feed on sweet chestnut and beech tree nuts. Carry straight along this path. Point of interest Red squirrels must gain over 10 per cent of their body weight to survive the winter. They're best seen in autumn when foraging for nuts. They can tell if a nut is rotten by its weight. Pine trees are particularly important for red squirrels and you'll often see chewed pine cones on the woodland floor. There are no grey squirrels on Brownsea even though they're usually better adapted to survive in this type of woodland than red squirrels. There are more than 60 types of tree to be seen including oak, beech, holly and ash. 3. At Rocket’s Corner, take the second left and continue through ideal red squirrel territory, with mature Scots pine trees on your left. Also look out for goldcrests in the woodland – distinguished by a bright yellow stripe on their head, they tend to live high up in the canopy. They're the smallest European bird and have a suitably small call – more of a high-pitched squeak. Other birds that can be spotted at Brownsea are the avocet (over 1,000 roosting in winter), peregrine, little egret and kingfisher in winter, and terns, gulls and oystercatchers in summer. Birds in the reedbeds include grebes, coot and the shy water rail, with its distinctive ‘pig-squealing’ call. Brownsea also has internationally important birds such as the bar tailed godwit. Point of interest Brownsea Island's many and varied habitats include pinewood, heath, mixed woodland, shore and lagoon, which support a wide array of wildlife. The Victorians introduced sika deer from Japan, which soon swam across the water and colonised the mainland. Look for them in reedbeds. You can also spot common lizards and red squirrels. The wetlands on the island support sea lavender, common spotted orchids and marsh cinquefoil, and there are more than 60 types of tree to be seen including oak, beech, holly and ash. The island is covered in varied habitats, including forest and wetland Photo: AP 4. Note that the pine woodland here is regenerating. This must be managed carefully to conserve the red squirrel population. Take the next path on your left. 5. Pass a track on your left, and then take the path that bears left. In this area, volunteers have recently removed rhododendron (an invasive foreign plant) to maintain the diversity of native plant and animal species. The lakes on Brownsea (which resulted from peat digging) attract many insects, including 24 species of dragonfly such as the small red damselfly and the ruddy darter. There are also green tiger beetles and many species of butterfly, such as the green hairstreak and small copper. Point of interest The wetlands on the island support sea lavender, common spotted orchids and marsh cinquefoil. Water voles are extremely shy (and rare) so it takes a lot of patience to spot them in the wetland areas they inhabit. Not to be confused with rats, water voles have a blunter, rounder face. Water voles may be seen on the island, but are extremely shy (and rare) Photo: AP 6. At the farm buildings turn left, then follow a path until you again reach the church at the start of your walk. Alternatively, take a right towards Brownsea Castle. Here, there are facilities including a National Trust shop, toilets and café. End: Path next to church, grid ref: SZ022876 Facilities Toilets (including accessible toilet) and baby-changing facilities Tea-room Shop Children's quiz/trail and family activity packs All-terrain buggies and wheelchairs for loan (Call 01202 707744 to pre-book. Wheelchair users advised to contact ferry operators in advance) Tractor trails (booking essential) This article was originally published in 2012 and was updated and republished in May 2015. More great coastal walking holidays in Britain • Blakeney, Norfolk • Gower peninsula, Wales • Whitehaven, Cumbria • Prawle Point, Devon • White Cliffs of Dover • Old Harry Rocks, Dorset • Lindisfarne and Holy Island, Northumberland • Stonebarrow, Dorset • Runkerry, Northern Ireland • Stackpole, Wales Follow @telegraphtravel", "external_links": [], "published": "2015-07-13T20:03:00.000+03:00", "crawled": "2015-07-13T15:05:19.000+03:00", "highlightTitle": ""}