{"organizations": [], "uuid": "b814c0bec7fa26762ca3e6e173538c47dc8af9c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stripes.com", "main_image": "http://www.stripes.com/polopoly_fs/1.359571.1437752913!/image/image.jpg_gen/derivatives/landscape_490/image.jpg", "site_section": "http://feeds.stripes.com/starsandstripes/travel#", "section_title": "Stars and Stripes Travel", "url": "http://www.stripes.com/travel/porn-star-karaoke-night-draws-all-kinds-in-burbank-1.359579", "country": "US", "title": "Porn-star karaoke night draws all kinds in Burbank", "performance_score": 0, "site": "stripes.com", "participants_count": 0, "title_full": "Porn-star karaoke night draws all kinds in Burbank", "spam_score": 0.0, "site_type": "news", "published": "2015-07-24T18:46:00.000+03:00", "replies_count": 0, "uuid": "b814c0bec7fa26762ca3e6e173538c47dc8af9c9"}, "author": "", "url": "http://www.stripes.com/travel/porn-star-karaoke-night-draws-all-kinds-in-burbank-1.359579", "ord_in_thread": 0, "title": "Porn-star karaoke night draws all kinds in Burbank", "locations": ["Burbank"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: July 24, 2015 \nThe bar is packed, the crowd boozy as Allison Moore makes her karaoke debut with an old Katy Perry hit. \nMoore clutches the hand of makeup artist Constance Le as they belt out \"I kissed a girl, and I liked it!\" \n\"Yeah,\" emcee Nicki Hunter interrupts. \"I bet you did.\" \n\"I was so nervous!\" Moore, a busty brunette in a pair of hip-hugging jeans, says after her performance. She'd never had the nerve to sing before. \n\"I'll have sex in front of people,\" the star of \"My Dad's Hot Girlfriend 10\" and assorted other titles explains, laughing, \"but I won't sing.\" \nIf it's Tuesday, it must be Porn Star Karaoke night at Sardo's Grill & Lounge in Burbank, Calif.,the longtime haunt of the adult film industry. (\"If 'Cheers' had a bar porn-style, that's what Sardo's would be,\" says emcee Hunter, an actress in the industry.) \nFor the last 12 years, performers, producers, directors and crew of X-rated movies have come to the wood-paneled bar in a strip mall off the Ventura Freeway to sing — fully clothed — with their co-workers after a long day's work. \n\"This is a place where you can come and be yourself,\" says talent manager Tee Reel. \"The only other time you see people is on set, and it's hard to talk when you're naked.\" \nThese are not the best of times for the adult film industry. Free porn on the Internet and online piracy have sapped DVD sales. After the 2012 passage of a controversial Los Angeles County law ordering performers to use condoms, shoots plummeted in a city that once produced porn like Detroit produced cars. \nAs the industry changes and as workers find themselves scattered, going out of town and state to find work — the sense of community and networking opportunities created by Porn Star Karaoke are more important than ever, Hunter says. \n\"It really is a family,\" she says. \"We get to know each other pretty personally on set. I mean, we're kind of having sex with each other. There are special bonds and relationships that you end up creating. And in the older days, it was much more of that.\" \nAt Sardo's, she says, industry workers still hold parties for birthdays and movie releases, still check in on one another, still hang out with their fans in a safe environment. \n\"A piece of your heart and soul is here,\" Hunter says of Sardo's. \"This is kind of the hub where you can tell the temperature of the porn industry.\" \nBefore she begins emceeing, Hunter lists some of the rules for Porn Star Karaoke (basically, take the rules of a porn shoot and do the opposite): \"No flashing. No nudity. No sex in the bathroom...\" \n\"...or by the ATMs,\" the bar's owner interjects. \n\"The ATMs?!\" Hunter asks. \"Who's doing that?\" \n\"A lot of people in the beginning because the lighting was better.\" \nThe bar owner's name is Seymour Satin. Unlike the actresses and actors singing in his bar, he came by his improbable-sounding name the old-fashioned way: by birth. \nSatin, a bespectacled former librarian for an oil company, became the manager of Sardo's in 2003 and turned it into a karaoke bar that still hosts trivia nights and Family Karaoke Fridays, where little boys and girls sing \"Twinkle, Twinkle, Little Star.\" \nHe'd been on the job only a few months and was trying to make a name for himself when a group of adult-film stars, led by a male performer whose nom de porn was Wankus, walked in and told Satin they'd been looking for a place to sing karaoke but kept getting kicked out. Would he mind if they sang here? \nSure, why not? Satin said. \nHe had watched only a handful of adult films in his life — one accidentally when he thought he was renting Quentin Tarantino's \"Pulp Fiction\" and instead got \"Pulp Friction.\" (Even now, when actors ask him to give feedback on their movies, he fast-forwards through the sex scenes because it makes him uncomfortable to watch people he's friends with have sex on screen.) \nBut a week after Wankus showed up, dozens of porn stars came to Sardo's. For years, there was a line to the door that wrapped around the block. Between beers, executives cut film deals. Between songs, performers accepted roles in upcoming shoots. \nMore than 10 years later, Wankus is gone, having left the porn industry to find God. But Porn Star Karaoke remains, even if the size of the crowd has waxed and waned with the business. \nLately, Satin has been trying to build his business back up after a February kitchen fire left Sardo's so badly damaged that the bar closed for about three months. The adult-film actors were some of the first to come back. \nSatin, 57, who became the bar's owner about five years ago, said he's shared holiday dinners with porn actors and actresses and their kids. He brags about an actress working on her doctorate. When Hunter was diagnosed with Stage 4 leukemia a few years back, her industry co-workers rallied around her, hosting fundraiser after fundraiser at Sardo's, Satin recalled. \n\"I'm just amazed at some of the good-hearted people,\" he says. \"It's a good community, but people don't see that side of it.\" \nOn this night, some of the first people to take the microphone aren't in the business. One sings the Foundations' \"Build Me Up Buttercup\" as a TV screen behind him shows selfies of adult-film stars. Another sings a Roy Orbison song, followed by a man in a bowler hat who shouts, \"We're gonna keep it in the '80s!\" before launching into a Depeche Mode tune. \nBy 11 p.m., there are a lot of porn people in the room. Hunter calls them out on the mike as they walk in, yelling, \"We've got some sexy porn stars here! Hi, honeys!\" \nShe teases a man in the audience, who's celebrating his birthday: \"Do you have a girlfriend? A wife? No? So lipstick around the collar is OK?\" \nA petite actress and producer named Lucky Starr, wearing a faux flower in her hair, belts out the show tune \"All That Jazz\" as she stands on a chair. When a middle-aged, mustachioed man goes up to sing, he shakes his hips at Starr, who just laughs and shrugs. She has her share of guys who try to hit on her, she says, but you just have to know how to handle them. \n(\"They don't understand sex is our job,\" she says later. \"If I were an accountant, would you come to this bar and just plop your taxes down and say, 'Hey, can you do this for me?' No.\") \nAnother actress with wildflowers tattooed on her calf breathlessly raps the Beastie Boys' \"Paul Revere.\" \n\"One lonely Beastie I be, all by myself without nobody \nThe sun is beating down on my baseball hat. \nThe air is getting hot, the beer is getting flat.\" \nShe finishes with a curtsy. \nAnother actress in cutoff jeans and a lacy bustier gives an off-key but spirited performance of the Spice Girls' \"Wannabe.\" The lyrics move fast, and she gets a few beats behind. But women in the audience don't care. They love that song — like, really love it — and sing with her. \n\"If you wanna be my lover, you gotta get with my friends. \nMake it last forever. Friendship never ends.\" \nWhen she's done, the actress hugs actor James Bartholet, star of such films as \"Beverly Hillbillies XXX,\" who just came from a shoot and is wearing a stocking cap that says \"Porn Star.\" \nHunter calls up a few porn stars to help pass out the door prize — free porn DVDs — to whoever shouts the loudest. One of the winners is regular attendee LaTerra McDaniels, who wants to be a sex educator — the \"black Dr. Ruth,\" she says. \n\"It's just cool because the porn stars are regular people,\" she says. \"There shouldn't be a separation between them and the public because of what they do for a living.\" Join the conversation and share your voice. \nShow Comments", "external_links": [], "published": "2015-07-24T18:46:00.000+03:00", "crawled": "2015-07-24T23:31:21.998+03:00", "highlightTitle": ""}