{"organizations": [], "uuid": "6ce1b060c41c59ed3b71c9021d7df6e38f52184e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/airportairline/27963-qatar-airways-cargo-launches-door-to-door-courier-solution", "country": "US", "title": "Qatar Airways Cargo launches door to door Courier solution", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Qatar Airways Cargo launches door to door Courier solution", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T13:15:00.000+03:00", "replies_count": 0, "uuid": "6ce1b060c41c59ed3b71c9021d7df6e38f52184e"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/airportairline/27963-qatar-airways-cargo-launches-door-to-door-courier-solution", "ord_in_thread": 0, "title": "Qatar Airways Cargo launches door to door Courier solution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Qatar Airways Cargo launches door to door Courier solution Qatar Airways Cargo launches door to door Courier solution Details Category: Airport & Airline   11:15 Qatar Airways Cargo will launch an express airfreight service for door-to-door and time-critical shipments. The new QR On-Board Courier service will be rolled out across the cargo carrier’s global network on 1 August 2015, enabling customers to book time-definite airfreight delivery solutions.. \nQR On-Board Courier will provide bespoke transportation services, which meet customers’ specific requirements, with dedicated couriers accompanying each shipment from collection to delivery direct to the recipient. The Qatar Airways Cargo team will provide a comprehensive booking service for customers from flight reservations to entry requirements and customs regulations anywhere in the world. The maximum level of security will also be provided for customers’ courier shipments. Ulrich Ogiermann, Qatar Airways’ Chief Officer Cargo, said: “Time matters to our customers, and Qatar Airways Cargo’s new On-Board Courier service will focus on speed of delivery providing reliable transportation solutions to meet the demands of time-sensitive industries such as the high tech and automotive sectors. With Qatar Airways’ global network operating to 150 destinations, this premium service will be invaluable for multinational businesses that are at risk of supply chain delays.” Customers will be able to track the real-time progress of their shipment at any time by using the online tracking system available on www.qatarairwayscargo.travel. The QR On-Board Courier service will appeal to leading brands and suppliers in the automotive, financial, energy, pharmaceutical, medical and fashion sectors for transportation of time-critical spare parts, samples, prototypes and important documents. Qatar Airways Cargo is the world’s fifth largest airfreight airline and operates one of the most modern fleets in the sky with eight B777Fs and six A330Fs. The airline recently announced a firm order for four B777 Freighters at the Paris Air Show on 18 June, and this is in addition to an existing order for four B777Fs and two firm A330Fs with options for a further eight. The cargo airline operates from its state-of-the-art hub Hamad International Airport, where its cargo terminal is one of the largest in the world. Operating an advanced air cargo handling system, the cargo complex has a capacity to process 1.4 million tonnes of cargo per year and can accommodate 11 wide-body freighters with 42 airside loading docks to facilitate the swift and efficient transfer of cargo in to and out of Qatar. Related articles", "external_links": [], "published": "2015-07-30T13:15:00.000+03:00", "crawled": "2015-07-30T13:20:38.898+03:00", "highlightTitle": ""}