{"organizations": [], "uuid": "d214604424f87203e5c2dd1477cea1ff4c50c131", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.independent.ie/sport/soccer/article31353794.ece/ALTERNATES/h342/PANews_P-3e772d6b-f7c0-41ec-8340-3d53ca021ace_I1.jpg", "site_section": "http://www.herald.ie/lifestyle/travel/", "section_title": "Travel - Herald.ie", "url": "http://www.herald.ie/sport/soccer/sean-odriscoll-named-as-new-liverpool-assistant-manager-31353993.html", "country": "", "title": "Sean O'Driscoll named as new Liverpool assistant manager", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "Sean O'Driscoll named as new Liverpool assistant manager - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T16:13:00.000+03:00", "replies_count": 0, "uuid": "d214604424f87203e5c2dd1477cea1ff4c50c131"}, "author": "Carl Markham", "url": "http://www.herald.ie/sport/soccer/sean-odriscoll-named-as-new-liverpool-assistant-manager-31353993.html", "ord_in_thread": 0, "title": "Sean O'Driscoll named as new Liverpool assistant manager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Liverpool have confirmed the appointment of Sean O'Driscoll as their new assistant manager. Sean O'Driscoll Carl Markham – 06 July 2015 08:13 AM\nThe former Bournemouth, Doncaster, Crawley, Nottingham Forest and Bristol City boss moves to Anfield after a spell in charge of England Under-19s.\nThe 58-year-old takes over as Brendan Rodgers' number two from Colin Pascoe, who was sacked last month following a robust end-of-season review.\nFormer defender Sami Hyypia, who has managed Bayer Leverkusen and Brighton, and ex-assistant to Rafael Benitez Pako Ayesteran, who recently left his job with Maccabi Tel Aviv having led them to a domestic treble, were both linked with the vacancy when the departures of Pascoe and Marsh were announced a month ago but the recruitment process is still ongoing.\nThe majority of Liverpool's squad, including all their England internationals - which also means want-away winger Raheem Sterling, for whom the club have rejected two bids from Manchester City - will report back to Melwood after their summer break.\nNew arrival James Milner, who arrived on a free transfer from City, will be present while fellow new signing Danny Ings, the Burnley striker, is cutting short the extended summer break he was entitled to having been involved with England's Under-21s in the European Championships having made the personal decision to come back early and is likely to join up with his new team-mates on Wednesday.\nBrazil internationals Philippe Coutinho and Roberto Firmino, who has yet to have his medical having agreed a £29million deal to move from Hoffenheim, are not scheduled to return for some time following their recent involvement in the Copa America.\nLiverpool fly out to Bangkok next Sunday for the first leg of their pre-season tour of Asia and Australia.", "external_links": ["http://www.independent.ie/sport/soccer/article31353794.ece/2fa5c/ALTERNATES/h342/PANews_P-3e772d6b-f7c0-41ec-8340-3d53ca021ace_I1.jpg"], "published": "2015-07-06T16:13:00.000+03:00", "crawled": "2015-07-06T16:44:22.000+03:00", "highlightTitle": ""}