{"organizations": [], "uuid": "e47b8a92482b64a4d22d13dbd9bd1f87fe439fc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/150725shooting.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/07/25/another-day-another-incomprehensible-massacre", "country": "US", "title": "Another day, another incomprehensible massacre", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Another day, another incomprehensible massacre -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-25T17:00:00.000+03:00", "replies_count": 0, "uuid": "e47b8a92482b64a4d22d13dbd9bd1f87fe439fc4"}, "author": "Joel Achenbach | The Washington Post", "url": "http://www.ticotimes.net/2015/07/25/another-day-another-incomprehensible-massacre", "ord_in_thread": 0, "title": "Another day, another incomprehensible massacre", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Another day, another massacre, and once again it’s a gunman targeting strangers in a public place for no obvious reason. Each of these mass shootings, or rampage shootings, or “active shooter” events, has its special element of horror, whether it’s racism, or misogyny, or sheer randomness. In this case, the victims were doing nothing more exotic than watching the new Amy Schumer movie, “Trainwreck.”\nThe killer sat behind them, alone in the dark. Then the shooting began.\nAuthorities in Lafayette, Louisiana, identified the shooter as a 59-year-old drifter from Alabama who had been staying at a nearby motel. He killed two people and wounded nine others before taking his own life.\nIt has been three years since a similar tragedy occurred, when a mentally troubled and heavily armed PhD student opened fire at a midnight showing of a new “Batman” movie in a theater in Aurora, Colorado. Since then, the United States has seen a number of shootings in public places with elements that seemed designed for maximum shock value.\nTheir unpredictable nature creates the sense that we’re all caught in a great national crossfire. The motives have been all over the place. So have the locations: a historic African-American church, a military recruiting office and now a cinema, just in the past few weeks. The killers have shot up colleges, elementary schools, restaurants, shopping malls and government offices.\n“With these types of incidents, everyone and anyone could be the next victim. And there’s really nowhere we’re safe out in the public — or at least that is the perception,” said Adam Lankford, a criminal justice professor at the University of Alabama who has studied what he prefers to call “rampage shooters.”\nThe mass shootings are paradoxical in the broader picture of crime in America: The murder rate nationally has been halved in the past two decades. But homicides with four or more victims have held basically steady. Then there are these special “active shooter” events, which appear to be on the rise.\nA 2014 FBI study of 160 active shooter events since 2000 showed a staggered increase over time, with the four most violent years occurring in the last five years of the survey. Criminologist James Alan Fox of Northeastern University has questioned the rigor of the FBI calculation, saying it may be influenced by media reports. But if this is a real trend and not a fluke — a spike that will be followed by a drop in such incidents — then it is one not easily explained. This appears to be an emergent phenomenon with no single cause and no simple fix.\nWith so many motives in play, it’s hard to know how to screen potential mass shooters, said Christopher Ferguson, a psychology professor at Stetson University who specializes in criminal psychology.\n“We’re playing whack-a-mole with these things,” Ferguson said.\nSome of the shooting rampages in the past two decades have had a narcissistic element, said Jean Twenge, a professor of psychology at San Diego State University and co-author of “The Narcissism Epidemic.”\nShe cited the 1999 Columbine massacre, in which one of the killers talked in a video about getting “the respect we’re going to deserve,” and the 2007 Virginia Tech shootings, where the killer paused early in the episode to mail a media package to NBC News.\n“It’s not just a crime, it’s not just homicide, it’s this attention-seeking that seems to play a key role in these mass shootings,” Twenge said.\nIn the world of crime statistics, an incident with a total of three dead, including the gunman, wouldn’t traditionally qualify as a “mass shooting,” even though that’s exactly what the Lafayette shooting was. The standard has traditionally been four dead, but a federal law passed in 2013, after the Sandy Hook school shooting in Newtown, Connecticut, changed the statistical standard to three deaths.\nThe common element in mass shootings is, by definition, the use of firearms. Some of the killers have been “pseudocommandos” who have used multiple weapons. The political establishment has taken no action on gun laws in recent years, however, because the electoral math has inhibited efforts to challenge the gun lobby.\nThe orthodoxy among political advisers for candidates is that no one votes for a candidate because of his or her support of gun control laws, but lots of people will vote against him or her for that single reason. The National Rifle Association continues to take a hard-line stance on gun rights and the Second Amendment, and it can back up that position with muscle at the polls.\nPresident Barack Obama thought he could push through gun legislation after the Sandy Hook shooting, but he and his allies got nowhere on the issue. Just hours before the Lafayette theater shooting, Obama told the BBC that the area where he has been “most frustrated and most stymied” in his tenure is on the gun issue.\n“The United States of America is the one advanced nation on earth in which we do not have sufficient common-sense gun-safety laws. Even in the face of repeated mass killings,” Obama said.\nFrustration isn’t a plan, though, and the criminologists say there are steps the United States could take that might indirectly limit these kinds of active-shooter incidents, even though it might be hard to measure success.\nFerguson, the Stetson professor, said the United States should provide more access to long-term mental health care. Most people with mental illness are not violent. But it’s the right thing to do in any case, he said. Lankford, the University of Alabama professor, noted that suicidal tendencies are a common thread in many active-shooter cases.\n“It’s clear that social isolation is a risk factor for suicidal behavior in general. Having real friends, close face-to-face friends, those people can be moderating forces on your moods. They can help you get treatment if you really need it,” Lankford said.\nThese ideas were echoed Friday by Fox, the Northeastern professor and author of “Extreme Killing: Understanding Serial and Mass Murder.” Fox said there’s no way to screen society for mass killers — they’re just too rare, and their actions are too unpredictable. “It’s a matter of a very large haystack and very few needles,” Fox said.\nThe killers “tend to be people who are failures,” he said. “They failed at jobs, they failed at education, they failed at marriages, and their ability to cope with life’s frustrations begins to wear thin. They’re isolated. They don’t have a lot of close friends around to serve as a support system or a reality check.”\nThat suggests to Fox something that everyone can do to make some marginal difference in the violence that afflicts the nation: We can get to know our neighbors again. We can connect in real life and not just online. We can help people who obviously need it.\n“We often-times try to avoid people who seem angry, because we don’t know what to say and what to do. That’s the wrong move,” Fox said. “We can try to restore the sense of community in our neighborhoods, in our workplaces, in society more generally.”\n© 2015, The Washington Post", "external_links": [], "published": "2015-07-25T17:00:00.000+03:00", "crawled": "2015-07-27T00:04:41.779+03:00", "highlightTitle": ""}