{"organizations": [], "uuid": "313065b9bf61a4ad3342c89a128effcc125ad6af", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/12/Hampton-logo.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hampton-inn-suites-opens-georgetown-texas/", "country": "US", "title": "Hampton Inn & Suites opens in Georgetown, Texas - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Hampton Inn & Suites opens in Georgetown, Texas - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "313065b9bf61a4ad3342c89a128effcc125ad6af"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hampton-inn-suites-opens-georgetown-texas/", "ord_in_thread": 0, "title": "Hampton Inn & Suites opens in Georgetown, Texas - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hampton Inn & Suites opens in Georgetown, Texas Published on : Tuesday, July 14, 2015\nHilton Worldwide announced the opening of Hampton Inn & Suites by Hilton Georgetown/Austin North, its newest property to join Hampton by Hilton, the global brand of more than 2,000 mid-priced Hampton Inn by Hilton, Hampton Inn & Suites by Hilton and Hampton by Hilton hotels. The 78-room hotel, located at 160 River Oaks Cove, Georgetown, Texas, is managed by Lalani Lodging, Inc. It is the first Hampton by Hilton property in Georgetown, Texas.\nThe new Hampton Inn & Suites by Hilton Georgetown/Austin North is located near the San Gabriel River and Hill Country which are home to many major events throughout the year such as the F1 Grand Prix, Motor GP racing, the Annual Poppy Seed Festival and university football.\n“Not only is our hotel located in a prime location for leisure travelers to take advantage of Georgetown’s attractions, but our proximity to businesses such as Dell Worldwide, Farmers Insurance and IKEA give our corporate guests a convenient and comfortable place to stay while traveling for work,” said Kary Lalani, Vice President, Lalani Lodging, Inc. “We look forward to welcoming both business and leisure travelers to Georgetown.”\nHampton Inn & Suites by Hilton Georgetown/Austin North offers amenities, such as free Wi-Fi, a 24-hour business center with complimentary printing, a 900 square foot meeting space that can accommodate up to 50 people and a fitness center. Guests can enjoy the outdoor pool in the warmer months. The hotel also provides free On the House hot breakfast as well as Hampton’s On the RunTM Breakfast Bags, available Monday through Friday.\nThe new hotel features the Perfect Mix Lobby, designed as an extension of the guestroom with a variety of seating and lighting options for both leisure and business travelers. Additionally, the hotel features Suite Shop, a food and beverage shop filled with snacks, toiletries, local merchandise and drinks for purchase.\nGuestrooms are equipped with the brand’s signature Clean and fresh Hampton bed®, LCD TV, microwave, fridge and coffeemaker. Inviting suites are also available, offering additional space and a comfortable sleeper sofa.\nHampton by Hilton team members proudly exhibit a unique culture described as Hamptonality. This term describes each hotel’s approach to friendly customer service and anticipation of guests’ needs and providing travelers with helpful suggestions about area attractions, historical facts and fun things to do around town. Additionally, hotels are infused with local photography and artwork, highlighting each property’s connection and support to its own community.\nHampton Inn & Suites by Hilton Georgetown/Austin North participates in Hilton HHonors®, the only hotel loyalty program that allows members to earn Points & Miles® on the same stay and No Blackout Dates on reward stays. HHonors members always get our lowest price with our Best Price Guarantee, along with HHonors Points, digital check-in and no booking fees only when they book directly through Hilton.\nRelated Posts 40% reduction in room rates in Grand Hyatt Taipei in July and August Express your love this Valentine’s Day at Calabash Cove Resort & Spa Jason Pomeranc, hotelier announces launch of new brand of hotel Sixty Hotels Melia Hotels International becomes a partner of the World Community Grid, initiative sponsored by IBM El Paso witnesses the opening of a new Hampton Inn & Suites", "external_links": [], "published": "2015-07-14T03:00:00.000+03:00", "crawled": "2015-07-14T23:01:03.000+03:00", "highlightTitle": ""}