{"organizations": [], "uuid": "929937327cd17d0ec615637ce0b7cfe942cf6599", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources1.news.com.au/images/2015/07/15/1227442/393921-2429a81c-2a82-11e5-a918-69a980c5d30d.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/airline-stops-redhead-from-boarding-due-to-white-sickly-skin/story-fn6yjmoc-1227442394384?from=public_rss", "country": "IL", "title": "Woman told she can’t fly, for a strange reason", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Woman told she can’t fly, for a strange reason", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:20:00.000+03:00", "replies_count": 0, "uuid": "929937327cd17d0ec615637ce0b7cfe942cf6599"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/airline-stops-redhead-from-boarding-due-to-white-sickly-skin/story-fn6yjmoc-1227442394384?from=public_rss", "ord_in_thread": 0, "title": "Woman told she can’t fly, for a strange reason", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What are these? Etihad has apologised over the incident. Source: Flickr \nETIHAD Airways has apologised to a Scottish family after airline staff prevented a red-headed teen with a naturally pale complexion from boarding, saying she looked “sickly”. \nGrace Wain, 14, was travelling with her family to the Maldives for a holiday on July 6. After arriving at the Manchester airport to catch a connecting flight to Abu Dhabi, the tired teen, who was standing close to her mother, was called out by an agent at the check-in desk. \n“Grace was a bit tired and hot and bothered. She was cuddling into her mum in the line,” father Paul Wain told the UK Mirror . \n“One of the Etihad check-in girls then made the decision that she wasn’t fit to fly based on the fact she was pale in colour and was leaning against her mum.” \nWain had reportedly been saving up for the exotic trip for years and the entire family became distraught at the prospect of missing their once-in-a-lifetime trip. After an airport paramedic performed a check-up and deemed Grace fit to fly, the Etihad staff still demanded that the Wains produce a doctor’s letter to confirm that Grace was well enough for the trip to Abu Dhabi. #SkrewyNews Airline Wouldnt Let a Girl Board cause She Looks Sick Turns Out Shes Just a Ginger http://t.co/HDct9TkLwH pic.twitter.com/ykmwlBF0j3 — 975 wabd (@975wabd) July 13, 2015 \n“I told them, ‘We live in Scotland.’ She is a redhead and she has a pale complexion. That’s just the way she is,” Paul Wain said. \nJust two hours before the Wains’ flight was scheduled to depart, they were able to obtain a letter from the family practitioner, at which point they were allowed to board. \nPaul Wain suspects the holdup had nothing to do with whether his daughter was healthy enough to fly but believes Etihad was trying to ground certain passengers due to an oversold cabin. \nBut the family’s ordeal did not end when they arrived in the Maldives. Etihad lost both parents’ luggage — and couldn’t deliver it for three days. \nEtihad issued the following statement: “Staff were concerned about the wellbeing of a young passenger ahead of a lengthy flight. The team called for a medic who examined the child and requested a ‘fit to fly’ letter from a doctor, allowing the family to board. \n“Our team on the ground continued to provide support ahead of the flight. Unfortunately, when the family arrived, some of their baggage was missing. The airline apologised and took all measures to find and deliver the baggage to the Wain family as soon as possible. Compensation in line with standard guidelines will be provided.” \nThis story originally appeared on the NYPost .", "external_links": [], "published": "2015-07-15T03:20:00.000+03:00", "crawled": "2015-07-15T03:38:25.000+03:00", "highlightTitle": ""}