{"organizations": [], "uuid": "a68a196d83599c84379779b64cf986e5bd4d1216", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03359/Getty-Queen-Elizab_3359271k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-05.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11706657/Mind-your-manners-Lewis-Hamilton.html", "country": "US", "title": "Mind your manners, Lewis Hamilton!", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Mind your manners, Lewis Hamilton! - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-05T16:01:00.000+03:00", "replies_count": 0, "uuid": "a68a196d83599c84379779b64cf986e5bd4d1216"}, "author": "Oliver Pritchett", "url": "http://www.telegraph.co.uk/goodlife/11706657/Mind-your-manners-Lewis-Hamilton.html", "ord_in_thread": 0, "title": "Mind your manners, Lewis Hamilton!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Queen recently gave Lewis Hamilton a lesson in dinner party etiquette , explaining that he should kick off by holding a conversation with the person seated on his left. • Deliciously Ella: the best dinner party recipes The rule is: speak to the person on one side of you during the first course, then turn the other way when the main course arrives. I’m not sure what happens when you get your pudding. This only works if everybody knows the rules. The Queen act can’t as umpire at every dinner party; she has better things to do. The racing driver was given some tips in dinner party etiquette (PA) At formal dinners I’ve never actually got round to holding a conversation, because there’s too much else to think about. While turning to the person on my left I have to be aware of the wine waiter homing in on my right, murmuring, “White, sir?” Bread rolls are coming in fast from the left and I’m already worrying about the main course when I will be bombarded on all sides, with vegetables to the left of me, wine to the right of me and gravy edging ever closer. • Celia Walden's etiquette-free dinner party • 7 rules for being a perfect guest I’m like a Spitfire pilot in a dog-fight and, in my imaginary headphones I hear, “Watch out, Tubby! Broccoli at nine o’clock!” Then there’s the mental arithmetic. I am asked to help myself to new potatoes. A quick count reveals that there are 29 left. The Lord Mayor's dinner at Mansion House is the sort of place where these things matter (Mary Turner/Getty) There are eight people still to be served, so that makes three and a bit each. But that man, over there, looks certain to take more than his share, so I’d better play it safe and help myself to two – plus maybe that piece of broken one. • Alan Titchmarsh: 'I'm obsessed with Debrett's This is no time for social chit-chat; I must also concentrate on the wine. Don’t drink too fast. There might be toasts. Leave a precautionary dreg. What would you say if you were seated next to Angela Merkel at dinner? (AFP) Finally I have a moment to speak to the lady on my right. “So, Mrs Merkel,” I say. “What do you do?” Follow @TeleGoodLife Follow @telegraph", "external_links": [], "published": "2015-07-05T16:01:00.000+03:00", "crawled": "2015-07-05T10:29:29.000+03:00", "highlightTitle": ""}