{"organizations": [], "uuid": "79f7a2b7445e9a47f28cd8fa62865d1b2e3c811d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources0.news.com.au/images/2015/07/31/1227465/315124-5c4cc7ee-3714-11e5-9208-acda9fc3b494.jpg", "site_section": "http://www.adelaidenow.com.au/travel/australia/victoria", "section_title": "Victoria | Travel Victoria | Melbourne Travel and VIC Holidays | The Advertiser", "url": "http://www.adelaidenow.com.au/lifestyle/the-five-workout-myths-you-should-ditch/story-fni0d7e6-1227465314744", "country": "US", "title": "How to get sixpack abs: 5 myths to avoid | The", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "How to get sixpack abs: 5 myths to avoid | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-08-01T02:18:00.000+03:00", "replies_count": 0, "uuid": "79f7a2b7445e9a47f28cd8fa62865d1b2e3c811d"}, "author": "ZAHRA BARNES", "url": "http://www.adelaidenow.com.au/lifestyle/the-five-workout-myths-you-should-ditch/story-fni0d7e6-1227465314744", "ord_in_thread": 0, "title": "How to get sixpack abs: 5 myths to avoid | The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THERE’S nothing more annoying than sticking to a healthy diet, logging countless hours at the gym, and still dealing with belly pooch that refuses to budge.\nUnfortunately, a lot of the methods you think sculpt flat abs are basically sexy-stomach saboteurs, and they’re keeping you from reaching your goals.\nThe good news: We’ve done some major myth busting to help you learn what actually works so you can get your best abs possible.\nMYTH: Carbs are the enemy\nIf you’ve been slashing carbohydrates like Freddy Krueger, this will come as a relief. “Some of my clients go on super restrictive diets that cut out entire food groups, like carbs, which drains their energy” says Jessica Cording, M.S., R.D., a dietitian in New York City. And that’s a huge blow to your calorie-torching power at the gym.\nWhile it’s true that overdoing refined carbs can lead to bloat and extra weight, you can’t perform at your peak fitness without a healthy carb intake. Your body needs carbohydrates from fruits, grains, and starchy vegetables to fuel itself for workouts and repair itself afterwards, says Cording. When your body has carbs to use as energy, you can power through your sweat sessions and sculpt a sexier midsection.\nMYTH: The sixpack is all that matters\nIf your workouts are giving all the muscles that make up your core FOMO, you’re doing it wrong. Here’s why: Your core includes all the muscles from just below your hips up to your ribs, says Mark Crabtree, C.S.C.S. If you want a well-defined midsection, you have to engage on all those areas, says Crabtree.\nAnd that’s especially true for your back — which helps give you good posture and automatically makes you look slimmer. You should also get in on some oblique action because those muscle fibres run at an angle, and when they get stronger, they pull your waist in, says Crabtree. They’re basically like your personal corset, minus the squished organs.\nMYTH: Your workout matters more than your diet\nFor visible abs, kick this myth to the kerb, and start getting your healthy meal planning on. “Even if you work your abs to perfection, those amazingly strong stomach muscles will never be visible if they’re covered in a layer of fat”, says Crabtree.\nSo load up on fruits, vegetables, lean protein, and whole grains, and pack your diet with bloat-blasting foods that aid digestion, like yoghurt or potassium-rich options like avocado, bananas, and salmon, says Cording.\nMYTH: Abs sculpting should be the last part of your workout\nCrabtree says that the traditional gym philosophy is to work your whole body first and train your core last. But if your number one goal is to seriously tone up that area, core work should be your top priority in your routine.\n“If you strengthen your core earlier in the workout, you’ll be less fatigued and better able to give it your full attention and energy,” he says. “Also, saving abs for the end of your workout might force you to rush through those exercises because you’re out of time.”\nMYTH: Crunches carve eye-popping abs\nMaybe you’ve heard this before, but it bears repeating: Crunches are not the ultimate abs sculptor. “Crunches and sit-ups are the mainstay of many people’s abdominal programs, but those two exercises alone won’t help you develop a defined stomach,” says Crabtree.\nThat’s because your core’s main priority is to protect your spine and keep you stable, but that typical sit-up motion isn’t targeting all the muscles used for that function. What you really need for a strong midsection are moves that strengthen all of your stability muscles, like the plank, he says.\n“I’ve been doing them for a long time, and I still think they’re very hard,” he says. Switch up your plank variations to keep them from getting boring.\nThis article originally appeared on The New York Post .\nOriginally published as The five workout myths you should ditch", "external_links": ["http://www.news.com.au/lifestyle/fitness/the-five-workout-myths-you-should-ditch/story-fnlsv23r-1227465314744", "http://nypost.com/2015/07/30/5-workout-myths-that-keep-you-from-sculpting-a-six-pack/"], "published": "2015-08-01T02:18:00.000+03:00", "crawled": "2015-07-31T13:26:02.092+03:00", "highlightTitle": ""}