{"organizations": [], "uuid": "880bbf3f11fe1cbabacb1b3a6ea855f4f6737157", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.couriermail.com.au", "main_image": "http://resources3.news.com.au/images/2015/07/17/1227445/460511-ef0a1606-247a-11e5-9034-065db1ff92dd.jpg", "site_section": "http://www.couriermail.com.au/travel/travel-advice", "section_title": "Travel Advice | Holiday and Travel Advice | The Courier-Mail", "url": "http://www.couriermail.com.au/travel/world/child-friendly-hotels-in-orlando-florida-theme-park-capital-of-the-world/story-fnjjvecd-1227445461024", "country": "US", "title": "Child-friendly hotels in Orlo, Florida, theme park capital of the world | Travel | Travel News and Holiday Deals | |", "performance_score": 0, "site": "couriermail.com.au", "participants_count": 1, "title_full": "Child-friendly hotels in Orlando, Florida, theme park capital of the world | Travel | Travel News and Holiday Deals | | The Courier-Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "880bbf3f11fe1cbabacb1b3a6ea855f4f6737157"}, "author": "couriermail.com.au", "url": "http://www.couriermail.com.au/travel/world/child-friendly-hotels-in-orlando-florida-theme-park-capital-of-the-world/story-fnjjvecd-1227445461024", "ord_in_thread": 0, "title": "Child-friendly hotels in Orlo, Florida, theme park capital of the world | Travel | Travel News and Holiday Deals | |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In this Florida city, Disney, Universal and SeaWorld are the big three parks, each attracting millions of visitors every year.\nThe city’s hotels, many of them on-site in the theme parks, burst with fun amenities, chances to meet beloved cartoon characters and rooms decorated in a spectrum of vibrant hues.\n Legoland Florida Resort is a new 152-room hotel built for kids. Picture: Chip Litherland Source: Supplied\n1. Legoland Florida Resort\nEverything is awesome in Orlando! Lovers of Lego rushed to be among the first guests to stay at the bricktastic Legoland Hotel, which opened at Legoland Florida Resort in May.\nFloating Lego bricks in the pool, a giant Lego pit in the lobby and a disco ball in the elevators amplify the fun factor.\nAt the on-site Bricks Family Restaurant, a kids-only buffet serves child-friendly breakfast items including mini hash browns, while the Skyline Lounge offers more adult-friendly fare and tipples.\nAll rooms at the 152-room hotel are themed and guests can choose from four styles: pretty in pink and purple Friends Sleepover Suite, the swashbuckling Pirates Suite, a royal castle recreated for the Kingdom Suite and the Adventure Suite, where guests can follow the exploits of Lego adventurer Johnny Thunder.\nAll rooms include two separate sleeping areas – a queen-sized bedroom for the grown-ups and a bunk bedroom with flatscreen TV for the ankle-biters. Totally awesome for all concerned.\nAll guests of the hotel enjoy early access to Legoland rides and attractions before the park opens each morning. With 68 million pieces of Lego used to create the attractions spread out across the park, there’s a lot to see and it’s a good idea to get a head start on the crowds.\nIt’s worth noting the resort is in Winter Haven, about 45-60 minutes from downtown Orlando. While it can easily be visited in a day in a rental car or Uber, it’s a long day and tiring for young travellers.\nStaying overnight at the resort makes more sense, especially when the hotel is this much fun.\n1 Legoland Way, Winter Haven\nlegoland.com\n Waldorf Astoria Orlando kids club. Orlando hotels for kids, Escape, July 19, Kellahan story Source: Supplied\n2. Waldorf Astoria Orlando\nA kids’ club they’ll love means free time for you and a happy holiday for everybody. At Waldorf Astoria Orlando’s WA Kids Club, bright-eyed and bushy-tailed carers lead littlies (ages 5-12) through the fun of poolside scavenger hunts, roasting marshmallows and making their own “Club Waldy” T-shirts. There’s an after-dark program on Friday and Saturday from 6-10pm, including dinner. The cost for one child to attend is $75; each additional child staying in the same room pays $25.\n14200 Bonnet Creek Resort Lane\nwaldorfastoriaorlando.com\n Hilton Orlando Resort is good for families. Source: Supplied\n3. Hilton Orlando Resort\nIn the centre of sunny Florida, Orlando enjoys year-round warm and humid weather that can escalate in summer. Keeping the kids cool is key, so look for a hotel with a superior pool. At Hilton Orlando Resort, handily located just off International Drive and close to Universal’s theme parks, the landscaped pool area is a highlight.\nA lazy river winds its way around jet sprays and gentle currents; grab one of the inflated doughnuts and drift along as you cool down. Kids flip for the water slide, while parents love the abundant deck chairs and pool bar and grill.\nHilton Orlando Resort\n6001 Destination Parkway\nthehiltonorlando.com\n4. Nickelodeon Suites Resort\nThe Nick Hotel, as it’s known, is more than a kid-friendly hotel: it’s a hotel made for kids and for adults who refuse to grow up. Where else would you experience mass sliming, Nick Live poolside and the opportunity to dine with SpongeBob SquarePants than at the first Nickelodeon-themed hotel in the world?\nTwo cool on-site water parks, a 4-D theatre, a kids’ spa, a miniature golf course and Studio Nick will keep kids occupied for days, so plan your Orlando trip to include plenty of time at the resort. If sibling bickering gets on your nerves, let them sort it out commando-style in the Teenage Mutant Ninja Turtles laser maze.\nNickelodeon Suites Resort\n14500 Continental Gateway\nnickhotel.com\n Watch Disney fireworks from rooms at the Four Seasons, Orlando. Picture supplied Source: Supplied\n5. Four Seasons Orlando\nOpened a year ago, Four Seasons Orlando is one of the most luxurious, and expensive, hotels in the area.\nIt is part of the Walt Disney World Resort megaplex and theme parks, and affords visitors the benefits of staying on site (early park access is a plus) while delivering a style aesthetic not dictated by Mickey and friends.\nMany of the hotel’s 443 rooms afford outstanding views of Disney’s regular fireworks displays.\nThe hotel’s spa organises special pampering for kids, with princess packages for girls (Disney dress-ups included) and shining knight makeovers for boys (we could nominate some grown men who might benefit from such a makeover).\nFour Seasons Orlando\n10100 Dream Tree Blvd,\nLake Buena Vista\nfourseasons.com/orlando\n The Hard Rock Hotel is great for teens. Picture: supplied Source: Supplied\n6. Hard Rock Hotel\nTeens will party like rock stars in the hotel’s 1115sq m pool with booming underwater sound system.\nDecorated throughout with memorabilia from famous musicians, the hotel can deliver on request a guitar and amp to your little aspiring muso’s room (save your eardrums, book a connecting suite).\nPart of the Universal family of attractions, the Hard Rock offers guests valuable time-saving benefits, including early park admission to the Wizarding World of Harry Potter and unlimited VIP access to skip the regular lines at Universal Studios and Universal’s Islands of Adventure.\nHard Rock Hotel\n5800 Universal Blvd\nhardrockhotelorlando.com", "external_links": ["http://resources2.news.com.au/images/2015/07/17/1227445/460690-d8c93876-25d4-11e5-b856-d650f72d3e25.jpg", "http://resources1.news.com.au/images/2015/07/17/1227445/460725-b2684c62-2507-11e5-a1dc-713890f6a5ce.jpg", "http://fourseasons.com/orlando", "http://resources0.news.com.au/images/2015/07/17/1227445/459772-eaac47e6-247a-11e5-9034-065db1ff92dd.jpg", "http://resources2.news.com.au/images/2015/07/17/1227445/460994-ff24a8fe-2514-11e5-a1dc-713890f6a5ce.jpg", "http://resources1.news.com.au/images/2015/07/17/1227445/460617-b33b727c-2507-11e5-a1dc-713890f6a5ce.jpg"], "published": "2015-07-18T03:00:00.000+03:00", "crawled": "2015-07-18T03:34:41.000+03:00", "highlightTitle": ""}