{"organizations": [], "uuid": "0d7f23c0716f8900d394f060fdc453ca23c8195f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03363/cunard3_3363655k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-04.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/cruises/11716396/Cunard-sails-into-the-history-books.html", "country": "US", "title": "Cunard sails into the history books", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Cunard sails into the history books - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T16:00:00.000+03:00", "replies_count": 0, "uuid": "0d7f23c0716f8900d394f060fdc453ca23c8195f"}, "author": "Kathy Arnold", "url": "http://www.telegraph.co.uk/travel/cruises/11716396/Cunard-sails-into-the-history-books.html", "ord_in_thread": 0, "title": "Cunard sails into the history books", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When the Royal Mail Ship Britannia swung out of Coburg dock in Liverpool on July 4 1840 and nosed her way into Halifax harbour on July 17, the world of travel changed forever. Not that the citizens of Nova Scotia’s capital were aware of this historic event: the ship docked at 2am. But headlines soon followed, trumpeting the news that this coal-fired, wood-built paddle-steamer had crossed the Atlantic in 12 and a half days. • Liverpool and Cunard: a very special relationship In the first decades of the 19th century, sailing vessels took between six and 12 weeks to make the trip. And since ships only departed when the hold was full of cargo, timetables were irregular. As for steam engines, they had been powering boats along rivers and lakes for half a century. They had even powered ships across the Atlantic. But Britannia broke new ground because she was fast, safe and did not run out of coal. Crossing at a steady eight-and-a-half-knots it proved that fixed schedules could be set. Britannia in 1840 International maritime transport never looked back – and neither did Samuel Cunard, the owner of Britannia, whose voyage will be re-created today when the Queen Mary 2 sets sail from Liverpool bound for the US exactly 175 years on. Sir Samuel’s home town Born in Halifax, Nova Scotia, Cunard was 52 years old when Britannia sailed into his home port. He was already a successful businessman and ship owner, but winning the contract to carry the Royal Mail from the UK to North America took him into a different league. He went on to build the Cunard Steamship Company and the wooden paddle steamer was soon joined by Acadia, Caledonia and Columbia. • Halifax, Nova Scotia: the highlights in Samuel Cunard's home port But what about Cunard the man? His bronze likeness stands on the Halifax waterfront, close to the piers where cruise ships now dock. Visitors strolling the promenade stop to look, rub one boot for luck and take a selfie. The statue is labelled: “Haligonian. World Benefactor”. With that description, you might think that the shipping magnate had long been a local hero. Not so: it was unveiled in 2006. By then, Halifax had been an important port for more than 250 years and that story is told in the Maritime Museum of the Atlantic. Its encyclopedic collection includes Cunard memorabilia, models and more. “Look at the emblem on the china,” says Curator Gerry Lunn. The blue lettering reads: British & North America Royal Mail Steam Packet Company. “No wonder it was shortened to Cunard,” he says, with a chuckle. The gallery of ship’s models includes the Cunard Line’s RMS Franconia. As Lunn points out, she was requisitioned as a troopship during the Second World War, continuing a tradition that Samuel Cunard had started in 1854, when he supplied ships for the Crimean War: “It was that contribution to the war effort, as well as his expertise, that was rewarded with a knighthood from Queen Victoria in 1859.” The Maritime Museum in Halifax Photo: Danita Delimont / Alamy In Halifax, walking in Cunard’s footsteps is easy. From the museum, follow Prince Street up the hill to Grand Parade. As old as the city itself, this swathe of green looks peaceful now. But, it resounded to military exercises during the war of 1812, when the USA threatened a land grab of Britain’s colonies in Canada. Local men, including Sam Cunard, volunteered for the Halifax Regiment. Rising to captain, he would have drilled his men here. On February 4 1815, Cunard turned up for a happier reason: his marriage to Susan Duffus in St Paul’s Church. Anyone who was anyone in Halifax society attended services in this white clapboard building. Small and simple it may look today, but when it opened in 1750, this was the first Anglican cathedral outside the British Isles. • The world's best cruise lines Like all bridegrooms, Cunard would have wanted to be on time. Then, as now, that meant checking the Old Town Clock. Set in an elegant, octagonal tower, it has kept reliable time since its installation in 1803. But when the bell chimes noon, the place to be is up the hill at the Citadel, for the firing of the Noon Gun. This daily tradition dates back to 1749, when Halifax was founded as a British military garrison to protect the huge, deep-water harbour. Nowadays, the star-shaped fort is looked after by Parks Canada, whose enthusiastic guides point out the Cunard connections: “Sir Sam’s father was a master carpenter here, so Cunard junior would have known his way about.” The flags that flew high above the ramparts identified ships as they entered the harbour, spreading the news to owners, customs agents, merchants and the rest of the townsfolk. This July, the arrival of RMS Queen Mary 2 will be signalled – no doubt via Twitter – but also in the time-honoured way, by the raising of a flag on the commercial mast. And the rangers will hoist the original 19th-century version, with a white star on a blue background. • Queen Mary 2: review From the Citadel, the whole of Halifax stretches out below. The long waterfront looks like a children’s book of boats brought to life. There are gigs, tenders and skiffs, imposing frigates of the Canadian Royal Navy and tubby, blue-and-white ferries chugging back and forth to the suburb of Dartmouth on the opposite shore. Only Liverpool’s “ferry ’cross the Mersey” is older than this saltwater service that has used oars, sail and even horses hitched up to a wheel to transport goods and passengers. In 1836, newfangled steam engines were introduced by the ferry company’s owner, the ever-innovative Sam Cunard. The harbour front in Halifax Photo: Prisma Bildagentur AG / Alamy Take away the 20th-century office blocks and much of downtown Halifax would be familiar to Sir Sam. He would recognise Upper Water Street, as well as the 18th and 19th-century Historic Properties on Privateers Wharf. In his day, carpenters sawed and dockers heaved cargo in and out of the warehouses; today’s buzz comes from boutiques and cafés; even a beauty salon. • Meet Cunard's first and only female captain At the far end of the waterfront is the Canadian Museum of Immigration at Pier 21. Between 1928 and 1971, one million passengers disembarked here, to begin a new life in a new country. In the Forties alone, 48,000 war brides arrived. Reunions with husbands were emotional, but as Curator Dan Conlin explains, not all wives recognised their husbands right away: “After all, they had been separated for months, the journey had been long, and the former soldiers were no longer in uniform.” The tradition of firing the Noon Gun is still maintained The museum is next to Pier 22, where the Cunard flagship, Queen Mary 2, will berth six days from now . There will be celebrations aplenty to mark the 175th anniversary of its ancestor steaming into port. RMS Britannia made her name carrying cargo and the Royal Mail; her descendants are today’s luxury liners. Boston bound In 1840, Halifax was the first port of call, but Boston was the ship’s final destination. Only a day after leaving Nova Scotia, RMS Britannia arrived in the capital of Massachusetts. No doubt the passengers, including Cunard and his 17-year-old daughter Anne, enjoyed the fanfare, let alone the new, state-of-the-art pier in East Boston, across the water from downtown. • Boston city guide Ever since, Boston has enjoyed its own “special relationship” with Cunard. Boston’s burghers were so enthusiastic that they threw a dinner for Cunard and subsequently presented him with an ornate, 32in silver cup. Displayed outside the Chartroom aboard Queen Mary 2, what is known as the Boston Cup was ordered from Shreve, Crump & Low. Founded in 1796 it is America’s oldest jewellery store, still open for business at 39 Newbury Street in Boston. An early Cunard poster The city did more than give Cunard silverware. Winters can be tough here; this year, for example, ice breakers were called in to keep Boston’s shipping channels open. Back in 1844, Mother Nature was even harsher: the harbour froze, stranding Britannia. For merchants it was the equivalent of the internet going down. So, they funded a rescue: for three days, some 1,500 men hacked through the ice, opening a 100ft-wide escape route that stretched for seven miles into the bay. • 175 years of Cunard Boston’s Cunard connection continued through good times and bad. During the Second World War Queen Mary was dry docked at the Naval Shipyard. Echoing Cunard’s efforts for the Crimean War, the liner was refitted as a troopship. When her namesake the Queen Mary 2 arrives in Boston this summer, it will be like a family reunion. The city is throwing a party: ships will gather in the harbour and fireworks will be launched. As it was in July 1840, the toast will be “To Sir Samuel Cunard”. How to do it An eight-day eastbound (New York to Southampton via Halifax) crossing on board Cunard’s Queen Mary 2 costs from £1,649 per person departing on July 24 2016 (0843 374 2224; cunard.co.uk ). For more information: destinationhalifax.com ; bostonusa.com Steam Lion: a biography of Samuel Cunard by John G Langley is available from Amazon ( amazon.co.uk ) from £10.35 Follow @telegraphtravel", "external_links": [], "published": "2015-07-04T16:00:00.000+03:00", "crawled": "2015-07-04T10:45:56.000+03:00", "highlightTitle": ""}