{"organizations": ["Concord Hospitality", "Goldman Sachs", "American Express", "Cambria Hotels & Suites Cambria", "We Care Trading Co. Ltd", "Choice Hotels International, Inc.", "Concord Hospitality Concord Hospitality Enterprises Company", "About Choice Hotels Choice Hotels International, Inc.", "Starwood", "Facebook", "Econo Lodge", "First Cambria Hotel", "We Care Ltd.", "Chelsea", "SVP of Upscale Brands", "Hilton", "NYSE", "Google", "Marriott", "Ascend Hotel Collection®"], "uuid": "66b9a20b50ac2e316cc070dfee930e69d28cc2de", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/all-pics/press_releases_6_article_600px.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13219957/1/choice-hotels-celebrates-the-grand-opening-of-the-first-cambria-hotel-suites-in-new-york-city.html?cm_ven=RSSFeed", "country": "US", "title": "Choice Hotels Celebrates The Grand Opening Of The First Cambria Hotel & Suites In New York City", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Choice Hotels Celebrates The Grand Opening Of The First Cambria Hotel & Suites In New York City", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T21:00:00.000+03:00", "replies_count": 0, "uuid": "66b9a20b50ac2e316cc070dfee930e69d28cc2de"}, "author": "", "url": "http://www.thestreet.com/story/13219957/1/choice-hotels-celebrates-the-grand-opening-of-the-first-cambria-hotel-suites-in-new-york-city.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Choice Hotels Celebrates The Grand Opening Of The First Cambria Hotel & Suites In New York City", "locations": ["United States", "Raleigh", "Washington", "N.C.", "New York City Cambria", "Md.", "D.C.", "Cambria", "ROCKVILLE", "Chelsea", "Concord", "New York City", "New York", "U.S.", "Canada", "Hyatt"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Chelsea", "Andrea Fasano", "Mark Laport", "Rob Chun", "Michael Murphy", "Spotify", "Macy", "Steve Joyce"], "text": "Choice Hotels Celebrates The Grand Opening Of The First Cambria Hotel & Suites In New York City By PR Newswire | 07/15/15 - 02:00 PM EDT Reprint ROCKVILLE, Md. , July 15, 2015 /PRNewswire/ -- Choice Hotels International, Inc. (NYSE: CHH), one of the world's largest hotel companies, celebrated the grand opening of the new Cambria hotel & suites in New York City's Chelsea neighborhood. Owned by We Care Trading Co. Ltd and operated by Concord Hospitality, Cambria hotel & suites New York - Chelsea is located at 123 West 28th Street and sits in the middle of the eclectic Flower District, which is brought to life in the hotel's design and decor. The neighborhood inspiration was highlighted in last night's garden party-themed grand opening celebration. Guests were treated to flower-inspired signature cocktails and fresh local fare, took exclusive tours of the property, and mingled with key leaders in the hospitality industry, including Steve Joyce , President and CEO of Choice Hotels, Michael Murphy , SVP of Upscale Brands at Choice Hotels, Mark Laport , CEO of Concord Hospitality, and property owner, Rob Chun . The event was also attended by Andrea Fasano , Choice Hotel's Ultimate People Person, who is currently out on the road representing Choice and creating meaningful, in-person connections all over the United States this summer. \" New York City is one of the liveliest, most beautiful, bustling cities in the world and we're thrilled to introduce the Cambria brand to business and leisure travelers visiting the Big Apple,\" says Steve Joyce , President and CEO, Choice Hotels International. \"With companies like Google, Goldman Sachs, Spotify and American Express nearby, we are able to give travelers something that is often hard to find in New York - stylish, affordable lodging with upscale service.\"Within walking distance of Penn Station, Madison Square Garden , Macy's Herald Square, the Empire State Building and Times Square, the 135 room hotel offers sleek, modern rooms in one of the city's hippest neighborhoods. Guests can also enjoy the property's Social Circle™ Bistro Restaurant, open morning and night serving a locally inspired menu and craft beer, or they can enjoy a drink on the rooftop lounge which showcases amazing downtown views all the way to the World Trade Center. In addition, business travelers can utilize the property's business center and meeting rooms, which are perfect for accommodating conferences and banquets. \"We're excited to operate this hotel for We Care Ltd. and Choice Hotels, and to make our mark on the unique Chelsea market,\" said Mark Laport , CEO of Concord Hospitality. \"At Concord, we're constantly looking for opportunities to grow in top-tier, urban markets. Given the success in opening our Cambria hotel & suites Washington, D.C. last year, we're thrilled to be involved in this hotel as a second New York City Cambria is coming this fall in Times Square.\"The Cambria hotel & suites New York - Chelsea is accepting reservations now. Visit www.cambriahotelsandsuites.com to book your next stay and connect with Choice Hotels on Facebook . About Cambria Hotels & Suites Cambria hotels & suites makes business travel easier—and more fun—than ever before. Offering modern decor, rooms that feel like an upgrade, and fresh, local cuisine at our Social Circle™ restaurant, Cambria makes every guest feel like a VIP. As of February 15, 2015 , there are 24 properties open across the country and 25 under development in the U.S. and Canada . To learn more, visit www.cambriahotelsandsuites.com . About Choice Hotels Choice Hotels International, Inc.® (NYSE: CHH) is one of the world's largest lodging companies. With more than 6,300 hotels franchised in 35 countries and territories, we represent more than 500,000 rooms around the globe. As of March 31, 2015 , 615 hotels were in our development pipeline. Our company's Ascend Hotel Collection®, Cambria® hotels & suites, Comfort Inn®, Comfort Suites®, Sleep Inn®, Quality®, Clarion®, MainStay Suites®, Suburban Extended Stay Hotel®, Econo Lodge® and Rodeway Inn® brands provide a spectrum of lodging choices to meet guests' needs. With more than 23 million members and counting, check out our Choice Privileges® rewards program to see how you can reap the benefits of being a member of the Choice Hotels® family. Visit us at www.choicehotels.com for more information. Additional corporate information can be found on the Choice Hotels International, Inc. web site, which may be accessed at www.choicehotels.com . About Concord Hospitality Concord Hospitality Enterprises Company, an award-winning hotel management and development company based in Raleigh, N.C. , manages over 90 hotels offering more than 11,500 guest rooms in 22 states and two Canadian provinces. The company operates hotels and resorts under such well-known industry elite brands as Marriott, Hilton, Hyatt, Starwood, and Choice Hotels, as well as select independent boutique hotels. Formed in 1985, Concord recently was listed as one of the nation's top management companies in the nation by independent sources, and recently won Marriott's elite Partnership Circle award for the eighth time. Concord properties are some of the most awarded hotels in the country, having won nearly 100 top honors in the past two years alone. For more information, visit www.concordhotels.com .", "external_links": [], "published": "2015-07-15T21:00:00.000+03:00", "crawled": "2015-07-15T21:21:58.000+03:00", "highlightTitle": ""}