{"organizations": [], "uuid": "c1e9d6816ae29d04a65cc837d6a45bd97b9eca67", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03365/custarrdmain_3365770k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-07-06.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/foodanddrink/11720120/No-more-lumps-how-the-Brits-have-gone-crazy-for-custard-once-more.html", "country": "US", "title": "No more lumps: how the Brits have gone crazy for custard once more", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "No more lumps: how the Brits have gone crazy for custard once more - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T18:32:00.000+03:00", "replies_count": 0, "uuid": "c1e9d6816ae29d04a65cc837d6a45bd97b9eca67"}, "author": "Felicity Spector", "url": "http://www.telegraph.co.uk/foodanddrink/11720120/No-more-lumps-how-the-Brits-have-gone-crazy-for-custard-once-more.html", "ord_in_thread": 0, "title": "No more lumps: how the Brits have gone crazy for custard once more", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "It begins, as these things do, with a tart. An amber-hued disc of just-set wobbliness, housed in the thinnest, crispest pastry, baked daringly dark. A vamped-up custard tart which proved so instantly popular that word went round: ring ahead to make sure they save you a slice. With limited oven space, newly-opened East London pub The Marksman could scarcely keep up with demand. By midweek, a waitress told me, people were already calling to reserve pieces for Sunday lunch. The pub's Tom Harris says he's not surprised his dessert \"went mental\". You can't go wrong with custard, he tells me. \"It's basically the most popular ingredients in the western diet - eggs, sugar and milk - three familiar staples, but when they're brought together it becomes a really luxury item.\" • Deliciously Ella's light summer recipes Luxury, with a side of nostalgia. \"When I was growing up, my dad could go through a bowl of custard on its own. We always had to make twice as much so we could have it the next day, cold. For anyone British, it basically runs through your blood.\" Smash hit: the Marskman's custard tart Harris isn't the only chef to be making custard a star of his menus . For classically-trained chef Alan Pickett, it's a taste of childhood. He waxes lyrical about his gran's jam tarts and pies made with fruit from his mum's allotment: the 1950s thrift which meant everything in the larder had to be used. \"Even a jug of Birds gives you that homely feel.\" For his soon-to-be opened restaurant, Piquet, he's constructed a rhubarb fool, scouring antique shops for the right shaped glasses to show off its many layers. \"I know what it should look like in my head. There's a layer of jelly, then the fruit mixed with cream and yohghurt, a crumble on top - and then custard.\" But not just any custard: this one is enriched with extra yolks, then put through a siphon gun to create a vanilla-spiked cloud. It's a far cry from the lumpy stuff we Brits used to be served at school dinners. • Champagne: does it deserve Unesco World Heritage status? Mark Sargeant, the Michelin-starred chef behind a rapidly expanding restaurant empire, is perhaps the most enthusiastic custard fan I've ever met. \"Home made custard? There's nothing like it. Apple pie, rhubarb, crumble - you just can't have them without custard. It makes them instantly better.\" Unsurprisingly, custard features on all of his dessert menus - from a new Kent gastropub to Soho's Morden and Lea. \"It's right for any time of year. You can make a crumble with whatever fruit is in season - apples, forced rhubarb, gooseberries - and flavour the custard to match. Cinnamon and star anise in winter, mint or lavender in summer. Or the perfect Kentish cherry pie, with an almond-infused custard.\" Custard stars in this raspberry tart from Mark Sargeant at Morden and Lea in Soho The ideal version, he says, needs full-fat milk. \"Ideally, that gold top kind. And good free-range eggs, I like Burford Browns because they give it that amazing deep yellow tinge. A pinch of cornflower and sugar, and vanilla - then two-thirds milk and one third double cream, which gives it that rich, rounded flavour, without being too much.\" Alan Pickett is even more precise, heating his mix to exactly 82 degrees before cooling it on ice, to create that perfect consistency. It's not all about precision. Tom Harris's infamous tart was the result, he says, of a happy accident. \"The brown butter and honey idea came from making madeleines every day at St John. I'd constantly leave the pan on the stove a bit too long and it would caramelise - we couldn't use it but I realised it smelled delicious.\" He says he'd love to serve it hot, to give customers the full experience: \"When the steam's coming off, it smells phenomenal. But I couldn't take the tart off the menu now, or I'd be crucified!\" Custard is easily infused with flavours such as vanilla (ALAMY) There's clearly no messing with a dessert you have to order days in advance. In our search for simplicity and an authentic taste of home, custard, it seems, is proving the ultimate comfort food. Three simple ingredients, brought together in perfect alchemy. Nostalgia in a jug: a big warm hug in a bowl. More custard recipes Baked apricot custard recipe Really nutmeggy custard tart recipe Cheat's Portuguese custard tarts recipe Coconut custard tart Gluten-free cherry and custard tart recipe Custard base for ice cream recipe Follow @telegraph", "external_links": [], "published": "2015-07-06T18:32:00.000+03:00", "crawled": "2015-07-07T08:27:55.000+03:00", "highlightTitle": ""}