{"organizations": ["Blanc International", "NYSE", "Royal Caribbean Cruises Ltd."], "uuid": "05fac8e41ddc824c41e31c4859d1241ee2ea587d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_1_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13227838/1/celebrity-cruises-joins-diner-en-blanc-as-official-modern-luxury-vacation-sponsor.html?cm_ven=RSSFeed", "country": "US", "title": "Celebrity Cruises Joins Diner En Blanc As Official Modern Luxury Vacation Sponsor", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Celebrity Cruises Joins Diner En Blanc As Official Modern Luxury Vacation Sponsor", "spam_score": 0.0, "site_type": "news", "published": "2015-07-22T21:15:00.000+03:00", "replies_count": 0, "uuid": "05fac8e41ddc824c41e31c4859d1241ee2ea587d"}, "author": "", "url": "http://www.thestreet.com/story/13227838/1/celebrity-cruises-joins-diner-en-blanc-as-official-modern-luxury-vacation-sponsor.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Celebrity Cruises Joins Diner En Blanc As Official Modern Luxury Vacation Sponsor", "locations": ["US", "Caribbean", "Boston", "Chicago", "Europe", "New York City", "San Francisco", "Montreal", "MONTREAL", "Washington DC", "U.S.", "Canada", "Paris", "Dallas", "Alaska", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lisa Lutoff-Perlo", "Blanc", "François Pasquier", "Sandy Safi", "Le Dîner en Blanc"], "text": "Celebrity Cruises Joins Diner En Blanc As Official Modern Luxury Vacation Sponsor By PR Newswire | 07/22/15 - 02:15 PM EDT Reprint MIAMI and MONTREAL , July 22, 2015 /PRNewswire/ -- As the annual secret affair known as \"Le Dîner en Blanc\" pops up in select cities around the globe this year, modern luxury cruise brand Celebrity Cruises will be bringing a taste of its award-winning onboard experience to Dîner en Blanc attendees. \"Just as Celebrity Cruises offers award-winning globally inspired cuisine, sexy and stylish spaces, and intuitive service on our stunning ships, Le Dîner en Blanc consistently offers unforgettable evenings of elegance, beauty and magic around the globe, and there is a natural synergy between our brands,\" said Lisa Lutoff-Perlo , President and CEO, Celebrity Cruises. \"We are thrilled to have a strong presence at Dîner en Blanc events in key cities in 2015, and to bring special elements of Celebrity's modern luxury to everyone who attends these incredibly visual, chic events.\"Bystanders will witness groups of guests all dressed in white gathering at specific rallying points all across the city. Guided by Dîner en Blanc volunteers, these groups will then converge on one of the city's most beautiful settings, which is revealed only when guests arrive. Every guest brings their own gourmet feast, table, chairs and table setting. Over the course of the evening, they will eat and celebrate amid music, entertainment and dancing. Celebrity will reveal a number of exciting event experiences to Le Dîner en Blanc attendees at events in Boston , Chicago , Dallas , Los Angeles , New York City , San Francisco , and Washington DC in 2015. The sponsorship also offers Le Dîner en Blanc members in those cities the opportunity to enter a sweepstakes to win a seven-night Celebrity cruise for two to the Caribbean . Celebrity is also providing the prize for a contest for Dîner en Blanc attendees in those cities and additional U.S. cities, which includes submission of a photo of the attendee's 2015 Dîner en Blanc table setting and design, which will be judged by Dîner en Blanc on style, creativity, and elegance. The winner will receive the ultimate modern luxury escape: a grand prize of a 10-11-night Celebrity cruise for two in Europe plus roundtrip, coach-class airfare from a major US gateway, and $250 onboard credit. \"We are incredibly excited that Celebrity Cruises is bringing its modern luxury dynamic to our guests in these very special cities,\" said Sandy Safi , Co-Founder, Dîner en Blanc International. \"Not only is Celebrity giving our guests opportunities to win cruises on their beautiful ships, but they are also bringing some unique touches to our events. We look forward to a continued relationship with Celebrity as a result of this year's activations.\" About Celebrity Cruises: Celebrity Cruises' iconic \"X\" is the mark of modern luxury, with its cool, contemporary design and warm spaces; dining experiences where the design of the venues is as important as the cuisine; and the amazing service that only Celebrity can provide, all created to provide an unmatchable experience for vacationers' precious time. Celebrity Cruises' 10 ships offer modern luxury vacations visiting all seven continents. Celebrity also presents immersive cruisetour experiences in Alaska and Canada . Celebrity is one of six cruise brands operated by global cruise vacation company Royal Caribbean Cruises Ltd. (NYSE, OSE: RCL). For more information, dial 1-800-437-3111, visit www.celebritycruises.com , or call your travel agent. About Dîner en Blanc Launched in Paris in 1988 by François Pasquier and a handful of friends, Le Dîner en Blanc has become a worldwide epicurean phenomenon. Dîner en Blanc - Paris now attracts nearly 15,000 people each year. What was a \"friends and word-of-mouth only\" event has grown into an international sensation celebrated on five continents. While the technology behind the event may have changed over the years, the principles fueling this fantastic event have not: guests continue to gather at a secret location for the sole purpose of sharing a gourmet meal with good friends in one of their city's most beautiful public spaces. Founded in 2012 and headquartered in Montreal, Canada , Dîner en Blanc International is responsible for developing this secret posh picnic in over 60 cities in more than 25 countries around the world. Each event is headed by passionate local organizers who fell in love with the concept and wanted to bring it to their city, giving this rendezvous a local flair. For all official videos of Dîner en Blanc around the world, visit YouTube Le Dîner en Blanc . For more info and photos of Dîner en Blanc events from around the world, visit the official website dinerenblanc.info . To view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/celebrity-cruises-joins-diner-en-blanc-as-official-modern-luxury-vacation-sponsor-300117211.html SOURCE Celebrity Cruises Copyright 2011 PR Newswire. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Check Out Our Best Services for Investors \nPortfolio Manager Jim Cramer and Director of Research Jack Mohr reveal their investment tactics while giving advanced notice before every trade. Product Features:", "external_links": [], "published": "2015-07-22T21:15:00.000+03:00", "crawled": "2015-07-22T21:38:48.581+03:00", "highlightTitle": ""}