{"organizations": [], "uuid": "0106d8373eb4a46fa8124795b5f6c83a7bc35c3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/7/24bd8f2f-d94d-4549-81bf-d785baae7166MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Wellness", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/wellness/even-a-night-s-sleep-lost-could-alter-your-genes/article1-1372398.aspx", "country": "US", "title": "Even a night's sleep lost could alter your genes", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Even a night's sleep lost could alter your genes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T14:35:00.000+03:00", "replies_count": 0, "uuid": "0106d8373eb4a46fa8124795b5f6c83a7bc35c3d"}, "author": "", "url": "http://www.hindustantimes.com/wellness/even-a-night-s-sleep-lost-could-alter-your-genes/article1-1372398.aspx", "ord_in_thread": 0, "title": "Even a night's sleep lost could alter your genes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "| Updated: Jul 23, 2015 17:10 IST The study also hinted at the relation between these gene alterations and diseases related to sleep loss, like diabetes and obesity. (Shutterstock) \nIf you lose a single night's sleep, it could alter your genes that control the biological clocks in cells throughout the body, according to a new research. \nThe research carried out at Uppsala University also found that these changes in the clock genes could be linked to diseases caused by sleep loss. \n\"Previous research has shown that our metabolism is negatively affected by sleep loss, and sleep loss has been linked to an increased risk of obesity and type 2 diabetes,\" said Jonathan Cedernaes, a researcher at Uppsala University. \n\"Since ablation of clock genes in animals can cause these disease states, our current results indicate that changes of our clock genes may be linked to such negative effects caused by sleep loss,\" he said. \nResearchers studied 15 healthy normal-weight men who, on two separate occasions came to the lab for almost two-night-long stays. During the second night the participants slept as usual (over 8 hours) in one of the two sessions, while they were kept awake in the other of these sessions, but in random order. \nTo minimise the influence of various environmental factors, light conditions, food intake and activity levels in the lab were strictly controlled and the participants were bed-restricted when they were kept awake. \nFollowing the second night on both occasions that the men were studied, small tissue samples were taken from the superficial fat on the stomach, and from the muscle on the thigh; two kinds of tissues that were important for regulating metabolism and controlling blood sugar levels. \nBlood samples were also taken before and after the participants had consumed a sugar solution to test their insulin sensitivity, a practice commonly done to exclude the presence of diabetes or a metabolic state called impaired insulin sensitivity, which could precede type-2 diabetes. \nMolecular analyses of the collected tissue samples showed that the regulation and activity of clock genes was altered after one night of sleep loss. The activity of genes was regulated by a mechanism called epigenetics. \nThis involved chemical alterations to the DNA molecule such as methyl groups; a process called methylation; which regulated how the genes were switched on or off. The researchers found that clock genes had increased numbers of such DNA marks after sleep loss. \nThey also found that the expression of the genes, which was indicative of how much of the genes' product is made, was altered. \n\"As far as we know, we are the first to directly show that epigenetic changes can occur after sleep loss in humans, but also in these important tissues,\" said Cedernaes. \n\"It was interesting that the methylation of these genes could be altered so quickly, and that it could occur for these metabolically important clock genes,\" he said. \nThe changes that the researchers observed were however different in the adipose tissue and the skeletal muscle. \n\"This could suggest that these important molecular clocks are no longer synchronised between these two tissues,\" Cedernaes said. Tags", "external_links": [], "published": "2015-07-23T14:35:00.000+03:00", "crawled": "2015-07-23T18:05:00.066+03:00", "highlightTitle": ""}