{"organizations": [], "uuid": "81dd89d4d697a21ad45874bb4e94fe3619c930d1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.milforddailynews.com", "main_image": "http://www.milforddailynews.com/storyimage/WL/20150716/ENTERTAINMENTLIFE/150717839/AR/0/AR-150717839.jpg", "site_section": "http://www.milforddailynews.com/entertainment/travel?template=rss&mime=xml", "section_title": "Travel - Milford Daily News", "url": "http://www.milforddailynews.com/article/20150716/ENTERTAINMENTLIFE/150717839/12311/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "THE TWO-DAY TRAIL: A route with a view on Mount Everett", "performance_score": 0, "site": "milforddailynews.com", "participants_count": 1, "title_full": "THE TWO-DAY TRAIL: A route with a view on Mount Everett", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T13:11:00.000+03:00", "replies_count": 0, "uuid": "81dd89d4d697a21ad45874bb4e94fe3619c930d1"}, "author": "By April M. Crehan/Daily News Staff", "url": "http://www.milforddailynews.com/article/20150716/ENTERTAINMENTLIFE/150717839/12311/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "THE TWO-DAY TRAIL: A route with a view on Mount Everett", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE TWO-DAY TRAIL: A route with a view on Mount Everett Comment By April M. Crehan/Daily News Staff Milford Daily News By April M. Crehan/Daily News Staff Posted Jul. 16, 2015 at 5:11 AM By April M. Crehan/Daily News Staff Posted Jul. 16, 2015 at 5:11 AM Tweets by @WickedLocalArts » Social News The Two-Day Trail is an every-other-week summer series focusing on hikes that take less than 48 hours to complete - from the second you leave your MetroWest doorstep to the moment you return home. EGREMONT – Mount Everett, a 2,602-foot peak in the southwest corner of Massachusetts, offers all the solitude and views of a long Appalachian Trail hike in just a 9.2-mile section, making it absolutely worth the 2 ½-hour drive from MetroWest. Despite its location in the misleadingly named town of Mount Washington, Mount Everett State Reservation shares neither proximity nor prominence with the much more famous New Hampshire summit. But Everett did not disappoint. The unexplored reservation trails, overnight camping options, small-town charm of nearby Great Barrington and Stockbridge and childhood memories of Bash Bish Falls will doubtless draw me back me to the mountain that could have birthed the hackneyed phrase \"it's not the destination that matters; it's the journey.\" With plans for a 6 p.m. dinner party the next day, I set out from Framingham on a Thursday night, drove until exhausted and slept until sunrise at a Mass. Pike. rest stop. Despite a false start at a different trailhead (for the Jug End Loop Trail, which looks promising as a gentler, shorter hike), I eventually made it to intersection of the Appalachian Trail and Jug End Road. Then I spent several minutes searching for the tiny curved triangle marking the entrance to the AT. Rather than skulking up and down like a robber casing a joint, your best bet to find the trailhead is to simply trust the cars parked on the side of the road. Eventually, I gave up looking for a sign and scurried up the hillside until I reached something vaguely path-like, and a grizzled hiker who appeared to have walked straight out of an outdated guide book confirmed my suspicions: I had indeed found the Appalachian Trail. Despite temperatures that day in the mid-60s and clear skies, the whole trail seemed largely empty until I reached the ridge of 1,821-foot Mount Bushnell where three hikers making the return trip passed by. And, aside from one doe whose panicked crashing through the words surprised me as much as I surprised her, I didn’t see a single other female until minutes before I reached the summit. That solitude is both a draw and a danger on the trail. Balance your pack poorly, as I did, and you’ll feel unnervingly close to tipping off the edge of narrow ledges. Take the time to remove the pack, and you can enjoy the views without feeling the threat of a long fall. The views are very much worth the climb. As I neared the summit on that clear morning, the landscape that spread out below me was stunning. Tiny houses looked nestled between an expanse of trees and a few scattered lakes. On a clear morning after the leaves change, the view must be postcard-worthy. Page 2 of 2 - The earliest section of trail includes enough scramble to excite anyone who enjoys a basic rock wall. It’s never steep enough to seem insurmountable, but certainly easier on all fours. If you’re in good enough shape not be winded by the time you reach the first break in the trees, forsake your pace for a minute to appreciate the view nonetheless. The summit, admittedly, was disappointing: the scrubby vegetation is too thick to allow the clear 360-degree view promised by the state Department of Conservation and Recreation website. Stop instead about a tenth of a mile from the top, where a flat rock offers a view and the perfect lunch spot. A bold butterfly decorated the trip down, enjoying the breeze with me as I soaked in the view and the sunshine once more. Driving part way up Mount Everett is an option as well, although you'll miss the views to the east. A gate closes off the summit road partway up the mountain, so be prepared to do a little walking as well. If you go The route: Once actually on the Appalachian Trail, the way is clear. Go up until you no longer can, and then turn around. White blazes mark the AT, and every once in a great while a brown sign will remind you how far you have to go. Total time: The hike itself, pausing for snacks and water, and some wide-eyed city-mouse admiration of the sights, was under 6 hours. The door-to-door round trip: 19 hours. Lessons learned: Invest in sleep. If you want to get a solid night’s sleep, don’t do it in your car. There are a number of quaint bed-and-breakfasts within a half-hour of the trail head. Great Barrington’s Thornewood Inn, Windflower Inn, and the Wainwright Inn all offer rooms in the $150 to $250 range. Splurging? Check out the higher end rooms at the Red Lion Inn in Stockbridge. Scrimping? Camp somewhere like Prospect Lake Park, also in Great Barrington, for $30 to $40 a night. Gear matters. Running shoes fall far short in the traction department. On especially steep parts of the hike, especially on the way down, I deeply regretted not investing in hiking boots. Wear whatever has the best grip, keep your pack close to your back and bring plenty of water; less than a liter more than sufficed for this hiker. Daily News staff writer April M. Crehan can be reached at 508-446-4458 or acrehan@wickedlocal.com. Follow her on Twitter @CrehansCopy. By April M. Crehan/Daily News Staff Milford Daily News By April M. Crehan/Daily News Staff Posted Jul. 16, 2015 at 5:11 AM » Comment or view comments", "external_links": [], "published": "2015-07-16T13:11:00.000+03:00", "crawled": "2015-07-16T21:39:50.000+03:00", "highlightTitle": ""}