{"organizations": [], "uuid": "998ff282e3065e1517857e8590c919735fe68159", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgdigital.com", "main_image": "", "site_section": "http://www.ttgdigital.com/navrss?navsectioncode=1", "section_title": "Travel Trade Gazette - News", "url": "http://www.ttgdigital.com/news/virgin-atlantic-to-shed-500-jobs/4697719.article", "country": "GB", "title": "Virgin Atlantic to shed 500 jobs", "performance_score": 0, "site": "ttgdigital.com", "participants_count": 0, "title_full": "Virgin Atlantic to shed 500 jobs", "spam_score": 0.0, "site_type": "news", "published": "2015-07-01T11:21:00.000+03:00", "replies_count": 0, "uuid": "998ff282e3065e1517857e8590c919735fe68159"}, "author": "", "url": "http://www.ttgdigital.com/news/virgin-atlantic-to-shed-500-jobs/4697719.article", "ord_in_thread": 0, "title": "Virgin Atlantic to shed 500 jobs", "locations": ["Virgin Atlantic"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Virgin Atlantic to shed 500 jobs 1 July 2015 Save \nVirgin Atlantic is preparing to lose 500 support and managerial jobs in a restructure aimed at simplifying the business. \nThe losses will occur through natural attrition, redeployment and redundancies while the “best possible support” will be offered to all those affected. \nThe changes are to be implemented over the next few months with the target for completion being by the end of the year. \nThe job losses are part of a plan to reduce the airline’s non-fuel costs through focusing on efficiency and should allow it to invest more on the “Virgin Atlantic” experience. \nIt is also part of a recovery plan that saw the airline return to profitability in 2014 while it is targeting “record levels of sustained profitability by 2018”. \nCraig Kreeger, chief executive of Virgin Atlantic, said: “To truly position Virgin Atlantic for long-term and sustained success, we need to be a more efficient and agile organisation that has the ability to invest even more in the areas that make Virgin Atlantic’s customer experience unique. \n“As a people oriented business, these are extremely tough decisions to take, but we know they are necessary to secure our future. We are committed to supporting our people as we deliver against these plans. \n“We have delivered against a successful recovery programme and now it is time to realise our full potential. \n“We have a clear strategy in place and I am confident that we will achieve our ambition to continue to be the airline most loved by our customers.”", "external_links": [], "published": "2015-07-01T11:21:00.000+03:00", "crawled": "2015-07-03T10:18:07.000+03:00", "highlightTitle": ""}