{"organizations": [], "uuid": "60e67a849019153137a90599cd7478c676b04cf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61168/sheraton-mactan-resort-will-be-added-philippine-portfolio", "country": "US", "title": "Sheraton Mactan Resort will be added to the Philippine portfolio", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Sheraton Mactan Resort will be added to the Philippine portfolio", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T19:59:00.000+03:00", "replies_count": 0, "uuid": "60e67a849019153137a90599cd7478c676b04cf7"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61168/sheraton-mactan-resort-will-be-added-philippine-portfolio", "ord_in_thread": 0, "title": "Sheraton Mactan Resort will be added to the Philippine portfolio", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE LIST: 5 Star Rated by eTN Readers - and not for sale! Hotels - Airlines - CVBs - Destinations - people Sheraton Mactan Resort will be added to the Philippine portfolio Adv: \nJul 07, 2015 Adv: \nStarwood Hotels & Resorts Worldwide, Inc today announced the signing of Sheraton® Mactan Resort, a new build property comprised of hotel and branded residences on the exotic coral island of Mactan in the Philippines. Owned by AppleOne Mactan, Inc, a subsidiary of AppleOne Properties Inc., the signing leverages the Sheraton first mover advantage in the region and meets increasing local demand. The new Sheraton Mactan hotel will open in 2019, followed by the opening of the residences in 2020. \n“Starwood continues to build on its long-standing owner and developer relationships in the region as we expand our strong and growing footprint,” said Charlie Dang, Regional Vice President, Southeast Asia, Starwood Hotels & Resorts Asia Pacific. “Given the flourishing Filipino economy, we are confident that Sheraton Mactan Resort will resonate with travellers and potential homeowners alike with its idyllic location and best-in-class offerings.” \nThe beachfront hotel property will offer 250 sophisticated guest rooms, of which 20 are expansive suites, with breathtaking views of Magellan Bay. Other property offerings will include Shine Spa for Sheraton™, three dining venues, an enhanced lobby lounge, and recreation facilities such as a swimming pool and the state-of-the-art Sheraton Fitness® facilities. Sheraton Mactan Resort will also feature function space totalling 1,313 square metres—ideal for meetings, weddings and functions. \nPart of the Cebu province and located in Punta Engano Barangay, the property is an easy 10 minute drive from the Mactan-Cebu International Airport, the Philippines’ second busiest airport. For the more adventurous guest, Mactan boasts world renowned snorkelling and scuba diving. It is also ideally situated for sailing and island hopping. \nThe Residences at Sheraton Mactan Resort, also scheduled to open before end 2020, will feature 182 units consisting of one to three partially-furnished bedroom apartments. \nRajit Sukumaran, Senior Vice President, Acquisitions and Development, Starwood Hotels & Resorts Asia Pacific, added: “This property will not only strengthen our presence in Asia Pacific, but it will put Sheraton one step closer to its goal of opening more than 150 new hotels globally over the next five years.” \n“We are delighted to partner with Starwood to introduce Sheraton Mactan Resort to the booming island of Mactan in the Philippines,” said Ray Go Manigsaca, President of AppleOne Mactan, Inc. “Combining our local expertise and Starwood’s global perspective, we are confident that this partnership will positively uplift the hospitality industry in the region. AppleOne’s distinct image is consistent with the impeccable global reputation of Sheraton and this partnership will also raise the bar of residential development in Cebu and the Philippines.” \nThe signing follows the announcements of key pipeline hotels for company in the region, including Sheraton Danang Resort, Four Points® by Sheraton Danang in Vietnam, The Westin® Manila Sonata Place in the Philippines, Four Points® by Sheraton Bali, Kuta, Four Points by Sheraton Bintan, Lagoi Bay in Indonesia; and Starwood’s debut entry into Myanmar with Sheraton Yangon Hotel.", "external_links": [], "published": "2015-07-07T19:59:00.000+03:00", "crawled": "2015-07-07T21:02:23.000+03:00", "highlightTitle": ""}