{"organizations": [], "uuid": "2b605d558971c91d7ceeeb7386c33d3ecc80e013", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/4661341/airport-city-2*1200xx1600-902-0-332.jpg", "site_section": "http://seattle.bizjournals.com/rss/feed/vertical_subtopic/61", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/atlanta/real_talk/2015/07/airport-hotel-could-break-ground-in-early-2016.html", "country": "US", "title": "Airport hotel could break ground in early 2016", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "Airport hotel could break ground in early 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T20:18:00.000+03:00", "replies_count": 0, "uuid": "2b605d558971c91d7ceeeb7386c33d3ecc80e013"}, "author": "Amy Wenk", "url": "http://www.bizjournals.com/atlanta/real_talk/2015/07/airport-hotel-could-break-ground-in-early-2016.html", "ord_in_thread": 0, "title": "Airport hotel could break ground in early 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "3 photos The airport also has 13 acres along Interstate 85 where developers could plan a mixed-use… more City officials want to break ground early next year on a new mixed-use project that would include a four-star hotel at Hartsfield-Jackson Atlanta International Airport . Three development teams are vying for the project: Atlanta-based Regent Partners; a second team including Atlanta-based Carter , Majestic Realty Co. and GPM Investments LLC; and a third firm, Airmall USA Inc. Officials on Tuesday held a meeting regarding a request for proposals for the project. Bids are due back Oct. 7. The development — that would include an up to 300-room hotel, travel plaza and 30,000 square feet of class-A office space — would boost an effort to spur more commercial real estate development around the more than 4,700-acre Hartsfield-Jackson campus. The project would be developed on 26.5 acres on three parcels around the airport’s main domestic terminal and MARTA station. “It is the next step in developing an Airport City,” said Kyle Mastin , interim director of concessions for the airport. “If you look at what Porsche has done bringing a first-class operation just northeast of the airport. With this land we have available, we want this to really be a statement with first-class development for office, for services, for retail, possibly even residential.” For Atlanta, the proposal is a potential turning point. “It’s catalytic for the area and the region,” said David Allman , founder and chairman of Regent Partners . “It leverages one of our tremendous local assets, the airport.” Hartsfield-Jackson is often cited as the most powerful reason corporations relocate to and expand in Atlanta, but its lack of a bustling cluster of corporate offices, first-class hotels and entertainment options has confounded economic development officials for years. Through the RFP process for the mixed-use development, airport officials are looking to be “wowed” by concept designs, potential hotel brands and office tenants, Mastin said. The chosen developer will design, build, operate and finance the project, signing a land lease with the airport. “If everything goes well, we could have a contract by the end of the year,” Mastin said. “Of course, the contract does need approval by the City Council and by the FAA. Once that’s done, we would move ahead to finalize design and construction.” \nWant Atlanta Travel   Related Content", "external_links": [], "published": "2015-07-28T20:18:00.000+03:00", "crawled": "2015-07-28T21:23:13.615+03:00", "highlightTitle": ""}