{"organizations": [], "uuid": "aef59a4698a9435bb238ad27f50807f5d4188d97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.couriermail.com.au", "main_image": "http://resources2.news.com.au/images/2015/07/17/1227445/762286-2ec8c442-2c2b-11e5-a754-a63f13c4fffa.jpg", "site_section": "http://www.couriermail.com.au/travel", "section_title": "Travel | Travel News and Holiday Deals | The Courier-Mail", "url": "http://www.couriermail.com.au/lifestyle/blooms-the-chemist-named-best-pharmacy-terry-white-takes-bottom-place/story-fniho6st-1227445763491", "country": "US", "title": "Chemist Warehouse, Priceline losing out to chemists with better service | The", "performance_score": 0, "site": "couriermail.com.au", "participants_count": 1, "title_full": "Chemist Warehouse, Priceline losing out to chemists with better service | The Courier-Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "aef59a4698a9435bb238ad27f50807f5d4188d97"}, "author": "couriermail.com.au", "url": "http://www.couriermail.com.au/lifestyle/blooms-the-chemist-named-best-pharmacy-terry-white-takes-bottom-place/story-fniho6st-1227445763491", "ord_in_thread": 0, "title": "Chemist Warehouse, Priceline losing out to chemists with better service | The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Consumer research company Canstar Blue’s survey of nearly 3000 Australians has revealed customer service is by far the key driver of pharmacy satisfaction, with 31 per cent listing it as the most important factor.\nValue for money (17 per cent) was a distant second consideration, followed by availability of a pharmacist (16 per cent), range of health products (14 per cent), advice provided (13 per cent) and range of beauty products (5 per cent).\nHealth management checks and programs barely rated a mention, with just 4 per cent listing them as the key driver of pharmacy satisfaction.\nBlooms the Chemist has topped the list in Canstar’s latest pharmacy survey, with customers rating the chain five stars in five out of eight categories including overall satisfaction, service, range of health products, pharmacist availability and advice.\nTerry White was rated the lowest out of all 11 pharmacy chains, scoring three stars in all eight categories. “Our results show that some are getting the balance right, while others are succeeding in certain areas but not others. But overall, consumers are most satisfied with what they get from Blooms,” said Canstar Blue head Megan Doyle.\n“A lot of factors come into play when you visit your local pharmacy and if any of them are lacking, customers are going to be disappointed. Striking the perfect balance between quality products, great service and advice, and pharmacist availability, is the challenge facing the big pharmacy chains.”\nNinety-two per cent of adults believe the contents of generic medicines like painkillers are the same, regardless of price. Despite this, 36 per cent said they trust big-name brands more, and 27 per cent believe they are more effective than cheaper versions.\n“Once they enter a pharmacy, most people look for good customer service and advice,” she said. “The price of the products they buy becomes less important, which might also help to explain why so many favour big name brands, even when they believe they include the same ingredients as cheaper versions.”\nAdults in their 30s and 40s were most likely to purchase the expensive name-brand products. “Generally the older you get, the less you care about the name on the packaging,” she said.\n“Life experience seems to have given them the opinion that there isn’t much difference between the various products on the shelves and they’d rather save some money.\n“But for some, the big names are the most attractive proposition. If you’re feeling unwell, you simply want the fastest, most effective relief and that’s precisely the message you get from the big name brands.”\nSource: Canstar Blue Source: Supplied\nPill Poppers 51:54 Play video Drugs perform minor miracles day after day, freeing us from pain and disease. Take a tour through the world of pharmaceuticals and find out that drug discovery has as much to do with serendipity as it does science.\nOovvuu 16 Jul 2015 TV/Science TV/Health TV/Technology TV/Documentary\nOriginally published as Best and worst chemists revealed", "external_links": ["http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/EwczI4djoF2tLazkTb87RacgAsmu8piS/promo261246407&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "http://www.news.com.au/finance/business/blooms-the-chemist-named-best-pharmacy-terry-white-takes-bottom-place/story-fnu2q2e9-1227445763491", "http://resources3.news.com.au/images/2015/07/17/1227445/761963-48987b6a-2c1c-11e5-a754-a63f13c4fffa.jpg"], "published": "2015-07-17T03:00:00.000+03:00", "crawled": "2015-07-17T07:20:13.000+03:00", "highlightTitle": ""}