{"organizations": [], "uuid": "90f26019c5453c3b9677571b7fcc8b0b5342139c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62015/palestinians-tackle-green-energy", "country": "US", "title": "Palestinians Tackle Green Energy", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Palestinians Tackle Green Energy", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T10:54:00.000+03:00", "replies_count": 0, "uuid": "90f26019c5453c3b9677571b7fcc8b0b5342139c"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/62015/palestinians-tackle-green-energy", "ord_in_thread": 0, "title": "Palestinians Tackle Green Energy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By By Linda Gradstein | Jul 30, 2015 Adv: \nPalestinians plan to begin using solar, wind and geothermal power in an effort to cut their dependence on Israeli energy and save money at the same time. The Palestinian Authority has approved a national plan to reach ten percent power generation from renewable sources by 2020, and a new energy law set to be approved soon calls for energy generation programs. \nPalestinians are set to hold a conference called “Green Future for Palestine” in the West Bank town of Ramallah next week, which will bring together international investors and Palestinian companies in the fields of renewable energy. \n“The main goal is to find a substitute for the electricity we are importing from Israel,” Issa Hamayel, the general manager of Al-Munir services which is organizing the conference told The Media Line. “Every kilowatt we can produce here is one kilowatt we don’t have to buy from Israel.” \nHe said that the push towards renewable energy was strengthened after Israel twice briefly cut off power to the West Bank towns of Nablus and Jenin in February, over a debt of more than $500 million dollars that the Palestinian authorities owes the Israeli Electric Company. All but five percent of electricity to the West Bank comes from Israel, and the debt has accumulated. \nHamayel said the power cuts have spurred many in the West Bank to strive for energy independence. \n“To become energy independent will require a very large investment in these fields,” he said. “But if we have the will, in 20 years we can do it, which will be good for Palestine both politically and economically.” \nIn neighboring Israel, efforts to expand renewable energy have stalled. \n“The Israeli solar industry is at a crossroads and is trying to decide if it going to get off life support because it’s going to be nurtured back to health or unplugged and allowed to die,” Yosef Abramowitz, co-founder of the solar industry in Israel told The Media Line. “The previous government created so much uncertainty in the solar industry that most solar companies in Israel either went bankrupt or decided to work abroad. We hope the new government will make a broad commitment to solar energy.” \nIsraelis already use solar energy on rooftops for hot water heating, and their use is spreading in the West Bank as well. But photovoltaic solar fields, as Israel has in the Arava desert in Kibbutz Ketura are expensive, and need large areas to produce significant amounts of energy. \nAbramowitz said that by the end of 2016, all of the daytime energy needs in southern Israel between the Dead Sea and Eilat will come from solar power. But Israel is still at only two percent now, far from the government’s goal of ten percent of all energy needs by 2020. \nAt the Ramallah conference, international companies hope to get investment in the West Bank. Recovered Energy Group, a US company, has technology to turn garbage into energy. \n“We are looking to bring investors from outside and we want to introduce people to this technology so we can open the market to the renewable energy,” Nakhleh Hawash, the Palestinian representative of the company, told The Media Line. \nHe said they want to build a ten megawatt plant which will cost $30 million. \nPalestinians say they hope to build solar fields in several areas that will enable gradual independence from Israeli energy.", "external_links": [], "published": "2015-07-30T10:54:00.000+03:00", "crawled": "2015-07-30T13:21:37.383+03:00", "highlightTitle": ""}