{"organizations": [], "uuid": "5c50324b8eba263f8106ef0b3ed560ff03be797a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/scotland/27809-aberdeenshire-s-fasque-house-to-join-cromlix-and-inverlochy-in-icmi-stable", "country": "US", "title": "Aberdeenshire’s Fasque House to join Cromlix and Inverlochy in ICMI stable", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Aberdeenshire’s Fasque House to join Cromlix and Inverlochy in ICMI stable", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T16:30:00.000+03:00", "replies_count": 0, "uuid": "5c50324b8eba263f8106ef0b3ed560ff03be797a"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/scotland/27809-aberdeenshire-s-fasque-house-to-join-cromlix-and-inverlochy-in-icmi-stable", "ord_in_thread": 0, "title": "Aberdeenshire’s Fasque House to join Cromlix and Inverlochy in ICMI stable", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aberdeenshire’s Fasque House to join Cromlix and Inverlochy in ICMI stable Aberdeenshire’s Fasque House to join Cromlix and Inverlochy in ICMI stable Details Category: Scotland   14:30 Aberdeenshire’s Fasque House, the multi-award winning exclusive use venue, has joined top luxury hotels Cromlix, Inverlochy Castle and Greywallls under the management of Inverlochy Castle Management International (ICMI). \nFasque House, the 400-acre country estate with expansive baronial mansion at its heart, reopened two years ago following a £11 million refurbishment by new owners Douglas and Heather Dick-Reid. The stunning 19th Century building, with 19 lavishly furnished bedrooms, Great Hall, spacious Drawing Room and intimate Dining Room, is already a leading venue for corporate events, private functions and weddings. Douglas Dick-Reid said: “Restoring Fasque House and its extensive woodland grounds to their former glory was a hugely regwrding project and we are delighted with the popularity it has enjoyed as a venue since our opening in 2013. “We are aware of Fasque’s potential to become one of Europe’s top exclusive-use venues and we know that ICMI, which is responsible for the development and management of a number of the UK’s top privately owned luxury hotels and venues, is the right partner for us.” Norbert Lieder, managing director of ICMI, said: “Fasque House is a perfect fit for ICMI – stunning architecture, luxurious interiors and a unique offer as a large exclusive use venue capable of catering for up to 150 people, even more with a marquee. “I commend Douglas and Heather Dick-Reid for their work on both the interior and exterior of the venue – the attention to detail and design is some of the best I have seen. “Under ICMI’s management Fasque will now benefit from our vast experience in running luxury venues; ability to recruit and retain the best staff; marketing contacts; and buying power. “We have long expressed our desire to manage properties in Aberdeenshire and look forward to working with a local business of such unique quality.” Related articles", "external_links": [], "published": "2015-07-21T16:30:00.000+03:00", "crawled": "2015-07-21T20:44:24.924+03:00", "highlightTitle": ""}