{"organizations": [], "uuid": "369b4ec57c50711c2ea6186bf9181d04e61eaa33", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/07/01/travel/images/30263498-01_big.jpg", "site_section": "http://www.nationmultimedia.com/home/rss/travel.rss", "section_title": "NationMultimedia.com - Travel", "url": "http://www.nationmultimedia.com/travel/Birds-of-a-feather-30263498.html", "country": "TH", "title": "Birds of a feather", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "Birds of a feather", "spam_score": 0.0, "site_type": "news", "published": "2015-06-30T21:00:00.000+03:00", "replies_count": 0, "uuid": "369b4ec57c50711c2ea6186bf9181d04e61eaa33"}, "author": "", "url": "http://www.nationmultimedia.com/travel/Birds-of-a-feather-30263498.html", "ord_in_thread": 0, "title": "Birds of a feather", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ALMATY, KAZAKHSTAN July 1, 2015 1:00 am \nThai dancers show off Thai traditional dance during the Amazing Thailand Road Show in Kazakhstan Firm believers in travelling in packs, the Kazakhs are duly impressed by what Thailand has to offer Determined to tap into the potentially lucrative market of oil-rich Kazakhstan, the Tourism Authority of Thailand (TAT) took its \"Amazing Thailand Road Show\" to the Central Asian nation last month in the hope of luring thousands more Kazakhs to the Kingdom. Organised in collaboration with the Thai Embassy in Kazakhstan and TAT's Moscow office, the road shows took place in Kazakstan's two largest cities - Almaty and Astana - from June 15 to 20. More than 60 outbound travel agents in Almaty alone were invited to meet 50 suppliers from Thailand. \"The Kazakhstan market has great potential and is especially important now that the numbers of Russian tourists have declined following the EU sanctions and the collapsing rouble,\" the director of TAT's Moscow Office, Eumporn Jiragalwisul, told Explore at the Almaty event. \"We had 62,000 Kazakhs visiting Thailand last year. We're expecting 75,000 this year.\" Buyers and sellers were given plenty of opportunity to meet and talk thanks to the TAT, which arranged time slots for both sides. In between, road show participants witnessed some spectacular displays of Thai dancing as well as embarked on a gourmet adventure through a host of delicious Thai dishes. \"The Kazakh people know Thailand through our culture and popular beach destinations,\" said Thailand's ambassador to Kazakhstan, Dr Charn Jullamon. \"They love our beaches and they're fond of Thai boxing. Nursultan Nazarbayev, the President of Kazakhstan, is president of the Thai boxing association in Kazakhstan.\" The world's largest landlocked country, Kazakhstan experiences long and unbelievably cold winters. Almaty, once the capital and still the largest commercial centre, is the world's second coldest capital after Ulaanbaatar in Mongolia, with temperatures regularly plunging to minus 45 degrees Celsius. Like a bird migrating to escape Siberian weather, the Kazakh heads South in winter, eager to find some warmth. According to Konstantin Kinel, TAT's marketing manager in Moscow, China is the most-visited destination for the Kazakh, while Turkey and United Arab Emirates are the second and third favourites. Thailand is the fourth most popular destination for its beaches, food and shopping and is also becoming competitive in terms of value for money. \"The Kazakhs always travel in large family groups so they love all-inclusive packages,\" says one of the Kazakh outbound travel agents. \"After purchasing the package, the rest of the money will go for shopping.\" Besides the tropical beaches and shopping sprees, Thai travel agents have learned that the Kazakhs are also fond of the outdoor life. Kanchanaburi, they reckon, with its rivers, forests and waterfalls, will hold plenty of appeal for the Kazakh visitor. \"The Kazakhs are nomadic by nature and travel is in their blood,\" adds Konstantin. \"When they're on the road, they don't stay put but keep moving from one place to another.\" The Amazing Thailand Road Show in Kazakhstan ended in Astana, Kazakhstan's capital, and featured a series of Thai cultural shows and plenty more food, with long queues forming at the tables serving phad thai fried noodles. \"Thailand has the potential for drawing many tourists from Kazakhstan,\" confirmed Dhanwanthie Goonettilleke of Air Astana. \"When the weather is extremely cold, the Kazakhs want to fly out to somewhere warmer and Thailand is an obvious destination.\" 221 Viewed", "external_links": [], "published": "2015-06-30T21:00:00.000+03:00", "crawled": "2015-07-01T00:58:52.000+03:00", "highlightTitle": ""}