{"organizations": [], "uuid": "f12c72669800e76c3f8d4431aef5eee23e8a441b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bizjournals.com", "main_image": "http://media.bizj.us/view/img/6383372/audrey-stonejpg*400xx2400-2400-0-0.jpg", "site_section": "http://memphis.bizjournals.com/rss/feed/vertical_subtopic/62", "section_title": "Travel Business News - Travel Business News Headlines | Bizjournals.com", "url": "http://www.bizjournals.com/chicago/news/2015/07/21/southwest-airlines-could-hit-stormy-weather-as.html", "country": "US", "title": "Southwest Airlines could hit stormy weather as flight attendant contract vote concludes", "performance_score": 0, "site": "bizjournals.com", "participants_count": 1, "title_full": "Southwest Airlines could hit stormy weather as flight attendant contract vote concludes", "spam_score": 0.0, "site_type": "news", "published": "2015-07-21T22:04:00.000+03:00", "replies_count": 0, "uuid": "f12c72669800e76c3f8d4431aef5eee23e8a441b"}, "author": "Lewis Lazare", "url": "http://www.bizjournals.com/chicago/news/2015/07/21/southwest-airlines-could-hit-stormy-weather-as.html", "ord_in_thread": 0, "title": "Southwest Airlines could hit stormy weather as flight attendant contract vote concludes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Southwest Airlines could hit stormy weather as flight attendant contract vote concludes Jul 21, 2015, 2:04pm CDT Share Lewis Lazare Reporter Chicago Business Journal Related Content Audrey Stone is president of Transport Workers Union Local 556, which represents more… more This could wind up a very bad week for Southwest Airlines CEO Gary Kelly . Even if the low fare behemoth, as expected, reports record 2015 second quarter profits this Thursday morning, Kelly could have thousands of very unhappy flight attendants to contend with by Friday afternoon. With less than 72 hours until the voting ends at noon central time on Friday, sources indicate Southwest's (NYSE: LUV) rank-and-file unionized flight attendants, members of Transport Workers Union Local 556, look increasingly likely to vote down a tentative new contract presented to them for approval earlier this month. Multiple sources close to developments also indicate it may not even be close. One flight attendant who has been polling fellow F/As said the \"no\" vote could be overwhelming. \"Seems that sentiment is 9/1 against this tentative contract,\" said the source. One unscientific straw poll had 345 flight attendants voting \"no,\" 8 for \"yes\" and 12 \"undecided.\" Noted another Southwest flight attendant: \"The number of flight attendants coming out publicly at work, in F/A lounges and through social media, email, text, wearing black ribbons under their union pins, displaying their \"no\" vote on their luggage tags, etc., has been large and widespread throughout our flight attendant rank and file.\" Yet another Southwest flight attendant said the likely news of Southwest's record profits on Thursday could seal the rejection of the contract among even those Southwest flight attendants who are still on the fence about which way to vote. Online voting closes at 12 noon central time on Friday, and the results of the vote are expected to be announced to rank and file at 6 p.m. the same day. Even some members of the team of so-called educators who have fanned out across the Southwest system in recent days to sell flight attendants on the new contract concede the outcome of the vote could go against Southwest CEO Kelly and the tentative contract the airline's top executive wants to see ratified. For many flight attendants, two of the biggest issues in the proposed contract are the longer duty day (up from 10.5 to 12 hours) and new vacation rules. But many flight attendants also argue the Southwest company culture has changed dramatically in recent years, and not for the better since Kelly took control of the company. Those sentiments may factor into the vote outcome as well. If flight attendants vote down the tentative contract, negotiations will start from scratch again, even after it took two years to get the tentative contract now up for approval. Rank and file F/As also may push for the Local 556 executive board to be recalled and a new board put in place before contract negotiations start once more. Southwest's more than 13,500 flight attendants, including more than 1,800 domiciled in Chicago, are the largest single group of unionized workers employed at the heavily-unionized carrier. If the flight attendants vote down the tentative new contract, that means Southwest CEO Kelly still will have to deal with four of his largest and most important worker groups who have been trying to get new contracts for years — flight attendants, mechanics, ramp agents and pilots. Southwest has its largest hub at Chicago's Midway Airport. \nWant Chicago Travel   Related Content", "external_links": [], "published": "2015-07-21T22:04:00.000+03:00", "crawled": "2015-07-21T23:53:42.701+03:00", "highlightTitle": ""}