{"organizations": [], "uuid": "afdebbe299c823445a4e0544c9781b4ef3a46319", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cnbc.com", "main_image": "http://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2015/07/02/102806948-grass.1910x1000.jpg", "site_section": "http://www.cnbc.com/id/10000739/device/rss/rss.html", "section_title": "Travel", "url": "http://www.cnbc.com/id/102807083", "country": "US", "title": "Want to up your whiskey game? Read these—commentary", "performance_score": 0, "site": "cnbc.com", "participants_count": 2, "title_full": "Want to up your whiskey game? Read these—commentary", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T03:00:00.000+03:00", "replies_count": 1, "uuid": "6ed5f8f5be9255c0ad04983878fe42bbb73b819d"}, "author": "cnbc.com", "url": "http://www.cnbc.com/id/102807083#post-0", "ord_in_thread": 0, "title": "Want to up your whiskey game? Read these—commentary", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In this latest installment of CNBC's summer reading series , Heather Greene, a whiskey sommelier and the author of \" Whisk(e)y Distilled: A Populist Guide to the Water of Life ,\" offers up a few great books to up your whiskey game. Plus, she offers up some refreshing whiskeys for summer to sip while you're reading about whiskey in the backyard or at the beach!\nEach year, thousands of bartenders and distilled-spirit fans descend upon the steamy streets of New Orleans to celebrate the beauty of cocktails at the annual Tales of the Cocktail (TOTC) festival. Over 200 seminars, parties and events will take place this year beginning on July 15 — and I'll be there.\nSource: Michael Sanzone Heather Greene, whiskey sommelier and author of “Whisk(e)y Distilled: A Populist Guide to the Water of Life” in Van Vorst Park in Jersey City. I've signed on for a cocktail-paired dinner featuring renowned mixologist and author Jim Meehan, a rare champagne tasting, and even a mint seminar where I'll learn how to properly execute perfectly balanced, minty cocktails such as the mint julep and the mojito.\nOf course, you're welcome to join us. But if you can't make it, and instead find yourself stuck pretending to be excited about a mini-golf outing with the in-laws, or are forced to code all night at a 20-person desk inside a hip tech firm, then listen up: I've got a reading list to help you throw your own dazzling cocktail fest.\nRead More Five rules that make it bourbon\nAfter the kids are sugared-out on soft serve and sleeping soundly in front of \"Frozen\" for the tenth time, or you're pulling an all-night coding session, slip away with one of the following TOTC-nominated best books. You'll be thanked by your co-workers or family for adding some adult fun into the — pun intended — summer mix.\nThe Old Fashioned By Robert Simonson\n\" The Old Fashioned \" is an homage to my favorite whiskey-based drink, the Old Fashioned. At its core, an Old Fashioned is created with bitters, whiskey, ice and sugar, but the variations on this theme are endless. Not only does Simonson provide enough recipes to please any palate – just imagine the types of sweeteners, bitters, and spirits you could use – but the book reads like a biography. We learn about the cocktail's humble beginnings, its wild ride and internal changes throughout prohibition and World War II, and finally it's re-emergence as a screen-star in TV shows like \"Mad Men\" and in movies like \"Crazy, Stupid, Love. \"\nRead More A $2,500 mint julep?!\nLiquid Intelligence By David Arnold\n\" Liquid Intelligence \" is the winner of the James Beard award for best beverage book and the International Association of Culinary Professionals Jane Grigson Award. This scientifically-driven tome to cocktail making covers topics such as the shape and clarity of an ice cube and its effect on palate, nitro-muddling fresh basil to prevent browning, and how to work with saline to make your cocktail's flavor pop. Sure, professional bartenders love the idea of a red-hot poker being used behind the bar, but just about any budding home bartender I know is intrigued by an idea like that, too. Get the book to find out why.\nThe Bar Book By Jeffrey Morganthaler\nWant to learn how to shake and stir like a pro? How about a primer on the types of sugar to use for cocktails with some simple-syrup recipes? \" The Bar Book \" even covers types of juicers, a history of carbonation, and a section on \"how to muddle herbs.\" Good technique can elevate your amateur bartending skills to enviable heights. This book tells you how to do that.\nSherry By Talia Baiocchi\nMost Scotch whisky* fans like myself know a wee bit about sherry – old sherry casks (butts) are used in Scotland to deliver rich flavors of dried fruits, nuts and caramels into fine whisky during maturation. But few of us sit around and drink sherry anymore. In my whiskey circles, sherry ignorance is rapidly changing, though with the help of this beautifully-photographed sherry guide. While technically a wine, the use of sherry can deepen or even transform a cocktail. Bartenders in New York like Xavier Herit at Wallflower have known this for a while – he's been playing with sherry for years to great success. Now you can, too. Should you wish to ditch the mixing and stirring, \" Sherry \" also includes buying and food-pairing suggestions. I have already started my own sherry closet, and I've collected a slew of sherry vinegars to use with salads – yes, she even covers that, too.\nRead More A bourbon lover's Holy Grail: The Kentucky Bourbon Trail\nRefreshing whiskeys for summer Think single malt is only for winter drinking? Think again. Here are three great bottles for a summer cabinet. Pour yourself a dram (measure) of whiskey while reading one of your new booze books!\nHakushu 12 Single Malt Whisky\nThis crisp, refreshing Japanese whisky delivers hints of melon and vanilla — it works well served over ice as well as poured neat. The Japanese have been making whisky for close to 100 years, and they do it well. You'll notice a slight bit of peat in this expression, too — a mere whisper of an Islay whisky. I enjoy making a highball (ice and club soda) with this variant and will place a wee sprig of mint as garnish. Slap the mint in your hand first — this will release a bigger aromatic pop of flavor into the glass.\nBrenne Single Malt Whisky\nBrenne tastes like no other single malt in the world — the tropical, fruity, and lush banana notes make you feel like you're drinking the same whisky Bridget Bardot would enjoy while sitting on a stone wall overlooking the Mediterranean. Don't approach Brenne with the same mind-frame as you would a Scotch whisky, though — it's aged in old cognac casks, and the barley used is grown side-by-side with cognac vines. If there's any whiskey that shows terroir, this is it. It's especially lovely on ice with two drops of bitters and an orange peel.\nHighland Park 18\nI do the unthinkable with this single malt Scotch whiskey in the summer: I add ice. Blasphemy? Maybe. Delicious? No doubt! Scotch fundamentalists beware: A taste of this on a hot day will change your anti-ice stance. Ice changes the dynamics of any whiskey – a couple of cubes added to a dram of Highland Park 18 allows a creamy vanilla lusciousness to pop while softening the earthy peatiness. This is a perfect early-evening sipping malt – I put a bottle of this out with a bucket of ice at a party I hosted recently and within hours the bottle was empty.\n* Whiskey-producing regions around the world use two different spellings. For example, in America, it's whiskey. In Scotland,it's whisky.\nCommentary by Heather Greene, an author, speaker and consultant who travels around the world teaching people about whiskey. She was the director of whiskey education and sommelier at The Flatiron Room in Manhattan from 2012 to 2014. She is also an accomplished musician. Her latest record, released in 2012, is Argon 40. Follow her on Twitter @HeatherMGreene and check out one of her music videos below:\nMore from the CNBC summer reading series:\nThrillers? Romance? What Wall Street's reading this summer\nWant to think like a VC? Read these books", "external_links": ["http://www.amazon.com/exec/obidos/ASIN/145211384X", "http://www.amazon.com/exec/obidos/ASIN/0393089037", "http://www.twitter.com/HeatherMGreene", "http://www.amazon.com/exec/obidos/ASIN/0670016802", "http://www.amazon.com/exec/obidos/ASIN/160774581X", "http://www.amazon.com/exec/obidos/ASIN/1607745356"], "published": "2015-07-02T03:00:00.000+03:00", "crawled": "2015-07-02T23:57:59.000+03:00", "highlightTitle": ""}