{"organizations": [], "uuid": "9ab91444aa5c24ca653eb3f2c12d1595b50d670f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61608/air-canada-adds-another-australian-destination-its-network", "country": "US", "title": "Air Canada adds another Australian destination to its network", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Air Canada adds another Australian destination to its network", "spam_score": 0.0, "site_type": "news", "published": "2015-07-20T05:20:00.000+03:00", "replies_count": 0, "uuid": "9ab91444aa5c24ca653eb3f2c12d1595b50d670f"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61608/air-canada-adds-another-australian-destination-its-network", "ord_in_thread": 0, "title": "Air Canada adds another Australian destination to its network", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Air Canada adds another Australian destination to its network Adv: \nJul 20, 2015 Adv: \nVANCOUVER, Canada - Air Canada has added Brisbane to its expanding international network from 16 June 2016. \nThe new service from Vancouver is initially three times per week and complements Air Canada's daily flights to Sydney also non-stop. The flights are provided by Boeing 787-8 Dreamliners in a three-class (Business, Premium Economy and Economy) layout. \n\"Air Canada continues to strategically expand its international network with the addition of our second Australian destination – Brisbane, capital of Queensland and the third most populous city in Australia. The new route increases our presence in the Asia-Pacific market at a time when trade and travel in the region and between North America is growing, with a further boost expected from the Trans-Pacific Partnership now under negotiation. Already, Air Canada commits C$2bn worth of aircraft to the Pacific market each day and Brisbane is the third new Pacific route we have announced in the past year, after Toronto – Tokyo Haneda and Vancouver – Osaka,\" said Calin Rovinescu, President and CEO, Air Canada. \nKate Jones, Minister for Tourism and Major Events, Queensland Government, welcomed the new flights, stating: \"The Air Canada service is expected to inject up to C$24 million in visitor expenditure for Queensland's economy per year and attract an extra 12,000 international visitors to Queensland.”", "external_links": [], "published": "2015-07-20T05:20:00.000+03:00", "crawled": "2015-07-20T12:14:56.730+03:00", "highlightTitle": ""}