{"organizations": [], "uuid": "8ad530577c857858d423bba1dafc5ad6150e237c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/runway_finavia.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/runways-require-careful-work/", "country": "US", "title": "Runways Require Careful WorkTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Runways Require Careful WorkTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-07-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "8ad530577c857858d423bba1dafc5ad6150e237c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/runways-require-careful-work/", "ord_in_thread": 0, "title": "Runways Require Careful WorkTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Helsinki Airport’s runway 1 under general overhaul Published on : Sunday, July 12, 2015\nAt the moment, Helsinki Airport’s runway 1, first commissioned in 1952, is undergoing a complete overhaul. Likewise, the runways of Kittilä and Vaasa airports are being renovated.\n‘We are completely renewing runway 1. The project started with inspection and reinforcement of the current foundations as necessary’, explains Helsinki Airport’s Vice President Heini Noronen-Juhola from Finavia.\nA great deal of electrical and telecommunication cables run under the runway. Over 3 km of runway results in some 30 km of cabling work. The area has nearly 2,000 light fixtures, while the number in the entire flight traffic area is roughly 14,000.\n‘This all is covered by layers of asphalt with a total thickness of 40 to 50 cm. We want to use asphalt that is of as high a quality, tight, and durable as possible’, continues Noronen-Juhola.\nThe overhaul of runway 1 costs roughly 18 million euros. The work is carried out by two asphalt providers and a few hundred subcontractor workers.\nA runway is a stretch of road planned and realised with great care. Its asphalt surface hides all sorts of structures, cables, and light fixtures.\nA sea of light emerges in front of the aeroplane. As the aeroplane wheels hit the ground, they are supported by a meticulously planned and built surface.\nRunways must possess exceptional strength and durability. An aeroplane is ten times heavier than an articulated lorry with a full load. Moreover, runways are subjected to massive point loads as an aeroplane wheel after another touchdown.\nGood cooperation with airlines\nThe runway overhaul project started at the beginning of May and should end by the beginning of August.\n‘First, we will work on the crossing areas of runways 1 and 2. We are handling taxiways to runway 3, ensuring that there are always two taxiways available for use’, says Noronen-Juhola.\nRunway 3 functions as the airport’s main runway for the duration of the overhaul project. Runway 2 will is also in use but with a lower capacity.\n‘We planned the flight schedules during the renovations together with the airlines. In fact, I want to thank our airlines for good cooperation and flexibility!’\nRead more about the impact of the overhaul project on the flight schedules and passenger traffic on our site. There are some temporary changes in the aircraft noise areas. More information is available on the resident site.\nHelsink Airport has three runways.\nRunway 1 was completed in 1952, the same year the airport was inaugurated. Runway 2 was introduced in 1956 and runway 3 in 2003.\nSource:- Finavia\nRelated Posts Refurbishment of the northern runway – Work starts 2014 Helsinki Airport – Airport railway nearly ready Antalya GoSleep pods now at gates 31 and 37 Art performance at Helsinki airport on March 26", "external_links": [], "published": "2015-07-12T03:00:00.000+03:00", "crawled": "2015-07-13T08:46:15.000+03:00", "highlightTitle": ""}