{"organizations": [], "uuid": "abb27ec1f09ffa11843f9d30d0546a3ad7cc35fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.herald.ie/sport/article31353013.ece/ALTERNATES/h342/2015-07-06_spo_10919972_I1.JPG", "site_section": "http://www.herald.ie/lifestyle/travel/", "section_title": "Travel - Herald.ie", "url": "http://www.herald.ie/sport/uefa-regions-cup-final-irish-stand-tall-to-make-history-31353015.html", "country": "", "title": "UEFA Regions Cup Final: Irish stand tall to make history", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "UEFA Regions Cup Final: Irish stand tall to make history - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T11:00:00.000+03:00", "replies_count": 0, "uuid": "abb27ec1f09ffa11843f9d30d0546a3ad7cc35fe"}, "author": "Niall Feery", "url": "http://www.herald.ie/sport/uefa-regions-cup-final-irish-stand-tall-to-make-history-31353015.html", "ord_in_thread": 0, "title": "UEFA Regions Cup Final: Irish stand tall to make history", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Irish amateurs launched all the fourth of July fireworks on Saturday afternoon as the Boys in Green were crowned champions of Europe. Paul Breen David Lacey Niall Feery – 06 July 2015 03:00 AM\nAfter an astonishing week of top-class football, it was the local heroes, lead by the outstanding Ken Hoey, that prevailed with a win over Croatia to become the first Irish team to lift the UEFA Regions Cup. It was a historic day for Gerry Smith's squad and for grassroots football in Ireland.\nDavy Lacey supplied the winning goal with a sublime flying header after ten minutes. The Killester United man came in at the sharp end of a cutting Irish attack that was started by captain Hoey, who clipped a neat pass out wide to the feet of James Lee. The Crumlin man whipped in a vicious first time cross and Lacey took to mid-air to execute a perfect diving header.\nREAD MORE: European dream comes true thanks to hard graft\nIt was the perfect start for the Irish boys. Smith's side has been almost impossible to breakdown in this competition, only Bosnia managed to score in 360 minutes of football, and to give them a head start was akin to inking your football death warrant, the Irish have been that good defensively.\nThere were other chances to extend the lead. Lar Dunne, Thomas Dunne, Lee himself and Noel Murray, with a stinging free-kick that burned the gloves off Stipe Nevistic, all worried the visitors across the spectrum of 90 minutes. In the end, no extra freight on the scoreline was needed.\nThe Croatians came into the game with a big reputation, a reputation built on three wins in their group and on their ability to play controlled, possession football. They showed glimpses on rare occasions, especially after the break as they started to poke at the Irish side's defensive seams.\nconducting\nMidfielder Robert Janjis was conducting his side's forward advances, flashing passes across the Tallaght turf seeking out a gap in the Irish shield. The highly influential Bozidar Karamatic, deemed not fit enough to start, was dragged off the bench to see if he could do some damage. He did get a shot away, Brendan O'Connell didn't flinch.\nAs the visitors pushed the ball around, the Irish tucked in, stayed discipline and closed down any white shirt that had the cheek to advance over the halfway line.\nThe visitors were demoralised. There was no way through or around the green wall where Noel Murray and Paul Breen stood like giants, clearing, tackling, heading and commanding all around them. It was a week for heroes, they don't come bigger than the Irish central pairing. Hoey and Kevin Lynch flanked Breen and Murray in the back four as they proved unmoveable in front of O'Connell.\nIn midfield, Lee and Darren Dunne curbed their natural instincts to attack and instead stayed true to the game plan, hassled and harried their markers into submission. Aji Sule, and Lar Dunne ensured no route forward from the flanks while Lacey and Greg Moorhouse didn't give the Croatian back-line a minute to take in their surroundings.\nThe front two were called ashore in the final quarter. Thomas Dunne entered the action and with his first touch sent a header inches wide. The Ringsender caused his own brand of mayhem going close with a couple of cunning efforts while Jon Rock made sure the Croatian defenders couldn't breathe in the final minutes.\nremarkable\nJimmy Carr made a remarkable impact off the bench for Sule. The Tipperary wizard had a couple of runs into the heart of the Croatian defence that had the 1,200 folks in the crowd on their feet as he released the pressure valve on the Irish goal.\nIt was a performance of discipline, tactically astute, hard work and plenty of class. But that's what makes European champions.\niRELAND: Brendan O'Connell; Ken Hoey, Kevin Lynch, Noel Murray, Paul Breen, Darren Dunne, Lar Dunne, James Lee, Greg Moorhouse, David Lacey. Subs: Thomas Dunne (for Lacey 60mins), James Carr (for Sule 69mins), Jon Rock (for Moorhouse 73mins). Conor Riddick, David Meehan, Ross Carrig, Paul Murphy, Chris Higgins, Dean Gibbons.\nRelated Content European dream comes true thanks to hard graft", "external_links": [], "published": "2015-07-06T11:00:00.000+03:00", "crawled": "2015-07-06T16:49:07.000+03:00", "highlightTitle": ""}