{"organizations": [], "uuid": "34a823a92781a116c61a4747e73d85505f84a983", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62024/ottawa-raises-steaks-inaugural-capital-ribfest", "country": "US", "title": "Ottawa raises the steaks with the inaugural Capital Ribfest", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Ottawa raises the steaks with the inaugural Capital Ribfest", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T19:11:00.000+03:00", "replies_count": 0, "uuid": "34a823a92781a116c61a4747e73d85505f84a983"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62024/ottawa-raises-steaks-inaugural-capital-ribfest", "ord_in_thread": 0, "title": "Ottawa raises the steaks with the inaugural Capital Ribfest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ottawa raises the steaks with the inaugural Capital Ribfest Adv: \nJul 30, 2015 Adv: \nOTTAWA, Canada - Ottawa, Canada’s capital, has long been renowned for its culinary excellence thanks to a host of cutting-edge restaurants, world-class chefs and epicurean tours. However, it is by visiting one of a growing number of eclectic gastronomy-themed festivals that visitors can really make the most of the city’s burgeoning food scene. The Capital Ribfest is the latest such event to launch and follows on the success the Ottawa Wine and Food Festival, the Gatineau BeerFesst and the hugely popular Ottawa PountineFest amongst others. \nCapital Ribfest is set to take place over the civic bank holiday (known as Colonel By Day in Ottawa) outside Ottawa City Hall, 30th July to 3rd August. Organisers are billing the event as 5 awesome days of grilling heaven where visitors will be able to tuck in to the best slow-cooked ribs, bbq chicken and succulent pulled pork. Craft beer pairings by award-winner Broadhead Beer will be available and there will be a bar serving fine local and international wines. With no admission charge, there will also be plenty on offer to entertain the whole family including a live music stage, cooking demonstrations and rib cutting contest, a beer garden and a traditional cornhole tournament. \n“It’s truly an amazing social to share and celebrate with your friends and family,” says Les Gagné, Festival Director. “I think we’re onto something really big here and we’d like rib fans and BBQ enthusiasts to come get their sticky on with us all weekend long.”", "external_links": [], "published": "2015-07-30T19:11:00.000+03:00", "crawled": "2015-07-30T22:30:19.679+03:00", "highlightTitle": ""}