{"organizations": [], "uuid": "a05287409f76d8641b17a15cd85d561af9ba2afd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03376/edinburgh-2_3376117k.jpg", "site_section": "http://www.telegraph.co.uk/travel/destinations/europe/uk/scotland/rss", "section_title": "Scotland travel information, holiday ideas, advice and reviews", "url": "http://www.telegraph.co.uk/travel/11736639/Edinburgh-a-guide-to-the-best-shops-hotels-and-restaurants.html", "country": "US", "title": "Edinburgh: a guide to the best shops, hotels and restaurants", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Edinburgh: a guide to the best shops, hotels and restaurants", "spam_score": 0.0, "site_type": "news", "published": "2015-07-17T09:00:00.000+03:00", "replies_count": 0, "uuid": "a05287409f76d8641b17a15cd85d561af9ba2afd"}, "author": "Sarah Biddlecombe", "url": "http://www.telegraph.co.uk/travel/11736639/Edinburgh-a-guide-to-the-best-shops-hotels-and-restaurants.html", "ord_in_thread": 0, "title": "Edinburgh: a guide to the best shops, hotels and restaurants", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Edinburgh: a guide to the best shops, hotels and restaurants Yes, you’ll find kilts, whisky and Angus steak. But how about boutique bars, hip hotels and secret vintage stores? The Scottish capital is full of surprises… A view over Edinburgh, of which the Old and New Towns are together listed as a World Heritage Site Photo: Alamy By Sarah Biddlecombe Comments \nStay \nAfter a complete overhaul, The Waldorf Astoria, a former Victorian railway hotel, has a swish new look. Be sure to request a room overlooking stunning Edinburgh Castle. From £175 \nThe swimming pool at The Waldorf Astoria \nWant something more quirky? Look no further than The Grassmarket Hotel. Here, the wallpaper is printed with pages from The Dandy and staff will stick a new puzzle for you to try on your wall every morning. From £54 \nDrink \nNo trip to Scotland would be complete without a wee dram of whisky. Pop to Whiski bar in the Old Town where you can sample one or two, or indeed more, of the 300 malts on offer. \nJourney underground to the inner sanctum of Bramble bar. It recently became the first Scottish venue to make Bartender magazine’s exclusive list of the top 20 bars in the world – and for good reason. While away the hours with a speciality cocktail, such as the gin-infused La Roux. \nA print from Little Ox Gallery, left, and vintage gems from Godiva boutique, right \n• Dublin: a guide to the best shops, hotels and restaurants \nShop \nExplore the city’s labyrinthine alleys to uncover its hidden shopping treasures, such as Godiva boutique. This gem of a vintage store will please even the pickiest of shoppers – especially when they see the bargain prices. \nOn the cobbled streets of Greater Grassmarket you’ll find Edinburgh’s best independent shops. Pick up original prints at Little Ox Gallery and sugary treats aplenty from Bain’s Retro Sweets . \nEat \nThe Witchery is a celebrity haunt on the Royal Mile with oodles of atmosphere. For a truly Scottish dining experience, cosy up with a bottle of red and the excellent Angus steak tartare. \nFor a meal with a castle view, try Contini Cannonball in the Old Town. Scottish tradition meets Italian influence in dishes such as open lasagne of Loch Arthur ricotta. \nContini Cannonball \nDo \nWhat better way to see Edinburgh than with a private walking tour of the city? Tourist guide Alister McDermott will arrive in full Scottish attire and whisk you off on a lively sightseeing stroll. If it’s a cold day, be sure to ask for a swig from his hip flask. \nSpa \nThe award-winning Guerlain Spa is a special place. Tailor your treatment by picking your favourite scent from one of the oldest perfume houses in the world, then lie back and enjoy.", "external_links": [], "published": "2015-07-17T09:00:00.000+03:00", "crawled": "2015-07-17T10:09:55.000+03:00", "highlightTitle": ""}