{"organizations": [], "uuid": "44836f7062b9f69dcb8f74ee27f9e8fd2d1003f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "//img.washingtonpost.com/pb/resources/img/twp-2048x1024.jpg", "site_section": "http://www.washingtonpost.com/lifestyle", "section_title": "Lifestyle: Food, Style, Travel, Advice, Home, Garden &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/national/ohio-judge-wants-to-know-if-he-can-refuse-gay-weddings/2015/07/08/33be3698-25a1-11e5-b621-b55e495e9b78_story.html", "country": "US", "title": "Ohio judge wants to know if he can refuse gay weddings", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Ohio judge wants to know if he can refuse gay weddings - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "44836f7062b9f69dcb8f74ee27f9e8fd2d1003f7"}, "author": "By John Seewer | AP", "url": "http://www.washingtonpost.com/national/ohio-judge-wants-to-know-if-he-can-refuse-gay-weddings/2015/07/08/33be3698-25a1-11e5-b621-b55e495e9b78_story.html", "ord_in_thread": 0, "title": "Ohio judge wants to know if he can refuse gay weddings", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By John Seewer | AP July 8 at 2:47 PM TOLEDO, Ohio — A judge who refused to marry a same-sex couple said on Wednesday that he wants to know if he can skip out of performing gay weddings altogether.\nToledo Municipal Court Judge C. Allen McConnell said he didn’t marry the couple earlier this week because of his personal and religious beliefs. Another judge was brought in to perform the wedding the same day.\nThe court uses a weekly rotation of judges to perform marriages and handle other unscheduled matters. McConnell was on duty Monday when he refused to perform the wedding.\n“I apologize to the couple for the delay they experienced and wish them the best,” McConnell said in a statement.\nHe also said he’ll continue to perform weddings between men and women while he waits to hear if he can opt out of same-sex marriages.\nThe judge said he would seek an opinion from the Ohio Supreme Court, but court spokesman Bret Crow said the request would need to go before a board appointed by the court that handles conduct and ethics matters involving judges.\nCarolyn Wilson told The Blade the judge’s decision put a damper on her special day. She said she never spoke to the judge and that his bailiff informed her that he “didn’t do ‘these types of marriages,’” she said.\n“You wait so long for this opportunity,” she told the newspaper. “Because we wanted to handle it civilly, we didn’t think there would be any issue at all.”\nSame-sex marriages began across Ohio nearly two weeks ago after the U.S. Supreme Court’s ruling legalizing gay marriage across the country.\nOn the day of the ruling, officials at the county courthouse in Toledo called in another minister to perform same-sex marriages because the rotating minister on duty would not marry gay couples\nAround the state, the issuance of marriage licenses for same-sex couples that day went relatively smoothly because Ohio’s probate judges has been discussing how to handle the decision for several months, such as by having gender-neutral marriage applications available, said Pickaway County Judge Jan Long, the head of the Ohio Association of Probate Judges.\n“All we’re doing as an association is offering guidelines of things to think about, as well as alerting judges that these are the kinds of things that you might encounter and might want to start thinking about,” he said.\nOne obvious issue is removing gender references from standard court forms. Ohio Supreme Court spokesman Bret Crow said an initial review found about 20 forms that need to be changed. Long said the judges’ group plans to review all the standard probate forms and recommend any needed changes for court approval.\n___\nAssociated Press writer Kantele Franko in Columbus contributed to this report.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-08T22:06:13.000+03:00", "highlightTitle": ""}