{"organizations": [], "uuid": "499047da105804a7ff7a82c1a1c31d8c692957bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61973/johannesburg-host-global-entrepreneurship-congress-2017", "country": "US", "title": "Johannesburg to host Global Entrepreneurship Congress 2017", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Johannesburg to host Global Entrepreneurship Congress 2017", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T10:52:00.000+03:00", "replies_count": 0, "uuid": "499047da105804a7ff7a82c1a1c31d8c692957bb"}, "author": "eTN Managing Editor", "url": "http://www.eturbonews.com/61973/johannesburg-host-global-entrepreneurship-congress-2017", "ord_in_thread": 0, "title": "Johannesburg to host Global Entrepreneurship Congress 2017", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Johannesburg to host Global Entrepreneurship Congress 2017 Adv: \nJul 29, 2015 Adv: \nJohannesburg in South Africa will host another international congress in March 2017 when leading global entrepreneurs and innovators attend the first Global Entrepreneurship Congress (GEC) to be held on the African continent. The announcement was made today at a media launch held at the Sandton Convention Centre. The hosting rights for GEC 2017 were awarded at GEC 2015 in Milan. \nThe objectives of the Congress are to map out entrepreneurial ecosystems, share new developments in startup financing, connect entrepreneurs to the best resources and networks, and identify emerging entrepreneurial hotspots and global expansion of the producer movement. The GEC, initiated by the Global Entrepreneurship Network (GEN) and the Kauffman Foundation in 2009, is a gathering of startup champions from all over the world. The Congress hosts thought-leaders, entrepreneurs, investors, researchers and policymakers who have become part of a global movement that advances entrepreneurship to build economies and improve human welfare. \n“Hosting the GEC in 2017 will give South Africa the opportunity to showcase its entrepreneurial capacity to the world and show yet again why it is the leading host city of world congresses and business leaders. Johannesburg has world-class infrastructure to support hosting a world congress and its guests,” says Councillor Ruby Mathang, MMC Economic Development for the City of Johannesburg. \nAs a vibrant economic, social and entrepreneurship hub, Johannesburg has a major role in the African entrepreneurship network that has significant benefits for the rest of Africa. This Congress will confirm the city as part of an entrepreneurship network and skills revolution to train young Africans in science, technology, research and innovation, as well as a key driver for African youth and women in innovation and development, Mathang explained. \nJohannesburg is co-hosting the Congress with SEA Africa as the local member and host of the GEN. SEA Africa, a renowned specialist research and development company, was responsible for initiating, managing, leading and ultimately securing the bid. \nKizito Okechukwu, Executive Head of SEA Africa, says: “This Congress will assist businesses and promote entrepreneurship across the African continent. We are therefore calling on entrepreneurs to leverage from various support structures and programmes being introduced by various partners. We are expecting leading global entrepreneurs and innovators to grace this occasion.” \nThe Minister of Small Business Development, Ms Lindiwe Zulu says bringing the GEC to South Africa was a collective effort by her Department, the City of Johannesburg, Barclays Africa and SEA Africa. \n“GEC will help sustain the momentum of an entrepreneurial revolution which President Jacob Zuma set in motion last year when he announced the establishment of our separate department that would focus on small businesses and cooperatives! I am confident that GEC 2017 will further thrust entrepreneurship and small business development firmly on the national agenda and the collective consciousness of our nation,” said Minister Zulu. \nShe added: “As a Department, we are determined to work with all stakeholders to ensure that the GEC becomes a resounding success and benefits entrepreneurs in South Africa and the rest of the African Continent.” \nOkechukwu agrees and says winning this bid is testament to the successful collaboration between the private and public sector. “Collaboration is vital. In this regard, we need to build sustainable ecosystems for entrepreneurial growth in Africa. The work starts right now because we need to build up to 2017. \n“We will do this in partnership with various global and local partners and we also invite all stakeholders in the entrepreneurial space within Africa to engage, support and participate in this process. The Global Entrepreneurship Network continues to expand its involvement in Africa to support and assist the next generation of entrepreneurs here to rebrand the continent and permanently shift perceptions.” \nAccording to Craig Bond, CEO of Retail and Business Banking at Barclays Africa, the Congress, which is expected to attract over 5000 delegates, is a great opportunity for South Africa and Africa as a continent to showcase its entrepreneurial prowess to the world. “The GEC is a platform that can open doors for our youth, ignite entrepreneurship and put our youth in the global arena. It contributes to the overall Pan-Africanism objective by strengthening common perspectives amongst nations, creating partnerships and collaborative efforts, and encouraging inter-regional trade.” \nIn preparation for this momentous event, Barclays Africa is planning several lead-up activities that support entrepreneurship development on the African continent. These exciting activities aim to create a platform for African entrepreneurs to engage, participate, benefit and be supported in their businesses. \nThe GEC global team is currently visiting South Africa from 27-29 July 2015. Speaking in Johannesburg, Jonathan Ortmans, President of GEN, says the focus of the team’s visit is on the local committee’s strategic and operational plan as well as site visits to hotels and the Sandton Convention Centre. Their visit will include engaging with various stakeholders in the entrepreneurship space as well as visits to various entrepreneurship hubs and local attractions. \n“GEC 2017 is just one example of the Global Entrepreneurship Network commitment to helping the next generation of African entrepreneurs start and scale—rebranding the continent and permanently shifting perceptions around the world,” said Ortmans. \nHighlights of the team’s tour include, among others, a meeting with the nominated GEN South Africa board members, site visits to the South African Bureau of Standards (SABS) Design Institute, the Innovation Hub in Pretoria, the City of Johannesburg’s SMME Project, the Absa Entrepreneurship Centre and the Gordon Institute of Business Science. For news editors: \nThe Global Entrepreneurship Congress (GEC) was initiated by Global Entrepreneurship Network (GEN) and the Kauffman Foundation in 2009 and is a gathering of startup champions from more than 160 countries around the world. GEC primarily brings together thought-leaders, entrepreneurs, investors, researchers and policymakers who have become part of a global movement that advances entrepreneurship as a means to build economies and improve human welfare. \nThe GEC was held in the United States in 2009, the United Arab Emirates in 2010, the People’s Republic of China in 2011, the United Kingdom in 2012, Brazil in 2013, Russia in 2014 and Italy in 2015 and will be held in Columbia in 2016. All the BRICS countries have hosted the GEC, except South Africa and India. In 2017 South Africa will have the opportunity to showcase its entrepreneurial prowess to the world and be the first African country ever to host the GEC.", "external_links": [], "published": "2015-07-29T10:52:00.000+03:00", "crawled": "2015-07-29T22:30:56.715+03:00", "highlightTitle": ""}