{"organizations": [], "uuid": "8bef67f1f2e80a4d6ff439812682c38ae9729aec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/07/1150715Guayabo1.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/07/16/guayabo-monument-national-park-reopens-tourists", "country": "US", "title": "Costa Rica's Guayabo National Monument reopens to tourists after flooding", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rica's Guayabo National Monument reopens to tourists after flooding -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-07-16T17:45:00.000+03:00", "replies_count": 0, "uuid": "8bef67f1f2e80a4d6ff439812682c38ae9729aec"}, "author": "L. Arias", "url": "http://www.ticotimes.net/2015/07/16/guayabo-monument-national-park-reopens-tourists", "ord_in_thread": 0, "title": "Costa Rica's Guayabo National Monument reopens to tourists after flooding", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Visitors’ access to Guayabo National Monument reopened Tuesday after being closed since June 27 due to damage caused by flooding in the Caribbean region in recent weeks.\nLocated in the Cartago canton of Turrialba, Guayabo is Costa Rica’s largest and best preserved archaeological site.\nDamage by rain last month mainly affected tourist infrastructure, although various pre-Columbian structures suffered minor damage, park administrator Rodolfo Tenorio Jiménez said at the time.\nRepairs included a 1,000-meter segment of the tourist trail leading to the area where the main pre-Columbian structures are concentrated. Repair works are still pending along the remaining 600 meters of the path.\nSome sectors of the national park are still closed to tourists as flooding in these areas caused fallen bridges and damage to various archaeological structures that currently are still under repair.\nAmong them, experts are placing rocks that fell off the Caragra road, a path of some 170 meters long that connects the park’s entrance to the main site where cobblestone roads and round platforms lead to the ancient village’s main plaza.\nRepair work is being conducted with the help of ₡1.5 million ($2,700) allocated by the National System of Conservation Areas , Tenorio said.\nExperts estimate that Guayabo’s total archaeological area comprises some 15 to 20 hectares, however only four of them have been excavated within the park’s 232 hectares.\nIn 2009 the American Society of Civil Engineers declared Guayabo an International Historic Civil Engineering Landmark as “its roadways, retaining walls, underground channels, water supply, and flood control and drainage facilities represent remarkable civil engineering achievements.”\nThe park is now open to tourists every day from 8:00 a.m. – 3:30 p.m.\nRead more about Guayabo National Monument:\nRaiders of the lost tribe: The ruins of Guayabo\nCosta Rica’s oldest city reopens to tourists after renovation", "external_links": ["http://www.asce.org/project/guayabo-ceremonial-center/", "http://www.sinac.go.cr/Paginas/Inicio.aspx"], "published": "2015-07-16T17:45:00.000+03:00", "crawled": "2015-07-17T23:34:37.000+03:00", "highlightTitle": ""}