{"organizations": ["Investigate California State Gambling Commissioner Schuetz Examine California Files Complaint With Fair Political Practice Commission To Investigate California State Gambling", "Fair Political Practice Commission", "California State Gambling Control"], "uuid": "710a0e0dd4a3f762c3019def03a8be69e400b4b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_10_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13234431/1/examine-california-files-complaint-with-fair-political-practice-commission-to-investigate-california-state-gambling-commissioner-schuetz.html?cm_ven=RSSFeed", "country": "US", "title": "Examine California Files Complaint With Fair Political Practice Commission To Investigate California State Gambling Commissioner Schuetz", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Examine California Files Complaint With Fair Political Practice Commission To Investigate California State Gambling Commissioner Schuetz", "spam_score": 0.0, "site_type": "news", "published": "2015-07-28T19:00:00.000+03:00", "replies_count": 0, "uuid": "710a0e0dd4a3f762c3019def03a8be69e400b4b4"}, "author": "", "url": "http://www.thestreet.com/story/13234431/1/examine-california-files-complaint-with-fair-political-practice-commission-to-investigate-california-state-gambling-commissioner-schuetz.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Examine California Files Complaint With Fair Political Practice Commission To Investigate California State Gambling Commissioner Schuetz", "locations": ["California", "Montreal", "Calif.", "SACRAMENTO", "China", "New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mann", "Jason Krause", "Richard Schuetz", "Schuetz"], "text": "Examine California Files Complaint With Fair Political Practice Commission To Investigate California State Gambling Commissioner Schuetz By PR Newswire | 07/28/15 - 12:00 PM EDT Reprint SACRAMENTO, Calif. , July 28, 2015 /PRNewswire/ -- A complaint was filed today with California's Fair Political Practice Commission alleging that California State Gambling Control Commissioner Richard Schuetz has failed to properly report worldwide travel over a span of three years. The complaint, filed by a group called Examine California, investigated travel receipts, email correspondence, and other publicly obtained documents with Commissioner Schuetz's Form 700s and found that as many as two dozen trips were not accounted for on the Commissioner's statement form of economic interest (Form 700). \"Examine California's mission is to hold elected and appointed leaders of California responsible for the job in which they have been either elected to fill or, in this case, appointed to fill,\" said Jason Krause , Founder of Examine California. \"Commissioner's Schuetz's alleged willful disregard to report these worldwide trips raises suspicion over his trustworthiness to carry out the position in which he was appointed.\"Over the course of three years, Commissioner Schuetz spanned the globe in some official state capacity. From China to Montreal and the Isle of Mann to New Orleans , Commissioner Schuetz has allegedly failed to report some 24 known trips on his statement of economic interest. California's gambling industry has exploded over the last decade. A report commissioned in 2014 estimated that the total economic impact that Tribal Gaming alone in the state of California generated in excess of $8 billion . In fact, three of the top-10 political contributors in the state of California are Tribal Casinos. \"Perhaps these are simple omissions by the commissioner, however, we feel that his recent comments in legislative committees and his active meeting with powerful gambling interests are all related and we allege that the Commissioner is looking to bolster his pockets with these interests.\" 1 of 2", "external_links": [], "published": "2015-07-28T19:00:00.000+03:00", "crawled": "2015-07-28T19:14:06.946+03:00", "highlightTitle": ""}