{"organizations": [], "uuid": "9164c1025fd9d61988d66c12d3de458320974e57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/BnMjI0djpdBf32d_HGF3JK1H_cV3K1ON/promo260684399&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/travel", "section_title": "Travel | Travel News and Holiday Deals | The Advertiser", "url": "http://www.adelaidenow.com.au/travel/travel-advice/actor-virginia-gay-from-tv-drama-winners-losers-shares-her-travel-adventures-and-misadventures/story-fnjjv72j-1227435364614", "country": "US", "title": "Winners & Losers star Virginia Gay on travel adventures", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Winners & Losers star Virginia Gay on travel adventures | Travel | Travel News and Holiday Deals | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-07-13T07:30:00.000+03:00", "replies_count": 0, "uuid": "9164c1025fd9d61988d66c12d3de458320974e57"}, "author": "Chanel Parratt", "url": "http://www.adelaidenow.com.au/travel/travel-advice/actor-virginia-gay-from-tv-drama-winners-losers-shares-her-travel-adventures-and-misadventures/story-fnjjv72j-1227435364614", "ord_in_thread": 0, "title": "Winners & Losers star Virginia Gay on travel adventures", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FOR Winners & Losers actor Virginia Gay , food, comedy and the kindness of strangers have always brought colour and context to her travel.\nIf you had friends visiting you in Melbourne, what three things would you insist they do?\nVG: Eat at Chin Chin , DOC Pizza in Carlton and Sichuan House . I know there are things in Melbourne that aren’t food, and I would totally do them too. But I’d eat first.\nEat first at institutions such as DOC Pizza when visiting Melbourne. Gay suggests. Source: News Limited\nWhat’s your favourite comedy event in the world?\nVG: The Melbourne Comedy Festival is the greatest. I’ll watch anything at The Famous Spiegeltent — that space is magic and it’s a privilege to see anything there.\nBest place you’ve ever stayed?\nVG: Holiday House Gilda on the Amalfi coast. My friend and I couldn’t afford to stay in Positano, so we stayed about a kilometre out, in the ramshackle home of this old Italian family. We had the most incredible views of Positano.\nOn the final day we typically missed our bus and had to wait in the epic midday heat for the next one. We were sitting on our suitcases on the veranda, ages from anywhere, with no money, wondering where we could get food when Gilda herself appeared.\nShe brought out bread, homegrown tomatoes and basil leaves as big as your fist, she filled jam jars with cheap red wine, and we got drunk, happy and headachy with these wonderful people, who didn’t speak a word of English but had made everything so wonderful for us.\nFrances James, played by Virginia Gay with baby George in Winners & Losers on Channel 7. Source: Channel 7\nWhat’s the best thing you’ve eaten while travelling?\nVG: Sfogliatella. It’s a ricotta-filled pastry that my friend and I ate religiously for breakfast when we were travelling in Campania, Italy.\nWhat’s the weirdest thing you’ve eaten while travelling?\nVG: Crickets. Thailand. It was to impress a guy. They tasted like salt and pepper sticks.\nWhat’s your biggest travel tip?\nVG: Check your passport. There was an anxious morning when I was packing to go to the Edinburgh Fringe Festival to perform when I thought I’d lost my passport. I found it only to realise it was six months out of date. A special shout-out to the awesome people at the Australian Passport Office who put a magical rush job on the replacement so I could make my 3pm flight.\nHas anything gone wrong while you’ve been travelling?\nVG: Arriving late in a sketchy part of Naples, my friend and I made our way to the station only to discover that it was closed.\nAnxious to get to our hostel we met Mr Unreasonably Handsome stationmaster just as he was locking the gates. He took pity and drove us the 40 minutes to our hostel at great speed with American pop music blasting from the radio.\nWe danced with the windows down in the 28-degree midnight heat and when he dropped us at our hostel door he mimed that we were now like daughters to him and to watch out because not everyone was so nice.\nI loved that guy. We called him our Salt-N-Pepa Saviour for the rest of the trip.\nWhere to next?\nHigh-rises in Shanghai's new Pudong banking and business district, across the Huangpu river from the old city. Source: Getty Images\nVG: Shanghai. It’s my boyfriend’s favourite city. We’re going to eat our body weight in Sichuan food.\nWinners & Losers returns to Channel 7 on Tuesday.\nNational Geographic Traveller", "external_links": ["http://www.sichuanhouse.com.au/", "http://resources0.news.com.au/images/2015/07/09/1227435/364552-e7adf05c-25f2-11e5-b856-d650f72d3e25.jpg", "http://www.heraldsun.com.au/news/slice-of-heaven-best-pizzas/story-e6frf7jo-1226922454671", "https://twitter.com/virginia_gay", "http://resources1.news.com.au/images/2015/07/09/1227435/365081-186963d4-25f3-11e5-b856-d650f72d3e25.jpg", "https://au.tv.yahoo.com/winners-and-losers/#page1", "http://resources1.news.com.au/images/2015/07/09/1227435/364517-ec77df98-243b-11e5-9034-065db1ff92dd.jpg", "http://www.comedyfestival.com.au/2015/season/"], "published": "2015-07-13T07:30:00.000+03:00", "crawled": "2015-07-15T23:52:46.000+03:00", "highlightTitle": ""}