{"organizations": [], "uuid": "793b6134f92315ca0ebb3a1f02f971f8db835c64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61467/qatar-airways-introduce-first-747-freighter-its-expanding-fleet", "country": "US", "title": "Qatar Airways to introduce first 747 Freighter to its expanding fleet", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Qatar Airways to introduce first 747 Freighter to its expanding fleet", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T22:04:00.000+03:00", "replies_count": 0, "uuid": "793b6134f92315ca0ebb3a1f02f971f8db835c64"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61467/qatar-airways-introduce-first-747-freighter-its-expanding-fleet", "ord_in_thread": 0, "title": "Qatar Airways to introduce first 747 Freighter to its expanding fleet", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Qatar Airways to introduce first 747 Freighter to its expanding fleet Adv: \nJul 15, 2015 Adv: \nDOHA, Qatar – Qatar Airways Cargo will introduce the first 747 freighter to its expanding fleet on 1 August 2015 to further enhance its global on-demand charter services. \nThe B747-400BCF will complement the cargo airline’s expanding freighter fleet providing 112.5 tonnes of capacity dedicated to worldwide charter services. The aircraft is well known for its loading flexibility and with a wide side cargo door the B747F can be loaded quickly and easily, irrespective of whether the load is made up of standard containers and pallets, or outsized cargo. \nQatar Airways Chief Officer Cargo, Mr. Ulrich Ogiermann said: “Qatar Airways Cargo is experiencing increased worldwide demand for quality charter services as well as growing local demand with significant infrastructure projects under way in Qatar that require outsized cargo capacity. The addition of the B747 freighter will also provide greater flexibility to our global network by supplementing our existing scheduled services as and when required.” \nThe airline will welcome a B747-400F with a nose loading door to its fleet in October 2015, replacing the B747BCF to provide even more flexibility to satisfy customers’ oversized cargo transportation demands. \nOne of the largest palletized cargo aircraft available in the market, the 747F will provide belly freight capacity and main cargo deck capacity with 39 ULD positions. The pressurized cargo cabin means that the aircraft is suitable to transport freight of all kinds and can provide a temperature control range from 4° to 30° degrees Celsius. Livestock and horses, perishables, heavy machinery, oversized equipment, oil and gas equipment, and humanitarian and relief aid can all be transported worldwide on this aircraft, which is suitable for long haul cargo flights of up to 10 hours. \nThe QR Charter service offers quality, reliable and cost effective global charter solutions to any part of the world, including full, split and combination charter services. The carrier’s dedicated Charter team delivers a high level of customer service and communication with proven experience across an increasing portfolio of charter services satisfying customer requirements. \nQatar Airways Cargo is the world’s fifth largest airfreight airline and operates one of the most modern fleets in the sky with eight B777Fs and six A330Fs. The airline recently announced a firm order for four B777 Freighters at the Paris Air Show on 18 June, this is in addition to an existing order for four B777Fs and two firm A330Fs with options for a further eight. \nThe cargo airline operates from its state-of-the-art hub Hamad International Airport, where its cargo terminal is one of the largest in the world. Operating an advanced air cargo handling system, the cargo complex has a capacity to process 1.4 million tons of cargo per year and can accommodate 11 wide-body freighters with 42 airside loading docks to facilitate the swift and efficient transfer of cargo in to and out of Qatar.", "external_links": [], "published": "2015-07-15T22:04:00.000+03:00", "crawled": "2015-07-15T23:04:12.000+03:00", "highlightTitle": ""}