{"organizations": ["Lone Star"], "uuid": "4551022455ee751f3744f9a1bdda1edcd4dede39", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buyingbusinesstravel.com", "main_image": "", "site_section": "http://buyingbusinesstravel.com/", "section_title": "Buying Business Travel | For Business, Corporate Travel &amp; Meeting Buyers &amp; Arrangers", "url": "http://buyingbusinesstravel.com/news/0624398-lone-star-form-%C2%A32bn-uk-hotel-brand", "country": "US", "title": "Lone Star to form £1bn UK hotel brand", "performance_score": 0, "site": "buyingbusinesstravel.com", "participants_count": 0, "title_full": "Lone Star to form £1bn UK hotel brand", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T20:42:00.000+03:00", "replies_count": 0, "uuid": "4551022455ee751f3744f9a1bdda1edcd4dede39"}, "author": "", "url": "http://buyingbusinesstravel.com/news/0624398-lone-star-form-%C2%A32bn-uk-hotel-brand", "ord_in_thread": 0, "title": "Lone Star to form £1bn UK hotel brand", "locations": ["UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Newcombe Mon"], "text": "0 comments Tom Newcombe Mon, 6 Jul 2015 12:42 Follow @thomasnewcombe Private equity firm Lone Star is bringing together 89 UK hotels to create a new £2 billion company called Amaris.\nThe Dallas-based firm’s group will include 29 Jurys Inn hotels, purchased in January for £680 million, and Puma Hotels, which was purchased last year for £323 million last year.\nPuma Hotels, which owned the Lygon Arms in the Cotswolds and the Imperial in Torquay, has now been rebranded as the Hotel Collection.\nThe umbrella company will also include Lone Star’s 21 Mercure Hotels, three Hilton properties and 19 Thistle Hotels when a deal is completed on July 30.\nGrant Hearn, former CEO of Travelodge has been appointed non-executive chairman of Amaris. Commenting on today’s announcement, Hearn said: “The new Group will allow us to leverage the considerable scale and size of this unique portfolio of hotels and brands to accelerate its future growth and development and, we believe, create the UK’s best performing, most exciting hospitality investment group.\n“Through the successful implementation of our strategy in the coming years we expect the business to have a value of over £2 billion.”\nThe group has more than 15,000 rooms, employs over 8,000 people and its business divisions have combined sales totalling more than £450 million.\nLone Star, through Amaris, intends to commit over £100 million of capital investment in the refurbishment, rebranding and transformation of the group’s portfolio.\n“The strategy is to create a branded hotels business. Many of these hotels have great locations but have not had much put into them. We have £100m to invest and renovate these hotels,” said John Brennan, the current head of Jurys Inn who will become Amaris’ CEO.\nThe company said the need to create a simplified and more attractive business is the reason behind the decision to bring its hotels together in one portfolio.\n“This year is about strategy. In 2016 we will do the renovation and investment, 2017 is when we should see the fruits of our labours,” said Brennan.\nOther appointments in Amaris Hospitality include Cormac Ó Tighearnaigh, current chief financial officer of Jurys Inn, who has been appointed chief financial officer and deputy CEO of Amaris Hospitality. Jennifer Lee has been appointed chief people officer and Darren Guy, group director of finance.\nSign up to BBT’s twice-weekly newsletter", "external_links": ["https://twitter.com/thomasnewcombe"], "published": "2015-07-06T20:42:00.000+03:00", "crawled": "2015-07-06T20:05:42.000+03:00", "highlightTitle": ""}