{"organizations": [], "uuid": "2391057cecb3245ff475065108e0f5e054b04a85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61445/fao-world-crop-prospects-positive-near-east-africa-still-concern", "country": "US", "title": "FAO: World crop prospects positive, Near East, Africa still a concern", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "FAO: World crop prospects positive, Near East, Africa still a concern", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T03:02:00.000+03:00", "replies_count": 0, "uuid": "2391057cecb3245ff475065108e0f5e054b04a85"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/61445/fao-world-crop-prospects-positive-near-east-africa-still-concern", "ord_in_thread": 0, "title": "FAO: World crop prospects positive, Near East, Africa still a concern", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "FAO: World crop prospects positive, Near East, Africa still a concern Adv: \nJul 15, 2015 Adv: \nROME, Italy - Favorable worldwide conditions for cereal crops will lead to better-than-expected production this growing season at the global level, despite continuing apprehension over El Niño. But concerns are growing over a sharp shortfall in maize grown in sub-Saharan Africa as well as poor production in other food insecure hotspot areas. \nAccording to the latest release of the monthly FAO Food Price Index (FPI) and the new edition of the quarterly Crop Prospects and Food Situation report, both issued today, world cereal production this year should amount to 2 527 million tons. \nThat represents a 1.1 percent decline from the record level in 2014, but an improvement from projections made last month. \nMeanwhile, the FPI declined 0.9 percent in June compared to May. At 165.1 points, the index is now down 21 percent compared to a year ago and at its lowest level since September 2009. \nThe decline in the FAO FPI mainly came as a result of a drop of 6.6 percent in the price of sugar and of 4.1 percent in the prices of dairy products, which more than offset a rebound in palm oil and wheat quotations. Increasing worldwide demand for livestock feed, especially in Brazil, China and the United States, is supporting prices for coarse grains, including maize. \nBut those global price trends and favourable prospects for world cereal production mask localized hotspots of food insecurity, the report also cautioned. \nSome 34 countries worldwide, including 28 in Africa - many hosting large numbers of refugees - are in need of external assistance for food, it says. \nMultiple points of concern in Africa \nIn Africa, the overall 2015 production outlook points to a decline from last year's high level, with all regions expecting reduced harvests, except Central and North Africa. \nIn Southern Africa, aggregate cereal production is projected to decrease by 17 percent, mainly due to irregular seasonal rains and an extended dry spell. Aggregate maize production - which accounts for the bulk of the subregion's cereal output -- is forecast at 20.6 million tonnes, 26 percent below the bumper 2014 output. \nAccounting for the bulk of the decrease, South Africa's maize production is estimated at 10.5 million tonnes, a steep 30 percent reduction versus the high level of last year. \nZambia and Malawi's 2015 maize harvests are estimated to be 21 and 26 percent below 2014, and rainfall deficits have severely impacted maize production in the import-dependent countries of Lesotho, Namibia, Botswana and Swaziland, with declines ranging from 13 to 43 percent. \nThese trends are expected to negatively impact on availability of cereal exports to cereal deficit neighbouring countries such as Zimbabwe, where maize output is expected to fall by half. Compared to the low level of the previous year, the number of people in need of assistance for food is set to increase. \nIn West Africa, last year's overall good production in the Sahel region obscures local food security issues, today's report adds. The latest estimates put the 2014 aggregate cereal production in the nine Sahelian countries at 21 million tonnes, about 7 percent higher than the five-year average, thanks to solid outputs in Mali and other coastal countries. \nHowever, a significant drop in production has been recorded in large parts of the Sahel belt, notably in the countries located in western parts of the subregion, due to poor weather. Cereal production there, compared to the five year average, is estimated to have dropped in 2014 by 83 percent in Cabo Verde, 28 percent in the Gambia, 33 percent in Guinea-Bissau and 17 percent in Senegal. Large areas of Chad, Mauritania and Niger were also affected. \nIn Central Africa, despite favorable weather conditions in the Central African Republic, continuing civil insecurity is expected to negatively affect the current cropping season. Strife in the eastern Democratic Republic of Congo is also cause for concern, it notes. In East Africa, late and erratic rains since the start of the cropping season in March impaired the production outlook. \nToday's report in particular highlights \"alarming\" food security conditions in conflict-affected areas of South Sudan, where the number of severely food insecure people has almost doubled to an estimated 4.6 million since the beginning of 2015. \nDespite better prospects, the Near East faces an escalating humanitarian crisis \n2015 cereal production in the Near East is expected to recover from last year's drought, driven by a projected 18 percent increase in output in Turkey. But conflicts continue to \"severely\" impact on agriculture and Iraq, Yemen and Syria continue to face an \"escalating humanitarian crisis,\" according to the report. \nYemen in particular stands out, where of 12.9 million food insecure people about 6.1 million are in \"Emergency\" Phase, while 6.8 million are in \"Crisis\" Phase, representing a 21 percent increase over the previous year. \nAsia - record crops in China and Pakistan, but problems persist In Asia, a record crop in China and Pakistan is expected to offset declines elsewhere -- mainly in India as a result of a poor wheat harvest. \nNepal has seen drops in food production due to earthquake damage, and in the Democratic Republic of Korea, a severe dry spell is expected to result in reduced cereal production in 2015.", "external_links": [], "published": "2015-07-15T03:02:00.000+03:00", "crawled": "2015-07-15T03:30:44.000+03:00", "highlightTitle": ""}