{"organizations": [], "uuid": "3873ceda89a8876ebb7f4b4e6c4c1f6c63372c74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeurope.about.com", "main_image": "http://f.tqn.com/y/goeurope/1/S/H/b/2/ardia-sedilo2.jpg", "site_section": "http://z.about.com/6/g/goeurope/b/index.rdf", "section_title": "About Europe Travel", "url": "http://goeurope.about.com/cs/sardinia/a/ardia.htm", "country": "US", "title": "L'Ardia di San Costantino", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "L'Ardia di San Costantino", "spam_score": 0.0, "site_type": "news", "published": "2015-07-04T16:41:00.000+03:00", "replies_count": 0, "uuid": "3873ceda89a8876ebb7f4b4e6c4c1f6c63372c74"}, "author": "", "url": "http://goeurope.about.com/cs/sardinia/a/ardia.htm", "ord_in_thread": 0, "title": "L'Ardia di San Costantino", "locations": ["Sardinia", "San Costantino L'Ardia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Martin"], "text": "L'Ardia, Sedilo, Sardinia: Racing through the Gate. James Martin \nIt's a horse race and festival like you've probably never seen before. \nWhen : July 5-7 \nWhere : Sedilo, Sardinia, Italy \nSo maybe you're looking for a European festival that hasn't been all gussied up for the tourists. Here's a tip for summer tourists: check out the town of Sedilo in the heart of Sardinia. \nOne of the biggest festivals in Sardinia is L'ardia DI San Costantino, commemorating Constantine's victory over Maxentious at the Mulvian Bridge in 312, where Constantine is reported to have seen a flaming cross inscribed with the words \"in this sign thou shall conquer\". \nEvery year on July 5th through 7th Constantine's charge is recreated with a monumental horse race held on the grounds of the Sanctuario DI San Costantino, just outside Sedilo's eastern boundary. \nOn the evening of the race, horses and riders gather on a hill outside the sanctuary grounds. The local priest and the mayor give grand speeches accompanied by the eloquent gestures: prayers for safety, prayers for the victory of Constantine and thus for Christianity. The moment the pomp settles the horses sense their duty and charge down the hill, the man representing Constantine first, his two flag bearers next, then the thundering herd close behind. \nWhen they reach the Sanctuary, they stop, then circle the sanctuary slowly, getting blessed by the priest each time they pass the front gate--seven times. But on this day, Constantine takes off after the sixth pass, leading all challengers to the dry fountain that marks the end of the race. The town of Sedilo breaths a collective sigh of relief; a win means the basic tenets of Christianity have been renewed for another year. \nAfterwards the crowd eases toward an open field where suckling pigs rotate in wood fired ovens and live skewered eels writhe in painful ecstasy over hot coals. While munching on a few of these eels from a greasy newspaper cone I learn from a local the reason for \"Constantine's\" violation of the rules. \nOnly one person per year is allowed to play Constantine, and only if he has received some special dispensation from God. God has evidently become increasingly magnanimous in His gestures toward the people of Sedilo; there are so many applicants that a rider can be assured of having to wait quite a few years before he gets a chance to repay his Maker. By then he's old enough to require every advantage he can muster against the younger and wilder horsemen. Most gravitate toward the element of surprise. \nThe next morning the race is run for the locals--except this time the course has been transformed into a minefield of crushed beer cans and bottle shards. After the race everyone trudges down to the priest's house for a few sips of vernaccia (the local wine) and a mouthful of pastry. Then it's on to the houses of the flag bearers for more of the same. \nAnd by the way--there's only one glass for that vernaccia. It's a kind of intimate sharing thing. This is Sardinia. You'll get used to it. \nGetting there: Take a flight to Cagliari from Rome or Milano, or Tirrenia Ferry from Civitavecchia to Caglairi or Olbia/Golfo Aranchi or Sardinia Ferries from Civitavecchia to Cagliari. There is no train station in Sedilo. Your best bet to experience this festival is to rent a car in Cagliari and drive north to Sedilo. \nLodging for the Festival It's unlikely you'll find lodging anywhere near Sedilo for the festival. One of our favorite hotels in Sardinia is a bit far away, but very in tune with the Sardinian way of life: Hotel Su Gologone . The closest larger city is Oristano.", "external_links": [], "published": "2015-07-04T16:41:00.000+03:00", "crawled": "2015-07-05T02:03:20.000+03:00", "highlightTitle": ""}