{"organizations": [], "uuid": "d37e1bee5fbf8be230507e4b2851a787406d29f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/62028/smithsonian-host-innovation-festival-national-museum-american-hi", "country": "US", "title": "Smithsonian to host innovation festival at National Museum of American History", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Smithsonian to host innovation festival at National Museum of American History", "spam_score": 0.0, "site_type": "news", "published": "2015-07-30T21:03:00.000+03:00", "replies_count": 0, "uuid": "d37e1bee5fbf8be230507e4b2851a787406d29f7"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/62028/smithsonian-host-innovation-festival-national-museum-american-hi", "ord_in_thread": 0, "title": "Smithsonian to host innovation festival at National Museum of American History", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Smithsonian to host innovation festival at National Museum of American History Adv: \nJul 30, 2015 Adv: \nWASHINGTON, DC - The Smithsonian's National Museum of American History will host an innovation festival September 26 and 27 as a signature event of the collaboration between the Smithsonian and the US Patent and Trademark Office (USPTO). Thirteen companies, universities, government agencies and independent inventors, selected by a juried panel, will participate in the festival, which will explore how today's inventors are creating the world of the future. \nThe museum's Lemelson Center for the Study of Invention and Innovation is leading the effort to present educational programs from across the Smithsonian. Highlights will include innovation and invention programs, hands-on activities, expert talks and demonstrations and opportunities for visitors to meet and exchange ideas with inventors and innovators while exploring their own creative abilities. \n\"The Smithsonian may be known for documenting the intricacies of our nation's history but, it looks at innovation as a way of continuing to tell the story of America,\" said John Gray, director of the museum. \"The innovation festival gives visitors the opportunity to discover inventions and meet the people who design and create such innovations.\" \n\"From the fields of Kitty Hawk to the orchards of the Silicon Valley, our nation has been driven by ingenuity and fueled by innovation,\" said Michelle K. Lee, the undersecretary of commerce for intellectual property and director of the USPTO. \"The Innovation Festival provides an excellent opportunity for visitors to learn how America's intellectual-property system has driven innovation and shaped our nation.\" \nOrganized by The Smithsonian Associates, the Innovation Festival highlights inventors and invention and provides visitors with the opportunity to learn about the patent and intellectual property systems and how they support invention and innovation. The festival will run Sept. 26 and 27, between 10 a.m. to 5 p.m., and will feature examples of American ingenuity developed by independent inventors, academic institutions, corporations and government agencies: \n• C.G.I Technology will present a broad range of efficient, economical and environmentally friendly green home technologies and innovations. \n• Ford Global Technologies will present the Pro Trailer Backup Assist in its 2016 pickup truck, which makes it easier for drivers of all skill levels to back up a trailer. \n• Kansas State University will discuss hydrogels, substances that can transform from a jelly-like state to a liquid-like state, which are being researched for use in medical device applications such as growing and harvesting cells to assist in cell therapy or regenerative medicine and cancer treatment. \n• Mars, Incorporated will provide a look inside confectionery chemistry by demonstrating patented flavor technologies that enhance the sensory experience of confectionery products. \n• NASA will demonstrate the Freeze Resistant Hydration System, which was invented to assure liquid hydration by storing a reservoir of drinking fluid within down clothing and having a closed-loop heating element. \n• NRG Insulated Block will demonstrate a high-performance, concrete-sandwich building block that maximizes energy conservation in homes and commercial buildings. \n• Oak Ridge National Laboratory will demonstrate Piranha, a search engine that quickly identifies connections in documents that would be impossible for human analysts to identify by using an \"intelligent agent\" algorithm. \n• Solar Turbines Incorporated, a Caterpillar company, will showcase recent innovations to reliably reduce gas turbine engine emissions. \n• U.S. Department of Agriculture's Agricultural Research Service will describe the process by which it introduces new plant cultivars with examples of different peppers. \n• University of Pittsburgh's Human Engineering Research Laboratories will showcase the technology used to design, manufacture and operate advanced wheelchairs. \n• Virginia Commonwealth University and the University of Oklahoma will showcase the Self-initiated Prone Progressive Crawler, which helps infants with developmental delays learn to independently explore their environments. \n• Wiperfill will demonstrate how people can automatically maintain high levels of windshield wiper fluid in their vehicles reservoir by capturing and recycling water. \n• Zugara will demonstrate its Augmented Reality-based Virtual Dressing Room technology. \nFestival participants were selected by experts in patented technology from the Intellectual Property Owners Organization, the American Intellectual Property Law Association, the National Academy of Inventors and the independent inventor community. \nThe festival will also feature innovative activities that reflect the missions of several Smithsonian museums, research centers and partners including the Smithsonian Latino Center and Lemelson MIT Invent Teams. \nThe five-year collaboration between the Smithsonian and USPTO, which began in 2014, develops programs and exhibitions showcasing American innovation. These joint efforts include the recently opened \"Inventing in America\" in the new Innovation Wing of the National Museum of American History. Three large cases focus on inventions and innovators of the past and present, featuring early patent models, trademarks and inventions of National Inventors Hall of Fame members. \nThe National Museum of American History is located on Constitution Avenue N.W. between 12th and 14th streets. Admission is free.", "external_links": [], "published": "2015-07-30T21:03:00.000+03:00", "crawled": "2015-07-30T22:30:17.033+03:00", "highlightTitle": ""}