{"organizations": ["IANS"], "uuid": "d0b0633f82a0a0d481c3458a6c18cecd79c4b9fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/7/1402c9ec-0a3c-4fba-8c18-c35a6fd211e7MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Travel", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/travel/why-sanya-on-hainan-island-is-the-ultimate-vacation-destination/article1-1372450.aspx", "country": "US", "title": "Why Sanya on Hainan Island is the ultimate vacation destination", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Why Sanya on Hainan Island is the ultimate vacation destination", "spam_score": 0.0, "site_type": "news", "published": "2015-07-23T16:35:00.000+03:00", "replies_count": 0, "uuid": "d0b0633f82a0a0d481c3458a6c18cecd79c4b9fa"}, "author": "", "url": "http://www.hindustantimes.com/travel/why-sanya-on-hainan-island-is-the-ultimate-vacation-destination/article1-1372450.aspx", "ord_in_thread": 0, "title": "Why Sanya on Hainan Island is the ultimate vacation destination", "locations": ["Hainan Island", "Sanya", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Jaideep Sarin"], "text": "Why Sanya on Hainan Island is the ultimate vacation destination Jaideep Sarin, IANS , Sanya, China | Updated: Jul 23, 2015 19:35 IST With the increasing popularity of Sanya among vacationers, many top-of-the-line hotels have acquired property along the beaches of this city on the Hainan Island in China. (Shutterstock) \nIf you love vacationing in a beach resort, Sanya, a city on the Hainan Island of China, is just the place for you. Hot springs and duty-free shopping are added bonus with the package. \nThe Sanya beach resort in southeast China offers just that. \nThe popularity of Sanya among holiday-makers has driven many top-of-the-line hotel chains, including international giants, to set up shop along the beaches in Sanya. \n\"The tourist inflow is not only from China's mainland now. We get a lot of foreign tourists from Australia, New Zealand, European countries, Russia and even India,\" Flada, an executive with the MGM Grand hotel in the Yalong Bay area, tells IANS. \nThe sun-kissed beaches, tropical weather and the greenery of the Hainan countryside offer a lot to visitors in Sanya. Being located in the southeast part of China and just a 90 minute flight away from Hong Kong gives Sanya easy access. \nThe Sanya Phoenix International Airport may not look flashy enough to carry the tag but it caters to a number of flights, most of which originate from within China or nearby countries. \nSanya is also home to open hot spring resorts. There are a few of them located in the green countryside of the province. The Sanya Pearl River Nantian Hot Spring resort boasts of the largest open-air hot springs in China. \n\"It is a different feeling to be sitting in open air hot springs that open into personalised small pools. One can choose the type of hot spring that one wants to and also the temperature of water (20 to 50 degrees) as per convenience,\" says Cheng Lei, a visitor to one of the hot springs. \nAnother major attraction is the duty-free shopping that the place offers without going to an international airport. \nThe stunning China Duty Free (CDF) Mall is the world's largest duty free shopping centre, built at a cost of over five billion yuan ($800 million/Rs.51 billion), and is located in the Haitang Bay area next to the Westin hotel. \nAt 70,000 square metres spread over three floors, the CDF Mall integrates duty-free shopping, duty-paid shopping, restaurants, entertainment venues and cultural facilities. (Shutterstock) \nTop of the line international brands have big outlets at the mall. The duty-free shopping done at the mall can be collected at the mall's counters inside Sanya airport's check-in. \nThe unique aesthetic design of the mall is inspired by the Haitang flower, the symbol of Sanya. \n\"Its atrium is formed by four unique curved surfaced steel structures, which enable natural light to filter into the mall and create a world-class shopping environment for the users. Its unique 3D free surfaced steel structure covers entrance arch-truss, link-bridges and other five individual skylights,\" notes the mall management. (Shutterstock) \nThe mall opened in September 2014 and shuttle buses are available to ferry visitors and shoppers from hotels and resorts and even residential areas. \nA popular place for eating and shopping in the Yalong Bay area is the 'La Floret' shopping village. It's quite vibrant and has a number of eating joints which serve Chinese, Asian and international cuisines. Some eating joints even have open-air sitting with flashy lights and music bands making the evenings even livelier. \nSanya truly offers a lot as a tropical paradise and a shopping destination. \nFAQs: \n* How to reach: \nSanya is a 90-minute flight from Hong Kong. It is connected to Beijing, Shanghai and other important cities across China through a number of flights. \n* Places to see: \nYalong Bay, Haitang Bay, Dadhong Bay (all beaches), CDF Mall in Haitang Bay, Buddha statute, La Floret shopping village, hot springs in the countryside. \n* What to eat: \n- Chinese food in abundance; there's also Asian and continental fare to be savoured. \n- La Floret shopping village, CDF Mall plus other markets (for roadside variety and cafes) \n* Where to stay: \nHotels, resorts, spas and other properties are lined up in all three popular bay areas and are located close to the beaches. From 3-star to 5-star properties - all are available and cater to all kinds of budgets. \n* Shopping \nCDF Mall, La Floret shopping village and local markets. Tags", "external_links": [], "published": "2015-07-23T16:35:00.000+03:00", "crawled": "2015-07-24T09:33:25.556+03:00", "highlightTitle": ""}