{"organizations": [], "uuid": "937caa4694657af9627f47413bc85479efd71292", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/07/download-4.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/cega-secures-investment-announces-management-buy/", "country": "US", "title": "SriLankan Airlines steers “Nena Pahan” youth development programme", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "SriLankan Airlines steers “Nena Pahan” youth development programme", "spam_score": 0.0, "site_type": "news", "published": "2015-07-02T12:27:00.000+03:00", "replies_count": 0, "uuid": "c49979fa752e4cc1fec8657f4e5babcc47b9d0f5"}, "author": "Bicky", "url": "http://www.travelandtourworld.com/news/article/srilankan-airlines-steers-nena-pahan-youth-development-programme/", "ord_in_thread": 0, "title": "SriLankan Airlines steers “Nena Pahan” youth development programme", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  AIRLINE NEWS » SriLankan Airlines steers “Nena Pahan” youth development programme SriLankan Airlines steers “Nena Pahan” youth development programme   \nNational Carrier, SriLankan Airlines implemented the fifth edition of Nena Pahan Youth Development programme, which focuses on developing the talents of children of the Airline’s employees. Through the initiative, the Airline intends to nurture young talent and create a platform where they could grow in stature to become skilled professionals. \n\nA total of twenty five students were selected for the programme after a placement test where they were tested on their general knowledge, English language proficiency and knowledge on the airline industry. The programme which was initiated by the Human Resource Department of SriLankan Airlines was ably supported by the SriLankan Aviation College. \n\nUnder the programme, the students were given the opportunity to perfect their interpersonal skills, priority management skills and communications skills under the guidance of experienced panel of lecturers. This was aimed at maximising their potential while helping them overcome their fears to emerge as stronger individuals to take on greater challenges. \n\nSegmented into two phases, the opening phase focused on creating a total image transformation through developing soft skills of young students. The classroom environment fostered team ethics and focused on developing business communication skills, presentation skills, negotiation skills, passenger interaction skills, etc. Those who successfully completed the assessment will be eligible for the second phase where they could enroll themselves in a selected set of programmes offered by SriLankan Aviation College for an exclusive discounted rate of 25%. \n\nSriLankan has been continually implementing programmes to empower the future generations, through knowledge sharing and healthcare projects.", "external_links": [], "published": "2015-07-02T12:27:00.000+03:00", "crawled": "2015-07-02T13:04:11.000+03:00", "highlightTitle": ""}