{"organizations": [], "uuid": "b40b0eebe3b4f68599f67a5f942c38c6d3bdd0e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeurope.about.com", "main_image": "", "site_section": "http://z.about.com/6/o/m/goeurope_t2.xml", "section_title": "About.com Europe Travel: What's Hot Now", "url": "http://goeurope.about.com/od/bavaria/l/bl-bavaria-map.htm", "country": "US", "title": "Bavaria Map and Bavarian Travel Guide", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Bavaria Map and Bavarian Travel Guide", "spam_score": 0.0, "site_type": "news", "published": "2015-07-06T14:10:00.000+03:00", "replies_count": 0, "uuid": "b40b0eebe3b4f68599f67a5f942c38c6d3bdd0e9"}, "author": "", "url": "http://goeurope.about.com/od/bavaria/l/bl-bavaria-map.htm", "ord_in_thread": 0, "title": "Bavaria Map and Bavarian Travel Guide", "locations": ["Bavaria", "Germany"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Germany Map > German States Map > Map of Bavaria \nBavaria forms the largest state or region within Germany. The capital is Munich. Over 12 million people live in Bavaria. \nBavaria is a great place to explore. It's dense with things to do, from trekking to the famous castles Neuschwanstein and Hohenschwangau near Fussen , to visiting the compelling city of Munich and the somber remains of Dachau. You won't be bored spending a few weeks in Bavaria. \nThere are airports near Nuremberg and Munich. Munich airport is considered one of the best in Europe. \nYou can also get around by train pretty easily to most of the larger cities. Book a Ticket in Bavaria . \nMap of Bavaria © James Martin, licensed to About.com Cities of Bavaria - North to South \nBayreuth is the capital of Upper Franconia. A typical Bavarian market town with the town hall smack in the middle, Beyreuth is perhaps best known as the residence of Richard Wagner, who moved to the city in 1872 and stayed until his death in 1883. Margrave's Opera house is considered to be one of the finest Baroque halls of Europe. The Bayreuth Festival is a yearly celebration of Wagner's works that take place in the Bayreuth Festpielhaus . Tickets are difficult to procure. A tour may be your best way to see the festival. \nWurzburg is a vibrant university town surrounded by vineyards with many architectural splendors. \nNurnburg or Nuremberg is the second largest city in Bavaria, located 105 miles northwest of Munich. It is a very attractive medieval walled city, and has a very famous Christmas market ( Christkindlesmarkt ). It is a fine, compact city for walking. \nRothenburg ob der Tauber ( pictures ) is everyone's favorite Romantic Road destination, and Germany's best-preserved walled town, according to Rick Steves. Medieval torture aficionados will enjoy the Medieval Crime and Punishment Museum. \nDinkelsbuhl is smack in the center of the Romantic road. It's a good shopping town with lots of artist's studios, a very evocative walled city; you can patrol with the night watchman. See a Virtual Tour of Dinkelsbuhl . \nRegensburg - The medieval town of Regensburg is a UNESCO World Heritage Site. The Bavarian Jazz Festival takes place here in summer, usually in July. \nPassau is a university town in a beautiful setting at the junction of the Danube, Inn, and Ilz Rivers. In antiquity Passau was an ancient Roman colony and became the largest diocese of the Holy Roman Empire. Later it became known for its sword manufacturing. The organ in St. Stephens Cathedral has 17,774 pipes, according to Wikipedia . \nAugsburg has a rich history dating back to the Roman empire. Dubbed both \"The Renaissance City\" and \"Mozart City\", it has been an important center of trade down through the ages. During the Renaissance, Augsburg was a main cultural center which is reflected in the fine Rococo architecture in the city. \nMunich is the major city to visit in Bavaria.Plan on at least 3-4 days here. You can take a day trip to Dachau from Munich. \nAltotting is famous for the Gnadenkapelle (Chapel of the Miraculous Image), of one of the most visited shrines in Germany. The heart of King Ludwig II of Neuschwanstein fame is here in an urn. You don't want to miss that. \nOberammergau is famous for its passion play (plan for the next one in 2010), but for shoppers it's the place to buy wood carvings. Winter sports are big here, as well as at nearby spa town Garmisch-Partenkirchen \nFussen , the highest town in Bavaria, is the closest town with a railway station to tourist must-see castles of Neuschwanstein and Hohenschwangau . You can get a bus to the castles. Fussen is but three miles from the Austrian border, and an interesting place to spend a night. \nKing Ludwig II fans might also want to visit his homage to Versailles, Herrenchiemsee Palace , southeast of Munich and built on an island in the middle of Bavaria's largest lake, the Chiemsee. Where to Stay in Bavaria \nOver 600 user-rated hotels in Bavaria (book direct) are listed at Venere. Since Bavaria is a place where the rural countryside is a compelling reason to visit, you may wish to spend some time seeing it by booking a vacation rental property, from a modest cottage for two to a larger estate for the family. HomeAway lists over 2000 vacation rentals in Bavaria (book direct). Other Bavaria Maps \nBavaria is served by Munich's Franz Josef Strauss Airport (MUC). For a map of Munich and the Airport, along with other information for navigating the airport, see our Munich Airport Map . \nTo Follow the touchstones of the early years of Pope Benedict's life, see The Pope's Bavaria . Germany Maps \nFor more information on visiting other destinations in Germany see our Map of Germany and Travel Resources . Also see: Germany State Map . Rail Passes and Information \nSee our listing of German Rail Passes for more information on Getting around Germany by rail. For a map of the main rail lines in Germany, see our Germany Rail Map . Related Articles", "external_links": [], "published": "2015-07-06T14:10:00.000+03:00", "crawled": "2015-07-06T17:45:53.000+03:00", "highlightTitle": ""}