{"organizations": [], "uuid": "1a3b2d114a29898767935866654540cf1b121375", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-07/languageapp_11072015.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/travel\r", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/looking-for-other-japanese-speakers-in-paris-theres-an-app-for-that", "country": "MY", "title": "Looking for other Japanese speakers in Paris? There’s an app for that", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "Looking for other Japanese speakers in Paris? There’s an app for that", "spam_score": 0.0, "site_type": "news", "published": "2015-07-11T09:46:00.000+03:00", "replies_count": 0, "uuid": "1a3b2d114a29898767935866654540cf1b121375"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/looking-for-other-japanese-speakers-in-paris-theres-an-app-for-that", "ord_in_thread": 0, "title": "Looking for other Japanese speakers in Paris? There’s an app for that", "locations": ["Paris"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Looking for other Japanese speakers in Paris? There’s an app for that Saturday July 11, 2015 Print Article \n‘Yes I Speak Touriste !’ iPhone app. — Afp-Relaxnews pic PARIS, July 11 — Paris, the city of light, love, and tourists, has released a new mobile app called “Yes I speak touriste” to help foreigners struggling with their French find some respite. \nThe app provides users with an interactive map showing locations like restaurants and hotels where their native tongue is spoken. \nUsers select their preferred language and locations appear where they can find fellow Mandarin, Arabic and English speakers. \nSelect Mandarin, for example, and around 20 addresses pop up, including a pharmacy. \nThe French capital’s chamber of commerce released the app, which is available in nine languages, at the start of the peak summer tourism season. \nAlong with the app, there is a paper guide and a website with a list of locations compiled by the chamber of commerce and the regional tourism board. \nThe website, called “Do you speak touriste?” also offers businesses personality profiles for different nationalities. \nAccording to the profiles, Russian tourists are “traditional and passionate”, and Chinese are “serial shoppers and connected”. \nNow, the service has moved to mobile, and is available free of charge for Android and iOS phones. \nParis consistently ranks as the most visited city in the world, with 46 million visitors — 58 per cent French and 42 per cent international — each year, according to the chamber of commerce. \nThe organisation said “the perception of the destination by tourists is positive, with a satisfaction level of 94 per cent in 2014”. \nNot all tourists are satisfied, though. Japanese reported 58 per cent satisfaction, and Chinese 54 per cent — with security an issue. \n“Cultivating hospitality shows the world that each visitor is welcomed. It also encourages jobs and growth,” the statement said. — Afp-Relaxnews pic More Stories for You:", "external_links": [], "published": "2015-07-11T09:46:00.000+03:00", "crawled": "2015-07-11T13:12:18.000+03:00", "highlightTitle": ""}