{"organizations": [], "uuid": "d9ad7226a87b5068c8b07ca30e45bbd13b9bfa14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/61568/mad-about-malls-manila", "country": "US", "title": "Mad about malls in Manila", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Mad about malls in Manila", "spam_score": 0.0, "site_type": "news", "published": "2015-07-18T05:27:00.000+03:00", "replies_count": 0, "uuid": "d9ad7226a87b5068c8b07ca30e45bbd13b9bfa14"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/61568/mad-about-malls-manila", "ord_in_thread": 0, "title": "Mad about malls in Manila", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mad about malls in Manila Adv: \nBy Mike Quane | Jul 18, 2015 Photo © Mike Quane Adv: \nIn mall-crazy Manila, the bustling chief city of the Philippines, the obsession is not just about shopping. \"Malling\" is also about socializing, entertainment, dining, people watching, and being seen. \nThe shopping, to be sure, is a major part of the experience. And the Filipinos are joined by rabid shoppers from China, Taiwan, Korea and Japan, who come to the Philippines in droves, seeking bargains that can't be had at home. In fact the huge, glittering malls have eclipsed the old-fashioned neighborhood markets so common in Asian cities. \nThe most prominent of these new emporiums, the Mall of Asia, on the edge of Manila Bay, is one of the largest in the world, both in number of store outlets and total square meters. This mammoth complex was developed by retail genius Heny Sy, who built a fortune from his ShoeMart department store empire. His SM Holdings has built many massive malls in Manila and other Philippine cities, and the local joke is that the SM now refers to \"SuperMalls,\" rather than the original ShoeMart. \nIn addition to hundreds of stores, the Mall of Asia includes the first IMAX theater in the Philippines, an Olympic-sized ice-skating rink, an indoor sports and concert arena seating 16,000 people, an outdoor concert venue, a ferris wheel, and a convention center. Its Taste Asia food court has become a prime destination in itself. \nAnother huge mall owned by SM Holdings is MegaMall, in Manila's Ortigas business district. MegaMall, at its opening in 1991, was the Philippines' largest, but it was surpassed by the Mall of Asia's opening in 2006. A 2011 expansion of MegaMall put it back ahead of the Mall of Asia, but the latter has begun its own two-level expansion to be completed in 2017, which will put the Mall of Asia back in front. No doubt this 'dueling malls\" phenomenon will continue if Henry Sy has anything to say about it. \nIn addition to sheer size, there is also a move by malls to outdo each other in elegance. The Glorietta Mall on Ayala Avenue, in Manila's financial district of Makati, makes up in luxury what it gives up in size. It was built by the Ayala family, a rival to Henry Sy's group. Also in Makati is the Greenbelt Mall, it too owned by the Ayala group. The Greenbelt boasts high-end retail stores in five sections. Greenbelt has won many design awards, and one unique facet is a Catholic chapel in a park-setting at the center of the complex. \nAnother mall of note is Robinson's, in Manila's city center. Robinson's, a seven-story edifice opened in the 1980s, was among the first American-style malls in the country. It is especially popular with visitors because it's within walking distance of the many hotels on Manila's main tourist drag, Roxas Boulevard. Another mall popular with visitors is the upscale Shangri-La Plaza Mall, adjacent to the luxurious Shangri-la Edsa Hotel. Still another huge SM mall is the SM City North EDSA, surpassed (currently) in size only by MegaMall. It is the largest solar-powered shopping mall in Southeast Asia. \nFilipino wags used to say that the reason malls became so popular in the Philippines is that the shopping centers were the only place that the masses could enjoy air-conditioning. No more. In recent years the Philippine economy has been thriving, and consumer spending has exploded. The combination of newly prosperous Filipinos and foreign visitors is what keeps the mall phenomenon booming. What's especially good for American visitors (besides the fact that the English language is practically universal in Manila) is the favorable exchange rate of the dollar. You could pay for your airfare with what you save at the cash registers. \nIn the Philippines, malls have become part of the country's social life, akin to pubs in Ireland. Besides the many entertainment venues, Philippine malls are much more of a meet-up spot for the teens and twenty-somethings than American malls ever were. A difference too is that the malls have become centers for both casual and fine dining. Many people go to the mall primarily for the restaurants, a far cry from the food courts in American malls that are mostly for convenience. In fact, casual restaurant chains, like the Hard Rock Cafe, TGI Friday's and Tony Roma's, are so popular and ubiquitous in Manila's malls that it's getting hard to find restaurants serving traditional Filipino cuisine. \nAdding it all up, malls in Manila are not only for the local shoppers. They are fun destinations in themselves and well worth seeing and experiencing by visitors from around the world.", "external_links": [], "published": "2015-07-18T05:27:00.000+03:00", "crawled": "2015-07-18T15:32:24.000+03:00", "highlightTitle": ""}