{"organizations": [], "uuid": "2d199467d857541f68f148de833f185cc1da9b65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.businesswire.com", "main_image": "", "site_section": "http://feed.businesswire.com/rss/home/?rss=G1QFDERJXkJeGVtTWQ==", "section_title": "Business Wire Travel: Lodging News", "url": "http://www.businesswire.com/news/home/20150714006732/en/Industry-Veteran-David-McCaslin-Joins-HHM-Accelerate", "country": "US", "title": "Industry Veteran David McCaslin Joins HHM to Accelerate Investment Platform", "performance_score": 0, "site": "businesswire.com", "participants_count": 0, "title_full": "Industry Veteran David McCaslin Joins HHM to Accelerate Investment Platform", "spam_score": 0.0, "site_type": "news", "published": "2015-07-15T00:30:00.000+03:00", "replies_count": 0, "uuid": "2d199467d857541f68f148de833f185cc1da9b65"}, "author": "", "url": "http://www.businesswire.com/news/home/20150714006732/en/Industry-Veteran-David-McCaslin-Joins-HHM-Accelerate", "ord_in_thread": 0, "title": "Industry Veteran David McCaslin Joins HHM to Accelerate Investment Platform", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["David McCaslin"], "text": "Industry Veteran David McCaslin Joins HHM to Accelerate Investment Platform HHM is focused on acquiring half of a billion dollars in hotel assets in the next three years July 14, 2015 05:30 PM   \nPHILADELPHIA- HHM announced today that David McCaslin has been named Executive Vice President and will lead the company’s growing private investment platform. The hospitality industry veteran of 42 years will transform the hotel management company’s investment efforts and also spearhead the launch of its asset management business. In addition to HHM’s recent acquisition of the Sheraton Miami Airport, the firm plans to acquire half of a billion dollars in hotel assets in the next three years, targeting full-service, value-add investment opportunities in the top 50 MSAs. McCaslin joins HHM’s existing investment team: Shawn Tuli, Vice President of Acquisitions & Development, and Greg Winther, Director of Acquisitions. \n“Dave McCaslin coming on board is a game changer for HHM,” said Naveen Kakarla, HHM President and CEO. “His experience, insight, and track record make him the ideal leader for this next phase of our investment efforts. With Dave’s addition to the team, we now have the right balance of experience, investment acumen, capital, and asset management capability to take our rapidly growing investment platform to the next level.” \nMcCaslin boasts an extensive background in hospitality investment. Over the past five years, he helped build and manage one of the most active platforms in the business as the President of Northwood Hospitality. McCaslin was instrumental in creating and executing upon business plans for Northwood’s highly-successful investments, including The Palace New York and the London West Hollywood, as well as three assets in the Florida Keys: Cheeca Lodge, Tranquility Bay and Parrot Key. Notably, McCaslin’s contribution to Northwood’s 2013 conversion of the Radisson Boston to The Revere Hotel led to it being named one of the Top 9 Best New Business Hotels in the World by Fortune magazine. \n“I am excited about joining a company with such a strong culture of performance and collaboration,” McCaslin said. “They understand the importance of aligning interests for capital investment and the impact of successful business plan execution on maximizing value.” \nPrior to Northwood, McCaslin was a Co-Founder of the original CapStar Hotel Company in 1987, which later became Meristar Hospitality Corporation and then Interstate Hospitality. He was a member of the company’s board of directors when it went public in 1996, and served as its COO until 2001. In 2002, McCaslin became a partner and President at HEI Hotels and Resorts, which at the time raised $274 million for a hospitality-focused private equity fund. In 2007, McCaslin became President of EAC Hospitality, a consulting and advisory firm, where he worked on individual asset value maximization, helped establish a brand startup, and evaluated two companies for investors. McCaslin has been an industry leader in both hospitality investment and operations, and through his contributions, HHM will accelerate value creation for existing and new partners. \nAbout HHM \nHHM, formerly known as Hersha Hospitality Management, operates 115 hotels across the United States. It provides turnkey hotel management, asset management and receivership for properties with brand affiliations through Marriott, Hilton, Hyatt, Starwood, and Intercontinental Hotel Group. HHM also operates 28 independent hotels ranging from The Rittenhouse Hotel, a AAA Five Diamond property in Philadelphia, to the Larkspur Landing hotels, all-suite extended stay properties in Northern California and the Pacific Northwest. Its highly experienced team is accustomed to serving as a fiduciary to publicly traded companies, joint ventures, institutional real estate owners and private investors. Additional information on HHM can be found at hhmhospitality.com . Contacts", "external_links": [], "published": "2015-07-15T00:30:00.000+03:00", "crawled": "2015-07-15T08:34:27.000+03:00", "highlightTitle": ""}