{"organizations": ["Santa Monica Pier BellaOnline", "Santa Monica Pier"], "uuid": "6d5d8d179d4d3d60cab8479391dc49426dc81de8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellaonline.com", "main_image": "http://www.bellaonline.com/images/editors/california.jpg", "site_section": "http://www.bellaonline.com/channel.rss?id=15", "section_title": "Travel and Culture @ BellaOnline", "url": "http://www.bellaonline.com/articles/art739.asp", "country": "US", "title": "Santa Monica Pier", "performance_score": 0, "site": "bellaonline.com", "participants_count": 0, "title_full": "Santa Monica Pier", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T09:00:00.000+03:00", "replies_count": 0, "uuid": "6d5d8d179d4d3d60cab8479391dc49426dc81de8"}, "author": "", "url": "http://www.bellaonline.com/articles/art739.asp", "ord_in_thread": 0, "title": "Santa Monica Pier", "locations": ["California", "Southern California", "Pacific Ocean", "Pacific Park", "Pasadena", "Los Angeles"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["E.C. Segar", "Rusty", "Olsen", "Arnold Schwarzenegger", "Monica Ballroom", "Olaf Olsen"], "text": "BellaOnline's California Editor Santa Monica Pier First built in 1909, the Santa Monica Pier has been used, extended horizontally, destroyed by the elements, rebuilt, and repurposed. It has been a housing project, a dancing destination, and a fishermans paradise. The man who provided the origin for the Popeye comics worked there. One-time bodybuilder and future governor Arnold Schwarzenegger worked out a few yards away. A visit to the pier is both an enjoyable activity and a visit to the last one hundred years of Los Angeles history. As an entertainment venue, the pier has gone through several iterations. Owned by different companies over the course of the twentieth century, it has been the home of many roller coasters and Ferris wheels; today, Pacific Park carries on both the tradition of small scale amusement park. Arcades have flourished, dwindled, and returned, many native Angelenos grew up playing Skee-Ball and other arcade games there. A dancehall by the name of La Monica Ballroom was built in 1924, was closed during the depression, and then was used as the setting for the first live variety show television broadcast in 1948. Today, various restaurants host live music and dancing in the evenings. The carousel has been a part of the pier since 1916, when the Looff Pleasure Pier was added to the side of the original concrete structure. Different companies owned the attraction until 1977, when the city bought the property. The Looff Hippodrome, which was the original housing for the carousel, is one of the few original buildings on the pier, and was designated a National Historic Landmark in 1987. Local fisherman have long gathered at the pier. During the 1920s, retired sailor Olaf Olsen was instrumental in keeping the pier out of the hands of commercial net fishing, allowing sport casting to continue on boats belonging to piers such as his and on the pier itself. The artist E.C. Segar was known to wander the pier, and today the legend has it that Olsen was the inspiration for the comic character Popeye. Today, many restaurants line the pier, and the customer can choose from chain eateries such as the Bubba Gump Shrimp Company or from small independent restaurants. Rustys Surf Ranch, which has been in business since 1994, is a classic beach town hangout, with casual seafood such as chowder, ceviche, and coconut shrimp. Soda Jerks allows the visitor to time travel back to the classic soda fountain restaurants of the 1920s and 30s; once found inland in the nearby city of Pasadena, it has since re-located to the pier. There are also hamburger stands, candy stores, and places where one can get a soda. Located a few yards to the south of the pier is an area known as Muscle Beach. In the 1930s, this was an area where gymnastics was practiced; later on, bodybuilding became popularized by denizens such as Arnold Schwarzenegger. Today, the gymnastic rings remain, but there are also padded areas where locals practice capoeira, other martial arts, and dance. Perhaps the best part of a visit to the pier is the chance to engage in people-watching, as it seems that a cross-section of the entire city of Los Angeles can be found there on a weekend afternoon. A stroll from one end to the other will bring the visitor past souvenir shops, bait-and-tackle places, historical displays, and the crashing waves of the Pacific Ocean. At the end of the pier, there is a small area with stadium-style seating where one can sit and reflect on this classic slice of Southern California beach culture, with all the beauty and verve that nature, history, and the current pier has to offer.", "external_links": [], "published": "2015-07-26T09:00:00.000+03:00", "crawled": "2015-07-26T12:42:59.581+03:00", "highlightTitle": ""}