{"organizations": [], "uuid": "f45d9724518f2bf4f6ac93e6b2435ff7f8e77340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wickedgoodtraveltips.com", "main_image": "", "site_section": "http://www.wickedgoodtraveltips.com/feed/", "section_title": "Wicked Good Travel Tips", "url": "http://www.wickedgoodtraveltips.com/2015/07/peru-for-families-an-experience-you-wont-soon-forget/", "country": "US", "title": "Peru For Families, An Experience You Won’t Soon Forget", "performance_score": 0, "site": "wickedgoodtraveltips.com", "participants_count": 1, "title_full": "Peru For Families, An Experience You Won’t Soon Forget", "spam_score": 0.0, "site_type": "news", "published": "2015-07-29T15:11:00.000+03:00", "replies_count": 0, "uuid": "f45d9724518f2bf4f6ac93e6b2435ff7f8e77340"}, "author": "Guest Author", "url": "http://www.wickedgoodtraveltips.com/2015/07/peru-for-families-an-experience-you-wont-soon-forget/", "ord_in_thread": 0, "title": "Peru For Families, An Experience You Won’t Soon Forget", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "July 29, 2015 | By Guest Author More \nUnlock The Mysteries of the Land of the Inca with Your Family – It’s a Journey You Will Always Remember. \nThe high plains of Peru and Ecuador are rich both culturally and ecologically, and travelling there with your children is probably easier than you may think. It’s important to make a solid plan for the journey, and arrange activities and transportation ahead of time, but the result will be an unforgettable adventure for your family. \nThe following destinations offer some of the best ways to marvel and learn in the land of the Inca: \n1) Step back in time in Otavalo. \n\nHigh in the mountains of Ecuador, the village of Otavalo is operating the same way it has for centuries. Populated mostly by indigenous, Quichua-speaking artisans, it is a wonderful place for kids to learn about another culture and to see the colorful local crafts at the famous market. Many travelers opt to take the trip by tour bus, and enjoy a stunning three-hour ride up the mountain. \nAt the market, children will love seeing the beaded jewelry, embroidered clothing, and unique knick-knacks colorfully displayed all around them. The people of Otavalo dress in traditional garb. There are also artisans working their crafts in public – people working at looms, grandmothers on low stools separating the wool, and even kids weaving baskets. Master weavers demonstrate how they make traditional items of clothes. You and your kids can take home a felt hat that was made right before your eyes. \n2) Make chocolate! And learn it’s incredible story. \nIt won’t be hard to convince your kids to go to a chocolate factory. The ChocoMuseo in the Peruvian village of Ollantaytambo works to keep Central America’s chocolate traditions pure. Ollantaytambo is one of the only places where visitors can still explore streets and useable buildings built by the Inca. ChocoMuseo is only steps from the ancient ruins. \nEcuador is considered by many experts to have the best chocolate in the world. Kids can watch cocoa go from bean to chocolate bar on some of Ecuador’s hands-on chocolate plantation tours. And of course they can eat plenty of the final product. \n3) See a different way of life in Ibarra. \nThe beautiful Ecuadorian town of Ibarra is known as “the white city,” some say because of its stately colonial architecture, though history suggests it’s actually because the inhabitants used white limestone paste to fight the plague in the 1700s. Today, it’s famous for its fruit ice creams, and the fact that the main mode of transportation is still a horse-and-cart buggy. Kids will feel as though they’ve stepped into a history book seeing carts loaded up with people and potatoes, clip-clopping down the narrow cobblestone streets. \nIbarra is an excellent place to stay as a base camp for a trip to Otavalo, as well as numerous Andean activities. Nearby Lago Yahuarcocha is known for its fresh water and the fish restaurants that surround it. To relax as a family, the Chachimbiro hot springs are just a 10-minute cab ride away. Local people claim that these naturally warm waters have healing properties. \n4) Meet an alpaca! \n\nCertain local farms can offer kids an opportunity to meet the alpaca, llama and vicuña indigenous to Peru. Most of the alpaca, however, are not kept on the farms but herded in a semi-wild state, roaming free on the mountainside before being rounded up and shorn. Their wool is considered the softest of the camelid fibers, and they are widely considered one of the cutest of the camelid species. \nYou will certainly see the wild alpaca while driving through the countryside, too, but to avoid a rash, do not pet these animals. Just enjoy the sight of them as they wander, anywhere from the terraced fields to ancient ruins, where they’re known to pop up. \n5) Hike a cloud forest! \n\nThe future of our planet lies in the hands of our children, so take the time to introduce them to an endangered environment that needs protecting. In Ecuador and Peru they’ll have the chance to see humid cloud forests while they’re in the Andes. Cloud forests rely on the low-hanging fog in the mountaintops. The cloud forest trees look like they are literally in the clouds, and shade exotic flora and fauna, from colorful bromeliads and orchids to tree frogs and tropical birds. \n6) And of course, Machu Picchu. \nThis incredible site wouldn’t have been discovered in 1911 without the help of a kid – the 11-year-old Quechua boy who led the American explorer Hiram Bingham there in the first place. For people of any age, the first time seeing this mysterious temple built so incredibly high on a mountain is a jaw-dropping experience. To this day, no one knows exactly why it was built in the 1400’s, or why it was abandoned a century later. \nEven the process of getting to Machu Picchu is fun – taking the scenic train ride from Cusco, kids will get to see the Andean countryside fly by, and disembark in the village of Aguas Calientes. People with older kids who are avid hikers may want to take a major family challenge and hike one of the most famous trails in the world: the 26-mile (42-km) Inca Trail. A still-challenging but perhaps more fun alternative is getting off the train 8.75 miles (14 k) before the arrival in Aguas Calientes, to hike just those last miles of the trail. \nWhile you’re travelling with your children, it’s important to take all the recommended precautions. Stay in the Andes a few days before the hike to Machu Picchu to acclimate your children and yourselves to the altitude. And as moms know, it’s essential to bring plenty of water and a few snacks. \nAbout The Author: Jena Hunt is a part-time traveler and freelance writer for Anywhere Travel . Anywhere can help you discover destinations in Costa Rica, Belize, Panama, Peru , and Guatemala, and will create your customized travel plan for free.", "external_links": [], "published": "2015-07-29T15:11:00.000+03:00", "crawled": "2015-07-29T16:57:32.044+03:00", "highlightTitle": ""}