{"organizations": ["Warwick Castle Glamp"], "uuid": "70e22a1ad571704de971e48cb4c757beaadf0760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/136/590x/Warwick-Castle-593879.jpg", "site_section": "http://express.co.uk//posts/rss/132/travel", "section_title": "Daily Express :: Travel Feed", "url": "http://www.express.co.uk/travel/shortbreaks/593879/Glamp-out-at-Warwick-Castle", "country": "IE", "title": "Glamp out at Warwick Castle", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "Glamp out at Warwick Castle", "spam_score": 0.0, "site_type": "news", "published": "2015-07-26T13:26:00.000+03:00", "replies_count": 0, "uuid": "70e22a1ad571704de971e48cb4c757beaadf0760"}, "author": "", "url": "http://www.express.co.uk/travel/shortbreaks/593879/Glamp-out-at-Warwick-Castle", "ord_in_thread": 0, "title": "Glamp out at Warwick Castle", "locations": ["Warwick Castle"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Mernie"], "text": "Glamp out at Warwick Castle Glamp out at Warwick Castle AS THE giant American bald eagle swooped down over my head I instinctively ducked. PUBLISHED: 11:26, Sun, Jul 26, 2015 | UPDATED: 11:39, Sun, Jul 26, 2015 GETTY Mernie and her boys learn about the past, tuck into a banquet and spend the night in a medieval tent \nAs it whooshed past a second time, I could feel the air move through my hair. \nI hadn’t expected to get quite so up close and personal with the enormous eagles, buzzards and condors that filled the sky. \nArchie, the eagle that had ruffled my hair, had a wingspan of 6ft, which seemed huge until we were introduced to Rosie, the Andean condor. \n“This is the world’s largest flying bird,” explained my seven-year-old son Harry as he stared at the sky. \n“I read about it in school. They are, like, 10 miles wide.” \nHarry might have overestimated slightly but when Rosie stretched out a full 10ft wingspan as she flew over our heads, it was a sight to behold. \nGetting right into the thick of things is very much the sort of experience you’ll have at Warwick Castle. \nForget looking at dusty old artefacts, instead the attractions are a mixture of interactive exhibits, hilarious live shows and exciting historical re-enactments. \nNew for 2015 is the Time Tower, which tells the castle’s bloody 1,100-year history. And all in just 20 minutes. \nOne of the rooms is filled with portraits of the people who have lived in the castle over the years. \nSuddenly they come to life to tell their own stories, from time to time leaving their picture frame to move to another when they have a disagreement. \nIt’s all a bit Harry Potter and lots of fun. NC LUXURY: Home for the night \nWhatever your age there’s plenty to do at the castle. \nWhile my youngest son James enjoyed the adventure playground and watching the majestic peacocks as they strutted around, Harry couldn’t wait to get his hands on a bow and arrow to try out archery before playing Splat The Rat in the Horrid Histories: Medieval Mayhem area. \nPerhaps the most dramatic event of the day was the launch of the trebuchet. \nThis 60ft-tall wooden siege device (the biggest in the world) is essentially a giant catapult that would have hurled rocks, fire and even disease-ridden animal carcasses at the enemy. \nAs visitors gathered the scene was set: the only way to stop the enemy at the gates was to flatten them with a massive boulder fired by the trebuchet. \nSleeping in the castle itself, my boys were thrilled at the prospect of a night in the medieval glamping field: 35 white tents decorated with medieval flags and banners, a 10-minute walk from the castle. \nIt was actually pretty luxurious, with four-poster beds, fur throws and even a chandelier. \nAfter a delicious all-you-can-eat medieval-style feast in the banqueting tent we headed down for the evening’s entertainment. \nThe children learned a magic trick at jester school, wannabe knights were taught jousting and swordplay and a falconer showed off a beautiful Harris hawk which Harry, to his delight, was allowed to hold. \nHe hasn’t stopped talking about it since. GETTING THERE \nWarwick Castle (0871 663 1676/ warwick-castle.com/glamping ) offers tents from £200 per night (sleeps four), B&B. \nPrice includes castle tickets for two days. Warwick tourism: 01926 492212/ visitwarwick.co.uk . Related articles", "external_links": [], "published": "2015-07-26T13:26:00.000+03:00", "crawled": "2015-07-26T14:00:34.683+03:00", "highlightTitle": ""}