{"organizations": [], "uuid": "911a60ed0810bbd79adcdd1908d8379b178a6ea7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/07/08/Style/Images/DTS101_David.Mia_0010.jpg", "site_section": "http://www.washingtonpost.com/lifestyle", "section_title": "Lifestyle: Food, Style, Travel, Advice, Home, Garden &amp; More - The Washington Post", "url": "http://www.washingtonpost.com/entertainment/tv/tv-listings-thursday-july-9-2015/2015/07/08/eaa2818a-257d-11e5-b77f-eb13a215f593_story.html", "country": "US", "title": "TV highlights: Online daters meet for the first time in the scripted anthology series ‘Dates’", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "TV highlights: Online daters meet for the first time in the scripted anthology series ‘Dates’ - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-07-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "911a60ed0810bbd79adcdd1908d8379b178a6ea7"}, "author": "By — Lauren McEwen", "url": "http://www.washingtonpost.com/entertainment/tv/tv-listings-thursday-july-9-2015/2015/07/08/eaa2818a-257d-11e5-b77f-eb13a215f593_story.html", "ord_in_thread": 0, "title": "TV highlights: Online daters meet for the first time in the scripted anthology series ‘Dates’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Will Mellor as David and Oona Chaplin as Mia in the new anthology series “Dates.” (Garry Maclennan) By — Lauren McEwen July 8 at 4:53 PM With the Cold War and Cuban missile crisis brewing, the Mercury 7 families of “The Astronaut Wives Club” (ABC at 8 p.m.) deal with the changing group dynamics sparked by the arrival of the Gemini Project wives.\nA California Web design manager battles a group of professional chefs on an episode of “Food Fighters” (NBC at 8), featuring celebrity chef Eric Greenspan.\nOn “Beauty and the Beast” (CW at 8), Cat gets a new partner and suspects that Bob and Carol are conspiring to keep her away from Vincent.\nContestants try to avoid being hit with wedding cake on the next “Boom” (Fox at 8).\nA troubled Hodiak tries to get help from two people from his past, and Ken Karn gets some good career news on “Aquarius” (NBC at 9).\nEthan tries to find out who is responsible for an explosion on Main Street that leaves two well-known “Wayward Pines” (Fox at 9) residents in critical condition.\nThe “Cults and Crimes” episode of “The Seventies” (CNN at 9) focuses on the surge of violent crimes committed in the United States.\nSERIES PREMIERE: “Skins” co-creator Bryan Elsley’s “Dates” (CW at 9) is a scripted, British anthology series that chronicles the first dates between people who have met online.\nOn “Hoarders: Family Secrets” (Lifetime at 9), a wife’s doll hoarding threatens her husband’s sobriety, and a group of frustrated homeowners threaten to report a house they blame for their neighborhood’s rat infestation.\nEvelyn calls in Pastor T.D. Jakes to help end a rift between her daughters on “Braxton Family Values” (WE at 9).\nRETURNING SHOW: On the sixth-season premiere of “Teen Mom 2,” (MTV at 10) Javi discovers something troubling on Kailyn’s phone, Leah and Corey go to court, and Chelsea is shocked that Adam wants shared custody of Aubree.\nBig Jim and Julia uncover evidence of a new threat in “Under the Dome” (CBS at 10).\nTo compete on “Beat Bobby Flay” (Food Network at 10), two experienced chefs must first impress Geoffrey Zakarian and Katie Lee.\nOn “Maron” (IFC at 10), Marc takes antidepressants with hallucinogenic side effects and sees a ghost.\nOn the new docuseries “One Bad Choice” (MTV at 11), a young woman’s night out ends in catastrophe.\n— Lauren McEwen", "external_links": [], "published": "2015-07-08T03:00:00.000+03:00", "crawled": "2015-07-09T00:29:23.000+03:00", "highlightTitle": ""}