{"organizations": ["Unesco"], "uuid": "ae55e5189b75226f4323a22455b3db0640d87139", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.themalaymailonline.com", "main_image": "http://www.themalaymailonline.com/uploads/articles/2015-07/20150707_UNESCO_BURGUNDY.jpg", "site_section": "http://www.themalaymailonline.com/feed/rss/travel", "section_title": "The Malay Mail Online | Travel", "url": "http://www.themalaymailonline.com/travel/article/the-climates-of-burgundys-vineyards-are-now-on-unescos-world-heritage-list", "country": "MY", "title": "The climates of Burgundy’s vineyards are now on Unesco’s World Heritage List", "performance_score": 0, "site": "themalaymailonline.com", "participants_count": 0, "title_full": "The climates of Burgundy’s vineyards are now on Unesco’s World Heritage List", "spam_score": 0.0, "site_type": "news", "published": "2015-07-07T02:51:00.000+03:00", "replies_count": 0, "uuid": "ae55e5189b75226f4323a22455b3db0640d87139"}, "author": "", "url": "http://www.themalaymailonline.com/travel/article/the-climates-of-burgundys-vineyards-are-now-on-unescos-world-heritage-list", "ord_in_thread": 0, "title": "The climates of Burgundy’s vineyards are now on Unesco’s World Heritage List", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The climates of Burgundy’s vineyards are now on Unesco’s World Heritage List Tuesday July 7, 2015 Print Article \nThe vineyards and climates of Burgundy are now on Unesco’s World Heritage List. — AFP pic BURGUNDY, July 7 — Burgundy’s vintners have been waiting for this recognition for years. Their unique terroir, referred to as “climates,” were inscribed in Unesco’s World Heritage List on July 4. Why is this newsworthy? How is the Burgundy vineyard different from any other? Let’s take a look. \nVintners, but also the mayors of Dijon and Beaune, have been working diligently since 2006 to have Unesco recognize the unique traits of their terroir, struggling through six steps of registration to finally get to this day in July when their dream became a reality. \nIt is a 60km stretch between Dijon and the outskirts of Chassagne-Montrachet, famous for its great wines, and Santenay that was recognized by Unesco. To be precise, though, it is the “climates” in this area that have been singled out for inscription on the list. \nWhat are these climates? \nRomanée-Conti, Clos de Vougeot, Chassagne-Montrachet, Musigny, Chambertin... these prestigious appellations can rather easily be identified by amateurs. However, what beginner hasn’t stared blankly when faced with a bottle of Burgundy wine on which the vintner has decided to specify the actual production location? \nIn fact, the vineyards of Burgundy count 1,247 climates that differentiate the terroir, “climate” being an officially recognized term since 1935. Over the course of 2,000 years of construction, it has acquired specific traits from each of the parcels that make it up. The dirt is different, the weather too. Altitude, landform, exposure, vegetation, what’s under the ground... an ensemble of factors that every vintner must take into account and that create a mosaic of different terroir. The uniqueness of each of these delimited parcels also helps shape the producer’s choice of viticulture, which is why one wine can present an entirely different profile from another that was produced just down the road. \nClimates are also defined by the history and heritage of each parcel. Roman churches, castles and abbeys dot the roads in Burgundy, and the famous hospices of Beaune are perfect examples of the weight of history on the different climates and why they have been finally recognized. Oenophiles that flock to the region every year are seeking out these historically relevant sites as much as they are the wines that are made in the lands all around them. \nBy adding the Burgundy climates to the World Heritage List, Unesco has decided to preserve a model of terroir. This recognition “guarantees the conservation and transmission of the site for future generations,” says the Association des Climats de Bourgogne (Burgundy Climate Association). \nThe construction of the Cité des Vins de Bourgogne (City of Burgundy Wines) in Beaune, which should be completed in 2018, is another step that will allow the public to better understand the specificities of the wines from the region. — APF-Relaxnews More Stories for You:", "external_links": [], "published": "2015-07-07T02:51:00.000+03:00", "crawled": "2015-07-07T10:23:24.000+03:00", "highlightTitle": ""}