{"organizations": [], "uuid": "1760066eb3444e43260b7508e8cfcb4ad715c624", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tripideas/15-ancient-cities-you-can-visit/ar-AAd5gnI", "country": "US", "title": "15 Ancient Cities You Can Visit", "performance_score": 0, "site": "msn.com", "participants_count": 9, "title_full": "15 Ancient Cities You Can Visit", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 9, "uuid": "2a7884ec7212f02cfa9dabe6f14e6aab085cbd5f"}, "author": "Jen Pinkowski", "url": "http://www.msn.com/en-us/travel/tripideas/15-ancient-cities-you-can-visit/ar-AAd5gnI#post-0", "ord_in_thread": 0, "title": "15 Ancient Cities You Can Visit", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "15 Ancient Cities You Can Visit Mental Floss 19 hrs ago Jen Pinkowski\n© AP Photo/Fernando Vergara An aerial view of the archaeological ruins of Ciudad Perdida, or the Lost City, in the Sierra Nevada de Santa Marta, in northern Colombia. Make sure your passport is current, book your flight, and let yourself imagine the lives of the people who called these ancient cities home. These aren’t the “best” cities, or the Top 15—just some mental_floss favorites, in no particular order.\n1. Ciudad Perdida // Colombia\nNot for the faint of heart, Ciudad Perdida (“Lost City”) is a strenuous, four-day hike through steamy, dense mountain jungle in northern Colombia that requires local guides. (Seriously: don’t attempt this on your own.) In the last stretch, you climb up 1200 stone steps.\nBut once you reach the top: whoa. Thought to date to the early 8th century CE but largely constructed a few centuries later, Teyuna (as the locals call it) consists of 169 terraces, tiled roads, and small circular plazas. Up to 8000 people once lived here.\n2. Hampi // India\n© Hulton Archive/Getty Images A British soldier among the ruins of the city of Hampi, India (File photo). The last capital of the Hindu kingdom of Vijayanagar, Hampi is a gorgeously preserved city built by ridiculously wealthy princes in the 14th to 16th centuries CE. Located in the southwest Indian state of Karnataka, the city was attacked by the Deccan Muslim confederacy in 1565, pillaged for the next six months, and then abandoned. Yet some 1600 structures remain, including royal complexes, temples, homes, gateways, pillared halls, and, most strikingly, stone chariots‚ which are actually shrines.\n3. Arykanda // Turkey\n© Image Credit: Jen Pinkowski Built into the mountainside near the Mediterranean coast of Turkey, Arykanda is mostly overlooked in the region because there are dozens of stunning ancient cities dotting this coast, including Perge, Side, and Xanthos. Arykanda is special because of its spectacular setting above a river valley. You can’t even see it from the ancient road. The earliest ruins date to the 5th century BCE. The city was constructed in levels into the mountain, so as you climb up, you find new ruins. In the ancient literature, Arykandans were rumored to be drunkards—and archaeologists have found thousands of wine bottles at the site.\n4. Shi Cheng // China\nIn 1959, the Chinese government flooded Shi Cheng (“Lion City”), a 600-year-old city in southeast China, when it dammed the Xin’an River for a hydroelectric power plant. Since then, the city has been deep beneath the surface of Qiandao Lake. The first scuba dives to visit what some call “The Atlantis of the East” took place in 2001. The water preserved the city quite well, and you can still see large building complexes and wide streets with hundreds of stone archways featuring lions, dragons, and phoenixes.\n5. Herculaneum // Italy\n© Fox Photos/Hulton Archive/Getty Images The ancient Roman city of Herculaneum, which was destroyed, along with Pompeii, by the eruption of Mount Vesuvius in AD 79. You know Pompeii. It’s one of the most famous archaeological sites in the world. But do you know its neighbor city Herculaneum, which was equally devastated by the eruption of Mount Vesuvius in 79 CE? Most visitors overlook the small seaside town, once a summer retreat for rich Romans. But Herculaneum has a wealth of ruins to see, including columned buildings, Roman baths, wide streets, and villas with stunning mosaics and frescos.\n6. Ollantaytambo // Peru\n© Three Lions/Getty Images The terraced Inca steps at Ollantaitambo, the Valley of the Sun, high in the Peruvian Andes, on the road to Machu Picchu. Ollanta, as it’s known, isn’t quite as famous as Machu Picchu, but it’s still a much-visited expanse of city ruins located in the Sacred Valley of the Incans in southern Peru. It was built in the 13th century by the Incan ruler Pachacuti (“he who shakes the Earth”), who constructed a royal estate, the city, military defenses, and a ceremonial center 9000 feet up in the Andes. Perhaps its most dramatic feature is its steep stone terracing. Want to hike the Incan trail? Start here.\n7. Teotihuacan // Mexico\n© Susana Gonzalez/Bloomberg The Pyramid of the Moon stands during celebrations for the Spring Equinox at the archaeological site of Teotihuacan, Mexico. Teotihuacan may be Mexico’s most famous archaeological site—and as an ancestral home to the Maya, Mexico has no shortage of ancient wonders—but you’ll still be infused with awe by the mighty pyramids here. Located about 50 kilometers northeast of Mexico City, the city dates to the 1st century BCE and continued to expand over the next six centuries as the Maya Empire grew in might and influence. At its height, the city was home to some 25,000 people. \"It was the largest city anywhere in the Western Hemisphere before the 1400s,\" archaeologist George Cowgill says. \"It had thousands of residential compounds and scores of pyramid-temples and was comparable to the largest pyramids of Egypt.\"\n8. Xi'an // China\n© CHINA DAILY/Newscom/Reuters A view of part of a collapsed wall of an ancient city in Xi'an, in northwest China's Shaanxi province. By the time Qin, the first emperor to unite China under a single ruler, died in the 3rd century BCE, Xi’an had been one of China’s most important political and cultural capitals for nearly 1000 years. Buried with Qin was an astonishing wealth of treasure (and, brutally, hundreds of living people) and the Terracotta Warrior Army, at least 7000 of which have been unearthed since 1972, all of them carrying real bronze weapons. Qin’s remains are just outside Xi’an, a bustling modern (and smoggy) city of 8 million where you can walk atop the ancient city wall, which was built just decades after Qin died. Xi’an is also the eastern end of the famed Silk Road.\n9. Tiwanaku // Bolivia\n© Lemurian Grove, Flickr // CC BY-NC2.0, Provided by Mental Floss Located near Lake Titicaca nearly 12,000 feet up in the Andes of western Bolivia, Tiwanaku was once the spiritual and political center of an empire that from the 8th to the 11th centuries CE ruled a vast region and spread its technological advances, from irrigation technology to basket design, far and wide. But its roots go back more than 4000 years. While archaeologists know residential areas were once part of Tiwanaku, it’s the ceremonial centers that are mostly above ground, including the Gateway to the Sun, the Gateway to the Moon, and the Kalasasaya temple complex.\n10. Aksum // Ethiopia\n© AP Photo/Karel Prinsloo An Ethiopian man stands in front of the main Obelisk stele in Aksum some 500 kilometers north of the Ethiopian capital Addis Ababa. Aksum was the capital city of an Ethiopian kingdom that was the most powerful state between the Eastern Roman Empire and Persia for hundreds of years. Aksum’s ruins date from the 1st to the 13th centuries CE and include giant stelae, royal tombs, villas, and, most famously, monolithic obelisks. (Mussolini stole one in 1937; Italy finally returned it, in three pieces, in 2005. It was restored and erected in 2008.) Located in northern Ethiopia near the Red Sea, the city was well positioned at the place where Africa, the Mid-East, and the Greco-Roman world met, and its kings capitalized on that well. Indiana Jones should've looked in Aksum for the Ark of the Covenant; some Christians believe it is stored in a church here.\n11. Cohokia // United States\nIt looks like a collection of grassy mounds now, but Cahokia was once the largest pre-Columbian city in North America. Located just north of St. Louis, the city was once the political, religious, and economic capital of the Mississippian culture (800 to 1350) and home to 10,000 to 20,000 people at its peak from the mid 11th to the mid 12th centuries—as large as many European cities of the time. Today you can visit 51 of its 120 mounds, which were once homes, buildings, ceremonial centers, and even an astronomical observatory. The largest is Monks Mound. With four terraces, at 90 feet tall it’s the largest prehistoric earthen structure in the New World.\n12. Thebes // Egypt\n© Picture Post/Hulton Archive/Getty Images Remains of the city of Thebes with a wall showing a colonnade. The Valley of the Kings. The Valley of the Queens. The Temple of Luxor. Karnak. These are some of the most famous archaeological sites in the world—and they’re all in what was once ancient Thebes, the capital of Egypt during the late Middle Kingdom and throughout most of the New Kingdom (1550 to 1070 BCE). These sites aren’t exactly off the beaten path, but they are undeniably powerful. The sheer scale of these ruins is overwhelming. You’ll never feel as awe-inspiringly small than you will while standing near the monumental statue of a pharaoh whose big toe is twice the size of your head.\n13. Persepolis // Iran\n© REX/WestEnd61 Reliefs of Darius Palace, Persepolis. If you’re American, you might have a tough time visiting Persepolis, but regardless of today’s political realities, this famed ancient city in southwest Iran is well worth a visit. The capital city of the Persian Empire during the Achaemenid Dynasty (550–330 BCE), Persepolis still features the 2500-year-old ruins of the royal palace, the treasury, and a military compound that miraculously survived Alexander the Great’s invasion, burning, and looting of the city in 330 BCE.\n14. Mesa Verde // United States\n© Doug Pensinger/Getty Images Mesa Verde National Park In Mesa Verde, Colorado. The cliff-dwelling Ancestral Puebloans lived in this remarkable city in what is today southwest Colorado from the 6th century to the 13th century CE. Mesa Verde (“green table” in Spanish) is just one of 5000 archaeological sites and 600 cliff dwellings dramatically built into the harsh landscape of the region. The most famous ruin is the Cliff Palace. The people who called the region home grew vegetables and hunted game here for centuries—until a drought hit in the late 13th century and the city was abandoned.\n15. Mohenjo Daro // Pakistan\nThe Indus Valley (or Harappa) civilization dates to 5000 years ago—and is one of the most mysterious in the ancient world. Located in southern Pakistan, Mohenjo Daro’s ruins include public baths, a large residential structure meant to house thousands of people, a marketplace, and many homes with inner courtyards, private baths, and drainage systems. Though the Harappan culture thrived for about 1000 years, we know little about its people or its Indus Script, which remains undeciphered to this day. We’re not even sure it’s a language. It’s one of archaeology’s greatest puzzles.\n ", "external_links": ["http://mentalfloss.com/"], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T08:01:00.829+03:00", "highlightTitle": ""}