{"organizations": [], "uuid": "d970d81aefbb55298879889981e232018cab6f2c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/2015-09-PricingHealthcare/4-new-ASCs-listed/prweb12981811.htm", "country": "US", "title": "Pricing Healthcare Publishes Price Lists for 4 New Facilities, First for Michigan and Colorado", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Pricing Healthcare Publishes Price Lists for 4 New Facilities, First for Michigan and Colorado", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "d970d81aefbb55298879889981e232018cab6f2c"}, "author": "Randy Cox", "url": "http://www.prweb.com/releases/2015-09-PricingHealthcare/4-new-ASCs-listed/prweb12981811.htm", "ord_in_thread": 0, "title": "Pricing Healthcare Publishes Price Lists for 4 New Facilities, First for Michigan and Colorado", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pricing Healthcare added 4 new surgery center price lists to its site in the last two months, boasting its first facilities in Detroit, MI, Denver, CO, and Allentown, PA. A fourth facility, an endoscopy center in Los Angeles, CA, is the other latest addition. The new facilities include the first in the states of Michigan and Colorado. 1. Lakes SurgiCare Center\n(Detroit, MI)\nLakes SurgiCare Center offers out-patient surgical services exclusively for foot & ankle surgeries. Access to the most up-to-date treatment methods, consideration of patient needs, fair and transparent pricing, and open communication between the patient, family, and facility staff are all central to their mission.\nPodiatrists on staff are board-certified and provide the highest quality surgical care available today. They are also accredited by The Joint Commission and ascribe to the highest level of safety standards set for office-based surgery.\n2. Los Angeles Endoscopy Center\n(Los Angeles, CA)\nLos Angeles Endoscopy Center is the home of affordable excellence in colonoscopies in southern California. Led by Dr. Paul M. Choi, recently voted as one of the top 10 gastroenterologists in California, the group offers convenient and reliable colonoscopy examination at a fully accredited and licensed endoscopy center. Located in the heart of Los Angeles. Dr. Choi and his team have performed nearly 35,000 colonosopies since 1996.\nDr. Choi, the current director of the center, is a board-certified gastroenterologist with over 20 years of experience. He received his undergraduate degree from M.I.T. and his medical degree from the Harvard Medical School.\n3. Surgery Center of Allentown\n(Allentown, PA)\nSurgery Center of Allentown is a freestanding multi-specialty ambulatory surgery center that provides a broad range of surgical procedures. Surgeons are board-certified, and dedicated staff give patients the personal attention they need. From the free valet service to the pleasant atmosphere of the waiting area, the center prides itself on creating a comfortable, patient-focused experience, along with exceptional care.\nSurgery Center of Allentown serves the healthcare needs of the Lehigh Valley area, and sees patients from around the United States and Canada.\n4. Hampden Surgery Center\n(Denver, CO)\nHampden Surgery Center is a multi-specialty outpatient surgical center, performing a wide range of procedures in orthopedics (including joints and sports medicine), as well as pain management. The center's well-equipped and comfortable facility has state-of-the art technology and professional and caring doctors, nurses, and staff.\nPricing Healthcare works with quality organizations of all types, including hospitals, surgery centers, and imaging centers, helping them put together and publicize affordable, direct-pay pricing for their procedures on dedicated, branded pages. Prices are typically 35% to 50% below average insured rates, and are available to employers and individuals willing to pay cash up front (\"30 days same as cash\" is available for employers and other benefit groups). Price lists are then posted at https://pricingHealthcare.com , free for employers and patients to access. There are no required enrollments and no transaction fees. Posted rates typically include the facility, physician, and anesthesiologist fees bundled into a single global price. These prices are kept up-to-date and honored by the reputable facilities listing them.\nThe company, founded in 2012, is independent and privately held, and continues expanding its list of participating facilities. Interested employers and benefit groups can help bring more facilities' prices into the open in their areas by contacting Pricing Healthcare.", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9wcmljaW5nSGVhbHRoY2FyZS5jb20vcHJpY2VzL0xha2VzU3VyZ2lDYXJl", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9wcmljaW5nSGVhbHRoY2FyZS5jb20vcHJpY2VzL0xBRW5kbw==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9wcmljaW5nSGVhbHRoY2FyZS5jb20vcHJpY2VzL0hhbXBkZW5TdXJnZXJ5Q2VudGVy", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9wcmljaW5nSGVhbHRoY2FyZS5jb20vcHJpY2VzL1NDT0FsbGVudG93bg==", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly9wcmljaW5nSGVhbHRoY2FyZS5jb20="], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T11:32:15.235+03:00", "highlightTitle": ""}