{"organizations": [], "uuid": "ffa4828c12a70c6b168ac95c95cdf0ada8e8bdda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28576-sandeep-walia-appointed-as-area-vice-president-europe-for-the-ritz-carlton-hotel-company-bvlgari-edition", "country": "US", "title": "Sandeep Walia appointed as Area Vice President, Europe for The Ritz-Carlton Hotel Company, Bvlgari & Edition", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Sandeep Walia appointed as Area Vice President, Europe for The Ritz-Carlton Hotel Company, Bvlgari & Edition", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T17:15:00.000+03:00", "replies_count": 0, "uuid": "ffa4828c12a70c6b168ac95c95cdf0ada8e8bdda"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28576-sandeep-walia-appointed-as-area-vice-president-europe-for-the-ritz-carlton-hotel-company-bvlgari-edition", "ord_in_thread": 0, "title": "Sandeep Walia appointed as Area Vice President, Europe for The Ritz-Carlton Hotel Company, Bvlgari & Edition", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sandeep Walia appointed as Area Vice President, Europe for The Ritz-Carlton Hotel Company, Bvlgari & Edition Sandeep Walia appointed as Area Vice President, Europe for The Ritz-Carlton Hotel Company, Bvlgari & Edition Details Category: Appointments  15 Marriott International, Inc. has announced Sandeep Walia as the new Area Vice President, Europe for The Ritz-Carlton Hotel Company, Bvlgari Hotels & Resorts and EDITION Hotels. Taking strategic leadership for the three brands across the continent, Walia will be responsible for managing the day-to-day business of fourteen European properties. \nThe promotion follows his success in the role of Market Vice President, The Ritz-Carlton Hotel Company, Bvlgari & EDITION, Europe, where he successfully drove operational performance as well as leading new openings and conversion projects. Sandeep’s enhanced role reflects the importance of Marriott’s luxury portfolio as a key component of Marriott’s growth in Europe and his leadership is pivotal to the continued success and expansion of these luxury brands. Sandeep began his career with The Ritz-Carlton Hotel Company in Food and Beverage in 2005, assisting in a number of high profile launches in Tokyo, Dublin and Doha. He was subsequently appointed as Hotel Manager at The Ritz-Carlton, Moscow before being promoted to General Manager of this iconic property in 2010. Under his guide, the hotel was positioned as the city’s leading property. The Ritz-Carlton Hotel Company currently operates 10 properties in Europe including Hotel Arts Barcelona and Penha Longa Resort in Portugal, with new hotels announced in Budapest and Astana. Bvlgari operates two hotels in Milan and London and EDITION operates two in Istanbul and London with Reykjavik EDITION recently announced to open in 2018. Related articles The Reverie Saigon takes centre stage in Ho Chi Minh City Hotel celebrates 1st September Grand Opening as Vietnam’s most sumptuous city debut The Reverie Saigon, a 286-room hotel with some of Ho Ch...", "external_links": [], "published": "2015-09-02T17:15:00.000+03:00", "crawled": "2015-09-02T21:28:11.243+03:00", "highlightTitle": ""}