{"organizations": ["Hindustan Times"], "uuid": "83ab1bb2fbc99d44f8f52defd48906de6ba04c30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/6/0a8f9f23-b977-4757-8d73-bdf5a9208929MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Sexandrelationships", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/sexandrelationships/love-is-like-wine-both-need-time-cyrus-broacha-s-love-tip/article1-1390287.aspx", "country": "US", "title": "Love is like wine (both need time): Cyrus Broacha's love tip", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Love is like wine (both need time): Cyrus Broacha's love tip", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T14:12:00.000+03:00", "replies_count": 0, "uuid": "83ab1bb2fbc99d44f8f52defd48906de6ba04c30"}, "author": "", "url": "http://www.hindustantimes.com/sexandrelationships/love-is-like-wine-both-need-time-cyrus-broacha-s-love-tip/article1-1390287.aspx", "ord_in_thread": 0, "title": "Love is like wine (both need time): Cyrus Broacha's love tip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cyrus Broacha"], "text": "| Updated: Sep 14, 2015 16:53 IST Cyrus Broacha is a TV anchor, theatre personality, comedian, political satirist, columnist and author. He writes a weekly column for Hindustan Times. \nA relationship is a laboratory for the soul. It tests you. Again and again. It takes a giant flashlight and forces you to look at the stuff you've hidden away. \nSo, TV anchor, theatre personality, comedian, political satirist, columnist and author, Cyrus Broacha is here to help you: From navigating relationship trouble to helping your love life go the distance, he's got all the dating advice you'll ever need from your first date to something ... \nI have been dating a guy for the last three years. But since the last year-and-a-half, I’ve developed feelings for his cousin. Recently, I stopped talking to the cousin after an argument. But my feelings for him haven’t changed. I think he feels the same for me, but doesn’t ­express. I don’t want to cheat on my boyfriend. What do I do? — PP \nAs the second meatless day in Mumbai is round the corner, I’m unable to answer your question, dear PP. Okay, I’ve had two eggs now, and can feel my strength ­returning. Slowly, I push my way off the bed and as blood flows into my left hand, I grab my pen. Sadly, I’m right-handed. But I’ll still try to answer your question. If you find it incomplete, please dial an ambulance. PP, you seem more interested in the second boy. Middle class morality is eating you up. As it did late actor Richard Burton, who had trouble leaving his first two wives. Don’t confuse ­feeling bad for ‘love’. Don’t waste your ­boyfriend’s time. Tell him and move on. Wow, I need to rest again. \nI love a guy who comes to my church. From the way he behaves with me, I think he loves me too. Should I tell him that I love him?— AM \nAs Victor Hugo wrote in his memoirs, Mumbai to Paris, ‘Love is a lot like wine.’ Both need time, and in between, you need to crush a lot of grapes. AM, why this hurry to love? It’s like starting at the 36th chamber of Shaolin. Has Kung Fu taught you nothing? If you are getting a good vibe, start chatting, interacting and maybe even dating. Love will come if it must, in time. I mean, you haven’t even crushed a grape between you, yet. And when in church, also pay ­attention to God once in a while. Go slowly my sister, slowly. Remember the hare and the tortoise story? By the way, I’m told they married each other recently. \nI broke up with my boyfriend because of his possessive nature and misbehaviour. But he convinced me and we were back again in three months. But then, he started behaving weird and broke up for no reason. I feel he broke up with me because he wanted me to realise how it felt to be at the receiving end. We stay in the same society and I am unable to forget him. Please help. — Sharanya \nSharanya, you may not believe it, but as a kid, I had the same problem with para-typhoid. We got together, then I got rid of it. Then it came back on its own too. After listening to your problem, (I read it out aloud, you see) I feel my typhoid was a more compassionate partner. Please figure out alone if you like this guy. I mean, really like him. Possessiveness can be a great turn-off. However, this time, his ego is hurt. The score is one all. I say call off the competition and talk to him bluntly. No point playing games. And don’t worry, if it doesn’t work out, there are plenty of diseases. \nI am in love with a guy who also loves me. I don’t want to marry him. I can’t imagine marrying and spending my entire life with one person. He is completely into this marriage thing, but I don’t think I ever want to get married. At the same time, I don’t want to let him go. What should I do?—  Miss confused \nWhether you love him or not is secondary. If you don’t want to getmarried then please don’t. Metaphorically, you can buy a pink T-shirt and the guy with you may love you, yet want you to not wear the T-shirt because it makes you look more muscular than him. So, love or no love, don’t be forced into anything. As Bromkin Bakshi says, “When love forces you against your will to do something, it’s not love, it’s shove”. Tags", "external_links": [], "published": "2015-09-14T14:12:00.000+03:00", "crawled": "2015-09-14T23:11:22.789+03:00", "highlightTitle": ""}