{"organizations": [], "uuid": "9f9e024b652e93c053caca39a68e86995244f7bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30077512/nyx-gaming-groups-merlins-magic-respins-in-coral-omni-channel-launch", "country": "US", "title": "NYX Gaming Group's Merlin's Magic Respins in Coral omni-channel launch", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "NYX Gaming Group's Merlin's Magic Respins in Coral omni-channel launch - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f9e024b652e93c053caca39a68e86995244f7bd"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30077512/nyx-gaming-groups-merlins-magic-respins-in-coral-omni-channel-launch", "ord_in_thread": 0, "title": "NYX Gaming Group's Merlin's Magic Respins in Coral omni-channel launch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " NYX Gaming Group Ltd.\nSmash online slot launches online, mobile, scratch and in shops exclusively with Coral\nLAS VEGAS, NV , Sept. 21, 2015 /CNW/ - NYX Gaming Group Limited (TSX VENTURE: NYX) (\"NYX Gaming Group\"), a market leading content and technology supplier to lotteries, casinos and gaming operators across the globe, is today excited to announce the omni-channel release of Merlin's Magic Respins to Coral.\nVia NYX's wholly owned subsidiary NextGen Gaming, the group celebrate the debut on terminals across the Coral UK LBO estate; and to online, mobile and scratch on day 1. Merlin's Magic Respins is the follow-up to the sensational Merlin's Magic Millions; the release further proves the value of the extended partnership which covers the licensing of a significant number of additional NextGen Gaming and third party slots via traditional online and mobile channels delivered via NYX OGS.\n\"I am proud our partnership continues to cement its aim of true omni-channel launches across land based terminals, mobile, online and scratch on day 1. The Merlin's franchise is one of NYX's most popular; the land based version features a special modified math model for the UK slots market and I'm confident the game will replicate its online success across Coral's physical estate,\" said NYX Gaming Group Commercial Director David Johnson . \"NYX boast the widest distribution network of real money wagering slots games in the online marketplace; our continued extension into LBO is the natural progression with one of our closest partners.\"\nMark Kemp , Gaming Director at Coral said \"This latest release with NYX Gaming Group means we can support our aim of having the best online & mobile games like Merlin's Magic Respins exclusively in our shops, so our customers can play the best slots games in all of our channels. Customers will also be able to use our multi-channel wallet Connect when they play Merlin's Magic Respins in shops and any other channel. We are excited to have achieved another true omni-channel launch and look forward to more releases with NYX in the future.\"\nToday's release further justifies NYX Gaming Group's recent award of Innovation In Slot Provision at 2015's EGR B2B Awards, which recognized the group's breadth of distribution opportunities, speed of integration and premium content delivery.\nABOUT NYX GAMING GROUP\nNYX Gaming Group is headquartered in Las Vegas with development out of Stockholm and Sydney . The group provides flexible gaming solutions to some of the largest lotteries, casinos, poker rooms and I-gaming operators across the globe.\nNYX Poker Network, is a leading internet poker network deliver poker solutions for online poker operators world-wide.\nGame development arm NextGen Gaming is the industry's leading platform agnostic provider of engaging, repeat play Slots, providing entertainment for players and profits for Operators.\nThe technology division, NYX Interactive, specialize in developing gaming system solutions for World Lottery Association members, media companies and both private and publicly listed Gaming companies worldwide. Through its Open Platform System (OPS™), operators can take advantage of best of breed products and services, including their own, all managed via a single interface. Through its fully hosted Open Gaming System (OGS™), licensees can leverage the best in multi-vendor Casino content from around the world.\nThe Las Vegas office provides social Poker & Casino solutions out of the group headquarters.\nNYX Gaming Group is a proud recipient of the Special Achievement Award from EGR, which recognized the group's consistent growth and innovation in multiple e-gaming verticals.\nwww.nyxgaminggroup.com\nABOUT CORAL\nCoral is one of the world's foremost Betting and Gaming Companies offering a broad range of products across over 1800 UK Betting Shops; online, on the telephone and on mobile/tablet devices. Our goal is to give customers the best betting and gaming experience whenever, however, and wherever they decide to play.\nIn addition to operating the betting and gaming brand across multiple channels Coral also develop and build gaming products for land-based, online, mobile & social channels.\nwww.coral.co.uk\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.nyxgaminggroup.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=C6200&Transmission_Id=201509210841CANADANWWEB______C6200&DateId=20150921", "http://www.coral.co.uk/"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T19:34:18.585+03:00", "highlightTitle": ""}