{"organizations": [], "uuid": "9b087e93c83c2c15d3b68c195faad5044462ad51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03435/Trisha_Goddard__2__3435112k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-10.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/women/womens-health/11855562/Trisha-Goddard-My-darling-sister-committed-suicide.html", "country": "US", "title": "Trisha Goddard: 'My darling sister committed suicide'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Trisha Goddard: 'My darling sister committed suicide' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T20:36:00.000+03:00", "replies_count": 0, "uuid": "9b087e93c83c2c15d3b68c195faad5044462ad51"}, "author": "Trisha Goddard", "url": "http://www.telegraph.co.uk/women/womens-health/11855562/Trisha-Goddard-My-darling-sister-committed-suicide.html", "ord_in_thread": 0, "title": "Trisha Goddard: 'My darling sister committed suicide'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Today is World Suicide Prevention Day. It’s a day that holds painful memories for me: not only because I lost a sister to suicide, but because in the past, I have suffered so severely from depression that I was once held in a psychiatric ward, being checked on every 15 minutes to make sure I was still alive. Back then, people called me selfish. I was a single mother of two. How dare I even think of ending my life? Those people either didn't know or didn't care about what was happening in my personal life - an unfaithful husband, a hospital stay with a little baby fighting for her life, running a company and making daily shows while keeping that same messy and highly stressful personal life quiet. No sleep. No family support - they were on the other side of the world – and a constant struggle with mental illness against the glare of the TV cameras. If I had been thinking straight, I would have remembered the fallout that suicide can have on the family. All those feelings of guilt, anger, the pain that never goes and the constant \"what ifs?\" But I was only able to start thinking rationally again when I hit rock bottom and started to get help. It took two years of therapy and mental health support, and trust me - it's a long road back – but I made it. At the time, the only thing that convinced me that I could live with the 'pain in my brain' (for want of a better term) was sustained psychiatric and psychological help – along with a short spell on anti-depressants, lifestyle changes and finally learning my limitations. So when I was diagnosed with breast cancer in 2008, while my fantastic medical team worked on my body, my equally fantastic psychologist worked with my mind. Someone else from MIND mental health charity worked with me to manage the pain (severe infection following two operations in quick succession and very bad reactions to chemo... all while still working). That help enabled me to get to where I am now – a place where I no longer think about suicide. I dread to think what could have happened if the UK had licensed assisted suicide at the time – something that MPs are genuinely considering now and will debate tomorrow – with no mental health provision whatsoever. It’s madness. If every GP could spot someone with underlying mental health issues, suicide would be on the decline - not on the rise. In the UK, there are approximately 11.9 suicides per 100,000 population, with male suicides three times higher than those of women – usually put down to women being better at communication and asking for support. There’s clearly still a huge issue with GPs helping to prevent suicide, but the Assisted Dying Bill being discussed in the Commons tomorrow is relying on them to decide where a a patient is sound of mind. Well, let me tell you, back in 1994, my GP would definitely have said I was ‘sound of mind’. I was running a big TV production company and fronting a TV show. No 'loony' can do that, can they? To onlookers, I was the life and soul of the party – but on the inside that couldn’t have been further from the truth. The problem is we still think that those with underlying mental health issues are fine if they appear ‘normal’. Just about every damned day, you read an awful newspaper story about suicide. So often they’re punctuated with disbelieving lines like this: ‘But he was a successful businessman/she was a successful banker/ everything to live for/ just spoke to him/her recently and they were their usual selves.’ All of \"sound mind\". If there wasn't so much stigma around mental health and if mental health services were properly supported and financed (instead of relying so heavily on burdened charities like MIND) then I sincerely believe the Assisted Dying Bill would be slung out in its current form. I still remember what it was like when my darling sister Winnie was in intensive care, all those years ago. Winnie had depression and schizophrenia, and she committed suicide by setting fire to herself in a car. Like many suicide attempts she did not die straight away. She was medicated for six long weeks, surrounded by tubes, beeping machines, harassed medical staff, distraught family and endless fear. I wanted the suffering to the end for her – but that’s the problem. We need to realise that it's often we, the loved ones, who feels helpless and want it all to end. And that is yet another issue we need to be aware of when it comes to the Assisted Dying Bill. Sometimes the person who is ambiguous about their life is encouraged towards ending things because of the (usually unspoken) will of their loved ones. \"I don't want to be a burden,” they think. Remember, depression doesn't hear or see love. It doesn't lend itself to reason and it is often the master of disguises. If being able to have yourself killed is on the cards and enshrined by law without mental health and wellbeing making up the bricks and mortar (instead of the bit that's sort of tacked on at the back), the already underfunded mental health sector is going to be stretched to breaking point. Governments had better be ready to start pumping money into organisations like SOBS (Survivors of Bereavement by Suicide) big time, because if you seriously think that those left behind after a suicide aren’t affected for years, you're part of the reason they can't talk about it. If this bill goes through, it will become a world where, if you kill yourself without going through \"the proper channels\", you're selfish. But if you can get a couple of GPs with little or no mental health training willing to enter into a process that conflicts with their Hippocratic Oath, and a judge who couldn't pick you out in a line-up, then that’s absolutely fine and anyone who has a problem with it is ‘the selfish one’. Is that really the kind of world we want to live in? Trisha is patron for Home-Start Norwich, the UK’s leading family support charity @telewonderwomen", "external_links": [], "published": "2015-09-10T20:36:00.000+03:00", "crawled": "2015-09-11T02:46:46.084+03:00", "highlightTitle": ""}