{"organizations": [], "uuid": "cfbb162b4d5ebf0d4cb2c5b0ba7094eb933b9c6c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30043676/garmin-to-integrate-parkopedias-new-street-parking-service", "country": "US", "title": "Garmin to Integrate Parkopedia's New Street Parking Service", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Garmin to Integrate Parkopedia's New Street Parking Service - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "cfbb162b4d5ebf0d4cb2c5b0ba7094eb933b9c6c"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30043676/garmin-to-integrate-parkopedias-new-street-parking-service", "ord_in_thread": 0, "title": "Garmin to Integrate Parkopedia's New Street Parking Service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Parkopedia\nFRANKFURT, Germany , September 16,\nParkopedia launches world's first parking service that allows drivers to find available street parking. Garmin will be the first navigation provider to offer the service in its NAVIGON Application Garmin will launch the service in selected cities in Germany.\nParkopedia, the world's largest parking service provider, announced today the launch of a street parking service that allows drivers to find available parking at their destination. Parkopedia also announced that Garmin would be the first navigation provider to integrate this innovative service.\n(Logo: http://photos.prnewswire.com/prnh/20150915/266840LOGO )\n(Photo: http://photos.prnewswire.com/prnh/20150915/266841 )\nGarmin will launch the service in its award-winning navigation application NAVIGON in October 2015 in major cities in Germany to be followed by a roll out in selected cities worldwide.\nDrivers will be able to:\nFind street parking - including real-time space availability predictions - at their current location or final destination; Filter and compare parking options by price, distance and availability;\nCommenting on the deal, Parkopedia's CEO Eugene Tsyrklevich said \"Parkopedia has been providing a dynamic parking service to our online, mobile and automotive customers since 2007. This service allows drivers to navigate directly to an available space in a parking garage as opposed to circling the block and creating unnecessary pollution and congestion.\"\nHe added \"After three years of research and development, we are excited to add an automotive quality street parking service to our offering which includes all legal street spaces in a city, including streets which have no parking space counting infrastructure such as sensors.\"\nNotes to editors:\nParkopedia is the world's leading parking service provider used by millions of drivers and organizations such as Audi, BMW, Daimler Financial Services, Ford, Garmin, Jaguar Land Rover, Peugeot, Toyota, Volvo, VW and many others.\nParkopedia provides detailed static information on 38 million parking spaces in over 100,000 facilities across 6000 cities in 53 countries; including real-time parking space availability information in over 500 cities in 30 countries.\nThe service allows drivers to find the closest parking to their destination, tells them how much it will cost and whether the space is available. Parkopedia also allows drivers to pay for parking online, through a mobile app and in-car.\nMore Information:\nChristina Onesirosan Martinez MBA MCIM\nMarketing Director\nParkopedia\nT: +44(0)7980-058760\nE: christina@parkopedia.com\nW: http://www.parkopedia.com\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://photos.prnewswire.com/prnh/20150915/266841", "http://photos.prnewswire.com/prnh/20150915/266840LOGO", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201509159558&Transmission_Id=201509160830PR_NEWS_USPR_____enUK201509159558&DateId=20150916"], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T20:29:17.402+03:00", "highlightTitle": ""}