{"organizations": [], "uuid": "bc7f0cc83d07ed13b0dd4333ed6a6cddbe94d85c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/travel/", "section_title": "Forbes - Travel Information and Travel News - Forbes.com", "url": "http://www.forbes.com/sites/cathyhuyghe/2015/09/21/118-year-old-vines-and-the-tales-they-tell-italian-heritage-in-sonoma/", "country": "US", "title": "118 Year Old Vines And The Tales They Tell: Italian Heritage In Sonoma", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "118 Year Old Vines And The Tales They Tell: Italian Heritage In Sonoma", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T20:05:00.000+03:00", "replies_count": 0, "uuid": "bc7f0cc83d07ed13b0dd4333ed6a6cddbe94d85c"}, "author": "Cathy Huyghe", "url": "http://www.forbes.com/sites/cathyhuyghe/2015/09/21/118-year-old-vines-and-the-tales-they-tell-italian-heritage-in-sonoma/", "ord_in_thread": 0, "title": "118 Year Old Vines And The Tales They Tell: Italian Heritage In Sonoma", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Walk up Jackass Hill, the iconic Martinelli vineyard in Sonoma County, and two things happen.First, you quickly find yourself out of breath. It’s a 60-degree slope, after all.And second, you realize you’re practically walking through a sculpture garden, which is how the Zinfandel vines on that hill will strike you. The trunks are gnarled and wizened, and the texture of the bark is craggly and rough. Its color meanders through grays and browns, through pockets of shaded darkness and then ridges of light that arch toward the sun. Put your hand on the bark and you’ll likely be pricked by sharp edges that have crackled and stretched away from the trunk.That’s exactly how these vines are supposed to feel.They were planted more than 110 years ago by Giuseppe Martinelli, a young chemist-turned-farmer-turned-winemaker, after he immigrated in 1890 with his wife Louisa to Sonoma from a small town in the Piedmont region of Italy.“Each of those old vines is a different character,” Lee Martinelli said, almost reverently. Lee is Giuseppe’s grandson, and he speaks about the family's newer, 20-year old vines as if they were young whippersnappers. “On Jackass Hill the old vines have big trunks and small trunks, some have holes going through them, some are split. But they’re happy vines in a balanced situation, and they keep giving us great clusters.”The Zinfandel vines have had the time to evolve. They have earned their wrinkles, so to speak, and along the way they have also seen much of the wine history of this region.It’s a history that’s intimately connected to the flow of Italian immigrants who made their way to the agricultural abundance of California north of San Francisco. I sat down with Lee Martinelli, who has been farming in Sonoma for almost 50 years, for his thoughts and memories of the history that’s transpired around Jackass Hill’s sculptural Zinfandel vines.[caption id=\"attachment_3325\" align=\"\" width=\"1940\"] The historic Zinfandel vines on Martinelli's Jackass Hill are an anchor of Sonoma's Italian heritage. Photo Credit: Cathy Huyghe[/caption] What were the logistics of Giuseppe and Louisa making their way to Sonoma? How did it actually happen? Lee Martinelli (LM): Louisa had relatives in nearby San Rafael, back in the late 1800s. Giuseppe was a chemist who apparently had some winemaking experience, and he was hired to plant vineyards in the Occidental region, about 10 miles from where we are now. Eventually he decided to buy his own property, and he made money clearing the land of the redwood and oak trees. He hired 12 wood choppers. They built the house and the winery from the redwood, and shipped the leftover wood to San Francisco. They peeled the bark from the oaks and sent that to the tanneries in San Francisco. The made charcoal from the rest, and sent that too. That’s how he was able to get the money to buy the land for vineyards. The only vineyard you have left that Giuseppe planted was Jackass Hill, and he planted all of it to Zinfandel. Why was that unusual? LM: Most of the old Italian family vineyards had multiple clones of different grapes, like Zinfandel and Petite Syrah and other reds all mixed in that ripened at different times. Giuseppe had his own method and his own vision, to plant only Zinfandel. What lessons did Giuseppe bring from Piedmont? LM: We went back to visit the area where Giuseppe came from, and the hills there are steep. There were grapes and fruit trees and chestnuts. His philosophy was that the flat land was for the horses, hogs, and chickens. He knew that if you wanted the best grapes, they had to be planted on a steep hill, and that’s what he found here. What are the similarities between what Giuseppe started, and what you’re doing now? LM: Giuseppe and Louisa had a vision for a vineyard, a home, a winery, and a family. They did it in the late 1890s, and I did it again in the mid-1980s when we started a new winery. I have the same excitement now, and it’s made me realize why they came from Italy to California. Now, my grandparents are gone, my folks are gone, but the land is still here.Cathy Huyghe is the author of Hungry for Wine , which will be released next week. Find her online on Facebook , Twitter , and Instagram .", "external_links": ["https://www.facebook.com/huyghecathy", "https://instagram.com/cathyhuyghe/", "http://www.cathyhuyghe.com/hungry-for-wine-the-book-1/", "http://twitter.com/cathyhuyghe"], "published": "2015-09-21T20:05:00.000+03:00", "crawled": "2015-09-21T15:35:14.625+03:00", "highlightTitle": ""}