{"organizations": [], "uuid": "f20b71cfded9afba8f0863a2458548ac103ae323", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/wyndham-logo.png", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/wyndham-hotel-group-opens-first-airport-tryp-by-wyndham-hotel-in-brazil-for-international-travelers/", "country": "US", "title": "Wyndham Hotel Group Opens First Airport TRYP by Wyndham Hotel in Brazil for International TravelersTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Wyndham Hotel Group Opens First Airport TRYP by Wyndham Hotel in Brazil for International TravelersTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "f20b71cfded9afba8f0863a2458548ac103ae323"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/wyndham-hotel-group-opens-first-airport-tryp-by-wyndham-hotel-in-brazil-for-international-travelers/", "ord_in_thread": 0, "title": "Wyndham Hotel Group Opens First Airport TRYP by Wyndham Hotel in Brazil for International TravelersTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wyndham Hotel Group Opens First Airport TRYP by Wyndham Hotel in Brazil for International Travelers Published on : Saturday, September 5, 2015\nWyndham Hotel Group today announced the opening of TRYP by Wyndham São Paulo Guarulhos Airport, developed with GBX Capital and Brazilian operating partner Nobile Hoteis.\nThe opening marks the 11th TRYP by Wyndham hotel in Brazil and 21st in Latin America, where the company is focused on fulfilling the growing demand for mid-scale hotels.\nThe newly constructed, 80-room hotel has a privileged location within Terminal 3 of Guarulhos International Airport, Sao Paulo’s main international airport, considered Latin America’s busiest airport by passenger traffic and Brazil’s top airport in terms of quality of aircraft operations and quantity of cargo handled. The hotel is exclusive for guests from international flights or with international connections.\n“We are thrilled to open the newly constructed TRYP by Wyndham São Paulo Guarulhos Airport which holds a unique location and an innovative offering exclusive to travelers within Brazil’s leading international airport,” said Paulo Pena, president and managing director for Wyndham Hotel Group in Latin America and the Caribbean. “Travelers will revel in the bounty of thoughtful amenities offered by this new property that offers respite and relaxation, pre- and post-flight.”\nWith broad flexibility, guests staying at TRYP by Wyndham São Paulo Guarulhos Airport can choose to book stays at the property between 3, 6, 12 and 24 hours with rates counted per hour. Breakfast, lunch, snacks and drinks are included regardless of length of stay, Wi-Fi is free and unlimited and all rooms have cable television and air conditioning.\nEach of the new hotel’s 80 spacious guest rooms includes an ergonomic work desk and chair, digital safe and 32-inch flat screen TV and hairdryer. Family suites with bunk beds and fully accessible rooms are also available to accommodate guests en route home or traveling to São Paulo.\nThe onsite gourmet lounge offers a unique environment with food service available 24 hours per day, including a complimentary breakfast with diverse brunch options until 3:00 p.m., a light buffet from 3:00 p.m. to 7:00 p.m. with different snacks, dinner from 7:00 p.m. to midnight, and a snack buffet early morning from midnight until 5:00 a.m.\nGuests may also enjoy the hotel’s bookstore, a space designed for those who appreciate a peaceful and comfortable environment; an exclusive smoking area, the only such area available on airport grounds, designed with an external garden; and a Living Lobby Bar to relax and enjoy the most diverse labels of domestic and imported drinks.\n“We are excited to be partnering with Wyndham Hotel Group, the world’s largest hotel company, for the opening of this unique TRYP by Wyndham hotel within Terminal 3 of Sao Paulo Guarulhos International Airport,” said Roberto Bertino, president of Nobile Hoteis.\n“The differentiating amenities of our new property will resonate among those traveling internationally for leisure, work, or in connections, who are avid for comfort and convenience,” said Alberto Bove, owner and director of GBX Capital. “This is the main reason why we have invested in a modern infrastructure, with the best facilities and flexibility of hours.”\nThe globally recognized TRYP by Wyndham brand offers not only a destination but also a unique experience, with contemporary lodging options in some of the world’s most cosmopolitan cities including Barcelona, Madrid, Paris, Lisbon, Frankfurt, Berlin, Buenos Aires, Sao Paulo, and New York City, among others. With its “Own the City” service culture, the brand openly displays its passion for guests and for the cities in which TRYP by Wyndham properties are located. The TRYP by Wyndham portfolio consists of more than 120 properties around the world representing more than 17,000 rooms.\nIn Latin America and the Caribbean, Wyndham Hotel Group has a total of 146 hotels and 17,137 rooms under its TRYP by Wyndham, Wyndham Hotels and Resorts®, Ramada®, Ramada Encore®, Days Inn®, Wingate by Wyndham®, Microtel Inn & Suites by Wyndham®, Super 8® and Howard Johnson® brands.\nSource:- Wyndham", "external_links": [], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-05T15:37:28.030+03:00", "highlightTitle": ""}