{"organizations": [], "uuid": "9993c8854f3bdccc87ee1e3e97be29ddc2676e83", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/the-wonderful-world-of-londons-best-street-markets.html", "country": "US", "title": "The Wonderful World of Londons Best Street Markets", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "The Wonderful World of Londons Best Street Markets", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T10:37:00.000+03:00", "replies_count": 0, "uuid": "9993c8854f3bdccc87ee1e3e97be29ddc2676e83"}, "author": "Lisa Jeeves-2015-09-24T08:37:36-0400", "url": "http://www.articlesfactory.com/articles/travel/the-wonderful-world-of-londons-best-street-markets.html", "ord_in_thread": 0, "title": "The Wonderful World of Londons Best Street Markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | September 24, 2015 \nOnce you meet your airport transfer service’s driver, ask for recommendations for their favourite London street market. \nLondon is undoubtedly at its best when it showcases all the different people, cultures, and cuisines that intermingle within it, and one of the best ways in which this remarkable city shows off its diversity is through its numerous street markets. \nOnce you've landed in London, a convenient pre-booked airport transfer service will get you to your accommodation without hassle. The airport transfer service drivers are a wonderful source of local information, so it's worth asking them for some recommendations on their tips for the city's best markets. Here are a few to start you off. \nThe Food Market in a Charming Location \nMaltby Market is a small, bustling market full of charm. Set among the railway arches of Bermondsey, in southeast London, it boasts a unique location that is easily reachable both by Tube and bus. Maltby Market is never too crowded; you can browse and eat at your own pace, without feeling rushed by crowds. In fact, many of this market’s vendors will encourage you to stop by their stall to peruse and have a taste of whatever they have on display. \nMaltby Market offers both fresh produce - such as cakes, meats, and breads - and made-to-order food stalls. Highlights include The Cheese Truck, a stall offering delicious, gourmet grilled cheese sandwiches, and The Beefsteaks, where steak is cooked to perfection and accompanied by mouthwatering hand-cut triple-cooked chips. If you're still feeling energetic after lunch, wander back to London Bridge to admire the breathtaking view of the city at sunset. \nThe Vietnamese Food You Just Can’t Miss \nBroadway Market in Hackney is, without a doubt, the place to go if you are after lip-smackingly good Vietnamese food. After plenty of underwhelming tourist food, this market really is the best place to awaken your senses. If you get a taxi to the south end of London Fields, you will find yourself only a short walk from Banhmi11’s stall at the market, where many food-related dreams come true. For only £5, you can choose between five banh mi meats, including crackling pork belly and catfish fillet, which come with a baguette and traditional pho. For dessert, make sure to check out Violet Bakery’s delightful and original sweet offerings. \nStroll Through a Romantic Flower Market \nIf you decide to venture out to Columbia Road Flower Market, you will be faced with thousands of flowers overflowing in one single Victorian terraced street; the shout of ‘three for a fiver!’ will quickly become the morning’s soundtrack. \nBest visited early on a Sunday morning (get there around 8:00h for a peaceful wander) or towards closing time (at around 14:30h stallholders significantly reduce their prices, although stock might be limited), this market is packed full of Londoners seeking out a good deal for their gardens and mantelpieces. \nCan I Take Anything Back Home? \nMost of London’s street markets offer products that you can easily pack to take home, such as artisanal peanut butter, vacuum-packed delicious local cheeses, and unique, vintage home décor. If you're carrying medium-to-big or delicate items, you should definitely book an airport transfer service to drop you off. Airport transfer service drivers are used to handling all kinds of luggage and will transport you and your purchases safely to whichever terminal you are departing from, without fuss.   from ArticlesFactory.com ABOUT THE AUTHOR \nLukas Johannes is a driver for Shuttle Direct. If you’re looking for an airport transfer service , Shuttle Direct provide pre-booked shuttles to major destinations all over Europe. Wherever you travel, Shuttle Direct can make sure that you don’t miss your car on your holiday abroad.", "external_links": [], "published": "2015-09-24T10:37:00.000+03:00", "crawled": "2015-09-24T16:43:17.564+03:00", "highlightTitle": ""}