{"organizations": ["Marriott"], "uuid": "ae33bb0a77e9583f3e25c4ce25819d43397c73ea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.calgarysun.com", "main_image": "http://storage.calgarysun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297746322705_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.calgarysun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.calgarysun.com/2015/09/09/marriott-tests-in-room-virtual-reality-service", "country": "CA", "title": "Marriott tests in-room virtual reality service", "performance_score": 0, "site": "calgarysun.com", "participants_count": 0, "title_full": "Marriott tests in-room virtual reality service", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T21:01:00.000+03:00", "replies_count": 0, "uuid": "ae33bb0a77e9583f3e25c4ce25819d43397c73ea"}, "author": "", "url": "http://www.calgarysun.com/2015/09/09/marriott-tests-in-room-virtual-reality-service", "ord_in_thread": 0, "title": "Marriott tests in-room virtual reality service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hotels \nMarriott is giving travellers in New York and London the chance to try out bleeding-edge virtual reality tech in the privacy of their hotel rooms. \nThe global hotel chain has launched a limited test of \" VRoom Service \" in partnership with Samsung Electronics. It's currently testing the VR service, for which guests can have a Samsung Gear VR headset delivered to their room and borrow it for 24 hours, over the next two weeks at the New York Marriott Marquis in Times Square and the London Marriott Hotel Park Lane. \nHowever, the virtual-reality content Marriott's guests will be able to roam through will be limited to only three \"VR Postcards\" commissioned by the chain. Those videos, shot in 360-degree 3D, each follow real travelers on a different journeys, taking viewers to Chile's Andes mountains, an ice-cream shop in Rwanda and Beijing's bustling streets. \nWhat's the point? Marriott styles itself as leading the hospitality industry in adopting media and entertainment technologies, and its VR experiment is more about positioning the brand as a preferred destination for digital natives than anything else. Earlier this summer, the company announced a pact with Netflix to let subscribers of the video service log in to HDTVs at select hotels, and Marriott also has been developing original entertainment content for travelers. \nVRoom \"combines storytelling with technology, two things that are important to next-generation travelers,\" said Matthew Carroll, Marriott's VP of global brand management. \nIn addition to the in-room VR service, Marriott's VR Postcards will be available via the Samsung Milk VR video service, accessible via the Samsung Gear VR headset developed with Facebook's Oculus VR division. Marriott worked with Framestore's Virtual Reality Studio to develop the technologies and techniques used to create the VR Postcards. \nLast year Marriott staged a promotional event with the Marriott Teleporter, which let visitors virtually travel to London and Hawaii by stepping inside specially built kiosks. Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions . Sponsored Links", "external_links": [], "published": "2015-09-09T21:01:00.000+03:00", "crawled": "2015-09-10T00:04:48.040+03:00", "highlightTitle": ""}