{"organizations": [], "uuid": "a55021bcbc94d48d41ba3d66188c9cd2fbf67f7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03405/naomi-heaton_3405429a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/property/london-property-investments/11798086/lcp-founder-naomi-heaton.html", "country": "US", "title": "Naomi Heaton Q&A: central London property queen", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Naomi Heaton Q&A: central London property queen - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T18:39:00.000+03:00", "replies_count": 0, "uuid": "a55021bcbc94d48d41ba3d66188c9cd2fbf67f7d"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/property/london-property-investments/11798086/lcp-founder-naomi-heaton.html", "ord_in_thread": 0, "title": "Naomi Heaton Q&A: central London property queen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Naomi Heaton is the CEO and founder of London Central Portfolio (LCP), an investment company specialising in central London residential property. Heaton has forged a formidable reputation for success in the property market, from her empire based in Marylebone, a fashionable corner of central London that in recent years has become a hub of great restaurants, chic fashion outlets and cool living. Here, Ms Heaton explains how she grew her business by concentrating on one of the most resilient assets around – property in “Prime Central London”, an area LCP defines as the Royal Borough of Kensington & Chelsea and the City of Westminster – and how her innovative approach to residential investment has brought in clients from around the world. How did you come to work in the property business? I was recruited into advertising in my final year at Oxford. While I worked in advertising I built up a small property business, really as a hobby. I left advertising at a point when I felt that there were no more real challenges – I’d already been the board director of two major agencies. On the other hand, my property company had significantly expanded to become a full-time job, so it was a natural progression to use this as a springboard to set up LCP. What makes LCP different from other property companies? We are the only property company that specialises in Prime Central London property search, refurbishment, lettings, rental management and investment, all under one roof. It is totally convenient and accountable. We have two major sorts of client: the person that wishes to buy a central London home, either for themselves or as a rental investment – we call these our private clients - and the people who wish to invest through our funds. We focus on Prime Central London, as it is a unique market where there is limited stock and where prices have risen on average at an annual rate of over 10pc since the end of the Second World War. It beats the stock market hands down. What sort of private clients do you attract? We work for foreign and British clients. Typical clients are ex-pats working for a bank in Hong Kong, or Asian or Middle Eastern investors seeking to buy into the London property market. They have a budget and we seek to work for them to find, refurbish and let out the very best property that they could buy for the money that they have. We know our market incredibly well – we've been in the business for over 25 years, focusing entirely on Prime Central London, and we are a bespoke and inclusive service. We are able to advise our clients where to buy, produce a design brief that maximises space, and go on to employ the building teams, run the building project, and ultimately let and manage the investment property. Our clients are able to relax and we do the entire job for them. Who invests in your property funds? Our investment funds are the second arm of our business, and over the years we have used our specialist knowledge to build them up. We have launched the only ones specifically targeting the mainstream rental market in Prime Central London. We raise subscriptions from investors located both here in the UK and across the globe and buy a portfolio of properties, typically one or two-bedroom flats, which we’ve found to offer the best yield. We then redesign, refurbish, and rent out the flats, achieving a capital return on investment that has typically ranged from 8-15pc annually. The beauty of the funds is that you can choose how much you invest and also benefit from the buying power and professional expertise it brings, not to mention the tax advantages they offer. We are currently on to our fifth fund, London Central Apartments III (LCA III) which has just been listed and is open for subscriptions. Are you surprised by the business’s success? It's been amazing really. I had not dreamt that we would be able to make it such a success but investors have really bought into the idea of a one-stop service. Our Prime Central London funds have been a first too. LCA III is also Sharia-compliant, and that’s another first that LCP has notched up for a UK residential fund. Can you see it continuing? Prime Central London is a one-off. It’s a remarkable resource. It is a small area with limited housing stock. There is continued desire to live in these unique central London postcodes because they are safe, open and free, schooling is great, the banks are sound and politics are stable. London is a great international metropolis. The architecture is fabulous, the restaurants… well I could go on and on about the virtues of our city. That’s why there are always people who want to live, rent or buy here. For every recent crisis in foreign countries there has always been an influx of investment. We are host to the Greeks, the French, the Egyptians and many more. Everyone wants a share of London. So this all ends with more demand and prices going on going up. It’s a great investment – but I would say that. What’s next for LCP? I see LCA III closing successfully, and then on to bigger funds, specifically appealing to the institutional investor. These are exciting times. • For more information on LCP’s one-stop service or investing in their new fund, London Central Apartments III, go to londoncentralportfolio.com or follow them on Twitter @LCP_Ltd", "external_links": [], "published": "2015-09-09T18:39:00.000+03:00", "crawled": "2015-09-09T14:28:55.299+03:00", "highlightTitle": ""}