{"organizations": [], "uuid": "56c4f1ac53f60b092ff5a6ddad86f783faaf1a57", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64259/tourist-arrivals-hawaii-reach-new-record", "country": "US", "title": "Tourist arrivals in Hawaii reach new record", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Tourist arrivals in Hawaii reach new record", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T23:54:00.000+03:00", "replies_count": 0, "uuid": "56c4f1ac53f60b092ff5a6ddad86f783faaf1a57"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64259/tourist-arrivals-hawaii-reach-new-record", "ord_in_thread": 0, "title": "Tourist arrivals in Hawaii reach new record", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tourist arrivals in Hawaii reach new record   \nSep 28, 2015 eTN   \nHONOLULU, Hawaii - The Hawaii Tourism Authority President and CEO, George D. Szigeti, released information about the Aloha State’s tourism numbers for August of this year. He said that while the growth in August was not as strong as in previous months, Hawaii's visitor industry continues to exceed 2014 records in spending and arrivals. Spending reached $10.3 billion for the first eight months of 2015 and contributed $1.1 billion in state tax revenue. \nIn addition to pacing at record-breaking levels, air seats to the Hawaiian Islands are at an all-time high, boosting arrivals from most of our markets. And while we are pleased with this continued growth for the lead economic driver for the state, we are monitoring various conditions that could impact our industry. Fuel prices have been dropping, the international stock market continues to be in-flux, and economic conditions in both Europe and Asia have been unstable. All of these factors could have a potential impact on spending and arrivals to the state. \nMaintaining the level of growth we have been experiencing over the last few years will be a challenge. However, we will continue to work with our global partners to ensure Hawaii remains top-of-mind as both a leisure and business destination through creative and innovative strategies. \nArrivals by air to the Hawaiian Islands set a new record for the month of August, with an increase of 2.9 percent to 755,863 visitors, according to preliminary statistics released today by the Hawaii Tourism Authority (HTA). Most major market areas saw growth in arrivals, led by U.S. West (+2.8% to 313,181) and U.S. East (+2.4% to 146,052 visitors). Arrivals from Canada rose 8.8 percent to 28,214 visitors while Japanese arrivals of 157,543 visitors (+0.5%) was comparable to August 2014. Arrivals from all other markets increased 5.8 percent to 110,871 visitors. \nDespite gains in visitor volumes, lower daily spending across many visitor markets resulted in flat growth in total visitor expenditures for August 2015 (-0.5% to $1.3 billion). Decreased daily spending contributed to losses in Japanese (-8.2% to $226 million) and U.S. East (-2.5% to $287.4 million) visitor expenditures. For the U.S. West and Canadian markets, growth in arrivals offset a slight drop in daily spending. U.S. West expenditures rose slightly (+0.8%) to $449.8 million in August 2015 while Canadian visitor expenditures (+6.9% to $49.3 million) also increased. \nAll four larger Hawaiian Islands saw growth in arrivals: Maui (+5.3%), Kauai (+2.3%), Hawaii Island (+2.2%) and Oahu (+1.6%), which contributed to growth in visitor days on all four islands. Expenditures increased for Maui (+1% to $333.6 million), Hawaii Island (+3.1% to $161.9 million) and Kauai (+10.2% to $130.4 million) but declined for Oahu (-3.2% to $637.7 million). On Lanai, with most of the hotel rooms on the island closed for renovation, arrivals declined 20.3 percent while visitor expenditures were reduced by two-thirds (-67.2% to $2 million) compared to August 2014. \nThere were 1,074,914 total air seats to Hawaii in August 2015, up 5.4 percent from the same month last year. Growth in scheduled seats from Canada (+30%), Oceania (+13.4%), U.S. East (+8%), Japan (+6.6%) and U.S. West (+4.7%) offset a 1.8 percent decline in available capacity from Other Asia. No out-of-state cruise ships came to the islands in August 2015 or August 2014. \nYear-to-date 2015 \nThrough the first eight months of 2015, arrivals rose 4.1 percent and visitor spending increased to $10.3 billion (+3.1%). Growth in arrivals from U.S. West (+7.7%) and U.S. East (+2.3%) balanced fewer visitors from Japan (-1.1%). Expenditures by U.S. West (+6.9% to $3.6 billion) and Canadian (+3.8% to $766.5 million) visitors increased, but U.S. East (-1.4% to $2.6 billion) and Japanese (-9.8% to $1.4 billion) visitor expenditures declined compared to the first eight months of 2014. \nMaui (+5.9%), Hawaii Island (+4.9%), Kauai (+4.5%) and Oahu (+2.5%) saw growth in arrivals compared to year-to-date 2014. Higher daily spending contributed to increased visitor expenditures on Maui (+6.4% to $2.9 billion) and Kauai (+15.5% to $1.1 billion). Visitor expenditures for Hawaii Island rose slightly (+0.8%) to $1.3 billion, while Oahu's visitor expenditures of $4.9 billion (-0.3%) was similar to a year ago.", "external_links": [], "published": "2015-09-28T23:54:00.000+03:00", "crawled": "2015-09-29T00:34:45.768+03:00", "highlightTitle": ""}