{"organizations": [], "uuid": "d352c66cb1238bcac0118b24737fb3a2b3c3e101", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03453/Navinder_Singh_Sar_3453271k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-25.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/finance/financial-crime/11891636/Flash-Crash-trader-Navinder-Sarao-facing-new-allegations.html", "country": "US", "title": "'Flash Crash' trader Navinder Sarao facing new allegations", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "'Flash Crash' trader Navinder Sarao facing new allegations - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T00:13:00.000+03:00", "replies_count": 0, "uuid": "d352c66cb1238bcac0118b24737fb3a2b3c3e101"}, "author": "Marion Dakers , and agencies", "url": "http://www.telegraph.co.uk/finance/financial-crime/11891636/Flash-Crash-trader-Navinder-Sarao-facing-new-allegations.html", "ord_in_thread": 0, "title": "'Flash Crash' trader Navinder Sarao facing new allegations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Navinder Sarao, the trader accused of manipulating the markets ahead of the “flash crash” in 2010, may not face an extradition hearing until February after new allegations by the US emerged. Mr Sarao, 36, appeared at London’s Westminster magistrates’ court on Friday, where he refused consent to be extradited to the US. Mark Summers, representing the US government, has filed a fresh extradition request in order to reflect the facts presented at a grand jury indictment in the States earlier this month. Mr Summers told the court that the new documents \"bring back the start date of the allegation of the criminal activity by six months. They include new factual allegations.\" Mr Sarao was arrested in April and faces 22 charges, including wire fraud, commodities fraud and market manipulation between 2009 and last year. The US authorities want to extradite him for trial in Chicago, the home of the CME market, where Mr Sarao placed his trades. The authorities have accused him of helping to cause a flash crash in May 2010 , when a panic in the S&P derivatives market spilled over into global stock markets. Navinder Sarao His extradition hearing, due to take place on Friday, had to be adjourned after Mr Sarao’s barrister, James Lewis QC, injured his ankle on the way to court - the first time in his career that he had missed a court date. This, along with the new claim from the US, meant the defence was not in a position to go ahead. Joel Smith, representing Mr Sarao, described his client’s mental health as “fragile” and said he was “distressed” by the proceedings. He noted that his client has Asperger’s syndrome, so all this “adds to the stress and strain that has been put on him”. Mr Smith said that Mr Sarao's case would be \"irrevocably hamstrung\" without Mr Lewis there to make the arguments against the extradition. Mr Sarao was released on conditional bail ahead of a preliminary hearing on October 22. A new extradition hearing date was set for February 4 next year. The trader from Hounslow spent nearly four months in Wandsworth prison for failing to pay a £5m bail security, until the court agreed to change the terms in August . His assets are subject to an FBI freezing order. • What do we know about Flash Crash trader Navinder Singh Sarao? • Flash crash trader Navinder Singh Sarao 'sat on £27m fortune while his mother worked two jobs' telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-09-26T00:13:00.000+03:00", "crawled": "2015-09-25T18:38:05.097+03:00", "highlightTitle": ""}