{"organizations": [], "uuid": "17d47eae8b577c4dcf45087bb1e560d1cd02855c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/iata-logo.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/iata-senior-management-appointments/", "country": "US", "title": "IATA Senior Management AppointmentsTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "IATA Senior Management AppointmentsTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "17d47eae8b577c4dcf45087bb1e560d1cd02855c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/iata-senior-management-appointments/", "ord_in_thread": 0, "title": "IATA Senior Management AppointmentsTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IATA Senior Management Appointments Published\nThe International Air Transport Association (IATA) announced two senior management appointments:\nGilberto Lopez Meyer, Senior Vice President for Safety and Flight Operations Nick Careen, Senior Vice President for Airport, Passenger, Cargo and Security Safety and Flight Operations (SFO) Gilberto Lopez Meyer will take up his role as Senior Vice President for SFO on 19 October 2015. Lopez Meyer will be based in Montreal and he succeeds Kevin Hiatt who left IATA in July. He joins IATA from the Mexican Civil Aviation Authority which he has twice led as its Director General (2003-2008 and from 2014 to the present). Lopez Meyer started his aviation career as a pilot with Mexicana Airlines (1986-2003) and also has strong experience in airports having twice served as the Director General of Aeropuertos y Servicios Auxiliares (2008-2012 and 2013-2014) as well as the Director General of Mexico City International Airport (2012-2013.\n“I am confident that Gilberto brings comprehensive knowledge, skills and experience to IATA’s top job for safety and flight operations. His unique perspective from holding senior jobs in flight operations, as a regulator and as airport operator will add tremendous value to IATA’s management team,” said Tony Tyler, IATA’s Director General and CEO.\nI am excited to be joining the IATA team which is playing a leading role in enhancing safety and driving efficiency in flight operations. My immediate priorities are to continue the push towards predictive safety analysis with the Global Aviation Data Management initiative, the continuous enhancement of IATA’s auditing programs and support for the International Civil Aviation Organization (ICAO)’s efforts on enhancing global aircraft tracking capabilities,” said Lopez Meyer.\nAirport, Passenger, Cargo and Security (APCS) Nick Careen will take up his role as Senior Vice President for APCS on 1 October 2015. He succeeds Tom Windmuller who retired from IATA in August after nearly a quarter century of serving the industry. The APCS role, which was created in a 2013 reorganization, is being shifted from the Executive office in Geneva to IATA’s Montreal headquarters. Careen will oversee a team with a significant presence in both Montreal and Geneva.\nPrior to IATA, Careen built his career in Air Canada and its subsidiary Jazz where his last role was as Air Canada Vice President for Airport, Call Centers and Customer Relations, a position he held from 2013 to 2014. Careen brings comprehensive experience in flight and airport operations, human resource management and government relations.\n“Nick has the right mix of experience to help our members address the operational challenges that they face in the areas of airports, passenger facilitation, cargo and security by leading the development and implementation of IATA’s global standards and industry programs. With nearly 25 years in the industry covering a large network carrier and a regional operator Nick is well-placed to drive programs such as Fast Travel, e-Air Waybill and Smart Security. And we are counting on him to find even more ways to create and deliver value by linking operational activities,” said Tyler.\n“In my work at Air Canada and Jazz I have experienced the value of IATA’s leadership in developing global standards that drive efficiency and raise the bar on safety. My first aim will be to deliver on IATA’s current initiatives. There is also great potential to develop further IATA’s well-respected tradition of driving change by combining expertise, a unique global perspective and solid industry partnerships. Aviation is a fast-changing industry driven by evolution in customer demands, technology and the regulatory environment. Many of the challenges that this creates are in operational areas and can best be met with industry-wide efforts. That’s the remit of IATA. Working with our members and partners I look forward to taking IATA’s APCS activities several steps further in creating value and driving innovation,” said Careen.\nStrengthened Team\n“These appointments add new strength to IATA’s management team as we pursue our mission to represent, lead and serve the airline industry. Aviation is a team effort. Nick and Gilberto’s broad experience covers many of our key partners: airports, service providers, regulators and of course airlines. I welcome them to the IATA team and look forward to the significant contributions they with their teams of industry experts will make towards an ever safer, more efficient, sustainable and profitable global aviation industry,” said Tyler.\n“I thank Tom Windmuller and Kevin Hiatt for their service to the industry. They have set the bar high for their successors. I wish Tom well in his retirement and Kevin all the best in his future ventures,” said Tyler.", "external_links": [], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-25T02:28:49.341+03:00", "highlightTitle": ""}