{"organizations": [], "uuid": "ee085deadc14ae70ed9ae19f3f46d44cc8e07ba6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63627/popular-brazil-tv-star-taken-beauty-seychelles", "country": "US", "title": "Popular Brazil TV star taken by beauty of Seychelles", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Popular Brazil TV star taken by beauty of Seychelles", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T02:24:00.000+03:00", "replies_count": 0, "uuid": "ee085deadc14ae70ed9ae19f3f46d44cc8e07ba6"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63627/popular-brazil-tv-star-taken-beauty-seychelles", "ord_in_thread": 0, "title": "Popular Brazil TV star taken by beauty of Seychelles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tourism Minister pleased with report Popular Brazil TV star taken by beauty of Seychelles Original, timely global, travel, tourism, business news and research: \nSep 10, 2015 eTN Exclusive: Unique and original, timely, global breaking news: \nKarina Oliani of Pitaya Films, the respected and hugely popular Brazil television star, met with Alain St.Ange, the Seychelles Minister responsible for Tourism and Culture, to brief the island's minister about her recent stay in the mid-ocean islands where she and long-time photographer partner, Marcelo Rabelo, stayed at Ephelia Resort on Mahe, Acajou Hotel on Praslin, Domaine de L'Orangerie at La Digue, and on North Island. \nIn a meeting at the Rennaisance Hotel in Sao Paulo, Brazil, in the presence of Stephane Perard, Emirates Area Manager for Brazil, and Gisele Abrahao of the Seychelles Tourism Board's Brazil Office, Karina Oliani recounted her week spent on the islands where she posted souvenir pictures of a holiday destination that has marked her by its beauty. \nKarina Oliani hosts her very own TV programs on Adventure Tourism and a Discovery series. On September 11, her first article on her stay in Seychelles will be published. \n\"We were in Brazil to work, in order for our islands to claim its fair share of this great potential tourist market. The visibility our islands will get through the different coverage aired by the popular Karina Oliani will help Seychelles to be more known in Brazil and in South America as a whole,\" said Minister Alain St.Ange at the meeting with the Brazilian TV star. \nThe Seychelles Minister was on a working visit in Brazil for two days before flying to Colombia for the General Assembly of the UNWTO (United Nations World Tourism Organization). Karina Oliani can be followed on karinaoliani.com.br/site , Facebook and Instagram @Karina Oliani, and Marcelo Rabelo on seumelhorclick.com.br/en , Facebook and instagram @Seumelhorclick. Source: Seychelles Ministry of Tourism and Culture", "external_links": [], "published": "2015-09-11T02:24:00.000+03:00", "crawled": "2015-09-11T02:45:14.151+03:00", "highlightTitle": ""}