{"organizations": [], "uuid": "7dbe5c7cccd73e331f6028aa2a574a2e66aefb80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03427/euro_sculpture_Get_3427633a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-07.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/finance/11841349/investing-in-european-equities.html", "country": "US", "title": "The investment potential of European equities", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "The investment potential of European equities - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T02:23:00.000+03:00", "replies_count": 0, "uuid": "7dbe5c7cccd73e331f6028aa2a574a2e66aefb80"}, "author": "Melanie Wright", "url": "http://www.telegraph.co.uk/sponsored/finance/11841349/investing-in-european-equities.html", "ord_in_thread": 0, "title": "The investment potential of European equities", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Learn more about the new pension rules Kevin Lilley, manager of the Old Mutual European Equity (ex UK) Fund, says that even though European markets have rallied, current valuation levels are based on depressed profits, creating opportunities for investors. “If you look at US profits, they are now at peak levels, but European profits are nowhere near their peak levels, and that’s where the opportunity lies,\" he says. The weakening of the euro makes European companies a lot more competitive on the global stage \"Europe is only just going into the recovery phase.” Related Articles The spectre of deflation 06 Mar 2015 If cats were investors, what sort of investors would they be? 06 Mar 2015 Emerging markets for 2015 06 Mar 2015 Investing mistakes 06 Mar 2015 Mr Lilley believes this recovery phase will be aided by measures put in place to reduce the impact of any further financial crisis. “The aim of the actions of the European Central Bank over the past few years, including quantitative easing earlier this year, is to contain any crisis that could emerge in Europe in future,” he says. Mr Lilley says “stress-tests” performed on eurozone banks, which were done uniformly across all countries last year, are particularly important. “Prior to this, tests had only been done by local regulators and so were questionable,\" he notes. “As a result of these new stress tests, the whole of the European banking system recapitalised itself, which means if we do undergo a European crisis again or a severe recessionary environment the banks should be able to withstand it.” The banks have sorted out their balance sheets, raised capital and are very economically sensitive to the eurozone The weak euro should also help the profitability of European companies. Mr Lilley says: “The euro is unlikely to weaken significantly more, but the weakening that we have already seen brings benefits to European companies in that it makes them a lot more competitive on the global stage. \"I would expect that to be supportive of the profitability of European companies for the remainder of this year.” Mr Lilley says the banking sector is most likely to perform well, because it was hardest hit during the financial crisis. “This is where all the real repairs have been going on over the past few years,” he says. “The banks have sorted out their balance sheets, they’ve raised capital and they’re also very economically sensitive to the eurozone and Europe in particular. A lot of the other companies in Europe are global companies, whereas the banks tend to be more inward-looking.” The main names Mr Lilley likes in the banking sector include Société Générale in France; Banco Popular in Spain; UBS, the big Swiss bank; and Danske Bank in Denmark. Renault is launching a new low-cost car in India at the moment, which will be good for its international profile Among the Old Mutual European Equity (ex UK) Fund ’s current best performers outside the banking sector is Pandora, the Danish jewellery retailer that makes charm bracelets. Mr Lilley says: “Pandora has been doing incredibly well and is one of our favourite stocks. It’s benefited significantly from a fall in the silver price, because that’s one of its big costs. \"That company sells a lot into the US market and the UK market, and so has benefited from the early recovery of those markets. “Another company that has done well is Renault. The European market has been the laggard in car markets because of the economic situation, but now car sales have started to pick up. “There’s still a long way to go before it reaches pre-financial crisis levels, but Renault is more geared to the economic recovery than a lot of its competitors. \"It is also launching a new low-cost car in India at the moment, which will be good for its international profile.”", "external_links": [], "published": "2015-09-08T02:23:00.000+03:00", "crawled": "2015-09-07T22:39:02.524+03:00", "highlightTitle": ""}