{"organizations": [], "uuid": "e24290240351c6e5ff20f5d9f0148e0b4d297272", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63372/seychelles-tourism-provides-more-learning-hospitality-management", "country": "US", "title": "Seychelles tourism provides more learning in hospitality management", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Seychelles tourism provides more learning in hospitality management", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T07:14:00.000+03:00", "replies_count": 0, "uuid": "e24290240351c6e5ff20f5d9f0148e0b4d297272"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63372/seychelles-tourism-provides-more-learning-hospitality-management", "ord_in_thread": 0, "title": "Seychelles tourism provides more learning in hospitality management", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seychelles tourism provides more learning in hospitality management   \nSep 04, 2015 eTN   \nA group of individuals from the tourism sector are following a short course on various aspects of hospitality management being led by the general manager of Chateau de Namur in Belgium, Cedric Vandervaeren, and lecturer at the Namur Hotel School. \nThose taking part in the training sessions are from Constance Ephelia Resort, Beachcomber Sainte Anne Resort, Kempinski Seychelles, Avani Seychelles Barbarons Resort, the Seychelles Tourism Board, the Tourism Department, and the Seychelles Tourism Academy. \nMr. Vandervaeren was invited by the Seychelles Tourism Academy to conduct these training sessions taking place at the Constance Ephelia Resort, Port Launay. \nAttending the official opening ceremony were the Minister for Tourism and Culture, Alain St.Ange; Principal Secretary for Tourism Anne Lafortune; Chairman of the Seychelles Chamber of Commerce & Industries Marco Francis; as well as the Deputy Chief Executive of the Seychelles Tourism Board; Principal of the Seychelles Tourism Academy; and other representatives of the tourism sector. \nThose following this course will learn more on food costing, budgeting, and food cost control, as well as sales and marketing, among other topics. \nTopics will include an introduction to hospitality management, discovering the annual management plan ̶ from marketing plan to cash flow, and the essential components of hotel management. \nAddressing those present, Minister St.Ange said this training session will help these individuals taking part to know more on what is being done in another hotel school. \nHe added that this will help to strengthen the cooperation between Belgium and Seychelles, adding that they have a good partnership with the Namur province. \nMinister St.Ange urged the trainees of this course to always have this willingness to keep on learning. \nMr. Vandervaeren said this course will give those taking part the chance to discover new elements and aim forward in their professional development. \nHe will also conduct sessions for the second-year students from the Advanced Diploma in Hospitality Management course at the Seychelles Tourism Academy. \nSeychelles is a founding member of the International Coalition of Tourism Partners (ICTP) . Source: Seychelles Ministry of Tourism and Culture", "external_links": [], "published": "2015-09-04T07:14:00.000+03:00", "crawled": "2015-09-04T10:45:13.656+03:00", "highlightTitle": ""}