{"organizations": [], "uuid": "83b0ffdcd5b56546e99659df3f4f8e0eee5fe531", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03448/Santeria_priestess_3448410k.jpg", "site_section": "http://www.telegraph.co.uk/travel/destinations/centralamericaandcaribbean/rss", "section_title": "Central America and Caribbean travel information, holiday ideas, advice and reviews", "url": "http://www.telegraph.co.uk/news/worldnews/centralamericaandthecaribbean/cuba/11880487/Pope-Francis-tries-to-boost-Cuban-church-in-face-of-Communism-and-Voodoo.html", "country": "EU", "title": "Pope Francis tries to boost Cuban church in face of Communism and Voodoo", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Pope Francis tries to boost Cuban church in face of Communism and Voodoo", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T23:44:00.000+03:00", "replies_count": 0, "uuid": "83b0ffdcd5b56546e99659df3f4f8e0eee5fe531"}, "author": "Nick Squires", "url": "http://www.telegraph.co.uk/news/worldnews/centralamericaandthecaribbean/cuba/11880487/Pope-Francis-tries-to-boost-Cuban-church-in-face-of-Communism-and-Voodoo.html", "ord_in_thread": 0, "title": "Pope Francis tries to boost Cuban church in face of Communism and Voodoo", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pope Francis tries to boost Cuban church in face of Communism and Voodoo Catholic Church challenged by traditional Afro-Cuban religions, Voodoo and the Pentecostal movement The chapel near the Basilica of El Cobre Photo: Alamy \nPope Francis was to pray at Cuba's most revered Catholic shrine on Monday as he sought to revive faith on the Caribbean island after decades in which the Church was driven underground by the Communist regime . \nMuch of the focus of the Pope's visit has been on his attempts to build on the diplomatic rapprochement between Havana and Washington but his four-day trip to the Caribbean island is also intended to boost dwindling congregations in Catholic churches. \nBeaded necklaces for sale, for followers of the Afro-Cuban religion santeria, hang on a wall next to a poster of Pope Francis in Havana Photo: Reuters \nCatholicism was deeply undermined after the 1959 Revolution, led by Fidel Castro, and faces competition from several other faiths, including a traditional religion with roots in Africa called Santeria, as well as Arara, a cross between Santeria and Voodoo. \nThe shrine at which the Pope was to worship on Monday is a vivid example of the strength of Santeria - it is built around a tiny statue of the Virgin Mary which is also revered as a deity by devotees of the Santeria faith. \nKnown as the Virgin of Charity of El Cobre, the 40cm-high statue is also associated with Oshun, a goddess with origins among the Yoruba people of West Africa, tens of thousands of whom were shipped to Cuba as slaves in the colonial period. \nAramis Amaro arranges figurines for sale of Saint Lazarus, who represents the deity Babalu-Aye in the Afro-Cuban religion Santeria Photo: Reuters \nThey intertwined the traditional beliefs of their ancestors with Catholic iconography, saints and doctrine, producing a hybrid faith that remains vibrant today. \nBasilica de Nuestra Senora de la Caridad del Cobre Photo: Alamy \nThe Virgin statue is kept in a small chapel near the Basilica of El Cobre, situated high on a hill about 12 miles from the eastern city of Santiago de Cuba – the last stop on the Pope’s Cuban journey. \nIn a practise known as syncretism, the figurine is simultaneously worshipped as the mother of Christ and Oshun, a Yoruba goddess of love, femininity and dancing. \nEl Cobre pilgrimage church near Santjago der Cuba Photo: Alamy \n“In Santeria, believers use Catholic devotional objects in ways that are not Catholic,” said Austen Ivereigh, a British biographer of Pope Francis and an expert on the Catholic Church in Latin America. \n“They were not allowed to practise their own religion so they transferred their beliefs onto Catholicism. The Catholic Church has been quite tolerant of this – it recognises that there’s a range of popular devotions that are all mixed up with Catholicism.” \nIt is not just traditional animist beliefs that have undermined the primacy of the Catholic Church in Cuba. \nAfter the revolution, Cuba was declared a Marxist, atheist state, priests were expelled and Catholics were barred from the Communist Party and certain professions. \nBefore the revolution, around 85 per cent of Cubans identified as Catholics but that figure is now down to around 60 per cent. \nSanteria priestess in Cuba Photo: Alamy \nOnly two to three per cent of Catholics attend Mass every week, according to official statistics. \n“It reflects four decades of persecution of the Church, up until the early 1990s,” said Mr Ivereigh. “There are less than 400 priests for a population of 11 million people.” \nThe growing popularity of the Pentecostal church and other “charismatic” movements has also drawn people away from Catholicism. \nIn Havana’s old town, a woman sitting in a tiny shop selling Che Guevara t-shirts and colourful fridge magnets, said she was a member of a Pentecostal church and had no interest in Pope Francis’ four-day trip to Cuba, which will conclude on Tuesday when he flies to the US. \n“My idol is Christ and I look to him directly. I don’t need the Pope to intercede for me,” she said. \nAndrew Chesnut, an expert on religion in Latin America at Virginia Commonwealth University in the US, said in an analysis of the Pope’s visit that Latin America has been “haemorrhaging” Catholics, mostly to Pentecostalism, since the 1970s. \nA church member raises her arms during service at the Evangelical Pentecostal Assembly of God Church in Havana Photo: Bloomberg \nCatholics no longer form a majority of the faithful in most of Central America and even in Brazil, which has the world’s largest Catholic population, only 61 per cent of people now identify as Catholic. \n“Enthusiasm for both Santeria and Pentecostalism, the leading type of Protestantism (in Cuba) and all of Latin America, is greater than for Catholicism, which historically has never been very dynamic throughout the Caribbean,” Mr Chesnut wrote. \nWhile large crowds have turned out to see the first Latin American Pope, “will the excitement of the moment translate into more parishioners in the pews?” he asked.", "external_links": [], "published": "2015-09-21T23:44:00.000+03:00", "crawled": "2015-09-22T00:03:27.577+03:00", "highlightTitle": ""}