{"organizations": [], "uuid": "0a60d8bed56f97bd9a9b688f892b9250ca8dde74", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25848", "country": "", "title": "Trump Hotel Collection plans second property in Indonesia", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "Trump Hotel Collection plans second property in Indonesia", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "0a60d8bed56f97bd9a9b688f892b9250ca8dde74"}, "author": "New York, September 14, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25848", "ord_in_thread": 0, "title": "Trump Hotel Collection plans second property in Indonesia", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Trump Hotel Collection plans second property in Indonesia New York, September 14, 2015 \nLUXURY hospitality group Trump Hotel Collection has revealed a second property to be developed in Indonesia, which will see Asia get its first Trump-branded golf course. The resort will also be the second collaboration between Trump Hotel Collection and Indonesia’s MNC Group. \n\nLocated in Lido, West Java, the property will include a six-star luxury resort, 18-hole signature Ernie Els championship golf course, a country club, spa, as well as a high-end residences with villa and condominium offerings. \n\nBapak Hary Tanoesoedibjo, group president and CEO of MNC Group, said: “MNC is repositioning and rebranding what is currently known as Lido Lakes to be the pride of Indonesia.” \n\n“The area will be a 3,000ha world-class integrated lifestyle resort destination, heralded by the completion of the Bogor-Sukabumi toll road which will enable guests an unprecedented opportunity to escape to this new destination,” he added. \n\nThe new Bogor-Sukabumi toll road, developed by MNC Group, will provide direct access to Lido Lakes, thus reducing the drive time from Jakarta to an hour. The resort is also located within an hour’s driving distance to the forests of Bodogol and Cikaweni waterfalls. \n\nThe official signing of the agreement took place on August 19, 2015. \n\nIn addition to the Trump luxury development, MNC group has also agreed to a partnership with a leading design and production firm based in Los Angeles to open Indonesia’s first world-class theme park.", "external_links": [], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T10:26:41.428+03:00", "highlightTitle": ""}