{"organizations": [], "uuid": "7f7c153a692d4c45e61223a9ae33e9d9814ae502", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/travel/regional/20150904-coverbuckhorn_saloon.ece/BINARY/original/COVERbuckhorn_saloon", "site_section": "http://www.dallasnews.com/lifestyles/travel/regional/", "section_title": "Dallas-Fort Worth Travel News and Destinations - News for Dallas, Texas ", "url": "http://www.dallasnews.com/lifestyles/travel/regional/20150904-digging-for-authenticity-in-silver-city-n.m..ece", "country": "US", "title": "Digging for authenticity in Silver City, N.M.", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Digging for authenticity in Silver City, N.M. | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T06:32:00.000+03:00", "replies_count": 0, "uuid": "7f7c153a692d4c45e61223a9ae33e9d9814ae502"}, "author": "JUDITH FEIN", "url": "http://www.dallasnews.com/lifestyles/travel/regional/20150904-digging-for-authenticity-in-silver-city-n.m..ece", "ord_in_thread": 0, "title": "Digging for authenticity in Silver City, N.M.", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "SILVER CITY, N.M. — Once home to bordellos and gunfights, hardscrabble and hopeful miners, Apache raiders, scofflaws and outlaws like Billy the Kid, the area in southwestern New Mexico around Silver City is now the perfect place to prospect for authentic travel experiences. The riches of the area include American Indian history that goes back thousands of years, evocative ruins, memorable food, fine art to folk art, star-studded skies, and colorful, quirky, friendly locals.\nOne way to immerse yourself in the area is to check out stylish Bear Mountain Lodge, on the outskirts of Silver City, and select one of the hiking trails on the property that promises “art surprises.” Be sure to walk a labyrinth; it helps to clean up cobwebs in the mind and focus you in the present.\nIt’s a natural segue to head for the newly opened Lotus Center for guided meditation with Jeff Goin, who’ll help you disengage from worry. Then swivel your hips with Juniper Bowers in a class called “Hoopla;” it’s an inventive combination of mindfulness, aerobics and chakra balancing. You can also join Glenn Henderson for Qigong to experience movements with exotic titles like “eight silken brocades,” “tree branch bows to ground” and “screw fist with fiery eyes.”\nAfter relaxation, food. It’s an easy walk to Tre Rosat Cafe for lunch (the name means three ducks in Albanian, though no one is Albanian and there aren’t any ducks). The white chicken chile, bison short ribs, pork belly tacos, cobb salad and, for rabbit lovers, blanquette de lapin are excellent choices.\nFor dinner, you will want to experience the intimate 1zero6. The decor is Mexican masks, a Buddhist shrine, Asian kites, a banana leaf tree and chef Jake Politte; his brawny arms are covered with tattoos. The menu, which changes daily, offers delights like green chile crab lasagna; a loin chop smoked, grilled and hit with tangerine sauce; and achiote chicken wrapped in banana leaf. It’s best to reserve in advance and pre-order your meal.\nAnother option is Shevek and Co. Restaurant, where the eponymous chef incorporates spices and sauces from Portugal, Lebanon and Africa, and carries the tapas concept into the stratosphere. Sample phyllo stuffed with lamb, saffron and pine nuts; duck with chorizo pilaf; stuffed portobello with cheese and pesto over spinach. The food is rich, so seven or eight shared tapas are more than enough for two hungry people.\nBefore or after dinner, you may want to drive l5 minutes to the Buckhorn Saloon and Opera House in neighboring Pinos Altos. The saloon dates to the 1860s, and the decor features murals of fleshy ladies of the night, old photos of miners and, near the restrooms, you’ll encounter a cigar-store-type native playing a slot machine. Order a drink and enjoy live music Wednesday, Friday and Saturday nights.\nPinos Altos has a colorful Wild West past associated with Cochise, the Apache War of l861 and the infamous saloon owner and judge, Roy Bean. Many of the historic buildings are clearly marked, and information abounds in a little museum run by the great-granddaughter of an early pioneer. Walk or drive to the 1898 Hearst church with its elegant gothic-style windows; the mother of newspaper magnate William Randolph Hearst contributed generously to the building with the proviso that there had to be a special reading room for miners. And visit the cemetery, which is home to a vet from the “Indian wars.”\nFor a dose of art, the WNMU Museum in Silver City is home to the world’s most comprehensive collection of artifacts from the culture called Mimbres. The classic black-on-white pots, created between A.D. 1000 and 1140, feature delightfully fanciful and stylized mythical and real animals, insects, fish and geometric designs.\nTo learn about the culture known as Mogollon, you definitely want to make the two-hour drive along sinuous, scenic roads that lead to Gila Cliff Dwellings National Monument. Because of the remote location, it is one of the least visited national parks, and the ancient habitations are among the most intriguing in the West. An informative guided tour begins at the cliff houses at 1 p.m.; allow at least 20 minutes for the half-mile uphill climb to the site.\nThe ingeniously engineered cliff dwellings include storage areas, living spaces and plazas, and it is thought that the inhabitants migrated from the Four Corners region during a 50-year drought. From the outside, the last cave looks shallow, but once you climb inside, it is startling to realize how deep and multilayered the vast cave complex is. At the bottom of the trail, be sure to visit the tiny but comprehensive nature center.\nBack in Silver City, as you wander downtown to visit art galleries, clothing emporiums and jewelry shops, stop at a surprising store called Manzanita Ridge, where they sell used furniture and dishware that comes from five-star hotels around the country. Tags identify exactly which establishment. “We enjoy meeting visitors,” said a local who was shopping there, “but we hope that not too many decide to move here. We like Silver City just the way it is.”\nJudith Fein is a freelance writer in Santa Fe, N.M.\nWhen you go Bear Mountain Lodge: bearmountainlodge.com . Doubles with breakfast: $170.\nThe Lotus Center: 211 Broadway St.; 575-388-4647.\nTre Rosat Cafe: 304 N. Bullard St.; 575-654-4919.\n1zero6: 106 N. Texas St.; 575-313-4418; open Friday, Saturday and Sunday from 5 to 8 p.m.\nShevek and Co. Restaurant: 602 N. Bullard St.; 575-534-9168.\nManzanita Ridge: 107 N. Bullard St.; 575-388-1158.", "external_links": [], "published": "2015-09-05T06:32:00.000+03:00", "crawled": "2015-09-05T19:34:21.393+03:00", "highlightTitle": ""}