{"organizations": [], "uuid": "06370d584f64a197cb6cc881b3dbd83c8f9d3a1e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/CUS_powerstation.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/counter-uav-system-from-airbus-defence-and-space-protects-large-installations-and-events-from-illicit-intrusion/", "country": "US", "title": "Counter-UAV System from Airbus Defence and Space protects large installations and events from illicit intrusionTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Counter-UAV System from Airbus Defence and Space protects large installations and events from illicit intrusionTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "06370d584f64a197cb6cc881b3dbd83c8f9d3a1e"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/counter-uav-system-from-airbus-defence-and-space-protects-large-installations-and-events-from-illicit-intrusion/", "ord_in_thread": 0, "title": "Counter-UAV System from Airbus Defence and Space protects large installations and events from illicit intrusionTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Counter-UAV System from Airbus Defence and Space protects large installations and events from illicit intrusion\nAirbus Defence and Space has developed a Counter-UAV System which detects illicit intrusions of Unmanned Aerial Vehicles (UAVs) over critical areas at long ranges and offers electronic countermeasures minimizing the risk of collateral damage .\n“All over the world, incidents with universally available small drones have revealed a security gap with regards to critical installations such as military barracks, airports or nuclear plants”, says Thomas Müller, head of the Electronics business line at Airbus Defence and Space. “As a specialist in defence electronics, we have all the technologies in our portfolio and the integration knowledge which are needed to set up a quick-response protection system with extremely low false alarm rates”.\nThe system offers very high effectiveness by combining sensor data from different sources with latest data fusion, signal analysis and jamming technologies. It uses operational radars, infrared cameras and direction finders from Airbus Defence and Space’s portfolio to identify the drone and assess its threat potential at ranges between 5 and 10 Kilometers. Based on an extensive threat library and realtime analysis of control signals a jammer then interrupts the link between drone and pilot and/or its navigation.\nFurthermore, the direction finder tracks the position of the pilot who subsequently can be arrested. Due to the Smart Responsive Jamming Technology developed by Airbus Defence and Space, the jamming signals are blocking only the relevant frequencies used to operate the drone while other frequencies in the vicinity remain operational. Since the jamming technology contains versatile receiving and transmitting capabilities, more sophisticated measures like remote control classification and GPS spoofing can be utilized as well. This allows effective and specific jamming and also a controlled takeover of the UAV.\nThe Counter-UAV System has been tested extensively at Airbus Defence and Space’s own premises and during customer presentations in Germany and France. Depending on the required configuration, an operational system would be available from mid-2016.\nSource:- Airbus", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T19:04:50.236+03:00", "highlightTitle": ""}