{"organizations": [], "uuid": "d718d213b93b8e61441c1a1e228a82ce40dde0c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://static.independent.co.uk/s3fs-public/thumbnails/image/2015/09/17/11/bvi-beach.jpg", "site_section": "http://www.independent.co.uk/travel", "section_title": "Travel | The Independent", "url": "http://www.independent.co.uk/travel/news-and-advice/why-the-british-virgin-islands-arent-just-for-billionaires-10507476.html", "country": "GB", "title": "Why the British Virgin Islands aren't just for billionaires | News & Advice", "performance_score": 0, "site": "independent.co.uk", "participants_count": 1, "title_full": "Why the British Virgin Islands aren't just for billionaires | News & Advice | Travel | The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T19:55:00.000+03:00", "replies_count": 0, "uuid": "d718d213b93b8e61441c1a1e228a82ce40dde0c6"}, "author": "Nick Boulos", "url": "http://www.independent.co.uk/travel/news-and-advice/why-the-british-virgin-islands-arent-just-for-billionaires-10507476.html", "ord_in_thread": 0, "title": "Why the British Virgin Islands aren't just for billionaires | News & Advice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For some, the thought of a Caribbean holiday is limited to a just handful of islands – St Lucia, Barbados, Antigua Jamaica, Grenada – each lovely in their own right and easily accessible from the UK with direct flights. But this is a big region, and it pays to think a little differently.\nSprinkled across the Caribbean Sea, 129 miles due east of Puerto Rico, you'll find the British Virgin Islands, an overseas territory of Her Majesty's (and her predecessors) since 1672. It may not leap out as the most obvious destination for a tropical getaway, but the BVIs tick every box that an archetypal holiday to this part of the world should include. Year-round sunshine and stop-in-your-tracks beaches? Tick. Adventure, culture and history? Tick. Rustic food, strong rum and a few surprises along the way? Tick, tick and tick.\nA result of a series of volcanic eruptions thousands of years ago, the BVIs form part of the wider Virgin Islands, split politically, and culturally, between Britain and the United States. Despite both using the US dollar as currency, the two are considerably different. Only one has a McDonald's.\nIn pictures: the British Virgin Islands 7 show all In pictures: the British Virgin Islands 1/7 British Virgin Islands A dramatic underwater spectacle is just off Salt Island. Here where a British Royal Mail ship ran aground with 125 people on board\n2/7 British Virgin Islands For five star luxury, look no further than Little Dix Bay on Virgin Gorda\n3/7 British Virgin Islands The BVIs have become the unofficial sailing capital of the Caribbean\n4/7 British Virgin Islands Guana Island, a rustic private island resort north of Tortola: Tackle the 4km Monkey Point Trail and keep watch for flamingos\n5/7 British Virgin Islands The main airport is on Beef Island, just off Tortola (Alamy)\nAlamy\n6/7 British Virgin Islands British Virgin Islands map\n7/7 bvi-beach.jpg Deadman's beach on Peter Island\nSo, how did these islands acquire their name? Most credit it to Christopher Columbus, who sailed through in 1493 and became convinced there were rather more islands than actually existed, thereby naming them after St Ursula and the 11,000 virgins. Columbus was rather late to the party, however. A tribe of Amerindians, canoeing north from Venezuela, had beaten him to it by several hundred years. They set up villages, although they left no evidence of their existence, and as news spread of this secret utopia an influx of Europeans started arriving between the 15th and 17th centuries. A tug-of-war over ownership ensued between various nations, including the French, Spanish and Dutch, until the Brits muscled in in 1672.\nOnly 15 of the 60 BVIs are inhabited. The biggest and most populous is Tortola, slightly larger than Crawley but rather more dramatic than the Sussex town, with a lush and mountainous interior and coastline dotted with quiet bays and powder-white beaches. Next largest is Virgin Gorda (Fat Virgin), home to 4,000 residents and the highest point in the chain, Gorda Peak (1,371 feet).\nThe most famous address in the BVIs is Necker Island (020 8600 0430; neckerisland.virgin.com ), the cactus-studded 74-acre private isle that Sir Richard Branson bought in the late 1970s. Having undergone a multi-million pound rebuild after a fire destroyed the Balinese-style Great House, it reopened to guests in 2013 with all-new bells and whistles worthy of a billionaire's playground: a rooftop hot tub and a zip line down to the beach. Everyone from Kate Moss to Nelson Mandela has stayed here.\nFor most of the year it must be rented in its entirety for rates starting at around £43,000 per night, split between up to 30 guests. Cheaper rates – though still not affordable for most of us – of £16,900 per couple for seven nights are available during six \"Celebration Weeks\".\nBut there is more to the BVIs than one small, incredibly expensive island. The archipelago is slowly shaking off its reputation as a playground primarily for the rich and famous; alongside private island retreats you'll find good value hotels, ancient ruins of industries long gone, eccentric individuals (say hello to Aragorn at his beachfront art studio in Trellis Bay) and some of the best outdoor pursuits in the Caribbean.\nTurquoise Holidays (01494 678400; turquoiseholidays.co.uk ) offers 10 nights, split between Little Dix Bay and Guana Island, from £2,975pp. The price includes return flights from Gatwick, inter-island connections, water taxi transfers and some meals. Other operators offering packages to the BVIs include Kuoni (0800 092 4444; kuoni.co.uk ), Abercrombie and Kent (01242 547 760; abercrombiekent.co.uk ) and Destinology (01204 821495 ; destinology.co.uk ).\nMore information can be found on the tourist board's website, bvitourism.co.uk .\nOn the water\nNo longer a haven for mutinous pirates of centuries past, the BVIs have become the unofficial sailing capital of the Caribbean, thanks to a boom which started in the Seventies when yacht clubs and marinas first sprang up.\nEach March sees the BVI Spring Regatta and Sailing Festival ( bvispringregatta.org ), but the strong trade winds, long channels and sheltered waters make for pleasant conditions year-round.\nSerious sailors and novices alike are catered for here. Salty sea dogs could try going it alone with The Moorings (020 3740 7986; moorings.co.uk ), which offers seven nights aboard an unmanned three-cabin catamaran from £2,183.\nSkippers in the making should dock at Bitter End Yacht Club on Virgin Gorda (001 284 494 2746; beyc.com ). While not the most sophisticated, this sprawling family-friendly resort offers an impressive fleet of vessels, from kayaks to motorboats, and offers introduction to sailing courses. Doubles from $750 (£500) a night. Take the helm of a hobie cat (a small motorised catamaran) and sail the short distance to the bar at Saba Rock (001 284 495 7711; sabarock.com ) for a fruit smoothie or one of its infamous \"Painkiller\" rum cocktails.\nFood and drink\nStart with brunch at Sugar Apple (001 284 545 4841), a tiny restaurant run by Cynthia George from her modest green and yellow home in the bougainvillea-clad hills of Virgin Gorda. Here you can feast on fried mahi-mahi, spicy chicken wings and doughnut-like johnnycakes for $8 (£5).\nVeggies may not enjoy the menu at Hog Heaven (001 284 547 5964), also on Virgin Gorda, but they'll still love the view. Its open-air hilltop terrace overlooks North Sound and Necker Island and, more importantly, its portions of barbequed pork with plantain ($18/£11) are big and tasty. Sir Richard Branson is a regular.\nAfter dark on Tortola, dance the night away at Bomba's Shack (001 284 495 4148), a ramshackle beach bar made of driftwood, famed for its raucous full moon parties. Be warned: the rum punch does indeed pack a punch.\nWhere to stay\nThankfully, not all accommodation in the BVIs comes with a huge price tag. For five-star luxury, look no further than Little Dix Bay (001 284 495 5555; rosewoodhotels.com ) on Virgin Gorda. The resort's 100 hexagonal-shaped rooms – with wooden beams and stone walls – are scattered between its crescent beach and tropical gardens. Don't miss a massage at the clifftop spa and a dip in the two-tier infinity pool. Doubles from $450 (£300) a night.\nAt Peter Island Resort and Spa (001 616 458 6767; peterisland.com ), the 1.6km-long Deadman's Beach – one of five on the island – rarely feels crowded, but those seeking even more seclusion can book Honeymoon Beach, reserved for just one couple at a time. Doubles from $430 (£287).\nAt the other end of the spectrum – and proving that you really can do the BVIs on a budget – is Guavaberry Spring Bay (001 284 495 5227; guavaberryspringbay.com ), a collection of modest self-catering villas from $165 (£110), a short distance from Virgin Gorda's idyllic southwestern beaches.\nNatural highs\nDesignated a national park in 1988, Prickly Pear Island is a wild and undeveloped spot overlooking North Sound that offers excellent hiking along cactus-lined trails. The salt ponds, mangroves and beaches attract migratory birds, including blue-winged teals and American coots.\nMore great hiking can be found on Guana Island (001 800 544 8262; guana.com ), a rustic private island resort north of Tortola favoured by the likes of Daniel Craig and Rachel Weisz; they always book the North Beach Villa; it's $1,650 (£1,100) a night, but you can book into a double cottage from $750 (£500) all-inclusive. Tackle the 4km Monkey Point Trail and keep watch for flamingos and scaly stout iguanas.\nFor a high of a different kind, head to \"The Baths\", along the northern shore of Virgin Gorda, and scale the giant granite boulders – some are as large as 12 metres in diameter. Squeeze through the narrow gaps and into the cavernous chambers for a dip in the rock pools.\nUnder the sea\nThere's much to discover beneath the surface, although there are very dive sites than can easily be reached from the shore – most will require a boat trip. Tortola is a great jumping-off, with many dive operators along its south coast. Blue Water Divers (001 284 494 2847; bluewaterdiversbvi.com ) offers a three-hour introduction to scuba diving, for ages 12 and up, from $118 (£79). A full four-day PADI open-water certification costs from $410 (£273).\nThere are many dive sites to choose from, where you'll find colourful corals and endless sea life, from tropical fish to stingrays and manta rays, but perhaps the most dramatic underwater spectacle is just off Salt Island. Here, in October 1867, a British Royal Mail ship ran aground with 125 people onboard. Swaying seaweed clings to the wreckage (above), explored by inquisitive turtles and technicolour parrotfish.\nIf you prefer to snorkel, head to Virgin Gorda's south-west tip, where between Spring Bay and the rock pools of The Baths you'll find calm waters and coral reefs.", "external_links": [], "published": "2015-09-18T19:55:00.000+03:00", "crawled": "2015-09-30T11:34:10.499+03:00", "highlightTitle": ""}