{"organizations": [], "uuid": "c06a00f0dbde31f0b166093c84388a48c06c22a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64176/lufthansa-starts-new-frankfurt-tampa-service", "country": "US", "title": "Lufthansa starts new Frankfurt-Tampa service", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Lufthansa starts new Frankfurt-Tampa service", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T14:11:00.000+03:00", "replies_count": 0, "uuid": "c06a00f0dbde31f0b166093c84388a48c06c22a4"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/64176/lufthansa-starts-new-frankfurt-tampa-service", "ord_in_thread": 0, "title": "Lufthansa starts new Frankfurt-Tampa service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lufthansa starts new Frankfurt-Tampa service   \nSep 25, 2015 eTN   \nNew Florida destination becomes 18th point served in the USA; flights to operate with three-class Airbus A340-300s specially configured for the leisure travel market \nLufthansa launched its new non-stop service to Florida’s west coast today. Flight LH 482 left Frankfurt (FRA) at 11:00 local time, and is due to land at Tampa International Airport (TPA) later today at 15:50 local time. The corresponding eastbound flight LH 483 will depart from Tampa at 17:20 local time, and is scheduled to touch down in Frankfurt at 08:45 tomorrow (Saturday 26 September). \nLufthansa will be offering five weekly flights on its new Frankfurt-Tampa route until October under the present summer schedules. This will change to four weekly services with the start of the 2015/16 winter schedules on 25 October. Tampa is the Lufthansa’s third Florida destination, joining Miami and Orlando. With the addition of its new service, Lufthansa now serves a total of 18 US destinations. \n“We are pleased to initiate our new program of intercontinental services geared specially to leisure travelers today,” says Karl Ulrich Garnadt, Member of the Lufthansa Group Executive Board and CEO of Lufthansa German Airlines. “And Tampa is the first of a number of new vacation destinations that we will be adding to our network over the next few months.” These will include Nairobi (Kenya) at the end of October, Cancun (Mexico), Male (the Maldives) and Mauritius in early December and Panama City (Panama) in March of next year. \n“Our new long-haul services will make Lufthansa even more attractive for vacationers and other leisure seekers,” Garnadt continues. “These new destinations are primarily popular with tourists and private travelers; and we will be offering them all the full Lufthansa air travel experience, with our outstanding service on the ground and in the air and an advanced cabin that features the latest Business Class seats, our new Premium Economy Class and our regular Economy Class.” \nThe Airbus A340-300s which will be used on the new services are all equipped with FlyNet broadband internet facilities, and will be operated in a three-class configuration: an 18-seat Business Class, a 19-seat Premium Economy Class and a 261-seat Economy Class, giving a total capacity of 298 seats. \nA round-trip flight from Frankfurt to Tampa can be purchased for as little as EUR 739. Further information and booking facilities are available online at LH.com or at any Lufthansa Service Center (phone [069] 86 799 799; fixed-line rates). Flights can also be booked through Lufthansa’s travel agency partners or at any Lufthansa airport sales desk. And Lufthansa further offers attractive all-in travel packages for Tampa (including flights and hotel) on www.lufthansaholidays.com \nThe new service runs Monday, Wednesday, Friday: \nFrankfurt 11.00 – Tampa 16.20", "external_links": [], "published": "2015-09-25T14:11:00.000+03:00", "crawled": "2015-09-25T15:09:23.331+03:00", "highlightTitle": ""}