{"organizations": [], "uuid": "b8af2147d63d15b22f566715b0e0be470350fd90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "http://storage.torontosun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297749107845_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.torontosun.com/travel/archives", "section_title": "Travel | September 2015 | Toronto Sun", "url": "http://www.torontosun.com/2015/09/16/weary-of-refugees-munich-gears-up-for-oktoberfest", "country": "CA", "title": "Weary of refugees, Munich gears up for Oktoberfest | Europe | Travel | Toronto S", "performance_score": 0, "site": "torontosun.com", "participants_count": 2, "title_full": "Weary of refugees, Munich gears up for Oktoberfest | Europe | Travel | Toronto S", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T02:33:00.000+03:00", "replies_count": 1, "uuid": "846051537e74748cf912c02d8901586fed700d3f"}, "author": "Noah Barkin, Reuters", "url": "http://www.torontosun.com/2015/09/16/weary-of-refugees-munich-gears-up-for-oktoberfest#post-0", "ord_in_thread": 0, "title": "Weary of refugees, Munich gears up for Oktoberfest | Europe | Travel | Toronto S", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MUNICH - Germany's decision to restore border controls to stem a tide of refugees may have stunned Europe, but it is being cheered in Munich as it gears up for a far bigger influx of 6 million beer-swigging visitors to the 182nd Oktoberfest.\nThe annual festival, known here as the \"Wiesn\" because it is held on the Theresienwiese, an open space near the city centre, is a fun-loving celebration where 7.5 million litres of brew are consumed over a two-week period by locals and tourists alike, many decked out in traditional lederhosen and dirndls.\nBut this year city officials are working overtime to assure the public it will not turn into a \"Krisen-Wiesn\", or Oktoberfest in crisis, amid a flood of over 60,000 refugees into Munich's train station in the last week alone.\nBavarian Interior Minister Joachim Herrmann raised eyebrows at the weekend by suggesting that refugees descending from trains in Munich, after harrowing journeys from the war-torn Middle East, were likely to encounter crowds of violent drunks returning from the festival, which starts on Saturday.\n\"Refugees from Muslim countries may not be used to seeing extremely drunk people in public,\" Herrmann said. \"It might seem a bit odd to some of them, if I may say so, but this is the reality.\"\nThe risk of that seems to have been greatly reduced since Germany imposed the controls on its border with Austria, cutting the inflow of asylum seekers through Munich to a trickle. Only 765 refugees arrived in the central station on Monday, according to police, down from 13,000 on Saturday.\nHerrmann's boss, state premier Horst Seehofer, has been vilified on social media for suggesting that one reason he pressed Chancellor Angela Merkel to impose the controls was so Oktoberfest could go on without a hitch. His comments sparked a new hashtag #Oktoberfestung (October fortress) on Twitter .\nTENT CAMP\nAt a news conference on Tuesday, police and city officials played down the link between the border crackdown and the annual festival. The measures, announced on Sunday, prompted other countries to follow suit, raising questions about the future of the bloc's 20-year old frontier-free Schengen zone.\n\"We see a clear separation between the Oktoberfest and the situation in the train station, with the refugee crisis,\" said Wilfried Blume-Beyerle, a city official.\nA tent camp for migrants lies just two kilometres from the Theresienwiese, where the Oktoberfest has been held since 1810 -- minus breaks for the two world wars -- in honour of the Bavarian Crown Prince Ludwig's marriage to Princess Therese von Sachsen-Hildburghausen.\nBut the camp is only used as a first daytime stop for refugees arriving in Munich and none are sleeping there.\n\"That refugees might actually go to the Oktoberfest, I think this is far-fetched,\" said Blume-Beyerle.\nFlorian Ziegenaus, a 22-year-old electronics student, drinking a beer in the sun with two friends outside Killian's Irish Pub in central Munich, disagreed.\n\"I would expect some refugees to come. If they find out there's a party going on then why would they stay away?\" he said. \"Not everyone will be happy, but it's a very diverse crowd with lots of foreigners so most people will be very welcoming.\"\nMuslims may think twice about going because of the free-flowing alcohol and pork dishes -- an estimated 60,000 Schweinshaxen, or pig's knuckles, will be consumed during the festival, along with half a million roast chickens and 100 oxen.\nNeither Ziegenaus and his friends, nor city officials said they saw any reason to cancel the Oktoberfest because of the suffering of the refugees, many of whom are risking their lives to get to Europe.\n\"Even after 9/11 we didn't do this,\" said Blume-Beyerle. \"There was a serious debate then about whether we should cancel for ethical and moral reasons. The question was asked: can you celebrate in days like this?\"\n\"But we decided to go ahead. The view was that people who had a problem with it didn't have to go to the Wiesn.\"", "external_links": ["https://twitter.com/search?q=%23Oktoberfestung&src=typd"], "published": "2015-09-17T02:33:00.000+03:00", "crawled": "2015-09-19T19:46:33.406+03:00", "highlightTitle": ""}