{"organizations": [], "uuid": "20f41dd4c6e5f0e245389750c7f61352330e802e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3466978/images/o-CHEESE-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/foodie-travel/feed", "section_title": "Foodie Travel on Huffington Post", "url": "http://www.huffingtonpost.com/us-news-travel/6-food-tours-worth-travel_b_8196536.html", "country": "US", "title": "U.S. News Travel: 6 Food Tours Worth Traveling For", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "U.S. News Travel: 6 Food Tours Worth Traveling For", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T14:58:00.000+03:00", "replies_count": 0, "uuid": "20f41dd4c6e5f0e245389750c7f61352330e802e"}, "author": "U.S. News Travel", "url": "http://www.huffingtonpost.com/us-news-travel/6-food-tours-worth-travel_b_8196536.html", "ord_in_thread": 0, "title": "U.S. News Travel: 6 Food Tours Worth Traveling For", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jordan Johnson / Flickr \nIt's often been said that the fastest way to truly immerse yourself in another country's culture is through the food -- and with increasing number of culinary tours around the world, this statement is truer than ever. Whether you'd prefer to sample spicy curries from a bustling street cart, embark on a day tour through fruit orchards and wineries or create your own dishes in cooking classes led by chefs, there's a tour, exotic city and food-loving guide for you. Check out this list of some of the world's most creative, lesser-known and downright delicious tours to whet your appetite. \nTaste of Peru Where: Lima, Peru \nBeginning in Lima, the Taste of Peru tour immerses you in the art and cultural heritage behind authentic Peruvian cuisine. In addition to trips to Lima's main market and the city's museums, the tour visits historical Cusco (a 1½-hour flight from Lima) and introduces you to the unique flavors of the city, complete with a trek to the magnificent ruins of Machu Picchu. Once you return to Lima, you'll visit the countryside for lessons in making homemade ceviche and pachamanca, an ancient Peruvian cooking method that uses hot stones to sear meat. \nMiami Culinary Tours Where: Miami \nMiami is home to some of the best Latin food in North America, and it's only right that you give yourself the chance to try as many authentic dishes as possible. Explore the city's most vibrant food subcultures, like Little Havana, Little Haiti, South Beach and Coral Gables, with a local guide on Miami Culinary Tours. Each walking tour is about three hours and visits the neighborhood's best restaurants, including well-known eateries and mom & pop-shops. One of the most popular tours hits Little Havana, giving you the chance to try authentic empanadas, scrumptious Cuban sandwiches and Ball & Chain's famous Mojito Criollo along Calle Ocho. \nArtisans of Leisure Where: Vietnam \nVietnam has long been regaled as one of the world's most incredible culinary countries, offering a wide range of dishes like fragrant pho soups to crispy banh mi to spicy bun bo hue. The best way to taste all of what the country has to offer is to join Artisans of Leisure, a private tour company that offers customized tours specifically for foodies that span Hanoi to Ho Chi Minh City. Tours begin with visits to Hanoi's famed markets, bustling with locals, exotic fruits and meats. Afterwards, you'll explore picturesque Halong Bay and make your way to Hue and Hoi An. Finally, you'll end your culinary tour in Ho Chi Minh, where a guide will take you to food stalls downtown slinging some of the country's best pho and banh mi (sandwiches). \nCaribbean Culinary Tours Where: Jamaica; Dominica; Antigua; St. Lucia; Barbados \nKnown around the world for their incredible bounty of eclectic dishes (like jerk chicken and curried goat), the Caribbean islands offer a truly unique culinary experience. Caribbean Culinary Tours offers trips to Jamaica, Dominica and many other islands, immersing epicureans in authentic Caribbean cuisine. Trips span seven to 10 days and include cooking seminars with local chefs, guided jaunts to roadside markets and rum tastings at some of the world's best distilleries. \nEat Mexico Where: Mexico City \nThere are few cultures in the world more revered for their incredible food heritage than Mexico, whose cuisine ranges from flavorful ceviches to mouth-watering tacos. To taste the most authentic dishes (and avoid the tourist traps) hop on a four-hour tour with Eat Mexico, which offers gastronomic trips around Mexico City. The expert-led journeys include street food and regional taco tastings and tours through beautiful Mexico City markets. Unlike other tours in Mexico City, Eat Mexico's public tours remain small, with a capacity of six people per trip, providing participants with a more intimate experience. The tours include plenty of walking, which helps to aid the digestion of all of those tlacoyos (corn tortillas filled with fava or pinto beans, potatoes and cheese). \nIntrepid Travel Where: Macedonia; Slovenia; Montenegro; Spain; Cambodia; Morocco \nKnown for its off-the-beaten-path adventures around the world, Intrepid Travel is now putting a focus on the rapidly growing world of culinary tours. Tours span multiple continents and hit some of the world's fastest growing food hot spots, like Slovenia, Montenegro and Macedonia (starting in 2016). Tours also feature well-known gourmet meccas, like Northern Spain, Cambodia and Morocco. The food-focused trips, which range from two to 15 days, feature a mix of hands-on cooking lessons, street food crawls and plenty of time to sightsee after you've savored local specialties. \nClaire Volkman is a social media journalist with a passion for food and travel. She's spent time in more than 30 countries and hundreds of cities writing, photographing and immersing herself in all things food, wine and culture. You can find her favorite recipes on her blog, The Realistic Nutritionist . Follow her on Facebook , Twitter , Instagram and Google+ to keep up with her adventures. \nFollow U.S. News Travel on Twitter: https://twitter.com/USNewsTravel \nFollow U.S. News Travel on Twitter: www.twitter.com/USNewsTravel More:", "external_links": [], "published": "2015-09-25T14:58:00.000+03:00", "crawled": "2015-09-25T22:48:53.579+03:00", "highlightTitle": ""}