{"organizations": [], "uuid": "62fd53b78d3c383a4e4c2429486470b63e829447", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/adventuretravel/13-of-the-worlds-wildest-frontiers/ar-AAe0GoD", "country": "US", "title": "13 of the world's wildest frontiers", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "13 of the world's wildest frontiers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "62fd53b78d3c383a4e4c2429486470b63e829447"}, "author": "Wanderlust", "url": "http://www.msn.com/en-us/travel/adventuretravel/13-of-the-worlds-wildest-frontiers/ar-AAe0GoD", "ord_in_thread": 0, "title": "13 of the world's wildest frontiers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "13 of the world's wildest frontiers Wanderlust 3 days ago Wanderlust\n1. Russian Far East © Surface of frozen Baikal lake (Shutterstock) Surface of frozen Baikal lake (Shutterstock) Most Trans-Siberian travellers peel south on the Trans-Mongolian to Beijing, and a few continue east to Vladivostok. But there is another way across this frosty emptiness, via the Baikal-Amur Mainline (BAM). Completed in 1991, but only opened to tourists a decade later, the BAM runs for over 4,300km from Tayshet, negotiating Lake Baikal, Siberia and the Severomuisk Tunnel (Russia’s longest) to finish at Sovetskaya Gavan on the Tatar Strait.\nThe more tourist-free option takes just over four days, if you don’t hop off to spend time around the lake or visiting the BAM Museum in Tynda. In the latter, before too long, you’ll be able to switch to the even more remote Amur-Yakutsk Mainline, a northbound link to the world’s coldest city, due for completion in 2015/2016.\nAlternatively, disembark at Khabarovsk, where wildlife fans can head for the remote forest reserve of Durminskoye for a (hopeful) glimpse of the terrifyingly rare Amur tiger.\nHighlights: Lake Baikal, for hot baths and lakeside life; the neo-Renaissance architecture of Komsomolsk-na-Amure; Amur River trips from Khabarovsk; forays into tiger country; Tynda’s BAM Museum; Bratsk Dam.\nNeed to know: Travel Sept-Oct for Lake Baikal fall colours and to avoid summer crowds.\n2. Northeast Greenland National Park © Provided by Wanderlust Northeast Greenland National Park (Shutterstock) Measuring 972,001 sq km, Northeast Greenland is the world’s largest national park. It protects the entire top-right quarter of the Arctic island, and is bigger than most countries. Yet no people permanently live in it, and only 500-ish lucky souls visit each year.\nIt’s far from empty though: species such as polar bear, walrus, caribou, musk oxen, Arctic fox, eagles and ptarmigan live off the fragile tundra and sparkling ice caps while humpback, narwhal, beluga, seals and seabirds puff, play and soar along the coast.\nThe geology is even more spectacular, with looming mountains, fjords serrating the shore and sculptural icebergs choking the channels. You might even see the northern lights, too.\nHighlights: Peary Land, the ice-free northern peninsula; superlative wildlife viewing; cruising with icebergs; nosing into inlets such as Alpefjord; Ittoqqortoormiit (Scoresbysund), the most isolated town in Greenland.\nNeed to know: The best way to visit is via expedition cruise; some vessels sail Spitsbergen- Iceland via the Greelandic coast. Operators will arrange permits.\n3. Pakistan © Provided by Wanderlust Karakoram mountain range (Shutterstock) Pakistan’s mountainous north is almost matchless. Here, three mighty ranges – the Himalaya, Karakoram and Hindu Kush – collide; it’s where you’ll find biggies like Nanga Parbat and fearsome K2. And, somehow, the seemingly impossible Karakoram Highway cuts a precipitous dash amid it all.\nHowever, it’s not a region without problems, which turned more specifically on tourists in 2013, when ten foreign climbers were killed at Nanga Parbat base camp. Things have improved though, and after a brief hiatus, now FCO advice has changed, some operators are resuming trekking trips here in 2015.\nThe classic here is the tough but manageable two-week-return hike to Concordia, a peak-hugged glacial bowl dubbed the ‘Throne Room of the Mountain Gods’. Icy tongues ooze down 8,000m-ers, with K2 – at 8,611m, the world’s second-highest – looming largest of all.\nHighlights: Karakoram Highway, one of the world’s most dramatic roads; Concordia camping; Baltoro Glacier; Balti villages; Hunza Valley and Shangri La-like Karimabad.\nNeed to know: The FCO currently advises against travel along the Karakoram Highway between Islamabad and Gilgit (among other areas of the country); flights into Skardu, the main access town for the Concordia trek, bypass the road.\n4. Carpathian Mountains, Romania © Provided by Wanderlust Carpathian, Ukraine (Shutterstock) Forming a 900km-long arc across the country, Romania’s Carpathians have an extra edge. They’re just that bit wilder than other European ranges. It’s amid this mix of glacial, karst and volcanic peaks that the continent’s big mammals – such as bears and wolves – are doing best.\nIt’s also where you’ll find Central Europe’s largest tract of continuous forest. Much of this is thanks to the perseverance of traditional ways: farming methods have changed little here for centuries. Head off on a hike (there is an large network of trails) and you might pass horses pulling carts, see shepherds wrapped in sheepskins and feel like you’re in the Middle Ages.\nHighlights: Piatra Craiului, the Carpathian’s highest limestone ridge; Bicaz Gorges; wild Retezat NP; Aries Valley villages; brown bears; Moldoveanu (2,544m), Romania’s highest peak.\nNeed to know: The Carpathian Mountains are accessible from capital Bucharest; the mountain resort of Sinaia is just 120km north.\n5. Chhattisgarh & Orissa, India © Provided by Wanderlust Lingaraja Hindu Temple, Orissa (Shutterstock) Millions of tourists head to India each year – but few of them head here. The neighbouring states of Orissa (Odisha) and Chhattisgarh (a breakaway portion of Madhya Pradesh) are mostly ignored by mass tourism yet offer an authentic insight into rural India, so often overlooked in favour of the subcontinent’s big cities.\nThere are towns and temples of interest, but much of the appeal of this north-eastern enclave – most easily accessible from Kolkata – is exploring the villages and meeting the people: the indigenous groups of the jungles around Jeypore; the tattoo-faced Kutia Kondh; the traditionally beaded and costumed Bondos of the Bondo Hills.\nDon’t miss a visit to a haat, a weekly market, to see tribal groups bartering over everything from butter to jewellery, and gathering to gossip over a mahua, the local brew.\nHighlights: Temples and gardens of Bhubaneswar; sacred Hindu site of Puri; Konark, on the Bay of Bengal; Maikal Hills; unique tribal villages; Koraput Tribal Museum; wood-carving village of Etikoppaka.\nNeed to know: Raipur is the capital of Chhattisgarh; Bhubaneswar is the capital of Orissa. Both are served by flights from Kolkata (1.5hrs/1hr).\n6. Iran © Provided by Wanderlust Nasir Al-Mulk Mosque in Shiraz, Iran (Shutterstock) Ancient Persia – land of Silk Road caravanserais, deserts and snow-peaks, magnificent mosques and word-beating hospitality – should be on most travellers’ bucket lists. But years of testy relations with the West and negative Foreign Office travel advice have kept many away. Until now.\nDiplomatic tensions are easing and, although the FCO currently still advises against all but essential travel to all of Iran (plus all travel to within 100km of the Afghanistan border and within 10km of the Iraq border), curious types are starting to head there anyway.\nTour operators are likening the country’s ‘opening up’ to that of Burma, five years ago, when it became the hot new thing. In short, get there quick.\nHighlights: Isfahan’s bridges; ancient Persepolis; Yazd’s medieval bazaar; Shiraz, the City of Poets; the shrines of pilgrimage city Mashhad; hikes in the Zagros and Alborz Mountains.\nNeed to know: FCO warnings can invalidate travel insurance – you may need to buy a specialist policy. Women must wear headscarves at all times.\n7. Torngat Mountains, Canada © Provided by Wanderlust Torngat Mountains NP (Flickr Creative Commons: ビッグアップジャパン) No roads, no signs, no towns, no campsites – Atlantic Canada’s Torngat Mountains NP makes those who visit work hard for the privilege. But what a privilege: this is 9,700 sq km of unspoiled, untarnished wilderness.\nThe mountains here are high and daubed with glaciers; lakes and rivers barrel through dramatic valleys; fjords nibble into the iceberg-littered coast; polar bears, black bears, wolves and caribou herds patrol the lot. Various cultures have lived here over the millennia; ‘Torngat’ comes from the Inuktitut word meaning ‘place of spirits’, as Inuit shamans would travel to these mountains to commune with spirit helpers.\nToday, exploring with an Inuit guide lends not only protection (from those polar bears) but also insight into the landscape. The park is dotted with archaeological evidence, from tent rings to burial sites, adding a human element to this supernatural realm.\nHighlights: Saglek Fjord; caribou migration; abandoned Inuit community of Hebron; Southwest Arm valley; coastal cruising; helicopter flights; Rose Island.\nNeed to know: Access to the Torngats is via Goose Bay and/or Nain in Labrador, or Kangiqsualujjuaq in Nunavik (north Québec).\n8. Chad, Central Africa © Provided by Wanderlust Stone arch in the Sahara Desert (Shutterstock) Chad is the big wide African unknown for all but a handful of determined travellers. We know this, because every year, when we’re adding up the results of the Wanderlust Readers’ Travel Awards, Chad always picks up votes – and glowing reports.\nLack of other tourists is a given. Local encounters – with Tubu nomads, Chari River fishermen and ethnic Bidayat and Zaghawa – are likely. Mind-blowing views of the Sahara, but not as you know it, are manifold: gaze out from the top of the Enneri Tao plateau, over the vast dunes of Mourdi and amid the Ennedi Mountains, surreal orange outcrops and slot canyons, dotted by desert lakes, dwarf crocodiles and ancient rock art.\nHighlights: Tibesti Mountains; the plateau of Enneri Tao; wide, wild Sahara-scapes; odd and amazing Ennedi rock formations; the colourful Ounianga Lakes; encounters with local ethnic groups and desert nomads.\nNeed to know: The FCO currently advises against either ‘all travel’ or ‘all but essential travel’ to all of Chad, except the capital N’Djamena. You may need a specialist insurance policy.\n9. Azerbaijan © Provided by Wanderlust The Mosque of the Martyrs, Baku (Shutterstock) Oil, chess-whizz Gary Kasparov, more oil, winning the 2011 Eurovision… This may be all (or more than) you know about Azerbaijan. To say the Caucasus’ largest nation is untouched by tourism is an understatement – few travellers make it here.\nBut there is plenty to see, from old-meets-new capital Baku – where skyscrapers encircle a medieval walled old town of mosques and caravanserais – to a mountainous countryside of traditional rural villages; from strange lunar landscapes of mud volcanoes to the salty expanse of the Caspian Sea.\nThere’s no escaping that oil and gas entirely though: Azerbaijan is famed for its energy reserves and Zoroastrian temples were built near natural vents, so their holy flames could keep on burning.\nHighlights: Icheri Sheher, Baku’s old town; the Zoroastrian fire temple of Ateshgah; Sheki’s frescoes and palaces; Caucasus hikes; Caspian Sea; craft shopping in Lahij; Naftalan healing-oil resort.\nNeed to know: Direct flights from London to Baku take 5.5 hours. UK nationals require visas.\n10. North West Highlands Geopark, Scotland © Provided by Wanderlust North West Highlands Geopark (Shutterstock) Geopark status is only given to areas of outstanding geological heritage. Well, the North West Highlands has this in spades. One of the most sparsely populated pieces of the continent (quite a claim for the crowded UK), it is home to some 3,000 million years of geology.\nIndeed, the area is dubbed the Cradle of Geology; it is here that thrust structures were first discovered and proved by pioneering Victorian geologists, and it is here that the earliest evidence of life in Europe can be found. All very educational and, fortunately, scenic too: the park encompasses pristine bays, unique caves, monolithic mountains and scattered isles that will impress rock experts and amateurs alike.\nHighlights: Pointy Ben Stack, allegedly inspiration for the Paramount logo; iconic Suilven; Smoo Cave; Knockan Crag cliffs; Cape Wrath; Loch Assynt; remote Sandwood Bay; Summer Isles kayaking; driving the Rock Route.\nNeed to know: Planes, trains and buses run to Inverness, the nearest major hub. Tim Dearman Coaches runs a Cycle Bus service from Inverness to the north daily (except Sunday), May-September.\n11. Burmese Himalaya © Provided by Wanderlust Putao, Myanmar (Shutterstock) Five years ago, Burma would have topped this ‘wild frontiers’ list. But since Aung San Suu Kyi dropped her opposition to visiting tourists in 2009, many have done just that, and Burma is firmly back on the map – and no longer quite so wild. Or at least, not all of it.\nNow, more intrepid travellers are looking for areas of the country away from the main sites – such as the north-western Burmese Himalaya, the easternmost extent of the peerless range. This is not Nepal – the mountains aren’t as high – but many are perennially snow-capped, and offer excellent, interesting and low-traffic trekking.\nPutao is a good base. From around here, hikes head out via hilltribe villages and virgin pine forest to a range of frosted peaks such as 3,635m Phongun Razi and 4,282m Phonyin Razi. Views from up top stretch to higher Himalayas and the plains of Assam.\nHighlights: Putao, nestled in the Himalayan foothills; traditional Rawan and Lisu tribal villages; wildlife spotting; peak bagging.\nNeed to know: Indirect flights from Rangoon to Putao take from around 4.5 hours. UK nationals need a visa to visit Burma; e-Visas are now available online.\n12. Réunion, Indian Ocean © Provided by Wanderlust Réunion (Shutterstock) In many ways, Réunion is no frontier. This department of France, adrift in the Indian Ocean somewhere east of Madagascar, is relatively well discovered by tourists – mostly French. But the interior of the island, an angry, rumpled scrunch of green, feels utterly wild.\nIt could be a stand-in for a Jurassic Lost World: two volcanoes – one extremely active – have created a seemingly impenetrable canyon-riven lushness, where sheer slopes fall away into jungly valley bottoms; the whole place is dribbled by waterfalls, pocked by craters and serenaded by a rainbow of birds.\nThe hiking here is first-class: two long-distance trails (the GR R1 and GR R2) offer multi-day options, but there are numerous offshoots and day-walks – not least the 10.5km hike up to the bubbling Piton de la Fournaise, one of the world’s most accessible active volcanoes.\nHighlights: French-feel capital St-Denis; the three calderas, Cirque de Salazie, Cirque de Cilaos and Cirque de Mafate; Piton de la Fournaise; the dramatic setting and Creole mansions of Hell-Bourg; hiking; helicopter flights.\nNeed to know: There are flights from Paris to Réunion (12hrs). Alternatively, fly to Mauritius to catch a short flight or ten-hour boat ride to Réunion.\n13. Guinea-Bissau, West Africa © Provided by Wanderlust Bafata, Guinea-Bissau (Flickr Creative Commons: jbdodane) Tiny Guinea-Bissau may be wedged near Ebola-hit West Africa, but it didn’t suffer a single case. And following successful democratic elections in 2014, the country is currently calm. This means it’s prime time to visit one of the continent’s least-known nations, and a few intrepid tour operators are venturing in, largely focusing on Guinea-Bissau’s white-sand, wildlife-rich and rather unexpected Bijagós Archipelago.\nDesignated a UNESCO Biosphere Reserve, these 88 islands – a mass of mangroves, mudflats, palm groves and forests – are home to an array of critters, from Nile crocodiles and rare saltwater hippos to African manatees and bottlenose dolphins; it’s also a key site for green turtles, with 10,000 females hauling ashore here to lay their eggs.\nHighlights : Bissau’s Portuguese-colonial architecture; tribal villages; Orango Island, home to hippos; Poilao Island, a breeding site for green turtles; Bubaque, the Bijagós Archipelago’s largest village.\nNeed to know : UK nationals require visas (apply via the Paris embassy). All travellers require yellow fever vaccination certificates.\n ", "external_links": ["http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdUdmr.img&description=Northeast+Greenland+National+Park+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdU37R.img&description=North+West+Highlands+Geopark+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdTVyz.img&description=Surface+of+frozen+Baikal+lake+(Shutterstock)+-+Surface+of+frozen+Baikal+lake+(Shutterstock)", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdTQBw.img&description=Putao%2c+Myanmar+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdTv4F.img&description=Karakoram+mountain+range+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdUdmL.img&description=The+Mosque+of+the+Martyrs%2c+Baku+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdTT7f.img&description=Lingaraja+Hindu+Temple%2c+Orissa+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdU0wq.img&description=Carpathian%2c+Ukraine+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http:%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http:%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdU0wx.img&description=Torngat+Mountains+NP+(Flickr+Creative+Commons:+%E3%83%93%E3%83%83%E3%82%B0%E3%82%A2%E3%83%83%E3%83%97%E3%82%B8%E3%83%A3%E3%83%91%E3%83%B3)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdUiyn.img&description=Stone+arch+in+the+Sahara+Desert+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdU0wG.img&description=Bafata%2c+Guinea-Bissau+(Flickr+Creative+Commons%3a+jbdodane)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http:%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http:%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdTI5v.img&description=R%C3%A9union+(Shutterstock)+-+Provided+by+Wanderlust", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAe0GoD%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdU8e7.img&description=Nasir+Al-Mulk+Mosque+in+Shiraz%2c+Iran+(Shutterstock)+-+Provided+by+Wanderlust"], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-07T05:32:02.146+03:00", "highlightTitle": ""}