{"organizations": ["Isla Mujeres Worst"], "uuid": "24f81e7fc03770591313f724ec57f310efc7200a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.netglobers.com", "main_image": "", "site_section": "http://www.netglobers.com/travel-reports.xml", "section_title": "NetGlobers : Travel Reports", "url": "http://www.netglobers.com/travel-reports/our-fantastic-boat-rental-experience-in-cancun-mexico.html", "country": "FR", "title": "Our fantastic boat rental experience in Cancun, Mexico.", "performance_score": 0, "site": "netglobers.com", "participants_count": 0, "title_full": "Our fantastic boat rental experience in Cancun, Mexico.", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T01:16:00.000+03:00", "replies_count": 0, "uuid": "24f81e7fc03770591313f724ec57f310efc7200a"}, "author": "", "url": "http://www.netglobers.com/travel-reports/our-fantastic-boat-rental-experience-in-cancun-mexico.html", "ord_in_thread": 0, "title": "Our fantastic boat rental experience in Cancun, Mexico.", "locations": ["Mexico", "Cancun"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Cartwright"], "text": "Our fantastic boat rental experience in Cancun, Mexico. 2015-08-1  00.   Mexico   - based on 15 travel reports - by Cartwright Renting a boat to explore Isla Mujeres Worst experience 0 vote(s) travel resume \nMe and my wife recently travelled to Cancun, Mexico as it was a place we had always wanted to visit but had never gotten around to it as we had decided to travel around Europe instead. Cancun has always appealed to us for the fantastic weather, white sandy beaches and beautiful turquoise sea. It was our 10 th wedding anniversary so we wanted to do something special whilst we were there to celebrate. We weren’t too interested in the usual tourist trips and much prefer to explore and see somewhere different rather than spend all day at a theme park type of place. Before we travelled to Cancun we read up on the Island of Isla Mujeres, the island looked beautiful and is only a short trip from the mainland. We decided we were going to rent a boat so took to Google to do our research on Cancun boat rentals . After doing some research we found a reputable company with a large selection of boats and reserved our boat. \nThe boat trip we took was amazing, the company we booked with were great (Cancun Yacht Experience). They supplied us with a captain, soft drinks, beers and snacks so we were good to go. Isla Mujeres only takes around 20 minutes to get to so we cruised there whilst me and my wife relaxed at the back of the boat, taking the sun with a cold beer and enjoying the beautiful turquoise water. Once we got to the island we had the opportunity to snorkel, the water was so clear and warm and the fish and coral were spectacular, it was one of the many great places I have had the privilege to snorkel at. After the snorkelling, we took a short trip to one of the many beaches on the island, where we stopped to relax with another cold beer and experience one of the most breathtaking sunsets I have ever seen. The trip was a truly special one, which I would recommend to anyone, me and my wife had the best wedding anniversary. It will be a day we shall never forget. ...", "external_links": [], "published": "2015-09-30T01:16:00.000+03:00", "crawled": "2015-09-30T14:01:27.194+03:00", "highlightTitle": ""}