{"organizations": [], "uuid": "fcee51d3ecd15a6e5a236f220dd655ff03bc3d52", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30096095/falcon-7x-and-customer-support-services-to-be-highlighted-at-cibas-2015", "country": "US", "title": "Falcon 7X and Customer Support Services to be Highlighted at CIBAS 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Falcon 7X and Customer Support Services to be Highlighted at CIBAS 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "fcee51d3ecd15a6e5a236f220dd655ff03bc3d52"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30096095/falcon-7x-and-customer-support-services-to-be-highlighted-at-cibas-2015", "ord_in_thread": 0, "title": "Falcon 7X and Customer Support Services to be Highlighted at CIBAS 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Dassault Aviation\nBEIJING , September 23,\nBeijing Capital Airport September 24-26\nDassault Aviation will feature the top of the line Falcon 7X at the China International Business Aviation Show (CIBAS) to be held at Beijing Capital Airport from September 24-26 .\n(Photo: http://photos.prnewswire.com/prnh/20150923/269754 )\n(Logo: http://photos.prnewswire.com/prnh/20120925/564526-a )\nWith 35 units in service, China remains the second largest market, behind the United States , for the Falcon 7X. More than 250 7X have come off the assembly line since the airplane was introduced.\n\"Demand for the Falcon 7X in China has remained relatively strong throughout the downturn here,\" said Olivier Villa , Senior Vice President of Civil Aircraft for Dassault Aviation. \"We also expect our new ultra-long range Falcon 8X trijet, set to begin deliveries next year, to receive a warm reception from Chinese customers. We anticipate bright future for this aircraft.\"\nIntroduced last year as the new flagship of the Falcon family, the 6,450 nm/11,945 km 8X will offer the greatest range and the longest cabin of any Falcon, allowing it to take passengers from Beijing to New York or Hong Kong to Paris non-stop. The new aircraft will also offer the largest selection of cabin configurations in business aviation and the same low operating economics and remarkable operating flexibility for which all Falcons are known.\nStrong demand is also expected for the Falcon 2000LXS twinjet, the newest version in the storied Falcon 2000 family. \"We have been encouraged by the popularity of the Falcon 2000 line in China , notably the recent selection of the long-range 2000LX by the Beijing Red Cross Emergency Medical Center (999),\" Villa continued. The Falcon 2000LXS combines the best blend of airport flexibility, cabin comfort and efficiency in the 4,000 nm segment.\nChinese customers are particularly attracted by the high level of comfort and style that characterizes the entire Falcon line. Cabin comfort and interior design have been company leitmotifs since the first Falcon 20 was introduced 50 years ago. Custom fitted by highly skilled craftsmen and inspired by the company's typically French flare for design, Falcons are built to ensure an optimal mix of elegance and practicality with minimum waste of space and the latest in noise abatement, in-flight entertainment and other cabin technologies.\nFalcon Customer Service Expands in China\nEarlier this year, the company signed an agreement with Beijing -based Deer Jet authorizing it to provide line maintenance and unscheduled maintenance for the Falcon 7X.\nLocated at Beijing Capital Airport, Deer Jet is one of the largest business jet operators in the Asia Pacific region. It manages and supports a large fleet of executive aircraft, including the 7X.\nThe agreement with Dassault allows Deer Jet to perform light line maintenance (up to 2A and 2A+ inspections) and unscheduled maintenance on Chinese registered Falcon 7X aircraft from its Beijing facility. Deer Jet has also applied for EASA and FAA full repair station approvals, which are expected to be granted within a year.\nCurrently, the company has three technicians on staff dedicated to supporting Falcon customers, including provision of 24/7 AOG support. It is equipped with a substantial stock of Falcon tooling and spare parts and can also access more than $5 million in spares at Dassault's nearby Beijing spares warehouse.\nIn addition to the agreement with Deer Jet, Dassault has been rapidly increasing customer support capabilities in China to serve the current fleet and anticipate future growth.\nThe company has expanded spare parts inventory at its Beijing and Singapore Spares Depots, allowing it to stock the top 3,000 high demand parts for in-production aircraft. In total, the value of inventory at the company's various regional distribution centers in the Asia-Pacific region now exceeds $30 million .\nIn 2013, Dassault established a Customer Service headquarters in Beijing . Led by Kathy Liu , Director of Customer Support for Asia , the office is staffed with Field Technical Representatives and Customer Care Managers, who provide assistance with warranty issues, spares and other operational matters. Liu's team recently grew with the addition of a Regional Technical Manager and a Field Technical Representative.\nShanghai Hawker Pacific is also a Falcon Authorized Service center capable of providing line and base maintenance for Falcon aircraft registered in China , Hong Kong , Macau and the U.S. It also has a dedicated inventory of Falcon spares.\nSecond China M&O to be Held During CIBAS\nFollowing the success of the recent Falcon M&O Seminar in Beijing , Dassault will conduct a second Maintenance and Operation event during CIBAS. The half-day seminar, on September 24 , will include a general session for all attendees and two breakout sessions for pilots and technicians.\nThe general session will present an overview of customer support expansion and initiatives to help enhance after sales support worldwide with a focus on the region. The pilot session will deal with operational, regulatory, and safety topics. The technical session will cover program updates, product improvements and safety.\nDassault will be located at Chalet 1 during CIBAS.\nNotes for Editors\nDassault Falcon is the recognized global brand for Dassault business jets which are designed, manufactured and supported by Dassault Aviation and Dassault Falcon Jet Corp.\nAbout Dassault Aviation\nDassault Aviation is a leading aerospace company with a presence in over 90 countries across five continents. It produces the Rafale fighter jet as well as the complete line of Falcons. The company employs a workforce of over 11,000 and has assembly and production plants in both France and the United States and service facilities around the globe. Since the rollout of the first Falcon 20 in 1963, over 2,380 Falcon jets have been delivered. Dassault offers a range of six business jets from the twin-engine 3,350 nm large-cabin Falcon 2000S to its new flagship, the tri-engine 6,450 nm ultra-long range Falcon 8X.\nAbout Dassault Falcon Jet\nDassault Falcon Jet Corp. is a wholly owned U.S. subsidiary of Dassault Aviation, France . Dassault Falcon Jet markets and supports the Falcon family of business jets throughout North and South America .\nFollow us on Twitter: @DassaultFalcon\nPhotos\nCopy and paste the link into your browser to access the high resolution photos: http://www.falconphotogallery.com\nFor more information about Dassault Falcon business jets, visit: http://www.dassaultfalcon.com\nPress Contacts\nDassault Aviation (Saint-Cloud, France )\nVadim Feldzer Tel. +33-1-47-11-44-13\nvadim.feldzer@dassault-aviation.com\nMarie-Alexandrine Fouillard Tel. +33-1-47-11-64-23\nmarie-alexandrine.fouillard@dassault-aviation.com\nDassault Falcon Jet (Teterboro Airport, USA )\nAndrew Ponzoni Tel. +1-201-541-45-88\nandrew.ponzoni@falconjet.com\nGrant Kielczewski Tel. +1-201-541-46-79\ngrant.kielczewski@falconjet.com\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://go.rm0002.net/go/qgWtKWqQkeZUgQQJNVEK4Q2/", "http://photos.prnewswire.com/prnh/20150923/269754", "http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201509230457&Transmission_Id=201509230750PR_NEWS_USPR_____enUK201509230457&DateId=20150923", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20120925/564526-a"], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-23T19:07:20.928+03:00", "highlightTitle": ""}