{"organizations": [], "uuid": "1adeb82a7db1606de3133bbb215868d837077cbb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63809/whipping-volcanos-shape", "country": "US", "title": "Whipping Volcanos into Shape", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Whipping Volcanos into Shape", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T16:39:00.000+03:00", "replies_count": 0, "uuid": "1adeb82a7db1606de3133bbb215868d837077cbb"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/63809/whipping-volcanos-shape", "ord_in_thread": 0, "title": "Whipping Volcanos into Shape", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  \nSep 16, 2015 eTN   \nThough often destructive, volcanoes can also be spectacular tourist attractions that ultimately bring great fertility to the land. Italy is a prime beneficiary! But at Driver In Italy, when ‘volcanoes’ happen in our database, we’re not so thrilled…we prefer to manage the flow! Therefore we are poring over and organizing our email contacts to make sure that everyone who receives our occasional emails wants to receive them. Our commitment is to provide you with up-to-date, useful, interesting and oh my god, I’ve got to go information on Italy, so that you can become our partner, our client and especially our friend. \nTo this end we want to make sure that we have both your permission to send you information and your preferred contact information. And rest assured, we’ll protect the sanctity of your inbox as if it were our own – we never share email addresses. Every email from us contains an ‘opt-out’ link, should you decide that Italy just isn’t your thing (and who, really, would think that?) \nThe good news is, if you would like to remain on our email list, do nothing! Continue living the good life, have a gelato, raise a glass of wine! However if you prefer not to hear from us, just click the link above and you will be removed from all future email promotions.", "external_links": [], "published": "2015-09-16T16:39:00.000+03:00", "crawled": "2015-09-16T18:37:56.683+03:00", "highlightTitle": ""}