{"organizations": [], "uuid": "427faf3311d1ab229b3c427640a8bfdff3eea192", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/04/AHLA-logo.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/15-million-online-hotel-bookings-are-scams-each-year-by-rogue-websites/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "15 Million Online Hotel Bookings are Scams Each Year By Rogue WebsitesTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "15 Million Online Hotel Bookings are Scams Each Year By Rogue WebsitesTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "f2036286bf1a97a7655bebc3450e62c217a4cd59"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/15-million-online-hotel-bookings-are-scams-each-year-by-rogue-websites/", "ord_in_thread": 0, "title": "15 Million Online Hotel Bookings are Scams Each Year By Rogue WebsitesTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "15 Million Online Hotel Bookings are Scams Each Year By Rogue Websites  \nWhen it comes to booking a hotel, it pays to go straight to the source. A new study conducted by the American Hotel & Lodging Association (AH&LA) reveals that one in three people are worried about online booking scams, which affect millions of unsuspecting consumers.\n \nEarly estimates suggested that some 2.5 million hotel bookings a year were affected by deceptive practices through rogue third-party online travel agency (OTA) affiliates who pose as direct hotel booking sites. The study, conducted by GFK Custom Research, and released today shows that six percent of consumers who have booked hotels online had the experience of thinking they were booking directly with a hotel, but found out instead that they were booking with an online hotel booking site posing as the direct site. By AH&LA estimates, that translates to some 15 million hotel bookings that have been affected by deceptive rogue affiliates. That translates to more than $1.3 billion in money going to bad bookings, meaning consumers are not getting what they want and need, not to mention suffering inconveniences, lost room charges, and cancellation and booking fees. Another 20 percent of respondents who have booked hotels online reported that they were “not sure” if they had also been scammed.\n\nThese deceptive practices harm consumers, who don’t get what they want or need, suffer the loss of reservations or face additional charges and fees. This concern was raised by the Federal Trade Commission which recently warned consumers about these deceptive practices through two consumer alerts highlighting the scams and offering tips to avoid misleading booking sites. These practices also damage hotel reputations and reduce consumer confidence in the online booking process.\n \n“These findings clearly show that online hotel booking scams have eroded consumer confidence among third-party vendors,” said Katherine Lugar, president and CEO of AH&LA. “Consumers deserve transparency in knowing who they are booking with. That is why we have been actively working with state and national government agencies, including the FTC, as well as consumer advocacy groups, to ensure that consumers are protected and can feel comfortable in the booking process. It’s always safest to book directly with the hotel.”\n \nNearly one-third (32%) of consumers who have booked online using an online travel company booking website, and say they worried about it, have personally experienced the following inconveniences when booking online:\n \n32 percent got a room that was different than what was expected; 17 percent were charged unexpected or hidden fees; 15 percent did not get their rewards points; 14 percent were charged an extra booking fee; 14 percent could not get a refund for a cancellation; Nine percent had reservations lost or cancelled; and Three percent had their identity or private information stolen.  \nThe study confirmed that, in order for travelers to be certain they are getting what they want and need, without the frustration and worry, most feel it is better to book directly with the hotel. Amajority of those who have booked a hotel online say that they prefer dealing directly with the hotel (56%).\n \n“As we heard from consumers, booking hotel accommodations directly is always your best option—eliminating headaches and hassles during any step of the process,” added Lugar. “When dealing directly with the hotel, consumers can rest easy knowing they have direct access to those who can accommodate their needs.”\n \nSource:- AH&LA", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T18:43:35.933+03:00", "highlightTitle": ""}