{"organizations": [], "uuid": "c3222332d0726fc792947c0fc96fed22dcaebeb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/mission-getaway-from-mumbai-for-the-weekend.html", "country": "US", "title": "Mission Getaway from Mumbai for the Weekend", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Mission Getaway from Mumbai for the Weekend", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T07:42:00.000+03:00", "replies_count": 0, "uuid": "c3222332d0726fc792947c0fc96fed22dcaebeb2"}, "author": "Saurav Mishra-2015-09-11T05:42:55-0400", "url": "http://www.articlesfactory.com/articles/travel/mission-getaway-from-mumbai-for-the-weekend.html", "ord_in_thread": 0, "title": "Mission Getaway from Mumbai for the Weekend", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Articles | September 11, 2015 \nYou should probably take a trip to some place far and enjoy the weekend. We know that you are a workaholic, but at times it is necessary for one to stop what they are doing, go on a little vacation, and come back thoroughly refreshed. \nWhat we want for you is exactly what you need, a break. \nSo here is a list of all the places to visit near Mumbai, as weekend getaways. \nTwin Attractions- \nA place made very popular by Bollywood is Khandala and Lonavala, twin hill resorts that are about 93 kilometres away from the city along the Mumbai-Pune Expressway. These two places stand 5 kilometres away from each other and offer adventures like trekking, camping under the skies, tours of the various farm houses that dot the place and water rappelling. The Korigad Fort is a great monument that stands here and so are the caves, Bhaja, Lohgad, the Tiger’s leap and Karla. It would also be fun to get a glimpse of the Duke’s Nose, a cliff that resembles the nose of the Duke of Wellington and aptly named after him. \nSilvassa, the land of Portuguese influence- \nThis place serves its purpose of being one of the top spots on this list of weekend getaways from Mumbai. Adorned with Portuguese architecture, the Catholic Church is a standing testimony of their work. Formerly known as Vile de Paco d’Acros, this place now stands as a Union Territory of India and is the capital for Dadra and Nagar Haveli. You can visit the Dadra Park, the Balaji temple and many more tourist spots here. So it would be wise to take a short trip to this place, gorge on Portuguese cuisine and relax all day long. \nIgatpuri adventures- \nAbout 120 kilometres away from Mumbai city, is Igatpuri located in Nashik, the wine capital of India. This is a beautiful hill station that provides a great escape option for those in need of that much needed break. If you are stressed out, the Dhamma Giri Meditation Centre here is the right place for you to relax and connect with your inner self. The Ghatandevi temple is popular with the locals and you may want to pay it a visit. For backpackers, Igatpuri offers a number of treks, zip-lining, camping and other such adventure sports. The place should be visited anytime between June to September and then again from November to March. It is with much pride that we include this place in our list of weekend getaways from Mumbai. \nThe untouched Revdanda \nRevdanda Beach lies around 125 kilometres away from the bustling city of Mumbai and is home to the beautiful place Alibaug. A less frequented beach, this place is ideal for a quiet getaway as it lies untouched by concretization. The place offers one a peaceful night of lakeside star gazing, making a bonfire and roasting a meal, water sports and to sum it all up, fun away from the city. It is this place that will help you unwind. Source: Free Articles from ArticlesFactory.com ABOUT THE AUTHOR \nSaurav Mishra is the author here who had penned down some of the best weekend getaways from Mumbai for workaholics everywhere.", "external_links": [], "published": "2015-09-11T07:42:00.000+03:00", "crawled": "2015-09-11T16:27:39.716+03:00", "highlightTitle": ""}