{"organizations": [], "uuid": "5317e883a9b00d53a4914bf4c38ec3a1f921b9a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/images5-300x166.png", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-and-partner-airlines-fundraising-transaction-increased-to-us-700-million-2/", "country": "US", "title": "Etihad Airways and partner airlines' fundraising transaction increased to US$ 700 millionTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Etihad Airways and partner airlines' fundraising transaction increased to US$ 700 millionTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "5317e883a9b00d53a4914bf4c38ec3a1f921b9a3"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-and-partner-airlines-fundraising-transaction-increased-to-us-700-million-2/", "ord_in_thread": 0, "title": "Etihad Airways and partner airlines' fundraising transaction increased to US$ 700 millionTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Etihad Airways and partner airlines’ fundraising transaction increased to US$ 700 million\nEtihad Airways and its equity partner airlines have increased the funds raised from their unique platform financing transaction to US$ 700 million following a surge in demand from international financial institutions.\nEtihad Airways, Etihad Airport Services, airberlin, Air Serbia, Air Seychelles, Aliltalia and Jet Airways announced on Tuesday they had successfully raised US$ 500 million through the transaction, which followed roadshows in Abu Dhabi, Dubai and London.\nAfter unprecedented increased demand from financial institutions in a range of markets, the airlines re-opened the transaction and have raised an additional US$ 200 million, bringing the total to US$ 700 million.\nThe funds, which will be split across the seven businesses, will be used for a mixture of capital expenditure and investment in fleet, as well as for refinancing, depending on each airline’s individual needs.\nJames Hogan, President and Chief Executive Officer of Etihad Airways, said: “The initial success of this transaction was a clear endorsement of the shared vision and strategies of these businesses. Together, we are creating compelling network and product offers for our customers, while cutting costs and sharing a wide range of synergies.\n“The additional demand we have seen over the past 24 hours has been enough for us to re-open the transaction. These additional funds will allow this group of airlines to accelerate further the realisation of this vision and these strategies.\n“Individually, each of these partners is building an increasingly strong business. But together, that strength is multiplied. This transaction recognises and endorses that strength.”\nAllocation of the funds raised will be nearly 20 per cent each to Etihad Airways, Etihad Airport Services, airberlin and Alitalia; 16 per cent to Jet Airways; and the remainder to Air Serbia and Air Seychelles.\nSource:-Etihad Airways", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T22:14:40.612+03:00", "highlightTitle": ""}