{"organizations": [], "uuid": "ba5c538d12f0ca015be7ac479bbde39a698d657a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/download-328-300x96.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/krisflyer-members-can-now-earn-miles-on-scoot-and-tigerair/", "country": "US", "title": "KrisFlyer Members Can Now Earn Miles On Scoot and TigerairTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "KrisFlyer Members Can Now Earn Miles On Scoot and TigerairTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba5c538d12f0ca015be7ac479bbde39a698d657a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/krisflyer-members-can-now-earn-miles-on-scoot-and-tigerair/", "ord_in_thread": 0, "title": "KrisFlyer Members Can Now Earn Miles On Scoot and TigerairTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "KrisFlyer Members Can Now Earn Miles On Scoot and Tigerair\nMembers of the KrisFlyer frequent flyer programme can now earn miles when flying on Scoot and Tigerair, in the latest enhancement to the programme.\nWith effect from today, KrisFlyer members can earn miles when they purchase a PlusPerks bundle or FlexiCombo fare for their flights on Scoot and Tigerair, respectively. The option for KrisFlyer members to redeem miles for vouchers for travel on Scoot and Tigerair, or to pay for selected products offered by the two low-cost carriers, was made available earlier this year.\n“We are pleased to offer our KrisFlyer members more benefits through this partnership with Scoot and Tigerair. With this launch, our members can now earn and redeem KrisFlyer miles across the Singapore Airlines Group portfolio of airlines,” said Singapore Airlines’ Senior Vice President Marketing Planning, Ms Lee Wen Fen.\n“KrisFlyer is committed to delivering on our promise to constantly make it more exciting and rewarding to be a member with the range of partners we have now.”\nScoot CEO Campbell Wilson added: “PlusPerks, a new bundle of benefits including KrisFlyer mileage accrual, priority check-in and boarding, preferred seat selection and ticket flexibility, delivers Scoot’s commitment to choice and unbeatable value. PlusPerks gives you all the more reason to ‘get outta here’ with Scoot.”\nTigerair CEO Lee Lik Hsin commented: “FlexiCombo delivers a unique bundle of popular add-ons, flexibility and mileage accrual that will appeal to both leisure and business travellers alike. We are glad to deepen our relationship with the KrisFlyer programme by offering the opportunity for KrisFlyer members to accrue miles when flying Tigerair.”\nThe PlusPerks bundle enables Scoot customers to earn KrisFlyer miles on eligible fares, enjoy preferred seat selection with extra legroom, access priority check-in and fast boarding privileges and make one date or name change with administrative fees waived.\nTigerair customers can enjoy 15kg checked-in baggage, free upfront seat selection, KrisFlyer miles accrual and one-time fee waiver on date change with the FlexiCombo fare.\nSource:- Singapore Airlines", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T21:08:49.622+03:00", "highlightTitle": ""}