{"organizations": [], "uuid": "740eaa795b71e03d0c99ca550b467f21d50a333b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03426/Australia_s_quando_3426953k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-04.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/australian-food-wine/11839692/australian-cuisine.html", "country": "US", "title": "The delicious diversity of Australian cuisine", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "The delicious diversity of Australian cuisine - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T19:08:00.000+03:00", "replies_count": 0, "uuid": "740eaa795b71e03d0c99ca550b467f21d50a333b"}, "author": "Jill Dupleix", "url": "http://www.telegraph.co.uk/sponsored/travel/australian-food-wine/11839692/australian-cuisine.html", "ord_in_thread": 0, "title": "The delicious diversity of Australian cuisine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When British botanist Joseph Maiden first landed at the colony of New South Wales in 1880, he was astounded by the rich diversity of the native plants and trees around him. Within 10 years he had published his first book on the subject, The Useful Native Plants of Australia . It was not, however, a cookbook, as Maiden believed the eucalyptus-studded landscape he so admired had “nothing to boast of as eatables”. Yet for tens of thousands of years, up to 5,000 edible plants grown on this island continent have nourished one of the oldest races on earth, the indigenous Australians. Fast-forward to 2015 and at last Australia’s top chefs are foraging in their own backyard, trying to define who they are by cooking with what is around them. No longer derided as \"bush tucker\", these often powerfully flavoured ingredients now shape the most exciting menus in the country. So what does Australia taste like? It tastes as rich, green and velvety as warrigal greens, a bright green, matte, diamond-leaved plant that looks like velcro-backed sea spinach. It tastes wonderfully, shockingly tart, like the quandong, a leathery-skinned “desert peach” and other native fruits and berries; and enchantingly sweet from honey ants or floral nectar. The native food industry can support sustainable business for aboriginal communities Australia tastes both salty and juicy, like the iodine-rich succulents that creep along the rugged coastline – blue-grey saltbush (current darling of the high-end chefs, often crisp-fried in tempura batter), sea-blite and samphire. It also tastes warmly, deeply peppery – from the mountain pepper leaf and berry – and refreshingly, zingily citrusy, from the tiny, juicy, caviar-like pearls spilling out of a finger-shaped rainforest fingerlime fruit. It tastes as sweet, rich, delicate and luxurious as a marron, the freshwater crayfish native to Western Australia. It tastes wild, clean and gamey, like the rich burgundy meat of kangaroo and the milder taste of wallaby. These now turn up in the most lauded and awarded restaurants in the country, such as quay and Sepia in Sydney, Adelaide’s Orana and Melbourne’s Attica, the highest-placed Australian restaurant on the respected World’s 50 Best Restaurants list. Homegrown: Australia's native fingerlime fruit The benefits go beyond the table. Handled ethically, the native food industry can support sustainable business for aboriginal communities, protecting traditional lands and preserving age-old wisdom. Environmentally, native plants are naturally adapted to this ancient country’s dry climate and saline soil. Health-wise, many of the fruits contain more antioxidants and vitamins than their domesticated equivalents. Had Joseph Maiden disembarked on Australian shores in 2015 instead of 1880, he would be kept busy cataloguing the native “eatables”. Like today’s visitors, he could join a tour of the indigenous gardens within The Royal Botanic Gardens in Sydney or Melbourne, identifying plants that have been used for food, tools, weapons and medicine for thousands of years. He could walk with local Wadandi man Josh Whiteland of Koomal Dreaming in Western Australia’s south-eastern Margaret River region, exploring the local Noongar culture, tasting native foods and learning traditional fire-lighting methods. He could drive himself around South Australia’s Eyre Peninsula, stopping for fresh oysters in Cowell and catching crabs at low tide at Whyalla; or sit around a campfire on Tasmania’s magnificent Cradle Mountain, dining on freshly caught trout spiced with local native pepper. At the very least, he could raise a glass of Australia’s first vermouth in a silent toast to the landscape he so championed. Fittingly, Maidenii Vermouth’s rich, warm bittersweetness is derived from 12 Australian botanicals such as strawberry gum, sea parsley, river mint and wattleseed. Equally fittingly, it is named in Joseph Maiden’s honour. Discover Australia with Etihad Airways, voted the World’s Leading Airline at the World Travel Awards. Etihad offers daily flights from London, Manchester and Edinburgh via Abu Dhabi to Sydney, Melbourne, Brisbane and Perth from just £655 per person. Terms and conditions apply. You may also be interested in: • In pictures: top dining spots in Australia • The best destination for food and wine • Donna Hay's caramelised chilli and salmon stir-fry recipe • Looking for a gourmet getaway? Find inspiration for your next foodie holiday at telegraph.co.uk/tasteofaustralia", "external_links": [], "published": "2015-09-04T19:08:00.000+03:00", "crawled": "2015-09-04T14:17:28.421+03:00", "highlightTitle": ""}