{"organizations": [], "uuid": "d764e2dde15ca309c55f9581411d3697b8d2dc2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03424/Older-couple-laugh_3424393a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-08.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/finance/your-bank/11835002/barclays-carers-forum.html", "country": "US", "title": "Carers don’t have to cope alone", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Carers don’t have to cope alone - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T02:39:00.000+03:00", "replies_count": 0, "uuid": "d764e2dde15ca309c55f9581411d3697b8d2dc2d"}, "author": "Vanessa Keys", "url": "http://www.telegraph.co.uk/sponsored/finance/your-bank/11835002/barclays-carers-forum.html", "ord_in_thread": 0, "title": "Carers don’t have to cope alone", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "According to Carers Trust , there are more than seven million carers in the UK At the beginning of 2012, Geoff and Pamela Artley, pictured above, started planning for their retirement. Pam, then 55, was winding down her work in the police force and Geoff, then 60, was still working full-time as a chemical engineer. The couple had met in 1999 and connected instantly over their love of adventure. “Our plan was to retire, move up to the North East and spend our days cycling, walking and exploring the moors,” says Pam. But in mid-2012, friends and family began to notice Geoff’s deteriorating health. “His behaviour changed,” says Pam. “He would get aggressive, and Geoff never got aggressive.” In June, he had CT and MRI scans and in August, was diagnosed with a rare disease called frontotemporal dementia (FTD), a form of early-onset dementia. “Most people think dementia is about memory, that you just forget things,” says Pam. “But with Geoff, his memory is fine. The problem is his mobility – he falls a lot and can no longer cope with the simplest of tasks.” For the past two years, Pam has done all the driving, manages Geoff’s medication, looks after all the bills and finances, and makes all of the decisions regarding utilities, insurance and spending. “I do all of the cooking, cleaning, shopping and gardening,” she says. “He can’t be left alone.” According to UK charity Carers Trust, there are more than seven million carers like Pam in the UK. The biggest misconception around unpaid carers, says Carers Trust chief executive Gail Scott-Spicer, is that most of them don’t see themselves as carers. “They think they are ‘just’ someone’s mum, or daughter – when actually they are a carer and they are entitled to support,” she says. “Many feel isolated and unable to ask for the support they need, so it’s our duty to reach out to them.” Forums provide a place for carers to connect not only with each other but also with a network of charities and organisations Local carers centres and charities such as Carers Trust and Age UK are a good place to start, says Gail. She also recommends Barclays Carers Forums , informal drop-in sessions in conjunction with Carers Trust that are held regularly at branches across the UK. Elaine Draper, Barclays director of accessibility and inclusion, says the forums provide a place for carers to connect not only with each other but also a vast network of charities and organisations. “By bringing together experts who can provide support and guidance, we hope to make carers’ lives a little easier. They don’t have to cope on their own.” For Pam and Geoff, who moved across the country and away from their family while Geoff was being diagnosed, being able to lean on organisations for help has been vital. “Initially I was floundering,” says Pam. “I had no idea where to go for help. A woman from Alzheimer’s Support now visits me once a month and is such an important part of our journey. Social Services provide a four-hours-a-week sitting service so that I can have some time for me. Ryedale Carers Support Group has also been a lifeline for us and a place where we have been able to meet people in a similiar situation to us. “Places like Ryedale and Barclays Carer Forums are a great support for people just entering the world of caring, because that is when most people struggle to understand where and how to get help and support. But it’s important to remember that every carer’s journey is different.” YOUR VIEWS Helen Helen cares for someone with borderline personality disorder. “The best advice given to me was know your boundaries and stick to them no matter what. Consistency and being firm but within the context of a loving relationship has really helped both of us.\" Emmalee A former carer for her father. “Don’t give up. When times get tough, remember that you’re doing stuff your average adult paid carer couldn’t do. You might not always wear a superhero cloak, but you’re the best thing to walk this Earth in the eyes of the person you're caring for.\" Pat Pat cares for her husband Eddy, who has Alzheimer’s. “Whenever he gets frustrated and takes things out on me, my daughter says: ‘You have to remember, Mum, this isn’t Dad. He’s been taken over by the dementia and he doesn’t understand how he’s upsetting you.’” Sally Sally cares for her father, who has Alzheimer’s. “If you are not getting the help you need from your social worker, find out who their boss is and escalate your concern up through the management chain. Be polite but firm, and keep a dated record of all communication.” EXPERT VIEWS Gail Scott-Spicer, chief executive, Carers Trust \"Carers Trust is here to ensure that carers have the support and information that they need to care and stay well themselves, too. We also campaign for change by working with the government and health professionals to show how they can make a difference to carers.\" Caroline Abrahams, charity director, Age UK \"Many carers have no choice but to leave jobs or take low-paying, part-time work where their skills and expertise are wasted. At Age UK, we believe in helping employers enable people to work flexibly. This would be a boon to carers and be good for economic productivity, too.\" Elaine Draper, director, accessibility and inclusion, Barclays \" Barclays Carers Forums are hosted by Barclays colleagues in our branches across the UK. We aim to answer any questions carers may have about managing someone else’s finances. Local council and charity representatives will also be there to provide specialist advice.\" PARENT v CARER Bob Moran is the political cartoonist for the Saturday and Sunday Telegraph. His two-year-old daughter, Poppy, has cerebral palsy and epilepsy. “The idea of being Poppy’s carer as well as her parent might seem odd, given that all parents are compelled to care for their children. But as she gets older, the two roles are becoming more distinct. Poppy has a range of additional needs because of her disability, and helping her to reach her full potential requires us to be more than just parents. Every day, we need to be her physiotherapists, speech therapists, dietitians, occupational therapists and more besides. Sometimes I find it really difficult to strike the right balance; being her dad will always come first. Being her carer presents its own challenges, but also offers unique rewards.” • To find out more, ask in any Barclays branch or visit barclays.co.uk/carersforum. You can also watch the Carers Forums video.", "external_links": [], "published": "2015-09-09T02:39:00.000+03:00", "crawled": "2015-09-08T23:01:56.058+03:00", "highlightTitle": ""}