{"organizations": [], "uuid": "e2ebc25714761cea6d40154a88b9e4b2d83170e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vvdailypress.com", "main_image": "http://www.vvdailypress.com/storyimage/VV/20150903/NEWS/150909878/AR/0/AR-150909878.jpg", "site_section": "http://www.vvdailypress.com/entertainment/travel?template=rss&mime=xml", "section_title": "TRAVEL - VVdailypress.com", "url": "http://www.vvdailypress.com/article/20150903/NEWS/150909878/13007/ENTERTAINMENT?rssfeed=true", "country": "US", "title": "Holiday travel: The road beckons", "performance_score": 0, "site": "vvdailypress.com", "participants_count": 1, "title_full": "Holiday travel: The road beckons", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T04:13:00.000+03:00", "replies_count": 0, "uuid": "e2ebc25714761cea6d40154a88b9e4b2d83170e2"}, "author": "Rene Ray De La Cruz Staff Writer", "url": "http://www.vvdailypress.com/article/20150903/NEWS/150909878/13007/ENTERTAINMENT?rssfeed=true", "ord_in_thread": 0, "title": "Holiday travel: The road beckons", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fuel prices drop as Labor Day weekend arrives; big delays expected Comment By Rene Ray De La CruzStaff Writer By Rene Ray De La CruzStaff Writer Posted Sep. 3, 2015 at 8:00 PM By Rene Ray De La CruzStaff Writer Posted Sep. 3, 2015 at 8:00 PM » Social News VICTORVILLE — As commuters motor into the holiday weekend, experts say drivers across the country will see the lowest Labor Day prices at the pump since 2004. Prices in the West remain significantly higher than the national average due to reported supply problems, but experts say that won't deter California drivers. The Auto Club of Southern California predicts that some 2.5 million Southern Californians will travel for the holiday weekend, with over 85 percent traveling my car. The club expects 35.5 million Americans will trek 50 miles or more from home during that time. The club predicts that Las Vegas, San Diego, San Francisco, the Central Coast and Grand Canyon will be the top destinations for residents of the Golden State. Caltrans predicts delays of up to four hours during peak travel times this weekend on Interstate 15 in the Cajon Pass. As drivers fueled up on Thursday in preparation for the unofficial end of summer, commuters saw the national average for a gallon of gas at $2.44, about 99 cents less than a year ago, according to the club. In San Bernardino County, including the High Desert, drivers saw the average price hit $3.40 per gallon, almost a dollar more that the national average and about a dollar more than the lowest local price of the year, which came in close to $2.45 in early February. On Thursday, Costco on Valley Center Drive in Victorville boasted prices of $2.99 per gallon (though membership is required) and Shop N Go on Main Street in Hesperia was offering $3.15 a gallon, according to GasBuddy.com . Average U.S. gas prices dropped about 37 cents per gallon since hitting a 2015 peak price of $2.80 on June 15. Average gas prices have dropped due to lower crude oil costs and abundant petroleum supplies, the AAA said. \"Americans should find good deals on gas prices in most parts of the country heading into the busy Labor Day weekend,” AAA spokesman Avery Ash said. “It is unbelievable that drivers are ending their summer vacations with the lowest gas prices for this time of year in more than a decade.” Ash added that gas prices in many parts of the country (but not California) could fall below $2 per gallon by Christmas if the cost of crude oil remains low. He added that there is good reason to believe that cheaper oil costs, a seasonal decline in driving and the switch-over to less costly winter-blend gasoline will continue to push down prices through the end of the year. Average U.S. gas prices dropped about 37 cents per gallon since hitting a 2015 peak price of $2.80 on June 15. Average gas prices have dropped due to lower crude oil costs and abundant petroleum supplies, the AAA said. But on the West Coast, prices are relatively high due to ExxonMobil’s refinery in Torrance, which is still not operating at normal levels. A refinery explosion in the spring sent gas prices in parts of California above $4 per gallon, the club said. California already had some of the highest prices in the nation due to its high gas taxes, but its typically lower-priced neighbors such as Nevada are also seeing the effects of supply problems. California and neighboring states currently remain near or above $3 per gallon, but prices may decrease when the Torrance refinery is expected to ramp up in production in October as it completes repairs. Gas prices may also decrease as refineries stop using summer-blend gasoline as the temperatures begin to cool, the Auto Club said. Gas prices generally drop after Labor Day, which is considered the end of the summer driving season. People typically drive less in the autumn and winter, which is when gas prices usually reach a low for the year. Alaska ($3.40) is the nation’s most expensive market for retail gasoline, unseating California ($3.35) after seven straight weeks as the market leader following tightening supply within the state. Nevada ($3.13), Hawaii ($3.10) and Washington ($2.95) round out the top five most expensive markets. On the other end of the spectrum, motorists in South Carolina ($2.02) are paying the lowest price at the pump in the nation, AAA said. Visit www.FuelGaugeReport.AAA.com or www.GasBuddy.com for more information on prices. Rene Ray De La Cruz may be reached at 760-951-6227, RDeLa Cruz@VVDailyPress.com or on Twitter @DP_ReneDeLaCruz. By Rene Ray De La CruzStaff Writer By Rene Ray De La CruzStaff Writer Posted Sep. 3, 2015 at 8:00 PM » Comment or view comments \" data-width=\"650\" data-numposts=\"20\" data-colorscheme=\"light\"> » STAY INFORMED", "external_links": [], "published": "2015-09-04T04:13:00.000+03:00", "crawled": "2015-09-04T06:26:30.157+03:00", "highlightTitle": ""}