{"organizations": [], "uuid": "89a167d30cab791b5d4f26864774f0cac2cb5e13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30132550/group-1-automotive-acquires-mercedes-benz-dealership-near-austin-texas", "country": "US", "title": "Group 1 Automotive Acquires Mercedes-Benz Dealership Near Austin, Texas", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Group 1 Automotive Acquires Mercedes-Benz Dealership Near Austin, Texas - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "89a167d30cab791b5d4f26864774f0cac2cb5e13"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30132550/group-1-automotive-acquires-mercedes-benz-dealership-near-austin-texas", "ord_in_thread": 0, "title": "Group 1 Automotive Acquires Mercedes-Benz Dealership Near Austin, Texas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Group 1 Automotive, Inc.\nHOUSTON , Sept. 28, Group 1 Automotive, Inc. (NYSE: GPI), an international, Fortune 500 automotive retailer, today announced the acquisition of a Mercedes-Benz dealership located in Georgetown, Texas , which is part of the greater Austin metropolitan area. The dealership, which will continue to operate as Mercedes-Benz of Georgetown , is expected to generate $100 million in estimated annual revenues. This dealership also includes a Mercedes-Benz Sprinter commercial vehicle franchise and Smart car franchise.\n\"We are delighted to strengthen our relationship with Mercedes-Benz and further expand our scale in the Austin metropolitan market, which leads the nation as one of America's fastest-growing cities,\" said Earl J. Hesterberg , Group 1's president and chief executive officer.\nAbout Group 1 Automotive, Inc.\nGroup 1 owns and operates 153 automotive dealerships , 200 franchises, and 35 collision centers in the United States , the United Kingdom and Brazil that offer 32 brands of automobiles. Through its dealerships, the Company sells new and used cars and light trucks; arranges related vehicle financing; sells service and insurance contracts; provides automotive maintenance and repair services; and sells vehicle parts.\nGroup 1 Automotive can be reached on the Internet at www.group1auto.com .\nThis press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, which are statements related to future, not past, events and are based on our current expectations and assumptions regarding our business, the economy and other future conditions. In this context, the forward-looking statements often include statements regarding our goals, plans, projections and guidance regarding our financial position, results of operations, market position, pending and potential future acquisitions and business strategy, and often contain words such as \"expects,\" \"anticipates,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"should,\" \"foresee,\" \"may\" or \"will\" and similar expressions. While management believes that these forward-looking statements are reasonable as and when made, there can be no assurance that future developments affecting us will be those that we anticipate. Any such forward-looking statements are not assurances of future performance and involve risks and uncertainties that may cause actual results to differ materially from those set forth in the statements. These risks and uncertainties include, among other things, (a) general economic and business conditions, (b) the level of manufacturer incentives, (c) the future regulatory environment, (d) our ability to obtain an inventory of desirable new and used vehicles, (e) our relationship with our automobile manufacturers and the willingness of manufacturers to approve future acquisitions, (f) our cost of financing and the availability of credit for consumers, (g) our ability to complete acquisitions and dispositions and the risks associated therewith, (h) foreign exchange controls and currency fluctuations, and (i) our ability to retain key personnel. For additional information regarding known material factors that could cause our actual results to differ from our projected results, please see our filings with the SEC, including our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date hereof. We undertake no obligation to publicly update or revise any forward-looking statements after the date they are made, whether as a result of new information, future events or otherwise.\nInvestor contacts:\nSheila Roth\nManager, Investor Relations\nGroup 1 Automotive, Inc.\n713-647-5741 | sroth@group1auto.com\nMedia contacts:\nPete DeLongchamps\nV.P. Manufacturer Relations, Financial Services and Public Affairs\nGroup 1 Automotive, Inc.\n713-647-5770 | pdelongchamps@group1auto.com\nor\nClint Woods\nPierpont Communications, Inc.\n713-627-2223 | cwoods@piercom.com\nLogo - http://photos.prnewswire.com/prnh/20110930/MM78360LOGO\n releases/group-1-automotive-acquires-mercedes-benz-dealership-near-austin-texas-300149903.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20110930/MM78360LOGO", "http://photos.prnewswire.com/prnvar/20110930/MM78360LOGO", "http://www.group1collision.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA13079&Transmission_Id=201509281157PR_NEWS_USPR_____DA13079&DateId=20150928", "http://www.prnewswire.com/news-releases/group-1-automotive-acquires-mercedes-benz-dealership-near-austin-texas-300149903.html", "http://www.group1auto.com/"], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T20:41:47.959+03:00", "highlightTitle": ""}