{"organizations": [], "uuid": "81737b7e9eadd0527e0c01b3055bcf034afd03ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63797/kenya-tourism-intensifies-targets-west-africa-and-uae", "country": "US", "title": "Kenya tourism intensifies targets: West Africa and UAE", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Kenya tourism intensifies targets: West Africa and UAE", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T05:32:00.000+03:00", "replies_count": 0, "uuid": "81737b7e9eadd0527e0c01b3055bcf034afd03ee"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63797/kenya-tourism-intensifies-targets-west-africa-and-uae", "ord_in_thread": 0, "title": "Kenya tourism intensifies targets: West Africa and UAE", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Kenya tourism intensifies targets: West Africa and UAE   \nBy Prof. Wolfgang H. Thome, Ph.D., eTN Africa Correspondent | Sep 16, 2015 eTN   \nThe Kenya Tourism Board, in short known as KTB, has intensified its marketing efforts in the Western African region and parts of the United Arab Emirates (UAE). This is part of the board’s marketing strategy that sees more focus on Africa and other growing markets like the UAE. \nKTB officials, Ag. Regional Marketing Manager in charge of Africa, Ms. Fatma Bashir, and PR & Corporate Communications Manager, Ms. Wausi Walya, are in West Africa on a joint program with Kenya Airways, and Wakanow, one of West Africa’s largest online tour operators, with a footprint in Europe and the Middle East. The training program begins today in Accra, the capital of Ghana. \nThis is in line with KTB’s strategy on strategic partnerships that saw the team also hold discussions yesterday with the Ghana Tourism Authority (GTA) as part of the preliminary steps towards creating mutually beneficial alliances. Speaking at the meeting, GTA’s Ag CEO, Mr. Charles Bonsu, welcomed the move by both government agencies to reach out, sighting that Ghana has a lot to learn from Kenya and vice versa when he said: “The shared lessons will see tourism grow in Africa, and we must admit that Kenya has excelled, especially in managing their key tourism products like wildlife, as well as service delivery,” before adding, “the ease of travel facilitated by the existing visa-free rule and direct flight by Kenya Airways are already advantages that the two countries can leverage on to increase traffic.” KTB has extended an invitation to GTA to participate in this year’s 5th edition of the Magical Kenya Travel Expo (MKTE) to be held in Diani in October as well as an opportunity for exposure during the Africa Travel Association Conference to be held in early November this year. A total of 16 tour operators and travel industry private sector companies from West Africa will be attending MKTE 2015. \nThe training, led by KTB in West Africa, Ghana, and Nigeria, specifically follows an online training launch in both countries in May 2015. A photo and film shoot followed in Kenya in both Nairobi and Mombasa in partnership with Ebony TV on DSTV as part of showcasing Kenya’s rich tourism product. The current training comes ahead of the consumer online campaign, “Choose Kenya, Go Chop Better,” that is scheduled for October 2015 in line with the premier airing of the “Destination Africa” program that will be screened on DSTV. \nThese activities are expected to enhance awareness of Kenya as a destination of choice for West Africa as well as grow the partnership between KTB, Kenya Kenya Airways, and Wakanow. \nSpeaking during a radio show that served as a curtain raiser for the training sessions, Okay FM’s show presenter, Abieku Santana, a tourism enthusiast and a friend of Kenya, commended Kenya for leading in nurturing tourism as a key economic activity that supports many livelihoods and encouraged other African countries to follow suit. The show saw both Fatma and Wausi interact directly with part of the over 600,000 listeners and 1,500 online followers of the show that is popular in many parts of Ghana and beyond. It was a good opportunity to share destination information ranging from pricing, quality, visa requirements, weather, and a variety of tourism products among other areas. \nThe training program will continue in Lagos, Ibadan, Port Harcourt, Abuja, and Dubai, UAE.", "external_links": [], "published": "2015-09-16T05:32:00.000+03:00", "crawled": "2015-09-16T08:01:46.250+03:00", "highlightTitle": ""}