{"organizations": [], "uuid": "e7bb7e0218eda612412a7ea95adcd511b744439e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/ewrewr4355ddsfdsf5435.jpg", "site_section": "http://www.foxnews.com/travel/", "section_title": "Travel News, Videos &amp; Vacation Guides for Planning Your Trip | Fox News", "url": "http://www.foxnews.com/travel/2015/09/21/wi-fi-scam-hackers-set-up-free-internet-hot-spots-to-steal-traveler-info/", "country": "US", "title": "Wi-Fi scam: Hackers set up ‘free’ Internet hot spots to steal traveler info", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Wi-Fi scam: Hackers set up ‘free’ Internet hot spots to steal traveler info | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e7bb7e0218eda612412a7ea95adcd511b744439e"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/travel/2015/09/21/wi-fi-scam-hackers-set-up-free-internet-hot-spots-to-steal-traveler-info/", "ord_in_thread": 0, "title": "Wi-Fi scam: Hackers set up ‘free’ Internet hot spots to steal traveler info", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 21, 2015 FoxNews.com Facebook 0 Twitter 0 livefyre Email Print Logging on to that free network may be a cyber security headache. (iStock)\nTravelers on the go want to stay connected more than ever.\nWhile it might be tempting to log into the first Wi-Fi hotspot that doesn’t require a password, security experts caution that those “free” access points might actually be run by hackers trying to get your personal information.\n“Your videos, your social security number, your insurance information, your credit card information, mobile payments, they’re [hackers] after that information,” Verun Kohli, vice president of Skycure, a mobile defense firm, told NBC.\nIn addition to SSL decryption, which allows cyber criminals to capture user information, hackers also use SSL stripping, a method that allows attackers to downgrade HTTPS URLs to non-secure HTTP URLs. Malicious Wi-Fi destinations are everywhere.\nKohli says there are hundreds of potentially dangerous networks around the world's top tourist destinations, and nearly one out of 10 suspicious networks reportedly features the term “free” within the hotspot’s name.\nSkycure recently mapped popular tourist spots around the country most prone to insecure Internet access points. New York City’s Times Square tops the list. Disneyland in Anaheim, Calif., Notre Dame in Paris, the Las Vegas Strip, and the area around St. Peter’s in Vatican City are also big destinations where hackers try to take advantage of tourists desperate for a connection.\nEven for networks that are secure, many users—up to 92 percent according to NBC-- do not fully read the fine print in the disclaimer, which often grants the network access to your personal information and browser history.\nKohli used a medical analogy to explain the risk factor of logging on to a Wi-Fi spot that appears suspicious.\n“The safest way not to get sick, is not shake hands with sick people,” the digital security explained. In other words, if a “free” Wi-Fi connection seems too good to be true, it probably is.", "external_links": ["https://www.skycure.com/blog/skycure-study-2015-best-worst-tourist-attractions-for-mobile-security/", "http://www.today.com/video/caution-wi-fi-hot-spots-run-by-hackers-are-targeting-tourists-526433347646?ncid=txtlnkusaolp00000618"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-21T23:30:43.939+03:00", "highlightTitle": ""}