{"organizations": [], "uuid": "9975bda773f331394790c397cd42c49f46f79716", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.centraltelegraph.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/09/22/mt-kosciuszko-with-girl-resized-wh1p3fchca23bp0ewk2_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/CentraltelegraphcomauTravel", "section_title": "centraltelegraph.com.au: Travel", "url": "http://www.centraltelegraph.com.au/news/offroad-bucket-list-10-must-do-aussie-destinations/2783204/", "country": "AU", "title": "The offroad bucket list: 10 must-do Aussie destinations", "performance_score": 0, "site": "centraltelegraph.com.au", "participants_count": 0, "title_full": "The offroad bucket list: 10 must-do Aussie destinations", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T17:00:00.000+03:00", "replies_count": 0, "uuid": "9975bda773f331394790c397cd42c49f46f79716"}, "author": "", "url": "http://www.centraltelegraph.com.au/news/offroad-bucket-list-10-must-do-aussie-destinations/2783204/", "ord_in_thread": 0, "title": "The offroad bucket list: 10 must-do Aussie destinations", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Local Real Estate Cars For Sale \nWith 100 years on the tracks you'd never see all of Australia, so here are 10 adventures that are absolute must-do's 10. Climb to the top of Australia (Mt Kosciuszko) \nWe often hear people brag about how naturally diverse Australia is, one of the few nations on earth where you can go from stunning beaches to snowy alpine ranges and then into red dirt desert in just a matter of days. \nWith that in mind we're kicking off this bucket list by celebrating the natural diversity of Australia and putting Mt Kosciuszko right at the top (Australia's highest mountain, get it?). \nThe 14km hike to the summit is well worth it, but all through the park you'll find tracks, river crossings and campgrounds that'd rival anywhere else in the country. Time it right and you can find yourself here when the snow hits, and before the tracks are closed for the season. \nPristine rivers, secluded camping and waking up to snow falling on the roof top tent while we kick the fire off for some morning bacon and eggs? Now that sounds like adventure to us. Thredbo Resort \nWHEN TO GO \nThey don't close the summit, they just make it harder to get to. Expect it to be covered in snow from June through to October and the lift will only take skiers or snowboarders to the base of the 14km climb, so unless you're keen to strap some tennis racquets to your feet, best be heading up before then. 9. See the Red Centre Tourism NT \nFrom one extreme to the other. The centre of Australia is something every adventurer needs to do at least once in their life. And while photos of seldom driven dirt tracks and bull dust is one thing, there's nothing comparable to Uluru. \nOfficially known as Uluru/Ayers Rock, the monolith towers close to 350m from ground level, making it taller than the tallest building in Australia by 5 stories, and it's sticking straight up from the centre of one of the largest deserts in the world. If that doesn't make Australia seem like a magical place to you, we don't know what will. \nYou can't really climb the rock anymore - well you can, but the caretakers have asked that you don't, and 35 people have met their maker doing it. \nThe magic really lies in walking around it, sitting back on the roof of your 4WD and watching it change colours from yellows to oranges and fiery reds as the sun sets. It's a sight people from all over the world flock to see, and for some reason we always seem to drive around it just because it doesn't include lifting wheels. Bollocks to that. \nWHEN TO GO \nThe centre of Australia is hot, but we shouldn't really need to tell you that. August to September are generally the best times to head out, but it's a long way from anywhere so plan your trip around everything else you're doing; just don't forget a stop in the red heart of Australia. 8. Jump on a boat to Buccaneer Archipelago Tourism WA \nNow this one is a long way away, a very long way away. Roughly 220km north-west of Broome, the Buccaneer Archipelago consists of close to 1000 tiny islands in what is one of the most inhospitable, yet beautiful places in the entire world. \nNo roads, no tracks, no airports and no queues. What you will find, however, is adventure that will have you thinking you're in a tropical paradise, long forgotten by society. \nThe islands routinely get hammered by tides up to 12m high (you read that right) which give the area its breathtaking horizontal waterfalls. As the tides build up, the water is forced through a small opening in the rocks at Talbot Bay, giving the appearance of a horizontal waterfall. As the tide outside drops, the water trapped inside the bay rushes back out, giving you a waterfall in the opposite direction. \nIf you're anywhere near the north-west of WA, you'd have to have rocks in your head not to head to Buccaneer Archipelago. \nWHEN TO GO \nMuch like most of the northern parts of Australia this region has wet and dry seasons. The dry season generally runs from May through to October. It's also the most mild temperature-wise, being the middle of winter. Expect temps to be in the low to mid 30s from May through to August; come much later than that and the average temps start climbing up to the 40°C mark. 7. Camp under the stars at Sandy Cape Tourism and Events Queensland \nFraser Island is a popular tourist attraction for backpackers, and for good reason. It's a tropical paradise a short drive and ferry ride from one of the biggest cities in Australia. \nIt boasts some of the clearest lakes in the world, as well as claiming the crown of the largest sand island in the world. The pubs and shops on the south side of the island are definitely worth a visit, as are the many walking tracks, creek crossings and lookouts. \nBut the real beauty of Fraser lies far beyond the reach of sunburnt Poms: Sandy Cape, the northern-most part of the island and the most secluded. To get there you'll need to head through Ngkala Rocks and negotiate Indian Head. Many 4WDs have been lost here over the years, or at least stuck for hours on end, but with a bit of planning it's easily doable. \nSandy Cape is tidal locked, so you'll need to pilot your way through the tricky bits and then blast up the beach as the tide is running out. Have the recovery gear ready through here, you might need it. \nOnce you're up there it's worth a hike to the lighthouse, and a boogie board down the dunes is an absolute must as well. \nThe real Sandy Cape comes out at night, though. As the sun sets, and the tides close off the only way in and out. It's just you, a swag, and a million stars looking out over the crashing waves. \nWHEN TO GO \nThe Fraser Coast region is reasonably moderate weather-wise, so the only thing you really need to avoid is the crowds. Give school holidays a miss, and Christmas is as close as Fraser will ever get to peak hour. \nApart from that you've got the pick of the calendar to escape to the island. 6. Wet your windows on the Balfour Track Tassie Tag-along 4WD Tours \nIf you're after no holds barred, balls to the wall, LowRange action you need to start planning a trip to the Balfour Track and the west coast of Tasmania right now. \nThe sign at the start says winches are a necessity, snorkels are a must, and absolutely don't do it if you're not in a convoy. It's not hard to see why either. \nThe track is 16km from end to end and full of bog holes up to 70m long with the water/mud concoction reaching bonnet height in some sections. The grasslands off to either side will give you even more grief than the actual track itself, so don't even think about a detour. \nLeave the trailers back at the campgrounds, bring a water bra to cover the grille, a whole heap of WD40 for your electronics and some good door seals. \nThe whole west coat of Tasmania is riddled with tracks that'll push just about any 4WD to its limits, and you're almost always rewarded by stunning campsites, ocean views and terrain unlike anywhere else in Australia. \nWHEN TO GO \nThe Balfour and equally infamous Climes tracks are best experienced when the water's flowing. Tasmania gets the majority of its rainfall through June and July; it's also the time you're most likely to find snow, and be very very cold. 5. Roll out your swag in the snow Tourism Tasmania \nIf you're like us you've no doubt spent hours drooling every time a photo pops up on the interwebs of just about any other country in the world, hubs locked and crawling through sill deep snow. Squint hard enough and it could almost be you and your mates in the photo. \nCombine that with photos of campfires dug right into the snow and it's enough to make a grown man weak at the knees. The good news is you can hit the white stuff right here in Australia, and it's a lot easier than you think. \nThe High Country or Kosciuszko National Park are the obvious choices, but it's been known to snow as far north as the Brindabella Ranges right up to Barrington Tops. \nIt's something few Australians even know is an option, and even fewer still have actually done it. \nCamping and even driving in the snow pose a lot of challenges you'll never normally face in the warmer areas, but that's all part of the adventure. Now where did we leave those snow shoes? \nWHEN TO GO \nIn most areas where it snows the tracks close right around the same time (normally the Queen's Birthday weekend). You pretty well need to plan to go there as late as possible, and even still there's no guarantee of snow. Time it just right and you're in for the trip of a lifetime. 4. Go croc spotting in Kakadu Tourism NT \nThere are two sides to Kakadu. Everyone's seen the tourist side of things, and that's a bit of a stretch considering there's only two bitumen roads through the whole park. \nBut there's a whole different side to Kakadu you just can't get to without a 4WD. You're not going to need 35\" tyres to go off exploring, but muddies, a winch and snorkel are an absolute must. \nThere are dozens of primitive bush camps just off the river banks or right around the corner from stunning waterfalls. \nTo get to some of the lesser known places you'll need to lock your transfer case in LowRange and take on rutted tracks and river crossings, especially if you're coming just after the wet. \nYou've got a few options to spot the crocs out in their natural habitat. If you're brave (or silly) you can spot them on a few of the river banks or crossings, but to really get the Kakadu experience jump on one of the Aboriginal-run boat tours to get up close. \nThere's a whole lot of wilderness in Kakadu National Park just waiting for you to discover it. \nWHEN TO GO \nJust like every other tropical destination on this list, you've got to take the wet season into account. May through to August is generally considered the best time to go, but if you're looking for a challenge, and you're keen to see the best that Kakadu has to offer, stick to just after the wet. The water levels will still be up, the waterfalls flowing and there will be plenty of crocs hanging around. 3. Support a country town - and head to the Birdsville Races Outback Pics \nThe Birdsville Races have become an Outback institution. They've been taking place now for the better part of 130 years, and short of a nationwide lockdown on horses (2007) or the track being under water (2010) the races run rain, hail or shine, attracting punters from all across the country. \nFor one week each year, the sleepy town of Birdsville turns from the gateway to the outback into a bustling hub of activity, full of adventure seekers from all walks of life. \nRather than losing its country charm, the races shine a spotlight on it. There's no fancy hotels, no limo service, and the best place to eat is still the pub. It's a bit like everyone heading to the local RSL to play two-up on Anzac Day, but on a national scale. \nMost use the race as an excuse to finally get around to doing that Simpson Desert trip they've been putting off forever. A few coastal towns on the way, a couple of days at the races and then pointing west into the red centre through some of the harshest conditions known to man, real adventure. \nEvents like the Birdsville Races are almost a rite of passage - a link to the heartbeat of Australia that few ever get to experience in this culture of Twitfacing and iWhatsing. \nWHEN TO GO \nThe races are on the first weekend in September, but plan to spend a week or two heading into the desert either before or after the event. Some love the idea of having the races as the final goal to keep their eye on, for others the info you pick up at the races can be invaluable for doing a desert trip after. 2. Take on the Canning Stock Route Tourism WA \nThe Canning Stock Route is hands down one of the most adventurous things you can do in this country. It's close to 2000km of gibber stones and undulating sand through some of the most isolated country you'll ever find. \nIt's the kind of place where something as simple as a flat tyre could potentially turn fatal. And for that reason alone it's made our top 10. \nDespite the route being cut in the early 1900s it wasn't until the late '60s that it was first successfully travelled from start to finish in a vehicle. With a fuel drop along the way it's now achievable for 4WDers although you'll still need to be totally self-sufficient, and have a fuel range in excess of 1000km through the soft sand just to make it to the fuel drop. \nThis track is no joke, but it's something you can truly be proud of taking on. From start to finish expect to be on the route for 16 days, so you'll need plenty of supplies as well. \nIf you're not confident rebuilding a busted hub on the side of a track eight days from civilisation there are a few tag-a-long tour companies who can take you there and back in safety. \nWHEN TO GO \nParts of the Canning Stock Route can be impassable in the wet. The safest time of the year to take on the route is June/July. It'll get cold the further south you get but it's a much better option than being bogged up to your axles days from help. 1. Take a photo at the tip of Australia Tourism and Events Queensland \nThe Cape is one of the most diverse places in the country. Sure, there are places that are more remote, or have steeper climbs, or more water, but the Cape has it all. \nJust getting there you'll climb through mountain ranges, zigzag through the Daintree forest and find yourself with nothing but straight red dirt tracks leading to the horizon in both directions. \nWhen you're actually up at the tip there's mud, sandy river banks, pristine waterfalls and forgotten parts of Australian history. No amount of words on a screen can ever get across how truly amazing this place is. \nWith that said, the crowning achievement is to hike the last K or two out onto the rocks and pose for a photo with the sign. \nSure, you could fly in to Bamaga airport, jump in a hire car and get the shot, but this photo is the crowning achievement of your struggle to get there. The hours on the end of a winch, nervous river crossings, nights spent croc watching by the camp fire on an adventure you'll never forget. \nNot going to the tip is like training your whole life for the Olympics, getting gold and leaving before you're awarded the medal, and this is the best medal in the country. \nWHEN TO GO \nThere's a whopping great big wet season through summer that closes just about every track north of Cairns. If you don't want to test how watertight the seals on your sunroof are, it's best to head up around April through to July. 4wd", "external_links": [], "published": "2015-09-21T17:00:00.000+03:00", "crawled": "2015-09-22T15:18:48.864+03:00", "highlightTitle": ""}