{"organizations": [], "uuid": "13404d20af4becc47f31040f9715d9d0bee4a2d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/download-1110-300x168.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/thomas-kluhr-appointed-new-swiss-ceo/", "country": "US", "title": "Thomas Klühr appointed new SWISS CEOTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Thomas Klühr appointed new SWISS CEOTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "13404d20af4becc47f31040f9715d9d0bee4a2d9"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/thomas-kluhr-appointed-new-swiss-ceo/", "ord_in_thread": 0, "title": "Thomas Klühr appointed new SWISS CEOTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Thomas Klühr appointed new SWISS CEO\nThe Lufthansa Group announced the parameters today for the future overall structure of the entire aviation group. The associated realignments involve SWISS, too, and should enable the Group’s airlines and service companies to gear their products and also their processes even more consistently to the needs of their customer groups. The realignment is also intended to enhance the Group’s overall efficiency, speed up decision-making and reduce complexities.\nThomas Klühr to succeed Harry Hohmeister\nUnder the realignment, SWISS CEO Harry Hohmeister, who is also a member of the Lufthansa Group Executive Board, will take charge of the newly-created position of Hub Management thereon in January 2016. Hub Management is designed to ensure the more unified and process-oriented commercial management of the Group’s premium airlines Lufthansa, SWISS and Austrian Airlines. More specifically, commercial functions such as Network & Fleet Planning, Product and Sales should in future be more closely coordinated among all the Group’s network airlines and hubs.\nHarry Hohmeister will be succeeded as SWISS CEO by Thomas Klühr, who is currently a member of the Executive Board of Lufthansa German Airlines with responsibility for Hub Munich and Finance. “I am delighted that in Thomas Klühr we have appointed such a worthy successor to Harry Hohmeister with such extensive experience of the airline business,” says Bruno Gehrig, Chairman of the SWISS Board of Directors. Klühr, who is 53, graduated from the University of Erlangen with a diploma in commerce in 1990, and has since held various executive functions within the Lufthansa Group. He is married and has two children. He will take up his new SWISS duties in Zurich on 1 February 2016.\nFlight operations to be integrated into CEO’s remit\nThe function of Chief Operating Officer (COO) is to be integrated into the CEO’s remit. Rainer Hiltebrand, SWISS’s current COO, will also be assuming a new function: developing groupwide training for flying personnel. He will assume his new duties in February 2016. Current Chief Commercial Officer Markus Binkert and Chief Financial Officer Roland Busch will remain on the SWISS Management Board.\nA greater functional alignment\nThe new Lufthansa Group organization is designed to provide a more functional alignment groupwide. The aim here is to intermesh the Group’s various commercial, operational and administrative elements far more closely throughout all its business segments. This will include managing its premium airlines using unified processes, to offer all the Group’s customers a consistent and integrated travel experience on all its network carriers and at their operating hubs.\nIn line with this approach, SWISS Chief Commercial Officer Markus Binkert will bear commercial responsibility for Hub Zurich. In addition, he will be in overall charge of the “Distribution and Revenue Management” process for all three premium airlines.\nFlatter hierarchies\nThe present four management levels below the Lufthansa Group Executive Board will be reduced to three in the new group organization. This will enable decisions to be taken more quickly, while simultaneously expanding the decision-making scope of individual management members. The new group organization should be gradually adopted from 1 January 2016 onwards.\nThe strong SWISS brand will continue to play a significant role within the realigned Lufthansa Group. And the new process-oriented organization will further enhance the competitive credentials of both SWISS and the entire Lufthansa Group.\nSource:- Zurich Airport", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T18:06:53.478+03:00", "highlightTitle": ""}