{"organizations": [], "uuid": "b8fe4e63ebf93a3124437cd8582b187e5682e91f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/03/sabre-pacific.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sabre-enhances-leading-flight-tracker-software-with-real-time-intuitive-fleet-monitoring/", "country": "US", "title": "Sabre enhances leading flight tracker software with real-time intuitive fleet monitoringTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Sabre enhances leading flight tracker software with real-time intuitive fleet monitoringTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "b8fe4e63ebf93a3124437cd8582b187e5682e91f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sabre-enhances-leading-flight-tracker-software-with-real-time-intuitive-fleet-monitoring/", "ord_in_thread": 0, "title": "Sabre enhances leading flight tracker software with real-time intuitive fleet monitoringTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sabre enhances Leading Flight Tracker Software With Real-Time Intuitive Fleet Monitoring Published on : Wednesday, September 9, 2015\nSabre Corporation, a global technology provider to the travel industry, has introduced enhanced capabilities to its Sabre AirCentre Flight Explorer solution. Airlines have already begun using the innovative new features in the latest release, which provides real-time data to enable accurate decision-making in flight operations. The flagship feature, Fleet Monitor, builds on existing airport and flight monitoring capabilities to provide airlines a comprehensive dashboard view of their entire fleet.\nThe airline industry has recently placed increased focus on flight tracking. In November 2014, the ICAO’s Aircraft Tracking Task Force (ATTF) released a set of recommendations to improve global aircraft tracking capabilities. The flight tracking software is a critical component of the recommendations, and Sabre has partnered with airlines to enhance capabilities and compliance of the latest release of Sabre AirCentre Flight Explorer. The new Fleet Monitor feature also gives airlines the ability to set up customized monitoring and alerting based on user-defined thresholds. For example, if a plane goes off route or doesn’t report its position within a few minutes, the airline will be alerted and escalation can begin instantly.\n“With its user-friendly interface, our crewmembers use Flight Explorer to maintain situational awareness at all times with enroute weather, ATC constraints, flight performance information and more, all layered seamlessly on one screen. To date, we are very pleased with the reliability of Flight Explorer,” said Emir Radoncic, Manager Dispatch Support at JetBlue Airways.\nWith the recent addition of ground based ADS-B position data, airlines will now receive emergency transponder beacon codes in Flight Explorer. This beacon technology coupled with the alerting capabilities in Fleet Monitor allow for immediate action in emergency situations.\n“As part of our strategy and commitment to provide our customers with intuitive flight management solutions, Flight Explorer delivers actionable, real-time information at the key moment of decision making,” said Kamal Qatato, vice president of Sabre AirCentre, which provides software for airline operations. “With Fleet Monitor and other improvements in this release, airlines can manage their fleet by exception and achieve streamlined efficient flight management.”\nTop airlines across the world are using Sabre AirCentre Flight Explorer to track their fleet, identify weather and irregular operations, and as a centerpiece in their operations control. This new release, with its intuitive fleet monitoring and alerting, sets the standard for airlines looking to comply and exceed with the ATTF recommendations.\nSource:- Sabre", "external_links": [], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T04:14:27.158+03:00", "highlightTitle": ""}