{"organizations": [], "uuid": "c479e8eb1d2655e03aee680c159f965d28684f19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/werwer345435sfsf.jpg", "site_section": "http://www.foxnews.com/travel/", "section_title": "Travel News, Videos &amp; Vacation Guides for Planning Your Trip | Fox News", "url": "http://www.foxnews.com/travel/2015/09/24/rock-out-your-vacation-in-one-these-musically-themed-properties/", "country": "US", "title": "Rock out on your next vacation at one of these musically-themed properties", "performance_score": 0, "site": "foxnews.com", "participants_count": 1, "title_full": "Rock out on your next vacation at one of these musically-themed properties | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "c479e8eb1d2655e03aee680c159f965d28684f19"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/travel/2015/09/24/rock-out-your-vacation-in-one-these-musically-themed-properties/", "ord_in_thread": 0, "title": "Rock out on your next vacation at one of these musically-themed properties", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 24, 2015 FoxNews.com livefyre Email Print HomeAway\nHomeAway\nHomeAway\nHomeAway\nHomeAway\nHomeAway\nHomeAway\nHomeAway\nPrevious Next Are you fantasizing about a vacation that really rocks?\nPlan a getaway to one of these musically-inspired retreats.\nWhether you want to lay your head in the former Palm Springs home of Rat Packer Frank Sinatra, invite your favorite musicians to sing-along at Nashville home-studio or bring all your friends to crash at Iggy Pop's South Beach bungalow, HomeAway.com has plenty of properties that a fine-tuned music-lover is sure to appreciate.\n1. This hills are alive in...Montego Bay, Jamaica HomeAway\nOscar Hammerstein penned 'The Sound of Music' from the terrace of this beautiful Jamaican property, overlooking a different, yet beautiful hillside. This grand home features six bedrooms and sleeps up to 16 friends. Rates start at at $1,071 per night.\n2. Rat Pack Palm Springs Getaway HomeAway\nFrank Sinatra commissioned architect E. Stewart Williams to build Twin Palms, a sprawling, four-bedroom, mid-century masterpiece in 1947-- but the property has since been updated with all the necessary features a modern superstar could want. Spend afternoons lounging poolside. No need to go inside, the well-equipped pool house features a kitchenette and wet bar, perfect for fixing that midday martini. Starting at $2,600 per night, this house sleeps up to eight guests.\n3. Grand living in Germany HomeAway\nThis neo-renaissance villa in Dresden, Germany was built in 1893 for the grand opera singer Therese Malten. Lavishly decorated, but with all the amenities a modern tourist could want, this six bedroom home is just 30 minutes away from the city center by train. Starting at $595 per night, this home would be a steal for up to 16 guests on a grand German vacation.\n4. \"Camelot\" California estate HomeAway\nAustrian-American composer Frederick Loewe used to call this beautiful Palm Springs palace his home. The property features four hotel style bedrooms, each with their own en suite bathrooms for maximum privacy, a tennis court, grotto style spa, pool, waterfalls, fountains, sculptures, and original art throughout the property. Vacation rental pricing starts at $2,500 but the venue is also available for special events.\n5. Live like a Moulin Rouge performer HomeAway\nThis four-bedroom, two-storey duplex in Montmarte was once the residence of the the dancers and performers of the world famous Moulin Rouge. The spacious apartment in the 18th Arrondissement features simple, yet beautiful French details throughout. With room for up to 10 guests starting at just $602, bargain hunters will be doing the can-can all night long.\n6. The Music Loft in Nashville HomeAway\nNashville is one of America's preeminent music destinations and this one-of-a-kind apartment pays homage to this city's rich musical history. Part psychadelic crash pad, part serious studio, this two-bed, two-bath full floor apartment is located right in the heart of downtown Music City. Furnishings include a white baby grand, full Ludwig drum kit, guitar and bass amps, full PA, cool lighting, and everything else you would need to host your own jam session or songwriter showcase.\n7. Iggy Pop's South Beach sanctuary HomeAway\nMiami is home to countless celebrities so a star spotting is likely if you book a stay at this Mediterranean/Art Deco style home once owned by rock legend Iggy Pop. The four-bedroom home sleeps 12 comfortably with ample pullout so the whole posse can spend the night after a day at the beach. Rates start at $1,071 per night.\n8. Hendrix hideout in Hawaii HomeAway\nThis charming North Shore bungalow may not look like much to the unobserving eye. But real music fans can sleep like true rock royalty in this one-bedroom home Jimmie Hendrix stayed in during the filming of \"Rainbow Bridge\" in 1970. And while it may look like its deep in the heart of the Hawaiian jungle, the property is just 10 minutes away from the beach, restaurants, shops, zip line, Makawao Town, Haiku Town or Paia Town. Rates start at just $165 a night.", "external_links": ["http://www.homeaway.com/"], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-25T03:59:49.631+03:00", "highlightTitle": ""}