{"organizations": [], "uuid": "a518ddab4a2511332794cf5bc9e7acb2d09c5b26", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/09/28/Web-Resampled/2015-09-28/cf201442968631-kWIE--296x197@wp.com.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/style/carly-fiorina-killed-in-the-debates-but-how-would-she-do-in-person/2015/09/28/08555f7c-65ed-11e5-8325-a42b5a459b1e_story.html", "country": "US", "title": "Carly Fiorina killed in televised debates. But how would she do in person?", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "Carly Fiorina killed in the televised debates. But how would she do in person? - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "a518ddab4a2511332794cf5bc9e7acb2d09c5b26"}, "author": "Ben Terris", "url": "http://www.washingtonpost.com/lifestyle/style/carly-fiorina-killed-in-the-debates-but-how-would-she-do-in-person/2015/09/28/08555f7c-65ed-11e5-8325-a42b5a459b1e_story.html", "ord_in_thread": 0, "title": "Carly Fiorina killed in televised debates. But how would she do in person?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Ben Terris September 28 at 6:45 PM Follow @bterris\nCarly Fiorina greets a voter after a national security forum at the Citadel in Charleston, S.C., last week. (Charles Ommanney/The Washington Post) CHARLESTON, S.C. — Carly Fiorina swept into this key primary state last week with momentum in her favor, a shining new face rising above the fray of the GOP primary slog thanks to a fresh and forceful performance in two national debates.\nShe had killed on TV. But how would she do in a room?\nAt the Citadel military college, a poised Fiorina dazzled a packed audience as she held forth on military spending priorities, rattled off the names of world leaders and strategic locales, and name-checked “my good friend Bibi Netanyahu,” a firm nod of the head to emphasize each point. It was as if she had a teleprompter in her brain.\n“Are you reading the cards over my shoulder?” asked the clearly impressed moderator, a think tanker named Arthur Herman. “I do not want to play poker with you.”\nIt was a little joke, of course, and a well-timed one — finally, a comic breather from a discussion that could have been titled “Our Tragic and Dangerous World” — and the audience began to chuckle. Until Fiorina chimed back in.\n“You know, honestly, Christians are being driven from the Middle East,” she said leaning forward, looking grimly around the room. “And this administration is silent.”\nSo was the crowd.\nMissing a cue for some friendly banter is hardly a disqualifier for the most powerful office in the world, but it illustrates the strange and difficult balance that candidates running for president attempt to strike. Voters, we’ve been told, don’t just want a president who can name the leader of the Quds force in Iran, they want someone who can feel their pain. Someone to whom they’d happily hand their baby for a kiss, with whom they’d be glad to grab a beer.\nWhen Fiorina suddenly took off a couple of weeks ago, commentators started wondering whether she had a Mitt Romney problem. It was not just in the sense of the baggage from her corporate career (the 30,000 people she laid off at Hewlett-Packard, her swift dismissal as CEO, her $21 million severance package), but in the sense of: Will voters find her as aloof as they found him?\nFiorina visiting with a family on the street in Spartanburg, S.C. (Charles Ommanney/The Washington Post)\n“She has such a warm personality,” says a neighbor of Fiorina, seen here at Converse College, “and none of it came through in the debate.” (Charles Ommanney/The Washington Post) There are cottage industries and schools of thought devoted to helping stiff, brainy politicians ingratiate themselves with an emo electorate. For years we’ve watched the closely chronicled efforts of media gurus trying to make Al Gore seem looser, and then make Hillary Clinton seem warmer. ( “Hillary Clinton to Show More Humor and Heart, Aides Say,” the New York Times promised this month.)\n[ The making of Hillary 5.0: Marketing wizards help re-imagine Clinton brand ]\nFiorina is hardly alone on the Republican side for displaying a sometimes unnerving intensity. Sen. Ted Cruz has a nearly robotic ability to stay on message — so much so that even chatting with him off the record can feel like watching him on a debate stage in front of 23 million people.\nAnd of course, a little intensity can do a candidate a lot of good. Witness Jeb Bush, who has displayed a veteran pol’s avuncular ease on the campaign trail but lately has been accused of being “low energy,” in the words of rival Donald Trump.\nFiorina, 61, has built an entire career and image on her vaunted ability to take on difficult problems, do the unpopular thing, convince investors that she has what it takes to lead. It’s a persona that she hopes will make her seem decisive; and it’s also a trait that her opponents will take pains to portray as cutthroat. In the past, her opponents’ view prevailed. When she ran against Barbara Boxer in California for the U.S. Senate — her only previous foray into politics — Democrats eviscerated her with ads about her time at H-P, and she lost by 10 percentage points.\nFormer Hewlett-Packard chief executive Carly Fiorina is running for president as a Republican in 2016. Here's her take on the economy, religious freedom laws, Iran and abortion. (Sarah Parnass/The Washington Post) Of course, those who consider her a friend say that in real life, she’s a total sweetheart. When Patricia Tikkala learned that her neighbor across the street in Lorton, Va., was running for president, she had no trouble imagining her shaking hands and kissing babies across the heartland. The Carly Fiorina she knows cooks Christmas breakfast for the neighbors, sings to her dogs when she walks them and is married to the guy who plows the snowy streets every winter, just to be nice.\n[ Frank Fiorina: A regular guy tries on the role of campaign spouse ]\n“She has such a warm personality, and none of it came through in the debate,” Tikkala said.\nKaren Kohn Bradley, a movement analyst who has studied presidential candidates for several cycles, said that the way Fiorina comported herself on stage — little movement in her torso, a tight narrow smile — projected a sense of grounded power.\n“She is not a warm and fuzzy person,” said Bradley, an associate professor of dance at the University of Maryland. She doesn’t know her personally, but having watched her closely, that’s the vibe she says Fiorina gives to the public — “and I think that it’s what she has to do.”\nIt’s clearly worked so far. Perhaps the most indelible moment from the CNN debate was when a steely-faced Fiorina took on Trump, telling the real estate mogul that women everywhere heard him when he insulted her looks. When a red-faced Trump tried to say he found her beautiful, she didn’t even crack a smile. And while Trump has stumbled over answers to foreign-policy questions in debates and interviews, Fiorina’s fluidity in discussing specific proposals — such as rebuilding the Sixth Fleet in Europe — helps her sound tough and smart.\nFiorina projected a sense of grounded power on the debate stage, said one analyst. Here, the candidate waits to speak at a national security forum at the Citadel. (Charles Ommanney/The Washington Post) During her three days in South Carolina, audiences seemed smitten by her ability to answer every on-the-spot question as if she had had hours to rehearse.\n“She is clear in her message, she is concise in her message, and she has a plan,” said Jack Boyd, a fan who was standing in line for a meet-and-greet in Myrtle Beach.\nHe used his moment with her to say that the last time he met a presidential candidate here it was George H.W. Bush — and that he hoped she would have just as much luck.\nFiorina smiled, posed for a photo and waited for the next person in line.\nA visit to an anti-abortion pregnancy center in Spartanburg was structured less as a voter meet-and-greet and more as a photo-op to demonstrate Fiorina’s bona ­fides as one of the premier opponents of Planned Parenthood.\nStill, there was at least one voter in the room: the young woman with an exposed and gelled-up belly whose ultrasound Fiorina was there to witness. Ushered into the examination room, Fiorina deferred any small talk, turning away from the patient and smiling motionless for the cameras.\n[ That time Carly Fiorina campaigned at an ultrasound appointment ]\nIt was only after the photographers left and the network cameras came in that the small talk began. Fiorina asked the woman what she planned to name her baby, how well formed it looked at just 17 weeks.\nFiorina visits with patient Lacey Thomas at Spartanburg’s Carolina Pregnancy Center. She saved the chit-chat for after the photo-op. (Charles Ommanney/The Washington Post) It was a brisk exchange, but the pregnant woman, Lacey Thomas, was impressed. She said she would like to see a female president. Fiorina exited to address a crowd in another room: “The character of this nation cannot be about the butchery of babies for body parts,” she proclaimed with palpable anger.\nOn her final day in South Carolina, Fiorina headed to the all-women’s Converse College. During an intimate meet-and-greet that preceded her town hall event, she met with a handful of students in a yellow room with a fireplace and oil paintings on the wall. She told her now-familiar story about how she went from secretary to chief executive, advised the young women to find jobs in meritocratic fields and chastised the media for inventing a GOP “war on women.” Then she posed for photos.\n[ Fact Checker: Dissecting Carly Fiorina’s ‘secretary to CEO’ story ]\nKate Stevens, a 21-year old senior, had one question on her mind.\n“I kind of can’t stop wondering whether she cried when Donald Trump called her ugly,” she said. “That’s so mean! And she’s so strong. I just really wanted to know if she cried.”\nStevens decided against asking. She reasoned that women are held to a tough standard on these things. And something told her that Fiorina wouldn’t answer the question.\n“I felt she was as real as she could be, but I guess you just can’t really be candid as a political candidate,” Stevens said. “You have to be scripted.” What struck her was how much seeing Fiorina in person was like seeing her on TV.\n“Every hair is in place, her makeup is perfect, and she makes flawless eye contact that will stick with me for the rest of my life,” she said. “Every gesture was perfectly timed, even her leans forward when talking to us.”\nStill, she wished she could have seen something just a little more . . . human.\n“I should have asked if she cried,” she said.", "external_links": ["http://s3.amazonaws.com/posttv-thumbnails-prod/thumbnails/5543b95ae4b01160ff83e4f0/20150501_fiorina_inherownwords.jpg", "http://www.nytimes.com/2015/09/08/us/politics/hillary-clinton-to-show-more-humor-and-heart-aides-say.html", "https://twitter.com/@bterris"], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-29T17:15:11.120+03:00", "highlightTitle": ""}