{"organizations": [], "uuid": "1f1d7ffa8c7ea9616ddcc300df2c10a4d689e3d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30044774/expect-gasoline-electric-hybrids-as-the-new-normal", "country": "US", "title": "Expect Gasoline-Electric Hybrids as the New Normal", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Expect Gasoline-Electric Hybrids as the New Normal - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "1f1d7ffa8c7ea9616ddcc300df2c10a4d689e3d7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30044774/expect-gasoline-electric-hybrids-as-the-new-normal", "ord_in_thread": 0, "title": "Expect Gasoline-Electric Hybrids as the New Normal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Stratas Advisors\nStratas Advisors to Reveal Forecasts for the U.S. Automotive Industry\nHOUSTON , Sept. 16, New vehicle sales in the U.S. are expected to increase by 1 percent annually through 2035. The registered vehicle fleet will grow at a slower pace as younger millennials are less inclined to buy a car. These calculations come from a report to be released next week during a live webinar from Stratas Advisors , a global consulting and advisory firm.\nContinued advancements in gasoline engines' performance, coupled with battery electric power, are expected to provide the increased efficiency and emissions benefits U.S. regulators are now seeking.\n\"It's an option within certain models now, but consumers can expect all new vehicles will have gasoline-electric hybrids in the next 20 years,\" said Tammy Klein , Senior Vice President - Stratas Advisors . \"Breakthroughs for standard powertrains could change the demand for fuels and vehicles sold.\"\nNext week, Stratas experts will host a live webinar explaining these and more trends for the U.S. automotive industry. Refining and manufacturing industries also benefit from this knowledge. Findings are drawn from Stratas Advisors ' database of current and forecast fleet characteristics. The analysis integrates global factors such as economics, environmental policy, and energy composition along with consumers and industrial demand.\nWhat: Webinar detailing auto fleet trends\nDate: Monday, September 21, 2015\nTime: 8:30 - 9:30 a.m. CDT (U.S./ Houston ), 1:30 p.m. UTC /GMT\nThis webinar includes live presentations and a Q-and-A session. It will provide insight into:\nthe U.S. light-duty vehicle (LDV) market a short-term, seasonally adjusted view on sales long-term sales and fleet size powertrain technology trends the U.S. heavy-duty vehicle (HDV) market sales and fleet forecast the impact of efficiency regulations outlook for alternative powertrains Online registration is available for this live learning session.\nAbout Stratas Advisors\nStratas Advisors is a global consulting and advisory firm covering the full spectrum of the energy market - upstream, midstream and downstream - and related sectors, such as automotive, transportation, power, petrochemicals and heavy industries. The company also evaluates and assesses the impact of macro-level drivers including geopolitics, macro-economics and energy policies. Experienced Stratas analysts and consultants provide data, analysis and strategic insights to leading businesses, governments and institutions to identify, understand and monitor key drivers that shape future developments. This forward-looking perspective helps clients leverage opportunities, mitigate risks and implement strategies. Stratas Advisors, a Hart Energy company, is based in Houston, Texas and has offices in Brussels and Singapore . For information, visit StratasAdvisors.com\nContact :\nStephanie Palmer\ntel +1.713.260.4616\nLogo - http://photos.prnewswire.com/prnh/20150915/266952LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/expect-gasoline-electric-hybrids-as-the-new-normal-300143627.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=DA03054&Transmission_Id=201509161000PR_NEWS_USPR_____DA03054&DateId=20150916", "http://www.prnewswire.com/news-releases/expect-gasoline-electric-hybrids-as-the-new-normal-300143627.html", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20150915/266952LOGO", "https://stratasadvisors.com/Events/Webinars", "https://photos.prnewswire.com/prnvar/20150915/266952LOGO", "https://stratasadvisors.com/"], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T20:29:35.003+03:00", "highlightTitle": ""}