{"organizations": [], "uuid": "8370eea20ff76838c8706dfa6eef0fef8ac7a5e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/08/abu-Dhabi-airport.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/abu-dhabi-international-airport-records-highest-ever-passenger-traffic-in-august-2015/", "country": "US", "title": "Abu Dhabi International Airport records highest ever passenger traffic, in August 2015Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Abu Dhabi International Airport records highest ever passenger traffic, in August 2015Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "8370eea20ff76838c8706dfa6eef0fef8ac7a5e3"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/abu-dhabi-international-airport-records-highest-ever-passenger-traffic-in-august-2015/", "ord_in_thread": 0, "title": "Abu Dhabi International Airport records highest ever passenger traffic, in August 2015Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Abu Dhabi International Airport records highest ever passenger traffic, in August 2015 Published on : Monday, September 28, 2015\nAbu Dhabi Airports announced today that passenger traffic at Abu Dhabi International Airport increased by 17.4% in the month of August. announced today that passenger traffic at Abu Dhabi International Airport increased by 17.4% in the month of August. A total of 2,254,809 travelers passed through the capital’s gateway last month, compared with 1,920,934 in August 2014. This is the highest number of passengers in one month, in the airport’s history.\nThere was also an increase in aircraft movements, with 15,277, a 14.1% increase compared to August 2014. Cargo activity rose to 70,857 metric tons last month, registering a 7.0% growth on the figure for freight traffic for the same period last year.\nCommenting on the latest passenger figures, Eng. Ahmad Al Haddabi, Chief Operations Officer at Abu Dhabi Airports, said: “In the month of August we registered another record number in passenger figures at Abu Dhabi International Airport. For the second time ever we witnessed over two million passengers traveling through AUH in a single month. This spike in traffic is attributable to many residents returning home to the UAE from vacations, ahead of the beginning of the school year. Abu Dhabi is also increasingly being seen as a preferred tourism and business destination and this contributes directly to the growth we’re seeing year on year.”\n“In response to this, Abu Dhabi Airports has been implementing several initiatives to ensure that the airport continues to provide the facilities and services needed to manage the increased passenger and aircraft traffic. We are also paying extra attention to the peak travel season when passenger flow reaches its heights and the airport welcomes on average 70,000 passenger on a daily basis” added Al Haddabi.\nIn August 2015, the top five routes from Abu Dhabi International Airport were London, Bangkok, Doha, Manila, and Bombay. The top five routes accounted for 15% of all traffic.\nSource:-ADAC", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T10:33:25.404+03:00", "highlightTitle": ""}