{"organizations": [], "uuid": "e7cf21f6c999f403f54b18ad1a72082160efe8aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/travel.html", "section_title": "Travel", "url": "https://www.prbuzz.com/travel/347317-stockholmfreetour-com-offers-free-walking-tours-for-stockholm-tourists.html", "country": "US", "title": "StockholmFreeTour.com offers Free Walking Tours for Stockholm Tourists", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "StockholmFreeTour.com offers Free Walking Tours for Stockholm Tourists", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "e7cf21f6c999f403f54b18ad1a72082160efe8aa"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/travel/347317-stockholmfreetour-com-offers-free-walking-tours-for-stockholm-tourists.html", "ord_in_thread": 0, "title": "StockholmFreeTour.com offers Free Walking Tours for Stockholm Tourists", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stockholm, Sweden - Stockholm Free Tour is giving everybody, the world over a unique opportunity to have a first class Stockholm Tourism experience. Stockholm, the fastest rising star in tourism is gradually becoming Europe’s most preferred tourism destination. To get this unique opportunity, Stockholm Free Tour is organising a free walking tour of Stockholm.\nStockholm Free Tour’s Free Walking Tour, one of its most regular program aimed at educating and giving tourist world over, an opportunity to have a first-hand feel of Stockholm Tourism is at it again. This time around, the Company is organizing a Free and Private Walking Tour to educate the Tourists about Stockholm’s Tourism. Stockholm is an accident Scandinavian City as well as the Capital of Sweden. It’s been situated on fourteen islands gives it a unique place as no other city in Europe is so blessed that way. Stockholm is also blessed with three (3) powerful world heritage sites. These sites are UNESCO approved sites which every tourist who loves tourism and comes to the Free or Private walking tour in Stockholm will see and feel. The three UNESCO sites are Birka, Drottningholm Palace and The Woodland Cemetery.\nDuring the Free and Private Walking Tour of Stockholm, Stockholm Free Tour will help Tourists to see and go round Birka, one of Stockholm’s islands which was in the ancient times, the central hub and the most important marketplace in the entire Mälar Valley. Up till date, Birka still has a wealth of ancient remains that have been excavated and studied since the 19th century. It was put on UNESCO’s list of World Heritage Sites in 1993 and the site is ideal for Free or Private Tour during the walking tour of Stockholm. Drottningholm Palace is another ancient sites in Stockholm. It is one of Sweden's best preserved royal palace and it was constructed in the seventeenth century. During the Free and Private Tour, Tourist would be taking to the Palace. The Woodland Cemetery, is another place to be visited by all the participant. It was created around 1915-1940 and it’s about 250 acres. During the tour, tourist will be able to see and be educated on this ancient site.\nAbout Stockholm Free Tour\nStockholm Free Tour is a foremost Tourism Company which is based in Stockholm, Sweden. The Company organizes Free Walking Tours in Stockholm. It also organises Private Walking Tours for Private Tourists based on demand. Stockholm Free Tour has highly knowledgeable and intelligent guides as members of its staff who take time to educate each Tourist on Tourism in Stockholm.\nFor more details, go to http://www.stockholmfreetour.com\nMedia Contact\nLena Simpsson\nPhone: 07011001234\nAddress: Malartorget 13, 111 27 Stockholm, Sweden\nEmail: This email address is being protected from spambots. You need JavaScript enabled to view it.\nURL: http://www.stockholmfreetour.com", "external_links": [], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T19:41:54.400+03:00", "highlightTitle": ""}