{"organizations": [], "uuid": "a61b21ade7d1527cae355ad6d75c5f4526b1cc61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03276/family2_3276856k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-21.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/familyholidays/11554786/Top-10-Caribbean-family-holidays.html", "country": "US", "title": "Top 10: Caribbean family holidays", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Top 10: Caribbean family holidays - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T02:00:00.000+03:00", "replies_count": 0, "uuid": "a61b21ade7d1527cae355ad6d75c5f4526b1cc61"}, "author": "Telegraph Travel", "url": "http://www.telegraph.co.uk/travel/familyholidays/11554786/Top-10-Caribbean-family-holidays.html", "ord_in_thread": 0, "title": "Top 10: Caribbean family holidays", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hotels with a plethora of facilities and children’s clubs are the most popular Caribbean options for families (particularly all-inclusives), but villas (which often come with a housekeeper and a chef) are worth considering, too. It makes sense to keep flying time to a minimum by choosing a destination to which you can fly non-stop from the UK – this is the case for all the recommendations below. Unless stated, prices in this section are the lowest available for a family of four (children aged eight and 10) for seven nights, travelling during the school summer holidays 2016, sharing the cheapest type of suitable accommodation, and including economy flights and transfers. 1. Moon Palace, Jamaica Grande Ocho Rios in Jamaica has always offered good activities – climbing Dunn’s River Falls, flying down bobsleighs and zip lines, swimming with dolphins – so you can keep the family enthralled at Moon Palace Jamaica Grande ( palaceresorts.com ). This resort has yet more activities – for kids, a flow rider wave machine, mini-Olympics and movie nights – and for parents a spa and nightclub. Hayes & Jarvis (01293 735831, hayesandjarvis.com ) offers a week there all-inclusive, from £5,199 for a family of four, including $1,500 resort credit. James Henderson Ocho Rios, Jamaica 2. Villa Sariel, Antigua Villa Sariel is in the thick of the action above English Harbour in Antigua, so beaches, scuba-diving, boat trips and zip lines are close at hand – and the historic Nelson’s Dockyard with its child-friendly museum. Older children will enjoy the bars of the English Harbour strip. CV Villas (020 7563 7999; cvvillas.com ) offers a week at Villa Sariel from £3,164 including a six-day maid service.. James Henderson 3. Atlantis Paradise Island Resort, Bahamas Fancy a near-vertical waterslide in a faux Mayan temple first thing in the morning? Flying through a shark aquarium? Thing is, it’s most children’s idea of a perfect holiday. And it’s among the million and one activities at Atlantis Paradise Island Resort ( atlantisbahamas.com ) in the Bahamas. A family trip with Bahamas Flavour (08700 669975; bahamasflavour.co.uk ) costs from £3,900. James Henderson • Caribbean travel guide 4. Beaches Turks & Caicos If you’re after a large and lively all-inclusive hotel with a host of family-oriented facilities on a fantastic beach, then Beaches Turks & Caicos ( beachesresorts.co.uk ) should fit the bill nicely. It backs directly on to Providenciales’ Grace Bay, a 12-mile-long white-sand beach that is one of the Caribbean’s very best. Entertainment comes in the form of six swimming pools, a pirate-themed water park, an Xbox Play Lounge, a DJ academy, children’s clubs and plenty of watersports. Booked through Kuoni (01306 747008; kuoni.co.uk ): from £6,979 all-inclusive. Fred Mawer Fun and games in Jamaica 5. Windjammer Landing, St Lucia With zip-lining adventures, rainforest hikes and excellent off-the-beach snorkelling, St Lucia is a great choice for families seeking more than just a beach. An excellent choice of base is Windjammer Landing ( windjammer-landing.com ). The Mediterranean-looking complex is a “villa hotel”: the accommodation mostly comprises villas and suites with kitchens, but you also have several (good) restaurants on site, along with the well-regarded Jacquot Fun Club children’s club for 4-12 year-olds, a Teen Club and watersports galore. Booked through Trailfinders (020 7368 1200; trailfinders.com ): from £3,396 for a one-bedroom villa. Fred Mawer • St Lucia travel guide 6. Dreams Palm Beach, Dominican Republic For a beach-oriented family break that is affordable by Caribbean standards, consider the Dominican Republic – as long as you’re happy to be based in an all-inclusive hotel. Most of the best properties back on to the miles of fantastic, white-sand beach at Punta Cana. The high-quality Dreams Palm Beach Punta Cana ( dreamsresorts.com ), behind a reef-protected section of beach, offers children’s clubs, evening movies on the sand and (for a large all-inclusive hotel) excellent food in a wide choice of restaurants. Booked through First Choice (0871 200 7799; firstchoice.co.uk ): from £3,852 all-inclusive. Fred Mawer A resort in Punta Cana 7. Beach View, Barbados Barbados is family-friendly: the calm sea off the west coast, where most of the best places to stay are located, offers safe swimming and watersports, and excursions include a submarine trip, underground caves and a wildlife reserve. I’ve had a great time with my family at Beach View ( beachviewbarbados.com ), a well-run, all-apartment hotel on the west coast. The 36 apartments are spacious and practical (think well-equipped kitchens, washing machines), and overlook a large pool area. Paynes Bay, across the road, is one of the island’s best beaches. Booked through Virgin Holidays (0844 557 3859; virginholidays.co.uk ): from £4,738 room only in a two-bedroom apartment. Fred Mawer • Barbados travel guide 8. Plantation Beach Villas, Tobago, Trinidad & Tobago This gentle tropical island is a good choice for some family downtime with nature providing the attractions. Activities such as rainforest hikes, turtlewatching and snorkelling can be mixed with visits to the British-built Fort King George and the Tobago Cocoa Estate where you can learn how chocolate is made. Sleeping up to six, the three-bedroom, colonial-style Plantation Beach Villas ( plantationbeachvillas.com ) are near to the beach with a communal pool – an ideal base if you're travelling with older children or other family members. Booked through Just Tobago (01373 814234; justtobago.co.uk ): from £4,070, room only. Nigel Tisdall 9. Nonsuch Bay, Antigua With a fleet of sailing craft and a sailing school offering instruction to all ages and abilities, Nonsuch Bay ( nonsuchbayresort.com ), set on a reef-protected bay in Antigua, is a great choice for yachty families. Kitesurfing is a big draw too. Accommodation comes in the form of family-friendly apartments, cottages and villas, all with fully-equipped kitchens. From £3,836, room only, when booked through Caribtours (020 7751 0660; caribtours.co.uk ). Watersports extra. Fred Mawer • Antigua travel guide 10. Villa holiday, Barbados Barbados has one of the widest choices of high-quality villas to rent of any Caribbean island. Most of the best properties are on or near the upmarket west coast. Some rentals are silly money, but others are relatively affordable in the low-season summer months. Booked through island-based rental agency Blue Sky Luxury (0800 088 5574; blueskyluxury.com ), Whitecaps, a colourful three-bedroom cottage on Mullins Beach, costs around £1,203 for a week between mid-April and mid-December 2016, and the price includes the services of a cook and housekeeper (price for rental only). Fred Mawer This article was first published on April 22, 2015, and updated on September 21, 2015 Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-09-22T02:00:00.000+03:00", "crawled": "2015-09-21T20:35:21.645+03:00", "highlightTitle": ""}