{"organizations": ["Sony", "First Choice of City Dwellers City", "First Choice of City Dwellers Airwheel"], "uuid": "d65fa253fb69ca15b9be9e017b2bae1bff62eae1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/airwheel_golden_technologies_self_balancing_scooter_the_first_choice_of_cit/", "country": "US", "title": "Airwheel golden technologies Self-balancing Scooter : the First Choice of City Dwellers", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Airwheel golden technologies Self-balancing Scooter : the First Choice of City Dwellers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T00:23:00.000+03:00", "replies_count": 0, "uuid": "d65fa253fb69ca15b9be9e017b2bae1bff62eae1"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/airwheel_golden_technologies_self_balancing_scooter_the_first_choice_of_cit/", "ord_in_thread": 0, "title": "Airwheel golden technologies Self-balancing Scooter : the First Choice of City Dwellers", "locations": ["USA"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Airwheel"], "text": "Airwheel golden technologies Self-balancing Scooter : the First Choice of City Dwellers City dwellers are faced with many challenges in their daily life. They really need a good helper and Airwheel scooter is exactly a good assistant. USA, 10 September 2015 -- With the rapid development of modern cities, people living in the cities are facing a lot of pressure. The biggest pressure comes from the high housing price. Compared with country residents who could live in a spacious house with a big yard, city dwellers could only dwell in a small and crowded apartment. Moreover, they are busy in earning their living so that it’s hard for them to spare some time to do some exercise. What’s more? Although the transportation in the city is more convenient than that in the country, it is more crowded. It is quite annoying for them to stand all the way on the bus between home and office. Some even frequently hurry to catch a bus, yet still is shut out of the door. However, one fortunate thing is that the Airwheel electronic scooter can help those city dwellers ease these issues.Why is the Airwheel electronic scooter able to help city dwellers live a better life? It is because the Airwheel electronic self-balancing scooter is both a good tool of transportation but an amazing facility of exercise. Take an Airwheel Q6 as an example. This vehicle is small and exquisite in its appearance so that it can be easily carried into the subway, bus, office and home. It saves a lot of time on one’s way to work or back home. With this lovely machine, city dwellers don’t have to worry about being late again. Although most of Airwheel products are small and light, they are actually very powerful. The Sony battery is featured with 1,800 recharge time, 3.8 times life expectancy and 2.9 times duration of the ordinary lithium battery. Moreover, it has a better charge capacity for longer range. It only takes 80 mins to get the scooter 80% charge, which considerably saves people’s time. Most importantly, it is very safe. It has fuzzy software algorithm and gyroscope system to maintain balance by leaning forward and backward. It will give people a safe journey. The Airwheel self-balancing scooter for can really add colours to the daily life of city dwellers. Choose your scooter, choose your own lifestyle. # # #", "external_links": [], "published": "2015-09-10T00:23:00.000+03:00", "crawled": "2015-09-11T03:28:25.724+03:00", "highlightTitle": ""}