{"organizations": ["LVMH"], "uuid": "415e47e44a10e51a54d2fbe114600bc646865f1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/cda65ffa-40bd-4c08-b97e-428615863fc9.img", "site_section": "http://www.ft.com/rss/companies/travel-leisure", "section_title": "Travel & Leisure", "url": "http://www.ft.com/cms/s/0/25bf5082-522d-11e5-8642-453585f2cfcd.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "country": "US", "title": "Net-a-Porter boss quits before Yoox deal", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Net-a-Porter boss quits before Yoox deal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T18:58:00.000+03:00", "replies_count": 0, "uuid": "415e47e44a10e51a54d2fbe114600bc646865f1b"}, "author": "", "url": "http://www.ft.com/cms/s/0/25bf5082-522d-11e5-8642-453585f2cfcd.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Net-a-Porter boss quits before Yoox deal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "LVMH’s strong quarter beats expectations \nMs Massenet, who founded Net-a-Porter in 2000 — the same year that Federico Marchetti set up Yoox — had stayed at the helm of the business after selling it in 2010 to Switzerland’s Richemont in a deal that valued the London-based group at £350m. \nBut her decision to refrain from taking up the executive chairman role at the newly-merged group — Richemont agreed in April to sell Net-a-Porter to Yoox for shares — bears the hallmarks of a personality clash. \nMs Massenet said in a statement on Thursday morning: “Having joined forces with Yoox group, the company will be bigger, stronger and superbly well-positioned under Federico’s leadership to lead the industry and create the future of fashion.” \nIt was Mr Marchetti who had described the merger as “perfect” — through the creation of the world’s largest online retailer focused on luxury brands. At that time, Ms Massenet was “looking forward” to their future and ebullient about the group’s conjoined power to “create the future of fashion”. \nHowever, the corporate marriage between the quiet, autodidactic Italian tech entrepreneur Mr Marchetti and the flamboyant, charismatic former journalist Ms Massenet, who is also president of the British Fashion Council, raised eyebrows as soon as the deal was struck. \n“She’ll have resigned by Christmas,” said one person familiar with the situation on the day of the merger announcement. Many fashion insiders agreed that her resignation was only a question of time.​ \nFurther cause for speculation followed in May, when, during a lunch with the FT, Mr Marchetti reiterated his ultimate control of the group, as well as the pair’s strikingly different managerial styles. \nPointing out that there would be only one boss of the new group “and that’s me”, he went on to describe himself as unpopular at Yoox, which runs ecommerce sites for Giorgio Armani, Valentino and Ermenegildo Zegna, along with the brands of Gucci owner, Kering group as well as its own retail platform. More video \n“They don’t like me,” he said of his colleagues. “But that’s OK. I don’t need them to like me.” \nHis bullish attitude stood in stark contrast to the culture of shared passion engendered by Ms Massenet at Net-a-Porter, where her popularity and charismatic leadership style were considered integral to the company’s success. \nHer sororal cheerleading spirit seemed at odds with Mr Marchetti’s results-driven dogmatism — the day after the Lunch with the FT interview appeared in print, she posted on Instagram an image of a heart captioned with an entreaty to be nice to one another. The image was subsequently removed. \nLombard: Natalie nets a corker \nEntrepreneurs who rightly admire Natalie Massenet’s achievements should instead focus on her leaving cheque, says Jonathan Guthrie . \nContinue reading \nWhile the merger is not jeopardised by Ms Massenet’s departure — and, indeed, Yoox shares rose 5 per cent on Thursday — her absence leaves the group far more vulnerable, partly because of the loss of her networking skills in the world of design. \nIn conversations with the FT this year, many British-based designers, among them Erdem Moralioglu, Christopher Kane, Roksanda Ilincic, Roland Mouret and Victoria Beckham have testified to her vital role in helping steer their brands into profitable international fashion ​houses. \nThose relationships, developed over her 15 years at Net-a-Porter, may prove near impossible to replicate, and much of the lustre, glamour and élan she brought to the company leaves with her. \nMoreover, while the Yoox-Net merger creates a business with a market value of £2.3bn and the biggest fashion e-commerce site in the world, Net looks increasingly vulnerable within the fast-emerging digital landscape. \nApple’s Ian Rogers has just been appointed head of digital strategy by LVMH, which suggests the luxury giant is at last preparing to launch comprehensively into the e-commerce sector. And Condé Nast will soon unveil its newly branded style.com, a luxury e-commerce platform in which the company is reputedly investing £100m. \nWhat next for Ms Massenet? She sits on a sizeable fortune. \nShe was reported to have earned £50m from the initial sale of Net-a-Porter to Cartier owner Richemont in 2010. Now, she stands to receive a payout of more than €100m, according to FT calculations. \nTo walk away from her “baby” must have been difficult, nonetheless, especially since she has occupied a near-unrivalled position of authority and influence within the industry for years. \n“As for my own future, my entrepreneurial drive is as strong today as it always has been, and my passion for innovation will continue to be my guide in business,” wrote Ms Massenet in her statement. \nSome of the wilder speculators have suggested that her departure may see her returning to publishing: Net-a-Porter’s bimonthly print magazine Porter recently won Print Product of the Year at the British Media Awards, and she has made no secret of her passion for journalism and editing. \nCould a move back to Condé Nast, where she once worked on Tatler, be on the cards? It’s tempting to see a directorial role for the tech entrepreneur at a company currently reinventing itself as a digital player. We watch this space. Related Topics", "external_links": [], "published": "2015-09-03T18:58:00.000+03:00", "crawled": "2015-09-04T03:00:56.868+03:00", "highlightTitle": ""}