{"organizations": [], "uuid": "5a42b70e842303f4eafc74f495f399be181ce32d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/06/royal-caribbean-int.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/agents-go-for-gold-and-jump-onboard-the-virtual-queue-as-club-royal-celebrates-first-birth-day/", "country": "US", "title": "Agents Go For Gold And Jump Onboard The Virtual Queue As Club Royal Celebrates First Birth DayTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Agents Go For Gold And Jump Onboard The Virtual Queue As Club Royal Celebrates First Birth DayTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "5a42b70e842303f4eafc74f495f399be181ce32d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/agents-go-for-gold-and-jump-onboard-the-virtual-queue-as-club-royal-celebrates-first-birth-day/", "ord_in_thread": 0, "title": "Agents Go For Gold And Jump Onboard The Virtual Queue As Club Royal Celebrates First Birth DayTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Agents Go For Gold And Jump Onboard The Virtual Queue As Club Royal Celebrates First Birth Day\nRoyal Caribbean International has announced the addition of a new ‘Gold Card’ membership tier to celebrate the first birthday of Club Royal, its industry-leading reward and recognition programme for travel agents. The birthday celebrations also marked the\nlaunch of a unique ‘Virtual Queue’ competition, which gives agents the opportunity to secure their place on an exclusive two-day sailing on Harmony of the Seas.\nThe new incentives were unveiled last night at a ‘Glam & Gold’ party attended by 100 agent partners to mark the scheme’s huge success, which in the space of just 12 months has built a membership of nearly 6,500 and rewarded bookings made on more than 50,000 Royal Caribbean holidays.\nThe announcement signifies Royal Caribbean’s continued investment in its travel agent\npartners, which in the last year has included increasing the size of the sales team and investing in a new vehicle fleet to drive agent relations and capitalise on a strong and growing network.\nGoing for gold! Club Royal members earning over £1,000 in rewards will now join an elite Gold Card tier, receiving a new, gold branded MasterCard® with £300 to spend on a personal cruise and a £25 birthday bonus.\nAdditional benefits include invitations to exclusive events and inaugurals, plus ten places on a Club Royal Panel with Royal Caribbean’s Managing Director UK & Ireland, Stuart Leven and Sales Director UK & Ireland, Ben Bouldin. Gold Card members will be required to make a set number of bookings a year in order to remain in the elite tier.\nGet to the front of the ‘Virtual Queue’ for Harmony of the Seas’ launch As Royal Caribbean counts down to the arrival of its exciting, new ship, Harmony of the Seas, the company is launching its biggest-ever trade competition. For the chance to win one of 1,000 places on an exclusive two-day sailing on the new ship, Club Royal members simply need to submit a picture of themselves on the dedicated uk and engage with Royal Caribbean via bookings and interactions on social media to make their way up a virtual queue and secure their spot on the guestlist. The top 500 agent partners in the queue at the competition’s close on 1 March 2016 will scoop a much-coveted ticket for them and a guest onboard Harmony of the Seas.\nBen Bouldin, Sales Director UK and Ireland said, “Travel agents are hugely important to us and their loyalty underpins our success. We’re investing in our relationships with agents and growing our sales team to support our growth aspirations.”\n“Club Royal is a major part of this initiative. It already rewards loyalty in a way that no other programme in the industry does, but we’re enhancing it even further because we want to recognise those agents working hard on our behalf as best we can.”\nClub Royal is open to all travel agents achieving ‘Captain’ status on Royal Caribbean’s elearning programme, ‘Cruising for Excellence’. It offers members rewards for every booking made, directly uploaded onto a prepaid branded MasterCard®, with other incentives including unique opportunities such as invitations to inaugural sailings, or Red Letter Day discounts and benefits.\nSource:- Royal Caribbean", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T11:37:21.112+03:00", "highlightTitle": ""}