{"organizations": [], "uuid": "f952494ca35263635e34013aad527f06abbad156", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gocaribbean.about.com", "main_image": "http://f.tqn.com/y/gocaribbean/1/S/w/b/-/-/schoolsupplies.jpg", "site_section": "http://z.about.com/6/o/m/gocaribbean_t2.xml", "section_title": "About.com Caribbean Travel: What's Hot Now", "url": "http://gocaribbean.about.com/od/beforeyougo/fl/Pack-for-a-Purpose.htm", "country": "US", "title": "Make your extra luggage space count on your...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Make your extra luggage space count on your...", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T14:05:00.000+03:00", "replies_count": 0, "uuid": "f952494ca35263635e34013aad527f06abbad156"}, "author": "", "url": "http://gocaribbean.about.com/od/beforeyougo/fl/Pack-for-a-Purpose.htm", "ord_in_thread": 0, "title": "Make your extra luggage space count on your...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Articles and Resources © Morgan/CC by 2.0 \nWe've all done it -- left a little space in our luggage for the inevitable souvenirs we bring back from the Caribbean. It's a great plan, but here's an even better one: fill that space with items you can donate to worthy charities when you arrive in the islands, and you can leave with both those prized keepsakes and the satisfaction that you've done some good while on your vacation. \nPack for a Purpose , a nonprofit group that supports charities in the areas of child welfare, health, education, animal welfare, and socioeconomic development, works with resorts and charities around the world , including in the Caribbean. The group encourages travelers to bring up to 5 pounds of goods to donate when they arrive in their destination -- exactly what is needed depends on where you are going. \n“When travelers choose to ‘Pack for a Purpose,’ they make a big impact,\" says Rebecca Rothney, the group's founder and chairperson. \"This simple, easy, and meaningful experience enriches both the traveler and the community at the traveler’s destination. I like to think of ‘Packing for a Purpose’ as taking the perfect hostess gift, a way to express your gratitude for the hospitality you receive.” \nThe group makes it easy for travelers to do good: Pick a destination (the group works in 16 Caribbean nations ) Find an accommodation and a project it supports. More than 60 Caribbean resorts participate, including all Sandals resorts and such other well-known properties as Necker Island in the BVI , the Bucuti and Tara Beach Resorts in Aruba , and GolderEye, Half Moon, and Jake's in Jamaica . Choose the supplies you wish to take from the specific items requested. Drop off the supplies at the accommodation or tour company, who will deliver them to their charitable partner organization. \n\"Pack for a Purpose is easy. It’s smart. It matters,\" says Cathy Decker, a New York based public-relations executive who has organized voluntourism trips to the Caribbean. Decker's clients include Sandals Resorts International, which backs the Sandals Foundation , a key Caribbean partner of Pack with a Purpose. \n\"Guests have really embraced Pack for a Purpose and other voluntourism programming available through the Sandals Foundation,\" says Decker, whose teen daughter, Caroline, recently took part in the Beaches Resorts’ Teen Advisory Panel. The panel launched Teen Impact , a new “volunteenism” program that gives teens the chance to earn community service hours while on vacation with their families. \n\"Pack with a Purpose is part of the program: In this instance, since school starts in September, teens were encouraged to bring much-needed school supplies,\" Decker says. \"Caroline packed pens, pencils, erasers, rulers, notebooks, kids’ scissors, colored pencils and colored paper. Gently used books or new books were also welcome.\" \n“It was the one thing I prepared for before we left that wasn’t about me,\" says Caroline. \"It makes vacation meaningful and makes me connected to the kids here, and when I get back, I’ll remember that there are kids enjoying the things I brought.” \nPack for a Purpose also encourages travelers to donate school supplies in the Dominican Republic , Jamaica, Turks & Caicos , and Dominica , including books for Dominica's “Open Books, Open Minds – Leave a Book Behind” program (donations to Dominica are especially critical in the wake of widespread devastation caused by Hurricane Erika in August 2015). \nWhat kind of supplies? Needs vary by location, but by way of example, the Frangipani Beach Resort in Anguilla asks guests to support the Blowing Point Youth Development Center with donations of: General School Supplies: Colored Construction Paper, Colored Pencils, Compasses, Crayons, Dry-Erase Markers, Electric Pencil Sharpeners, Erasers, Glue Sticks, Hand Puppets, Markers, Pencils, Pens, Play-Dough, Protractors, and Solar Calculators Flash Cards: (English) Alphabet, Math, and Word Wall Charts: (English) World Maps and Atlases Text/Reading Books: (English) Age Appropriate Story Books (especially for boys) and Language/Grammar Art Supplies: Craft Scissors and Watercolor Paints and Brushes Computer Hardware/Software: Blank CDs, DVD Movies and Games (Educational and/or for Entertainment), Flash Drives/Memory Sticks, Printers, Portable Computer Speakers, Working Digital Cameras, and Working Video Cameras Sports/Outdoor Activity: Table Tennis Rackets and Balls \nOther resorts request a variety of donations, ranging from Band-Aids and feminine sanitary products to musical instruments and linens -- all easily packed into a corner of your suitcase. \nCaribbean resorts and programs that participate in Pack for a Purpose include:", "external_links": [], "published": "2015-09-04T14:05:00.000+03:00", "crawled": "2015-09-05T03:26:51.133+03:00", "highlightTitle": ""}