{"organizations": ["FAA", "Department of Transportation", "Federal Aviation Administration"], "uuid": "9acf7a10a5b795f3245ff4fd1997269a6b54a5fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/186", "section_title": "Artipot: Travel > Air Travel Articles", "url": "http://www.artipot.com/articles/1934852/pilot-training.htm", "country": "US", "title": "Pilot Training (Roshan Augustin)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "Pilot Training (Roshan Augustin)", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T10:03:00.000+03:00", "replies_count": 0, "uuid": "9acf7a10a5b795f3245ff4fd1997269a6b54a5fb"}, "author": "", "url": "http://www.artipot.com/articles/1934852/pilot-training.htm", "ord_in_thread": 0, "title": "Pilot Training (Roshan Augustin)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Roshan Augustin", "Roshan Augusin"], "text": "By Roshan Augustin Sep 18, 2015 It may have been your childhood dream to fly an aircraft. Becoming a pilot requires a lot of determination, training and hard work. It is essential to have a good flight instructor who can coach you in all aspects of aviation. You would need to rent an aircraft to take flying lessons. Your dream of conquering the skies can become a reality provided you put in the required effort and adhere to the instructions provided by your instructor. In addition to learning to control the aircraft there are a lot of technical aspects you need to learn in order to become a pilot. Pilot certification is essential to operate an aircraft. This is regulated by the Federal Aviation Administration (FAA) which is a branch of Department of Transportation (DOT). A pilot certificate issued by FAA is evidence that a person is authorized to engage in flight activities. The different licenses issued are as following.1.0 Student Pilot: issued to an individual who is learning to fly under the instructions of a flight instructor.2.0 Sport Pilot: issued to an individual who is authorized to fly only Light Sport Aircraft.3.0 Recreational Pilot: issued to an individual to fly up to 180 horse power aircraft and up to four seats in day time for pleasure only.4.0 Private Pilot: issued to an individual who may fly for pleasure or personal business usually without any pay.5.0 Commercial Pilot: issued to an individual who under certain restrictions can fly for pay.6.0 Airline Transport Pilot (ATP): issued to an individual who is authorized to act as pilot for a scheduled airline. Pilots are rated into different aircraft categories like Airplane, Rotorcraft, Glider, Lighter than air, Powered Lift, Powered Parachute and Weight Shift control. These categories could further be divided into classes and a pilot must hold a class rating to operate an aircraft in that class. There is no category or class rating for a student pilot. A type rating is required if the air craft weighs more than 5,7 00 Kg at takeoff or is powered by one or more turbojet engines. An instrument rating can be added to a private or commercial certificate to legally operate under instrument flight rules (IFR). Only one pilot certificate can be held at one time. However that certificate may be endorsed by multiple privilege levels distinguished by aircraft category. Limitations may be imposed by FAA if during training or practical test the pilot fails to demonstrate all skills necessary to exercise for a certain privilege level, category class or type rating. Pilots undergo flight training under a flight instructor who may be employed by a flight school. Colleges and Universities offer a aviation major as part of the undergraduate education. Student pilots are required to pass a knowledge test also called the written test the results of which are valid for a period of 2 years and are a pre-requisite for practical tests. To take knowledge tests the applicant must have a sign off from a ground or flight instructor for all pilot certificates and ratings. These are given by a flight instructor who has assessed the student's preparedness or has taught him a ground school course. Practical test is required for all pilot certificates and ratings. This is usually called a check ride. The FAA publishes a Practical Test Standards document for each practical test. This outlines the scope for the applicant to study, the flight instructor to teach and evaluate against and for the examiner to use to conduct the exam. The practical test is conducted by an FAA Inspector or an FAA Designated Pilot Examiner. The practical test is composed of two parts. First there is an oral exam which is followed by a flight test in the aircraft. For all practical tests it is essential for the applicant to have proper logbook endorsements from their flight instructor. JetEXE has a flight training school which has earned an outstanding reputation for the excellent training they provide. Their costs are low and their reputation is top class. They have all the programs whether you want to become a Private pilot, Sport pilot or a Commercial pilot. They have numerous types of aircrafts which you can choose from to rent. Their instructors are the best and can equip you with all the preparedness needed for you to obtain the level and type of pilot certification you need. Visit them at www.jetexe.com and explore the wonderful world of aviation through them.For more information visit: www.jetexe.com About the Author I'm Roshan Augusin, a person that really likes technology, design, photography, Fitness and creativity. I try to bring only the Better stuff for you... and hope that all of you enjoy my posts! Rating:", "external_links": [], "published": "2015-09-18T10:03:00.000+03:00", "crawled": "2015-09-18T12:08:55.814+03:00", "highlightTitle": ""}