{"organizations": [], "uuid": "0fa7ccf96cd8c409253fe0272e69880829118e3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bootsnall.com", "main_image": "", "site_section": "http://feeds.bootsnall.com/bna/articles/", "section_title": "BootsnAll Travel Articles", "url": "http://www.bootsnall.com/articles/08-10/10-most-shark-infested-beaches-world.html", "country": "US", "title": "Top 10 Shark Infested Beaches in the World", "performance_score": 0, "site": "bootsnall.com", "participants_count": 1, "title_full": "Top 10 Shark Infested Beaches in the World", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T11:03:00.000+03:00", "replies_count": 0, "uuid": "0fa7ccf96cd8c409253fe0272e69880829118e3d"}, "author": "admin", "url": "http://www.bootsnall.com/articles/08-10/10-most-shark-infested-beaches-world.html", "ord_in_thread": 0, "title": "Top 10 Shark Infested Beaches in the World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top 10 Shark Infested Beaches in the World By Julie Blakley on September 2nd, 2015 Even before Jaws popularized the image of a giant man-eating shark terrorizing an entire town and eating anything and everything in its path, people have long been scared of sharks. And, honestly, rightfully so. I mean, what could be scarier than a man-eating fish? A swimming monster lurking in the water, waiting to attack with its mouth full of razor-sharp teeth? That’s just plain terrifying. Or, at least that’s what people imagine when they think of shark infested waters. Sharks have long captured the imagination and fascination of humans. Looking at RTW Airfare? Download the Free RTW Airfare Report Here > Steven Spielberg made millions by playing off people’s fear of sharks in Jaws, and while the story of the man-hunting shark that eats anything in its path (docks, boats, people) was fictional, the movie was actually based on a string of real-life shark attacks that occurred off the coast of New Jersey in 1916. Today, real-life stories of surfers losing limbs to shark attacks and bathers disappearing off shark infested coastlines still transfix us. There is just something so intriguing, albeit terrifying, about a giant, predatory fish lurking in ocean waters. From the dorsal fin protruding from the water, to its mouth full of piercingly sharp teeth, these maritime monsters have become an iconic and much feared animal\nWhile sharks are great at invoking fear in movie audiences, the actual likelihood of getting attacked by a shark is kind of like getting struck by lightning and winning the lottery at the same time. In fact, the International Shark Attack File (ISAF) reports that more people die each year from bees, wasps, snakes and drowning than by shark attack. With relatively low numbers of attacks around the world, beach goers are much more likely to become victim to rip currents, jelly fish or a strong tide than a hungry shark. “…the International Shark Attack File (ISAF) reports that more people die each year from bees, wasps, snakes and drowning than by shark attack.” However, the animal has inspired a hugely popular week of television on the Discovery channel (“Shark Week” always boasts incredibly high ratings) and no one seems to tire of stories about shark infested waters and gruesome shark attacks. Want to know where sharks like to hang out before you get in the water? Here is a list of the ten most shark infested beaches in the entire world. Gansbaai, South Africa (a.k.a. “Shark Alley”) Great white sharks are probably the most visually intimidating shark out there. With their giant mouths and, beady eyes and razor-sharp teeth, these animals have inspired fear and admiration from many. A popular holiday resort and fishing town in South Africa, Gansbaai is also the great white shark capital of the world. In fact, there are so many of the famed and notoriously frightening great white sharks in the narrow sea channel between Geyser Rock and Dyer Island (known as Shark Alley), that shark cage diving has become a popular tourist attraction here. Many visitors come to Gansbaai just for the sharks.\nFor a few hundred dollars, companies will take you out on boats to the shark infested waters, submerge adventurous divers in a cage and dangle prey waiting for a great white to approach the cage full of divers. If this shark adventure is a little too Steve Irwin for your taste, than there are many boat tour companies that will take you to Shark Alley and simply allow you to watch sharks feasting on the local seal population from the deck of the ship. Either way, with great whites infesting these waters in the greatest numbers in the world, Gansbaai is certainly no place for a casual dip in the ocean. \n>> Read more about shark diving in South Africa Kosi Bay, Kwa-Zulu-Natal, South Africa Another shark infested location in South Africa, Kosi Bay is a picturesque and dramatic series of four lakes in the preserved KwaZulu Natal which connect to the Indian Ocean. Known for its unspoiled beauty, the bay is also famous for its Zambezi sharks, or Bull sharks, which are known to swim into freshwater lakes and estuaries in search of food.\nIf you thought great whites were terrifying, think again. Zambezi sharks are not only the most aggressive of all sharks, they also have the ability to swim deep inland by way of lakes and rivers. In fact, not only are these sharks found in plenty in Kosi Bay, they have been spotted swimming as far from the ocean as Ohio up the Mississippi River in the U.S. That’s right, sharks in lakes. And rivers. Makes my skin crawl just thinking about it. \n>> Discover eight excellent experiences in South Africa New Smyrna Beach, Florida, USA What do you get when you combine shark infested Atlantic waters and lots of vacationing beach-goers? The shark attack capital of the world. In New Smyrna Beach, Florida sharks are known not only to accidentally bite humans, but also bump into them from the waves. The waters off this popular beach resort town in east-central Florida are home to a great number of tiger, blacktip and spinner sharks. “The shark attack capital of the world.” While these sharks are not as aggressive as bull or great white sharks, they have still been known to attack humans by accident. A floating surfer also looks a whole lot like a turtle or other prey from below the surface. Add to the mixture a huge number of people in the water almost year-round in this popular beach resort and you get a recipe for lots of shark attacks. In fact, more people have been attacked by sharks off the coast of New Smyrna than in any other place in the world. While chances are you could swim or surf in these waters everyday and still not get attacked, I might think twice before heading out into the waters here.\n>> Read more about beaches in Florida Bolinas, California A small beach enclave located in Marin County in northern California, Bolinas is known for its reclusive residents, utopian seaside vibe and, well, great white sharks. In an area known as the “Red Triangle” in Northern California (which includes Bolinas and nearby Stinson Beach), great whites are known to patrol the waters in large numbers. In 2002, a 12-14 foot great white shark lunged from the water and clenched a screaming, 24 year-old surfer in its jaws. The man, who survived the attack, needed 100 stitches to close his 4 bite wounds and is not the first (nor the last) surfer to be attacked along this stretch of coast in California.\nSurfers along this stretch of coast are already tough for braving the cold waters, but are doubly courageous for braving the sharks. Plus, the wet suits necessary in Bolinas make surfers look a whole lot like a great white’s favorite meal–sea lion. Recife, Brazil Sometimes called the Venice of South America, this seaside town on the Atlantic coast of Brazil has the perfect urban beach with gentle seashore breezes, endless days of sunshine and… sharks. Lots of them. Since 1992, there have been more than 50 shark attacks, 16 of them fatal, along a 20 kilometer stretch of coast near Recife, Brazil. This makes Recife the most fatal place for shark attacks in the world, where about 1 in every three attacks ends in death. Because of the concentration of the aggressive and dangerous bull sharks here in Brazil, this beach has earned a reputation as the most deadly shark attack spot in the world. Sounds like it might be a better idea to concentrate on your tan here than think about getting in the water.\n>> Check out other places to go in Brazil Lake Nicaragua, Nicaragua No, you aren’t reading the heading wrong. The next shark infested destination on our list is in fact a lake, the largest one in Central America to be exact. Bull sharks, as previously mentioned, are known for their aggressive and unpredictable behavior as well as their ability to tolerate fresh water. For years, scientists did not understand how the sharks ended up in the freshwater lake in Nicaragua. They assumed the sharks must have been trapped there centuries ago. However, in the 1960s, scientists found that these ferocious sharks jumped upstream the San Juan River much like salmon.\nWhile there have not been a large number of attacks on humans by bull sharks in this lake, any shark swimming around in a lake is doubly terrifying, convincing me to stay well out of the water in this Central American lake. \n>> Book a Nicaragua adventure tour Bondi Beach, New South Wales, Australia Any place that has placed protective nets to help keep sharks away from ocean bathers has got to have a lot of sharks, and this beach on the eastern coast of Australia certainly does. Recent attacks have pushed this beach high onto many lists as one of the most shark infested beaches in the world. In 2006, a young woman was attacked and killed by three bull sharks just north of this beach. In 2008, a 16 year-old bodyboarder was mauled and killed by a bull shark here also. Months later a surfer and two divers also had close run-ins with the predatory fish in the same waters. Luckily, they lived to tell the tale.\nWith lots of sharks and lots of people in the water, this eastern coastline of Australia has some of the highest shark attack concentrations in the entire world and almost every avid surfer along this stretch of coast either has his or her own shark story or knows someone who does. \n>> Read more about visiting Bondi Beach Reunion Island Located in an isolated spot about 130 miles from the coast of Madagascar in the Indian Ocean, French owned Reunion Island is home to awe-inspiring waterfalls, lush, green landscapes, beautiful beaches, great surf and lots of sharks. \nAlthough there have only been a few attacks off the coast of Reunion Island in the past few years, the number of attacks per capita of swimmers, surfers and divers on this tiny, isolated island is one of the highest in the world. Since 1980 there have been 24 shark attacks off the shores of this island, with 13 of them being fatal. Bull and tiger sharks both troll the waters near this island and are two of the three most dangerous species of sharks known to intentionally attack humans (great whites are the other). \nOne shark attack victim was a 34-year old surfer who had his arm ripped off by a shark while surfing Devil’s Point off this remote island and later died from his injuries. While not many people head to this tiny island, those who do should be extra careful about getting in the waters here. West End, Grand Bahamas The Caribbean has long been famous for its stories of looting pirates and vicious shark attacks. While there have been no documented fatal shark attacks here, West End on Grand Bahama is home to “Tiger Beach,” a notorious hangout for tiger sharks. The waters in this Caribbean area are replete with all kinds of sharks (hammerheads, bull sharks, black tips) the West End is mostly known for its concentration of the aggressive tiger shark. Much like in Gansbaai, this area in the Bahamas has become famous for shark cage diving, drawing many tourists to the waters who actually want to come face to face with a hungry shark (protected by a metal cage of course).", "external_links": [], "published": "2015-09-02T11:03:00.000+03:00", "crawled": "2015-09-02T16:39:58.349+03:00", "highlightTitle": ""}