{"organizations": [], "uuid": "acc98d2a9fe407ce4bf0d0c5a6462e39f84b9a3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://www.independent.co.uk/incoming/article10486005.ece/binary/original/st-basils-getty.jpg", "site_section": "http://www.independent.co.uk/travel/rss", "section_title": "- Travel RSS Feed", "url": "http://www.independent.co.uk/travel/news-and-advice/visiting-russia-red-tape-hotels-and-intolerance-10486025.html", "country": "IE", "title": "Visiting Russia: Red tape, hotels, and intolerance - News & Advice - Travel", "performance_score": 0, "site": "independent.co.uk", "participants_count": 2, "title_full": "Visiting Russia: Red tape, hotels, and intolerance - News & Advice - Travel - The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 1, "uuid": "4ebf51248a5bbbb9c500819278804b9bc173355a"}, "author": "Simon Calder", "url": "http://www.independent.co.uk/travel/news-and-advice/visiting-russia-red-tape-hotels-and-intolerance-10486025.html#post-0", "ord_in_thread": 0, "title": "Visiting Russia: Red tape, hotels, and intolerance - News & Advice - Travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The world's largest country suffered a twin tourism setback this week. Readers of the US magazine Travel+Leisure voted Moscow the least-friendly city on earth. The former Russian capital, St Petersburg, was rated third-unfriendliest, with the glum New Jersey gambling resort of Atlantic City uncomfortably sandwiched between the two big Russians.\nMoscow and St Petersburg (or Leningrad, as it was named while the second city of the USSR) are spectacular in scale. I first visited them three decades ago, and found them engaging, with a gruff charm. As the stern Soviet façade melted away, the warmth of the people became more evident. \nIn one respect, though, Russia remains unwelcoming: the red tape involved in organising a trip to the past and present capital is even more tangled than it was before communism unravelled. Want to go to St Petersburg or Moscow? First head to a Russian Visa Application Centre in London or Edinburgh to have your fingerprints taken.\nHappily, this first, bureaucratic impression is misleading. Once you arrive, you can look forward to a sequence of great experiences in the company of friendly people. Indeed, the US State Department assures travellers their journeys to the world's biggest country are likely to be “exciting and rewarding”. Visitors will also find friendly prices. In two years, the pound has doubled in strength against the rouble, so the budget-minded traveller can enjoy Moscow with the lowest prices this century. A ride of any distance on the world's most beautiful Metro system costs the equivalent of 50p, or you can buy a 24-hour smart card for £2.\nAbove ground, almost anything that moves constitutes a potential taxi, and almost any street-level window constitutes a bureau de change offering rates that would make Thomas Cook quiver.\nRed beds and breakfasts \nYou could pay outlandishly high prices at the new generation of luxe lodgings in the capital; this year's HRG Hotel Survey concludes: “Moscow remains the most expensive city for the 11th consecutive year.” Some of my old haunts, such as the huge and hilariously awful Rossiya Hotel that once overshadowed Red Square, have been improved by the technique of total demolition. Yet the increasingly grand Budapest Hotel has acquired a fourth star since my last stay. It remains central, comfortable and excellent value at £95 for a double, including a lavish buffet in a handsome 1876 parlour. \nAlternatively, you could breakfast at the Café Pushkin. As in Casablanca, life has imitated art with the creation of a fictional hostelry. Half-a-century after the French songwriter, Gilbert Bécaud, wrote about the Café Pushkin, a hostelry of that name finally opened in 1999 – promising “historic fare of the Russian nobility”. Invest the equivalent of £55 in Moscow's best breakfast (blinis with caviar) or spend just 60p on a cup of tea. Then explore.\nAt the centre of everything is Red Square, with the Kremlin to the east and the onion domes of St Basil's erupting prettily to the south. View the Soviet past at Lenin's Mausoleum beside the Kremlin wall. The preserved body of the first leader of the USSR, Vladimir Ilyich Lenin, is on display most mornings from 10am to 1pm. The hub of the Russian state is also one of its prime tourist attractions. The walls of the triangular Kremlin protect palaces, towers and no fewer than five cathedrals, as well as the presidential power base of Vladimir Putin. \nMinority report \nMoscow is the most multicultural city in Russia, so it is all the more regrettable that your sexual orientation and/or skin colour could attract unwelcome attention in the capital. Two years ago the president outlawed the “promotion” of homosexuality, a move that triggered homophobic harassment and attacks. In addition, the Foreign Office warns of “racially motivated attacks,” saying “visitors of Asian or Afro-Caribbean descent should take extra care.” The editors of Travel + Leisure say: “We suspect the city's notoriously bad traffic and general 'aloofness' of the people contributed to its low ranking.” I suspect it had more to do with the intolerance shown by Russia's leadership.", "external_links": [], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-05T08:37:41.507+03:00", "highlightTitle": ""}