{"organizations": [], "uuid": "d6aae98f68dae96e79a519ad393de9c298b1bbc6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/09/9509abd8-5bea-11e5-9ab0-bd149a1c51f9-1200x630.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/entertainment/visual-arts/before-morse-code-there-was-morses-gallery-of-the-louvre-explore-it-here-see-it-at-sam/", "country": "EU", "title": "Before Morse code, there was Morse’s ‘Gallery of the Louvre’ — explore it here, see it at SAM", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Before Morse code, there was Morse’s ‘Gallery of the Louvre’ — explore it here, see it at SAM | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T14:00:00.000+03:00", "replies_count": 0, "uuid": "d6aae98f68dae96e79a519ad393de9c298b1bbc6"}, "author": "Michael Upchurch", "url": "http://www.seattletimes.com/entertainment/visual-arts/before-morse-code-there-was-morses-gallery-of-the-louvre-explore-it-here-see-it-at-sam/", "ord_in_thread": 0, "title": "Before Morse code, there was Morse’s ‘Gallery of the Louvre’ — explore it here, see it at SAM", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Samuel F.B. Morse’s oil on canvas “Gallery of the Louvre,” which arrived this week at the Seattle Art Museum for a four-month visit, is actually three dozen or more paintings in one.\nIt’s simultaneously a document, a fantasy, an art tutorial and a piece of epic-scale legwork for an artist who had even grander projects in mind. It’s also the painting that, after being spurned by the public in his lifetime, set Morse on his path as an inventor.\nFor, yes, this is the same Morse who invented the telegraph and the dot-dash-dot alphabet that went with it. Far from dreaming of being an inventor, Morse (1791-1872) was determined to pursue an art career from the time he was in his teens. He trained at the Royal Academy of Arts in London and hoped to specialize in historical scenes. His only source of income upon his return to the U.S., however, was portrait painting — a genre he disdained, despite his brilliance at it.\n‘Samuel F.B. Morse’s “Gallery of the Louvre” and the Art of Invention’ 10 a.m.-5 p.m. Wednesdays-Sundays, until 9 p.m. Thursdays through Jan. 10, 2016, Seattle Art Museum, 1300 First Ave.; $12.50- $19.95 (206-654-3100 or seattleartmuseum.org ).\nHis first large-scale history painting was “The House of Representatives” (1821-1823), now in the Corcoran Gallery in Washington, D.C. Morse conceived of it as an “exhibition painting” to be put on display for a small charge in East Coast cities (a common practice at the time). Unfortunately, it was a box-office flop — and that meant going back to portrait painting.\n“Gallery of the Louvre,” started in late 1831 when Morse was on a three-year tour of Europe, was also intended as an exhibition painting. Gallery paintings, Morse scholar William Kloss explains, were an established 18th-century genre. Some were simply oil-on-canvas inventories of private or royal collections. Others portrayed “imaginary collections,” as Morse’s does — for “Gallery” doesn’t reflect the actual arrangement of artwork in the Louvre’s Salon Carré at the time of his visit. It portrays a grand room, illuminated with shafts of light from skylights, covered floor to ceiling with nearly 40 of the Louvre’s greatest artworks. Most still reside there.\nMorse spent 14 months on “Gallery of the Louvre.” He made small copies of every painting he chose to include on his 6-foot-by-9-foot canvas, sometimes using a camera obscura to render them more accurately.\nAt his Paris studio, he copied the copies onto the bigger canvas, while changing their scale to make the overall composition work better. After he returned to the U.S. he added the people in the foreground of the painting. Those figures included his good friend, novelist James Fenimore Cooper, and his family, and, it is believed, Morse’s wife, Lucretia, who had died at age 25 in 1824.\nArts education Morse was a dedicated arts educator. He co-founded New York’s National Academy of Design in 1826 and was its president for 20 years. So it’s no surprise that he had an instructional intent with “Gallery of the Louvre.” As Kloss explains, he wished “to introduce into America, if only in copies, some of the greatest European art, not as mere curiosities but in order to edify his countrymen.”\nHe also saw “Gallery” as his own training session for a commission he was counting on getting for a planned mural on the Rotunda of the U.S. Capitol. The mural, he was certain, would be the making of him as an artist.\nCritical reception to “Gallery” was overwhelmingly positive, but it didn’t draw any crowds. Morse eventually sold “Gallery” at a financial loss, and when the commission for the Capitol Rotunda went to someone else, he gave up on painting altogether. (“Don’t be an artist,” he told one of his students. “It means beggary.”)\nTo Cooper in 1849, he revealed the full extent of his despair: “Painting has been a smiling mistress to many, but she has been a cruel jilt to me. … I have no wish to be remembered as a painter.”\nMost Read Stories No change in status of Seahawks safety Kam Chancellor as holdout continues Seattle Aquarium trains otter to use inhaler for her asthma Mariners' Kyle Seager drilled by Jered Weaver after frustrations boil over Seattle police chief fires cop who arrested man carrying golf club Haggen plans broad retreat from costly expansion, filing shows Unlimited Digital Access. $1 for 4 weeks. But he was remembered. “Gallery of the Louvre” was purchased in 1982 for $3.25 million by Chicago art collector Daniel J. Terra (1911-1996), and the Terra Foundation for American Art is sending it on a three-year tour around the country. Foundation president Elizabeth Glassman says Terra believed the painting “epitomized the American spirit of vitality, initiative, and drive for self-improvement.”\nSeattle Art Museum curator Patricia Junker echoes that sentiment: “So rarely can we point to one work of art as representing a pivotal moment in American history. This work of art sums up the experimentation of one person that led to a cultural and economic and social revolution.”\nAt SAM, the painting has been given a curtained “theater” of its own, where a nine-minute audio explains the context of its creation. There will also be a key to the painting available, identifying all the works included in it.\n“Gallery,” in its way, anticipates Google Image or Dropbox in the amount of visual information it tries to convey. It surely isn’t a coincidence that Morse came up with the idea for the telegraph on his way home from Paris to New York in 1832. (“I see no reason,” he wrote, “why intelligence might not be instantaneously transmitted by electricity to any distance.”)\nAppreciation of “Gallery of the Louvre” came far too late for Morse. He died in 1872, more than a century before Terra paid a fortune for it. The good news is that “Gallery” has survived.\nMichael Upchurch: www.michaelupchurchauthor.com", "external_links": ["http://www.louvre.fr/en/rooms/salon-carre-italy"], "published": "2015-09-17T14:00:00.000+03:00", "crawled": "2015-09-18T09:30:27.955+03:00", "highlightTitle": ""}