{"organizations": [], "uuid": "605afb7f3c3503156c8c81ad0b52df461652754e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/02/cathay-pacific-logo.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/cathay-pacific-extends-european-network-with-launch-of-new-madrid-service/", "country": "US", "title": "Cathay Pacific extends European network with launch of new Madrid serviceTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Cathay Pacific extends European network with launch of new Madrid serviceTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "605afb7f3c3503156c8c81ad0b52df461652754e"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/cathay-pacific-extends-european-network-with-launch-of-new-madrid-service/", "ord_in_thread": 0, "title": "Cathay Pacific extends European network with launch of new Madrid serviceTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cathay Pacific extends European network with launch of new Madrid service\nCathay Pacific Airways today announced that it will launch a new four-times-weekly service to Madrid, the capital city of Spain, on 2 June 2016 (subject to government approval). As the only direct link between Hong Kong and Madrid, the new service will provide greater convenience for business and leisure customers travelling between the two cities and give passengers travelling from Southern Europe easier access to key destinations in Mainland China and Asia.\nStrategically located in the Iberian Peninsula, Madrid is culturally rich yet cosmopolitan. The vibrant city is an important financial and business centre that also draws leisure travellers from around the world thanks to its historical landmarks and rich heritage. It is also home to Real Madrid and Atlético de Madrid, two of Europe’s biggest football teams.\nTickets for the new Madrid service are already on sale. To ensure passengers enjoy a superior inflight experience, Cathay Pacific will operate flights using a Boeing 777-300ER aircraft fitted with the airline’s award-winning Business Class, new Premium Economy and long-haul Economy Class seats. A state-of-the-art on-demand entertainment system in all classes will help to keep passengers relaxed and entertained.\nCathay Pacific Chief Executive Ivan Chu said: “We are delighted to launch flights to Madrid and become the only airline to offer direct non-stop services between Hong Kong and Spain. Network expansion is part of our core strategy, underpinning our efforts to strengthen Hong Kong’s position as one of the world’s great international aviation hubs. We are committed to expanding our presence in Europe, having recently added Manchester, Zurich and Düsseldorf to our network, and we are now pleased to offer more choice and convenience to passengers travelling between Hong Kong and Madrid.”\nThe tentative flight schedule for Cathay Pacific’s Madrid (MAD) service from 2 June 2016 is as follows (all times local):\nSummer 2016 schedule\nFlight No Routing Departure Arrival Days of the week CX315 HKG-MAD 0045 0845 Tue, Thu, Sat, Sun CX320 MAD-HKG 1225 0705+1 Tue, Thu, Sat, Sun Winter 2016 schedule\nFlight No Routing Departure Arrival Days of the week CX315 HKG-MAD 0045 0810 Tue, Thu, Sat, Sun CX320 MAD-HKG 1120 0705+1 Tue, Thu, Sat, Sun", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T00:56:10.084+03:00", "highlightTitle": ""}