{"organizations": [], "uuid": "087dd6582995d105bdaca02ca230ff8e3ea5e701", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30134966/automotive-glass-market-by-vehicle-glass-type-smart-glass-market-by-technology-application-by-region-forecast-to-2020-reportlinker-review", "country": "US", "title": "Automotive Glass Market by Vehicle & Glass Type, Smart Glass Market by Technology, Application, & by Region - Forecast to 2020 - Reportlinker Review", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Automotive Glass Market by Vehicle & Glass Type, Smart Glass Market by Technology, Application, & by Region - Forecast to 2020 - Reportlinker Review - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "087dd6582995d105bdaca02ca230ff8e3ea5e701"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30134966/automotive-glass-market-by-vehicle-glass-type-smart-glass-market-by-technology-application-by-region-forecast-to-2020-reportlinker-review", "ord_in_thread": 0, "title": "Automotive Glass Market by Vehicle & Glass Type, Smart Glass Market by Technology, Application, & by Region - Forecast to 2020 - Reportlinker Review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Reportlinker\nNEW YORK , Sept. 28, 2015 /PRNewswire/ -- Smart glass has been used for residential and commercial applications for many years. Industrial sectors such as communication, transportation, healthcare, and architecture are the main areas, where smart glass is also used. The automotive sector has now become one of the leading consumers of smart glass products. Many automotive manufacturers have introduced smart glass in their upcoming vehicles. The main reasons behind this are the fact that smart glass is anti-glare, allows remote access and can dynamically adjust light emissions. The applications for smart glass in the automotive segment are commonly found in products such as sunroofs, windows, visors, and rear-view mirrors. These products can be controlled using simple switch, which easily allows customization in lighting and cooling. For instance, controlling the sunroof, or controlling the transparency of the side windows in a car using a switch or a remote.\nThe demand for glass is directly associated with vehicle production. The demand for glass is highest among the automotive manufacturers in the Asia-Oceania region, as vehicle production in this region is highest. Despite the presence of key automotive manufacturing hubs such as China , Japan , India , and South Korea , the region only registered a production growth of 3.5% from 2013 to 2014. This slow growth is due to the slow growth of vehicle production observed in countries such as India , Japan , South Korea , and Thailand for the mentioned period.\nThis report, segments the glass market for automotive industry into following types: market by vehicle type (passenger car, LCV, heavy truck, and bus), by region ( North America , Europe , Asia-Oceania, and ROW), by glass type (tempered, laminated, and others), by smart glass technology (suspended particle device, electrochromic, liquid crystal/polymer dispersed liquid crystal, photochromic, and thermochromic) and by smart glass application (sunroof, side-view/rearview mirror, windshield, and sidelite/backlite). The key players in the market have also been identified and profiled.\nThis report classifies and defines the global glass market size for automotive industry, in terms of volume and value. Market size, in terms of volume, is provided in million square meters from 2013 to 2020, while the market size by value is provided in terms of USD Million.\nThe report also provides a comprehensive review of market drivers, restraints, opportunities, and challenges in the global automotive glass market. Apart from analyzing the quantitative aspects of these markets, the report also covers qualitative aspects, such as value chain analysis, and Porter's five force analysis for the global automotive glass market.\nThe glass market for automotive industry is dominated by a few major players such as Saint-Gobain S.A. ( France ), Asahi Glass Co. Ltd. ( Japan ), Nippon Sheet Glass Co. Ltd. ( Japan ), Fuyao Glass Industry Group Co. Ltd. ( China ), and Samvardhana Motherson Automotive Group BV (SMRPBV) ( The Netherlands ).\nRead the full report: http://www.reportlinker.com/p03283114-summary/view-report.html\nAbout Reportlinker\nReportLinker is an award-winning market research solution. Reportlinker reviews, finds and organizes the latest industry data so you get all the market research you need - instantly, in one place.\nhttp://www.reportlinker.com", "external_links": ["http://www.reportlinker.com/", "http://www.reportlinker.com/p03283114-summary/view-report.html"], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-29T01:00:21.429+03:00", "highlightTitle": ""}