{"organizations": ["Orion", "Orion Travel Technologies", "Toyota", "KFC", "Facebook", "Geico", "Continental"], "uuid": "17f3c73de640461b98cbfeaaac4932d393107a0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/gp7qymjqyVDVnwyaPrrNDA--/aD0zMzI7dz00NDQ7c209MTthcHBpZD15dGFjaHlvbg--/https://s.yimg.com/cd/resizer/2.0/FIT_TO_WIDTH-w444/2b1fccaa3b794935b7be913faf3bb694d892443d.png", "site_section": "https://www.yahoo.com/travel/rss", "section_title": "Yahoo Travel", "url": "https://www.yahoo.com/travel/hump-day-10-camel-photos-120346510.html?src=rss", "country": "US", "title": "Save on Baggage Fees by Slapping an Ad on Your Suitcase", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Save on Baggage Fees by Slapping an Ad on Your Suitcase", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T19:45:00.000+03:00", "replies_count": 0, "uuid": "17f3c73de640461b98cbfeaaac4932d393107a0f"}, "author": "", "url": "https://www.yahoo.com/travel/hump-day-10-camel-photos-120346510.html?src=rss", "ord_in_thread": 0, "title": "Save on Baggage Fees by Slapping an Ad on Your Suitcase", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Pinterest", "Gary German", "Billie Cohen"], "text": "Pin it Send Would you be willing to shill for a brand in order to have your baggage fees covered? (Photo: screen capture from Orion Travel Technologies) By Billie Cohen Pay no baggage fees for a year? Sounds like a dream — or a gimmick. And of course, it’s a bit of both. Orion Travel Technologies has launched a program that will cover the cost of your baggage fees if you agree to be a walking, traveling advertisement for their clients. Orion was founded by Gary German, who’s worked in the airline industry (as a flight attendant for Continental), in advertising, and as a tech entrepreneur, among other career paths. And now he’s hoping to use your travels to help brands advertise around the world. Here’s how it works: You pay Orion a $19.99 annual membership fee (the first six months are free), and in exchange, they send you a two-piece hard-shell luggage set, a 21-inch for carry-on and a 29-inch bag for checking in, each wrapped with the logo of one of Orion’s advertising clients. Orion then provides a $50 gift card for each time you travel (a maximum of six times per year) to be used to cover your checked baggage fees. Related: The Most Frightening Food Found on Airplanes You can choose whatever ad graphic you like (or the one that makes you feel the least icky) from the programs Orion is running at any particular time. It’s not clear from its website what brands are officially onboard at this time, but sample images (like the one above) showcase familiar logos and characters from KFC, Geico, Toyota, Star Wars, and more. Related: These 9 Things Have Definitely Happened to You on a Plane Wheelie ads aren’t the only project in Orion’s sights. In fact, according to Orion’s website, this seems like just the beginning. On the site and in a six-plus-minute promotional video (which begins at the dawn of human travel, thousands of years ago), Orion describes itself as a travel club with big plans in the travel space. Some of those plans include vacation club partnerships, sales of smart luggage, concierge and travel guide services, a family exchange program, online booking, a mobile wallet, Orion charter excursions, and “entry into the fun-est airport lounge” which will be accessible in major airports around the world. Related: 10 New Rules for Finding Cheap Flights We guess the company’s creativity is at least worth applauding — innovation in the travel world is often very slow-coming, so at least this is a conversation starter. But it’s more likely that this advertising scheme will make a lot of travelers cringe. Even with the promise of access to the “fun-est” airport lounges, would you be willing to be a walking billboard just for the price of baggage fees? Let Yahoo Travel inspire you every day. Hang out with us on Facebook , Twitter , Instagram , and Pinterest. Reblog", "external_links": [], "published": "2015-09-29T19:45:00.000+03:00", "crawled": "2015-09-30T16:54:38.639+03:00", "highlightTitle": ""}