{"organizations": [], "uuid": "506849600382f8f4bac1286d749f50659a136e55", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1947096/images/o-BINOCULARS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/business-travel/feed", "section_title": "Business Travel on Huffington Post", "url": "http://www.huffingtonpost.com/lee-davenport/5-ways-finding-the-right-_b_8074118.html", "country": "US", "title": "Lee Davenport: 5 Ways Finding the Right Fiverr Gig is Like Finding the Right Realtor and How Not to Be Frustrated by Either!", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Lee Davenport: 5 Ways Finding the Right Fiverr Gig is Like Finding the Right Realtor and How Not to Be Frustrated by Either!", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T20:48:00.000+03:00", "replies_count": 0, "uuid": "506849600382f8f4bac1286d749f50659a136e55"}, "author": "Lee Davenport", "url": "http://www.huffingtonpost.com/lee-davenport/5-ways-finding-the-right-_b_8074118.html", "ord_in_thread": 0, "title": "Lee Davenport: 5 Ways Finding the Right Fiverr Gig is Like Finding the Right Realtor and How Not to Be Frustrated by Either!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit Originally written for and published on HuffPost. Hear me out: Fiverr does not have to be a total waste of time despite what you may have heard or experienced. (If this is Greek to you, Fiverr is an online marketplace to outsource business tasks, similar to other crowdsourcing websites like Upwork.) I understand you may have been frustrated in the past by a non-responsive designer, subpar work, or an inflated price after several add-ons that should have been standard. But, with the right technique, Fiverr can be an inexpensive, efficient, and helpful alternative because the hustle is real. Fiverr's contractors can assist you in getting odds and ends completed and off your plate as a busy solopreneur ( shout out to my fellow real estate agents ) without the bigger commitment of hiring staff. The process of finding the right designer on Fiverr feels interestingly similar to finding the right real estate agent. Here's how to do both well: Start with the End in Mind Borrowing from Stephen Covey's 7 Habits of Highly Effective People , you have to first decide what you want from the Fiverr contractor before contacting anyone. For instance, on Fiverr there are literally thousands of website designers but less than 3 percent are presently listed as those that can create a real estate Wordpress website. If you have not decided what the finished product should be, you will probably select the wrong contractor, which will frustrate you both. We understand this in real estate because whether we are looking to buy a home in the latest high rise or sell a horse farm, we appreciate finding a pro that not just says they can do the job but that actually has the expertise and track record. This leads to the next point... Review the Reviews Thorough and honest online reviews help us to gauge a professional's service commitment, work ethic, and quality of workmanship, especially in the absence of an authentic referral from a trusted family member or friend. If there is a generic, \"Great work!\" with no substance and qualification for the rating, then keep moving. You really can only vet Fiverr contractors by their reviews (both on and off Fiverr), unless you know them or their clients personally. So if there is nothing about the reviews, whether positive or negative, that speak to you (such as their excellent follow-up, willingness to make several corrections until it was right, creativity, and so forth), then it is time to say, \"Next!\" See what I mean in this short video: Be Specific Homebuyers must know what they desire in a home (such as a certain school district, living all on one level, facing a particular direction, the price point, desired commute time, etc.) to not waste time and be disappointed by the process since even the most spectacular Agent+ is usually not a mind-reader. This is no different on Fiverr. If you simply say to a designer, \"I want content for my blog and here is my website for you to once-over\", then you have left them to make too many assumptions. And you know what happens when we assume... we unleash donkeys to say it rated PG! Instead, be very direct about what you expect the finished product to be. Never Forget Time is of the Essence When a buyer is under contract to purchase a home and decides to walk away from the home after the allotted time periods (i.e. inspection, due diligence, financial contingency period, etc.), she may be stuck. Fiverr really must have taken its cues from the world of real estate because they are also fairly firm with adhering to their timeframes to allow the modification or cancellation of a gig for a full refund. The lesson: Once you are working with a pro, if something is wrong, then speak up at once by formally and immediately submitting a request for a modification or cancellation. And do not think that just because things did not go perfectly, you made a bad decision in starting the whole process. First-timers, whether homebuyers or Fiverr users, tend to not realize that setbacks and incompatibilities are not a sign to \"throw the baby out with the bathwater\" and say, \"I'm not EVER doing that again!\" Instead, cling to all deadlines in order to get any allowable refunds. Furthermore, use delays as opportunities to learn how to communicate more effectively or select a better representative the next go-round. Remember Stars Should Not Just Be in the Sky As mentioned above, a thorough, glowing review can make the difference in gaining new clientele, both for real estate agents and Fiverr artists. When you are satisfied with the outcome of a transaction, thank the pro with whom you worked and help them get more business by simply writing a descriptive review. Your 5-star review can take under 5 minutes to do yet it can mean so much more to their business success than a Neiman Marcus gift card or Edible Arrangement (although those are appreciated too). Have more questions about real estate or business technology? Ask away by following me on Facebook , Instagram , YouTube , and Google+ or by visiting LearnWithLee.Realtor . And if you sell real estate (or know someone who does), get a copy of the 5-star rated workbook, Plan to Win , to transform your real estate sales game plan. Here's to your success! More:", "external_links": [], "published": "2015-09-02T20:48:00.000+03:00", "crawled": "2015-09-03T01:05:44.856+03:00", "highlightTitle": ""}