{"organizations": [], "uuid": "39b639a15d537575048d69bbcd502f25ce952b31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/spiritairdelays.jpg", "site_section": "http://www.foxnews.com/travel/", "section_title": "Travel News, Videos &amp; Vacation Guides for Planning Your Trip | Fox News", "url": "http://www.foxnews.com/travel/2015/09/23/are-airlines-really-experiencing-record-high-numbers-passenger-complaints/", "country": "US", "title": "Are airlines really experiencing record-high numbers of passenger complaints?", "performance_score": 0, "site": "foxnews.com", "participants_count": 2, "title_full": "Are airlines really experiencing record-high numbers of passenger complaints? | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 1, "uuid": "c3bd2aa9653e252d4329a148e0396428c87c5860"}, "author": "Josh Lew", "url": "http://www.foxnews.com/travel/2015/09/23/are-airlines-really-experiencing-record-high-numbers-passenger-complaints/#post-0", "ord_in_thread": 0, "title": "Are airlines really experiencing record-high numbers of passenger complaints?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Josh Lew\nPublished September 23, 2015 Facebook 0 Twitter 0 livefyre Email Print Spirit has some of the industry's highest customer complaints, but should we consider that when buying our next airline ticket? (AP)\nEarlier this year, the U.S. Department of Transportation released a report about the number of commercial airline complaints it received. On the surface, this data told a negative story: there had been a huge increase in the number of airline passenger complaints for the first six months of 2015 compared to the same time period during 2014.\nThe DoT compiled the data by looking at the 13 largest airlines in the U.S. In ‘15, 6,412 people lodged complaints during the first half of the year. At the end of June 2014, the number was at 4,756 .\nWait! It's not as bad as it seems\nIf you just look at this raw stat, it seems like the quality of airline service has nosedived this year. However, it is not quite as bad as it seems. In fact, services on some particular airlines might even be getting better.\nFirst of all, the number of people flying in 2015 is higher than the number of people who took to the sky last year. Most industry insiders don’t pay any attention to the overall amount of complaints. The DoT also publishes the average number of complaints per 100,000 passengers. This percentage paints a clearer picture of how well the industry is doing as a whole.\nThe numbers don't lie, one airline dragged the industry’s score down\nLooking at the averages, complaints are still on the rise, but the numbers are not quite as dramatic. In the first half of 2014, airlines earned an average of 1.5 complaints per 100,000 passengers. For the first six months of this year, the rate was at 1.89 per 100,000. So passenger protests are obviously on the rise, but overall, the percentage of people who officially lodged a complaint remains quite small.\nPart of the increase can be blamed on one culprit. It was only this past January that the DoT began considering Spirit one of America’s major airlines. The low-cost carrier was left off the 2014 report. For the first six months of the year, Spirit had the most complaints of any U.S. airline. Remember, the industry average is 1.89 per 100,000 travelers. From January through June, Spirit’s complaint rate was embarrassingly high. They had 11.20 complaints per 100,000 fliers. Many of these were most likely due to the airline's well-documented (and ongoing) problem with delayed and canceled flights .\nNot every airline has poor customer satisfaction ratings\nAnother low-cost airline, Frontier, further dragged the industry average down with approximately 10 complaints per 100,000 trips. However, not all budget airlines performed poorly. Southwest was the industry leader over the past six months with a complaint rate of 0.52 per 100,000. Delta led the legacy carriers with an average of 0.72.\nSo overall, the DoT’s report paints a picture of an industry that is doing fairly well as a whole, except for a few airlines, which are seriously struggling in the customer satisfaction department. Another thing to consider: the busier airlines and airports are, the more likely delays and baggage handling mistakes are to occur. In short, an increase in the number of passengers should naturally lead to an increase in the number of complaints.\nThere are other variables to consider as well\nWhat do the DoT report mean for individual fliers? Probably not as much as you might think. By choosing an airline that has a lower number of complaints, you are putting the odds of a pleasant flight in your favor.\nIf you fly Southwest instead of Spirit, for example, your chances of a smooth journey are much, much better. Of course, on certain routes, you can save a lot of money by opting for Spirit (which actually has the NASDAQ ticker symbol “SAVE”). The airport that you fly out of, the time of year that you are flying and the route you are traveling on are also important variables.\nEven if you choose a highly rated airline, there is still a point when you have to roll the dice and hope for a good trip.\nMore from TravelPulse:\nPalace Unveils In-Room Apple TV Devices and Smart TV Technology\nA U.S. Virgin Islands Travelers' GPS\n14 Things Set to Impact Tourism to Switzerland\n5 Most Idyllic Fall Camping Destinations\nThe US Virgin Islands' 10 Best Beaches", "external_links": ["http://global.fncstatic.com/static/managed/img/share/source/travelpulse.png", "https://urldefense.proofpoint.com/v2/url?u=http-3A__www.travelpulse.com_news_destinations_the-2Dus-2Dvirgin-2Dislands-2D10-2Dbest-2Dbeaches.html&d=BQMF-g&c=cnx1hdOQtepEQkpermZGwQ&r=FhdKc1uTt2Jq8dhLd5GPnV4wEbGqv62vhhhGKKskntI&m=YyM5NXILKNOnevbKj9xic3NWVvdB4xr4t_aZ7yBxaeU&s=30BrbdyJwZjq27yA-ljqYDinZ3FQmkKL_UfnK_2PWP0&e=", "http://www.cntraveler.com/stories/2015-08-12/why-air-travel-complaints-are-on-the-rise", "https://urldefense.proofpoint.com/v2/url?u=http-3A__www.travelpulse.com_news_hotels-2Dand-2Dresorts_palace-2Dunveils-2Din-2Droom-2Dapple-2Dtv-2Ddevices-2Dand-2Dsmart-2Dtv-2Dtechnology.html&d=BQMF-g&c=cnx1hdOQtepEQkpermZGwQ&r=FhdKc1uTt2Jq8dhLd5GPnV4wEbGqv62vhhhGKKskntI&m=YyM5NXILKNOnevbKj9xic3NWVvdB4xr4t_aZ7yBxaeU&s=NLubrIwirF28m6jT5JqpCfz5kX-6Sxt3OOmkDXK4hZ0&e=", "https://urldefense.proofpoint.com/v2/url?u=http-3A__www.travelpulse.com_news_destinations_14-2Dthings-2Dset-2Dto-2Dimpact-2Dtourism-2Dto-2Dswitzerland.html&d=BQMF-g&c=cnx1hdOQtepEQkpermZGwQ&r=FhdKc1uTt2Jq8dhLd5GPnV4wEbGqv62vhhhGKKskntI&m=YyM5NXILKNOnevbKj9xic3NWVvdB4xr4t_aZ7yBxaeU&s=qfr7DuvC1cnE09GfuLF-PIF8ezq_nS0E7ezlIK0JXPU&e=", "https://urldefense.proofpoint.com/v2/url?u=http-3A__www.travelpulse.com_news_features_5-2Dmost-2Didyllic-2Dfall-2Dcamping-2Ddestinations.html&d=BQMF-g&c=cnx1hdOQtepEQkpermZGwQ&r=FhdKc1uTt2Jq8dhLd5GPnV4wEbGqv62vhhhGKKskntI&m=YyM5NXILKNOnevbKj9xic3NWVvdB4xr4t_aZ7yBxaeU&s=Fnasc3Nc50xAfMaMK_k6KrRNyNxYxd41lETrVLdFUPE&e=", "https://urldefense.proofpoint.com/v2/url?u=http-3A__www.travelpulse.com_news_destinations_a-2Dus-2Dvirgin-2Dislands-2Dtravelers-2Dgps.html&d=BQMF-g&c=cnx1hdOQtepEQkpermZGwQ&r=FhdKc1uTt2Jq8dhLd5GPnV4wEbGqv62vhhhGKKskntI&m=YyM5NXILKNOnevbKj9xic3NWVvdB4xr4t_aZ7yBxaeU&s=4ndLZuQvGMM7SWX26k-XEdRkggdNhMRWcUAEOsdGsI0&e=", "http://crankyflier.com/2012/08/28/spirit-and-allegiant-have-on-time-performance-problems/", "http://www.travelpulse.com/"], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-24T03:16:46.161+03:00", "highlightTitle": ""}