{"organizations": [], "uuid": "ea29260c9e3d8692446d839684ac4818b7a284ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.kiowacountysignal.com", "main_image": "http://www.kiowacountysignal.com/storyimage/KS/20150902/LIFESTYLE/150909892/AR/0/Fort-Larned-National-Historic-Site.jpg", "site_section": "http://www.kiowacountysignal.com/lifestyle/travel?template=rss&mime=xml", "section_title": "Travel - Kiowa County Signal - Kiowa County, KS", "url": "http://www.kiowacountysignal.com/article/20150902/LIFESTYLE/150909892/2010/LIFESTYLE?rssfeed=true", "country": "US", "title": "Take a day trip nearby", "performance_score": 0, "site": "kiowacountysignal.com", "participants_count": 1, "title_full": "Take a day trip nearby", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T08:01:00.000+03:00", "replies_count": 0, "uuid": "ea29260c9e3d8692446d839684ac4818b7a284ab"}, "author": "Carol Bronson", "url": "http://www.kiowacountysignal.com/article/20150902/LIFESTYLE/150909892/2010/LIFESTYLE?rssfeed=true", "ord_in_thread": 0, "title": "Take a day trip nearby", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Take a day trip nearby Comment Kiowa County Signal - Kiowa County, KS By Carol Bronson Posted Sep. 2, 2015 at 12:01 AM By Carol Bronson Posted Sep. 2, 2015 at 12:01 AM Greensburg, Kan. School has started and Labor Day, the unofficial end to summer, is approaching. There’s still time for a day trip, and plenty of interesting sights to see close at hand at a reasonable cost. The individual tourist may not spend much, but it’s an important industry within the state. The Kansas Department of Commerce estimates tourism has a $5.46 billion impact on the Kansas economy, and accounts for 148,945 Kansas jobs — one of every nine Kansan owes his/her job to tourism. If tourism didn't exist, each household would have to pay about $876 more in taxes in order to maintain the current level of state and local tax receipts. So get out there and discover some new sights or revisit a favorite location. Fort Larned National Historic Site • 5 miles west of Larned on K-156, 52 miles from Greensburg • Open 8:30-4:30 362 days a year • 620-285-6911 • Free admission, guided tours available by reservation Established in 1859 as Camp Alert on the Pawnee River to provide protection and escort services along the Santa Fe Trail, Fort Larned features nine restored and one reconstructed building, a museum and a 10-minute video. On Labor Day weekend (Saturday, Sunday and Monday) re-enactors bring the fort to life. • See also: Santa Fe Trail Center, on K-156, between the fort and the community of Larned, open 9-5 Tuesday through Saturday. Admission is $4. Wolf Hotel • 1 North Main, Ellinwood, 90 miles from Greensburg • Tours by reservation of historic Wolf Hotel and Ellinwood Underground. Call 620-617-6915 or 620-564-2400 • $6 for each tour, $10 combined • 4 rooms for overnight stay, complimentary breakfast, satellite TV and WiFi The hotel was built in 1894. Restoration was begun in 2013 by owner Christopher McCord, who is an enthusiastic tour guide. The underground area, originally a drummers’ sample room and recently opened as a bar, is part of a tunnel system that ran throughout the Ellinwood business district. A portion remains open as a tourist attraction, featuring a blacksmith and harness shop and bath and barber shop. The Underground guide will likely share some of Ellinwood’s ghost stories. National Foundation for Carnival Heritage Center • 113 East Sixth, Kinsley, 27 miles from Greensburg • Open by appointment, call 620-659-2201 From 1907 to the 1980s, Kinsley was home at various times to six traveling carnival companies. Development of the museum, the only one in the United States devoted exclusively to carnivals, began in 1998 to assemble artifacts, photographs and stories. • See also: Edwards County Historical Museum, at the junction of U.S. 50 and 56 on the west side of Kinsley. Open 10-5 Monday through Saturday and 2-5 on Sunday. Features a sod house and sign designating Kinsley as Midway USA — 1561 miles from San Francisco and from New York. Page 2 of 2 - Dalton Gang Hideout • 502 S. Pearlette St., Meade • 620-873-2731, 800-354-2743 • Open 9-5 Monday through Saturday and 1-5 on Sunday The home of Eva Whipple, sister of the notorious outlaws of the 1890s was developed as a tourist attraction in 1940 and an escape tunnel was rebuilt as a WPA project • See also: Meade County Historical Museum, 200 E. Carthage, free admission from 10-5 Tuesday through Saturday and 1-5 on Sundays. Includes a large exhibit of western saddles, horse drawn wagons and information about an archaeological dig of a Native American community of the 13th to 15th century. Sternberg Museum of Natural History • 3000 Sterling Drive, on the Fort Hays State University campus, 96 miles from Greensburg • 877-332-1165 • Open 9-6 Tuesday through Saturday and 1-6 on Sundays • $8 admission for adults • See also: Ellis County Historical Museum, 100 W. 7th, open 9-6 Tuesday through Saturday and 1-6 on Sunday, admission is $6 for adults. Includes main gallery, harness shop, replica of Volga German haus and replica of 1927 Hays Fire Department station house; Fort Hays State Historic Site, 1472 K-183, open 9-5 Wednesday through Saturday, admission $5 for adults. Includes visitors’ center and four original buildings. In Kiowa County If you haven’t explored local attractions, visit the Big Well Museum and Soda Fountain, open 9-5 Tuesday through Saturday, 5.4.7 Arts Center open 1-5 Tuesday through Thursday and during the summer, 11-3 on Saturday, the Twilight Theatre, showing movies at 7:30 p.m. on Friday and Saturday and 2:30 on Sunday, and Fromme-Birney Round Barn 3.5 miles south of Mullinville (west of Greensburg on U.S. 50) and 1.75 miles west. Signs direct travelers to the architectural marvel that’s open all the time. Just open the barn door and close it when you leave. Visit kansastravel.org for more information. By Carol Bronson Kiowa County Signal - Kiowa County, KS By Carol Bronson", "external_links": [], "published": "2015-09-02T08:01:00.000+03:00", "crawled": "2015-09-02T10:54:55.518+03:00", "highlightTitle": ""}