{"organizations": [], "uuid": "569160799a203de3a49fcbd844ad0a52de86cc88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/08/labor-day-travel.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/america-travel-news/", "section_title": "AMERICA TRAVEL NEWS - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/10-best-travel-deals-for-labor-day-2015/", "country": "US", "title": "10 best travel deals for Labor Day 2015 - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "10 best travel deals for Labor Day 2015 - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "569160799a203de3a49fcbd844ad0a52de86cc88"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/10-best-travel-deals-for-labor-day-2015/", "ord_in_thread": 0, "title": "10 best travel deals for Labor Day 2015 - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "10 best travel deals for Labor Day 2015 Published on : Friday, September 4, 2015\nAs the Labor Day weekend is around the corner, various travel service providers are rolling out incredible deals for the mass human migration. For all those travelers who are planning to make a last minute booking, there are more than a hundred travel offers that will let you meet your family and friends with added convenience.\nThis Labor Day weekend is set to witness around 35.5 million travelers traveling 50 miles or more as predicted by the American Automobile Association. Needless to mention, the weekend is set to make a record of busy traffic in the last 10 years.\nAccording to the reports, there will be almost 30.4 million car trips followed by 2.6 million air travelers. The rest 2.5 million will be availing trains, buses and boats. For travelers who would like to avail the best deals and the cheapest fares, here is list of 10 incredible travel deals for Labor Day weekend 2015:\n1) Budget Rent a Car is offering a host of deals, including a 35 percent discount if you use “pay now” rates.\n2) Hertz is offering a 15 percent discount all the way up until the end of October, just in case you’re having so much fun that you want to extend your trip.\n3) Avis has so many deals there are too many to list. The most appealing for those planning to use Labor Day weekend to run away from your life and job is the $19.99 one-way deal. You can pick up and drop off wherever you want.\n4) Dollar is offering a 15 percent discount on vehicle rentals from now until Jan. 31, 2016.\n5) iRentRV is offering a five-day deal for luxury RV rentals for $800 (500 miles included), so you have no excuses not to take your family on vacation.\n6) Travelocity is offering dozens of flight and accommodation deals with up to 50 percent off the cost.\n7) United Airlines has a range of discounted flights that depart either Friday or Saturday and return Monday, Labor Day, or Tuesday.\n8) Spirit Airlines is offering one-way deals from as little as $25 if you book by Friday.\n9) Southwest Airlines has hundreds of deals to all kinds of exotic locations … like Des Moines, Iowa or Flint, Michigan.\n10) Amtrak is offering 25 percent off travel this week, depending on where you’re going. Also great to note: Children between the ages of two and 12 travel for a 50 percent discount, although they must be accompanied by an adult, presumably so parents can’t just ditch their kids on the train.", "external_links": [], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-04T12:03:10.429+03:00", "highlightTitle": ""}