{"organizations": [], "uuid": "75270a7b27b61f60b3a25ae2803adc1f7dfb6260", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.canada.com", "main_image": "http://www.canada.com/cms/binary/11384247.jpg", "site_section": "http://rss.canada.com/get/?F178", "section_title": "canada.com Travel Picks", "url": "http://www.canada.com/travel/janeiro+long+forgotten+downtown+window+onto+olympic+city+year+long/11384227/story.html", "country": "CA", "title": "Rio de Janeiro's long-forgotten downtown, a window onto history", "performance_score": 0, "site": "canada.com", "participants_count": 0, "title_full": "Rio de Janeiro's long-forgotten downtown, a window onto history", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T19:38:00.000+03:00", "replies_count": 0, "uuid": "75270a7b27b61f60b3a25ae2803adc1f7dfb6260"}, "author": "", "url": "http://www.canada.com/travel/janeiro+long+forgotten+downtown+window+onto+olympic+city+year+long/11384227/story.html", "ord_in_thread": 0, "title": "Rio de Janeiro's long-forgotten downtown, a window onto history", "locations": ["Rio de Janeiro", "Brazil", "Praca Maua"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rio de Janeiro", "Leo Correa"], "text": "The Museu do Amanha, or Museum of Tomorrow, is pictured at Praca Maua in Rio de Janeiro, Brazil. Much of Centro has been under construction as part of the revitalization of the long-derelict port region ahead of the Olympics. Photograph by: Leo Correa , The Associated Press \nRIO DE JANEIRO — For most visitors to Rio de Janeiro , and even for many residents, the city’s historic downtown is a blur, a canyonland of office towers punctuated by the odd colonial-era church — all to be glimpsed through cab windows en route to the beach. \nBut downtown, known in Portuguese as “Centro,” is Rio’s historical hotspot, a motley pastiche of vestiges of the city’s 450-year-long past. \nFor visitors capable of prying themselves off Copacabana’s golden sands, the neighbourhood is a fascinating detour. \nAnd revitalization projects in the area ahead of the 2016 Summer Olympic Games could help spur its rediscovery. \nCentro is where Rio was born, in 1565, during the bitter battle between the Portuguese and the French, and their indigenous allies, for colonial dominance. The Portuguese eventually prevailed and built their outpost on a hill overlooking Guanabara Bay in what is now Centro. \nThat hill — known as the Morro do Castelo, or Castle Hill for the fortress that crowned it — no longer exists. It was razed in the late 19th and early 20th centuries in response to the then-widespread theory that the mountain spread disease by impeding air circulation. \nToday’s visitors can get a feel for Rio’s colonial times at the Convento Santo Antonio , a Franciscan convent that, along with a Jesuit church atop Castle Hill, was a main landmark of early Rio. Tucked behind the entrance to the Carioca metro stop, which on workdays bustles with commuters streaming to and from nearby office towers, Santo Antonio is all austere grace — a simple-lined white complex atop a hill. \nThe Mosteiro Sao Bento is Santo Antonio’s rich and showy cousin. While the church was founded in 1590 by Benedictine monks, its opulent interior — a Baroque riot of elaborate wooden sculptures covered in 23-carat gold foil — is a product of the 18th century gold rush that was an early peak of Brazilian boom-and-bust economy. A decade-long restoration recently wrapped up, making the gilded church gleam that much brighter. \nDown the street is another colonial gem, the Praca XV square. It’s where ships unloaded, and where the Portuguese royal family stayed after fleeing Lisbon and the approaching British fleet. Upon reaching Brazil in 1808, Portuguese monarch Dom Joao VI stayed in the Paco Imperial, a charming stone building on one side of Praca XV that’s been converted into a cultural centre, with free exhibitions. And on Saturday mornings, the square hosts an antiques fair where eagle-eyed shoppers can score anything from a four-post bed worthy of Dom Joao himself to a half-used bottle of sunscreen circa 1986. \nShould stomachs rumble, one of downtown Rio’s best restaurants, Coccinelle Bistro , is located opposite the Paco Imperial. Run by a Frenchman and his Japanese wife, this lunchtime favourite features bright and fresh Franco-Japanese fusion, served in bento boxes. For more local colour, try Confeitaria Colombo, a sprawling art deco jewel of a restaurant near the Carioca metro. With its towering mirrors in elaborate jacaranda frames and fancy fin de siecle tilework, the Confeitaria Colombo is perfect for afternoon tea. \nMuch of Centro has been under construction as part of the revitalization of the long-derelict port region ahead of the Olympics. Praca Maua square is largely finished, including a new museum celebrating the city, the Museu do Arte do Rio, or MAR. And jutting out into Guanabara Bay, the Museu do Amanha, or Museum of Tomorrow, is taking shape. A $55 million project by famed Spanish architect Santiago Calatrava, the building resembles a great white whale and is likely to open before the games begin in August. \nIn the nearby Gamboa neighbourhood, a modest museum pays tribute to the dark history of slavery. Rio was once the busiest slave port in the Americas, and the Memorial dos Pretos Novos, or New Blacks Memorial, sits where the bodies of up to 50,000 slaves who succumbed during the punishing journey across the Atlantic were burned and dumped. The memorial itself is underwhelming — dusty display cases and fogged-up windows onto archaeological excavation pits — but it’s a moving and sobering stop. \nGamboa is also the birthplace of samba, the syncopated rhythm with African roots that’s become Brazil’s national sound. Soak up the sounds at Trapiche Gamboa, a dilapidated warehouse that’s been converted into a nightclub, with live tunes and fancy footwork. Raucous outdoor samba circles take place Monday nights at Pedra do Sal, a nearby square that was once a slave market and one of the hubs of samba’s birth in the early 20th century. \nPedro Doria, a columnist and author of a book about Brazil’s early colonial period, said that the Centro has been mostly forgotten by Rio residents and tourists alike. With the rise of 20th century beach culture, “suddenly, the emotional centre of the city moved” to Copacabana, Doria said. Centro, with its reminders of Rio’s slave past, was rejected as “repugnant.” \nBut the Olympic makeovers may raise its profile. “It’s where we come from,” he said. “We must embrace it.”", "external_links": [], "published": "2015-09-23T19:38:00.000+03:00", "crawled": "2015-09-24T01:07:51.120+03:00", "highlightTitle": ""}