{"organizations": [], "uuid": "93fe60b121010e715d9a8e0490eaeccf02aa1657", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/31/ca/0e/1dc397ae8f844d1fa96767ccbed7c1b9-a13750ddc94b44fface34bf45f5cc64a-0.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/us/lost-california-hiker-survived-9-days-with-broken-/nnT7j/", "country": "US", "title": "Lost California hiker survived 9 days with broken leg | www.ajc.com", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Lost California hiker survived 9 days with broken leg | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T14:48:00.000+03:00", "replies_count": 0, "uuid": "93fe60b121010e715d9a8e0490eaeccf02aa1657"}, "author": "SCOTT SMITH and KRISTIN BENDER", "url": "http://www.ajc.com/ap/ap/us/lost-california-hiker-survived-9-days-with-broken-/nnT7j/", "ord_in_thread": 0, "title": "Lost California hiker survived 9 days with broken leg | www.ajc.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A 62-year-old hiker missing for nine days in California's rugged Sierra Nevada with a broken leg endured freezing nighttime temperatures and crawled two days for water before getting the attention of rescuers with a whistle she carried for moments of crisis, authorities said Monday.\nMiyuki Harwood slipped and fell about six feet after she left her hiking group and headed back to camp alone because she was low on water.\nAfter two days on the ground, she decided to crawl 150 yards down a rocky, shrub-covered ravine to a spot where she heard running water, Fresno County sheriff's Deputy Jason Vinogradoff said.\nIn this Aug. 23, 2015 photo provided by the Fresno County Sheriff's Office, members of Fresno County Sheriff’s Department search and rescue team look at a map of a remote area of the Sierra National Forest, Calif., where Miyuki Harwood, 62-year-old, was found on Saturday, Aug. 29, 2015, after she used a whistle to get the attention of a search and rescue team looking for her. Harwood, 62, was found Saturday, Aug. 29 after being stranded in the rugged Sierra Nevada for nine days. (Fresno County Sheriff's Office via AP) \"'I can die here, or I can at least get to the water and survive,'\" she told Vinogradoff, who talked with her Saturday, just moments after she sounded her whistle to alert rescuers.\nShe was shivering, pale and crying tears of joy when searchers found her, Vinogradoff said, adding that she asked about her family.\nVinogradoff described Harwood's survival as a miracle and said the avid hiker is a strong-willed person who did not complain of extreme pain. He believes the whistle saved her life.\nThis Aug. 26, 2015, photo provided by the Fresno County Sheriff's Office, shows Fresno County Sheriff’s search and rescue team being airlifted to the remote area of the Sierra National Forest, Calif. tosearch for missing hiker Miyuki Harwood. Harwood, 62, was found Saturday, Aug. 29, 2015, after she used a whistle to alert rescuers. To survive, Harwood crawled for about two days from where she was injured to a creek where she could scoop water into a bottle with a filter inside. (Fresno County Sheriff's Office via AP) Once she was secured in the helicopter, the group of 15 rescuers erupted in applause.\n\"Everybody was pretty happy that she got the outcome that she did,\" California Highway Patrol helicopter pilot Officer Riley Dixon said.\nHarwood, a resident of Folsom, was flown to a hospital in Fresno about 100 miles away and underwent surgery to set broken bones. She has declined requests for interviews.\nIn this Aug. 31, 2015, photo provided by the Fresno County Sheriff's Office shows the area where Miyuki Harwood, 62, was found on Saturday, Aug. 29, 2015, in a remote area of the Sierra National Forest after she used a whistle to get the attention of a search and rescue team looking for her. Authorities say she survived by dragging herself to a creek and using a water filter to drink from it. The search for Harwood was hampered by thick smoke from a wildfire that has burned 96 square miles nearby in the Kings Canyon National Park, authorities said. (Fresno County Sheriff's Office via AP) Harwood had been on an extended hiking trip organized by the Sierra Club. The group searched for her after she disappeared and reported her missing, prompting the search led by the Fresno County Sheriff's Office.\nThe effort was joined by more than 50 people on foot, horseback and helicopter. Smoke from a massive wildfire several miles away hampered searchers in aircraft.\nHarwood ate nothing during the nine days she was missing, but she had a water filter. Vinogradoff said she was wearing hiking pants, a long-sleeved shirt and a down jacket. She sought shelter under a tree.\nIn this Aug. 27, 2015, photo provided by the Fresno County Sheriff's Office, shows Fresno County Sheriff’s search and rescue team searching for a missing hiker in a remote area of the Sierra National Forest, Calif. Miyuki Harwood, 62, was found Saturday, Aug. 29, 2015, after she used a whistle to alert rescuers. To survive, Harwood crawled for about two days from where she was injured to a creek where she could scoop water into a bottle with a filter inside. (Fresno County Sheriff's Office via AP) With each passing day, fears grew among rescuers. After being notified that she was alive, Dixon set out from Fresno in his helicopter.\nWildfire smoke forced him to take a longer route. He landed on a granite slab at an elevation of 9,200 feet and watched rescuers carry Harwood on a stretcher toward him.\nSurvival instructor Cliff Hodges, founder of Adventure Out LLC, said that without the water from the stream, Harwood would not have survived for nine days. He said the whistle was also a lifesaver, and she was fortunate to be lost in the summer.\nThis photo provided by the Fresno County Sheriff's Office shows the area where Miyuki Harwood was found. The 62-year-old Harwood was found Saturday, Aug. 29, 2015, in a remote area of the Sierra National Forest after she used a whistle to get the attention of a search and rescue team looking for her. Authorities say she survived by dragging herself to a creek and using a water filter to drink from it. (Fresno County Sheriff's Office via AP) She could not have endured frigid winter temperatures without shelter, he said, adding that her will to survive undoubtedly played a role.\n\"Ms. Harwood is clearly a tenacious and courageous individual,\" Hodges said. \"Many people, even in the summer, I'm afraid would not have fared as well.\"", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/31/ca/0e/1dc397ae8f844d1fa96767ccbed7c1b9-a13750ddc94b44fface34bf45f5cc64a-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/31/ab/69/1dc397ae8f844d1fa96767ccbed7c1b9-a13750ddc94b44fface34bf45f5cc64a-1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/31/0b/e7/1dc397ae8f844d1fa96767ccbed7c1b9-a13750ddc94b44fface34bf45f5cc64a-3.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/31/a2/b5/1dc397ae8f844d1fa96767ccbed7c1b9-a13750ddc94b44fface34bf45f5cc64a-4.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/31/85/63/1dc397ae8f844d1fa96767ccbed7c1b9-a13750ddc94b44fface34bf45f5cc64a-2.jpg"], "published": "2015-08-31T14:48:00.000+03:00", "crawled": "2015-09-01T02:07:34.896+03:00", "highlightTitle": ""}