{"organizations": [], "uuid": "d0061f75400586ccc14cd1c8082efb570d8401b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vindy.com", "main_image": "http://media.vindy.com/content/image/a/5/logo/v5logo.gif", "site_section": "http://www.vindy.com/rss/headlines/travel", "section_title": "Vindy.com stories: Travel News", "url": "http://www.vindy.com/news/2015/sep/06/war-and-peace/", "country": "", "title": "Civil War battlefield is now a tranquil spot", "performance_score": 0, "site": "vindy.com", "participants_count": 0, "title_full": "Civil War battlefield is now a tranquil spot", "spam_score": 0.0, "site_type": "news", "published": "2015-09-06T07:00:00.000+03:00", "replies_count": 0, "uuid": "d0061f75400586ccc14cd1c8082efb570d8401b2"}, "author": "", "url": "http://www.vindy.com/news/2015/sep/06/war-and-peace/", "ord_in_thread": 0, "title": "Civil War battlefield is now a tranquil spot", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published: Sun, September 6, 2015 @ 12:00 a.m. Civil War battlefield is now a tranquil spot \nAssociated Press \nSHARPSBURG, Md. \nUnimaginable violence once raged across the landscape of Antietam. Now, the sweeping hills and meadows whisper peace. \nSo consuming is the serenity at Antietam National Battlefield that it can seduce you into ignoring the story of the mayhem that unfolded here over 12 hours during the Civil War. Yet even incurious visitors will feel that history in their bones. \nI’ve cycled the park’s roads, walked its trails and sat in its quiet spaces more times than I can count and still don’t know which regiments performed what flanking movements. Markers describing everything are lost on me. I’ve watched the documentary at the visitor center and barely remember it. \nBut I can see those soldiers lining a far ridge – tens of thousands of them – as if they were still there and about to descend into the ghastly killing fields where corn now grows and waves of grain shudder in the breeze. \nAntietam’s spirits seem as real as the clouds, which you can’t put your hands on, either. \nMore than 23,000 were left dead, wounded or missing in the bloodiest one-day battle on U.S. soil, Sept. 17, 1862, turning back the Confederacy’s first invasion of the North at a staggering cost to both sides. \nAntietam is no less hallowed but certainly less known than the fields of Gettysburg 50 miles away. The two places are much different despite their bond in bloodshed. \nA few months after the 1863 Battle of Gettysburg that inflicted more than 50,000 casualties, Abraham Lincoln delivered a speech at the site counted among the greatest in history. For his troops at Antietam a year earlier, though, he had nothing like the Gettysburg Address – instead, just crisp, chilling marching orders: “Destroy the rebel army if possible.” \nMarkers and monuments at Antietam are scattered, modest and not the point of visiting. The power here is from breathtaking vistas along 9 miles of up-and-down roads, and from hiking trails across the fields. And unlike in the town of Gettysburg, which is loaded with touristy spots such as General Pickett’s Buffets, the town of Sharpsburg near Antietam has little more than an amazing ice cream shop, Nutter’s, where two baseball-sized scoops go for $2. \nA bucolic escape in all seasons, a little more than an hour from Washington, Antietam does not feel crowded even when the visitor-center parking lot is full. \nCycling here is a joy, with scant traffic, buttery pavement and swooping hills and hollows that seem calculated to get you going down so fast that you are halfway up the next climb before you have to pedal. (There are few very aerobic exceptions, where you quickly earn your ice-cream pig-out.) \nThe grace of this land comes into special focus several times a year at events such as the open-air Independence Day concert by the Maryland Symphony Orchestra and a candlelit display each December. Other stories of interest", "external_links": [], "published": "2015-09-06T07:00:00.000+03:00", "crawled": "2015-09-08T23:34:45.436+03:00", "highlightTitle": ""}