{"organizations": ["Singapore Holidays", "USP", "Universal Studios", "Singapore Tourism", "Universal Studios Japan"], "uuid": "be65f674f897b81f8dd39885e92a4c1233697124", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.artipot.com", "main_image": "", "site_section": "http://rss.artipot.com/category/188", "section_title": "Artipot: Travel > Destinations Articles", "url": "http://www.artipot.com/articles/1929639/10-reasons-why-one-should-must-visit-the-universal-studios-in-singapore.htm", "country": "US", "title": "10 Reasons why one should must visit the Universal Studios in Singapore (Vineet Bisht)", "performance_score": 0, "site": "artipot.com", "participants_count": 0, "title_full": "10 Reasons why one should must visit the Universal Studios in Singapore (Vineet Bisht)", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T10:03:00.000+03:00", "replies_count": 0, "uuid": "be65f674f897b81f8dd39885e92a4c1233697124"}, "author": "", "url": "http://www.artipot.com/articles/1929639/10-reasons-why-one-should-must-visit-the-universal-studios-in-singapore.htm", "ord_in_thread": 0, "title": "10 Reasons why one should must visit the Universal Studios in Singapore (Vineet Bisht)", "locations": ["Egypt", "Hong Kong", "Kung Fu Panda", "Malaysia", "Singapore", "Southeast Asia", "Asia", "Tokyo Disneyland", "Madagascar", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Vineet Bisht", "Betty Boop", "Woody Woodpecker", "Charlie Chaplin", "Fiona", "Alex", "Marilyn Monroe", "Gloria", "King Julien", "Stephen Spielberg", "Kowalski", "Vineet Singh", "Battlestar Galactica", "Winnie Woodpecker"], "text": "Sep 3, 2015 Ranked as Asia's Best Amusement park The Universal Studios in Singapore has beaten the famous amusement park in Asia like the Hong Kong's Ocean Park, Tokyo Disneyland and Universal Studios Japan. The online travel site trip advisor has ranked it top most amusement park in Asia. Southeast Asia's first Hollywood themed Amusement park Universal Studios in Singapore. Japan was the first one in the whole of the Asia to have Hollywood themed Amusement park. Since its opening in the year 2009, the park has attracted millions of visitors. Those venturing on Singapore and Malaysia holidays the park is a must visit. Seven themed Zones The whole park is divided into seven themed zones. Each zone is distinguishing from each other offering crazy fun to the visitors. Crazy Rides The park also features several crazy rides and most of them are exclusive to the Universal Studio Park. The park also features the world's tallest dueling roller coasters for the maximum fun. The coaster ride is based on a popular TV series. The other famous attractions are Battlestar Galactica, and a live music show featuring the Universal Monsters. Sci-Fi City Explore the Sci-Fi city a futuristic metropolis giving us a glimpse of what our modern day city would look like. While exploring the futuristic city people could enjoy various rides dueling roller coasters, Battlestar Galactica: Human vs. Cylon, based on television serials. A visit to the Sci-Fi surely would be the USP of Singapore tours and Universal Studio Park. Ancient Egypt Get close the Mummy and Pharaohs' tombs at the Ancient Egypt. The town is your gateway to closely known about the bygone golden era of the Egypt. The city theme is based on the popular Hollywood film, The Mummy. Enjoy various thrilling rides like Revenge of the Mummy: The Ride, and Treasure Hunters. The Lost World Based on the Hollywood blockbuster of Stephen Spielberg film the Jurassic Park. The Lost world is your ticket to living the experience the Dinosaurs at the Jurassic Park and Waterworld. Rides to enjoy at the lost world are Canopy Flyer, Jurassic Park Rapids Adventure, Waterworld with various food outlets. Singapore Tourism has taken new heights since the opening of the park. Far Far Away Inspired and themed around the famous animation blockbuster hit Shrek. While at the park witness the famous characters from the Shrek movie like Shrek, Donkey, Puss In Boots and Princess Fiona. Madagascar The zone is inspired by yet another Hollywood blockbuster franchise Madagascar. The zone is lavished with several crazy rides and special appearances by Alex, Gloria, King Julien, Skipper, Kowalski, Private, and Rico. Hollywood The entrance of the Park and the major attraction is a Broadway-style theater. It also features the copy of the Hollywood Walk of Fame. Special appearance by from the famous Hollywood characters like Po from Kung Fu Panda, Frankenstein's Monster, Woody Woodpecker, Winnie Woodpecker, Marilyn Monroe, Charlie Chaplin, Beetlejuice, Betty Boop and the Minions from Despicable Me. About the Author Vineet Singh likes to share his experiences about the different places he has been. This time explores Singapore with him as he unveils Universal studio on his Singapore Holidays . Rating:", "external_links": [], "published": "2015-09-03T10:03:00.000+03:00", "crawled": "2015-09-03T12:00:23.965+03:00", "highlightTitle": ""}