{"organizations": [], "uuid": "477ae568b83fa97a6d20d3569935b544722ef37d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/10/lufthansa-300x65.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lufthansa-to-take-legal-action-against-vereinigung-cockpits-group-collective-labor-agreement-committee/", "country": "US", "title": "Lufthansa To Take Legal Action Against Vereinigung Cockpit’s Group Collective Labor Agreement CommitteeTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Lufthansa To Take Legal Action Against Vereinigung Cockpit’s Group Collective Labor Agreement CommitteeTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "477ae568b83fa97a6d20d3569935b544722ef37d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lufthansa-to-take-legal-action-against-vereinigung-cockpits-group-collective-labor-agreement-committee/", "ord_in_thread": 0, "title": "Lufthansa To Take Legal Action Against Vereinigung Cockpit’s Group Collective Labor Agreement CommitteeTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lufthansa To Take Legal Action Against Vereinigung Cockpit’s Group Collective Labor Agreement Committee Published on : Wednesday, September 9, 2015\nThe response from the Vereinigung Cockpit pilots’ union to the numerous proposals and offers of talks submitted by Lufthansa has been further strike action, which today is affecting long-haul services and tomorrow will affect all the company’s short- and medium-haul routes, and thereby again subject its customers to unacceptable inconvenience.\nFor the past two years, right up until yesterday, Lufthansa has been approaching the Vereinigung Cockpit (VC) Group Collective Labor Agreement Committee with constructive proposals, offers and concessions. In doing so, the company has made concrete proposals on every open collective labor agreement issue, with a view to working together with the VC to jointly ensure the future viability and competitiveness of the company as a whole and of Lufthansa German Airlines in particular. In addition, Lufthansa has also demonstrated a willingness to discuss issues with the VC Group Collective Labor Agreement Committee that extend far beyond the latter’s responsibility and authority.\nSince it is evidently impossible at present to engage in constructive negotiations, Lufthansa has now resolved that:\nThe existing rights and benefits held by the cockpit personnel already at the company under their present Group Collective Labor Agreements (CLAs) will be frozen at their current levels until such time as any new Group CLA is concluded. In view of the company’s current inability to compete, however, no more new pilots will be employed under these Group CLA conditions at Lufthansa German Airlines, Lufthansa Cargo or Germanwings. As a result, the natural employee turnover within the present cockpit corps will lead to gradual reductions in these companies’ aircraft fleets. At the same time, every present cockpit crew member at these companies will retain their position.\n2.Any future discussions with the VC Group Collective Labor Agreement Committee will be limited to those issues within its responsibility and authority. These are in particular the Compensation CLA, the Umbrella CLA, the CLA on Transfers and Promotions, the CLA on Old Age Provisions, the CLA on Employee Representation and the CLA on Transitional Retirement Provisions.\n3.Lufthansa will carefully consider whether all the agreements between the company and the VC Group Collective Labor Agreement Committee on which notice has not yet been served can be meaningfully maintained.\n4.Lufthansa will submit a claim for compensatory damages against the Vereinigung Cockpit to the Frankfurt Labor Court. This claim will be based on the unlawfulness of the pilots’ strike of April 2014, when the Vereinigung Cockpit ordered strike action against Lufthansa Cargo even though the corresponding CLA was still in force. The damage caused to the Lufthansa Group as a result of the April 2014 strike totaled around EUR 60 million.\n5.Lufthansa is considering what possibilities (if any) the German Collective Bargaining Act (“Tarifeinheitsgesetz”) offers to prevent further harm to the company and its customers. In taking these actions Lufthansa is assuming responsibility for the future competitiveness and viability of the entire company, for its customers (who are currently being subjected to unacceptable inconvenience) and for its 120,000 employees from all personnel groups whose jobs are directly dependent on the company’s future.\n“We would have liked to finally resume our CLA negotiations with the Vereinigung Cockpit instead of having to respond with this further escalation,” says Bettina Volkens, Chief Officer Corporate Human Resources & Legal Affairs at Deutsche Lufthansa AG. “I also appeal to our pilots to live up to their personal responsibilities. With the strike plans outlined by the VC for the time between now and the end of this year, the financial damage to our company would exceed 100,000 euros per pilot. It is high time we sat down and found a solution here.”\nSource:- Lufthansa", "external_links": [], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T04:20:17.905+03:00", "highlightTitle": ""}