{"organizations": [], "uuid": "ad802d2f0e28751392efa1f478d6bcfea792151d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30096217/csa-group-opens-a-comprehensive-transportation-laboratory-in-leyland-united-kingdom", "country": "US", "title": "CSA Group Opens a Comprehensive Transportation Laboratory in Leyland, United Kingdom", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "CSA Group Opens a Comprehensive Transportation Laboratory in Leyland, United Kingdom - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "ad802d2f0e28751392efa1f478d6bcfea792151d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30096217/csa-group-opens-a-comprehensive-transportation-laboratory-in-leyland-united-kingdom", "ord_in_thread": 0, "title": "CSA Group Opens a Comprehensive Transportation Laboratory in Leyland, United Kingdom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " CSA Group\nUpdated facility offers technologies for transportation testing and development\nLEYLAND, England , Sept. 23, 2015 /PRNewswire/ - CSA Group, a global provider of testing and certification services and leading standards development organisation, announced today the opening of its updated laboratory for testing and certification of equipment used in transportation. Utilising the latest technology, the laboratory is one of the most comprehensive transportation testing facilities in Europe .\n\"As a part of our global business strategy to invest in the European market and the transportation sector, we are delighted to offer our European clients expanded services in Leyland. The laboratory has been successfully supporting transportation companies in the United Kingdom and globally for over 30 years, and we can now offer more tests and certifications than ever before,\" said Magali Depras, CSA Group Chief Operating Officer.\nThe laboratory is over 57,400 square feet and has invested in new equipment and facilities to offer state-of-the-art services. The modernisation includes a new drive-in chamber with temperature testing ranging from -60°C to 120°C, an Accelerometer Calibration lab, new engine test cell upgrades and electric motor testing.\n\"Transportation is a key business sector for us, and the experienced engineering team in Leyland offers our clients the support and expertise required for European and global markets,\" said Ralf Schunk , CSA Group Regional Vice President, Europe . \"Together with our state-of-the-art EMC testing laboratory in Strasskirchen, Germany , and through our market-leading testing laboratory in Leyland, UK we provide a very strong value proposition to our clients as we can now test almost every part of a vehicle.\"\nThe Leyland facility offers structural, NVH, whole vehicle, powertrain, component, environmental and vibrating testing. It is equipped with a dynamic/flexible modular beam system with strong floor points to aid in a diverse range of testing capabilities. It offers dedicated confidential test bays, durability testing and onsite instrumentation, fabrication and machining. It is an ISO 17025 test laboratory and ISO 17025 approved calibration laboratory.\nCSA Group has expanded its expertise in transportation to include commercial and passenger vehicles, off-road vehicles, rail, aerospace, marine, alternative energy vehicles and infrastructure. CSA Group has transportation laboratories in Canada , the United States and Europe offering global market access.\nAbout CSA Group\nCSA Group is an independent, membership association dedicated to safety, social good and sustainability. Its knowledge and expertise encompass standards development; training and advisory solutions; global testing and certification services across key business areas including hazardous location and industrial, transportation, plumbing and construction, medical, safety and technology, appliances and gas, alternative energy, lighting and sustainability; as well as consumer product evaluation services. The CSA certification mark appears on billions of products worldwide. For more information about CSA Group visit www.csagroup.org\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.csagroup.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=TO07224&Transmission_Id=201509230800PR_NEWS_USPR_____TO07224&DateId=20150923", "http://www.xmlnews.org/ns/"], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-23T19:05:49.871+03:00", "highlightTitle": ""}