{"organizations": [], "uuid": "c61659e8e2577687562ffcb81eed934823a83192", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63274/qatar-airways-rolls-out-croamis", "country": "US", "title": "Qatar Airways Rolls Out 'Croamis'", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Qatar Airways Rolls Out 'Croamis'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T13:43:00.000+03:00", "replies_count": 0, "uuid": "c61659e8e2577687562ffcb81eed934823a83192"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/63274/qatar-airways-rolls-out-croamis", "ord_in_thread": 0, "title": "Qatar Airways Rolls Out 'Croamis'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Qatar Airways Rolls Out 'Croamis'   \nSep 02, 2015 eTN   \nQatar Airways rolls out 'Croamis' which is the most comprehensive and advanced cargo management system in the industry. \nState-of-the-art airline cargo management system developed by Qatar Airways to automate its end-to-end business processes. \nQatar Airways has designed and implemented a next generation cargo management system named CROAMIS to manage its end-to-end airline cargo business processes. CROAMIS, Qatar Airways’ Cargo Reservations, Operations, Accounting and Management Information System, is a single system serving the airline’s entire global cargo network, designed to scale with the future growth expected. \nCROAMIS has been developed in-house by Qatar Airways through an innovative co-funded model with global IT services provider Wipro. It is an integrated system that enables comprehensive automation of the airline’s core business functions and supports collaborative operations across the airline’s cargo supply chain. The system incorporates the latest practices in business functions including sales, pricing, cargo ground handling, and ULD Management. \nCROAMIS provides an integrated revenue management module for inventory management, cargo load and revenue optimisation and also has a robust cargo revenue accounting suite. It has been developed using a platform independent state-of-the-art technologies, which facilitates modular deployment and is also cloud ready. \nQatar Airways Group Chief Executive, His Excellency Mr Akbar Al Baker said: “CROAMIS has been developed by Qatar Airways’ IT professionals to meet the specific needs of our growing cargo business, Qatar Airways Cargo, which is today the world’s fifth largest cargo airline. \n“Designed to anticipate our future business requirements, as well as the technological developments of the aviation industry, CROAMIS will enable further efficiencies in Qatar Airways Groups’ day-to-day business operations, and provides additional analytical information to inform our transportation planning, decision making processes.” \nMr Ulrich Ogiermann, Qatar Airways Chief Officer Cargo, added: “Qatar Airways Cargo is proud to launch CROAMIS, our state-of-the-art next generation business process automation system, which provides 100% coverage of all cargo business functions in a single application. \n“CROAMIS will align our end-to-end cargo business processes and provide the entire global cargo network with a seamless system that will support our projected growth in the coming years.” \nMr Srinivasan A. T., Qatar Airways Chief Information Officer, added: “We have always seen technology as a key business enabler. Our growing cargo business needed a scalable and future proof system that works efficiently and effectively for all the stakeholders in the cargo supply chain, is accessible on any device from anywhere and can be quickly configured to support ever-changing business scenarios. This is what CROAMIS delivers and we are committed to taking the system further forward as the cargo business becomes increasingly e-enabled and all the participants in the supply chain further integrate their systems.” \nQatar Airways has a global airfreight network, operating to more than 150 destinations worldwide, and is witnessing rapid growth each year. This growth and development presents new opportunities to deploy cutting-edge technology throughout the airline’s business management process. With CROAMIS Qatar Airways can provide full automation for the entire ground handling operation at the airline’s Doha hub at Hamad International Airport. Built on service oriented architecture using Java technology, CROAMIS is an internet-based solution compatible with all mobile platforms. \nCROAMIS facilitates service improvements such as track and trace, e-booking and e-freight functions via the Qatar Airways Cargo’s website, thereby allowing airfreight customers to access real time information regarding their shipments.", "external_links": [], "published": "2015-09-02T13:43:00.000+03:00", "crawled": "2015-09-02T14:31:01.238+03:00", "highlightTitle": ""}