{"organizations": [], "uuid": "487b2beeb24fed658e37e7a997041ac93e5d38d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150921121915-2-concorde-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/09/21/travel/concorde-return-to-flight/index.html", "country": "US", "title": "Concorde may fly again. Seriously", "performance_score": 2, "site": "cnn.com", "participants_count": 1, "title_full": "Concorde may fly again. Seriously - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T18:24:00.000+03:00", "replies_count": 0, "uuid": "487b2beeb24fed658e37e7a997041ac93e5d38d6"}, "author": "Karla Cripps", "url": "http://edition.cnn.com/2015/09/21/travel/concorde-return-to-flight/index.html", "ord_in_thread": 0, "title": "Concorde may fly again. Seriously", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) The aviation world is abuzz with reports that a group of Concorde fans may have raised enough money to get the historic supersonic jet back in the skies once again.\nAccording to the Telegraph newspaper , \"Club Concorde\" has raised £120 million ($186 million) for its \"return to flight\" plan and hopes to get one of the decommissioned aircraft back in the skies by 2019.\nThe group describes itself as \"ex-captains, ex-charterers and people passionate about Concorde, working together to keep Concorde in people's hearts and minds.\"\nClub Concorde says it has its sights on two Concordes -- both in France.\n\"The plan would be to purchase one of the Concorde and operate her as a private, heritage aircraft under neutral livery,\" says the club on its website.\n\"All restoration to flight costs would be borne by Club Concorde International who would also finance the construction of maintenance/display hangars at both the French and UK bases.\"\nIs this even possible?\nEven if the enthusiasts have the money, putting a decommissioned plane back in the skies takes more than just capital.\n\"The greatest obstacle is the refusal by the aircraft's manufacturer -- formerly British Aerospace-Aerospatiale, now Airbus -- to lend its support to a restoration,\" said aviation journalist David Kaminski-Morrow, air transport editor of Flightglobal.com .\n\"Concorde is an immensely complex supersonic aircraft and the Civil Aviation Authority in the UK will not entrust the safe upkeep of its airframe and systems to a group of enthusiasts, regardless of their passion, without this technical support in place.\n\"If it isn't there, the aircraft won't be allowed to fly. It's as simple as that.\"\nAt the time of publishing, CNN had yet to receive a response from Airbus on whether it would theoretically provide any required support.\nKaminski-Morrow points to issues faced by an initially successful effort to restore an Avro Vulcan to flight.\nThough the aircraft, which shares some of Concorde's DNA but is nowhere near as complicated, was able to return to the skies, it suffered a withdrawal of technical backing and had to be grounded earlier this year , he said.\n\"British Airways looked into keeping a single Concorde operating, for heritage purposes, but could not justify the expense,\" he said.\n\"When you bear in mind that BA didn't have the problems of finding an operational aircraft and gathering engineering, maintenance, piloting and training resources, it puts the enthusiasts' workload in perspective.\"\nFinding a suitable aircraft\nSourcing a suitable Concorde will also be extremely difficult, added Kaminski-Morrow.\n\"Some have been treated better than others, but even the best-condition aircraft will need extensive maintenance checks and possible modification to bring it into line with civil aircraft mandates introduced since the end of Concorde service.\n\"Concorde was a unique aircraft type that demanded tailored parts, systems, maintenance techniques, and so on, and so few aircraft were built that there isn't a vast pool of spares and engines to raid.\"\nEven if a suitable aircraft is identified, there's the matter of obtaining it, said Kaminski-Morrow.\n\"British Airways has steadfastly refused to entertain the possibility because it's not on the side of the enthusiasts,\" said Kaminski-Morrow. \"Concorde is part of its image and it doesn't want to hand over this iconic part of its history to well-meaning tinkerers, especially those whose desire to see the aircraft fly is clouding their judgment over the extent and nature of the associated problems -- of which money is arguably the least difficult to overcome.\"\nMeanwhile, the Musee de l'Air et de l'Espace issued a statement Sunday saying its Concordes are as much a part of French heritage as the Mona Lisa or the Palace of Versailles, aren't for sale at any price and won't fly again.\nNo shortage of demand, says expert\nProcurement and maintenance challenges aside, aviation expert Tom Ballantyne, chief correspondent for the magazine Orient Aviation , says that if the group is actually able to purchase a Concorde, the plane itself will likely be mechanically sound.\n\"British Airways once stripped one of their Concordes back to bare bones after years of service and found it was in perfect condition with no wear and tear at all,\" he said.\n\"Given it gets proper restoration there shouldn't be any issue getting it passed by the regulators. While the plane did have that dreadful crash with Air France that's not why it was taken out of service.\n\"Essentially it simply became uneconomic when the price of fuel skyrocketed to record levels. Concorde is a real gas guzzler.\"\nIn terms of flight restrictions, Ballantyne said the group would face the same issues as airlines did when the plane was in commercial service: noise.\n\"Because of the sonic boom it will only be able to fly at supersonic speed over the oceans, in other words unpopulated areas,\" he said.\n\"There will also be restrictions at many airports because a Concorde is very noisy.\"\nBallantyne says the Concorde could do well if it's used as part of a charter business.\n\"Both British Airways and Air France used it for charters when it was in service. There are plenty of rich Americans (and others) who'll pay good money for a round the world trip on a Concorde.\"\nFor a look back at the plane's captivating history, click through the above gallery.", "external_links": ["http://www.telegraph.co.uk/news/uknews/defence/11636534/Worlds-last-flying-Vulcan-bomber-prepares-for-goodbye-season.html", "http://www.museeairespace.fr/newsletter-b/dementi-les-concorde-du-musee-de-lair-et-de-lespace-ne-sont-pas-a-vendre/", "http://www.telegraph.co.uk/luxury/travel/83904/concorde-flights-planned-to-resume-and-aircraft-proposed-for-display-in-london.html", "https://www.flightglobal.com/", "http://www.orientaviation.com/"], "published": "2015-09-21T18:24:00.000+03:00", "crawled": "2015-09-21T15:24:38.006+03:00", "highlightTitle": ""}