{"organizations": [], "uuid": "be28b75da70c16adaaeaf5bc701d9c9f20f05ce0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/FL00220LOGO.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/sixt-rent-a-car-opens-new-branch-to-service-xjet-at-centennial-airport/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Sixt rent a car opens new branch to service XJet at Centennial AirportTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Sixt rent a car opens new branch to service XJet at Centennial AirportTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "acb9c24bb2b6c5186d7ac6c15bf4612396df5f0c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sixt-rent-a-car-opens-new-branch-to-service-xjet-at-centennial-airport/", "ord_in_thread": 0, "title": "Sixt rent a car opens new branch to service XJet at Centennial AirportTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sixt rent a car opens new branch to service XJet at Centennial Airport  \nSixt SE and its U.S. Operating Unit announce the opening of a new branch to service private aviation customers travelling to XJet at Centennial Airport in Englewood, Colorado, the third busiest General Aviation Airport in the United States. This new branch is another example of Sixt’s commitment to rapid expansion into the private aviation segment.\n \n \n“Our premium fleet, service and fair pricing policy are a natural match for the needs of the discerning private aviation customer,” said Craig Olson, Executive Vice President of North America Development for Sixt. “Customers will enjoy driving our fleet of Audi, BMW, Mercedes-Benz and other great vehicles. We’ll also have professionally trained Sixt staff stationed onsite at XJet to facilitate a seamless transition from the jet to the road.”\n \n \n“XJet is thrilled to partner with Sixt and welcome them to our aviation campus at Centennial Airport,” said Henning Schymik, Senior Vice President for XJet. “This partnership allows us to further enhance the premium product that we provide to our members and customers.”\n \n \nSixt operates corporate branches servicing airports in Atlanta, Charlotte, Dallas, Detroit, Ft. Lauderdale, Knoxville, Los Angeles, Miami, Orlando, Phoenix, San Jose, Seattle, Tampa and West Palm Beach (www.sixt.com), along with many downtown and several Fixed Base Operator (FBO) branches in the US. The Sixt franchise system is a proven international success, with more than 80 master franchisees operating from more than 1,000 worldwide locations. Automotive dealership owners, independent car rental operators, and entrepreneurs are great candidates for Sixt franchises. In the U.S., Sixt franchisees are already operating locations in nine states with openings in additional states expected later this year. Sixt plans to further expand in the U.S. with a step by step, measured approach of both franchise and corporate expansion.\n \nSource:- Centennial Airport", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T18:48:11.692+03:00", "highlightTitle": ""}