{"organizations": [], "uuid": "2119ce34fb8bf6cfc323d4aa083f7d063c844b8f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.detroitnews.com", "main_image": "http://www.gannett-cdn.com/-mm-/da12c9c267181e7bb9cc1b4668848222702e2d0e/c=0-104-3384-2008&amp;r=x1683&amp;c=3200x1680/local/-/media/2015/08/31/DetroitNews/B99301460Z.1_20150831234225_000_GGEJ1CQ1.1-0.jpg", "site_section": "https://feeds.feedblitz.com/detroit/travel#", "section_title": "Detroit News - Travel", "url": "http://www.detroitnews.com/story/business/2015/08/31/frontier-offer-florida-flights-metro/71499344/", "country": "US", "title": "Frontier to offer $39 Florida flights from Metro", "performance_score": 0, "site": "detroitnews.com", "participants_count": 2, "title_full": "Frontier to offer $39 Florida flights from Metro", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T02:42:00.000+03:00", "replies_count": 1, "uuid": "03da8bb8b86349b0256d1eef65808a878036c4f5"}, "author": "Leonard N. Fleming, The Detroit News", "url": "http://www.detroitnews.com/story/business/2015/08/31/frontier-offer-florida-flights-metro/71499344/#post-0", "ord_in_thread": 0, "title": "Frontier to offer $39 Florida flights from Metro", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Frontier Airlines is to announce Tuesday that it will extend its daily nonstop service from Metro Airport to Orlando starting Nov. 18. (Photo: Tony Dejak / AP) \nMetro Detroiters seeking cheaper flights to Orlando will be in luck this fall when Frontier Airlines begins offering daily non-stop service to the popular Florida destination from Detroit Metropolitan Airport.\nThe Frontier flights, scheduled to begin on Nov. 18, will be formally announced by airport and airline officials on Tuesday. The flight, which will cost $39 one-way on select dates, will be serviced by an Airbus 320 aircraft that seats 180, officials said.\nAirport officials have been pushing for more competition on popular routes to drive prices down and boost traffic.\n“We are excited to offer even more low-fare service for Detroit with this new flight,” said Daniel Shurz, chief commercial officer for Frontier.\nThe Orlando route, to be flown once a day, will be Frontier’s fourth from Detroit. It also offers nonstop flights to Denver, Washington Dulles and Trenton, New Jersey.\n“Orlando is currently our customers’ second-most preferred destination from Detroit and for that reason, was one of our top priorities for new air service,” said Thomas Naughton, Wayne County Airport Authority CEO.\nAccording to data from the International Air Transport Association, the average fare between Detroit and Orlando for the 12-month period ending June 2015 was $135 each way, excluding taxes and bag fees.\nDelta/Northwest, Air Tran, Spirit and Southwest used to service the Detroit-to-Orlando route. The passenger load slipped from 1,416 to 1,132 a day each way between 2008 and 2010. By April 2014 only Spirit and Delta served the route, and traffic was down to 977 by June 2015, airport officials said.\nJoe Cambron, director of Air Service Development, said gaining service in the Detroit-Orlando market “will be a big driver in getting those numbers back where they were.”", "external_links": [], "published": "2015-09-01T02:42:00.000+03:00", "crawled": "2015-09-01T14:36:41.404+03:00", "highlightTitle": ""}