{"organizations": [], "uuid": "9321aeab6e924df7fb586c022b9335840b9e8869", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63332/wyse-and-nsw-co-host-inaugural-wyse-exchange-austrialia-youth-tr", "country": "US", "title": "WYSE and NSW to Co-host Inaugural WYSE Exchange Austrialia Youth Travel Trade Event April 2016", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "WYSE and NSW to Co-host Inaugural WYSE Exchange Austrialia Youth Travel Trade Event April 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T16:24:00.000+03:00", "replies_count": 0, "uuid": "9321aeab6e924df7fb586c022b9335840b9e8869"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/63332/wyse-and-nsw-co-host-inaugural-wyse-exchange-austrialia-youth-tr", "ord_in_thread": 0, "title": "WYSE and NSW to Co-host Inaugural WYSE Exchange Austrialia Youth Travel Trade Event April 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WYSE and NSW to Co-host Inaugural WYSE Exchange Austrialia Youth Travel Trade Event April 2016   \nSep 03, 2015 eTN   \nThe World Youth Student and Educational (WYSE) Travel Confederation and Destination New South Wales (Destination NSW), with the support of the Backpacker Operators Association New South Wales (BOA NSW) have partnered to launch WYSE Exchange Australia, an exclusive event for Australian youth travel focused businesses looking to connect with international Buyers. \nThe inaugural WYSE Exchange Australia event is scheduled to take place in Sydney from 6-8 April 2016 alongside BOA New South Wales annual BOA Ball. The three day event program will include scheduled workshop appointments between 30 leading international buyers and 60 Australian suppliers of backpacker, youth, adventure and education products and experiences, a full day educational conference, buyer familiarisations and social networking events. \nWYSE Travel Confederation Director General David Chapman says, “In 2013 Destination NSW was instrumental in attracting the World Youth & Student Travel Conference (WYSTC) to Sydney and we are delighted to once again be partnering to deliver an exclusive and targeted opportunity for Australian operators to showcase their products and services in key markets, learn more about industry trends, challenges and opportunities and importantly help establish vital trade connections and build on Australia’s legacy as a highly desirable destination for young people from around the world.” \nAustralia holds its position as a premier destination for youth travellers from around the globe with year ending March 2015 arrival data revealing that the backpacker market to Australia accounted for 13% of the total tourism spend in Australia, $3.2 Bn. With just under 600,000 backpackers visiting Australia annually, this important market segment continues to make a valuable economic contribution to Australia’s inbound tourism industry. \nWith Sydney remaining the most visited destination in Australia attracting 72.8% of total visitation, followed by Melbourne (48.4%), Brisbane (34.5%) and Cairns (33.1%) WYSE Exchange Australia is the perfect opportunity for operators to leverage consumer demand for travel products and services that provide enriching experiences from travelling, studying and working abroad and to connect with distributors of outbound youth travellers from key international source markets. \nDestination NSW Chief Executive Officer, Sandra Chipchase said Sydney was the ideal destination to co-host the World Youth Student and Educational Exchange Australia. “This important youth travel industry event will be the first within Australia to specifically network Australian youth tourism products to international Buyers. “It is an outstanding opportunity to showcase all that Sydney and Regional NSW have to offer to promote the vitally important youth sector to international buyers and I encourage the industry to get involved. \n“Sydney is a major destination in the Asia Pacific for events like the WYSE Exchange Australia and we look forward to the opportunity to reinforce why NSW is the number one tourism and major events destination in Australia.” \nOrganisations interested in taking part in WYSE Exchange Australia will have the opportunity to register for this event at the end of September. This cost-effective event will be open to the Australian industry with discounts provided to WYSE Travel Confederation members.", "external_links": [], "published": "2015-09-03T16:24:00.000+03:00", "crawled": "2015-09-03T22:31:47.486+03:00", "highlightTitle": ""}