{"organizations": [], "uuid": "5ee47f8d5431184a4dbc8118130fb101021c6a04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03420/Essilor_main_pic_0_3420882a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-01.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/health/uv-lenses/11826139/UV-rays-protect-eyes-against-the-invisible-enemy.html", "country": "US", "title": "UV rays: protect eyes against the invisible enemy", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "UV rays: protect eyes against the invisible enemy - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T18:14:00.000+03:00", "replies_count": 0, "uuid": "5ee47f8d5431184a4dbc8118130fb101021c6a04"}, "author": "Tim Adler", "url": "http://www.telegraph.co.uk/sponsored/health/uv-lenses/11826139/UV-rays-protect-eyes-against-the-invisible-enemy.html", "ord_in_thread": 0, "title": "UV rays: protect eyes against the invisible enemy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Learn more about UV protection Unpacking the holiday suitcase and putting the bottle of sun cream and your sunglasses away, you may think you do not have to worry about sunburn for another year. Most of us don’t bother with high sun-protection-factor (SPF) sunscreen or sunglasses unless we’re directly under the sun. Yet we are generally unaware that ultraviolet rays are apparent all year round – even on cloudy days – and can damage eyes as well as skin. Unwitting exposure to UV rays has the potential to cause multiple eye problems, from damage to the retina at the back of your eye through to driving cataract formation on the lens within our eyes. So it’s important to protect eyes against UV rays throughout the year. “Ultraviolet light is visible light’s naughty neighbour,” explains Andy Hepworth, professional relations manager at global lens manufacturer Essilor. “There can be just as much invisible, harmful UV light penetrating your eyes on autumn days. People assume there is no UV when it is not so sunny.” True, all clear lenses and sunglasses should offer the wearer frontal protection, guarding them from the amount of UV light going into the eye. However, UV light also bounces off the back of the lens, passing straight into the eye. Because people are living longer, we are going to be exposed to more harmful sunlight and radiation over the course of a lifetime A solution for this comes in the form of Crizal UV Protective Lenses. The lenses are specifically made to protect spectacle wearers against UV damage, and are designed not just for sunglasses but clear lenses as well. The lenses reduce the amount of potentially damaging UV entering the eye. Worldwide, three million people go blind each year from cataracts caused or enhanced by sun exposure. UV rays may also lead to macular degeneration, a leading cause of vision loss for older people. Doctors began warning people about the dangers of skin cancer in the Sixties. SPF product labelling was introduced in the Seventies. Essilor, which has been manufacturing Crizal lenses since 1993, added UV protection on both the front and back lens surfaces of the lenses in 2010. The product now known as Crizal UV is at the vanguard of warning people about the danger of UV rays for eyes. Hepworth says: “Because people are living longer, we are going to be exposed to more harmful sunlight and radiation over the course of a lifetime. “You should ask your optician for a spectacle lens with a high E-SPF value.” And it is not just the eye itself – sun-cream manufacturers warn against spreading lotion too close to the eye, which causes irritation. This leaves the area around the eye dangerously exposed. Skin cancer around the eyelids is also linked to prolonged UV exposure. Spectacle lenses are the only option to protect the skin around the eyes. Clear view Crizal UV Protective Lenses not only protect the eyes against harmful UV light, but they also reduce glare when working at a computer, watching TV or driving at night. The lenses physically repel dust and water, and are also smudge-resistant. Find out more about Crizal UV Protective Lenses at essilor.co.uk Watch the video to discover the benefits of Crizal UV Protective Lenses >>", "external_links": [], "published": "2015-09-01T18:14:00.000+03:00", "crawled": "2015-09-01T18:43:27.760+03:00", "highlightTitle": ""}