{"organizations": [], "uuid": "02bbae5e149f34a7d7e0aab24a380aecd99617e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/news/when-bags-take-priority-over-people/ar-AAe73oG", "country": "US", "title": "When bags take priority over people", "performance_score": 0, "site": "msn.com", "participants_count": 3, "title_full": "When bags take priority over people", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 2, "uuid": "33c74e3c02cea8342037972594fa0ac076823c46"}, "author": "Andrew Hill", "url": "http://www.msn.com/en-us/travel/news/when-bags-take-priority-over-people/ar-AAe73oG#post-0", "ord_in_thread": 0, "title": "When bags take priority over people", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When bags take priority over people The Financial Times 9 hrs ago Andrew Hill “Move quickly to the closest usable exit, taking nothing with you.” Yet here again are images of passengers trundling suitcases and carrying hand luggage across the runway, after evacuating a British Airways aircraft that caught fire before take-off at Las Vegas.\nThe last time such safety breaches were publicised was after the fatal crash of an Asiana Airlines jet in San Francisco in 2013. Some commenters on social media even attributed passengers’ thoughtlessness to a Chinese tendency to put material things ahead of human lives (Chinese nationals accounted for half those on the flight).\nIf nothing else, the BA accident has disproved that slur: under pressure, the British are just as capable of the same act of stupidity.\nJacob Steinberg, a Guardian journalist who was on the BA flight, gently admonishes critics : “If you weren’t there, how do you know how you would have reacted? People do odd things when they panic.”\n© FT EP0ERR Airplane passengers in the cabin storing hand luggage in the overhead lockers at the start of their plane flight True. One Asiana passenger recalled he had gathered his belongings out of habit. When we are allowed to carry so much, and of such material value, on to aircraft, it may be natural to grab those things before exiting. In the end, the Asiana accident report did not refer to the problem.\nBut plenty of other incidents are complicated, sometimes fatally, by bag-toting passengers. A study of 46 evacuations from June 2000 found half of passengers tried to take items with them, including large framed pictures and musical instruments.\nAs pilot and author Patrick Smith has written : “Leave your stuff. It will all be returned to you later. [If] it winds up incinerated, well, you should be happy to have lost it. Lest it have been you in there.”\nHappily, there were no fatalities in the BA fire. But if I had been the last passenger out, I might well have asked those in front of me why their carry-ons came first.\n ", "external_links": ["http://www.ntsb.gov/news/events/Pages/June_27_-_Safety_Study_Emergency_Evacuation_of_Commercial_Airplanes.aspx", "http://www.theguardian.com/us-news/2015/sep/09/british-airways-fire-we-saw-the-smoke-the-smell-was-bitter-it-was-time-to-panic", "http://edition.cnn.com/2013/07/09/travel/asiana-passenger-safety/", "http://www.ft.com/", "http://www.askthepilot.com/emergency-etiquette/", "http://www.ft.com/intl/cms/s/0/f4540e7e-5692-11e5-a28b-50226830d644.html#axzz3lAEmeky3"], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-10T03:32:34.172+03:00", "highlightTitle": ""}