{"organizations": [], "uuid": "4dca0bdcdabcc7c5ef7b352549dccff7ddd77bd1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30046842/colorado-most-recent-state-to-award-grant-to-vng", "country": "US", "title": "Colorado Most Recent State To Award Grant To VNG", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Colorado Most Recent State To Award Grant To VNG - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "4dca0bdcdabcc7c5ef7b352549dccff7ddd77bd1"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30046842/colorado-most-recent-state-to-award-grant-to-vng", "ord_in_thread": 0, "title": "Colorado Most Recent State To Award Grant To VNG", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " VNG\n- 24/7 fast-fill CNG fueling facility to be located in downtown Denver\n- Co-located within an existing retail gasoline station in a consumer-friendly environment\nBALA CYNWYD, Pa. , Sept. 16, VNG was recently awarded a grant by the Colorado Energy Office, in partnership with the Regional Air Quality Council and the Colorado Department of Transportation to build a fast-fill CNG fueling facility in Denver, CO. This award is the most recent example of state public-private collaboration involving VNG to encourage the nationwide use of CNG as a mainstream transportation fuel. The Denver station will be co-located within a major oil branded gasoline station featuring a convenience store.\n\"This grant is aligned with our model of offering fast-fill CNG fueling within traditional gasoline stations to support the development of the natural gas vehicle market for light-duty fleet and consumer drivers,\" said Robert Friedman , Chief Operating Officer of VNG.\nProceeding with its nationwide expansion which includes locations in large metropolitan markets such as Houston , Dallas , Philadelphia and Milwaukee , VNG's CNG facilities offer fill times comparable to gasoline and all of the amenities drivers are accustomed to when purchasing fuel, including a full-service convenience store with high quality food options, and clean rest rooms.\n\"We make fueling with CNG by VNG as fast, friendly, convenient and accessible as gasoline. VNG eliminates CNG fueling infrastructure costs for the fleet and the retailer while providing them with a high quality CNG fueling experience,\" added Mr. Friedman.\n\" Colorado remains a national leader in providing incentives to grow the use of natural gas as an attractive alternative transportation fuel,\" Friedman added. \"This is another example of the growing support from federal and state government and regulatory agencies to encourage the use of CNG as a transportation fuel to help achieve the nations' clean air and energy independence objectives,\" Friedman concluded.\nAbout VNG\nA leading developer of retail CNG fueling facilities within gasoline stations, VNG offers CNG by VNG nationwide to support and accelerate the widespread use of light-duty NGVs by national and regional fleets, and eventually the mass-market consumer segment. VNG installs, maintains, monitors and operates its company-owned CNG fueling equipment, providing fleets with cost-effective, turnkey CNG by VNG fueling services. VNG is the nation's CNG fueling solution. For more information, please visit the company's website at www.vng.co or call (610) 709-5500.\nContact: Renee Ebersole , VNG (610) 721-3705 rebersole@vng.co\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/colorado-most-recent-state-to-award-grant-to-vng-300144350.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=PH04022&Transmission_Id=201509161431PR_NEWS_USPR_____PH04022&DateId=20150916", "http://www.vng.co/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/colorado-most-recent-state-to-award-grant-to-vng-300144350.html"], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T22:10:33.006+03:00", "highlightTitle": ""}