{"organizations": [], "uuid": "23574816acf69a4b06045c6707b15a015b24c179", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25585", "country": "", "title": "Universal Studios goes local at annual horror event", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "Universal Studios goes local at annual horror event", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "23574816acf69a4b06045c6707b15a015b24c179"}, "author": "Dannon Har, Singapore, September 30, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25585", "ord_in_thread": 0, "title": "Universal Studios goes local at annual horror event", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Universal Studios goes local at annual horror event Dannon Har, Singapore, September 30, 2015 \nUNIVERSAL Studios Singapore (USS) will be presenting the fifth edition of its annual Halloween season scarefest, Halloween Horror Nights 5 (HHN5), running from October 2 for 14 nights across five consecutive weekends. \n\nThis year, the main theme revolves around the True Singapore Ghost Stories novels by Singapore author Russell Lee, featuring four haunted houses with locales such as a HDB block and MRT trains. \n\nCredit: Universal Studios Singapore \n\nGuests will also get to meet familiar characters from the novels, feel their way through pitch-black darkness and journey through the underworld at these venues. \n\nThere are also the three scare zones; Hungry Ghosts, a hidden village with cursed villagers; conTERMINATED, a quarantined sector where diseased inhabitants fight for their survival; and The Invaders, where extra-terrestrial inhabitants have taken over Earth after crashing their space probe. \n\nSelected rides and attractions will remain open during event nights. There will also be a special screening of feature film Scared Shrekless at the Shrek 4-D Adventure. \n\nFor delegates attending ITB Asia this year, HHN5 will be one of the stops on the welcome itinerary. \n\n\"Last year we hosted them at SEA Aquarium, this year we wanted to do something a little more unique, so to do the event in USS with haunted houses just gives a different spin to the event that you really can't get anywhere else,\" said Jason Horkin, vice president of attractions at Resorts World Sentosa. \n\nExplaining how the experience differs for the delegates, he said: \"The most different thing is it will be private. It won't be in the throng of the crowds and they will be able to take their time to see everything.\" \n\n\"Plus they will be having dinner in the theme park, it will be a party, different from the usual guest experience.\" \n\nAccording to Horkin, general attendance at the event has tripled since the first few years, thus the allocation of 14 nights, the most number of nights yet, for the event. \n\nHHN5 begins at 19.30 on all nights, ending at 01.30 on October 10, 16-17, 23-24 and 30 to November 3, and at 00.30 for the rest of the nights. Tickets are now on sale for S$68 (US$48).", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T10:35:47.605+03:00", "highlightTitle": ""}