{"organizations": [], "uuid": "fef561f5aac2324f5d0dcfaf731aad92dd85c48a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/Carnival-Cruise.png", "site_section": "http://www.travelandtourworld.com/news/article/category/cruise/", "section_title": "Cruise News| Online Cruise Industry News| Cruise Market Trends | Cruise Business News| Travel Industry NewsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/carnival-city-of-mobile-announce-year-long-season-of-cruises-from-port-of-mobile-aboard-carnival-fantasy-beginning-in-2016/", "country": "US", "title": "Carnival, City Of Mobile Announce Year-Long Season Of Cruises From Port Of Mobile Aboard Carnival Fantasy Beginning In 2016Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Carnival, City Of Mobile Announce Year-Long Season Of Cruises From Port Of Mobile Aboard Carnival Fantasy Beginning In 2016Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "fef561f5aac2324f5d0dcfaf731aad92dd85c48a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/carnival-city-of-mobile-announce-year-long-season-of-cruises-from-port-of-mobile-aboard-carnival-fantasy-beginning-in-2016/", "ord_in_thread": 0, "title": "Carnival, City Of Mobile Announce Year-Long Season Of Cruises From Port Of Mobile Aboard Carnival Fantasy Beginning In 2016Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carnival, City Of Mobile Announce Year-Long Season Of Cruises From Port Of Mobile Aboard Carnival Fantasy Beginning In 2016 Published on : Wednesday, September 23, 2015\nCarnival Cruise Line and the City of Mobile announced today that the Carnival Fantasy will operate a year-long schedule of four- and five-day cruises to Mexico from the Mobile Cruise Terminal beginning in fall 2016.\nPrior to its deployment to Mobile, the 2,056-passenger Carnival Fantasy will undergo a multi-million-dollar refurbishment that will add several elements of the cruise line’s popular Fun Ship 2.0 product enhancement program, including Guy’s Burger Joint, developed in tandem with Food Network star Guy Fieri , two poolside watering holes, the RedFrog Rum Bar and BlueIguana Tequila Bar, and the BlueIguana Cantina Mexican-themed eatery.\nOn its new schedule from Mobile, Carnival Fantasy will offer four-day cruises to Cozumel and five-day cruises to Cozumel and Costa Maya or Progreso from November 2016 to November 2017 .\n“Carnival Fantasy’s four- and five-day cruises from Mobile provide consumers with an affordable way to visit stunning Mexican ports from a convenient homeport while offering our valued travel agent partners an exciting new short vacation option to market to their clients,” said Christine Duffy , Carnival’s president. “We’ve been working very closely with the port and city officials to make these cruises a reality and wish to thank Mayor Stimpson and his team for not only all their hard work but also for creating a welcoming and positive environment that makes these cruises an attractive option for today’s consumers,” she said.\n“We are pleased and excited to welcome Carnival Cruise Line back to Mobile,” said Mayor Sandy Stimpson . “This agreement has been a priority since the day we took office. It represents a win for our City, a win for Carnival and most of all a win for the thousands of consumers who can once again enjoy a great cruise out of one of America’s greatest cities. We are building something special in Mobile, and this renewed partnership is evidence of that momentum.”\nYear-Long Schedule of Four- and Five-Day Cruises from Mobile\nCarnival Fantasy’s Mobile-based program kicks off Nov. 9, 2016 and will run through Nov. 27, 2017 .\nOn this route, Carnival Fantasy departs the Mobile Cruise Terminal Thursdays on four-day “long weekend” cruises to Cozumel and on Mondays and Saturdays on five-day voyages to Costa Maya or Progreso. Each of these destinations are popular for their beautiful white sand beaches, interesting historical sites and attractions, and excellent snorkeling, scuba diving and water sports. During the day-long call in Progreso , guests have the opportunity to visit Chichen Itza , one of the Seven Wonders of the World, and while in Cozumel guests can visit ancient Mayan ruins or enjoy the destination’s wide range of shopping and dining experiences. At Costa Maya guests can explore the centuries-old Chacchoben ruins or visit the Lost Mayan Kingdom, a multi-million-dollar water-themed attraction currently under construction that will feature spectacular slides, an elaborate lazy river, a suspended ropes course that spans the property and more.\nWide Variety of On-Board Choices\nCarnival Fantasy will undergo a multi-million-dollar refurbishment in early 2016 that will add a number of terrific onboard options. These include Guy’s Burger Joint, a complimentary poolside dining venue serving handcrafted burgers and fries created by the poplar chef and restaurateur, all enjoyed amidst lively interiors that celebrate Fieri’s California roots and love of car culture.\nLocated adjacent to Guy’s Burger Joint is the BlueIguana Cantina offering authentic handmade burritos and tacos along with an elaborate toppings and salsa bar. Also located poolside is the Caribbean -inspired RedFrog Rum Bar offering the region’s top rums and beers as well as the BlueIguana Tequila Bar with margaritas, Mexican beers and other frosty libations.\nCarnival Fantasy also features a 12,000-square-foot spa, a WaterWorks aqua park featuring a 300-foot-long slide and a kiddie splash area, and a Serenity adults-only retreat, as well as fun, supervised programs for kids ages 2-17, full casino gambling and a wide array of dining options, including a 24-hour pizzeria.", "external_links": [], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-24T00:02:49.730+03:00", "highlightTitle": ""}