{"organizations": [], "uuid": "c4627e660d8d64ab25f5ddbcdf3dd2ba576c578e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/CarnoustieCountry-22sep15.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/carnoustie-championship-to-host-world-hickory-open/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Carnoustie Championship To Host World Hickory OpenTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Carnoustie Championship To Host World Hickory OpenTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "8131b06581a8045f0947c1c46c96e725df9511fc"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/carnoustie-championship-to-host-world-hickory-open/", "ord_in_thread": 0, "title": "Carnoustie Championship To Host World Hickory OpenTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Carnoustie Championship To Host World Hickory Open  \nThis year marks the 10th anniversary of the World Hickory Open. To celebrate, the 2015 World Hickory Open will tee off on the world-famous Carnoustie Championship course on 20th and 21st October.\n \nAlmost 100 entries have already been received for this highly prestigious tournament, with hickory golfers from across the globe travelling to Carnoustie next month to compete in the World Hickory Open (WHO).\n \n“So far, hickory golfers from 17 countries have signed up for our 10th anniversary tournament,” said WHO Director Lionel Freedman, who has watched the tournament he founded in 2005, and which is being held in Carnoustie Country for the fourth year running, grow in numbers and prestige over the last ten years.\n \n“In 2015, the WHO is expected to attract over 120 entrants, including many of the world’s top hickory golfers – and golfers of the calibre of none other than Master’s winner Sandy Lyle. Sandy won last year’s WHO 2014 and we are hopeful he will return to Carnoustie Country next month to defend his title.\n \n“In addition, two former WHO champions, Rick Valentine, Master of Golf at Loretto Golf Academy and grandson of the famous Scottish lady golfer Jessie Valentine, and Swiss European tour professional Paolo Quirici are competing in this year’s tournament, alongside Alasdair Good, head professional at Gullane; top golf trickster David Edwards; former European Tour stalwart David Whelan; and Mike Stevens, multiple winner of the National Hickory Championship of America.\n“Our tenth anniversary is going to provide quite a show!”\nAs a high number of golf professionals now regularly enter the WHO, a new trophy has been added to the tournament’s repertoire: The Archie Baird Trophy, which will be presented to the top amateur. “I strongly suspect this trophy will be as hotly-contested as the main one,” said Lionel.\n \nAt the moment, a limited number of places are still available at the WHO 2015. “This is a unique opportunity for hickory golfers to test their skills in a competitive, but friendly, environment on one of the world’s legendary golf courses,” said Lionel, who added that the WHO 2015 will also be played on another highly-regarded Carnoustie Country links course, Budden Links.\n \n“The World Hickory Open is also an excellent chance for novice hickory golfers – or golfers who have always fancied trying golf with hickory sticks – to experience playing golf as it was played in the game’s glory days.”\n \nTo find out more about the World Hickory Open 2015, or to download an entry form, visit www.worldhickoryopen.com. To find out more about the 34 Carnoustie Country golf courses within a 40-minute drive of Carnoustie Championship, including ‘stay and play’ packages, visit www.carnoustiecountry.com, ‘like’ the Carnoustie Country Facebook page or follow Carnoustie Country on Twitter.\n \nSource:- IAGTO", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T18:26:18.468+03:00", "highlightTitle": ""}