{"organizations": [], "uuid": "1b498adddbd5b4498ce290979cbfdec95cd0fac3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28894-crillon-le-brave-opens-brand-new-spa-in-provencal-paradise", "country": "US", "title": "Crillon Le Brave opens brand new Spa in Provençal paradise", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Crillon Le Brave opens brand new Spa in Provençal paradise", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T12:45:00.000+03:00", "replies_count": 0, "uuid": "1b498adddbd5b4498ce290979cbfdec95cd0fac3"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28894-crillon-le-brave-opens-brand-new-spa-in-provencal-paradise", "ord_in_thread": 0, "title": "Crillon Le Brave opens brand new Spa in Provençal paradise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Crillon Le Brave opens brand new Spa in Provençal paradise Crillon Le Brave opens brand new Spa in Provençal paradise Details Created on Friday, 18 September 2015 10:45 Spa des Ecuries offers the ultimate sanctuary experience this Autumn The inimitable Hotel Crillon le Brave in Provence, France, has announced it has opened its doors to the brand new Spa des Ecuries offering guests an intimate spa experience in the heart of the rolling, rural Provencal countryside. Set in the former stables (écuries being the French word for stables) of an 18th Century house, three new treatment rooms, including one couple’s room, are cosily hidden behind traditional Provence limestone walls creating a haven of tranquillity. With aromas of French lavender dancing lightly in the air, enter into the sublime space and enjoy one of the treatments from the new spa menu, by Bamford and OPI. \nBamford was used for the spa as the brand philosophy of using organic essential oils and natural ingredients matched the rejuvenating and peaceful atmosphere of Crillon le Brave, creating an unforgettable overall spa experience. The body oils include unique herbal scents that marry perfectly with the Provençal setting, whether it is a refreshing and uplifting rose, invigorating and toning rosemary or calming and purifying camomile, there is a treatment to suit guests’ needs and desires, including: • Bamford Signature Massage A heavenly 90 minute treatment that incorporates shiatsu, Swedish massage and reflexology to awaken and penetrate the muscles and energy channels of the body. The treatment culminates with assisted yogic breathing to refresh the lungs and revitalise the whole of the body. Float out of the spa feeling light as a feather, and breathe in the fresh country air surrounding the hotel, to feel truly rejuvenated and revived. 90 minutes, €145 • Cyclist/Walker Legs & Feet Massage The area surrounding Hotel Crillon le Brave is heaven for walkers and cyclists, as winding roads lead to areas of astounding beauty, including local vineyards and hamlets. For cyclists, there is also the cyclist’s mecca, Mont Ventoux, just around the corner too. After a strenuous cycle or ramble, adventurers can treat themselves to a special leg and foot massage at the end of the day to soothe aching limbs. 30 minutes, €60/ 60 minutes, €105 • Spa For Two Weekend Break For the ultimate weekend of pampering, Hotel Crillon le Brave offers Spa For Two, a dreamy weekend package that includes two nights’ accommodation on a B&B basis, a bottle of Billecart-Salmon champagne on arrival, dinner for two and most importantly, one 90-minute Bamford Signature Massage and one 30-minute Bamford Signature Facial. Spa For Two weekend rates start from £706 based on two people sharing. There is also a fantastic range of hand and feet treatments on the spa menu by OPI, one of the world’s favourite nail care brands, keeping guest’s fingers and toes looking immaculate. ￼ ￼ ￼ The spa is open daily from 10am – 8pm with a brilliant 20% discount for treatments before 3pm. Hotel Crillon le Brave is a peaceful village hotel made up of eight historic houses, one of which La Maison Décor is home to the lovely Spa des Ecuries. This Autumn or Winter, make sure to book into one of the hotel’s beautiful rooms, indulge in the delicious new spa menu and spend evenings drinking the finest local wine at Restaurant Jérôme Blanchet whilst dining on the popular Menu de Saison, made up of the freshest ingredients of the day. Guests can even go for a dip in the outdoor pool, no matter the season, as it is heated at 29C all year round. Spa treatments start from €60. Nightly rates at Crillon le Brave are available from €310/£230* per room per night for two people sharing including breakfast. Related articles", "external_links": [], "published": "2015-09-18T12:45:00.000+03:00", "crawled": "2015-09-18T12:48:15.463+03:00", "highlightTitle": ""}