{"organizations": ["TATA Motors Assured", "Mahindra First Choice", "Honda", "Hyundai", "Maruti True Value"], "uuid": "139d8a2c036edb5f65a862c8a0738d98ce9f8b8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/india_used_car_market_research_report_2020/", "country": "US", "title": "India Used Car Market Research Report – 2020", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "India Used Car Market Research Report – 2020", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T00:33:00.000+03:00", "replies_count": 0, "uuid": "139d8a2c036edb5f65a862c8a0738d98ce9f8b8b"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/india_used_car_market_research_report_2020/", "ord_in_thread": 0, "title": "India Used Car Market Research Report – 2020", "locations": ["India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "India Used Car Market Research Report – 2020 India used car market report provides statistics on offline and online used car dealers covering used car sales by cities, by class wise, by car types, customer profile, market share, volume of used car sold, future prospects and macro economic factors. India, 10 September 2015 -- India Used Car Market Outlook to 2020 – Growing Preference and Emergence of Web Aggregators” provides a comprehensive analysis of the used car sales in India through online and offline means. The report first analyzes the market of used car in detail, with major segmentation of distribution channels, marketing channels and by demand from major cities. On the competition front, market share of major players in the used car market with detailed company profile has been presented. On the other side, online used car market has been presented with a focus on the positioning of major online web aggregators in the market, with detailed company profile. The report also shed light on the market size of online used car market, market share, company profiles of major portals along with the business model and customer profiles of online used car buyers. The report also includes macroeconomic factors which have been analyzed to determine the future prospects of the Industry.The unorganized used car market in India still captures a large part of this industry but this has not stopped the organized sector from growing because the latter still remains largely untapped. Apart from segmenting this market on the basis of its organizational structure, it can also be further segmented according to the types of used cars such as the A and B segments (Entry level and Compact cars of length below 4 meters) which contributed nearly ~% to the volume of the entire market as recorded in FY’2015. The used cars market has penetrated largely in the tier 1 and tier 2 cities. The domestic used car market has been constantly evolving and even though most of the major players have made their entry in the used car segment of the industry, many carmakers are still to realize the potential of this market. The market size in terms of used car sales value was INR ~ billion in FY’2015 and this value is expected to grow further in the next few years with the online players increasing their presence in the market and the changing outlook of the people towards second hand cars. The C2C channel contributed ~% to the total revenue generated by the used car market in India and its contribution amounted to INR ~ million as of FY’2013 which decreased to ~% of the market share in FY’2015 due to the entry of the online auto portals in the market. The number of Maruti True Value showrooms which sell used cars in India at present is the highest as compared to that for other organized players in the market such as Mahindra First Choice, TATA Motors Assured, Hyundai, Honda and Toyota. In FY’2013, Maruti True Value had a market share of ~% in the entire market. In terms of value, the industry is expected to grow at a rate of ~% over the period FY’2016-FY’2020 with the revenue reaching to INR ~ billion by FY’2020 from INR ~ billion in FY’2016. Over the historical years, FY’2010-FY’2015, the economic slowdown and a decline in the value of rupee have also helped the second hand car market to develop at a considerable rate in the past. The online used car market in India generates a large portion of its revenue through advertisements. These advertisements are broadly classified into three types namely, search advertising, display advertising and classifieds. The revenue generated by the online used car market in India witnessed a consistent increase from FY’2010 to FY’2015, recording a CAGR of ~% during the period. Some of the major online used car players such as CarDekho.com entered in 2008 which increased the pace at which the overall market was growing. The revenues of the overall market in FY’2015 reached to INR ~ million with a sound growth rate of ~%. The market is expected to grow at a faster pace in the coming future with the changing outlook of the consumers in India towards the used cars and online purchasing. In FY’2015, out of the total transactions taking place on the online platform ~% took place through CarWale.com. Nearly ~% of these transactions took place through OLX and ~% through QUIKR. With rising disposable income of the households, the buyers spending capacity on used cars is also expected to spur in the future. At present, majority of the buyers purchasing online have a maximum budget of INR ~, however, with rising incomes, the budget might increase, thereby leading to greater revenue for the market CarWale.com had a market share of ~% in terms of the volume of online used cars sold in FY’2013, which has reduced to ~% in FY’2015. Car Dekho.com acquired ~% market share during the year. This was followed by Gaadi.com (now a part of Cardekho only) which held a market share of ~% in terms of the total volume of online used car sold in FY’2015. Key Topics Covered in the Report: The market size of the Used Car Market Market segmentation of the used car market on the basis of organizational structure, types of used car, types of distribution channels, types of marketing channels and major cities. Trends and Development in the used car Market. Market share and detailed company profiles of the major used car Players in India. Future Outlook and Projections of Used Car Market The Market Size of Online Used Car Market Business Model of Online Used Car Market Market Share and Detailed Company Profiles of Major Players in Online Used car Market Future Outlook and Projections of Online Used Car Market", "external_links": [], "published": "2015-09-10T00:33:00.000+03:00", "crawled": "2015-09-11T03:27:49.652+03:00", "highlightTitle": ""}