{"organizations": [], "uuid": "f55cea40122a34057ec41d2e8eb997997a9de7e0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03433/teacher2_3433425k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/uknews/law-and-order/11854147/Married-headmaster-banned-from-classroom-after-pupil-records-him-having-sex-with-teacher.html", "country": "US", "title": "Married headmaster banned from classroom after pupil records him having sex with teacher", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Married headmaster banned from classroom after pupil records him having sex with teacher - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T02:25:00.000+03:00", "replies_count": 0, "uuid": "f55cea40122a34057ec41d2e8eb997997a9de7e0"}, "author": "Agency", "url": "http://www.telegraph.co.uk/news/uknews/law-and-order/11854147/Married-headmaster-banned-from-classroom-after-pupil-records-him-having-sex-with-teacher.html", "ord_in_thread": 0, "title": "Married headmaster banned from classroom after pupil records him having sex with teacher", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A headmaster and a woman teacher have been banned from the classroom yesterday after they were recorded having sex in an office and a video was posted on the internet. Head Graham Daniels, 51, and deputy head Bethan Thomas, 37, committed \"professional misconduct\" when they were recorded behind a closed door - and the cameraphone \"sex tape\" was put online by pupils. The teachers were slapped with a \"prohibition order\" after the 30-second tape which was posted on YouTube and shared across Facebook and Twitter. Mr Daniels and Miss Thomas resigned from 750-pupil Bryntawe Comprehensive School in Swansea, South Wales, after the tape of \"moans and panting\" went viral. 'They allowed their own interests to override that of staff, pupils and the reputation of their school...' - panel chairman Jaqueline Turnball A disciplinary panel launched an investigation and discovered the pair had been having sex during school hours for nearly a year - and the pair were \"struck off\". Panel chairman Jaqueline Turnball said: \"This conduct affected pupils, staff and the wider school community. It took place on school premises and it was reckless and risk taking behaviour. \"They allowed their own interests to override that of staff, pupils and the reputation of their school. This order reflects the seriousness of their conduct.\" The hearing in Cardiff was told how it was well known in the school that the pair were in \"some sort of relationship\". A suspicious pupil made a video of the office door in which \"sex noises\" could be heard before it was then shared around the school. Graham Daniels, 51 Photo: Wales News Service The Education Workforce Council heard how teacher morale at the school \"dropped\" after the tape become public. Other teachers told the hearing how members of staff witnessed \"inappropriate behaviour and sexual acts\" on school premises. Mr Daniels told the hearing he had made \"great contributions\" to the school before he was caught having sex in his office. The former head - who has since been working as a supply teacher - admitted that \"on reflection\" what he had done was wrong. He told the hearing: \"The school was my life and I will forever be grateful for the career it gave me. I deeply regret any damage I caused to the reputation of the school \"I did something I'm deeply ashamed of and I've already paid a very heavy price from this. I'm extremely remorseful for my lack of professional judgement. \"I've already learned from it and can say I will never allow it to happen again if I was allowed to continue as a teacher.\" 'The school was the most important thing in my life. It saddened me a great deal to leave the school in such unfortunate circumstances...' - Bethan Thomas Miss Thomas - formerly known as Mrs Bale - has been working as a temporary teacher and is currently teaching chemistry and A-level science at Strade school in Llanelli, West Wales. She told the hearing: \"The school was the most important thing in my life. It saddened me a great deal to leave the school in such unfortunate circumstances. Over the past year I've lost a lot on a professional and personal level.\" Miss Thomas and Mr Daniels admitted \"taking part in a sexual act\" with another member of staff in an office on school premises. They also admitted \"exposing pupils to the behaviour which was recorded by a pupil and subsequently uploaded to social media sites.\" The disciplinary panel, sitting in Cardiff, found they had also taken part in \"sexual acts\" which were witnessed by a member of staff. But they were cleared of a further allegation that they had sex inside Daniels' office while a 15-year-old female pupil sat outside waiting for her parents. • Married teacher caught in sex act with model at private school • Female PE teacher has sex with 15-year-old female pupil Ms Turnbull said the charges amounted to unacceptable professional misconduct and was a breach of the standards expected of teachers. She said: \"Sexual acts between them took place in the headteacher's office, was then filmed and uploaded to media sites. These are serious matters, registered teachers are required to base their professional relationships on trust and respect. \"The committee considers that they both breached these key principles. Their conduct fell below that which is expected of registered members and amount to inappropriate professional misconduct.\" The pair will have to wait for three years before they are able to reapply to be teachers. @telegraphnews", "external_links": [], "published": "2015-09-10T02:25:00.000+03:00", "crawled": "2015-09-09T20:48:30.261+03:00", "highlightTitle": ""}