{"organizations": [], "uuid": "6815d537f0a222571f39a4aae2bd8542dd81c2c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29944088/lincoln-tech-and-audi-announce-automotive-career-training-partnership", "country": "US", "title": "Lincoln Tech and Audi Announce Automotive Career Training Partnership", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Lincoln Tech and Audi Announce Automotive Career Training Partnership - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "6815d537f0a222571f39a4aae2bd8542dd81c2c0"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29944088/lincoln-tech-and-audi-announce-automotive-career-training-partnership", "ord_in_thread": 0, "title": "Lincoln Tech and Audi Announce Automotive Career Training Partnership", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Lincoln Educational Services Corporation\nWEST ORANGE, N.J. , Sept. 2, Lincoln Educational Services Corporation (NASDAQ: LINC), a national leader in specialized technical training, has been selected by Audi of America, Inc. as a Premium Plus Level partner in the Audi Education Partnership Program. Lincoln Tech will provide manufacturer-specific career training to students at its Mahwah, NJ , Nashville, TN , Denver, CO and Columbia, MD campuses, giving students from around the country the opportunity to build enhanced automotive career skills while working closely with the technology and equipment used by one of the world's leading auto manufacturers.\nBeginning in 2016, students may apply to enroll in additional courses to supplement Lincoln Tech's Automotive Technology training program – courses that build their familiarity with Audi-specific servicing, maintenance and roadside assistance skills. Audi will provide the curriculum and equipment for the program – including 2016 A3 and S7 models on which students will train.\nFor nearly 70 years, Lincoln Tech has worked closely with employers to determine the skills hiring managers need in new candidates, and to continually train and graduate technicians who possess those skills. Hands-on real-world training centered on core STEM (Science, Technology, Engineering, and Mathematics) concepts leaves students well-positioned to pursue careers with some of the world's most renowned companies – such as Audi.\n\"Teaming with Audi not only enables us to give our students additional training, increasing their value to employers,\" says Lincoln CEO Scott Shaw . \"It also helps shine a spotlight on the strong demand and need for auto technicians around the country.\"\nThe automotive industry is projected to add more than 166,000 jobs nationally by 2022, according to careeronestop.org, and Shaw stresses the timing of the partnership with Audi is critical to providing employers with a steady pipeline of technicians for their workforce.\n\" Lincoln Tech has a great base of young talent in their Automotive program,\" says Matt Shepanek , Audi's National Manager of Technical and Collision Training. \"Dealerships can't find enough skilled, qualified technicians to fill their staffing needs; within Audi, we plan to grow our technician workforce from 2,900 to 4,500 in the next five years. We want to educate young technicians about career opportunities in our company.\"\n\"We're very excited to be working with Lincoln Tech through this partnership,\" says Jon Branch , Senior Manager Region Aftersales. \"We've found Lincoln Tech graduates to be among the best-prepared candidates that come into our dealerships – and that leads to better retention of our technicians, and greater customer satisfaction.\"\n\"The automotive industry is evolving rapidly, stressing computerized technology more than ever before,\" Shaw says. \"Graduates need intricate technical skills to be successful in the field – and it's a field where the typical automotive technician today has a higher salary than the average American worker.\"\n\"We're honored to have been chosen by Audi to train their next generation of technicians,\" says Jay Rasmussen , President of the Lincoln Tech campus in Mahwah , NJ. \"We look forward to helping to produce quality technicians for Audi up and down the East Coast, and we're proud to be able to offer this program to our students.\"\nThe program will be open to current students and past graduates meeting certain minimum standards and prerequisites. Students can apply for the program from anywhere in the nation.\nAbout Lincoln Educational Services Corporation\nLincoln Educational Services Corporation is a leading provider of diversified career-oriented post-secondary education. Lincoln offers recent high school graduates and working adults career-oriented programs in five principal areas of study: automotive technology, health sciences, skilled trades, business and information technology, and hospitality services. Lincoln has provided the workforce with skilled technicians since its inception in 1946.\nLincoln currently operates 30 campuses in 15 states under four brands: Lincoln Technical Institute , Lincoln College of Technology, Euphoria Institute of Beauty Arts and Sciences, and Lincoln College of New England. Lincoln also operates Lincoln Culinary Institutes in the states of Connecticut , Maryland and Florida .\nFor more information, go to lincolntech.edu.\nContact Information\nLincoln Educational Services Corporation\nPeter Tahinos\n(973) 736-9340x49233\nptahinos@lincolntech.edu\nPhoto - http://photos.prnewswire.com/prnh/20150902/263232\nLogo - http://photos.prnewswire.com/prnh/20130910/NY77325LOGO\n releases/lincoln-tech-and-audi-announce-automotive-career-training-partnership-300137051.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=NY92807&Transmission_Id=201509021332PR_NEWS_USPR_____NY92807&DateId=20150902", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20130910/NY77325LOGO", "https://photos.prnewswire.com/prnvar/20150902/263232", "http://www.prnewswire.com/news-releases/lincoln-tech-and-audi-announce-automotive-career-training-partnership-300137051.html", "http://photos.prnewswire.com/prnh/20150902/263232", "http://photos.prnewswire.com/prnvar/20130910/NY77325LOGO"], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T21:08:28.850+03:00", "highlightTitle": ""}