{"organizations": [], "uuid": "f1dcb8df550fc13de634e04eda4933b2d0e6e346", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63964/minister-malta-outgrowing-european-tourism-growth-first-six-mont", "country": "US", "title": "Minister: Malta outgrowing European tourism growth in first six months of 2015", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Minister: Malta outgrowing European tourism growth in first six months of 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T01:43:00.000+03:00", "replies_count": 0, "uuid": "f1dcb8df550fc13de634e04eda4933b2d0e6e346"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63964/minister-malta-outgrowing-european-tourism-growth-first-six-mont", "ord_in_thread": 0, "title": "Minister: Malta outgrowing European tourism growth in first six months of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Minister: Malta outgrowing European tourism growth in first six months of 2015   \nSep 20, 2015 Tourism Minister Edward Zammit Lewis eTN   \nVALLETTA, Malta - With Malta registering a 5.3% increase in tourist arrivals during the first six months of the year, tourism minister Edward Zammit Lewis has toasted the positive results, insisting that they confirm that the government’s roadmap for the tourism industry is bearing fruit. \nAccording to the UNWTO Barometer, the worldwide increase in tourists saw Malta receive its fair share of tourists this year, registering an increase of 5.3% in tourist arrivals, thereby outgrowing the 4% growth recorded by international worldwide tourism. \nEurope remained the most visited region in the world and also recorded a 5% growth in international arrivals. Despite the increase, the UNWTO said safety and security remain a global concern while the economic scenario is also a huge factor. Indeed, the UNWTO said Europe’s tourism growth was partly due to a weaker currency in the euro area. \nMalta, on the other hand, registered record figures during the first three months of the year, as it registered a 8.6% growth during a period renowned as being as off peak season for tourists. \n“This is a truly positive result when considering that, during the same quarter, the competitive regions scored a much lesser growth (South Europe/Mediterranean region: +6.6%; Europe: +5.6%),” the government said. \n“These record figures registered by our country during the first half of this year brought a growth in tourist export earnings of 6% when compared with same months of 2014, reaching the €625.6 million mark. This means an increase of 0.5% in expenditure per capita when compared to 2014.” \n“The record breaking results obtained by the tourism sector, month after month, is being converted in an increase of direct revenue contribution towards the Maltese economy and in an increase of quality job creation within this sector. This continues to confirm the importance of tourism, as the sector that gives utmost contribution to the Maltese economy,” tourism minister Edward Zammit Lewis said.", "external_links": [], "published": "2015-09-21T01:43:00.000+03:00", "crawled": "2015-09-21T04:19:41.796+03:00", "highlightTitle": ""}