{"organizations": [], "uuid": "8282b970af3e4312f675073d17ebbf473bf306f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/download-118.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/still-not-many-takers-for-apple-pay-in-travel-world/", "country": "US", "title": "Still Not Many Takers For Apple Pay In Travel WorldTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Still Not Many Takers For Apple Pay In Travel WorldTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "8282b970af3e4312f675073d17ebbf473bf306f7"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/still-not-many-takers-for-apple-pay-in-travel-world/", "ord_in_thread": 0, "title": "Still Not Many Takers For Apple Pay In Travel WorldTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Still Not Many Takers For Apple Pay In Travel World\nAlmost a year after the launch of Apple Pay, Apple’s digital wallet, it’s still possible to count on only two fingers–the number of airlines who let travellers use the service while onboard or while booking via mobile devices.\nJetBlue, and recently Emirates, are the lone members amid a sky of global airlines who haven’t signalled to embrace of the mobile payments system that securely stores credit card information without the need for travellers to have their credit cards. So far Apple Pay is only available in the U.S. and UK.\nApple Pay was only streamlined across all JetBlue flights in June after rolling out on select transcontinental flights from New York City to Los Angeles and San Francisco in February. It’s available on JetBlue’s Apple Watch app and will go live on the airline’s iOS app later this year to let travelers use Apple Pay for bookings.\nLast month Emirates announced it’ll let travelers use Apple Pay to book flights via the carrier’s iOS app, but it hasn’t made it onboard the carrier’s fleet yet for in-flight purchases.\n“The implementation hasn’t been easy as we have a global payment gateway that needs to be compliant with different regulations depending on the operating market,” said Kellie Jelencovich, a spokesperson for Emirates. “We serve customers from all around the world so we’ve also faced challenges regarding the ability to serve multiple currencies.”\nHowever, purchasing Emirates tickets via Apple Pay still allows travellers to receive\nall of the rewards and benefits offered by both credit and debit cards.", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T00:13:28.160+03:00", "highlightTitle": ""}