{"organizations": [], "uuid": "e9b59454b9ccad8fde0731c554a7f1eb737ec432", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/Visakhapatnam.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/visakhapatnam-port-trust-planning-cruise-tourism/", "country": "US", "title": "Visakhapatnam Port Trust planning cruise tourismTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Visakhapatnam Port Trust planning cruise tourismTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "e9b59454b9ccad8fde0731c554a7f1eb737ec432"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/visakhapatnam-port-trust-planning-cruise-tourism/", "ord_in_thread": 0, "title": "Visakhapatnam Port Trust planning cruise tourismTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Visakhapatnam Port Trust planning cruise tourism Published on : Monday, September 21, 2015\nThere is good news for tourists visiting Vizag. Those visiting the coastal city may soon be able to cruise the high seas, if the Visakhapatnam Port Trust has its way. VPT, which is the second largest major port on the east coast, is now planning to give a fillip to cruise tourism in the city by offering its waterfront facilities on lease to private cruise tour operators.\nWith the number of international travellers landing in Vizag increasing by nearly 96% in the first five months of the current fiscal, VPT feels that offering one of its waterfront facilities to cruise operators will boost the city’s tourism potential. Sources said that VPT is expected to float tenders inviting private cruise tourism operators to Vizag by next week.\nAs part of the plan, VPT is trying to extend the slipway near the Fishing Harbour by around 80 metres at an estimated cost of nearly Rs 5 crore and will be inviting private cruise operators to ply their services from Vizag to places such as Bheemili, Kakinada and other private resorts mushrooming along the coast in Visakhapatnam and Vizianagaram districts, said sources.\nThe private cruise tourism operators, on the other hand, will have to invest in supplying cruise vessels or boats for ferrying tourists along the Bay of Bengal. APTDC already runs a smaller boat giving tourists a view of the Vizag beachfront by venturing nearly a kilometre into the sea.\n“Initially, we are hoping that private cruise operators will bring in smaller vessels with a capacity of 12-14 people and providing facilities such as a dinner at sea or a cruise towards the coastal town of Bheemili or Kakinada. These cruises can be offered to corporate groups or even common people, who would want to experience an outing on the sea. VPT will be offering jetty and parking facility for the cruise operators,” said a senior VPT official.", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-22T02:39:18.959+03:00", "highlightTitle": ""}