{"organizations": [], "uuid": "e9b4bdd5e43a6aa54b16ef3f305b4902fa21802c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/09/02/google-new-xxx/ALTERNATES/crop_100x100/Google+new+xxx", "site_section": "http://www.bdlive.co.za/life/travel", "section_title": "Travel &amp; Food | BDlive ", "url": "http://www.bdlive.co.za/world/americas/2015/09/23/google-opens-up-to-wall-street", "country": "ZA", "title": "Google opens up to Wall Street | Americas", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "Google opens up to Wall Street | Americas | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T20:32:00.000+03:00", "replies_count": 0, "uuid": "e9b4bdd5e43a6aa54b16ef3f305b4902fa21802c"}, "author": "Alistair Barr", "url": "http://www.bdlive.co.za/world/americas/2015/09/23/google-opens-up-to-wall-street", "ord_in_thread": 0, "title": "Google opens up to Wall Street | Americas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Google logo. Picture: AFP/GOOGLE Related articles Google launches music streaming service in Japan Google to make play for China Google redesigns iconic logo for the fifth time In this article Companies and organisations: Google GOOGLE has long ignored most Wall Street conventions, but that is changing under new chief financial officer Ruth Porat.\nEarlier this month, the internet giant began offering analysts 15-to 30-minute briefings on Google’s business, according to people familiar with the situation.\nMany publicly traded companies conduct similar calls, which tiptoe around securities laws. Until now, though, Google wasn’t among them, analysts say.\nIn the first round of calls, Google highlighted several previously disclosed facts and trends that suggested expenses may rise in the third quarter: seasonal hiring of recent college grads, the start of holiday-season marketing and an uptick from unusually low legal expenses in the second quarter, according to the people.\nThe initiative, dubbed \"Office Hours,\" is part of an effort by Ms Porat, who joined Google in May from Morgan Stanley, to be more transparent with investors and analysts. She talked more openly than her predecessor on her first conference call in July and met shareholders in New York, Boston and London in the following weeks.\n\"The company has made more effort with investors in just the last couple of months than they have in years,\" said Mark Mahaney, an analyst at RBC Capital Markets, who participated in an \"Office Hours\" briefing.\n\"That’s a personality thing with the new chief financial officer.\"\nThe new approach has contributed to recent gains in Google shares, Mr Mahaney said. Google shares are up about 15% in the past three months, while the tech-heavy Nasdaq Composite Index has dropped about 8%.\nGoogle still doesn’t offer revenue or earnings forecasts, as many companies do. But Ms Porat is trying to provide insight to help investors better understand how Google runs its business and help analysts more easily build financial models. A Google spokesman declined to comment.\nPeople familiar with the calls said they usually involve a single analyst talking with Google’s investor relations staff. Holding such calls requires companies to juggle communicating with following securities regulations.\nRegulation FD, adopted in 2000, bans companies from selectively disclosing material nonpublic information to analysts and other market professionals. The goal is to ensure certain investors don’t get important information before others.\nSome companies stopped analyst meetings after the Securities and Exchange Commission took enforcement action against several firms. However, most companies continue briefings, according to securities attorneys.\nThose attorneys say executives can avoid problems by only repeating or clarifying information that is already public or adding new, but nonmaterial information. Even when repeating existing public statements, changing words or the demeanour and body language of company officials could violate Regulation FD, so briefings are carefully choreographed, they added.\n\"If Google can remind analysts about certain things they’ve already talked about publicly then these meetings are perfectly okay and in fact common,\" said David Lavan, a partner at law firm Dinsmore & Shohl.\nAnalysts say Google has stuck to that approach.\nNot all the comments pointed to higher spending. One analyst was reminded that Ms Porat has been asking Google business leaders to use existing resources before asking for more money or hires for projects.\nMore Africa news from The Wall Street Journal\nMore news from The Wall Street Journal\nPremium access to WSJ.com: $1 a week for 12 weeks", "external_links": ["http://online.wsj.com/public/page/news-africa.html?mod=TMGSAlink1", "https://join.wsjeuropesubs.com/tmg1", "http://online.wsj.com/europe?mod=TMGSAlink2", "https://www.wsjeuropesubs.com/wsj12offer/?tagsrc=/tmg1&rnd=54622c7ae7d81"], "published": "2015-09-23T20:32:00.000+03:00", "crawled": "2015-09-23T18:08:34.622+03:00", "highlightTitle": ""}