{"organizations": [], "uuid": "0e99103ac93b03492ab4c393f3d2e4262b389d1d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/unnamed18.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/australian-travel-agents-touch-down-in-new-zealand-for-largest-famil-to-date/", "country": "US", "title": "Australian Travel Agents Touch Down In New Zealand For Largest ‘famil’ To DateTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Australian Travel Agents Touch Down In New Zealand For Largest ‘famil’ To DateTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "0e99103ac93b03492ab4c393f3d2e4262b389d1d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/australian-travel-agents-touch-down-in-new-zealand-for-largest-famil-to-date/", "ord_in_thread": 0, "title": "Australian Travel Agents Touch Down In New Zealand For Largest ‘famil’ To DateTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Australian Travel Agents Touch Down In New Zealand For Largest ‘famil’ To Date Published on : Wednesday, September 9, 2015\nFour hundred of Australia’s highest performing travel agents are in Auckland today, ready to experience the best the New Zealand tourism industry has to offer on a five-day journey around the country.\nRun in partnership between Tourism New Zealand, Air New Zealand and Virgin Australia, the trade ‘familiarisation’ (famil) is the largest event of its kind in New Zealand.\nSelected on the basis of their sales performance and tenure, the agents from across Australia will split up into 23 different groups, experiencing tourism products throughout the regions – from Northland to Stewart Island.\nThe agents began their journey by participating in an Air New Zealand and Virgin Australia alliance training session and a series of workshops hosted by Regional Tourism Organisations. Held in Auckland, the one day workshop featured insights from Contiki founder John Anderson, a masterclass with The Sugar Club Head Chef Neil Brazier and briefings from Air New Zealand and Virgin Australia.\nTravel agents will visit 23 New Zealand regions stretching from the tip of the North to the bottom of the South Island, following customised itineraries based on recent touring, cycling and ski New Zealand campaigns.\nTourism New Zealand’s Director Trade, PR & Major Events René de Monchy said, having 400 agents here at one time meant that the group would be able to visit more regions than any other famil has previously.\n“We’re thrilled to be hosting this many top travel sellers in one go. Thanks to our airline partners, they will come from all across Australia and visit more regions than ever before – from the tip of the North Island to the bottom of the South.\n“Visiting during September will help agents sell off-peak travel upon their return, in turn growing shoulder season travel to New Zealand and easing the peak season load.\n“With the generous support of the regional tourism organisations and local operators, we look forward to showing the agents how amazing a holiday here can be and I’m confident that this will lead to them selling more trips to New Zealand than before.”\nAir New Zealand’s General Manager Australia, Leanne Geraghty says Air New Zealand is once again proud to be co-hosting this mega famil with partners Tourism New Zealand and Virgin Australia.\n“Our solid long-term relationship allows us to take advantage of the growing and significant interest in destination New Zealand.\n“Furthermore, it allows us to showcase our extensive regional network and ease of travelling around New Zealand to key trade partners.”\nVirgin Australia’s General Manager Global Sales Shirley Field said: “It’s great to be here with 400 Australian travel agents to promote beautiful New Zealand and the benefits of travelling with Virgin Australia and our alliance partner Air New Zealand.\nSource:- Tourism New Zealand", "external_links": [], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T04:12:56.593+03:00", "highlightTitle": ""}