{"organizations": ["Hoover Dam", "Dragoon Corridor"], "uuid": "ffdbfff7c989e7358fa43e9ca06255c721d08e71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.24-7pressrelease.com", "main_image": "http://www.24-7pressrelease.com/images/icon-247pressrelease.jpg", "site_section": "http://rss.24-7pressrelease.com/rss/lifestyle_travel.xml", "section_title": "Press Release and Top Lifestyle   Travel News From 24-7 Press Release Newswire", "url": "http://www.24-7pressrelease.com/press-release/grand-canyon-tours-unveils-fall-2015-travel-specials-413256.php", "country": "US", "title": "Grand Canyon Tours' Unveils Fall 2015 Travel Specials", "performance_score": 0, "site": "24-7pressrelease.com", "participants_count": 0, "title_full": "Grand Canyon Tours' Unveils Fall 2015 Travel Specials", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T10:00:00.000+03:00", "replies_count": 0, "uuid": "ffdbfff7c989e7358fa43e9ca06255c721d08e71"}, "author": "", "url": "http://www.24-7pressrelease.com/press-release/grand-canyon-tours-unveils-fall-2015-travel-specials-413256.php", "ord_in_thread": 0, "title": "Grand Canyon Tours' Unveils Fall 2015 Travel Specials", "locations": ["Colorado River", "Las Vegas", "Lake Mead", "West Rim", "South Rim", "AZ", "Tusayan/South Rim", "Phoenix", "North Rim", "Glen Canyon Dam", "Tusayan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email This Story Printer Friendly PDF Version RSS Feed Grand Canyon Tours' Unveils Fall 2015 Travel Specials Fall is here! Cooler temps. Clear skies. Perfect for Grand Canyon sightseeing. Get special pricing now. Hurry, seats limited. Book in advance for best rate. LAS VEGAS, NV, September 28,   In celebration of the fall season, Grand Canyon Tours is announcing the release of some especially cool deals on helicopter, airplane and float tours from Las Vegas, NV, and South Rim, AZ. Location is Everything The two main starting points for tours is from Las Vegas and South Rim. From Vegas, the West Rim is a 125-mile drive and the South Rim is a 270-mile drive. From Phoenix, the South Rim is about a 4-hour drive. Both Las Vegas and the South Rim offer helicopter, airplane and raft tours. Flights depart daily and leave on the hour from 7 a.m. to 5 p.m. Only Las Vegas helicopter tours are permitted to fly below the rim and land on the bottom. It's recommended that travelers book a tour well in advance. Rule of thumb is purchase a tour immediately after a hotel booking is made. Avoid buying a tour within 48 hours of flight time, and definitely stay away from same-day bookings as they cost more or are inclined to sell out. Las Vegas The Vegas helicopter tour that's on sale for fall is the flyover. It goes over Lake Mead, Hoover Dam and the Colorado River en route to the Canyon. This tour is ideal for travelers with limited time for sightseeing or on a strict budget. Budget and time permitting, travelers should consider a landing tour, especially the one that goes to the bottom of the Canyon and lands for a Champagne Picnic. This particular tour can be upgraded to include a Colorado River boat ride and VIP Skywalk tickets. The Vegas airplane tour that's marked down for fall is also a flyover. It follows the same path as the helicopter except it does so at a higher altitude. Further, airplanes can accommodate up to 19 people (helicopters can hold 6) and are usually more available than choppers. South Rim The South Rim helicopter on sale is the 30-minute basic. It goes form the South Rim to the North Rim and back via the Dragoon Corridor, the widest and deepest section of the National Park. There's a deluxe version of this tour and it uses the superior EcoStar 130 helicopter. The South Rim plane tour on sale is the 50-minute flyover. It does South Rim and North Rim and also includes everything up to the Park's eastern border. Once completed, travelers will have seen up to 75 percent of the National Park. The fall South Rim rafting tour promotion is the bus/float combination that starts from Tusayan/South Rim and goes to the base of Glen Canyon Dam in Page, AZ. Travelers transfer to a 19-seat pontoon raft at the base of the Dam and make a 15.3-mile float voyage down the Colorado. The return segment is by bus back to Grand Canyon National Park Airport. Book It! For more information about Canyon helicopters, cut and paste or click this link: http://www.grandcanyondaytrips.com/helicopters/ For more information about Canyon airplane tours, cut and paste or click this link: http://www.grandcanyondaytrips.com/best-airplane-tours/ For more information about South Rim 1-day float tours, cut and paste or click this link: http://www.grandcanyondaytrips.com/float-trips/Las Vegas-based Grand Canyon Day Trips is the National Park's number one provider of tour information and more. The company focuses its efforts on providing details, deals and pricing on West Rim and South Rim tours from Las Vegas, NV, Tusayan, AZ, and Phoenix, AZ. Launched in 2008, Grand Canyon Day Trips website features live chat so travelers can talk directly with an expert in order to get the perfect tour. Additionally, there are a number of free reports that offer visitors tips on how to get helicopter, airplane, bus and rafting excursions at the lowest rates possible. The official website can be visited at: http://www.grandcanyondaytrips.com/tours/ # # #", "external_links": [], "published": "2015-09-28T10:00:00.000+03:00", "crawled": "2015-09-28T10:10:13.496+03:00", "highlightTitle": ""}