{"organizations": [], "uuid": "a93429d7a14d451e2c546a1f2eddd83f988f078d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29989160/great-canadian-gaming-awarded-first-bundle-in-ontario-gaming-modernization-process", "country": "US", "title": "Great Canadian Gaming Awarded First Bundle in Ontario Gaming Modernization Process", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Great Canadian Gaming Awarded First Bundle in Ontario Gaming Modernization Process - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "a93429d7a14d451e2c546a1f2eddd83f988f078d"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29989160/great-canadian-gaming-awarded-first-bundle-in-ontario-gaming-modernization-process", "ord_in_thread": 0, "title": "Great Canadian Gaming Awarded First Bundle in Ontario Gaming Modernization Process", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Great Canadian Gaming Corporation\nRICHMOND, BC , Sept. 9, 2015 /CNW/ - Great Canadian Gaming Corporation [TSX:GC] (\"Great Canadian\" or \"the Company\") announced today that Ontario Gaming East Limited Partnership (\"Ontario Gaming East LP\" or \"the Partnership\"), a partnership in which the Company owns a 50.1% share, was selected as the successful proponent by the Ontario Lottery and Gaming Corporation (\"OLG\") to operate gaming facilities in OLG's Gaming Bundle 2 (East) (the \"East Gaming Bundle\").\nThe East Gaming Bundle contains three gaming zones. The first gaming zone includes the township of Cavan Monaghan , the City of Peterborough and surrounding areas, and is currently served by OLG Slots at Kawartha Downs. The second gaming zone includes a new build opportunity to service the City of Belleville and the municipality of Quinte West . The third gaming zone includes the City of Kingston and surrounding areas, including Gananoque and Leeds and Thousand Islands, and is currently served by OLG Casino Thousand Islands. Additional details about the current and planned scopes of the gaming operations in these zones are included in a supplemental schedule to this release.\nAs a result of being awarded this opportunity, Ontario Gaming East LP signed a business transition and asset purchase agreement with OLG on September 8, 2015 and, subject to customary closing conditions, is committed to subsequently signing a 20-year casino operating and services agreement when the acquisition closes early next year. Under this agreement, Ontario Gaming East LP will acquire all of OLG's gaming assets in the East Gaming Bundle, including OLG Casino Thousand Islands and the slot operations within leased space at Kawartha Downs. The purchase price is $37.4 million plus cash of approximately $13 million to cover working capital.\nUnder the planned casino operating and services agreement, Ontario Gaming East LP will operate the gaming facilities in the bundle and will provide OLG a pre-established, guaranteed annual payment. In return, the Partnership will receive an annual fee comprised of, among other components, an annual base fee as well as 70% of gross gaming revenue above the applicable pre-established amount for each year. Additional, specific details about the casino operating and services agreement and this planned financial arrangement are not permitted to be disclosed at this time under the terms of OLG's procurement process.\nThe closing date for the acquisition of the assets and undertaking contained within the East Gaming Bundle and assumption of certain liabilities from OLG, including the signing of a casino operating and services agreement with OLG, is expected to be completed in the first quarter of 2016 to allow time for transition planning and is subject to both regulatory approvals and the satisfaction of certain other customary closing conditions. The Company also intends to enter into an operations management contract and a facility development contract with Ontario Gaming East LP under which the Company will earn associated fees for the provision of such services.\n\"We thank OLG for the opportunity to participate in the modernization of gaming in Ontario and are both honoured and excited to have been awarded this first gaming bundle,\" stated Rod N. Baker , the Company's President and Chief Executive Officer. \"Great Canadian has been involved in gaming in Canada since 1982 and in Ontario horse racing at our Flamboro Downs and Georgian Downs properties since 2005. We look forward to this next chapter in the Company's history and the opportunity to collaborate with the OLG and local municipalities to provide exciting entertainment experiences for each of the communities of the East Gaming Bundle, which will include a new gaming and entertainment facility for the community of Belleville or Quinte West . We are very excited to welcome OLG employees at the existing locations and we look forward to working with them after the anticipated completion of the acquisition early next year.\"\nABOUT GREAT CANADIAN GAMING CORPORATION\nGreat Canadian Gaming Corporation operates gaming, entertainment and hospitality facilities in British Columbia , Ontario , Nova Scotia , and Washington State . The Company's 16 gaming properties consist of three community gaming centres, four racetracks (two with casinos operated by the Company and two with slot facilities conducted, managed and currently operated by the Ontario Lottery and Gaming Corporation), and nine casinos, including one with a Four Diamond resort hotel. Further information is available on the Company's website, www.gcgaming.com .\nDISCLAIMER\nThis press release contains certain \"forward-looking information\" or statements within the meaning of applicable securities legislation. Forward-looking information is based on the Company's current expectations, estimates, projections and assumptions that were made by the Company in light of its historical trends and other factors. All information or statements, other than statements of historical fact, are forward-looking information including statements that address expectations, estimates or projections about the future, the Company's strategy for growth and objectives, expected future expenditures, costs, operating and financial results, expected impact of future commitments, and expectations and implications of changes in legislation and government policies. Forward-looking information may be identified by words such as \"anticipate\", \"believe\", \"expect\", or similar expressions. Such forward-looking information is not a guarantee of future performance and may involve a number of risks and uncertainties.\nAlthough forward-looking information is based on information and assumptions that the Company believes are current, reasonable and complete, they are subject to unknown risks, uncertainties, and a number of factors that could cause actual results to vary materially from those expressed or implied by such forward-looking information. Such factors may include, but are not limited to: terms of operational services agreements with lottery corporations; changes to gaming laws that may impact the operational services agreements, pending, proposed or unanticipated regulatory or policy changes; the outcome of restructuring of gaming in Ontario ; the Company's ability to obtain and renew required business licenses, leases, and operational services agreements; the future of horse racing in Ontario ; unanticipated fines, sanctions and suspensions imposed on the Company by its regulators; impact of global liquidity and credit availability; actual and possible reassessments of the Company's prior tax filings by tax authorities; adverse tourism trends and further decreases in levels of travel, leisure and consumer spending; competition from established competitors and new entrants in the gaming business; dependence on key personnel; the Company's ability to manage its capital projects and its expanding operations; the risk that systems, procedures and controls may not be adequate to meet regulatory requirements or to support current and expanding operations; potential undisclosed liabilities and capital expenditures associated with acquisitions; negative connotations linked to the gaming industry; First Nations rights with respect to some land on which we conduct our operations; future or current legal proceedings; construction disruptions; financial covenants associated with credit facilities and long-term debt; credit, liquidity and market risks associated with our financial instruments; interest and exchange rate fluctuations; non-realization of cost reductions and synergies; demand for new products and services; fluctuations in operating results; economic uncertainty and financial market volatility; technology dependence; and privacy breaches or data theft. The Company cautions that this list of factors is not exhaustive. Although the Company has attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. These factors and other risks and uncertainties are discussed in the Company's continuous disclosure documents filed with the Canadian securities regulatory authorities from time to time, including in the \"Risk Factors\" section of the Company's Annual Information Form for fiscal 2014, and as identified in the Company's disclosure record on SEDAR at www.sedar.com .\nReaders are cautioned not to place undue reliance on the forward-looking information, as there can be no assurance that the plans, intentions, or expectations upon which they are based will occur. The forward-looking information contained herein is made as of the date hereof, is subject to change after such date, and is expressly qualified in its entirety by cautionary statements in this press release. Forward-looking information is provided for the purpose of providing information about management's current expectations and plans and allowing investors and others to get a better understanding of the Company's operating environment. The Company undertakes no obligation to publicly revise forward-looking information to reflect subsequent events or circumstances except as required by law.\nON BEHALF OF\nGREAT CANADIAN GAMING CORPORATION\n\"Original Signed By Rod N. Baker \"", "external_links": ["http://www.gcgaming.com/", "http://www.sedar.com/"], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T16:56:00.612+03:00", "highlightTitle": ""}