{"organizations": [], "uuid": "355e1b3d2c7bdee6e80415c9ea75fc16a204f7ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150921Sunset.jpg", "site_section": "http://www.ticotimes.net/categories/topics/latin-america", "section_title": "Latin America Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/09/21/7-things-to-consider-before-retiring-abroad", "country": "US", "title": "7 things to consider before retiring abroad", "performance_score": 0, "site": "ticotimes.net", "participants_count": 3, "title_full": "7 things to consider before retiring abroad -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T02:25:00.000+03:00", "replies_count": 2, "uuid": "355e1b3d2c7bdee6e80415c9ea75fc16a204f7ad"}, "author": "Jonnelle Marte | The Washington Post", "url": "http://www.ticotimes.net/2015/09/21/7-things-to-consider-before-retiring-abroad", "ord_in_thread": 0, "title": "7 things to consider before retiring abroad", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is it it your goal to spend your golden years living in a hut on the beach of a Caribbean island? Or Costa Rica, perhaps?\nOr do you dream of a second act running a vineyard in Tuscany? Retiring abroad can be both more enticing and and more affordable – depending on the locale – than retiring in the United States. But a smooth transition requires careful planning.\n“When you just begin thinking about it at a superficial infatuation level, it’s a very exotic, romantic, sexy idea,” says Kathleen Peddicord, publisher of Live and Invest Overseas, which publishes an annual ranking of the best places to retire abroad. “But the truth is that once you get into it, it’s not easy.”\nNot all of the lifestyle changes that come with moving overseas will be ideal. Retirees will want to research how the move could affect their cost of living, tax bill and health. Here are some of factors to think about before you sell your belongings and buy a one-way plane ticket:\n1. Residency. Some countries are extremely welcoming to retirees from the United States, luring them with tax breaks, property rights and other perks. In parts of Latin America, “pensionado” programs may let retirees live in the country indefinitely and import property such as a car to the country tax free, Peddicord says. The initiatives typically require retirees to show they have a certain amount of income coming in each month – a threshold that can often be reached with Social Security benefits, she says.\nOther countries have a higher bar for residency, requiring retirees to have sizable savings as proof that they can sustain themselves and won’t become a burden. In some countries, the minimum needed may be about $250,000, Peddicord says. Retirees may also start by getting a temporary visa before establishing long-term residency.\nCustomers of Costa Rica’s National Power and Light Company will see a 3.78 percent decrease in electricity bills starting next month. Still, utility costs are one common gripe among retirees here.\n(Via CNFL)\n2. Cost of living and lifestyle. One of the biggest factors motivating people to retire abroad is the realization that their savings may go a lot further in another country, Peddicord says. The average rent bill in some major U.S. cities may be enough to cover a month of housing, food, utilities and entertainment abroad. For instance, in the Algarve region of Portugal, named the most attractive place to retire abroad by Live and Invest Overseas , a retiree could live on $1,410 a month, including $600 for rent. One of the more affordable cities, Da Nang, Vietnam, requires $840 total monthly to cover housing, food, utilities and other bills.\nBut retirees need to keep in mind that those lower bills usually mean making some changes when it comes to lifestyle. Someone living cheaply in a third-world country may have to deal with the power going on and off, the water disconnections and limited access to appliances they might be used to having back home, says Ben Gurwitz, a financial adviser with Financial Life Advisors in San Antonio.\n“If you’re trying to bring America somewhere else, you’re going to be disappointed,” he said. “If you embrace what the locals do, you’ll be happier with the move.”\n3. Health care. Medicare, the health insurance most U.S. patients rely on in retirement, won’t cover you out of the country. People living outside of the states will generally need to buy a health insurance policy that protects them in whatever country they’re in, Peddicord says. Or they can buy an international plan that covers them in multiple countries, including the United States, she adds. (Those will generally cost more since health care in the U.S. tends to be more expensive than in other countries.) In some countries with low health-care costs, retirees may be able to skip insurance and pay for routine doctor’s visits and other basic treatment out of pocket, Peddicord says. People going this route can buy a plan with a high deductible that would help cover costs after a major accident or other emergency, she says.\nSome people will still want to enroll and pay for Medicare, even if they are living abroad, Gurwitz says. That will ensure they are covered if they need to return to the states for surgery or other treatment, he says. Signing up when they become eligible can also help people avoid late enrollment penalties if they decide to move back to the U.S. later on. (Those penalties typically increase monthly premium costs by more than 10 percent.)\nSee also: 14 reasons to live in Costa Rica\n4. Where to keep your money. The ideal strategy may require at least two bank accounts – one in the United States where you keep the bulk of your savings and one in the foreign country where you keep your spending cash, says Scott Bishop, director of financial planning at STA Wealth Management in Houston. Retirement savings in a 401(k) or an IRA should be kept in the states because otherwise the account may need to be cashed out completely, an event that would require people to pay taxes on all of their savings at once, he says.\nHaving a U.S. checking account will make it easy to receive Social Security benefits and simplify matters for taxes. You can transfer a few months worth of spending money into a local bank account, which might be easiest for withdrawing cash and having money in the local currency, Bishop says. That foreign checking account may need to be registered with the Internal Revenue Service, he adds. And retirees should factor in the fees for transferring cash and any foreign transaction fees they might face for withdrawing money from a U.S. bank account while abroad, he says.\n5. Social Security. Most of the time, U.S. citizens find that their Social Security benefits will follow them wherever they land. There are some exceptions, however.The Social Security Administration won’t send payments to beneficiaries in Cuba and North Korea. It also won’t send payments to people in Georgia, Kazakhstan, Kyrgyzstan, Moldova, Ukraine, Uzbekistan and Vietnam, to name a few. (Check with the Social Security Administration and the Treasury Department, which periodically update the list of countries with restrictions.)\nSome people can qualify for exceptions if they agree to certain rules, such as picking up their checks in person each month at the U.S. embassy. But generally, the administration will withhold payments until a U.S. citizen moves to a country where benefits are not restricted.\nRelated: How to stay happy when relocating to Costa Rica\nOne of Costa Rica’s many stunning views.\nDavid Boddiger/The Tico Times\n6. Taxes. Moving to, say, Belize won’t offer an escape to the dreaded April 15 deadline . Retirees living abroad still have to file a tax return every year. Many retirees will receive credits for the taxes they pay to other countries, helping them to avoid double taxation, Bishop says. Retirees need to research the rules for the places they think they want to move so that they can estimate taxes and factor the costs into their planning, he says.\n7. Property. Real estate can often be much more affordable outside of the United States, especially after you account for the dollar’s recent rise against the euro and other currencies. But people looking to establish a permanent abode for themselves in another country may find that they’re restricted from buying property. In Mexico, for example, foreigners can’t buy property near the coast unless they do it through a corporation or trust, according to Live and Invest Overseas.\nLooking for property in Costa Rica? Check out our Real Estate section here .\nStill many countries, including France, Spain, Portugal, Italy and the Dominican Republic, allow foreigners to buy property as any citizen would, the report notes. If owning your home is important to you, look up the rules before you make a final decision. One option is to rent out your home in the states to pay the last of your mortgage or to provide rental income that can pad your living expenses overseas.\n© 2015 , The Washington Post", "external_links": ["http://www.ssa.gov/international/payments.html", "http://www.liveandinvestoverseas.com/"], "published": "2015-09-22T02:25:00.000+03:00", "crawled": "2015-09-24T10:19:43.065+03:00", "highlightTitle": ""}