{"organizations": [], "uuid": "c82dbb24ef05bc88eed1e2f0bdc33d9985e0405d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/images6.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/south-african-tourism-appoints-new-chief-quality-assurance-officer/", "country": "US", "title": "South African Tourism Appoints New Chief Quality Assurance OfficerTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "South African Tourism Appoints New Chief Quality Assurance OfficerTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "c82dbb24ef05bc88eed1e2f0bdc33d9985e0405d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/south-african-tourism-appoints-new-chief-quality-assurance-officer/", "ord_in_thread": 0, "title": "South African Tourism Appoints New Chief Quality Assurance OfficerTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "South African Tourism Appoints New Chief Quality Assurance Officer\nHospitality sector specialist, Darryl Erasmus, is the new Chief Quality Assurance Officer, South African Tourism announced today.Darryl is well known to the hospitality sector after spending a number of years within the sector in a myriad of operational, sales and marketing roles. These experiences he garnered with well-known brands such as Protea Hotels, Holiday Inn and Crowne Plaza.\nHe has also led marketing and corporate communications efforts across Africa for the Travel Commerce Platform, Travelport before taking up his most recent role as the Chief Executive Officer at Questek, a technology provider in the passenger transportation sector.\nCommenting on Darryl’s appointment, South African Tourism’s Chief Executive Officer, Mr. Thulani Nzima said: Darryl is well suited to head the Tourism Grading Council of South Africa after spending a great number of years in the industry. He has immersed himself in learning and understanding what makes establishments great, and how excellence and quality are at the center of any establishment worth visiting. As an organisation, we have adopted a holistic approach on how to drive our mandate of delivering on our brand promise. The Tourism Grading Council plays a huge role in that equation. As the third pillar of our business. It is essentially the foundation on which the other two pillars (leisure and business events tourism) are built. For it is through the Tourism Grading Council that destination South Africa is able to offer – and to offer with confidence – quality assurance, value for money and a predictable set of products, services and offerings that are aligned to global best practice in tourism. I have no doubt that with his myriad of experiences, Darryl will deliver the best in this strategic role.”\nDarryl remarked “I firstly must acknowledge the honour I’ve been given and I too must acknowledge the responsibility I have been tasked with. Taking up my appointment in Tourism Month is particularly apt and I am eager to engage with the industry and contribute significantly to the sector.\nMy goal will be to continue to support and empower the thousands of graded establishments across the country through partnerships with valued industry stakeholders, whilst constantly searching for innovative ways and global best practices to add value to the graded community and support the overarching South African Tourism strategies.”\nThe South African Tourism Management and its Board would like to welcome Darryl into the South African Tourism family, and wish him success in his new role.\nSource:-South African Tourism", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T00:12:11.051+03:00", "highlightTitle": ""}