{"organizations": ["AGA", "Tartine Bakery", "Best Food City", "Saveur", "Drinks International", "Saveur magazine", "Washington State University", "CNN", "The World", "Trieste"], "uuid": "839df6eaaf6e0b9cbbe82fcf082814a00078d506", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150903134452-saveur-next-great-food-city-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_travel.rss", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/09/06/travel/saveur-food-awards/index.html?eref=rss_travel", "country": "US", "title": "Check out the world's greatest food city", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Check out the world's greatest food city", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T18:44:00.000+03:00", "replies_count": 0, "uuid": "839df6eaaf6e0b9cbbe82fcf082814a00078d506"}, "author": "", "url": "http://edition.cnn.com/2015/09/06/travel/saveur-food-awards/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "Check out the world's greatest food city", "locations": ["Killary Harbor", "San Vito di Cadore", "Next Great Food City", "Tokyo", "Berlin", "Philadelphia", "Ireland", "Shaoxing", "Chile", "London", "Italy", "Achill Island", "San Francisco", "Florence", "New York", "Atlantic Way", "Santiago", "Coast", "Middle Eastern", "Los Angeles", "Japan", "Zahav", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alessandra Del Favero", "Adam Sachs", "Saveur", "Charles Smith", "Will Guidara", "Michael Solomonov", "Oliver Piras", "Charles Smith Wine", "Daniel Humm"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> And the world's greatest food city is ... Updated 0446 GMT (1146 HKT) September 7, 2015 11 photos: New Vegetarian Capital: Berlin – \"Berlin is the first major Western city where vegetarianism has achieved complete culinary parity with the traditional carnivore's diet,\" says New York-based Saveur magazine, which has published its Good Taste Awards for 2015. Hide Caption 1 of 11 11 photos: Food Trend Everyone Loves: Middle Eastern – Star chefs are so yesterday. Today, people are yearning for Middle Eastern flavors, dishes and cooking techniques, such as this dish from Michael Solomonov's Zahav restaurant in Philadelphia. Hide Caption 2 of 11 11 photos: Best Culinary Road Trip: Ireland's Coast – It may appear cold and rugged, but trust Saveur, Ireland's 1,600-mile Wild Atlantic Way offers the best road trip entwined with great foods. Hide Caption 3 of 11 11 photos: Next Great Food City: Santiago, Chile – The capital city of Chile is brimming with delicious food options. Borago (pictured) -- the highest ranking Santiago restaurant in this year's World's 50 Best Restaurants awards -- is \"unquestionably Santiago's restaurant of the moment.\" Hide Caption 4 of 11 11 photos: Good Taste in a Most Unusual Form: Stinky foods of Shaoxing, China – The experts of Saveur \"decided to give an award to something that isn't what people immediately think of when they think of good taste.\" They're correct that the stinky food of Shaoxing isn't easy to like at first. Hide Caption 5 of 11 11 photos: World's Best Food City: Tokyo – It's a popular misunderstanding that Tokyo serves only expensive sushi. Japan's capital city is the world's greatest food city because of the consistency of its high quality food -- regardless of price and type of cuisine. Hide Caption 6 of 11 11 photos: Hospitality Obsessives: Eleven Madison Park – As a three-Michelin-star fine-dining restaurant with a whopping $225-per-person menu, New York's Eleven Madison Park could be intimidating. But the magazine hails the two men behind the property, Will Guidara and Daniel Humm, for making it warm and hospitable. Hide Caption 7 of 11 11 photos: Modernized Classic: Florence, Italy – Modern isn't the first adjective that comes to mind when thinking of Florence. But a crop of openings -- new restaurants, food courts, a cooking school -- has transformed the city into an exciting food destination. Hide Caption 8 of 11 11 photos: Wine Radical: Charles Smith – Charles Smith, a former rock band manager, and his \"vineyard\" defy the stereotypes of wine-making. Charles Smith Wine is located in a former Dr. Pepper bottling plant -- redesigned with glass, concrete and steel aplenty. Hide Caption 9 of 11 11 photos: The Next Big Little Thing: Aga Restaurant – A restaurant in Italy's Dolomites has been voted \"The Next Big Little Thing\" by Saveur. \"You would be forgiven for being unable to find the little, unassuming Italian village of San Vito di Cadore on a map, but AGA (Via Trieste 6), a new restaurant from husband-and-wife team Oliver Piras and Alessandra Del Favero, is about to change that,\" says the magazine. Hide Caption 10 of 11 11 photos: The Bread Revolutionaries: Tartine Bakery and the Bread Lab – There's more science behind a slice of good bread than you might expect. San Francisco's Tartine Bakery's partnership with Washington State University's The Bread Lab to experiment with new varieties of wheat earned them a \"bread revolutionaries\" award. Hide Caption 11 of 11 (CNN) According to New York-based Saveur magazine's latest Good Taste Awards, you're doing the right thing if you 1. eat vegetarian food in Berlin, 2. know za'atar is a Middle Eastern spice mix and 3. understand that the \"zero-kilometer movement\" is a new food trend. In addition to naming the world's best food city, this year's survey includes some interesting new categories. The magazine's Next Big Little Thing award, for example, goes to AGA, a four-table restaurant in the Italian Dolomites village of San Vito di Cadore. It's described as the perfect example of the \"zero-kilometer movement,\" a farm-to-table dining concept that requires all ingredients be foraged or hunted within or near the restaurant property. Tartine Bakery in San Francisco and The Bread Lab at Washington State University -- which work closely with each other -- were named Bread Revolutionaries of the year. Stinky food from Shaoxing, China, was called the Good Taste in a Most Unusual Form. Already a delicacy in many Asian countries, fermented tofu is recommended because it's \"something that isn't what people immediately think of when they think of good taste,\" Saveur editor in chief Adam Sachs tells CNN. Best food and drink cities And for the awards you really care about: The World's Best Food City title has been bestowed on Tokyo. As a Saveur article explains, in Tokyo visitors can find delicious food in all price ranges, with good consistency. That's not just for Japanese food -- French and Italian cuisine in Japan's capital city are sublime, too. Berlin claimed the throne as the world's New Vegetarian Capital. London may boast the most bars on The World's 50 Best Bars 2014 list published by Drinks International, but according to Saveur, Los Angeles is the world's Breakout Cocktail Scene. From lamb raised on Achill Island to mussels harvested in Killary Harbor, Ireland's coast offers the Best Culinary Road Trip. Middle Eastern flavor is the Food Trend Everyone Loves. Santiago, Chile, is the Next Great Food City. And in case you're still wondering what za'atar is, the Middle Eastern spice is a blend of sumac, sesame and herbs that every line cook should now learn to make, according to the magazine. Love food? Love to travel? Share pics of your Culinary Journeys on Instagram with the hashtag #CNNFood for a chance to be featured on CNN.com. For inspiration, check out a few of our most recent submissions. Culinary Journeys", "external_links": [], "published": "2015-09-09T18:44:00.000+03:00", "crawled": "2015-09-09T20:15:57.693+03:00", "highlightTitle": ""}