{"organizations": [], "uuid": "5f98b39e23357acc8371d1bec49665dce444ad88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30056940/southwest-airlines-honors-hispanic-heritage-month", "country": "US", "title": "Southwest Airlines Honors Hispanic Heritage Month", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Southwest Airlines Honors Hispanic Heritage Month - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "5f98b39e23357acc8371d1bec49665dce444ad88"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30056940/southwest-airlines-honors-hispanic-heritage-month", "ord_in_thread": 0, "title": "Southwest Airlines Honors Hispanic Heritage Month", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Southwest Airlines\nSouthwest Airlines continues its commitment to the Hispanic community through its support of community events all year long\nDALLAS , Sept. 17, Southwest Airlines (NYSE: LUV) celebrates Hispanic Heritage Month and continues its proud tradition of sponsoring nonprofit organizations dedicated to making a positive difference in the Latino community.\n\"Our Employees and Customers are from diverse cultures and backgrounds,\" said Ellen Torbert , Southwest Airlines' Vice President of Diversity and Inclusion. \"Southwest is enriched because we value the unique perspectives of our Employees and Customers, and we're proud to continue to be a champion of the Latino community.\"\nTo learn more about Southwest Airlines' commitment to the Hispanic community, please visit Southwest.com/vamonos .\nSouthwest Airlines celebrates Hispanic Heritage Month throughout the year:\nJanuary-December | Smithsonian Institute Latino Center, Young Ambassadors Program and Hispanic Heritage Month Family Day, Washington, D.C.\nThe Smithsonian Latino Center was created in 1997 to promote Latino presence within the Smithsonian. The Center works collaboratively with the Institution's museums and research centers, ensuring that the contributions of the Latino community in the arts, history, national culture, and scientific achievement are explored, presented, celebrated, and preserved.\nFebruary-November | Congressional Hispanic Caucus Institute (CHCI), Congressional Internship Program, Washington, D.C.\nSouthwest Airlines was the official airline for the CHCI Internship Program, which brought 78 interns from across the nation to Washington, D.C. , for an eight or 12-week internship on Capitol Hill.\nMarch | Hispanas Organized for Political Equality (HOPE), HOPE Youth Leadership Program, Los Angeles\nSouthwest Airlines sponsored the HOPE Youth Leadership Program, a program dedicated to serving 300 low-income, first generation, high school-age Latinas for a self-sufficient future that will allow for economic and political parity through a college education.\nMarch | MANA de San Diego , Hermanitas Mentorship Program's Avanzamos Conference, San Diego\nSouthwest Airlines helped MANA de San Diego congregate more than 60 7 th -12 th grade Latinas to explore STEM workshops including bioengineering, planetary science, and chemistry.\nMarch | TELACU Education Foundation, College Success Program Leadership Retreat, Lake Arrowhead, CA\nThis life-changing retreat enhances first-generation Latino students' team building and communication skills; promotes bonding with their peers and community engagement; and develops their self-respect, self-esteem, self-discovery, and confidence in a way that cannot be achieved through classroom-style workshops or sessions.\nMarch-November | Latino Leaders Network, Latino Leaders Luncheon Series, Chicago , Los Angeles , and Washington, D.C.\nThe Latino Leaders Luncheon Series consists of quarterly events that provide a platform for prominent Latino leaders to share their personal stories of overcoming obstacles to achieve success.\nApril | Hispanics in Philanthropy (HIP) Annual Membership Meeting: Art, Identity, and the Changing Narrative about Latinos, San Francisco\nSouthwest Airlines sponsored HIP's mission to strengthen Latino communities by increasing resources for the Latino and Latin American civil sector; increasing Latino participation and leadership throughout the field of philanthropy; and fostering policy change to enhance equity and inclusiveness.\nApril | Valle del Sol , Golf Fore Kids, Phoenix\nSouthwest Airlines is the official airline of Valle del Sol . The organization inspires positive change by investing in health and human services to strengthen families with tools and skills for self-sufficiency and by building the next generation of Latino and diverse leaders.\nApril | Conexion Americas, A Cup of Coffee for Conexion Americas, Nashville\nSouthwest Airlines sponsored A Cup of Coffee for Conexion Americas, or el cafecito, Conexion Americas' annual fundraising breakfast, which showcases program participants and their successes.\nApril | Hispanic Chamber of Commerce of Greater Kansas City , Comida, Kansas City\nSouthwest Airlines was a sponsor of Comida, the 2nd Annual Latin Culinary Arts Experience. Proceeds benefitted the Hispanic Chamber of Commerce of Greater Kansas City and the Greater Kansas City Hispanic Collaborative.\nApril | South Florida Hispanic Chamber of Commerce (SFLHCC), Education Enhancement Program, Miami\nSFLHCC promotes the continued growth and development of the Hispanic business community and serves as a resource center and forum to advocate for Hispanic and minority-owned businesses. Southwest is the exclusive sponsor of the SFLHCC Education Program.\nApril-November |The Mexican American Legal Defense & Educational Fund (MALDEF), 2015 National Awards Galas, Washington, D.C. , Chicago , San Antonio , and Los Angeles\nSouthwest Airlines is the official national airline sponsor of MALDEF's 2015 National Awards Galas, where MALDEF honors individuals whose work has been instrumental in addressing the issues and meeting the needs of the Latino community in the United States.\nMay | Mi Casa Resource Center, Women's Empowerment Luncheon, Denver\nSouthwest Airlines sponsored the Women's Empowerment Luncheon. The luncheon highlighted inspirational stories, networking and an introduction to the important work Mi Casa Resource Center does to empower women.\nMay | Arizona Hispanic Chamber of Commerce (AZHCC), Annual Black & White Ball, Phoenix\nThe AZHCC serves as the primary advocate for Latino-owned businesses statewide by offering seminars, workshops, marketing and networking events, as well as a variety of well-established, high-profile sponsorship opportunities for our corporate and community partners.\nMay | Hispanic Metro Chamber of Portland Latino Scholarship Program, Portland\nThe Hispanic Metropolitan Chamber works with all members of the community to increase the economic advancement of Latinos in Oregon and southwest Washington .\nMay | Barrio Logan College Institute (BLCI), \"Opportunity for Impact\", San Diego\nSouthwest Airlines was a sponsor of the annual \"Opportunity for Impact\" event, which raises funds for BLCI's after school college-prep programs that begin in third grade and continue through college completion. BLCI provides low-income, under-represented, and first-generation college-bound students a wide array of support services and resources including academic tutoring, college preparation, career exploration, renewable scholarships, parental support, mentors, field trips, and workshops. Annually, 100 percent of BLCI's high school graduates enroll in colleges/universities nationwide.\nSummer | Chicano Latino Youth Leadership Project (CLYLP), California\nSouthwest Airlines is a sponsor of the Chicano Latino Youth Leadership Project, which enhances and builds the leadership potential of California's Chicano/Latino youth to build communities and create a stronger, more prosperous state and nation. Southwest supports CLYLP's four annual conferences; Sacramento Leadership Conference, Los Angeles Institute, San Joaquin Valley Institute, and the Bay Area Institute.\nAugust | Hispanic Chamber of Commerce of Metro Denver, Sabor, Denver\nSouthwest Airlines was a supporter of the 2015 Sabor event. Sabor is known as the largest Hispanic business event in Metro Denver. Funding raised from Sabor will go directly to creating jobs for Hispanics, creating business opportunities for Hispanic businesses, and creating a thriving economic environment for companies who do business in the Hispanic market.\nAugust | Celebrando Latinas Conference, San Diego\nSouthwest Airlines is the official airline sponsor for Celebrando. The conference is a day to empower and educate over 1,100 Latinas in health, business and technology.\nSeptember | Southwest Airlines, The Power of Inclusion: My Journey , Dallas\nSouthwest Airlines hosted its Power of Inclusion Event in honor of Hispanic Heritage Month. This year's event focused on highlighting the story of Deborah Acosta Conder , Deputy Director of External Relations, NASA Johnson Space Center. Employees joined at the Company's headquarters to celebrate and learn together.\nSept. 17 | Hispanic Heritage Foundation, 28th Annual Hispanic Heritage Awards, Washington, D.C.\nSouthwest Airlines is the official airline of Hispanic Heritage Foundation and supports its annual Hispanic Heritage Awards. The Hispanic Heritage Awards were established by The White House in 1987 to commemorate the creation of Hispanic Heritage Month in America. The Hispanic Heritage Awards are considered among the \"highest honor for Latinos by Latinos\" and recognize notable Latinos who have made a positive impact on America, and the world, in various fields.\nSept. 18-19 | National Association of Latino Elected and Appointed Officials (NALEO), 11 th Annual National Summit on the State of Latino Education: Developing a Latino College Completion Policy Agenda, Washington, D.C.\nThe NALEO 11 th Annual National Summit on the State of Latino Education is a two-day professional development opportunity aimed at enhancing Latino policymakers' knowledge of the most pressing and timely policy issues in the field of postsecondary education.\nOct. 17 | Tucson Hispanic Chamber of Commerce (THCC), Annual Noche de Exitos Gala, Tucson\nSouthwest Airlines is a member and supporter of the Tucson Hispanic Chamber of Commerce. The THCC is recognized as the largest Latino organization in Arizona , with more than 1,100 member businesses representing tens of thousands of employees.\nOct. 22 | National Puerto Rican Leadership Council Education Fund (NPRLC), Annual Summit, Orlando\nThe National Puerto Rican Leadership Council Education Fund is a Florida nonprofit corporation created to help pass the \"leadership torch\" to future generations. They inspire youth through unbiased education and exemplary leadership. Southwest Airlines is the primary sponsor of the annual summit.\nOct. 22 | Chicanos Por La Causa (CPLC), 17 th Annual Esperanza Latino Teacher Awards, Phoenix\nSouthwest Airlines is the official airline of CPLC in both Phoenix and Tucson , the only community development corporation in Arizona that offers extensive services in both urban and rural areas. The extensive programs cover economic development, education, community development (housing), and social services.\nNov. 6 | National Museum of Mexican Art, Dia de los Muertos Ball: Love Never Dies , Chicago\nSouthwest Airlines is the official airline of this cultural gem, dedicated to showcasing the incredible artistic talent of Mexican and Mexican-American artists.\nNov. 7 | Puerto Rican Arts Alliance, National Cuatro Fest, Chicago\nSouthwest Airlines is the official airline of this cultural institution dedicated to preserving Puerto Rican arts and culture. The National Cuatro Festival celebrates the music of their national instrument.\nABOUT SOUTHWEST AIRLINES CO.\nIn its 45th year of service, Dallas -based Southwest Airlines (NYSE: LUV) continues to differentiate itself from other air carriers with exemplary Customer Service delivered by more than 47,000 Employees to more than 100 million Customers annually. Southwest operates more than 3,600 flights a day, serving 95 destinations across the United States and six additional countries. Southwest service to Belize City, Belize , begins Oct. 15 , 2015. Subject to foreign government approval, service to Liberia , Costa Rica , begins Nov. 1, 2015 .\nBased on the U.S. Department of Transportation's most recent data, Southwest Airlines is the nation's largest carrier in terms of originating domestic passengers boarded. The Company operates the largest fleet of Boeing aircraft in the world, the majority of which are equipped with satellite-based WiFi providing gate-to-gate connectivity while over the United States. That connectivity enables Customers to use their personal devices to access streaming music provided by Apple Music or to view video on-demand movies and television shows, as well as nearly 20 channels of free, live TV compliments of our valued Partners. Southwest is the only major U.S. airline to offer bags fly free® to everyone (first and second checked pieces of luggage, size and weight limits apply, some airlines may allow free checked bags on select routes or for qualified circumstances), and there are no change fees, though fare differences might apply. In 2014, the airline proudly unveiled a bold new look: Heart . The new aircraft livery, airport experience, and logo, showcase the dedication of Southwest Employees to connect Customers with what's important in their lives.\nFrom its first flights on June 18, 1971 , Southwest Airlines launched an era of unprecedented affordability in air travel described by the U.S. Department of Transportation as \"The Southwest Effect,\" a lowering of fares and increase in passenger traffic whenever the carrier enters new markets. With 42 consecutive years of profitability, Southwest is one of the most honored airlines in the world, known for a triple bottom line approach that contributes to the carrier's performance and productivity, the importance of its People and the communities they serve, and an overall commitment to efficiency and the planet. The 2014 Southwest Airlines One Report™ can be found at SouthwestOneReport.com .\nBook Southwest Airlines' low fares online at Southwest.com or by phone at 800-I-FLY-SWA.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/southwest-airlines-honors-hispanic-heritage-month-300145162.html\n ", "external_links": ["https://www.southwest.com/vamonos", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA05229&Transmission_Id=201509171530PR_NEWS_USPR_____DA05229&DateId=20150917", "http://www.southwest.com/?src=PRPRSWABOILERPLAT002015", "http://southwestonereport.com/2014/", "https://www.southwest.com/?src=PRPRCSR091515HISPANICHHMR", "http://www.prnewswire.com/news-releases/southwest-airlines-honors-hispanic-heritage-month-300145162.html"], "published": "2015-09-17T03:00:00.000+03:00", "crawled": "2015-09-18T02:10:44.100+03:00", "highlightTitle": ""}