{"organizations": [], "uuid": "e4b7ca301fb881d88f2df92454dc9ae676c4f198", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/article/10-amazing-moats-around-the-world/ar-AAdLTe3", "country": "US", "title": "10 Amazing Moats Around the World", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "10 Amazing Moats Around the World", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "e4b7ca301fb881d88f2df92454dc9ae676c4f198"}, "author": "Bess Lovejoy", "url": "http://www.msn.com/en-us/travel/article/10-amazing-moats-around-the-world/ar-AAdLTe3", "ord_in_thread": 0, "title": "10 Amazing Moats Around the World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "10 Amazing Moats Around the World Mental Floss 22 hrs ago Bess Lovejoy\n© Image Credit: Wikimedia Commons, Provided by Mental Floss Forbidden City, China . Everyone knows that no truly awesome castle is complete without a moat. These long, broad ditches, which may or may not be filled with water, mostly served to protect against marauding invaders, although some also helped stabilize buildings, and still others were just status symbols—the medieval equivalent of imported sports cars lining your driveway. While England is said to have 5,000 moats alone, they're also found in Africa, Japan, Asia, and elsewhere, protecting fortresses, temples, and towns as well as castles. Read on for ten amazing moats that you can still see.\n1. Forbidden City, China\nThe world's largest palace, located in the heart of Beijing, has an equally impressive moat. A 170-foot-wide, 20-foot-deep rectangle of water surrounds the Forbidden City, a massive complex of villas, shrines, storehouses, chapels, residences, and gardens that housed China's emperors and their families for almost 500 years, from 1420 to 1912. Once meant for protection, the water now adds a picturesque touch to the complex, which has become a museum.\n2. Český Krumlov Castle, Czech Republic\n© Image Credit: Tjflex2, Flickr // CC BY-NC-ND 2.0, Provided by Mental Floss What's better than a castle with a moat? A castle with a moat filled with bears, obviously. The State Castle and Chateau of Český Krumlov, the second-biggest castle complex in Central Europe, includes a dry moat that's been periodically filled with bears since at least 1707. Legend has it that the animals were given to the Rosenbergs, who ruled the castle and region for about 400 years, as a token of their supposed connection with an Italian family of nobles called the Orsinis. (\"Orsa\" means female bear in Italian.) According to the Associated Press, \"The animals get their own birthday parties and a big Christmas Eve Bear festival where children bring presents and food for them.\" They even have their own bearkeeper, a devoted man named Jan Černý, who is working to update the moat's ursinarium to modern-day bear living standards\n3. Fort Bortange, Netherlands\nThis star-shaped fort , with its accompanying network of star-shaped moats, was created in the late 16th century by Prince William the Silent during the Eighty Years' War. The Dutch were fighting for independence from Spain, and the fort's original purpose was to control the only road between Germany and the city of Groningen, which the Spaniards had taken over. The fort saw several battles before being converted into a village in 1851, but since the 1970s, it’s been an open-air museum. (It's far from the world's only star fort, by the way: the design evolved during the Renaissance as a response to increased use of gunpowder. Cannons could easily penetrate the high stone walls of medieval fortresses, but the star forts' lower angles, made from earthen or brick walls, were created to better resist cannon fire.)\n4. Himeji Castle, Japan\n© Buddhika Weerasinghe/Getty Images The largest and most famous of Japan's “samurai castles,” Himeji Castle is sometimes called Shirasagi-jo (\"White Heron Castle\") because its graceful white exterior is thought to resemble the bird. The castle complex includes 83 buildings, with well-preserved turrets, keeps, and courtyards, as well as a system of three moats meant to repel invaders. Building them required huge amounts of stone—more than three miles of it for the inner moat alone, exhausting local quarries so much that builders also incorporated Buddhist sculptures and stone coffins from prehistoric burial mounds, according to journalist Kristin Johannsen.\n5. Egeskov Castle, Denmark\n© Image Credit: Hans Splinter, Flickr // CC BY-ND 2.0, Provided by Mental Floss At Egeskov Castle, the moat is an entire lake, which the castle stands on top of, supported by a system of oak pilings. (Supposedly the castle required an entire oak forest to construct: hence its name, which means “oak forest.”) Built by nobleman Frands Brockenhuus and completed in 1554, it’s now said to be the best-preserved moated castle in Europe, and is open to the public. Aside from the moat, the castle includes 66 rooms, 171 doors, more than 2,000 windowpanes, a farm, a car museum, and an exquisitely detailed dollhouse. Tradition has it that if a wooden sculpture of a man lying beneath the spire of the castle's tower is ever moved from his cushion, the castle will sink into the moat on Christmas Eve. (Not surprisingly, the castle’s inhabitants have usually chosen to spend Christmas elsewhere, just in case.)\n6. Benin Walls, Nigeria\nThe City of Benin was once protected by a system of ramparts and moats that are said to have been the largest earthwork ever made. According to the New Scientist, they once extended for almost 1,000 miles, in a network of 500 interconnected boundaries. Dug by the Edo people between about 800 and 1500, they are also said to have been four times longer than the Great Wall of China, and to have taken about 150 million hours of digging to construct. Though much of them were destroyed by the British in 1897, parts are still around.\n7. Bodiam Castle, England\n© Image Credit: Gabrielle Ludlow, Flickr // CC BY-NC-ND 2.0, Provided by Mental Floss With its spiral staircases, massive towers, battlements, and ruined interior, the 14th century Bodiam Castle is pretty much your childhood dream come to life. And of course, there's a moat, about 540 feet long and 8 feet deep, and now stocked with ducks and fish. The castle was built by former knight Sir Edward Dallingridge in 1385 during the Hundred Years' War for protection against the French (supposedly, although Dallingridge saw it more as a status symbol) and has been largely unaltered since its construction.\n8. Fort Monroe, Virginia\n© AP Photo/ Steve Earley / The Virginian-Pilot The largest stone fort ever built in the U.S., the seven-sided Fort Monroe was built by the U.S. government from 1819-1834 at a strategic point on the tip of the Virginia peninsula. A moat surrounds all the inner structures. While most of the rest of Virginia fell to Confederate hands, the fort remained in Union control, and became a haven for former slaves. Former Confederate President Jefferson Davis also spent two years imprisoned at the site. It remained in military use until 2011, when it was decommissioned and became a national monument you can now explore.\n9. Matsumoto Castle, Japan\n© Image Credit: Daniel Héctor Stolfi Rosso, Flickr // CC BY-NC-ND 2.0. Provided by Mental Floss Nicknamed \"Black Crow Castle\" for its somber exterior (and in contrast to the “White Heron Castle,” Himeji), Matsumoto Castle was once ringed by three concentric stone moats: one encircled a tower, one protecting palaces and storehouses, and one surrounding the residential quarters where the families of 90 high-ranking samurais lived. Today, only two of the moats remain, but the castle is one of the most-visited in Japan.\nBuilt in the early 16th century, the castle was in use for about 350 years, and is now open to the public as a museum. It also contains a unique addition: in the early 16th century, the castle's lord added a \"moon-viewing tower\" where he and his friends could quaff sake and write poetry.\n10. Angkor Wat, Cambodia\n© REUTERS/Erik De Castro The world's largest religious building has a moat to match: Angkor Wat is surrounded by a 650-foot-wide, 13-foot-deep square of water that runs for more than 3 miles around the perimeter of the temple complex. It's so big it can be seen from space. In addition to protecting the temple's buildings—constructed in the 12th century to resemble the Hindu Mt. Meru, dwelling place of the gods—the moat also helped stabilize their foundation. By collecting runoff from the region's frequent monsoons, it prevents the temple from sinking into the mud below.\n ", "external_links": ["http://pinterest.com/pin/create/button/?url=http:%2f%2fwww.msn.com%2f03%2fen-us%2fAAdLTe3%3focid%3dsp&media=http:%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdMjio.img&description=%C4%8Cesk%C3%BD+Krumlov+Castle%2c+Czech+Republic+-+Image+Credit:+Tjflex2%2c+Flickr+%2f%2f+CC+BY-NC-ND+2.0%2c+Provided+by+Mental+Floss", "http://www.bourtange.nl/bezoekersinformatie/de-vesting", "http://mentalfloss.com/", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAdLTe3%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdN7Iy.img&description=The+Himeji+Castle+-+Buddhika+Weerasinghe%2fGetty+Images", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAdLTe3%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdMCAv.img&description=Cambodia%27s+famous+Angkor+Wat+-+REUTERS%2fErik+De+Castro", "http://pinterest.com/pin/create/button/?url=http:%2f%2fwww.msn.com%2f03%2fen-us%2fAAdLTe3%3focid%3dsp&media=http:%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdN59M.img&description=MATSUMOTO+-+Image+Credit:+Daniel+H%C3%A9ctor+Stolfi+Rosso%2c+Flickr+%2f%2f+CC+BY-NC-ND+2.0.+Provided+by+Mental+Floss", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAdLTe3%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdNak4.img&description=EGESKOV+CASTLE%2c+DENMARK+-+Image+Credit%3a+Hans+Splinter%2c+Flickr+%2f%2f+CC+BY-ND+2.0%2c++Provided+by+Mental+Floss", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAdLTe3%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdMgNf.img&description=Forbidden+City%2c+China+-+Image+Credit%3a+Wikimedia+Commons%2c+Provided+by+Mental+Floss", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAdLTe3%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdMPyQ.img&description=BODIAM+CASTLE%2c+ENGLAND+-+Image+Credit%3a+Gabrielle+Ludlow%2c+Flickr+%2f%2f+CC+BY-NC-ND+2.0%2c+Provided+by+Mental+Floss", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAdLTe3%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdN2y6.img&description=The+moat+at+Fort+Monroe+in+Virginia+-+AP+Photo%2f+Steve+Earley+%2f+The+Virginian-Pilot"], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-09-01T11:22:57.776+03:00", "highlightTitle": ""}