{"organizations": [], "uuid": "296e3ffef4123b84ec883683b21103196be345d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "entertainment.ie", "main_image": "http://images.entertainment.ie/images_content/rectangle/620x372/GuinnessStorehouse20159211418705.jpg", "site_section": "http://entertainment.ie/travel", "section_title": "Escapes Home Travel photo galleries premieres interviews videos rumours news stories - entertainment.ie ", "url": "http://entertainment.ie/travel/Be-A-Tourist-in-Ireland/370079.htm", "country": "IE", "title": "Be A Tourist in Ireland", "performance_score": 0, "site": "entertainment.ie", "participants_count": 1, "title_full": "Travel | Be A Tourist in Ireland - entertainment.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T23:47:00.000+03:00", "replies_count": 0, "uuid": "296e3ffef4123b84ec883683b21103196be345d3"}, "author": "Charlotte McCarthy", "url": "http://entertainment.ie/travel/Be-A-Tourist-in-Ireland/370079.htm", "ord_in_thread": 0, "title": "Be A Tourist in Ireland", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Recently, The Guinness Store House in Dublin was named as Europe's top tourist attraction .\nHowever, according to the latest visitor information, a large number of its attendees are from overseas, with many Irish people still to visit.\nIt's a pity that so few locals take the time to visit tourist attractions right on their doorstep, or plan trips to those within easy commute, but is it that surprising? How many Parisians visit the Eiffel tower each year, how many New Yorkers go to the Empire State Building?\nJust because an attraction is popular with tourists, that doesn't mean it can't be enjoyed by Irish people too. Here's our pick of top Irish tourist attractions really worth checking out:\nThe Guinness Storehouse, Dublin\nIt's Europe's top tourist attraction, so we had to include it on the list. Guinness is Ireland's most famous product and during the tour of the store house you will learn all about the history of the black stuff, as well as learning how to pour the perfect pint. It's great entertainment for an afternoon, and the views from the gravity bar are worth the price of admission.\nTayto Park, Co. Meath\nTayto Park is Ireland's only theme park, and home to Ireland's first roller coaster Cu Chulainn which opened in June and has already attracted thousands of thrill seekers. The coaster isn't the only thing to try out, there's also the Rotator, the Air Race, and the Sky Walk. If rides or heights aren't your thing, there's always the zoo and the Dinosaurs Alive exhibition.\nCliffs of Moher, Co. Clare\nThe Cliffs of Moher are breath taking, and the only way you can fully appreciate their scale and magnificence is to see them in person. Photos are impressive, but nothing can compare to the real thing. To get the most out of your visit, you should go to the Cliffs of Moher visitor centre; there are also numerous boat trips which run up and down the coast, allowing you to view the cliffs from sea level.\nFota Wildlife Park, Co. Cork\nFota Wildlife Park is Cork's top tourist attraction, and one of the most popular attractions in Ireland. During the summer they welcomed a pair of Cheetah cubs to their ever growing family of animals. It's worth a visit just to see those little, adorable balls of fluff, but there are plenty of other creatures on display too including giraffes, monkeys and native Irish red squirrels and corncrakes. It's not just for kids, any animal lover will enjoy their visit.\nKilkenny Castle, Co. Kilkenny\nKilkenny is a beautiful place for a weekend away, and while you're there one of the things you have to do is tour Kilkenny Castle. It's hard to miss, being located near the centre of town. After taking the guided tour, you could have a picnic lunch in the grounds or go for an afternoon stroll.\nThe Skellig Islands, Co. Kerry\nThis December people all over the world will be looking at the Skellig Islands when they feature as a location in Star Wars: The Force Awakens. They've proven so popular that the Star Wars crew are coming back to film the next instalment here too. Beat the crowds by going to visit the islands now, and check out their otherworldly look, which comes from both their remoteness and the famous stone beehive huts.\n Sliabh Liag, Co. Donegal\nThe Cliffs of Moher might be the best known cliffs in Ireland but Sliabh Liag can boast about being over twice their height, rising nearly 600m up from the Atlantic Ocean. From the top you can see across Donegal Bay to Letrim, Sligo and Mayo, and marvel at the beauty of the North-West coastline.\nNewgrange, Co.Meath\nNewgrange isn't just for primary school tours, as the Irish rugby team proved recently when they visited on one of their down days. The passage tomb is over 5,000 years old, making it older than the pyramids, and one of the most important historical sites in the country. You can extend your trip and visit some of the other attractions in Meath's Boyne Valley including Trim Castle and the Hill of Tara.\nLough Boora Discovery Park, Co. Offaly\nLough Boora Discovery Park is located between Tullamore, Birr and Clonmacnoise and the perfect place to visit if you're looking to spend a day in the fresh air, surrounded by nature. They have five different trails you can explore including their sculpture park route. It just depends on how far you want to go and what you want to see. They even offer a bike hire service, if you fancy a cycle.\nKylemore Abbey, Co. Galway\nIf you've ever wanted to pretend you're on Downton Abbey or in a Jane Austen novel, Kylemore Abbey is a place you need to visit. It was built in the 1860s, and is surrounded by a walled garden and the stunning Connemara landscape. You can spend the day exploring the abbey and the gardens then finish your day off with afternoon tea in one of their three cafes.\nFor more information on these and other tourist attractions around the country, as well as ideas for great Autumn breaks, please visit www.discoverireland.ie or find Discover Ireland on Facebook #thisisLIVING\nMORE: Guinness Storehouse shortlisted for Europe's leading tourist attraction in World Travel Awards\nMORE: Watch: Latest drone footage makes the Irish countryside look like a tourist's dream\nMORE: The cost breakdown of following Ireland to the World Cup final", "external_links": [], "published": "2015-09-21T23:47:00.000+03:00", "crawled": "2015-09-21T19:00:14.961+03:00", "highlightTitle": ""}