{"organizations": [], "uuid": "ad9170b417c0a2d1b9ecbdc83faab72e1a5846cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03419/businessman-laptop_3419929a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-11.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/business-travel-rewards/11826070/benefits-of-flying-business-class.html", "country": "US", "title": "Making business travel work for you", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Making business travel work for you - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T17:52:00.000+03:00", "replies_count": 0, "uuid": "ad9170b417c0a2d1b9ecbdc83faab72e1a5846cc"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/business-travel-rewards/11826070/benefits-of-flying-business-class.html", "ord_in_thread": 0, "title": "Making business travel work for you", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Discover more information about British Airways On Business Even if you fly every week, there’s still a thrill in taking to the air. Knowing that you’ll have a few moments to yourself in a new city, that you’ve been trusted to take the business to a new market, or that you are only one meeting away from sealing a big deal all hold their own excitement. Even so, minor annoyances can take the edge off things. Unpredictable situations, awkward routes and uncomfortable layovers are the flip side of business travel, and it’s all too easy for the expense and frustration of a difficult experience to obscure the positive reasons for flying out. One way to ensure better travel is to get your employer to sign up to a company loyalty programme. On Business, the scheme offered by British Airways, American Airlines and Iberia, offers access to one of the world’s largest travel networks, which means that when you book a flight, you are far more likely to find a direct route at a convenient time. And with upfront discounts available, those flights could well be cheaper than you’d find elsewhere. £6,000 spent on flights can earn a return flight from Heathrow to New York – big rewards for an organisation with a lot of frequent flyers Moreover, flying within an established partnership of reputable brands means that if schedules change, members can more easily hop onto the next flight offered by one of the other partners. That all makes the experience of flying for business feel a lot less like work. What’s more, being a member of a loyalty programme has its perks – for instance, with travellers afforded the ability to earn personal Avios while their employer earns On Business Points. On Business Points are earned whenever the business buys a flight and doesn’t take the discount option. The more staff members who fly and accrue these On Business Points, the better reward ratio, with the highest of the three tiers offering 1.5 points for every pound spent. At that rate, £6,000 spent on flights can earn a return flight from Heathrow to New York – big rewards for an organisation with a lot of frequent flyers. On Business Points can be redeemed for reward flights or upgraded tickets. That means that with a word in your boss’s ear – perhaps pointing out how your contributions to the business deserve star treatment, or that the clients need to see how big a player your business really is – you could soon be travelling in style. After all, premium cabins are so called for a reason. Economy cabins are equipped for travellers packing a book, a tablet, and perhaps a small bottle of water. Larger, more luxuriously equipped cabins are tailored for those carrying a presentation deck, a laptop, and a mild sense of foreboding about the upcoming pitch. Because they are built for business, premium cabins ensure that you have the space to work and stay on track and also to get the best possible rest. As a result, travellers arrive a step ahead and ready to do business. • Find out more about how your company can make savings on business travel by visiting British Airways On Business", "external_links": [], "published": "2015-09-11T17:52:00.000+03:00", "crawled": "2015-09-11T12:42:09.743+03:00", "highlightTitle": ""}