{"organizations": [], "uuid": "94475aa02d4d9aaf571f716fbe0a1640c39889a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.edmontonsun.com", "main_image": "http://storage.edmontonsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297752299880_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.edmontonsun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.edmontonsun.com/2015/09/24/researchers-say-scots-have-the-most-words-for-snow", "country": "CA", "title": "Researchers say Scots have the most words for snow", "performance_score": 0, "site": "edmontonsun.com", "participants_count": 0, "title_full": "Researchers say Scots have the most words for snow", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T15:00:00.000+03:00", "replies_count": 0, "uuid": "94475aa02d4d9aaf571f716fbe0a1640c39889a0"}, "author": "", "url": "http://www.edmontonsun.com/2015/09/24/researchers-say-scots-have-the-most-words-for-snow", "ord_in_thread": 0, "title": "Researchers say Scots have the most words for snow", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Researchers say Scots have the most words for snow \nJill Lawless, THE ASSOCIATED PRESS First posted: Friday, September 25, 2015 06:00 AM MDT A man clears a road of snow in Pitlochry, central Scotland February 23, 2015. REUTERS/Russell Cheyne \nLONDON -- The Inuit of the Arctic know a lot about snow, and their wide vocabulary for the white stuff is legendary. \nBut they may face a challenge in snow-describing ability -- from Scotland. \nResearchers at the University of Glasgow have compiled 421 words relating to snow for a new Historical Thesaurus of Scots . They range from \"snaw\" -- plain old snow -- to \"spitters,\" small drops of wind-driven snow, and \"flindrikin,\" a slight snow shower. \nThe first sections of the thesaurus, covering weather and sports, are published online Wednesday. \nAs befits a country renowned for its grey, damp, drizzly climate, Scots also contains multiple words for rain and mist. \nRelated Content Top snow destinations for the holidays \n\"It's a bit surprising that snow would give rain a run for its money,\" said Susan Rennie, lecturer in English and Scots Language at Glasgow. \"That's a nice surprise.\" \nRennie said the wide range of weather-related terms shows how important it was for people in Scotland -- for centuries a largely agricultural country -- to distinguish \"quite subtle gradations of weather.\" \nThe Scots language -- which is sometimes considered a dialect of English -- has been recognized as \"an integral part of Scotland's distinctive culture and heritage\" by Scotland's nationalist government. It is classed as one of Scotland's three main languages, alongside English and Gaelic. \nThe compilers of the thesaurus want readers to send in their own words to add to the list, and hope the book may encourage the return of some forgotten terms. \n\"Some words are ripe for revival,\" Rennie said. \nWhat language would not be enriched by \"snaw-ghaist\" -- an apparition seen in the snow -- or \"snaw-breaker\"? \n\"It sounds like it's going to be a snow plow,\" Rennie said. \"But in fact it's a word for a sheep that breaks a path through the snow for its fellow sheep to follow.\" Top stories", "external_links": [], "published": "2015-09-25T15:00:00.000+03:00", "crawled": "2015-09-25T16:41:48.814+03:00", "highlightTitle": ""}