{"organizations": [], "uuid": "efbd3d805994dd1b220c462bb488a5feffbdac5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/01/20/china-economy-xxx/ALTERNATES/crop_100x100/China+economy+xxx", "site_section": "http://www.bdlive.co.za/life/travel", "section_title": "Travel &amp; Food | BDlive ", "url": "http://www.bdlive.co.za/world/asia/2015/09/30/china-takes-scythe-to-parastatal-zombies", "country": "ZA", "title": "China takes scythe to parastatal zombies | Asia-Pacific", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "China takes scythe to parastatal zombies | Asia-Pacific | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T18:14:00.000+03:00", "replies_count": 0, "uuid": "efbd3d805994dd1b220c462bb488a5feffbdac5c"}, "author": "Judy Chen", "url": "http://www.bdlive.co.za/world/asia/2015/09/30/china-takes-scythe-to-parastatal-zombies", "ord_in_thread": 0, "title": "China takes scythe to parastatal zombies | Asia-Pacific", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China economy. Picture: REUTERS Related articles Asian shares rally, but remain on track for quarterly loss Job losses mount as economy stumbles China punishes ‘lazy’ officials for unspent funds SHANGHAI — China is weeding out weak state firms that Premier Li Keqiang called zombies, as Australia and New Zealand Banking Group warns rising debt in the sector may drag economic growth down to as low as 3%.\nConcerns are growing that China National Erzhong Group has become the second state firm to default on onshore debt after a September 28 deadline for an interest payment passed without word from the company whether it was made. That comes five months after Baoding Tianwei Group became the first state firm to default, with the maker of electrical transformers having more recently filed for bankruptcy.\n\"Chinese SOEs’ leverage ratio has risen substantially while their profitability weakened substantially,\" said ANZ’s Hong Kong-based China chief economist, Liu Li-gang. \"The government should help SOEs to swap their debt into equity through mergers, restructuring, initial public offerings or bankruptcies.\"\nThe stakes have never been higher as China tries to halt a sharper slowdown in economic growth already at its weakest in a quarter of a century. Expansion could have topped 8% in the first half of the year if state enterprises had kept pace with private firms, according to Bloomberg Intelligence. Instead, bloated government companies that face mounting debt payments dragged it down to 7%.\nPremier Li pledged earlier this month to reform state companies, which Nomura Holdings estimated get about 46% of bank loans. China also announced long-awaited guidelines to make SOEs more efficient. State firms must repay 5.57 trillion yuan ($876bn) of bonds this year, triple the amount three years ago, according to China Investment Securities’ data.\n\"It makes sense to let zombie SOEs go bankrupt,\" said Tommy Xie, an economist at Oversea-Chinese Banking in Singapore. \"It sends a strong signal that the government is serious about SOE reform.\"\nChina National Erzhong, which makes equipment for the steel industry, said earlier this month that parent China National Machinery Industry would \"take over\" its 2017 notes that had the interest payment due on Monday. It defaulted after a local court accepted a creditor’s restructuring request, as China’s law stipulates payments can’t be made after starting a restructuring process, according to China Bond Rating.\nChina International Capital said China National Machinery agreed with bondholders not to pay interest on the 2017 securities and a 2015 debenture from a unit, without saying where it got the information.\nZhu Kai, an official in Erzhong’s finance department, declined to comment.\nChina last shook up its SOEs nearly two decades ago when some 60,000 firms were closed and 40 million workers let go. If no reforms are taken this time, economic growth may tumble to 3% to 4% in 2017, ANZ’s Liu said.\nThe guidelines, announced earlier this month, stressed the need to reform \"zombie\" companies and step up privatisation by attracting outside capital.\n\"SOEs should be allowed to go bankrupt so that the credit market can efficiently allocate scarce capital,\" said Xia Le, the chief Asian economist at Banco Bilbao Vizcaya Argentaria SA in Hong Kong.\nBloomberg", "external_links": [], "published": "2015-09-30T18:14:00.000+03:00", "crawled": "2015-09-30T11:50:56.848+03:00", "highlightTitle": ""}