{"organizations": ["Tourism Australia", "News Corp Australia"], "uuid": "71335a7d3cc324b6e925893e07fc3a7ff7c58e2a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/12bGw4dzrCzH1se5aD00sY18J8hOapcE/promo264989621&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://feeds.news.com.au/public/rss/2.0/trav_top_stories_288.xml", "section_title": "NEWS.com.au | Travel | Top Stories", "url": "http://www.news.com.au/travel/travel-updates/tourisms-biggest-year-since-the-sydney-olympics-is-now-worth-91m-a-day-to-australia/story-e6frfq80-1227508082126?from=public_rss", "country": "IL", "title": "Chinese tourists spend $91m a day", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Chinese tourists spend $91m a day", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T10:36:00.000+03:00", "replies_count": 0, "uuid": "71335a7d3cc324b6e925893e07fc3a7ff7c58e2a"}, "author": "", "url": "http://www.news.com.au/travel/travel-updates/tourisms-biggest-year-since-the-sydney-olympics-is-now-worth-91m-a-day-to-australia/story-e6frfq80-1227508082126?from=public_rss", "ord_in_thread": 0, "title": "Chinese tourists spend $91m a day", "locations": ["Broadbeach"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tourism Australia's new campaign will put the spotlight on one of Australias key competitive advantages our aquatic and coastal offerings News Corp Australia 28 Aug 2015 Travel So much to see ... A busload of Chinese tourists take in the sights and take photos of Broadbeach. Picture: Scott Fletcher Source: News Corp Australia \nAUSTRALIA’s tourism industry has recorded its best year since the Sydney Olympics, with international visitors spending a mammoth $91 million a day. \nChinese tourists accounted for more than a fifth of that expenditure, parting with $19 million a day, or $7 billion for the year. Love you Brisbane ... Chinese tourist Wu Jun. was looking forward to buying Ugg boots while visiting the Queensland capital. Picture: Liam Kidston Source: News Corp Australia \nFederal Tourism Minister Andrew Robb said the latest International Visitor Survey showed the total spend had grown ten per cent to $33.4 billion, or $3.2 billion more than the previous year. \nHe said it was the strongest yearly growth since 2001, the period of the Sydney Games. \n“Today’s result once again demonstrates that tourism is one of our greatest strengths,” said Mr Robb. \n“Tourism can be our fastest growing sector this decade if we continue to leverage our “clean, green and safe” brand to position ourselves as the number one, long-haul destination in Asia.” \nChina remained the dominant source of growth with a 22 per cent increase in visitor numbers to 864,000 and a 32 per cent rise in expenditure. Seeing the countryside ... Chinese visitors from the Barossa Wine School in South Australia. Picture: Supplied Source: Supplied \n“With China now accounting for one in every five dollars spent by international visitors, it is clear that China is vital to the sustained growth of our tourism sector,” Mr Robb said. \nUniversity of Technology Sydney tourism researcher, Deborah Edwards, said there was no great formula for attracting Chinese visitors, now travelling the world in the millions. \n“The Chinese visitor is looking for an immersive experience. They want to engage with Australians, they want to shake hands with someone in a pub, they want to experience how Australians live,” said Dr Edwards. Hey big spenders ... Chinese visitors are spending $19 million a day in Australia. Picture: Jono Searle Source: News Corp Australia \n“That’s no different really to what we want when we travel.” \nRecord growth in visitors was also achieved by the US market — up nine per cent to 544,000, and New Zealand, up three per cent to 1.2 million arrivals. \n“With new records for international tourism, growth in spend not seen since the Sydney Olympic Games and a reinvigorated tourism investment pipeline, the Australian tourism industry is well positioned to prosper as one of our great economic strengths,” said Mr Robb.", "external_links": [], "published": "2015-09-01T10:36:00.000+03:00", "crawled": "2015-09-01T12:06:20.467+03:00", "highlightTitle": ""}