{"organizations": [], "uuid": "fb498ad99cd1efdd1328120663f39fae994a20a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03451/money-paper-planes_3451459a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/business-travel-rewards/11887511/how-to-break-into-new-overseas-markets.html", "country": "US", "title": "How to break into new overseas markets", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "How to break into new overseas markets - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T19:08:00.000+03:00", "replies_count": 0, "uuid": "fb498ad99cd1efdd1328120663f39fae994a20a9"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/business-travel-rewards/11887511/how-to-break-into-new-overseas-markets.html", "ord_in_thread": 0, "title": "How to break into new overseas markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Discover more information about British Airways On Business Why Germany? “It’s an interesting question,” says Lopo Champalimaud, the Canadian-born Portuguese founder of Wahanda. Certainly, he admits, “not that many UK companies have gone into Germany and been successful”. However, he adds, the company’s decision to carry out its first major overseas acquisition was part of a deliberate strategy. As the world’s first and biggest online booking platform for beauty and spa treatment, UK-based Wahanda was in a good position in 2013. But knowing that a serious competitor was likely to emerge from Europe – particularly from the Berlin tech scene – Mr Champalimaud knew he needed to get out there and nip such competition in the bud. “It’s better to be aggressive,” he says. So in October 2014, Wahanda established a presence in that market by acquiring Salonmeister – a smaller, 20-person outfit that offered similar services to itself. It was the first major step in an international expansion programme that now includes four more companies and offers access to some 20,000 spas and salons throughout Europe. So, how do you go about taking similar steps in your business? First and foremost is to put figurative ‘boots on the ground’. Many business owners find it useful to fly out for extended trips of several days to get a sense of a region’s competitors, its business scene and consumers – something that can’t be achieved as readily from home. Good internal communication before and after those acquisitions has been “vital” in “building trust and ensuring everyone is aligned For Wahanda, opportunities for acquisitions have mostly been sniffed out through informal chats with peers and counterparts in foreign markets – which Mr Champalimaud reckons has been made easier by the fact that, in this relatively new industry, everyone is still finding their way. Next is to remain open to change. Expanding into new markets does not mean imposing on them (a distinction many companies fail to recognise). Although the Salonmeister deal was Wahanda’s first full-blown acquisition, the company did already have some useful experience under its belt, taking on four developers who made up a small Lithuanian business called Salonium in 2012. “They changed us more than we changed them,” says Mr Champalimaud. “The lesson there was that it is important to have a certain sense of humility [when an acquisition takes place]. There are certain things that you may learn – it’s possible to do things differently, and better.” Third is to keep people as a priority. Mr Champalimaud says that the most significant motivation for Wahanda’s overseas acquisition activity has been to bring good people on board and to establish a presence in particular foreign markets. Of course, there’s no guarantee that these new hires will want to stick around, and it’s crucial that when investing in a new operation that you clearly map out your goals and strategy with your acquisition targets, before pen is put to paper on any deal. “Good internal communication before and after those acquisitions has been “vital” in “building trust and ensuring everyone is aligned”, says Mr Champalimaud. For now, that means some seriously frequent flying. “Even though our business is run primarily from the UK, I’m on a plane three days a week [mainly visiting the new European offices] and there’s a company meeting every month,” he says. “You can’t enable people to make good decisions unless you give them as much information as possible – that’s how you get autonomy. “I want them to be able to ask questions, to feel the vibe of the company – and the best way to do that is by meeting in person.” • Find out more about how to receive business travel rewards by visiting British Airways On Business", "external_links": [], "published": "2015-09-28T19:08:00.000+03:00", "crawled": "2015-09-28T13:39:47.269+03:00", "highlightTitle": ""}