{"organizations": [], "uuid": "e61e3f0779a30d8a39c87dd18b830a246ab62e13", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30130463/absolute-worldwide-logistics-acquires-online-trucking-portal-shipmymachinerycom", "country": "US", "title": "Absolute Worldwide Logistics Acquires Online Trucking Portal Shipmymachinery.com", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Absolute Worldwide Logistics Acquires Online Trucking Portal Shipmymachinery.com - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "e61e3f0779a30d8a39c87dd18b830a246ab62e13"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30130463/absolute-worldwide-logistics-acquires-online-trucking-portal-shipmymachinerycom", "ord_in_thread": 0, "title": "Absolute Worldwide Logistics Acquires Online Trucking Portal Shipmymachinery.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Absolute Worldwide Logistics\nBALTIMORE , Sept. 28, Absolute Worldwide Logistics announced today that it has finalized its transaction to acquire Shipmymachinery.com for undisclosed terms.\nShipmymachinery.com is a privately held online web portal providing transportation lead generation services to the transportation industry throughout North America relating to capital equipment and machinery among other specialized equipment commodities.\n\"With the acquisition of Shipmymachinery.com, we will integrate the lead generation aspect of the web portal with our operations team who has more than 30 years of Specialized Equipment fulfillment,\" said John Hart , Absolute Worldwide Logistics CEO. \"This acquisition brings synergies to our truckload operations, and more importantly provides 100% of a looped quoting and fulfillment process for our current customers and prospective customers. Furthermore, we hope to gain increased market share in the specialized transportation sector within various customer verticals,\" Hart said.\n\"The shipmymachinery.com operations team will be based out of our Toledo, Ohio office and will be managed by industry veteran Bob Gergich ,\" says Hart. \"Bob and his team provide a wealth of knowledge in the areas of specialized transportation relating to machinery and capital equipment needs for our current and future clients,\" said Hart.\n\"We have built our business on providing the highest level of customer service to all of our clients and we are excited to add this unique portal to our service offering. It is an immediate and accessible way for customers to engage with us. We plan on adding additional tools and features in the upcoming months to the shipmymachinery.com website that will make this an even better interactive experience,\" said Hart.\nFounded in 2011, Absolute Worldwide Logistics is a global provider of multimodal transportation and logistical solutions. Absolute Worldwide Logistics offers a full menu of flexible and tailored service options to deliver the right solution at the right time and at a competitive price. Our team has over 150 years of combined domestic and international shipping expertise with a longstanding history of success. We utilize some of the same technology as larger 3PL's while still providing a more hands-on personalized approach to customer service.\nFor more information about Absolute Worldwide Logistics, please contact John Sayre , 419-873-6262, email , www.absolutewl.com .\n releases/absolute-worldwide-logistics-acquires-online-trucking-portal-shipmymachinerycom-300149253.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=PH12094&Transmission_Id=201509280830PR_NEWS_USPR_____PH12094&DateId=20150928", "http://pressreleaseheadlines.com/contact?pid=291033", "http://www.prnewswire.com/news-releases/absolute-worldwide-logistics-acquires-online-trucking-portal-shipmymachinerycom-300149253.html", "http://www.xmlnews.org/ns/", "http://www.absolutewl.com/"], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T20:44:04.716+03:00", "highlightTitle": ""}