{"organizations": [], "uuid": "9caeb8053470a5fcc89e71c08734ab7fb51e0872", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03443/glacier-3000-coast_3443279k.jpg", "site_section": "http://www.telegraph.co.uk/newsfeed/rss/travel_main.xml", "section_title": "Telegraph Travel", "url": "http://www.telegraph.co.uk/travel/snowandski/skiing-news/11871513/The-best-alpine-roller-coasters.html", "country": "CH", "title": "The best alpine roller coasters", "performance_score": 3, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "The best alpine roller coasters", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T10:23:00.000+03:00", "replies_count": 0, "uuid": "9caeb8053470a5fcc89e71c08734ab7fb51e0872"}, "author": "Helen Coffey", "url": "http://www.telegraph.co.uk/travel/snowandski/skiing-news/11871513/The-best-alpine-roller-coasters.html", "ord_in_thread": 0, "title": "The best alpine roller coasters", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Skiing news The best alpine roller coasters As Revelstoke announces plans to build an alpine roller coaster, we check out the fastest, longest and craziest rides in ski resorts The Glacier 3000 alpine coaster is the highest in the world Comments \nSnow sports are fun. Roller coasters are fun. \nPut them together, then, and what have you got? Alpine roller coasters, potentially the most fun activity you can have in a ski resort. \nThey differ from traditional roller coasters in that they are driven by gravity, rather than electricity, plus the rider can control their own speed using brakes. \nRevelstoke ski resort in British Columbia, Canada, is soon to be home to its very own coaster. It's been announced that the resort will open a 1.4km-long mountain coaster next summer, expected to reach speeds of 42kph. Designed by Brandauer Mountain in Austria, the coaster runs on a mono rail system and is constructed close to the ground to simulate the experience of skiing or mountain biking. \nHowever, Revelstoke isn't the first ski resort to jazz up its mountain offering with a roller coaster – far from it. Here are some of the best alpine coasters, along with POV videos so you can feel as if you're actually there (without the cold bottom): Park City, Utah, USA \nPark City is already hitting headlines this season as its link with neighbouring Canyons makes it the new largest ski resort in the States . But it has another, overlooked, string to its bow. It's also home to Utah's longest alpine coaster – a 1.2km-long track on which riders reach speeds of up to 48kph. From $22 for one adult ride, $8 for children. \nExperience it for yourself by watching a delightfully excitable man have a go while narrating his journey: Hoch-Imst, Austria \nThis tiny, charming resort in the Austrian Alps decided to make its name by constructing the world's longest alpine roller coaster in a ski resort, rather than jostling for position by expanding its terrain. And why not find something new to brag about? Its impressive 3.5km coaster starts at an altitude of 1,500m, before winding its way down 500m of vertical on a ride that takes over nine minutes. It's pretty reasonable, too, at €6.90 per adult and €4.70 per child ride. \nHere, a man tries to catch his friend on the coaster, in a high speed chase reminiscent of a (very) low-budget Bond movie … Glacier 3000, Switzerland \nHoch-Imst has the Longest Alpine Coaster title, but Glacier 3000 wasn't going to be fazed – it went for Highest Alpine Coaster instead. The 1km run starts at an altitude of 2,970m, before twisting, turning and undulating its way down over a two-minute long ride, reaching speeds of up to 40kph. CHF9 per go for adults and children. \nWatch a person of indeterminate gender enjoy this coaster in absolute silence. Breckenridge, Colorado, USA \nThe Gold Runner alpine coaster in Breckenridge resort boasts a track of 762m, on which you can opt to travel alone or with a friend. It's open in winter and in summer, and costs $20 per ride. Oh, and if you're there in the summer, there's also an Alpine Super Slide that looks like it comes a very close second to the coaster in terms of racy downhill fun. \nEnjoy the short but sweet ride (we suggest you click to skip the ride up): Klausberg, Italy \nTo finish, we give you the Klausberg Flitzer Alpine Coaster, Italy's longest mountain coaster. The 1.8km coaster can reach speeds of 40kph – and, as an added bonus to the general fun, you get a free ride included on the Klausberg lift pass. Win! \nThis videographer really makes use of the 'POV' aspect by wiggling their head around, to give that genuine stomach curdling experience.", "external_links": [], "published": "2015-09-18T10:23:00.000+03:00", "crawled": "2015-09-18T11:04:48.964+03:00", "highlightTitle": ""}