{"organizations": [], "uuid": "e439994a64b32b7e7cb7c6a882773fa0f0e0ac8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-09/PR_12038903.jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094360478/First-Branch-of-Mumbais-Kareems-Indian-Cuisine-Restaurant-to-open-in-Ramada-Hotel-Abu-Dhabi-Corniche?src=RSS", "country": "US", "title": "First Branch of Mumbais Kareems Indian Cuisine Restaurant to open in Ramada Hotel Abu Dhabi Corniche", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "First Branch of Mumbais Kareems Indian Cuisine Restaurant to open in Ramada Hotel Abu Dhabi Corniche | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "e439994a64b32b7e7cb7c6a882773fa0f0e0ac8b"}, "author": "Press", "url": "http://www.menafn.com/1094360478/First-Branch-of-Mumbais-Kareems-Indian-Cuisine-Restaurant-to-open-in-Ramada-Hotel-Abu-Dhabi-Corniche?src=RSS", "ord_in_thread": 0, "title": "First Branch of Mumbais Kareems Indian Cuisine Restaurant to open in Ramada Hotel Abu Dhabi Corniche", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Kareem's unique Indian cuisine restaurant has now opened its doors to the public in Ramada Hotel Abu Dhabi Corniche. Management team are delighted to bring a new quality luxury addition to serve the guests and visitors from the United Arab Emirates and worldwide, which serves the true taste of \nauthentic Indian dishes.\n\nFounded in 1995 in Mumbai, Kareem's is one of the most luxurious and prestigious Indian restaurants characterized by a wonderful mixture of original Indian meals and spices all prepared to be served in a pleasing atmosphere enhancing all taste buds. The restaurant Kareem's is owned by Chef Kareem Dhanani, who is known for a highly artistic Indian cooking skills in \"kebabs, curries and biryani\" most famous dishes that marked the beginning of Kareem's Restaurants business.\n\n\"Authentic dining affair, Kareem's is a place to enhance the food experience and savor your taste buds\" Mr. Manoj Sharma, the Strategist Partner of Kareem's comments, \"where the taste meets the flavor of original kebabs and biryanis.\" The curries are accurately blended with herbs and spices which gives the completeness of a perfect dining experience and great moments of truth.\n\nKareem's restaurant \"Ramada Hotel Abu Dhabi Corniche is the first branch of the group in the United Arab Emirates and the Gulf Cooperation Council (GCC), Mr. Mr. Mohammad Abdul Saleem, The Chairman of Gromaxx Hotel Management LLC said during the opening, \"We are pleased to welcome guests and distinguished visitors to experience Indian wonders at \"Kareem's\" and spend quality time with friends and family in an atmosphere full of Indian flavors and wonderful diversity of dishes that will satisfy the tastes of Indian cuisine lovers.\"\n\nHe added, \"We always provide all the services to ensure the convenience of guests and visitors both from within or outside the country, and we are delighted to add Kareem's restaurant to our portfolio, and we hope that attains everyone pleasure.\"\n\n\"Kareem's is a place to enhance the food experience and savour your taste buds. I personally feel it's authentic dining affair were taste meets the flavour of original Kebabs and Biryanis,\" he said.\n\nThe curries are accurately blended with herbs and spices which gives the real completeness of a perfect dining experience and great moments of truth. \n\nAbout Ramada Hotel Abu Dhabi Corniche \nRamada Hotel Abu Dhabi Corniche", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T23:31:59.360+03:00", "highlightTitle": ""}