{"organizations": [], "uuid": "d30410ab32bbeb118de5a622f1c9f3d55b51f823", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30088917/residence-inn-washington-dc-downtown-completes-extensive-suite-renovation", "country": "US", "title": "Residence Inn Washington, DC Downtown Completes Extensive Suite Renovation", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Residence Inn Washington, DC Downtown Completes Extensive Suite Renovation - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "d30410ab32bbeb118de5a622f1c9f3d55b51f823"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30088917/residence-inn-washington-dc-downtown-completes-extensive-suite-renovation", "ord_in_thread": 0, "title": "Residence Inn Washington, DC Downtown Completes Extensive Suite Renovation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Residence Inn Washington, DC Downtown\nHotel in D.C. gives suites an elegant touch with new carpet, wood flooring, furniture and beds\nWASHINGTON , Sept. 22, 2015 /PRNewswire/ -- Making travelers' stays even more chic, Residence Inn Washington, DC Downtown has recently completed a floor-to-ceiling renovation of its 202 guest suites.\nAfter finishing a full remodel of all public spaces in the fall 2014, the extended-stay hotel in Washington, D.C. embarked on an extensive renovation to areas where visitors spend a majority of their time: their rooms. Once filled with many patrician Old World elements, the Residence Inn has transitioned from a classic, traditional style to a fresh, contemporary vibe, incorporating pops of color and modern artwork.\nFind stylish new carpet in living and sleeping areas, while sophisticated wood flooring has been installed in each suite's kitchen and vanity space. Walls boast fresh paint and wallpaper, and new window coverings offer a touch of elegance to the decor. When it's time to relax, guests can kick back on new, contemporary couches and chairs that are modern and comfortable. New luxurious bedding adds a final touch to the redefined spaces, ensuring travelers have a cozy place to surrender to sweet dreams after a busy day in the city.\nOriginally built to be the first luxury apartments in D.C., the building the Downtown D.C. hotel now occupies was home to the affluent residents of The Portland Flats. While undergoing facade changes since those days, the building still embodies the unique elegance for which it has always been known.\nGuests looking to relax or stay productive outside of their suites can head down to the breakfast and seating room, aptly named Portland Flats. Elegant flooring, a grand stone fireplace boasting a flat-panel TV with sofas and chairs evoke a warm feeling. Highlighting the contemporary quarters are media pods that allow visitors to work at spacious tables and enjoy comfy couches and complimentary Wi-Fi while watching their favorite programming on mounted flat-panel TVs.\nThe extended-stay hotel in D.C. features a prime location for guests wishing to explore the city. Enjoy easy access to popular dining and shopping on Vermont Avenue, check out the exciting nightlife of 14 th Street, or experience the historical beauty of the U Street Neighborhood.\nAbout Residence Inn Washington, DC Downtown\nResidence Inn Washington, DC Downtown at 1199 Vermont Ave. in NW Washington, D.C. , is near the National Mall, Washington Convention Center and Logan Circle . The hotel boasts 12 floors, 202 suites and 3 meeting rooms featuring 1,175 square feet of flexible event space. A fitness center, complimentary high-speed Internet access and free breakfast are among other amenities available. For information, visit www.ResidenceInnDCVermontAve.com or call 1-202-898-1100.\nJoin Marriott Rewards now and earn points that can be redeemed for free hotel stays and room upgrades at 3,800 hotels in over 70 countries.\nLearn more about Residence Inn and Marriott International Inc.\nPRESS CONTACT\nAmanda Kempe\n1-240-380-0585\namanda.kempe@marriott.com\nPhoto - http://photos.prnewswire.com/prnh/20150921/268891\n releases/residence-inn-washington-dc-downtown-completes-extensive-suite-renovation-300146368.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CG07555&Transmission_Id=201509221121PR_NEWS_USPR_____CG07555&DateId=20150922", "https://photos.prnewswire.com/prnvar/20150921/268891", "http://www.marriott.com/rewards/rewards-program.mi", "http://www.marriott.com/corporateinfo/boilerplate.mi", "http://www.residenceinn.marriott.com/", "http://www.prnewswire.com/news-releases/residence-inn-washington-dc-downtown-completes-extensive-suite-renovation-300146368.html", "http://www.marriott.com/hotels/travel/wasdc-residence-inn-washington-dc-downtown/", "http://www.xmlnews.org/ns/", "http://www.marriott.com/hotels/hotel-rooms/wasdc-residence-inn-washington-dc-downtown/", "http://www.marriott.com/hotels/fact-sheet/travel/wasdc-residence-inn-washington-dc-downtown/", "http://photos.prnewswire.com/prnh/20150921/268891"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T19:32:06.874+03:00", "highlightTitle": ""}