{"organizations": [], "uuid": "05fa07feb452a689f57ee7cb3fd5455afa9b6330", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/09/29/16/2CE739CD00000578-0-image-a-87_1443539371268.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3253340/Fast-furious-Intrepid-traveller-breaks-records-visiting-whopping-22-American-states-24-HOURS-three-flights-actually-slowing-down.html", "country": "GB", "title": "Gunnar Garfors breaks records visiting 22 American states in less than 24 hours", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 2, "title_full": "Gunnar Garfors breaks records visiting 22 American states in less than 24 hours | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T00:18:00.000+03:00", "replies_count": 1, "uuid": "11904db4bd857152edcfce8e0df8d86175608aa8"}, "author": "Becky Pemberton For Mailonline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3253340/Fast-furious-Intrepid-traveller-breaks-records-visiting-whopping-22-American-states-24-HOURS-three-flights-actually-slowing-down.html#post-0", "ord_in_thread": 0, "title": "Gunnar Garfors breaks records visiting 22 American states in less than 24 hours", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1\nView\ncomments\nFor many planning to visit another state or country, it requires research and time; but a plucky explorer and his two friends smashed world records to become the first to visit a whopping 22 US states in just 24 hours.\nNorwegian adventurer, Gunnar Garfors, who previously managed to visit all 198 countries around the globe while maintaining a full-time job, started the incredible 24 hour challenge in Maine on September 20.\nGarfors, along with fellow travellers Tay-young Pak and Øystein Djupvik crossed the border of Illinois having hired three rental cars and three scheduled flights for their journey.\nScroll down for video\nState number one: The team started at 6.20am on September 20 in Maine, for their 24-hour challenge\nThe intrepid mission took them through 22 states from Maine to Illinois during a single day and night\nAdventurer Gunnar Garfors (centre), along with Tay-young Pak (left) and Øystein Djupvik (right) pictured in New Hampshire. A member of the public had bet $80 that the trio would only manage to visit two states in 24 hours\n'It was an exhilarating feeling, a total adrenalin kick!' Garfors told MailOnline Travel.\n'We were tired, but weary – yet incredibly happy! It took quite a lot of planning, and so many things could have gone wrong.'\nThe intrepid trio not only beat the previous record of 19 states in one day and night, but also beat their own target.\n'We had aimed for 20 states, so 22 was well within margin,' Garfors said.\n Next He ran out of countries! Meet the traveller who visited... Travellers break world record after visiting 19 European... Record breakers! Travellers make history by visiting FIVE... Most of the wheel-time was undertaken by Djupvik, but it was actually flights which caused the most problems for the speedy group.\n'We could have managed 23 had there been no flight delays, though,' he commented.\nTheir route took them from Maine to New Hampshire, Massachusetts, Connecticut, Rhode Island, Vermont, New York, Pennsylvania, New Jersey, Delaware, Maryland, Virginia, West Virginia, Alabama, North Carolina, Mississippi, Arkansas, Missouri, Kentucky – and finally ending in Illinois.\nmore videos 1 2 3 Watch video Some of the internet's funniest reactions to bad plane food\nWatch video Tourists offered chance to stroke lions in the dead of night\nWatch video Cunard's flagship Queen Mary 2 cruise liner gets huge refub\nWatch video Passengers use industrial-strength cling film to secure luggage\nWatch video Meet the man who's been on 16 stag dos... all with strangers\nWatch video 'Do you know who I am?': Driver loses it in road rage rant\nWatch video UK tourists skinny dip in one of Rome's historic fountains\nWatch video The Pope meets the Pope: Pontiff blesses baby dressed as him\nWatch video Wayne Rooney: The Man Behind The Goals trailer for BBC One\nWatch video Mom's hidden camera shows how dad really looks after the kids\nWatch video Miracle baby Jaxon Buell shows off his walking and talking\nWatch video But this is my JAM! Baby insists on turning up the tunes\nTheir third state of Massachussetts ruined the bet for the man. The friends said they had fun trying to pronounce the lake name on the sign pictured\nThe fourth stop was Connecticut where the group narrowly avoided being spat at by the llamas in the background\nThey next travelled to Rhode Island where they vowed to spend longer next time they visit\nIt took a few months to plan the record-breaking attempt with the team focusing on clusters of states that could be easily connected with scheduled planes.\n'We were in three states for literally a minute: Rhode Island, West Virginia and Kentucky,' Garfords said.\n'The others were visited for longer. We were longest in Massachusetts (a lot of road to cover), New York (delayed plane), Virginia (delayed flight) and Mississippi (a lot of road to cover).'\nDespite the long travel time, the trio decided to journey in style, with chef Tay-young Pak serving fresh lobster and oysters from the back seat.\nTaking advantage of Maine's delicious seafood, the adventurers managed to buy 15 giant lobsters for less than the equivalent of £4 a piece.\nOn a mission: A quick stop off in Vermont allowed the group time to go quickly to a church\nState number seven was New York where the trio encountered lumberjacks and quaint shops by the side of the road\nThe team next visited Pennsylvania in order to pick up a new car to continue with their speedy journey\nIn order to fund the record breaking trip, Norwegian betting company ComeOn set up bets on how many states the team could manage, and what would be their final destination.\nMembers of the public were able to bet on these numbers, which helped to motivate the group.\n'One guy put $80 on us managing only two states. He lost his cash rather early!' Garfors said.\nThe idea of the American trip came to the team following their success breaking the world record one year ago to visit 19 countries in 24 hours.\n'I suggested to do something in the US – and we soon came up with the concept of visiting the most states in 24 hours – jokingly calling it the world’s fastest book promotional trip. I left a book in most states we went through – finder’s keepers.' the Norwegian traveller said.\nSunshine state of mind: The weather was ideal and contrasting in the trio's ninth state of New Jersey\nState number 10 was Delaware pictured. The travellers kept their energy levels up by cooking in the back of their vehicles while on the road\nNext time? The team were sad that they didn't have time for crab cakes when they reached their 11th state, Maryland\nThe trio say they are now aiming to break one travel related world record a year.\nThey haven’t decided on next year’s mission, but are open to most ideas, particular if they are slightly manic and crazy.\n'Most adults have forgotten how to play, they are being serious to the extreme all the time,' Garfors said.\n'We aim to avoid going into that adult trap. Playing is underestimated and a great way to maintain a friendship too.\nWhat is also really heart-warming is that we get a lot of messages from people who say they are inspired by us when we engage in such trips, that following our dreams make them smile and see possibilities and that they find It refreshingly different that we not only talk about doing strange and borderline idiotic trips, but actually do them too – sometimes by stretching the limits.'\nmore videos 1 2 3 Watch video Some of the internet's funniest reactions to bad plane food\nWatch video Tourists offered chance to stroke lions in the dead of night\nWatch video Cunard's flagship Queen Mary 2 cruise liner gets huge refub\nWatch video Passengers use industrial-strength cling film to secure luggage\nWatch video Meet the man who's been on 16 stag dos... all with strangers\nWatch video 'Do you know who I am?': Driver loses it in road rage rant\nWatch video UK tourists skinny dip in one of Rome's historic fountains\nWatch video The Pope meets the Pope: Pontiff blesses baby dressed as him\nWatch video Wayne Rooney: The Man Behind The Goals trailer for BBC One\nWatch video Mom's hidden camera shows how dad really looks after the kids\nWatch video Miracle baby Jaxon Buell shows off his walking and talking\nWatch video But this is my JAM! Baby insists on turning up the tunes\nLearning a lesson: In Virginia, their 12th state, the travellers even had a bit of time to check out a local school. They also left a book in every state that they visited\nNext they managed to visit West Virginia, although they wished they could go whitewater rafting instead of just passing through\nState number 14 was North Carolina. Tadjik the taxi driver promised he could drive to South Carolina and back in a maximum of 35 minutes. And he did!\nAs night time descended the team were in South Carolina, but couldn't see much of the landscape in the dark\nIn Alabama, two out of their three American Airlines flights were delayed, but the trio had managed to visit 16 states at this point\nNearing the finish line: The friends took a selfie in Mississippi but were sad that there were no river boats to be seen\nClocks ticking: In their 18th state of Tennessee, the trio had time to stop for a jam in Memphis\nIn Arkansas they equalled the current record, 19 states in 24 hours, although no Clintons showed up to celebrate\nThe jubilant team celebrated having beaten the record, as they crossed the border of Missouri...but why stop there?\nState number 21 was Kentucky, which the team said deserved more than a U-turn, but would have to wait until they weren't on a time deadline to see more of the state\nFinish line! The triumphant team managed to reach Illinois after a manic 24 hours of travelling and were ecstatic to beat the record. They now plan to break one travel world record every year\nRead more: Globetrotting Galore by Gunnar Garfors: My Book \"198\" for Sale in English Too", "external_links": ["http://dailym.ai/1RdRV4b", "http://www.garfors.com/2015/07/english-version-of-198-finally-on-sale.html", "http://pubads.g.doubleclick.net/gampad/ads?sz="], "published": "2015-09-30T00:18:00.000+03:00", "crawled": "2015-09-29T21:38:01.368+03:00", "highlightTitle": ""}