{"organizations": [], "uuid": "8d0d085e974dda504132537ff34b6724cfb11a04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.newsminer.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/newsminer.com/content/tncms/assets/v3/editorial/3/e0/3e0e1ad9-6127-5fe0-8fb9-c37247dffe43/55ffb24b3585a.image.jpg", "site_section": "http://www.newsminer.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=online_features/travel*&f=rss", "section_title": "Fairbanks Daily News-Miner - online features/travel", "url": "http://www.newsminer.com/online_features/travel/voluntourism-how-to-travel-and-make-a-difference/article_9f896d21-0859-5dc4-9eb6-33a5f07b6ab3.html", "country": "US", "title": "Voluntourism 101: How to travel and make a difference", "performance_score": 0, "site": "newsminer.com", "participants_count": 1, "title_full": "Voluntourism 101: How to travel and make a difference", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T08:00:00.000+03:00", "replies_count": 0, "uuid": "8d0d085e974dda504132537ff34b6724cfb11a04"}, "author": "Brandpoint (BPT)", "url": "http://www.newsminer.com/online_features/travel/voluntourism-how-to-travel-and-make-a-difference/article_9f896d21-0859-5dc4-9eb6-33a5f07b6ab3.html", "ord_in_thread": 0, "title": "Voluntourism 101: How to travel and make a difference", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Voluntourism 101: How to travel and make a difference   Voluntourism 101: How to travel and make a difference   Have you ever wondered if there’s more to a vacation than amusement parks and beachside sunsets? Do you dream of immersing yourself in a culture, all while impacting the people as much as they impact you? If so, volunteering while vacationing — also known as voluntourism — is for you. \nWhat is voluntourism? \nVoluntourism is the act of traveling and spending time volunteering, typically for a local nonprofit or charity. You could volunteer for a single day or the duration of your vacation. Many people think voluntourism only happens while traveling abroad, but this is not always true. There are countless opportunities for traveling and volunteering within the United States as well as overseas. \nHow many travelers are participating in voluntourism? \nVoluntourism has existed for decades, but recently there has been a significant increase in participation. This increase can be partially attributed to millennials, a group who, as a whole, desire to get more out of their travel experiences than previous generations. According to a recent report from Reuters, there are an estimated 10 million volunteers a year who embark on philanthropic travel. \nWhat types of things do people do as voluntourists? \nHelp build a school in Peru. Visit an orphanage and teach children in Haiti. Travel to Hawaii and help with ocean preservation. Go to the Philippines to lend aid to the survivors of Typhoon Haiyan. Want to be inspired? Travelocity has long been a supporter of voluntourism and supports the cause through their Travel for Good campaign. The program is launching a nationwide search for three people who are looking to travel for a worthy cause and will fund the travels of these voluntourists. Visit www.travelocity.com/travelforgood for more information. \nTips for planning a voluntourism vacation: \n1. Think about what matters to you \nThe list of causes that you can support as part of your volunteer trip are almost endless. Take time to think about your passions and what matters most to you. According to Travelocity, the top five volunteer programs include medical/health (disaster volunteering ranks as No. 1), education, wildlife, conservation and orphanage. Knowing what cause is most meaningful to you is the best starting point. \n2. Brainstorm where you’d like to go \nThe most popular destination for voluntourism is the Philippines, but there are so many locations you can consider. Most causes are not isolated to one particular part of the world. Do you want to help fight hunger domestically or abroad? If you want to help save the rainforest, you could go to Africa, Central America or numerous other locations. Think about where you’d like to go to make an impact. You should consider other things you’d like to do beyond volunteering so you can find a location where you can do it all. \n3. Look into voluntourism assitance \nWhat if you could have some or all of your voluntourism expenses covered? There are a number of organizations that can assist with your travel expenses - for example, Volunteer Forever offers travel scholarships several times a year, while Travelocity’s Travel For Good program is selecting individuals who want to take a voluntourism trip via a social media based program. \n4. Adopt the right mindset \nSome people go on vacation to be served, while voluntourists go on vacation to serve. While volunteering, you may have experiences very different from your normal day-to-day life. Maintain a positive attitude, be flexible, and be willing to help and learn. Remember that traveling can make you a better person, and traveling for a cause is the ultimate way to make a positive difference to others.", "external_links": [], "published": "2015-09-21T08:00:00.000+03:00", "crawled": "2015-09-22T11:16:50.300+03:00", "highlightTitle": ""}