{"organizations": [], "uuid": "63f15ddd1355463467f7ff542844dffb96e2d9bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29939471/fourkites-offers-free-load-tracking-to-brokers", "country": "US", "title": "FourKites Offers Free Load Tracking to Brokers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "FourKites Offers Free Load Tracking to Brokers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "63f15ddd1355463467f7ff542844dffb96e2d9bc"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29939471/fourkites-offers-free-load-tracking-to-brokers", "ord_in_thread": 0, "title": "FourKites Offers Free Load Tracking to Brokers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FourKites, Inc.\nInitiative Eliminates Smartphone Tracking Costs for Up to 2,500 Loads a Month.\nCHICAGO , Sept. 2, 2015 /PRNewswire/ -- FourKites, Inc., the preferred provider of advanced freight tracking technology, today introduced FourKites CarrierLink, a free mobile app and tracking service for small to mid-size brokers.\nLogo - http://photos.prnewswire.com/prnh/20150901/263037LOGO\nSmall and medium sized freight brokers, those who manage about 400-2000 truck loads per month, spend anywhere from $1 to $5 per load for tracking, depending on their volume, while many large brokers have created their own apps for tracking to avoid this expense. This can take a sizable chunk out of a small broker's revenue. FourKites is offering their mobile tracking service for free to help small and medium broker-business owners compete in the market place. FourKites is the first company to offer this service for free and hopes the industry will evolve and allow more small freight brokers be successful.\nFourKites is the original, comprehensive cross-platform tracking service that aggregates data from major fleet technology providers like Omnitracs, PeopleNet, and 30 others powering the trucking industry. Delivering high-quality, high-frequency tracking updates, FourKites CarrierLink is absolutely free for brokers to track up to 2,500 truckloads a month. That's well over 100 loads per business day at no cost whatsoever. FourKites is committed to keeping this service free forever for any broker tracking 2,500 or fewer loads per month.\nFourKites notes that beyond 2,500 truckloads per month, per-load charges will apply and that FourKites' aggregated ELD data service is not included in the free CarrierLink initiative.\n\"We're offering a top-of-the-line and robust software program for free to encourage the greatest number of users to experience FourKites' innovative platform,\" CEO Matt Elenjickal said, \"Empowering small brokers with tracking and logistics tools normally only afforded by large firms is going to allow the entire industry to become more competitive.\"\nTo implement FourKites CarrierLink, a freight broker can sign up through the company's website at https://www.fourkites.com/brokers. FourKites will then notify drivers of the load assignment and start tracking every 15 minutes until the load is delivered.\nFor now, FourKites CarrierLink is available for Android smartphones only. An app for Apple iPhones is in the works.\nFourKites CarrierLink offers several operational benefits to freight brokers, including geo-fencing and automatic alerts that let brokers know critical updates, such as when a load is within five miles of a delivery point. This kind of real-time information enables a broker to better service a customer by, for example, allowing time to gather an unloading crew to meet the truck and shortening the carrier's wait time.\n\"If you're a broker paying anything at all for load tracking using a driver's smartphone, you're paying too much,\" said Mr. Elenjickal.\nAbout FourKites\nBased in Chicago , FourKites provides real-time supply chain visibility and logistics solutions across transportation modes and digital platforms. Using FourKites, the shipper, the broker, and the carrier can share the same, real-time truck location and shipment status information - from onboard systems in the largest commercial fleets to individual owner-operator smartphones. Bypassing check calls and EDI, FourKites saves time and money across the transportation spectrum. Best of all, nothing falls through the cracks. For more information, go to www.fourkites.com .\nPress Contact\nMatt Elenjickal, CEO\nsales@fourkites.com\n888-466-6958\n releases/fourkites-offers-free-load-tracking-to-brokers-300136554.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/fourkites-offers-free-load-tracking-to-brokers-300136554.html", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20150901/263037LOGO", "https://www.fourkites.com/brokers", "https://www.fourkites.com/", "https://www.fourkites.com/brokers.", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY92227&Transmission_Id=201509020400PR_NEWS_USPR_____NY92227&DateId=20150902"], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T12:43:11.570+03:00", "highlightTitle": ""}