{"organizations": [], "uuid": "c7a0a144e5cdf307e0f08770f187bda43c7681c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/corre-por-mi.jpe", "site_section": "http://www.ticotimes.net/categories/topics/restaurants", "section_title": "Dining and Nightlife Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/09/25/cancer-awareness-run-river-picnics-and-other-happenings-around-costa-rica", "country": "US", "title": "Cancer awareness run, river picnics, and other happenings around Costa Rica", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Cancer awareness run, river picnics, and other happenings around Costa Rica -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T16:59:00.000+03:00", "replies_count": 0, "uuid": "c7a0a144e5cdf307e0f08770f187bda43c7681c9"}, "author": "Amanda Zuniga", "url": "http://www.ticotimes.net/2015/09/25/cancer-awareness-run-river-picnics-and-other-happenings-around-costa-rica", "ord_in_thread": 0, "title": "Cancer awareness run, river picnics, and other happenings around Costa Rica", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Run: Awareness for Breast Cancer The run seeks to raise awareness about measures for the early detection of breast cancer. A 4 km – 8 km run, a 2 km walk, and a new addition this year, 25-40 m fun runs for children 1-11 years old, will all take place in and around La Sabana Park in San José, with the starting line in front of the Instituto Costarricense de Electricidad (ICE).\n“Corre por mí” takes place Sept. 27 at and around La Sabana Park, San José. Run ₡10,000 (the walk is free). 7:30 a.m. More info at the Corre por mí Website .\nWorld Rivers Day Picnics As part of the celebration of World Rivers Day, which this year will take place on Sept. 27, the group Río Urbano is organizing the first edition of “Picnic on the River Costa Rica” ( read our story here ). The campaign’s goal is to draw attention to rivers by reviving the tradition of picnicking along the banks.\n“Picnic en el río” takes place Sept. 27 at rivers around the country and abroad . Time and activities depend on each picnic. Free. More info at the Picnic en el Río Facebook page .\nInternational Book Fair Don’t miss the second and final weekend of Costa Rica’s 16th International Book Fair. The literary extravaganza, co-produced by the Costa Rican Chamber of Books and the Culture Ministry, features hundreds of exhibitors, lectures, and other activities (download the full program here , or read our guide ).\n“Feria Internacional del Libro en Costa Rica” takes place Sept. 18 – 27 at the Antigua Aduana in Barrio Aranjuez. Free. 9 a.m. – 8 p.m. More info at the Fair Website .\nArtisanal Market: “Tarde de Café y Sangría” Awesome restaurant fare for all tastes, assorted activities and surprises, and of course an artisans’ market: “El Mercadito Costa Rica” is a travelling showcase of all of the above. Shop, eat, browse – and if you’ve got a little one in tow, visit the Kids’ Corner (12-5 p.m.).\n“Tarde de Café y Sangría” takes place Oct. 1 at Hotel Intercontinental, Escazú. 11 a.m. – 7 p.m. Free. For more information call 2208-2100.\nTheater: “Human Nature” A play that combines audio-visual arts, original music, and photographs as five people seek to fulfill their desires and address their failures. Special guests include Christian Gómez (“Tapón”), Rikitiki & Bloke, model Stephanie Sánchez, and more.\n“Naturaleza Humana” will be performed Sept. 25-26 at 8 p.m., and Sept. 27 at 5 p.m. and 7 p.m. At La Casona Iluminada, Barrio Amón. ₡4,000-5,000 ($8-10).For more information call 8860-8270.\nFair: “Feria del Pejibaye” Visitors will be able to get more than 40 products based on the delectable palm fruit, from Creole food, baked goods, soups, ceviches and rompope, among others. Many activities will be held as well, including dance, exhibits, a crafts sale, concerts and cultural presentations, guided tours along the “Ruta del Pejibaye,” bullfights, mountain biking, and recreational athletics.\n“Feria del Pejibaye” takes place Sept. 25-Oct. 4 in Tucurrique, Cartago. Free. For more information call 8514-7527.\nMusic: Little Pianists The Instituto Superior de Artes and the National University will present their new generations of pianists: children between the ages of 6 and 11 will offer a concert to celebrate the talent and potential of Costa Rican kiddoes.\n“Niños Pianistas” will perform Sept. 30 at the National Theater, downtown San José. 12 m.d. ₡1,000-2,000 ($2-4). For more information call 2010-1111.\nTheater: “The Silent Flight of the Owl” The play tells the story of a middle aged couple with an unusual tradition: they always invite a homeless person to Christmas Eve dinner. Why? Each have their own reasons, which are secrets which could ruin their marriage. One year, the homeless person they chose will change everything and bring the truth to light.\n“El silencioso vuelo del búho” will be performed Sept. 24-Nov. 15 at Vargas Calvo Theater, downtown San José. Thu-Sat at 8 p.m. and Sun 5 p.m. ₡2,500 – 5,500 ($5-11). For more information call 2010-1116.\nDance: “No Nato” The group Los Innato presents their contemporary dance “No Nato,” which has been recognized by the prestigious L´Estruch – Fábrica de Creació De Les Arts En Viu, Sabadell, Spain, and has been presented around the world.\n“No Nato” will be performed Sept. 25-26 at Montes de Oca Theater, Edificio Saprissa, San Pedro. 8 p.m. ₡2,500-3,000 ($5-6). For more information call 2511-4595.\nUpcoming Concerts: Shimdra: The rock band will be covering 80’s and 90’s hits. Sept. 26 at Vyrus Bar, San Pedro. 9 p.m. ₡3,000 ($6). For more information call 8844-5000.\nThe Rock Theory Show: Rock bands No Bonus and Smokey Bars. Oct. 1 at El Observatorio, La California, San José. 8:30 p.m. ₡2,000 ($4). For more information call 2223-0725.\nReggae Night: Reggae concert with the music of DJ Kyo, DJ Lion Cub, and DJ Vybz. Before 10 p.m. women get in free. Sept. 25 at Bar Amón, Barrio Amón, San José. 9 p.m. ₡2,000 ($4). More information at Bar Amón Facebook page .\nChanson a Moi: Passiflora premier their new single “Chanson a Moi.” The group has played the song at a few shows, but has just recorded the studio version. Sept. 25 at El Steinvorth, San José. 9 p.m. ₡4,000 ($8). More information at El Steinvorth Facebook page .\nContact Amanda Zuniga at azuniga@ticotimes.net", "external_links": ["http://www.correpormi.com/", "https://www.google.com/maps/d/viewer?mid=zirFRztnkbxY.kMcaEArfVvl0", "https://www.facebook.com/PicnicEnElRioCR", "https://www.facebook.com/elsteinvorth", "http://www.feriadellibrocostarica.com/", "https://www.google.com/maps/d/viewer?mid=zirFRztnkbxY.kJSp193eevFQ", "http://www.feriadellibrocostarica.com/cronograma/Programa.pdf", "https://www.facebook.com/baramoncr"], "published": "2015-09-25T16:59:00.000+03:00", "crawled": "2015-09-26T21:35:21.176+03:00", "highlightTitle": ""}