{"organizations": [], "uuid": "8d8113b9326ab54679491fcb57d3c60202fc0354", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-09/online_ba6e9338-3954-41c0-8b8d-2a88a2e6c92d3726b55a31f56bda2e9a3f4595b1c113.jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094357021/As-Breast-Implant-Choices-Rise-Long-Island-Surgeon-Offers-Patients-Advice?src=RSS", "country": "US", "title": "As Breast Implant Choices Rise Long Island Surgeon Offers Patients Advice", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "As Breast Implant Choices Rise Long Island Surgeon Offers Patients Advice | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "8d8113b9326ab54679491fcb57d3c60202fc0354"}, "author": "Press", "url": "http://www.menafn.com/1094357021/As-Breast-Implant-Choices-Rise-Long-Island-Surgeon-Offers-Patients-Advice?src=RSS", "ord_in_thread": 0, "title": "As Breast Implant Choices Rise Long Island Surgeon Offers Patients Advice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) As Breast Implant Choices Rise Long Island Surgeon Offers Patients Advice Long Island plastic surgery specialist Dr. James Romanelli says experienced surgeons can help breast augmentation patients narrow down their options. \nTimeZone Converter TimeZone Converter PDF to JPEG Converter Online PR News – 27-September-2015 – Dr. James Romanelli (www.jrcs.com) says women at his Long Island plastic surgery practice have more choices than ever when it comes to breast implants as a range of newly FDA-approved styles arrives on the market.\n\"Having more breast implant options benefits a patient because I can better customize the procedure to complement her body type and aesthetic preferences\" Dr. Romanelli says. \"However some patients can get overwhelmed by the number of choices they have. That's why it's important to rely on the expertise of an experienced board-certified plastic surgeon who specializes in breast augmentation and all the options available.\"\nThe Long Island surgeon's experience with silicone gel implants dates back to 1990 when he trained with the implants' 2 inventors during a plastic surgery fellowship. His professional career includes being a clinical investigator for several FDA-approved studies on new silicone gel implants.\n\"I have learned a lot over my years working with different types of implants and I personally prefer using the cohesive silicone gel implants in most cases\" Dr. Romanelli says. \"The final decision is the patient's though and my job is to provide advice based on my expertise and her cosmetic goals.\"\nWith the number of options increasing that job is becoming even more critical. Dr. Romanelli says patients must decide on several different factors including the size material profile and texture of breast implants. He says some patients at his Long Island practice come in having done research and have preferences in mind but most patients are unaware of the huge range of options. For example even patients who know they want silicone gel implants have several options based on the manufacturer and the gel consistency.\nDr. Romanelli uses 3-D imaging to help patients choose a breast implant size and shape. The 3-D imaging device he says is an excellent tool to give patients an idea of how they might look with different options.\nImplants can be round or teardrop-shaped to resemble a natural breast. The choice is important because it can influence where Dr. Romanelli places the implants either above or below the chest muscle and has a significant impact on the final results. A guide on choosing between round or shaped implants published recently by the journal Plastic and Reconstructive Surgery says the choice should be based \"on a combination of patient desires anatomy and surgical history.\"\n\"That's very true\" Dr. Romanelli says. \"It's a combination of factors that leads to any good decision. That's why it's so important to talk through all the options with a surgeon and for patients to talk openly about their motivations and goals. Good communication and collaboration are key.\"\n###\nDr. James Romanelli (www.jrcs.com) is a board-certified plastic surgeon who specializes in body face and breast enhancement. After earning his medical degree from SUNY Downstate Dr. Romanelli undertook 8 years of postgraduate specialty training in general surgery plastic surgery and hand surgery. He serves as chief of staff at Huntington Hospital in addition to providing a full range of procedures through his cosmetic surgery practice on Long Island.", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T15:27:59.440+03:00", "highlightTitle": ""}