{"organizations": [], "uuid": "8572d6459efe9a9b266d222b1df816c72e3d153c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "http://globenewswire.com/Attachment/LogoDisplay/238748?filename=238748.jpg&amp;size=1", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/09/23/770483/10150401/en/Insight-Vacations-Introduces-the-Ultimate-Way-to-Travel-New-2016-2017-Luxury-Gold-Collection.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "Insight Vacations Introduces the Ultimate Way to Travel: New 2016-2017 Luxury Gold Collection", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Insight Vacations Introduces the Ultimate Way to Travel: New 2016-2017 Luxury Gold Collection", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T00:54:00.000+03:00", "replies_count": 0, "uuid": "8572d6459efe9a9b266d222b1df816c72e3d153c"}, "author": "", "url": "http://globenewswire.com/news-release/2015/09/23/770483/10150401/en/Insight-Vacations-Introduces-the-Ultimate-Way-to-Travel-New-2016-2017-Luxury-Gold-Collection.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "Insight Vacations Introduces the Ultimate Way to Travel: New 2016-2017 Luxury Gold Collection", "locations": ["South America", "USA", "Canada", "Hawaii", "Europe", "Bhutan", "Nepal", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Insight Vacations Introduces the Ultimate Way to Travel: New 2016-2017 Luxury Gold Collection ~ Featuring more than 30 itineraries in Europe, India, Bhutan, Nepal, USA, Hawaii, Canada and South America ~ September 23, 2015 17:54 ET | Source: Insight Vacations \nDELRAY BEACH, Fla., Sept. 23,   Insight Vacations ®, the leader in premium and luxury escorted journeys, is thrilled to announce its new Luxury Gold collection with its 2016-17 Europe launch. This all-new collection has more than 30 outstanding itineraries in Europe, India, Bhutan, Nepal, North America and South America and boasts an updated assortment of Insight's authentic Signature Experiences. Luxury Gold is the ultimate way to travel with guests staying at the finest hotels, carefully selected for their exceptional service and top locations. Each Luxury Gold European vacation showcases epicurean delights, including dining at Michelin-starred restaurants. Exclusive VIP experiences enable guests to go behind the scenes of the world's most iconic attractions, events and excursions. \nGuests journey in style, traveling on Wi-Fi equipped luxury motor coaches with limousine legroom while receiving unmatched personal service and attention from Insight Vacations' Traveling Concierges, true local experts in each of their destinations. A personal airport welcome and round-trip private transfer are also included, as well as luggage delivery and all restaurant, hotel and guide tips. In celebration of the Luxury Gold European launch, guests can take advantage of Insight Vacations' Early Payment Discount offer by saving up to 10% when they pay in full before December 17, 2015. \n\"Luxury Gold is the fulfillment of a dream, the bringing together of a 100-year legacy in luxury experiences,\" said John Boulding, Global CEO of Insight Vacations. \"It brings true attention to detail, exceptional service, outstanding quality and above all, superb value and it is these qualities that make Luxury Gold, like our sister luxury brands Uniworld Boutique River Cruises and Red Carnation Hotels , the best in the world.\" \nVIDEO: Watch Lisa Ray, Insight Vacations' Luxury Gold Ambassador as she experiences the new French Elegance Luxury Gold journey: www.insightvacations.com/us/special-offers/2016-luxury-gold \nThese eight new Luxury Gold European journeys showcase an unmatched collection of once-in-a-lifetime experiences. Four highlighted itineraries include: \nFrench Elegance with Monaco Extension \nThis 16-day Luxury Gold journey highlights Normandy, Brittany, Paris and the Loire Valley and can include the Monaco extension with a four-night stay the elegant Hôtel Hermitage in Monte Carlo. A Paris Signature Experience includes an opportunity to meet the choreographer at the Nouvelle Eve and then enjoy the best seats in the house for dinner and the famous cabaret show. While in Versailles, guests stay at the luxurious Trianon Palace Versailles, a Waldorf Astoria property. In Deauville, guests will enjoy a Signature Dining experience at the Michelin-starred Le Dauphin restaurant where chef Mathieu Le Guillois serves classic French cuisine and stay at the luxury seaside resort property, the Royal Barrière. They will also have an unforgettable Signature hotel stay at the Domaine de Beauvois, a 17th century château in the Loire Valley featuring gourmet dining and spa. \nUltimate Italy \nThis 13-day Luxury Gold itinerary showcases the iconic destinations of Rome, Capri, Perugia, Florence, Cinque Terre and Venice. In the ultimate VIP Signature Experience , guests enter the Sistine Chapel for a private tour with a Local Expert before it opens to the public. The fast-tracked entry into the Vatican Museums ensures maximum enjoyment of the priceless Papal art collection. On the island of Capri they will ride an open-top taxi to the 5-star luxury boutique Signature hotel , the Capri Palace and enjoy a Signature Dining lunch at Il Riccio - a Michelin-starred restaurant famous for its incredible food and stunning waterside setting. In Florence, guests enjoy an exclusive VIP visit to the Vasari Corridor, a passageway more than half a mile long between the Uffizi Gallery and the Pitti Palace. \nLuxurious London & Paris \nOn this nine-day Luxury Gold vacation guests will explore the capitals of Britain and France including four nights of a Signature hotel with the exceptional Red Carnation service at London's five-star Milestone Hotel, winner of the Best Hotel in the UK at the 2014 TripAdvisor Travelers' Choice Awards. As an exclusive Signature Experience , guests join the Yeomen Warders at the Tower of London after hours as they perform the Ceremony of the Keys. In Paris, they enjoy Signature Dining at a prized Michelin-starred restaurant, a dîner de célébration with wine and artisan cheese. Guests join a local culinary expert in Paris for a gourmet food-walk experience and sample different types of French delicacies through Montmartre. Spain & Portugal in Style \nThis 14-day Luxury Gold escorted journey reveals the beauty and local cultures of Barcelona, Valencia, Seville, Lisbon and Madrid. Guests receive VIP access to Barcelona's Liceu Opera House and enjoy a private reception at its club, Círculo del Liceo. On the next day, they have a Relaxed Start , enjoy a leisurely morning and later meet with a Local Expert in the Gothic Quarter with a visit to Gaudi's Sagrada Família. While exploring Granada, guests stay at a renowned Signature hotel , the exquisite Alhambra Palace. To complete their adventure, they savor a Signature Dining gastronomic dinner at the Michelin-starred restaurant, Álbora in Madrid. For more information, please visit us at www.insightvacations.com , and join the conversation using the hashtag #InsightMoments on Facebook and Twitter . For reservations, contact your favorite travel agent or call Insight Vacations at (888) 680-1241. \nAbout Insight Vacations \nFor more than 38 years, Insight Vacations ® has been designing the world's finest escorted travel itineraries. As the experts in Europe, Insight offers over 100 journeys across the continent, covering more of Europe than any other operator. Insight Vacations also offers the same legendary high standards and carefully curated itineraries in North America, South America, India, Bhutan, Nepal, Morocco, Egypt and Israel. Luxury Gold by Insight Vacations is an exclusive collection of unique journeys that elevate travel beyond the ordinary at every moment. Guests traveling with Luxury Gold stay at the finest hotels, dine on the epicurean regional cuisine at featured Michelin-starred restaurants and enjoy an unmatched collection of once-in-a-lifetime experiences and sightseeing. \nAll Insight itineraries are expertly designed for smaller groups with a maximum of just 40 guests. Each tour includes the services of an experienced Tour Director who acts as \"traveling concierge,\" and Signature Experiences that provide a unique and revealing look into the history and culture of each destination. The authentic flavors of each country are celebrated through included Signature Dining experiences, Insight hotels are handpicked for their high quality and desirable central or scenic locations and the Insight motorcoach is specially customized to provide Business Class legroom. With the perfect balance of guided and independent exploration Insight has reimagined vacations to truly escape from the ordinary. \nAbout The TreadRight Foundation Created as a joint initiative between The Travel Corporation 's family of brands, The TreadRight Foundation is a not-for-profit that works to help ensure the environment and communities we visit remain vibrant and preserved for generations to come. To date, TreadRight has supported more than 35 sustainable tourism projects worldwide. The foundation's guiding principle is to encourage sustainable tourism development through conservation, leadership and support for communities. TreadRight's past project partners include WWF, Conservation International and The National Trust in the UK. Current initiatives include sponsoring the National Geographic Society's inaugural \"World Legacy Awards,\" helping to combat wildlife crime with WildAid, and empowering individuals with the Alliance for Artisan Enterprise. To learn more about our past and current work at TreadRight, please visit us at TreadRight.org . ### Susan Chou Public Relations Coordinator Susan.Chou(at)TravCorpUSA.com Arnelle Kendall Vice President of Public Relations Arnelle.Kendall(at)TravCorpUSA.com The Travel Corporation USA Public Relations Coordinator 636 East Atlantic Avenue Suite 203 Delray Beach, FL 33483 561.330.0850 Related Articles", "external_links": [], "published": "2015-09-24T00:54:00.000+03:00", "crawled": "2015-09-24T02:01:06.930+03:00", "highlightTitle": ""}