{"organizations": [], "uuid": "663a6178d3c9b3c8a0f0658b66928a6331d6beed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150920PopeFidelCastro.jpg", "site_section": "http://www.ticotimes.net/categories/topics/global", "section_title": "Global Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/09/20/pope-francis-meets-the-castros-after-mass-on-iconic-havana-square", "country": "US", "title": "Pope Francis meets the Castros after mass on iconic Havana square", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Pope Francis meets the Castros after mass on iconic Havana square -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T13:55:00.000+03:00", "replies_count": 0, "uuid": "663a6178d3c9b3c8a0f0658b66928a6331d6beed"}, "author": "Jean-Louis de la Vaissiere | AFP", "url": "http://www.ticotimes.net/2015/09/20/pope-francis-meets-the-castros-after-mass-on-iconic-havana-square", "ord_in_thread": 0, "title": "Pope Francis meets the Castros after mass on iconic Havana square", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HAVANA, Cuba – Pope Francis met Sunday with Fidel and Raúl Castro, the brothers who have ruled Cuba since its 1959 revolution, after celebrating an outdoor mass attended by hundreds of thousands.\nIn what is sure to become an emblematic moment of his tour of Cuba and the United States — the Cold War enemies whose reconciliation he helped bring about — the pope chatted with former leader Fidel Castro at his home in Havana, then held a closed-door meeting with current president Raúl at government headquarters.\nVatican spokesman Federico Lombardi said Pope Francis had a “very informal and friendly” conversation with 89-year-old Fidel that touched on various topics, including the environment.\nPope Francis, 78, gave the former Cuban leader four books, including two on theology.\nCastro reciprocated with a copy of Brazilian priest Frei Betto’s book of interviews with him, “Fidel and Religion,” which he signed, “With admiration and respect from the Cuban people.”\nVideo of the meeting aired on Cuban state TV showed the men sitting and chatting, the visibly voluble Castro clad in a tracksuit — his trademark in retirement.\nAfter years of hostility between the Church and Castro’s communist regime — which was officially atheist for more than three decades — relations began to slowly improve in the 1980s, culminating in a historic visit to Cuba by pope John Paul II in 1998.\nFrancis, who arrived Saturday, is now the third pope to visit the island, after his predecessor Benedict XVI traveled there in 2012 — a remarkable amount of papal attention for a country where only 10 percent of the population describe themselves as Catholic.\nThe pope later met with Castro’s brother, President Raúl Castro, 84, who took power when Fidel stepped down amid a health crisis in 2006.\nBefore the meetings, the pope gave a homily on Havana’s Revolution Square calling on Cubans to serve the downtrodden and warning them that “service is never ideological,” in what appeared to be a veiled critique of the communist regime.\n“Christians are constantly called to set aside their own wishes and desires, their pursuit of power, and to look instead to those who are most vulnerable,” he told the crowd, speaking beneath a towering sculpture of his fellow Argentine Che Guevara’s iconic silhouette.\n“We need to be careful not to be tempted by another kind of service, a ‘service’ which is ‘self-serving.'”\nPope Francis stands next to a mosaic during a meeting with Cuban President Raúl Castro at Revolution Palace in Havana, on Sept. 20, 2015.\nAFP/Pool/Alejandro Ernesto\nDissidents arrested Three Cuban dissidents were arrested as they approached the pope shouting “Freedom!” when he arrived for the mass.\nAn AFP photographer said the activists — two men and a woman — yelled anti-government slogans and resisted arrest as plainclothes agents detained them when they tried to get near the popemobile.\nThe pontiff, who was busy grasping the outstretched hands of well-wishers on the other side of his vehicle, did not appear to notice.\nThe protesters were from the Cuban Patriotic Union and “went to the square to condemn repression,” said Jose Daniel Ferrer, the leader of the dissident group.\nCuba bans opposition groups and routinely arrests dissidents who try to protest — typically releasing them after a few hours, at least in recent years.\nSeveral leading dissidents have criticized the pope for not accepting their requests to meet him during his visit.\nThe mood was otherwise jubilant on the packed square, where excited Cubans and foreign visitors camped out overnight to see the first Latin American pope.\n“We’ve been here since 2 am, but it wasn’t hard at all. We are so very happy to welcome the pope to Cuba,” said 43-year-old Yaniurka Hernández.\nOff script The pope later presided over evening prayers at Havana Cathedral, abandoning his prepared speech to urge hundreds of local priests, nuns and seminarians to embrace poverty.\n“Wealth makes us poor,” he told them sternly, warning they risked “ending up mediocre” if they forget “the smallest, the most abandoned, the sickest” to focus on budgets or management principles.\nHe then addressed a throng of young Cubans gathered outside in a light drizzle, turning down an umbrella and urging his audience — a demographic feeling the pain of the island’s difficult economic transition — not to give up hope.\n“Don’t forget to dream,” he told them.\nThe pope will travel Monday and Tuesday to the Cuban cities of Holguín and Santiago, before heading off to give landmark addresses to the U.S. Congress and U.N. General Assembly.", "external_links": [], "published": "2015-09-21T13:55:00.000+03:00", "crawled": "2015-09-21T15:15:41.923+03:00", "highlightTitle": ""}