{"organizations": [], "uuid": "025cf6cefdb80f8e0bd5d6b65e3cc2e782bc1918", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64012/airline-stops-hero-service-dog-boarding-plane", "country": "US", "title": "Airline stops hero service dog from boarding plane", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Airline stops hero service dog from boarding plane", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T00:47:00.000+03:00", "replies_count": 0, "uuid": "025cf6cefdb80f8e0bd5d6b65e3cc2e782bc1918"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64012/airline-stops-hero-service-dog-boarding-plane", "ord_in_thread": 0, "title": "Airline stops hero service dog from boarding plane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airline stops hero service dog from boarding plane Original, timely global, travel, tourism, business news and research: \nSep 21, 2015 Marines Captain Jason Haag and Axel eTN Exclusive: Unique and original, timely, global breaking news: \nLOS ANGELES, CA - Axel, a heroic service dog that saved the life of one of our nation's brave warriors and had just been named Service Dog of the Year at the American Humane Association Hero Dog Awards during a star-studded, nationally televised gala at the Beverly Hilton, was denied permission to accompany Captain Jason Haag as they were about to board the airplane for home. \nFive years ago, now-retired Marines Captain Jason Haag from Fredericksburg, Virginia, was diagnosed with post-traumatic stress and traumatic brain injury after returning from two combat tours in the Middle East. When he finally made it home, he was in a constant state of severe depression and mental agony. He struggled with alcohol abuse and took more than 30 medications to deal with his debilitating symptoms. In 2012, his wife urged him to reach out to K9s for Warriors, an organization that provides veterans with service canines, which is how he met who he calls his \"lifesaver,\" a German shepherd named Axel. On deployment, every soldier is paired up with a battle buddy, and these days his battle buddy is not another Marine, but Axel. Day in and day out, Axel is by his side, ensuring that he is in a constant state of peace and not fear. Sometimes all it takes is a little nudge from Axel to remind him that he is out of the combat zone. Other times, Axel goes into full activation mode, using his training to remove Captain Haag from an environment when a severe panic attack has begun. When he met Axel, the dog was one week away from being put down, sleeping on a shelter floor while Captain Haag was sleeping in his basement with a gun under his pillow. Now he shares a bed with his \"big, furry security blanket.\" \nFor this lifesaving work, Axel was named the winner in the Service Dog category at the 2015 American Humane Association Hero Dog Awards on Saturday night. \nAxel was denied entry on the American Airlines flight despite following the air carrier's own requirements, which state that to show that an animal is a service animal, you must provide at least one of the following: \n• Animal ID card • Written documentation to verify the service, psychiatric or emotional support status of your animal • Credible verbal assurance \nAxel had a harness and vest clearly identifying him as a service dog, and the airline was given credible verbal assurance at the time a boarding pass was issued. At the time of boarding however, an American Airlines representative began to ask additional questions, including questions about his disability and demanding additional documentation. An airline representative later stated to American Humane Association's legal counsel that Capt. Haag needed to have a medical alert card, which is not in fact a requirement. Wake-up Call to All Airlines \nAmerican Airlines issued an apology today, and American Humane Association is calling on them and all airlines to better train their staff to meet the needs of our nation's brave veterans and others who require the help of a service animal. American Humane Association supports both our two-legged and four-legged veterans and believes we must all stand up for all those who serve our country and help and defend those in need. There should be no room and zero tolerance for discrimination against these heroes. \n\"Service animals are absolutely essential to so many people who struggle with emotional and physical challenges,\" said Dr. Robin Ganzert, president and CEO of American Humane Association. \"While airlines certainly have the right to maintain appropriate protocols, these should not and cannot prevent life-enhancing and life-saving service animals from accompanying the people who so greatly need them. In this case, the airline did not even follow its own guidelines. We call upon the company to reimburse the costs endured by Captain Haag in the course of this regrettable action, and on all airlines to better train their staff.\" \nThe American public can see for themselves the remarkable value service animals – and others – bring to our lives when the American Humane Association Hero Dog Awards are broadcast nationwide by Hallmark Channel on October 30 at 8 pm ET/PT, 7 pm Central. Axel's story will be included, which won him the title of hero dog following more than one million votes by the American public and the support of the nation's leading animal lovers and experts.", "external_links": [], "published": "2015-09-22T00:47:00.000+03:00", "crawled": "2015-09-22T07:24:39.860+03:00", "highlightTitle": ""}