{"organizations": [], "uuid": "dc9f0ec5993a1e25acf498a161aadd12b9eb4777", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29990970/graebel-van-lines-introduces-optim-workspace", "country": "US", "title": "Graebel Van Lines™ Introduces Optim Workspace™", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Graebel Van Lines™ Introduces Optim Workspace™ - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "dc9f0ec5993a1e25acf498a161aadd12b9eb4777"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29990970/graebel-van-lines-introduces-optim-workspace", "ord_in_thread": 0, "title": "Graebel Van Lines™ Introduces Optim Workspace™", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Graebel Van Lines\nWorkspace Services Brand Helps Companies Strategically Plan Successful Moves\nDALLAS , Sept. 9, Graebel Van Lines announced today the introduction of Optim Workspace ™, the new name of its workspace services brand. Optim Workspace provides companies with workspace program management and comprehensive services for office moving, installation and storage. Headquartered in Dallas , Graebel Van Lines is the nation's largest, wholly-owned leading national mobility network, known domestically and abroad for consumer and corporate moving, as well as workspace services across the country.\n\"We are excited to launch Optim Workspace as a standalone brand in the market,\" said Graebel Van Lines President and CEO Terry Carter . \"Graebel Van Lines has strategically grown its workspace services business, building its success as a significant portion of our business that can now stand on its own; we are confident that our team's quality work will continue to increase the Optim Workspace footprint in this marketplace.\"\nOptim Workspace offers a comprehensive list of solutions, including:\nMoves/Add/Changes of Cubicle Systems Disconnect-Reconnect Services Strategic Space Planning Management Tools for Inventory Control Computer Aided Design Asset Management Moving and Warehousing Real-Time Reporting \"Graebel Van Lines is a strategic partner with a professional planning team and expertise in our industry that has helped us with content and computer moving, equipment supply and rental, as well as fixtures, furniture and equipment support, and kept us moving with smooth transitions and continued productivity,\" said The Seattle Times Facility Operations Manager Jon Ellis . \"Bringing their business to the forefront under its own brand as Optim Workspace signifies the importance of their work and the nation's companies that they support.\"\nABOUT GRAEBEL VAN LINES\nGraebel Van Lines is a leader in moving and workspace solutions, serving the corporate, residential, workspace and international market segments. For 65 years, the company has built its reputation by offering the highest quality end-to-end customer experience for moves across the United States and internationally. Optim Workspace is a subsidiary of Graebel Van Lines offering expertise in workspace moves, customized storage, installation, warehousing and inventory services for all types of businesses. Graebel Van Lines is committed to exceptional customer service for its consumer, corporate and workspace clients provided through best practices, processes and technology by experienced employees across the country.\nLogo - http://photos.prnewswire.com/prnh/20150908/264538LOGO\n releases/graebel-van-lines-introduces-optim-workspace-300139870.html\n ", "external_links": ["http://www.graebelmoving.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL96389&Transmission_Id=201509091200PR_NEWS_USPR_____CL96389&DateId=20150909", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/graebel-van-lines-introduces-optim-workspace-300139870.html", "https://photos.prnewswire.com/prnvar/20150908/264538LOGO", "http://photos.prnewswire.com/prnh/20150908/264538LOGO"], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T20:01:27.460+03:00", "highlightTitle": ""}