{"organizations": [], "uuid": "a87711376bdb6fdba8ea9c518d5c2018b7f5e600", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30105834/lojack-cto-emad-isaac-to-participate-in-connected-car-panel", "country": "US", "title": "LoJack CTO Emad Isaac to Participate in Connected Car Panel", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "LoJack CTO Emad Isaac to Participate in Connected Car Panel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "a87711376bdb6fdba8ea9c518d5c2018b7f5e600"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30105834/lojack-cto-emad-isaac-to-participate-in-connected-car-panel", "ord_in_thread": 0, "title": "LoJack CTO Emad Isaac to Participate in Connected Car Panel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " LoJack Corporation\nAs One of the Original IoT companies, LoJack and Isaac Join Connected Car Experts from AT&T, General Motors and Jasper to Illustrate the Challenges and Opportunities of our Connected Life\nCANTON, Mass. , Sept. 24, LoJack Corporation (NASDAQ: LOJN), a leader in vehicle theft recovery and advanced fleet management solutions, today announced that Senior Vice President and Chief Technology Officer, Emad Isaac , will participate in Jasper's \" Driving to the Future: The Connected Car Panel ,\" taking place September 24 at The Terra Gallery in San Francisco, California . With more than 20 years' experience working with innovative telematics, electronics and navigation technologies, Isaac will join experts from AT&T, General Motors and ChargePoint to discuss the challenges and opportunities in the current connected car landscape and the future of a growing, connected ecosystem.\n\"LoJack is arguably one of the original 'Internet of Things' companies and we're really excited to participate in this panel to discuss the evolution of the connected car landscape,\" said Isaac. \"As we delve deeper into a more connected world, companies bringing products to market are becoming increasingly aware of the level of security required to be successful in the space. Personal vehicles are high value items that hold our most critical information. As long as there is a lock, there will be lock picks and we, as an industry, need to have a plan. This panel will help to provide situational awareness, address security and privacy strategies and explore go-to-market business plans for an industry that is driven by technology and information sharing.\"\nLoJack owns and operates its own secure network that helps law enforcement find and recover stolen vehicles and valuable assets. Since joining LoJack in 2013, Isaac has worked to advance the company's technology and product strategy. By partnering with global technology brands, Isaac has directed the company's expansion into new markets through the development of innovative telematics and network technology products.\nThe panel will be moderated and hosted by Macario Namie , Vice President of Strategy at Jasper. Executives from participating organizations will discuss the broad IoT ecosystem, how the connected car fits into that space, and will explore important and timely issues, including the latest technology advancements and adoption, as well as security and privacy.\nTo attend the Connected Car Panel, please register here .\nFor more information, visit www.lojack.com , www.autotheftblog.com , www.lojack.com/fleet , www.twitter.com/LoJackCorp or www.Facebook.com/LoJackCorp .\nAbout LoJack Corporation\nLoJack Corporation, the company that has helped more than nine million people protect their vehicles in the event of theft over the past 25+ years, today provides safety, security and protection for an ever-growing range of valuable assets and people. Leveraging its core strengths, including its well-known brand, direct integration with law enforcement and dealer distribution network, LoJack Corporation is expanding our business to include our traditional vehicle and equipment theft recovery, people at risk and new telematics based products and services. LoJack is delivering new telematics-based solutions for on-road and off-road fleet management, as well as, dealer inventory management. By expanding our brand beyond stolen vehicle recovery, LoJack Corporation is committed to creating a new level of value for its dealer, licensee, customer and investor communities by delivering innovative offerings and multiple technologies in expanding geographies.\nMEDIA CONTACT:\nMelissa Latham\nMatter Communications\n978-518-4523\nlojack@matternow.com\n©2015 LoJack Corporation. All rights reserved. LoJack and the LoJack logo are trademarks or registered trademarks of LoJack Corporation in the United States and other countries.\nLogo- http://photos.prnewswire.com/prnh/20080512/NEM054LOGO\n releases/lojack-cto-emad-isaac-to-participate-in-connected-car-panel-300148328.html\n ", "external_links": ["http://www.facebook.com/LoJackCorp", "http://www.xmlnews.org/ns/", "http://www.lojack.com/fleet", "http://photos.prnewswire.com/prnh/20080512/NEM054LOGO", "http://www.lojack.com/", "http://www.twitter.com/LoJackCorp", "http://www.prnewswire.com/news-releases/lojack-cto-emad-isaac-to-participate-in-connected-car-panel-300148328.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY10510&Transmission_Id=201509240830PR_NEWS_USPR_____NY10510&DateId=20150924", "http://www.autotheftblog.com/", "http://pages.jasper.com/Connected-Car-Panel-in-SF.html", "http://photos.prnewswire.com/prnvar/20080512/NEM054LOGO"], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T18:20:36.261+03:00", "highlightTitle": ""}