{"organizations": ["Boeing", "Boeing Everett Factory", "All Nippon Airways", "Disney"], "uuid": "9023db60ea6961b05d21d5fa474991532222b9d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150914161740-09-ana-star-wars-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_travel", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/09/14/travel/ana-star-wars-planes-september-2015/index.html?eref=rss_travel", "country": "US", "title": "R2-D2 jet: First of 3 ANA 'Star Wars' planes unveiled", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "R2-D2 jet: First of 3 ANA 'Star Wars' planes unveiled", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T18:18:00.000+03:00", "replies_count": 0, "uuid": "9023db60ea6961b05d21d5fa474991532222b9d6"}, "author": "", "url": "http://edition.cnn.com/2015/09/14/travel/ana-star-wars-planes-september-2015/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "R2-D2 jet: First of 3 ANA 'Star Wars' planes unveiled", "locations": ["North America", "U.S.", "Seattle", "Tokyo", "Indonesia", "Vancouver", "Australia", "Europe", "China", "Japan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Anakin", "Luke Skywalker"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> R2-D2 jet: First of 3 ANA 'Star Wars' planes unveiled Updated 1004 GMT (1704 HKT) September 15, 2015 10 photos: ANA reveals new 'Star Wars' planes First ever \"Star Wars\" plane unveiled – Fans have been eagerly awaiting the arrival of Japanese carrier All Nippon Airways' new set of \"Star Wars\"-themed planes since designs were released earlier this year. The first of the series was rolled out on Saturday. Hide Caption 1 of 10 10 photos: ANA reveals new 'Star Wars' planes The R2-D2 ANA Jet – The first of the trilogy to hit the tarmac is the R2-D2 ANA Jet, a 215-seater Boeing 787-9 Dreamliner. It'll go into service on October 18, flying between Tokyo and Vancouver. Hide Caption 2 of 10 10 photos: ANA reveals new 'Star Wars' planes December premiere – The fleet of themed planes has been launched as a tie-in with the December premiere of \"Star Wars: The Force Awakens.\" Hide Caption 3 of 10 10 photos: ANA reveals new 'Star Wars' planes Passengers will be able to watch all six of the previous \"Star Wars\" movies from their seats. Hide Caption 4 of 10 10 photos: ANA reveals new 'Star Wars' planes In-flight entertainment – Passengers will be able to watch all six earlier episodes of the movie franchise from their seats -- the first time the films have been shown as in-flight entertainment. Hide Caption 5 of 10 10 photos: ANA reveals new 'Star Wars' planes Droids on board – The R2-D2 theme is carried through inside and out, with decorated headrests, paper napkins and cups. Hide Caption 6 of 10 10 photos: ANA reveals new 'Star Wars' planes \"Star Wars\" souvenirs? – The paper napkins and cups will no doubt be popular souvenirs with passengers. Hide Caption 7 of 10 10 photos: ANA reveals new 'Star Wars' planes The full fleet – This artist's impression was released earlier this year. The next plane to go into service will be a Boeing 767-300 inspired by BB-8, a new character from \"Star Wars: The Force Awakens.\" Hide Caption 8 of 10 10 photos: ANA reveals new 'Star Wars' planes Final part of the trilogy – The third plane will be another R2-D2-themed Boeing, this time a 777-300ER, which will go into service in March 2016 between Japan and North America. Hide Caption 9 of 10 10 photos: ANA reveals new 'Star Wars' planes Routes – It might not be the Millennium Falcon, but it could be the next best thing. Exact routes of all three planes have yet to be confirmed, but fans can follow the schedule at ana-sw.com . Hide Caption 10 of 10 (CNN) These may not be the droids the Stormtroopers are looking for, but for \"Star Wars\" fans this is definitely the Dreamliner. ANA, Japan's largest airline, rolled out the hotly anticipated R2-D2 ANA jet on Saturday -- the first of three \"Stars Wars\"-themed vessels to go into service on international routes this fall. The Boeing 787-9 Dreamliner's livery and in-flight decorations are inspired by the robust droid R2-D2, who served Anakin and Luke Skywalker in the movie franchise, and will now serve earthlings flying between Tokyo and Vancouver. In-flight entertainment The 215-seater jet was showcased at the Boeing Everett Factory near Seattle, and is scheduled to take to the skies on October 18. ANA's partnership with Disney is part of efforts to build buzz for the release of \"Star Wars: The Force Awakens\" later this year. Passengers will be able to watch all six of the previous \"Star Wars\" movies from their seats -- the first time any of the films have been shown as in-flight entertainment. After its initial stint on the Tokyo-Vancouver route, the R2-D2 Jet will fly between Japan and cities in the U.S., Europe, Australia, China and Indonesia. Next unveiling will be November The next plane to be rolled out will be a Boeing 767-300 with livery inspired by BB-8, a brand new character from \"Star Wars: The Force Awakens,\" which will fly domestic Japanese routes from November onwards. March 2016 will see the unveiling of another R2-D2 plane, this time a Boeing 777-300 ER, which will fly international routes between Japan and North America. Exact routes have yet to be announced, but fans will be able to see the planes' schedules at ana-sw.com . More from CNN Travel", "external_links": [], "published": "2015-09-21T18:18:00.000+03:00", "crawled": "2015-09-21T19:20:10.184+03:00", "highlightTitle": ""}