{"organizations": [], "uuid": "449d2e7b23ff1cc95bd5569243c5df11126bcf79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30001529/marriott-international-creates-two-epic-super-bowl-50-fan-experiences", "country": "US", "title": "Marriott International Creates Two Epic Super Bowl 50 Fan Experiences", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Marriott International Creates Two Epic Super Bowl 50 Fan Experiences - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "449d2e7b23ff1cc95bd5569243c5df11126bcf79"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30001529/marriott-international-creates-two-epic-super-bowl-50-fan-experiences", "ord_in_thread": 0, "title": "Marriott International Creates Two Epic Super Bowl 50 Fan Experiences", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Marriott International, Inc.\nCourtyard \"Suite Stadium Contest\" - First Ever Super Bowl Stadium Sleepover\nMarriott Rewards \"50 to 50\" - Taking 50 Friends to Super Bowl 50\nBETHESDA, Md. , Sept. 10, In anticipation of one of the biggest events in the history of the NFL, Marriott International is changing the game for lucky fans with an epic season long Super Bowl 50 campaign. Courtyard, the Official Hotel of the NFL for the past four years, is adding to its tradition of unique NFL experiences by hosting the world's first Super Bowl \"Suite Stadium Contest\" sleepover in Levi's Stadium. Marriott Rewards, the company's award-winning loyalty program, launches its \"50 to 50\" campaign that includes a sweepstakes which gives members in three countries a once-in-a-lifetime chance to take a group of 50 of their friends and family to attend the game and enjoy an exclusive VIP Super Bowl 50 weekend in the San Francisco Bay area.\n\"The NFL is the powerhouse of professional sports, and our long-standing sponsorship gives us an opportunity to tap into a passionate group of travelers, bringing the breadth and depth of our brand offerings to fans,\" said Karin Timpone , Global Marketing Officer, Marriott International . \"Similar to our relationships with global leaders in the music and entertainment industry, our NFL sponsorship represents the company's ongoing effort to bring exclusive and memorable experiences for our guests and the 52 million members of our Marriott Rewards program.\"\n\"Marriott provides unique and interactive experiences that have resonated with football fans across the country,\" said Renie Anderson , senior vice president of sponsorship, NFL. \"We are pleased to work with Marriott to reach our fans in authentic and innovative ways, especially leading up to Super Bowl 50.\"\nMarriott Rewards 50 to 50:\nMarriott Rewards is making it possible for the winner to take a group of 50 friends and family to Super Bowl 50 in the San Francisco Bay area with its 50 to 50 sweepstakes on Facebook ( https://www.Marriott50to50.com ). The trip includes flights, hotel, tickets to the game and an unforgettable VIP weekend experience at the biggest game of the year. Members can enter today for a chance to win through November 30 , and non-members will be able to sign up instantly for Marriott Rewards which is free to join. Visit the Marriott Rewards Facebook page for info and follow the conversation with #50to50. The sweeps is available to residents of the United States , Canada (excluding Quebec ) and the United Kingdom\nAs a part of Marriott International's worldwide sponsorship with the NFL, Marriott Rewards will participate in the League's International Series \"NFL on Regent Street\" Fan Fest event on October 24 in London , providing an interactive Football Challenge, surprise visits from special VIP guests and chances to enter the 50 to 50 sweepstakes . To extend the exclusive experience, a few lucky Marriott Rewards members will also be invited to watch the Jacksonville Jaguars and Buffalo Bills square off at Wembley Stadium from a private suite on October 25 .\nCourtyard by Marriott\nCourtyard offers Super Bowl \"Suite Stadium Contest\" an unforgettable overnight stay at Levi's Stadium the night before Super Bowl 50 in a suite transformed into a Courtyard guest room. Following the slumber party of the century, the winner and three guests will continue to party as they cheer during the epic Super Bowl 50 game. The contest is now open and the winner will be determined through a series of social media challenges before closing in November. The prize also includes flights and tickets to the game. Visit Courtyard.com or follow the conversation with #SuiteSB50Contest.\nCourtyard will also build momentum with a season-long \" Journey to Super Bowl 50 \" road trip that travels through NFL markets across the country before reaching its big, final stop in San Francisco . Each stop brings a fun-filled fan fest complete with NFL-themed games, NFL legend appearances, samples from the brand's Bistro and special connections to brand contests and Marriott Rewards gifts. Fans can track the journey with #CourtyardNFL or Courtyard.com/NFL .\nCourtyard launches its newest NFL television campaign starring NFL anchor Rich Eisen . In the spots, the brand invites Eisen to test their latest NFL-themed hotel innovations that go to humorous, overzealous extremes to please their guests. The spots will air throughout the season and can be viewed at the Courtyard YouTube page.\nCourtyard's original comedic webisode series, \"Courtyard Camera,™ features actor Ben Schwartz (\"House of Lies\" \"Parks and Recreation\") as host, teaming up with NFL stars throughout the 2015-2016 NFL season as they surprise unsuspecting hotel guests with humorous scenarios. NFL stars DeMarco Murray and Jared Allen star in the season's initial episodes, which can all be viewed at Courtyard's YouTube page.\nMarriott International, Inc . (NASDAQ: MAR) is a global leading lodging company based in Bethesda, Maryland , USA, with more than 4,300 properties in 81 countries and territories. Marriott International reported revenues of nearly $14 billion in fiscal year 2014. The company operates and franchises hotels and licenses vacation ownership resorts under 19 brands. For more information or reservations, please visit our website at www.marriott.com , and for the latest company news, visit www.marriottnewscenter.com .\nCourtyard by Marriott offers an environment that helps guests stay connected, productive and balanced. Intuitive services and design accommodate guests' needs for choice and control. With more than 1,000 locations in 42 countries and territories, Courtyard hotels participate in the award-winning Marriott Rewards® frequent travel program that allows members to earn hotel points or airline miles for every dollar spent during each stay. For more information or reservations, call the Courtyard toll-free number at 800-321-2211, visit courtyard.marriott.com , become a fan at www.facebook.com/courtyard or follow Courtyard at www.twitter.com/courtyardhotels .\nMarriott Rewards is Marriott International's award-winning loyalty program spanning 16 brands and 4,000 properties worldwide. Marriott Rewards is free to join and has no blackout dates and members can earn and redeem points at Marriott International properties around the world and at Marriott Rewards exclusive luxury partner The Ritz-Carlton®. Members can also redeem points for frequent flyer miles, cruises, car rentals, merchandise and more. By making rewards accessible with a modern, easy approach, Marriott Rewards continues to be a leader in the industry. Marriott Rewards has won the Freddie Award for \"Best Hotel Rewards Program in the Americas\" eight years in a row and the 2011 and 2010 Frequent Travel Award for \"Best Hotel Rewards Program.\" In addition, the program has been named best hotel rewards program by the readers of U.S. News & World Report, About.com, Business Traveler, Global Traveler, Executive Travel and BusinessWeek magazines. To enroll and for more information about Marriott Rewards, guests can visit MarriottRewards.com .\nLogo - http://photos.prnewswire.com/prnh/20141006/150429\nLogo - http://photos.prnewswire.com/prnh/20130807/NE60673LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/marriott-international-creates-two-epic-super-bowl-50-fan-experiences-300140949.html\n ", "external_links": ["http://www.twitter.com/courtyardhotels", "http://www.marriottnewscenter.com/", "http://photos.prnewswire.com/prnh/20141006/150429", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnvar/20130807/NE60673LOGO", "http://www.news.marriott.com/company-information.html", "http://www.facebook.com/courtyard", "http://courtyard.marriott.com/", "http://www.marriottrewards.com/", "http://www.marriott.com/", "https://www.youtube.com/user/CourtyardByMarriott", "http://courtyard.marriott.com/nfl", "http://courtyard.marriott.com/NFL?utm_source=(direchttp://courtyard.marriott.com/NFL?utm_source=(direct)&utm_medium=redirect&utm_campaign=courtyard.comt)&utm_medium=redirect&utm_campaign=courtyard.com", "http://www.prnewswire.com/news-releases/marriott-international-creates-two-epic-super-bowl-50-fan-experiences-300140949.html", "http://photos.prnewswire.com/prnh/20130807/NE60673LOGO", "http://photos.prnewswire.com/prnvar/20141006/150429", "https://www.facebook.com/marriottrewards", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH98781&Transmission_Id=201509101155PR_NEWS_USPR_____PH98781&DateId=20150910"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-10T21:39:58.609+03:00", "highlightTitle": ""}