{"organizations": [], "uuid": "93448a5ab5e8fdabca49278ee058c7c3c917c514", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03451/A_Salmon_Jumping_u_3451893k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-24.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/earth/wildlife/11888422/Britains-native-salmon-under-threat-from-pink-invader.html", "country": "US", "title": "Britain's native salmon under threat from pink invader", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Britain's native salmon under threat from pink invader - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T23:05:00.000+03:00", "replies_count": 0, "uuid": "93448a5ab5e8fdabca49278ee058c7c3c917c514"}, "author": "Leon Watson", "url": "http://www.telegraph.co.uk/news/earth/wildlife/11888422/Britains-native-salmon-under-threat-from-pink-invader.html", "ord_in_thread": 0, "title": "Britain's native salmon under threat from pink invader", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There are fears for Britain's native salmon after several pink specimens were caught in UK waters - despite being 10,000 miles from their natural habitat. The pink salmon is usually found in the chilly waters off Canada and Alaska where they are part of the staple diet of the grizzly bear. Their translucent eggs also make fine caviar. Pink salmon eggs in Canada But in recent weeks eight alien specimens have been caught in the sea and tidal rivers in the north east of England. Five have reportedly been caught on rod and line by anglers fishing the River Tyne and the River Wear. • Anglers in Scotland could be banned from killing and eating salmon One angler threw the healthy fish back after taking a photo of it but another realised it was an alien species and killed it. The two catches came after three pink salmon were found in trawler nets in the sea off the same coastline. The dead specimen has been handed over to the Environment Agency which is investigating how the fish came to be here. The dead specimen caught in UK waters One theory being looked into is that the pink salmon may have originated from the Barents Sea, where the Russians introduced thousands of them 40 years ago as part of a massive breeding programme. Over the last 10 years some of these have successfully bred in rivers in Norway and Iceland and they may now be crossing the North Sea to Britain. Although there is no evidence to suggest they are breeding here, if they did colonise British waterways the results would be catastrophic for native wild Atlantic salmon as they are an invasive fish that would compete for the same food. A grizzly bear prepares to catch a salmon in Alaska Richard Jenkins, of the Environment Agency, said: \"This is quite an unusual find in our waters. We are keen anglers know we are aware of the sightings and we are investigating. \"I would urge them to contact us if they see any non-native salmon in the waters, with a date, location and if possible a photograph, which would really help us identify them and build up a picture of where they are. \"At this stage we don't think there's likely to be a major impact on wild fish stocks.\" The Chester-le-Street and District Angling Club is advising its members to kill any pink salmon they catch and inform the bailiff or club official. They have issued a description of the fish so members know what to look out for. Adult pink salmon are steel blue in colour and have a white on the belly. The males develop hooked snout with a gaping mouth and a huge hump in front of the dorsal fin. Paul Knight, of the Salmon and Trout Conservation Trust, said: \"It is highly unlikely these are wild pink salmon because they are totally in the wrong part of the world, unless they have somehow come across the Pacific. \"They are probably the produce of a stocking programme that took place in Russia some while ago. These fish have probably struck out in the wild, have colonised other waters and have found their way over to our rivers. \"If they do begin to colonise and breed over here that would create a major problem for native salmon which are not doing very well as it is in terms of numbers.\" • Wild salmon put at risk as a million farmed fish escape Wild Atlantic salmon are endangered under the International Union for the Conservation of Nature's red list of threatened species in the world. telegraph.co.uk Follow @telegraphnews", "external_links": [], "published": "2015-09-24T23:05:00.000+03:00", "crawled": "2015-09-25T12:12:08.779+03:00", "highlightTitle": ""}