{"organizations": [], "uuid": "49a325145ab337a606021a85ca777a39c96917f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/Sporting-stars-support-300x152.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sporting-stars-support-scotlands-2019-solheim-cup-bid/", "country": "US", "title": "Sporting stars support Scotland’s 2019 Solheim Cup bidTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Sporting stars support Scotland’s 2019 Solheim Cup bidTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "49a325145ab337a606021a85ca777a39c96917f5"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sporting-stars-support-scotlands-2019-solheim-cup-bid/", "ord_in_thread": 0, "title": "Sporting stars support Scotland’s 2019 Solheim Cup bidTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sporting stars support Scotland’s 2019 Solheim Cup bid\nSolheim Cup stars from both sides of the Atlantic have given their backing to the event returning to Scotland, the Home of Golf, following the country’s bid to host the biennial event at Gleneagles in 2019.\nScotland’s Catriona Matthew and American Paula Creamer, who lined up on opposing sides in the dramatic US victory at St Leon Rot last week, both recorded messages of support for Scotland’s bid, which was submitted to the Ladies European Tour last month.\nThe Scottish bid, which is led by VisitScotland and supported by The Scottish Government, looks to bring the event back to Scotland for the first time in almost 20 years and has already received support from top names across the sporting spectrum.\nMatthew, Scotland’s number one ranked female golfer, was joined by Americans Creamer and Cheyenne Woods as well as Scots Carly Booth and Kylie Walker in pledging support for the bid via a series of passionate video messages to the Ladies European Tour.\nMatthew, who last week featured in her eighth Solheim Cup as a player, said:\n“The Solheim Cup is a special event, which is growing in profile and stature with each passing staging. I’ve been fortunate to play in eight European teams but I have no doubt that a Solheim Cup in 2019 at Gleneagles would be the biggest and best yet and further help to enhance the stature of the event and women’s golf as a whole.\n“Golf in Scotland is a national past-time and the Scottish crowds would come out to support The Solheim Cup in droves. Equally, both players and media love coming to golf events in Scotland. It is the Home of Golf and there is always that something extra every time you tee it up in a competition here.”\nCreamer, a wild card pick in Juli Inkster’s US Solheim Cup team in Germany last week, has previously spoken about her love of playing golf in Scotland and said:\n“I definitely support Scotland’s bid for The 2019 Solheim Cup. I love playing in Scotland both because it is the Home of Golf and because of all their amazing golf courses with magnificent views.”\nWoods, who made her first appearance in Scotland during the Aberdeen Asset Management Ladies Scottish Open at Dundonald Links in July, added:\n“I’ve been fortunate enough to play in a number of countries around the world but it was special to play in the Aberdeen Asset Management Asset Ladies Scottish Open in July. It was the first time I’d played in Scotland and it was a special feeling to be able to play in the country where the game began. The crowds were amazing and so supportive throughout the week. I back Scotland’s bid for The 2019 Solheim Cup and it would be great to have the opportunity to qualify to represent my country in the Home of Golf.”\nScotland’s submission, which proposes staging the event on the world-renowned PGA Centenary Course at Gleneagles, has now moved to the final stage with site visits from LET officials planned at Gleneagles this week before a decision is made by the Player’s Committee at the end of October. The visits, which are being co-ordinated by the EventScotland team at VisitScotland, will include a tour of the hotel and its grounds, presentations from key Scotland partners and a meeting with First Minister Nicola Sturgeon.\nPaul Bush, Director of Events at VisitScotland, said:\n“We are delighted that our bid has received so much support across the sporting spectrum, including from a number of high-profile individuals from outwith Scotland. That goes to show the high regard in which Scotland is held around the world as a destination for major events.\n“We are confident that our bid is a strong one and we look forward to further demonstrating to the LET this week that we not only have the passion, but the capacity, capability, credibility and confidence to hold the best-ever Solheim Cup in 2019.”", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-22T02:51:48.975+03:00", "highlightTitle": ""}