{"organizations": [], "uuid": "33a535d9224e21c6453d28d65ce134744d923332", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/katara.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/katara-hospitality-adds-westin-excelsior-rome-to-its-global-portfolio/", "country": "US", "title": "Katara Hospitality adds Westin Excelsior Rome to its global portfolio - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Katara Hospitality adds Westin Excelsior Rome to its global portfolio - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "33a535d9224e21c6453d28d65ce134744d923332"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/katara-hospitality-adds-westin-excelsior-rome-to-its-global-portfolio/", "ord_in_thread": 0, "title": "Katara Hospitality adds Westin Excelsior Rome to its global portfolio - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Katara Hospitality adds Westin Excelsior Rome to its global portfolio Published on : Friday, September 18, 2015\nKatara Hospitality, the global hotel developer, owner and operator announced the expansion of its global portfolio with the acquisition of the Westin Excelsior Rome from Starwood Hotels & Resorts Worldwide, Inc.\nAs part of the deal, the historic hotel will be renovated in the next five years, including a top-to-bottom transformation of all guestrooms, as well as upgrades to the hotel’s public areas, and continues to be operated by Starwood Hotels & Resorts under a new long-term management agreement\nHis Excellency Sheikh Nawaf bin Jassim bin Jabor Al-Thani, Chairman of Katara Hospitality, signed the agreement for the new property with Mr. Michael Wale, President – Europe, Africa, and Middle East Starwood Hotels & Resorts.\nThe signing ceremony was held at The Westin Excelsior Rome in the presence of His Excellency Sheikh Nawaf Bin Jassim Bin Jabor Al-Thani, Chairman of Katara Hospitality; Mr. Michael Wale, President – Europe, Africa, and Middle East Starwood Hotels & Resorts; Mr. Hamad Abdulla Al-Mulla, Chief Executive Officer of Katara Hospitality; Mr. Simon Turner President, Global Development at Starwood Hotels & Resorts; Mr. Robert Koren, VP Regional Director Southern Europe at Starwood Hotels & Resorts; and His Excellency Mr. Abdulaziz bin Ahmad Al-Malki Al Jehan Qatar’s Ambassador to Italy.\n“This agreement marks our third property in Italy. The Westin Excelsior Rome is the epitome of what Katara Hospitality looks for in a hotel,” said Sheikh Nawaf Bin Jassim Bin Jabor Al-Thani, Chairman of Katara Hospitality. He continued, “Its grand and statuesque appearance is the ultimate in luxurious hospitality. The hotel is a welcome addition to our growing global portfolio of iconic properties, and we are delighted to be continuing to set the standard for luxury hospitality the world over.”\nMichael Wale, President – Europe, Africa, and Middle East Starwood Hotels & Resorts, said “We are thrilled to expand our relationship with Katara Hospitality, owner of both Sheraton Doha Resort & Convention Center and The Excelsior Hotel Gallia, a Luxury Collection Hotel in Milan. We look forward to working together on the continued success of The Westin Excelsior, an architecturally stunning property and one of the most iconic hotels in Rome.”\nThe acquisition brings Katara Hospitality’s portfolio of properties in operation or under development to 35 and marks its 3rd property in Italy. The announcement further builds on Katara Hospitality’s partnership with Starwood Hotels & Resorts, with the Westin Excelsior Rome representing the 2nd hotel in Italy and the 3rd hotel globally including Sheraton Doha Resort & Convention Center in Qatar.\nKatara Hospitality’s vision for iconic properties such as The Westin Excelsior Rome is to commit significant investment over the long term, with a renovation strategy that returns the hotel to its full glory, combining its rich heritage with all the modern facilities required in 21st century hotel.\nHamad Abdulla Al-Mulla, Chief Executive Officer of Katara Hospitality, said: “For more than a century, this legendary hotel has provided exceptional hospitality and hosted dignitaries and celebrities, as well as business and leisure travelers. We look forward to making further improvements to The Westin Excelsior Rome and continuing its long-standing tradition of excellence.”\nAdam Aron, interim Chief Executive Officer of Starwood, said: “This transaction, on the heels of our recent sales of The Phoenician, Element Denver Park Meadows and The Gritti Palace, a Luxury Collection Hotel, Venice has allowed Starwood to exceed our stated goal of completing $800 million in asset sales by the end of 2015.”\nThe Westin Excelsior Rome is a five-star hotel in the celebrated Via Veneto district and is known for its outstanding service. Established in 1906, the luxury property was proudly named Conde Nast Traveler’s Gold List 2013. It has hosted many celebrities, statesmen and artists. The hotel is one of the city’s most impressive palaces, rich in history and located on one of the most talked about streets of Rome, which is close to many of the main attractions.\nThe hotel is often chosen for government delegations, wedding banquets and groups thanks to its large inventory of rooms and its wide selection of meeting and banqueting facilities.\nMade up of 281 guest rooms and 35 suites, the grand hotel also consists of an indoor pool and health and fitness center. For over a century, the legendary hotel has been providing exceptional hospitality, making it a hotel of choice for families.", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T15:36:23.415+03:00", "highlightTitle": ""}