{"organizations": [], "uuid": "a97e10edacd9ddbe82f8be4a072544f76f835344", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/awards/28579-new-eeaa-awards-generate-more-opportunities-and-capture-what-s-important-to-business-events", "country": "US", "title": "New EEAA awards generate more opportunities and capture what's important to business events", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "New EEAA awards generate more opportunities and capture what's important to business events", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T18:00:00.000+03:00", "replies_count": 0, "uuid": "a97e10edacd9ddbe82f8be4a072544f76f835344"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/awards/28579-new-eeaa-awards-generate-more-opportunities-and-capture-what-s-important-to-business-events", "ord_in_thread": 0, "title": "New EEAA awards generate more opportunities and capture what's important to business events", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New EEAA awards generate more opportunities and capture what's important to business events New EEAA awards generate more opportunities and capture what's important to business events Details Category: Awards Created   16:00 The Exhibition and Event Association of Australasia (EEAA) has called for entries to the EEAA 2015 Awards for Excellence with some exciting changes – there are now five more ways the industry can showcase its best. EEAA Chief Executive, Joyce DiMascio, said each year the Association reviews the criteria and categories as part of its mission to run an outstanding awards program that is respected and valued. \nMs DiMascio said the Association had introduced five new award categories to reflect the changes in the Association’s membership and changes in what’s important in the Business Events sector. She said the 2015 criteria had also been refined across some categories and it was now clearer that external auditing to validate performance indicators would be considered highly. There are 18 awards this year including the following new awards: Best Corporate Citizenship – a new category to recognise an outstanding initiative that gives back to the community, promotes internal CSR culture or develops a partnership that promotes ethical business practice. This award will replace Best Green Initiative. Best Supplier – Services or Products – a new category for suppliers and contractors which will recognise the services that support the exhibition industry. This is in addition to the existing Best Supplier Team category which relates to a specific event. Best New Initiative - Venue Over 10,000 m2 Best New Initiative - Venue Under 10,000 m2 These two new Venue awards are to recognise the important role venues play in supporting their clients. They are in addition to the existing Best Venue Team category which relates to a specific event. Best New Zealand Show – this will enable NZ shows to be judged against other NZ entries. “Our industry has faced some challenges over the past year and as a result we have seen many companies, individuals and teams respond with creative and innovative solutions.” Ms DiMascio said. “These awards will reward those who think outside the box, who go above and beyond for their clients, and who create successful shows, builds and products that demonstrate the strength of our industry. “We invite the industry to showcase their best work by entering the EEAA 2015 Awards for Excellence which will be presented at our gala dinner on 2 December in Sydney.” Entries for the Awards are open to all EEAA Members and your event must have been held between 1 October 2014 and 30 September 2015. Submissions close 5pm (AEST) on Friday, 25 September 2015. Related articles The Reverie Saigon takes centre stage in Ho Chi Minh City Hotel celebrates 1st September Grand Opening as Vietnam’s most sumptuous city debut The Reverie Saigon, a 286-room hotel with some of Ho Ch...", "external_links": [], "published": "2015-09-02T18:00:00.000+03:00", "crawled": "2015-09-03T11:24:28.385+03:00", "highlightTitle": ""}