{"organizations": [], "uuid": "eea0e592356c7b3c0582af72a7ab0a8449d79d31", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03434/harrykanerex_3434863k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sport/football/teams/england/11855054/Wayne-Rooney-has-sound-advice-for-Harry-Kane.html", "country": "US", "title": "Wayne Rooney has sound advice for Harry Kane", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "Wayne Rooney has sound advice for Harry Kane - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T07:07:00.000+03:00", "replies_count": 1, "uuid": "60bd1ccf6d5a9be09414f8ebf51d2f8399dcc343"}, "author": "Jeremy Wilson , Deputy Football Correspondent", "url": "http://www.telegraph.co.uk/sport/football/teams/england/11855054/Wayne-Rooney-has-sound-advice-for-Harry-Kane.html#post-0", "ord_in_thread": 0, "title": "Wayne Rooney has sound advice for Harry Kane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The challenge is usually to transfer club form on to the international stage but, after his third goal in only 82 competitive minutes as an England player, Harry Kane returned to Tottenham Hotspur on Wednesday with the opposite problem. Kane is yet to follow up his magnificent breakthrough season for Tottenham with a goal in the opening four games of this campaign and has sought advice during the past week from Wayne Rooney. Wayne Rooney marks his 50th England goal England’s captain – and now the national side’s record goalscorer – has endured his own share of fallow periods and the message simply to relax and get back to basics appears to have been absorbed. “There is no rush as far as my club is concerned,” Kane said. “If I don’t score for the next three or four games there is no panic. I’m ahead of where I was last season so I have just got to focus on the positives. People always expect you to score every game but it doesn’t ­always happen like that. You’ve got to be strong mentally.” Rooney believes that the biggest danger lies in trying too hard. “I always remember when I was younger, when you go through stages of not scoring, I always tried to do too much,” the captain said. “The thing to do is to keep it simple, keep doing the things you know and the chances will come and so will the goals. I was delighted when he scored. He has given the manager something to think about.” Harry Kane celebrates after scoring against Switzerland at Wembley That something will be whether a centre-forward partnership of Kane and Rooney can become a prolific long-term proposition for England. The related question is whether Rooney is at his best as the main central striker or in the No10 position behind a more advanced target man. “I grew up watching him play as a kid, scoring goals for his country and hoping that one day I would play with him,” Kane said. “The first memory is the Euros in 2004 when I would probably have been about 11.” Rooney was partnering Michael Owen at that time. “He is more of a target man than me and Michael,” Rooney said. “It is different but I feel I can play off him. You have to understand he’s only a young lad – he’s only played one season in the Premier League. If he keeps doing the simple things and doing what he does he’ll score goals. I’m sure he’ll be a great player for England.” TelegraphSportPage Follow @telefootball Telegraph Fantasy Football 2015/16 Get your first team free. £100,000 to be won Pick your free team »", "external_links": [], "published": "2015-09-10T07:07:00.000+03:00", "crawled": "2015-09-10T04:39:51.332+03:00", "highlightTitle": ""}