{"organizations": [], "uuid": "11e85159872ff884ec43b1726e9740b59ad0bad7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28725-dusit-makes-a-splash-in-japan", "country": "US", "title": "Dusit makes a splash in Japan", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Dusit makes a splash in Japan", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T11:45:00.000+03:00", "replies_count": 0, "uuid": "11e85159872ff884ec43b1726e9740b59ad0bad7"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28725-dusit-makes-a-splash-in-japan", "ord_in_thread": 0, "title": "Dusit makes a splash in Japan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dusit makes a splash in Japan Dusit makes a splash in Japan Details Category: Hotel Created on Thursday, 10 September 2015 09:45 Representatives from leading Asian hospitality group, Dusit International were recently in Tokyo and Osaka, Japan for a roadshow and media presentation to further strengthen brand awareness in one of its most important source markets. Led by Managing Director and CEO Mr Chanin Donavanik, Dusit executives welcomed media to a presentation held at the Prince Park Tower Tokyo, the flagship hotel of Dusit’s marketing alliance partner, Prince Hotels and Resorts. \nAt the presentation, Mr Donavanik shared the story of how his mother, the company’s founder Thanpuying Chanut Piyaoui, whom, as a forward-thinking young woman with a big dream, through her extensive overseas travels, developed a passion and vision to build a hotel of international standard like the ones she had seen but uniquely Thai in her homeland more than 60 years ago. Dusit’s long standing association with Japan dated back to the 1960’s when Thanpuying Chanut, during her stays at the Hotel Okura in Tokyo became so impressed and inspired by the Japanese hospitality and 5-star facilities she experienced that she later was introduced and became close to the then President of Okura Hotels, Mr Iwajiro Noda, who advised her on the design of her new hotel concept that led to the opening of the iconic Dusit Thani Bangkok in 1970 which quickly became an international symbol of Thai hospitality, and for many years stood as the tallest building in Thailand. The Dusit Thani brand has since evolved to export to the world the best that Thailand has to offer, namely its warm service culture, world-renowned cuisine and much revered spa traditions. And this, over time, has become the cornerstone of the Dusit brand worldwide. During the presentation, the media were introduced to the company’s latest flagship property to launch, the Dusit Thani Guam Resort. Situated on the island’s magnificent Tumon Bay, the resort features panoramic views from its 419 well-appointed rooms, suites and villas. It is the island’s only luxury hotel and newest build in over 15 years. Debuted in late June, it is quickly gaining acclaim especially among Japanese guests who represent the biggest inbound market segment. Among other “firsts”, the Hotel will offer Guam’s only hydrotherapy spa with Thai-inspired massage treatments, as well as the island’s largest Convention Centre. Also introduced during the event was Dusit Thani Maldives, a premium boutique resort in the Indian Ocean located within the country’s only UNESCO World Biosphere Reserve featuring the first official internationally approved free-diving centres. Since its launch in 2012, the resort has received numerous international accolades including most recently the 2015 Conde Nast Traveller Gold List. In addition to the media presentations, members of the Dusit team also conducted roadshows in Tokyo and Osaka, reaching over 200 current and prospective clients. “Japan is an important market for Dusit, our number two source market across the group”, commented Mr Donavanik. “We feel it is a great time to come here to meet the media and our clients face-to-face to show our appreciation for their loyal support, strengthen our brand awareness and also share with our business partners our latest developments including the recent opening of the Dusit Thani Guam, as well as other exciting properties in the pipeline. Our Japanese Centre in our Bangkok headquarters established since 2002 and our Regional Sales Office in Tokyo are dedicated to serving our Japanese clients and guests. We look forward to welcoming many more Japanese guests to Guam, Maldives and other Dusit hotels and resorts around the world.” Dusit currently operates 26 properties in 4 regions across 4 brands with distinctive designs and brand features that cater to different market segments. The company has nearly 50 confirmed projects in its development pipeline in locations including Singapore, Bhutan, Australia, Vietnam, Cebu, Shanghai, South Africa, and the Sultanate of Oman. As the brand continues to expand, we endeavour to bring the best of Gracious Thai Hospitality, blending it with local customs to offer guests an experience that is distinct, memorable, and authentically Dusit. In addition to international hotel development, Dusit also owns and operates the Dusit Thani College, which offers degrees in Culinary and Hospitality management and has established partnerships with world-renowned institutions such as École Hôtelière de Lausanne, Le Cordon Bleu, as well as Japan’s ASO College Group and Tsuji Culinary School, and aims to grow these partnerships further at the soon-to-open Dusit Thani Hotel School. Related articles", "external_links": [], "published": "2015-09-10T11:45:00.000+03:00", "crawled": "2015-09-10T11:55:13.678+03:00", "highlightTitle": ""}