{"organizations": [], "uuid": "7e6758e994330fbcb18bbb2d29ccf3098fa9359b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goitaly.about.com", "main_image": "http://f.tqn.com/y/goitaly/1/S/b/Y/-/-/55850850.jpg", "site_section": "http://z.about.com/6/g/goitaly/b/index.rdf", "section_title": "About Italy Travel", "url": "http://goitaly.about.com/od/lakecomolagodicomo/p/lake_como.htm", "country": "US", "title": "Get to Know Lake Como, Italy's Most Popular Lake", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Get to Know Lake Como, Italy's Most Popular Lake", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T03:35:00.000+03:00", "replies_count": 0, "uuid": "7e6758e994330fbcb18bbb2d29ccf3098fa9359b"}, "author": "", "url": "http://goitaly.about.com/od/lakecomolagodicomo/p/lake_como.htm", "ord_in_thread": 0, "title": "Get to Know Lake Como, Italy's Most Popular Lake", "locations": ["Tremezzo", "Know Lake Como", "Italy"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "View of the lake from a little town near Tremezzo. Maremagnum/Taxi/Getty Images Lake Como Highlights: \nLake Como, Lago di Como in Italian, is Italy's most popular lake and also its deepest. Lake Como is shaped like an inverted Y giving it a long perimeter. The lake is surrounded by mountains and hills and dotted with beautiful villas and resort villages. There are good hiking paths, boat trips and water activities. Popular since Roman times, Lake Como is a top romantic travel destination and a great spot for photography. Lake Como Location: \nLake Como is in the region of Lombardy and is part of the northern Italian Lakes District. It lies between Milan and the border of Switzerland with its southern tip about 40km north of Milan. See location on our Lombardy Map . Where to Stay on Lake Como: \nLake Como has a variety of lodging options, from campgrounds to historic villas. The elegant 5-star Grand Hotel Villa Serbelloni in Bellagio is a top luxury hotel on the lake and one of the oldest. See these Top Rated Lake Como Hotels around the lake or compare Lake Como Hotels on Hipmunk How to Get to Lake Como: \nLake Como is on the Milan to Switzerland train line. The train stops in the town of Como, the main town on the lake, where there is a tourist office in Piazza Cavour . The Ferrovia Nord Milano , a small train line that leaves Como from via Manzoni , runs only between Como and Milan. Milan's Malpensa Airport is 40 miles away. To get to Como from the airport, take the Malpensa Express Train to Saronna and transfer to train LeNord to Como. \nCompare flights to Milan on Hipmunk Transportation for Getting Around the Lake: \nFerries link the major villages and towns of Lake Como, providing both a good form of public transportation and a good way to do some sightseeing from the lake. There is also a bus system to villages around the lake. There are several funiculars to take you into the hills. You can rent cars in Como (see Auto Europe rentals in Como ) if you want to explore other nearby areas on your own. When to Go to Lake Como: \nLake Como is a popular weekend destination for people from Milan so the weekdays may be less crowded. July and August are the most crowded months. Spring and Fall are the best times to visit as it is less crowded and the weather is usually pleasant. During the winter, some services may be closed, but you can ski in the mountains nearby. See Como Average Temperatures and Precipitation . Lake Como Attractions: \nYou'll find the major towns around the lake on our Lake Como map . For some of the sights, see our Como Pictures or Bellagio Pictures. Bellagio , known as the pearl of the lake, is in a beautiful setting where the three branches of Lake Como come together. It's easy to get to by ferry or bus from other cities on the lake. Read more in our Bellagio Travel Guide . The walled town of Como has a good historic center and lively squares with nice cafes. There are several walking paths near town. Como makes a good base if you're traveling by train. From Como you can take the funicular to the village of Brunate , 720m above Como, for hiking trails and beautiful views of the lake and the Alps. Silk is produced in the town of Como and you can see the entire silk-making process in the Silk Museum dating from 1900 or buy silk in many shops. Villa d'Este , in the village of Cernobbio on the west coast, is the most famous of Lake Como's villas. The villa is now a luxury hotel on a wooded peninsula. Each of its 161 rooms is unique. Menaggio , against the mountains, is a lively resort with a lakeside promenade. Menaggio is popular with outdoor enthusiasts for walking or hiking, swimming, windsurfing, and rock climbing. Villa Carlotta , south of Menaggio, has beautiful gardens. You can tour the inside with its original 18th century furniture and art works. Villa del Balbianello , in the village of Lenno , is also worth a visit and has some unusual treasures. The villa was used as a set for one of the Star Wars movies. The fishing village of Varenna has picturesque narrow alleyways and streets below a castle and a lakeside walking path. Outdoor Activities - Biking, mountain biking, hiking, boating, paragliding and windsurfing. In the winter, you can ski in the nearby mountains. Cruises - there are some interesting cruises around the lake on commercial boats, mainly on weekends in the summer season. \nFestivals: The Sagra di San Giovanni is celebrated the last weekend of June in the town of Como with folk arts and fireworks and in Ossuccio with a festival, boat procession, and boat race. The Palio del Baradello , a historical re-enactment, is the first week of September. Also in September is a traditional rowing race, Palio Remiero del Lario . LakeComo Festival features summer music performances in venues around the lake and there are gastronomic festivals in fall and drama from January through April. Related Articles", "external_links": [], "published": "2015-09-11T03:35:00.000+03:00", "crawled": "2015-09-11T08:25:45.789+03:00", "highlightTitle": ""}