{"organizations": [], "uuid": "cea22c2c757f7183e4a3987ba27457bcf21fc424", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/Renaissance-ClubSport.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/renaissance-clubsport-aliso-viejo-laguna-beach-hotel-entices-travelers-with-exciting-new-package/", "country": "US", "title": "Renaissance ClubSport Aliso Viejo Laguna Beach Hotel Entices Travelers With Exciting New PackageTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Renaissance ClubSport Aliso Viejo Laguna Beach Hotel Entices Travelers With Exciting New PackageTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "cea22c2c757f7183e4a3987ba27457bcf21fc424"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/renaissance-clubsport-aliso-viejo-laguna-beach-hotel-entices-travelers-with-exciting-new-package/", "ord_in_thread": 0, "title": "Renaissance ClubSport Aliso Viejo Laguna Beach Hotel Entices Travelers With Exciting New PackageTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Renaissance ClubSport Aliso Viejo Laguna Beach Hotel Entices Travelers With Exciting New Package\nCalifornia travelers soak up the sun in style with special perks from Renaissance ClubSport Aliso Viejo Laguna Beach Hotel.\nSummer might be coming to an end, but fun in the sun is in full swing at one of the premier hotels in Aliso Viejo. Travelers that book a stay for three or more nights can take advantage of the Laguna Beach Enjoy Blue Skies Package and earn 1,500 Marriott Rewards Points when they arrive on a Thursday or Friday. Featuring rates from just $159 a night Aug. 20 – Nov. 8, 2015, this special deal is the perfect excuse for families and friends to enjoy a weekend getaway in beautiful Southern California.\nWith tons of exciting on-site amenities, the Laguna Beach hotel gives guests plenty of ways to make memories. Visitors looking for a relaxing retreat can enjoy a peaceful escape at R Spa. From revitalizing facials and massages to invigorating body scrubs and wraps, the on-site spa has everything guests need to renew mind, body and spirit. Following their treatments, spa-goers can head to the steam room or simply relax in the comfortable lounge areas.\nFor a more active getaway, guests can take a refreshing dip in the sparkling outdoor pool, perfect for doing laps, making a splash or simply opting to soak up the sunshine in one of the plush lounge chairs surrounding the watering hole. Little ones will find endless fun of their own at the Splash Pad or Play Park, featuring a playground complete with exciting water sprayers and slides.\nFuel up for adventures with a mouthwatering meal, healthy snack or smoothie at Citrus Fresh Grill. Conveniently located inside the hotel, the stylish eatery allows travelers to satisfy their cravings with fresh California Cuisine for breakfast, lunch and dinner.\nFollowing a hearty meal, travelers can keep up with their fitness routines at Renaissance ClubSport. Kick off a brisk workout in the complimentary fitness center, featuring a variety of free weights, medicine balls and cardiovascular equipment complete with personal TV screens to keep users active and entertained. Guests can also schedule some time with a professional trainer, or feel the burn in one of the group fitness classes.\nNo matter how guests choose to spend their days, nights will be spent in style when they retreat to the hotel’s luxurious guest rooms and suites. With floor-to-ceiling windows boasting sweeping city views, the accommodations are ideal for relaxing while still enjoying the energy of the city. Kick back on chic furnishings while enjoying a show on flat-panel TVs, or settle into sweet dreams with plush bedding and piles of fluffy pillows. Marriott Reward members will also enjoy free Wi-Fi throughout their stay.\nSource: Renaissance ClubSport Aliso Viejo Laguna Beach Hotel", "external_links": [], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-03T03:47:56.298+03:00", "highlightTitle": ""}