{"organizations": [], "uuid": "4781b41da27bad04306cca413a36f5f31ca88887", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64305/aldo-group-opens-world-s-largest-outdoor-store-dubai-festival-ci", "country": "US", "title": "Aldo Group opens world’s largest outdoor store at Dubai Festival City Mall", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Aldo Group opens world’s largest outdoor store at Dubai Festival City Mall", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T22:26:00.000+03:00", "replies_count": 0, "uuid": "4781b41da27bad04306cca413a36f5f31ca88887"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64305/aldo-group-opens-world-s-largest-outdoor-store-dubai-festival-ci", "ord_in_thread": 0, "title": "Aldo Group opens world’s largest outdoor store at Dubai Festival City Mall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aldo Group opens world’s largest outdoor store at Dubai Festival City Mall   Patrik Frisk, Chief Director of Aldo and Aldo Bensadoun, Executive Chairman of Aldo   \nDUBAI, United Arab Emirates - Canada-based Aldo Group opened an 8,000 square foot store at Dubai’s Festival City mall as part of its plans to double the retailer’s size in terms of the number of stores by 2020. \n“Since Dubai has the world’s largest airport before Heathrow, so we felt we should also open our world’s largest outdoor store in Dubai,” said Aldo Bensadoun, executive chairman of the Aldo Group, adding that “Dubai is close to China, and India and all the emerging countries in the Middle East, it’s a place where you have mixture of fashion, business.” \nChina and India contribute to around a quarter of the world’s gross domestic product. \nThe fashion retailer has 2,200 stores in 95 countries, with London being the second biggest store with 7,500 sq ft of space. In the GCC, the group has a total of 140 stores. \n“We are planning to open a lot of stores in the GCC. In the next five years we will have close to 300 stores,” Bensadoun said, adding “the company is planning to invest a substantial amount.” \nBensadoun said the company plans to invest about $70 million (Dh257.11 million) for expansion. \nThe GCC region is expected continue growing in the foreseeable future, according to Patrik Frisk, chief executive officer of the Aldo Group. \n“We see the opportunity to double the business here, and we want to double the size of the company over the next five years,” Frisk said. \nThere is an opportunity for us to grow in not only brick-and-mortar stores but also in other channels of sales covering e-commerce. \nBrick-and-mortar stores contribute 65 percent of the retailer’s total sales, with the rest coming from various other channels. \n“We are changing rapidly to the needs of our end consumer, and the way our end-consumer shops today,” Frisk said. \nE-commerce sales contribute 7 percent of the total business, and the group expects the segment to contribute 11 per cent by 2020. \nE-commerce is expected to grow faster than the rest of the business, Frisk added. \n“[For] any brand that has global presence, there is a lot of opportunity to grow beyond where we are today, which is North America.” Frisk added. \nThe company sources 60 percent of its end products from China, and about 20 percent from Vietnam, and the remaining from Europe, and Brazil. \nThe retailer feels that there has been a transformation of fashion due to social media. \nThe Aldo Group was founded in 1972, and is into fashion footwear and accessories.", "external_links": [], "published": "2015-09-29T22:26:00.000+03:00", "crawled": "2015-09-30T00:35:47.293+03:00", "highlightTitle": ""}