{"organizations": ["Carnival Cruise Lines"], "uuid": "d32e03b75e97fed5ab61e96c42ff69832590b0d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theadvocate.com", "main_image": "http://theadvocate.com/csp/mediapool/sites/dt.common.streams.StreamServer.cls?STREAMOID=qp62pYsFiWAapG63yXhk9M$daE2N3K4ZzOUsqbU5sYvCfSFceLK41xr3ipiE_FVmWCsjLu883Ygn4B49Lvm9bPe2QeMKQdVeZmXF$9l$4uCZ8QDXhaHEp3rvzXRJFdy0KqPHLoMevcTLo3h8xh70Y6N_U_CryOsw6FTOdKL_jpQ-&CONTENTTYPE=image/jpeg", "site_section": "http://theadvocate.com/feed?feedName=Travel&feedURL=http://theadvocate.com/entertainment/travel/&publication=Advocate&sections=/entertainment/travel/&areas=Stories&counts=20&feedContentPage=/shared/templates/feeds/rss2.csp", "section_title": "The Advocate: Travel", "url": "http://theadvocate.com/news/acadiana/13349705-123/carnival-cruise-lines-offering-fun", "country": "", "title": "Carnival Cruise Lines offering fun for the kids", "performance_score": 0, "site": "theadvocate.com", "participants_count": 0, "title_full": "Carnival Cruise Lines offering fun for the kids", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T01:04:00.000+03:00", "replies_count": 0, "uuid": "d32e03b75e97fed5ab61e96c42ff69832590b0d3"}, "author": "", "url": "http://theadvocate.com/news/acadiana/13349705-123/carnival-cruise-lines-offering-fun", "ord_in_thread": 0, "title": "Carnival Cruise Lines offering fun for the kids", "locations": ["New Orleans"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Seuss", "JUDY BERGERON", "Angela Hill"], "text": "Carnival Cruise Lines offering fun for the kids Carnival Cruise Lines offering fun for the kids Photo provided by Carnival Cruise Line -- New Orleans broadcasting legend Angela Hill reads the new Dr. Seuss book, 'What Pet Should I Get?', to local children during an event aboard the Carnival Dream at the Port of New Orleans. JUDY BERGERON | jbergeron@theadvocate.com Comments \nJust because September is here and the kiddos are back in school doesn’t mean family vacation planning is on hiatus. \nWith that week break at Thanksgiving and two weeks-plus at Christmas, not to mention the flexible schedule of home-schoolers, getting away is still on parents’ minds, and the kids are having input, too. \nCarnival Cruise Lines has tapped in to that trend with Seuss at Sea, launched last year. Aboard all its ships, the program offers youth, family, dining and entertainment experiences inspired by Dr. Seuss. There’s the Seuss-a-palooza Parade and story time, the Green Eggs and Ham Breakfast with The Cat in the Hat and Friends, character interactions, Dr. Seuss toys and games and popular movies. \nTo celebrate the recent release of the new Dr. Seuss book, “What Pet Should I Get?”, the Carnival Dream anchored in New Orleans hosted an onboard book reading for some local children and donated $10,000 to the Louisiana Society for the Prevention of Cruelty to Animals. \nAngela Hill, former TV news anchor, radio personality and member of the New Orleans Broadcasting Hall of Fame, donned a Seuss hat and read to the kids last month. \nThe learning while having fun component is also found in Carnival’s new Camp Ocean program, with more than 200 marine-themed activities developed by a panel of parents, educators and other experts. \n“Parents these days want their kids to have a great time but at the same time have their own fun, which is why we’ve strived to create an on-board environment that offers specific activities for both kids and adults alike, as well as opportunities for shared experiences,” Stephanie Evans-Green, Carnival’s vice president of brand communications and planning, said. \nLeeAnn Fullerton at Geauxing Places Travel in Denham Springs, also said one of the main concerns with families is the kids having a good time. \n“There are so many different options for kids, from their own ‘clubs’ on cruise ships to their own ski schools,” Fullerton said. “Even escorted tour providers have started offering kids-only excursions. The focus is on not only time together as a family but also allow the mom and dad some alone time and the kids get a break, also.” \nEvans-Green said research shows that 56 percent of parents make the final vacation decision with kids’ input beforehand, but that 95 percent of parents consult their kids when making purchases for them and 69 percent check with their kids when buying products and experiences for the entire family. Air show in Natchitoches \nThe Wings Over Natchitoches Air Show takes flight starting at noon Saturday, Sept. 13, at the Natchitoches Regional Airport. \nGates open at 10:30 a.m. for the free event, which includes the AeroShell Four Ship Formation Aerobatics Team, a P-51 aerobatic demonstration and static display by Charlotte’s Chariot, Kevin Coleman’s extreme aerobatics in his Extra 300SHP and Col. Dave Leedom with his Aerotek Pitts S-2A. \nParking is also free. For more info, go to wingsovernatchitoches.org. D-Day museum adds to tours \nThe National WWII Museum has added multiple tour dates for its D-Day and Band of Brothers tours, which will both be in Normandy for the 72nd anniversary of the D-Day invasion. \nIn addition to the Sept. 18-24 D-Day: The Invasion of Normandy & Liberation of France tour, trips May 26 to June 1, 2016 (Memorial Day), and June 3-9, 2016, the D-Day anniversary, are now available. \nThe Band of Brothers Tour running Sept. 10-22 can also be booked for June 3-15, 2016, for the June 6 anniversary. \nOnly a few seats remain on the September tours, and tour capacities are being strictly limited, according to a release from the museum. For more on these or the 2016 tours, go to www.ww2museumtours.org/home/. Soiree in Opelousas \nThe Opelousas-St. Landry Parish Chamber of Commerce is again hosting the Annual Soiree Royale-Acadiana Chef’s Competition Monday, Sept. 15, at the Evangeline Downs Event Center, 2235 Creswell Lane Extension, Opelousas. \nThe Evangeline Downs Racetrack and Casino co-hosted the event, which draws chefs from around the state to compete in the annual chef’s cook-off. \nA special wine tasting sponsored by National Republic and craft beer samples by Bayou Teche Brewing will open the event. A portion of the funds goes to scholarships. \nThe event starts at 5:30 p.m. and tickets are $40. For more info, go to www.cajuntravel.com. \nLouisiana Travels is a column about travel destinations and events in Louisiana. Email items for Louisiana Travels to travel@theadvocate.com or jbergeron@theadvocate.com.  ", "external_links": [], "published": "2015-09-08T01:04:00.000+03:00", "crawled": "2015-09-08T18:25:15.868+03:00", "highlightTitle": ""}