{"organizations": [], "uuid": "933cf083b8944172578fa6a27be8c5932a08dc1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.winnipegfreepress.com", "main_image": "http://media.winnipegfreepress.com/images/576*432/NYET422-421_2012_100416_high.jpg", "site_section": "http://www.winnipegfreepress.com/rss/?path=/travel", "section_title": "Winnipeg Free Press: Travel", "url": "http://www.winnipegfreepress.com/travel/after-25-years-dr-beach-to-start-best-beaches-list-over-with-extra-credit-for-no-smoking-324373501.html", "country": "US", "title": "After 25 years, Dr. Beach to start best beaches list over with extra credit for no smoking", "performance_score": 0, "site": "winnipegfreepress.com", "participants_count": 1, "title_full": "After 25 years, Dr. Beach to start best beaches list over with extra credit for no smoking - Winnipeg Free Press", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T10:55:00.000+03:00", "replies_count": 0, "uuid": "933cf083b8944172578fa6a27be8c5932a08dc1b"}, "author": "The Associated Press", "url": "http://www.winnipegfreepress.com/travel/after-25-years-dr-beach-to-start-best-beaches-list-over-with-extra-credit-for-no-smoking-324373501.html", "ord_in_thread": 0, "title": "After 25 years, Dr. Beach to start best beaches list over with extra credit for no smoking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI - After 25 years of ranking beaches, the professor known as \"Dr. Beach\" is starting his list of best beaches over from scratch in 2016. And he'll be giving extra credit to beaches that ban smoking.\nProfessor Stephen Leatherman of Florida International University began his best beaches list in 1991. Once a beach achieved the No. 1 ranking, it was retired from consideration on future lists.\n\nFILE - In this April 21, 2012 file photo, Melissa Shapero holds a cigarette butt removed from the beachfront in Point Pleasant Beach, N.J., as part of statewide spring beach cleaning. Stephen Leatherman, a professor at Florida International University known as Dr. Beach, creates an annual list of best beaches and says that beginning in 2016, he’ll give extra points to beaches that ban smoking. (AP Photo/Wayne Parry, File) \nBut now he says he'll start fresh next year so that even beaches that he previously rated as tops have a shot at the No. 1 slot again.\nLeatherman rates beaches using 50 criteria including water temperature, air temperature, number of sunny days, rip currents, water colour, algae, views, access, seaweed and noise. But beginning in 2016, he says he'll give extra points to beaches that ban smoking.\n\"The No. 1 form of litter on beaches is cigarette butts, and it is disgusting,\" Leatherman said in an email. \"There is a national movement to prevent smoking, especially on public lands, and beaches should be a priority.\"\nHis annual list of best beaches is usually issued just before Memorial Day weekend. Dr. Beach's pick for best beach of 2015 was Hawaii's Waimanalo Beach on Oahu.\n ", "external_links": [], "published": "2015-09-04T10:55:00.000+03:00", "crawled": "2015-09-05T01:44:34.897+03:00", "highlightTitle": ""}