{"organizations": [], "uuid": "90fcbedb48d603ed3b3e7f1bdc361dd144486974", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64341/aviation-industry-teamwork-innovation-and-unity-sustainable-futu", "country": "US", "title": "Aviation industry: Teamwork, innovation and unity for a sustainable future", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Aviation industry: Teamwork, innovation and unity for a sustainable future", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:46:00.000+03:00", "replies_count": 0, "uuid": "90fcbedb48d603ed3b3e7f1bdc361dd144486974"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64341/aviation-industry-teamwork-innovation-and-unity-sustainable-futu", "ord_in_thread": 0, "title": "Aviation industry: Teamwork, innovation and unity for a sustainable future", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Aviation industry: Teamwork, innovation and unity for a sustainable future   Tony Tyler, IATA’s Director General and CEO   \nGENEVA, Switzerland - The International Air Transport Association (IATA) co-signed an open letter calling on governments to act to help the industry reduce its carbon footprint. The letter was organized by the Air Transport Action Group (ATAG), which brings together all the major players in the aviation sector (airlines, airports, aerospace manufacturers, and air navigation service providers) with the aim of responsibly dealing with industry issues such as managing aviation’s climate change impact. \nIn the letter, signed at the ATAG Global Sustainable Aviation Summit in Geneva, the aviation industry reaffirmed its commitment to its three environment goals: \n• 1.5% fuel efficiency improvement per year to 2020 \n• Stabilizing net carbon emissions through carbon-neutral growth from 2020 \n• Halving net carbon emissions by 2050 compared to 2005. \nThe industry is delivering on its commitments. Since the goals were set in 2009 a cumulative 600 million tonnes of CO2 have been avoided as a direct result of efforts associated with the industry’s four-pillar strategy of improvements in technology, operations, infrastructure, and the implementation of a global market-based measure (MBM). And the airline industry is the first industrial sector to agree on a position asking governments to implement a market-based measure to help it manage its carbon footprint. \nSpecifically, at the 2013 IATA Annual General Meeting airlines resolved to ask governments for a mandatory global carbon offset program. \n\"A global offsetting scheme would be our preferred MBM. Offsetting is important because it is a legitimate means for the industry to achieve carbon neutral growth. It makes sense for aviation, while it continues to take every step it can for itself, to encourage reductions in other business sectors where the scope for emissions cuts is greater,\" said Tony Tyler, IATA’s Director General and CEO. \nTeamwork, Innovation and Unity \nAddressing the summit, Tyler focused on the importance of teamwork, innovation, and industry unity as the bedrock of the industry’s environmental achievements and the driver of future gains. \n\"Flying is a team effort. And that is equally true for reaching our sustainability goals. Innovation has been at the root of our technological and operational improvements. But above all it is the unity of the aviation industry, jointly setting our three climate-change targets, and the four-pillar strategy to reach them, which has enabled us to make significant progress,\" said Tyler. \nThe industry’s united strategy to achieve its ambitious targets has given it a strong voice to call for governments to agree an MBM to capture carbon emissions, to enact long-overdue air traffic management reform, and put in place policies to accelerate the production of sustainable fuels. \nA global market-based measure to manage aviation carbon emissions can only be achieved by agreement among governments at the International Civil Aviation Organization (ICAO). \n\"In that context, I welcome and support the remarks of Dr. Aliu, President of the ICAO Council, this morning. In particular, his call for avoidance of financial impositions on the aviation industry at COP21, if we are to create the conditions for a positive outcome at the ICAO Assembly. \nWe have only 12 months to go before ICAO makes its decision on that MBM. In the hands of 190 states will be the power to make aviation’s carbon-neutral growth goal a reality. It is no exaggeration to say that the eyes of the world will be on them. And the industry is committed to supporting their success,\" said Tyler. \nAviation as a driver of sustainability \nTyler concluded with a personal vision on the importance of aviation to delivering a more sustainable world, urging delegates that \"to save the earth, take to the air.\" \n\"Aviation creates the connectivity that helps make our world a more prosperous place: a source of 58 million jobs and $2.4 trillion in economic activity. That prosperity drives the innovation that is needed for societies to move forward sustainably. Rising living standards lead to greater technological advances, far more efficient use of resources, and political pressure for environmental safeguards. So aviation’s greatest environmental service is to do what it keeps on doing – being a force for good, spreading peace and prosperity around the globe,\" he said.", "external_links": [], "published": "2015-09-30T19:46:00.000+03:00", "crawled": "2015-09-30T21:49:46.959+03:00", "highlightTitle": ""}