{"organizations": [], "uuid": "827c3e2baacf441d09d322073def311b0ba33392", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.com", "main_image": "http://ichef.bbci.co.uk/wwfeatures/624_351/images/live/p0/31/dr/p031drhw.jpg", "site_section": "http://www.bbc.com/travel/feed.rss", "section_title": "BBC Travel", "url": "http://www.bbc.com/travel/story/20150914-vietnams-prison-island-paradise?ocid=global_travel_rss", "country": "GB", "title": "Vietnam's prison-island paradise", "performance_score": 1, "site": "bbc.com", "participants_count": 0, "title_full": "Vietnam's prison-island paradise", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T20:28:00.000+03:00", "replies_count": 0, "uuid": "827c3e2baacf441d09d322073def311b0ba33392"}, "author": "", "url": "http://www.bbc.com/travel/story/20150914-vietnams-prison-island-paradise?ocid=global_travel_rss", "ord_in_thread": 0, "title": "Vietnam's prison-island paradise", "locations": ["Vietnam"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Westbrook"], "text": "By Tom Westbrook 21 September 2015 \nAt 5 am and 6 pm, government loudspeakers crackle to life all over Vietnam. Relics of an era before homes had televisions and radios, these public address systems – broadcasting news, propaganda and weather reports – are usually barely audible above the din of this modern nation: a mix of motorcycle engines, truck horns and construction. \nBut on Con Son, the news carries loud and clear over the tiny township of just 5,000 residents, two sets of traffic lights and one seaside promenade. Visiting the largest island in the Con Dao archipelago – a group of 16 mostly uninhabited picturesque islands in the South China Sea – is like stepping back in time. \nDespite being a short 45-minute turboprop flight from Ho Chi Minh City, the island paradise of Con Son is a world away from Vietnam’s well-beaten tourist trail. It is a throwback that has somehow flown under the radar, escaping the overdevelopment of mainland resort towns like Nha Trang and the party beaches of Phu Quoc. There are no touts, only peaceful empty beaches, and peak season means being just one of a dozen Westerners. \nIt won't stay this way forever, though. The island's first resort, the ultra-luxe Six Senses , opened at Dat Doc Bay on the island's east coast in 2010, and a megaresort is currently under construction in the south. There is also talk of an Italian-backed spiritual retreat, as well as rumours about extending the airport's runway so that bigger planes can land. View image of Lotus flowers in the morning market (Credit: Credit: Tom Westbrook) \nBut for now, most of the visitors are domestic Vietnamese paying homage to the island’s dark past. Known as Southeast Asia's Devil's Island, Con Son was once a penal colony used to brutal and cruel effect first by French colonists and later by Americans during the Vietnam War. The French worked 914 men to death building the island’s jetty, while the Americans kept prisoners in infamous \"tiger cages\", where captives – actual or suspected Communists – were shackled to the floor of deep concrete pits with steel bars for a roof. The main prison walls still dominate the town as a constant reminder, and the gaols and cemeteries have become pilgrimage sites to the thousands of Vietnamese who suffered and died on the island between 1862 and 1975. \nBut though the horrific memories hang heavy still, modern island life is languid and laid back. Con Son's steep green interior is fringed by warm turquoise water and coral reefs. Flame trees and bougainvillea give licks of colour to the jungle, and frangipani and magnolia trees line the wide, quiet boulevards. A single main road wraps about halfway around the island; a motorbike ride along the shoreline takes in ponds filled with lotus flowers, spectacular reddish-orange cliffs and one empty white-sand beach after another. The sea is calm, clean and perfect for swimming year-round. View image of The bustling marketplace will be deserted at noon for naptime (Credit: Credit: Tom Westbrook) \nThe island's daily routine starts at the bustling marketplace, where squid, crabs, clams, rambutans, plantains, mangos, dragonfruit and lotus flowers are piled for sale outside. Inside, young soldiers in jungle greens sit at the food stalls on low plastic chairs, gulping down breakfasts of bun rieu (crab noodle soup) or bun thit nuong (char-grilled pork with vermicelli noodles) while the morning sun floods the doorway. By 9 am, the food is sold out and by noon the market is deserted. \nThen, nothing happens until 2 pm, when new afternoon stallholders will arrive, selling roast pork sandwiches, sugarcane juice and rice paper rolls. For two hours, the postmistress goes home, the market is empty, the island naps and the sun beats down on the blue sea. There is nothing to do but swim at one of several beautiful beaches: it doesn't matter where you go, you'll have it to yourself. View image of Blue paradise on the coast of Nhat Beach (Credit: Credit: Tom Westbrook) \nIf this were the mainland, you might find hourly booze-cruises around the harbour. If you want to see the archipelago from Con Dao, ask around in the evening and you'll be able to hitch a ride with a fisherman early the next day. Slowly putt-putting out of the harbour in a brightly painted blue-and-orange ramshackle boat, the fisherman will likely take you towards the bays and reefs of the tiny outer islands. A snorkel and goggles will be enough to catch a glimpse of a turtle, and the diving is renowned as some of Vietnam's best. \nAs the heat of the day passes, many travellers choose to explore the island via motorbike. \nAt An Hai bay, 1km south of Con Son town, pearlers and fishermen moor their boats, keeping coracles – circular bamboo vessels, waterproofed with coconut-palm resin and propelled by paddle – on the shore as dinghies. For the next 6km, climb the road along the bay until it reaches the island's southmost tip, with views in every direction. The archipelago unfolds to the east; the harbour and Con Son town to the north; the island's rugged and rocky interior to the west. \nHugging the cliffs, the road winds past steep-walled crystal-clear bays and culminates at the island's jewel – the wide flats of Nhat Beach. Here mountains give way to an expanse of deserted white sand that runs hundreds of metres from shore at low tide, with the warm water waist-deep for hundred of metres more. Stay until twilight when the horizon twinkles with the lights of container ships plying the busy South China Sea. View image of The heat of the day sets behind Nhat Beach (Credit: Credit: Tom Westbrook) \nCome evening, Con Son town’s seaside promenade takes its turn as the island's social hub. The sky turns pink and barbecue carts roll up roasting corn, chicken skewers and pork. Swimmers – mostly Vietnamese tourists who shun the sand at daytime – arrive for a dusk dip. The waterfront swells with people. \nAcross the road from the beach, colonial French villas crumble in various stages of disrepair; their jungled gardens slowly taking over. French composer Camille Saint-Saens stayed in one while he finished work on his opera Brunhilda in 1895; today, that same building is the popular Con Son cafe , which provides only the essentials: beer, ice cream and Vietnamese coffee. View image of Dusk falls on Con Son's seaside promenade (Credit: Credit: Tom Westbrook) \nBy night, a different market opens on Tran Huy Lieu, two blocks to the east. Half the street is taken over with chairs and metal foldout tables; beer flows as roadside stalls barbecue shellfish, calamari and the rest of the day's catch. It is a delicious way to end the day – with only the nagging thought that the return flight back to the mainland is all too soon. Follow BBC Travel", "external_links": [], "published": "2015-09-21T20:28:00.000+03:00", "crawled": "2015-09-21T08:14:44.434+03:00", "highlightTitle": ""}