{"organizations": [], "uuid": "1ab91415fb9fb1c8a8d6e55c26ced03ead3d6660", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/08/air-canada2.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/air-canada-named-canadas-preferred-airline-by-frequent-business-travellers-in-ipsos-reid-survey-2/", "country": "US", "title": "Air Canada Named Canada's Preferred Airline by Frequent Business Travellers in Ipsos Reid SurveyTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Air Canada Named Canada's Preferred Airline by Frequent Business Travellers in Ipsos Reid SurveyTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "1ab91415fb9fb1c8a8d6e55c26ced03ead3d6660"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/air-canada-named-canadas-preferred-airline-by-frequent-business-travellers-in-ipsos-reid-survey-2/", "ord_in_thread": 0, "title": "Air Canada Named Canada's Preferred Airline by Frequent Business Travellers in Ipsos Reid SurveyTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Air Canada Named Canada’s Preferred Airline by Frequent Business Travellers in Ipsos Reid Survey Published on : Tuesday, September 22, 2015\nAir Canada has been named Canada’s favourite airline for business travel in the Ipsos Reid Business Traveller Survey. Air Canada was preferred by 86 per cent of Canadian frequent business travellers surveyed for 2015, an improvement of 17 percentage points in Air Canada’s ratings in the national survey over the past seven years.\n“This year’s Ipsos Reid Business Traveller Survey confirms that Canada’s most discerning travellers recognize Air Canada as their preferred airline by a growing margin – the widest margin versus our domestic competitors since 2008,” said Benjamin Smith , President, Passenger Airlines at Air Canada. “Year-over-year increases in key ratings by business travellers of their preference for Air Canada and their overall satisfaction compared to other Canadian carriers reflect their appreciation in the investments we are making in our fleet and products as well as our focus on customer service. We are especially pleased that this positive trend can be seen across Canada and underscores their preferences for Air Canada’s superior route network, choice of destinations and schedule. On behalf of our 28,000 employees worldwide, we would like to thank our customers for choosing Air Canada in growing numbers and assure them we remain focused on continuous improvement as North America’s only international four-star airline.”\nThe survey showed consistently strong ratings in customer preference for Air Canada’s frequent flyer reward program, flight schedule, Business Class service and Maple Leaf Lounges. Among other things, the survey of frequent business travelers found:\nOverall satisfaction with Air Canada’s service continues to increase, in contrast to its domestic competitors, climbing three percentage points over last year. 95 per cent intend to use Air Canada for business travel in the coming year, an increase of three percentage points over the previous year. Air Canada is the preferred airline from Canada to the U.S. for 67 per cent of respondents, an improvement of nine percentage points over the past seven years. In addition, Air Canada is the airline flown most often when going to the United States for 60 per cent of respondents, an increase of 10 percentage points over the past seven years.", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T02:38:05.601+03:00", "highlightTitle": ""}