{"organizations": [], "uuid": "5553d6fcf81edeb00e875a3fd0f82ef61d8c9610", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-09/KT_734524_02(83).jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094347652/Dublin-in-Bloom?src=RSS", "country": "US", "title": "Dublin in Bloom", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Dublin in Bloom | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T03:00:00.000+03:00", "replies_count": 0, "uuid": "5553d6fcf81edeb00e875a3fd0f82ef61d8c9610"}, "author": "Khaleej Times", "url": "http://www.menafn.com/1094347652/Dublin-in-Bloom?src=RSS", "ord_in_thread": 0, "title": "Dublin in Bloom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Khaleej Times) Still following Bloom's footsteps, we then headed outside the city, hiking the Cliff Path Loop in Howth Head, a bustling fishing village, 15km northeast of Dublin City. The Danes named it 'hoved' meaning head, and over the years this came to be Howth. It's a beautiful walk, taking us through a small path overlooking the sea, with meadows strewn with wildflowers, with seagulls circling above our heads and views of a lighthouse. It's, of course, the place where Leopold Bloom proposed to Molly at a picnic. I remember the words from the book - that silent monologue of Molly - 25,000 unspoken words, without any punctuation at all. In her soliloquy, she contemplates Bloom's flawed character, their unhappy marriage, her lovers, and a woman's vulnerability. And I will always remember those last words - \"And her heart was going like mad and yes I said yes I will yes\". We go on to visit The Kitchen in the Castle Cookery School, Dublin's most unique cookery school, based in the beautifully restored Georgian kitchens of historic Howth Castle, with gorgeous gardens that are home to a 10m high hedge and the ruins of St Mary's Abbey.\n\nAs evening came, we headed towards the 19th century restaurant The Duke, where actors such as Colm Quilligan host lively literary jaunts that introduce visitors to watering-holes frequented by writers or featured in their works. It's a good place to soak up history. However, that evening there had been an accident and his actors were stranded in traffic, so he doubled up to entertain us. \"There's great history and storytelling and characters in these streets,\" explains Colm Quilligan. \"For example, did you know that 'Baa Baa Black Sheep' was actually a complaint against medieval English taxes on wool?\" He then walked us to the cobblestone quad in Trinity College, and talked about Swift, Beckett, Stoker, Wilde and others - before meandering through more prose.\n\nI left town before the 'icky innards' breakfast on Bloomsday, which includes fried kidneys that Bloom eats for breakfast, but as a vegetarian, that didn't bother me one bit. I had enjoyed the best of the literary festival! Joyce once said that he 'wanted to create a picture of Dublin so detailed that it could be recreated from his book if it were ever destroyed'. It looks like his wish was fulfilled.", "external_links": [], "published": "2015-09-20T03:00:00.000+03:00", "crawled": "2015-09-20T19:14:03.621+03:00", "highlightTitle": ""}