{"organizations": [], "uuid": "f73026bbe7ea2a98dbc4b3d4a85b768ee1588774", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/IMG_6787.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/macau-launches-vietnam-ho-chi-minh-city-flight-service/", "country": "US", "title": "Macau Launches Vietnam Ho Chi Minh City Flight ServiceTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Macau Launches Vietnam Ho Chi Minh City Flight ServiceTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "f73026bbe7ea2a98dbc4b3d4a85b768ee1588774"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/macau-launches-vietnam-ho-chi-minh-city-flight-service/", "ord_in_thread": 0, "title": "Macau Launches Vietnam Ho Chi Minh City Flight ServiceTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Macau Launches Vietnam Ho Chi Minh City Flight Service\nJetstar Pacific Airlines commenced flight service to Ho Chi Minh City on the 22nd September 2015, offering twice weekly schedule service between Macau and Ho Chi Minh City. Ho Chi Minh City is the 3rd direct flight service to Vietnam launched by Jetstar Pacific Airlines after Danang and Haiphong routes. An inaugural flight ceremony was held at the airport with the presence of honorable guests including: Mr. Hoang Chi Trung – Consul General of Socialist Republic of Vietnam to the Hong Kong SAR and Macau SAR, Mr. Simon Chan – President of Macau Civil Aviation Authority, Ms. Cecilia Tse – Deputy Director of Macau Government Tourism Office, Mr. Eric Fong – Director of Marketing Department of Macau International Airport Co., Ltd. (CAM), Mr. Nguyen Tuan Anh – Chief Commercial Officer of Jetstar Pacific Airlines, Mr. Apotter Zhang – Greater China Director of Jetstar Pacific Airlines, Mr. Szeto Kwok Keung, Chief Executive Officer and Mr. Peter Ng, International General Manager of Sunstar Travel Agency (Macau) Co., Ltd.\nMr. Eric Fong of CAM expressed, in pace with Jetstar Pacific Airlines commencing more new flight services to Vietnam, it marked a further step in expanding air transportation between Macau and Vietnam; and along with the expedite growth of travelers, it enhanced closer co-operation between the two places. CAM will continue work together with Jetstar Pacific Airlines, to explore opportunities and strengthen co-operation, and further expands Macau air service networks.\nHo Chi Minh City is the largest city in Vietnam. Being influenced by the former French colonial, the city embraces massive of French architectures, thus also known as “Paris of the Orient”. Along with the economic development, Ho Chi Minh City has become Vietnam’s busiest commercial center, with the development of economic, trade, transportation and cultural centralized in the city. Jetstar Pacific Airlines currently operates double daily flight service from Macau to Danang, and twice weekly service to Haiphong, and they are planning to commence Macau – Okinawa flight service in December this year.\nSource:- Macau International Airport", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T20:38:28.122+03:00", "highlightTitle": ""}