{"organizations": ["Cheng Shin Tyre", "Sony"], "uuid": "ad68c34188386a962a763fffbeb39e1a5f8e1fc7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/what_makes_fosjoas_intelligent_sitting_posture_scooters_k3_so_safe/", "country": "US", "title": "What Makes Fosjoas Intelligent Sitting-posture Scooters K3 So Safe", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "What Makes Fosjoas Intelligent Sitting-posture Scooters K3 So Safe", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T01:52:00.000+03:00", "replies_count": 0, "uuid": "ad68c34188386a962a763fffbeb39e1a5f8e1fc7"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/what_makes_fosjoas_intelligent_sitting_posture_scooters_k3_so_safe/", "ord_in_thread": 0, "title": "What Makes Fosjoas Intelligent Sitting-posture Scooters K3 So Safe", "locations": ["Fosjoas", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What Makes Fosjoas Intelligent Sitting-posture Scooters K3 So Safe Although appearance and convenience of vehicles are important, safety is always put in the first place. As an influential intelligent vehicle, the new Fosjoas electric scooters K3 consider a lot in its safety system. The paper aims to explain what makes Fosjoas K3 so safe? China, 30 September 2015 -- Although appearance and convenience of vehicles are important, safety is always put in the first place. As an influential intelligent vehicle, the new Fosjoas sitting-posture 2-wheeled scooters K3 consider a lot in its safety system. K3 not only continued the intelligent protections of the former models, but also add some new elements. The paper aims to explain what makes Fosjoas K3 so safe?Fosjoas intelligent scooters K3 are equipped with high quality accessories. They use Sony lithium battery, Cheng Shin Tyre, and synthetic resin shells which are made of advanced nano-material. The renowned brands are the insurance of quality. Same as other Fosjoas models, there are three protections in Fosjoas electric scooters K3: speed limit protection, low battery protection and tilting protection. Once the cycling data exceeds the safety value, K3 will send out the buzzing sound to warn users. Owing to the different structure of scooters, Fosjoas industrial designers have applied some pioneering safety elements in K3, such as electronic brake system, hydraulic suspension and automatic turning induction. The electronic control helps the brake system to respond immediately. It is accurate and safe. The design of hydraulic suspension combines with traditional adjustable spring suspension. Even if on the bumpy road, the hydraulic suspension of K3 provides users with comfortable riding experiences. To design automatic turning induction, Fosjoas uses the vehicle international standards as its references. The turning lights of Fosjoas electric scooters K3 are completely automatic. It helps riders to avoid risks during cycling. Moreover, in the batteries group of K3, there are six smart protections: over-discharging protection, over-charging protection, overload protection, short circuit, over-current protection, over-temperature protection. Last but not least, a Fosjoas self-balancing electric scooter K3 has three smart chips inside. When one chip comes into failure mode, the backup chip will be started immediately. So users’ trips with K3 won’t be interrupted. Now users have clearly known why Fosjoas intelligent scooters K3 are so safe. Having trips with K3, users have no need to worry about the safety problems on roads. # # #", "external_links": [], "published": "2015-09-30T01:52:00.000+03:00", "crawled": "2015-09-30T13:51:25.526+03:00", "highlightTitle": ""}