{"organizations": [], "uuid": "f217d64bbb61b4b67345e8e97fa72d639de67680", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28687-outrigger-resorts-and-best-dives-maldives-announce-partnership", "country": "US", "title": "Outrigger Resorts and Best Dives Maldives announce partnership", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Outrigger Resorts and Best Dives Maldives announce partnership", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T17:00:00.000+03:00", "replies_count": 0, "uuid": "f217d64bbb61b4b67345e8e97fa72d639de67680"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28687-outrigger-resorts-and-best-dives-maldives-announce-partnership", "ord_in_thread": 0, "title": "Outrigger Resorts and Best Dives Maldives announce partnership", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Outrigger Resorts and Best Dives Maldives announce partnership Outrigger Resorts and Best Dives Maldives announce partnership Details Category: Hotel   15:00 Marine biologist will join guest snorkeling and scuba trips; coral reef education and habitat conservation will be a key priority The Outrigger Konotta Maldives Resort, which opened on August 1, and Best Dives Maldives, have announced a long-term partnership to provide all water-based activities and tours to guests. Outrigger management chose to partner with Best Dives Maldives due to the company’s commitment to marine life education and conservation, which fits in with Outrigger Resorts’ global coral health and conservation program, OZONE (Outrigger’s zone). \nBest Dives Maldives will function as the resort’s full-time activities and tour provider. It will be responsible for conducting an extensive range of snorkeling, scuba diving, water sports, island discoveries, fishing trips and cultural excursions to nearby islands. A fully qualified marine biologist, Caterina Fattori from Polytechnic University Ancona in Italy, joined the Best Dives team on Konotta Island on September 6. She will participate in Outrigger guests’ snorkel and scuba dive excursions on request. She will give talks and presentations to groups. Her additional role will be to train all Best Dive Maldives tour leaders on marine ecology so that understanding and conservation is part of every sea-going excursion. The marine environment adjacent to the Outrigger Konotta Maldives Resorts is second to none. “Konotta Island and the surrounding area in the Gaafu Dhaalu Atoll in the south of the country offers the biggest and best hard coral fields in the world,” says Eric van Melis, the General Manager of Best Dives Maldives, who has been conducting marine trips in the Maldives since 2003. Van Melis says that Outrigger and Best Dives Maldives will work closely on coral conservation and education. For example, guests can earn PADI Project AWARE specialist certification, for which they don’t need to be a diver. Project AWARE fits in with OZONE and Outrigger’s mission to protect coral reef systems in tropical destinations around the world. Outrigger’s collaboration with Best Dives Maldives complements its existing OZONE partnerships with the National Oceanic and Atmospheric Administration in the US, the Polynesian Voyaging Society, the Pacific Islands Ocean Observing System, the Waikiki Aquarium in Hawaii, Underwater World in Guam, the Mamanuca Environment Society in Fiji, and Reef Conservation in Mauritius. “I’m extremely proud that Outrigger Konotta Maldives Resort is embarking on a joint venture that will ensure both holiday enjoyment and coral reef knowledge for Outrigger guests,” says Bitsy Kelley, a member of the Outrigger owning family and vice president of corporate communications for Outrigger Enterprises Group. “As a lifelong surfer, swimmer and snorkeler, ocean health is near and dear to my heart.” Trevor Bowden, Operations Manager for Best Dives Maldives at the Outrigger Konotta Maldives Resort, says of the local house reef adjacent to the resort: “The marine life around our small island reef is fantastic. We are amazed at the amount of species that we find: white tip and zebra sharks, guitarfish and schools of eagle rays and much more. The corals are in pristine condition and extremely colorful in this part of the archipelago. The house reef has a slight current due to it position within the atoll and is excellent for new diver courses. The water temperature is around 30 Celsius.” Related articles", "external_links": [], "published": "2015-09-08T17:00:00.000+03:00", "crawled": "2015-09-08T17:26:50.003+03:00", "highlightTitle": ""}