{"organizations": [], "uuid": "4c087a255d27e550c7ce01d17f91dced8142bbb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thechronicle.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2014/12/05/55-518927-187070a_fct909x682x48.0_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/ThechroniclecomauTravel", "section_title": "thechronicle.com.au: Travel", "url": "http://www.thechronicle.com.au/news/is-this-lake-the-darling-downs-best-kept-secret/2769550/", "country": "AU", "title": "Is Lake Broadwater the Darling Downs’ best kept secret?", "performance_score": 0, "site": "thechronicle.com.au", "participants_count": 0, "title_full": "Is Lake Broadwater the Darling Downs’ best kept secret?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T17:00:00.000+03:00", "replies_count": 0, "uuid": "4c087a255d27e550c7ce01d17f91dced8142bbb0"}, "author": "", "url": "http://www.thechronicle.com.au/news/is-this-lake-the-darling-downs-best-kept-secret/2769550/", "ord_in_thread": 0, "title": "Is Lake Broadwater the Darling Downs’ best kept secret?", "locations": ["Toowoomba"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Lake Broadwater", "Jan Thomas"], "text": "Is Lake Broadwater the Darling Downs’ best kept secret? Jan Thomas | 10th Sep 2015 5:00 AM   OPINION: AS A relative newbie to Toowoomba I never tire of discovering new places of interest in this great region. \nA few weeks ago I visited Dalby to attend an event for the Dads Read program. \nDads Read was launched by the State Library of Queensland as part of the National Year of Reading in 2012 to promote parents, particularly dads, reading to their young children for at least 10 minutes a day. \nThe impact of this simple and enjoyable routine on child literacy rates has been shown to be profound. \nSo it's a great initiative. \nNeedless to say the Dads Read Fun Day in Dalby was great fun and a great success. \nThe advertising brochure for the event also reminded me of just what a great community resource we have in our state library system - involving a partnership with more than 340 public libraries and some 23 Indigenous Knowledge Centres state-wide. \nThe poster included the great and telling line: \"Of course it's free, it's at the library.\" \nBut the best was still to come as I decided to spend the rest of my weekend exploring Lake Broadwater, just a half hour's drive south-west of Dalby. \nAll I can say is: OMG. What a treasure. \nEverything about the 1200 hectare park that centres on Lake Broadwater is special: the only large naturally occurring freshwater lake on the Darling Downs; a conservation area of uncultivated and ungrazed land amidst one of the most intensively cultivated districts in Queensland; an extremely diverse ecosystem with more than 450 plant species recorded - including many that grow in the lake itself; and - a haven for native animals ranging from eastern grey kangaroos, wallabies and koalas to a diverse range of water birds and some 56 reptiles, including the golden tailed gecko and common death adder that are both listed as near threatened. \nIt's also, of course, a great recreational area for boating, skiing, canoeing, walking, picnicking and bird watching. \nI found it just a lovely place to throw off the pressures of the day and regain a bit of perspective. \nIt's interesting to trace the history of the park to appreciate that its current status as an important public asset was hard won. \nOriginally in private hands, it took much lobbying and negotiation to finally make a small area of the lake permanently accessible to the public in 1931. \nIt was another 50 years before the current park was purchased and gazetted by the Queensland National Parks and Wildlife Service in 1981, finally becoming a Conservation Park in December 1994. \nWe should never take our public assets for granted. \nIt's also interesting to note that in many ways the lake and the land around it have come full circle. \nIn pre-settlement days this was an important area for Aboriginal people. It was an important camping ground and abundant source of food and water for local people. \nLike today, it was a great community resource that all could enjoy. If you haven't visited Lake Broadwater recently, give yourself a treat. lake", "external_links": [], "published": "2015-09-09T17:00:00.000+03:00", "crawled": "2015-09-10T15:32:15.142+03:00", "highlightTitle": ""}