{"organizations": [], "uuid": "45f32cea46de08f0f7266fadb6b475b3b4ad1690", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/zoocv9nvoepoja2uxrun.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-king-of-premieres/", "country": "US", "title": "The king of premieresTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "The king of premieresTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "45f32cea46de08f0f7266fadb6b475b3b4ad1690"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-king-of-premieres/", "ord_in_thread": 0, "title": "The king of premieresTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The king of premieres\nAcademy Award nominee Michael Fassbender and director Justin Kurzel will be among those on the red carpet in Edinburgh for the UK premiere of Macbeth, it has been announced.\nThe screening will take place at Festival Theatre Edinburgh on Sunday 27 September 2015.\nNews of the premiere comes as VisitScotland announces it has joined forces with STUDIOCANAL, the film’s distributors, to promote the country around the new big-screen version of Macbeth, which will be in cinemas nationwide from October 2.\nStarring Michael Fassbender and Academy Award winner Marion Cotillard and directed by Justin Kurzel, the film is being hailed as an outstanding opportunity for Scottish tourism.\nFilmed partly on location on Skye – including the Quairaing, the Fairy Pools and the Old Man of Storr – the release of the movie is also expected to lead to a surge of interest in other areas associated with both the real Scottish king (who reigned from 1040 to 1057) and the character made famous by William Shakespeare’s play.\nLocations associated with the real Macbeth include: Dingwall, where he is thought to have been born;Moray, where he was mormaer (Earl) of Moray, with boundaries stretching much further than what we know as present day Moray; Pitgaveney near Elgin, where he defeated and killed Duncan; Scone, where he was crowned; and Iona, where he is buried.\nShakespeare’s Macbeth, meanwhile, references Cawdor Castle in the Highlands and Glamis Castle in Angus.\nAs well as teaming up with STUDIOCANAL, VisitScotland will also be working with a number of tourism industry partners to deliver a campaign that will include PR and partnership promotions, dedicated Macbeth web pages on visitscotland.com and an online map of Macbeth locations around Scotland.\nSource:-Visit Scotland", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T20:22:31.387+03:00", "highlightTitle": ""}