{"organizations": [], "uuid": "86afdb36523d2c8c7e2a49e2e7a1144cb4ea4115", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "cheeseweb.eu", "main_image": "http://cdn2.cheeseweb.eu/wp-content/uploads/2015/09/Cycling-the-Loire-a-Velo-to-Reserve-Naturelle.jpg", "site_section": "http://feeds.cheeseweb.eu/cheeseweb-eu", "section_title": "Slow Travel in Europe and Beyond | CheeseWeb", "url": "http://cheeseweb.eu/2015/09/cycling-loire-a-velo-reserve-naturelle-de-saint-mesmin-orleans-france/", "country": "US", "title": "Cycling the Loire-a-Velo to Reserve Naturelle de Saint-Mesmin, Orléans, France", "performance_score": 0, "site": "cheeseweb.eu", "participants_count": 1, "title_full": "Cycling the Loire-a-Velo to Reserve Naturelle de Saint-Mesmin, Orléans, France", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T07:46:00.000+03:00", "replies_count": 0, "uuid": "86afdb36523d2c8c7e2a49e2e7a1144cb4ea4115"}, "author": "Andrew", "url": "http://cheeseweb.eu/2015/09/cycling-loire-a-velo-reserve-naturelle-de-saint-mesmin-orleans-france/", "ord_in_thread": 0, "title": "Cycling the Loire-a-Velo to Reserve Naturelle de Saint-Mesmin, Orléans, France", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Close Close   Centre & Loire Valley, France » Cycling the Loire-a-Velo to Reserve Naturelle de Saint-Mesmin, Orléans, France Cycling the Loire-a-Velo to Reserve Naturelle de Saint-Mesmin, Orléans, France By andrew - September 1, 2015 \nThe centre of France is flat – really flat, which makes the Loire-à-Vélo cycle route accessible to people of all ages and skill levels. \nI am a lot of things, but a cyclist I am not. I have great memories of buying my first BMX bike, with birthday money provided by my grandfather. I beat that bike around the country roads for years, until my parents bought me a shiny new mountain bike, with Shimano gears. It was a thing of beauty and I kept it until we moved to Belgium in 2005. At that point, I hadn’t ridden a bike for at least 10 years. \nFast-forward another 10 years and I am in Orléans, France, sitting on what I can only imagine was a seat designed as a torture device during the middle ages. The hard plastic bicycle seat was not exactly comfortable, but many have told me the discomfort disappears if you cycle frequently. Nonetheless, despite my physical discomfort, I was looking forward to getting out on the trails, exploring a new part of France, in a more intimate way. Alison ready to hit the trails. Andrew is ready to go … kung-fu fighting? \nThe Centre region of France is, like Auvergne , an often overlooked part of the country. Centre is mainly flat, agricultural land, covered in wheat and other grains; the bread basket of France. It is not a destination known for spectacular landscapes, like the Alps or the coastline, but it does have winding rivers and golden rolling hills, many dotted with the brilliant red of wild poppies. Its beauty is more subtle and relaxed. \nOne of the best ways to uncover the beauty is to explore the region by bicycle. Knowing this, the local tourism department spent years building up the region’s cycling routes and services to support cyclists. This is why we found ourselves, early one morning, sitting on two bicycles, rented from Detours de Loire , heading out of Orléans, following a path alongside the Loire River. The guys at Detours de Loire were great and made sure the bicycles matched our height (and severe lack of skills). Fortunately, re-learning how to ride a bike was a lot like… errr… riding a bike! Picking up our bikes from the Detours de Loire, in Orléans. \nOur route for the day followed part of the Loire à Vélo route, an immense 800km bicycle route, from Cuffy (near Nevers) to Saint-Brevin-les-Pins (opposite Saint-Nazaire). The itinerary for this route has been developed since 1995, by the regional tourism departments of Centre and Pays de la Loire, and crosses through both regions, following the Loire River. \nThe Loire à Vélo makes up part of the Eurovelo 6 route , a trans-European cycling route starting on the Black Sea. There are also numerous side routes, including Châteaux à Vélo around Blois and Chambord. It is an impressive set of trails which make you want to discover this part of France (and Europe) by bicycle! The route follows the river, is well marked, and scenic. \nWe started our cycle tour in Orléans and headed to the Reserve Naturelle de Saint-Mesmin to meet our guide. The route to the reserve is relatively flat, with lovely views of the river and countryside along the way. The reserve is only a 40 minute cycle from Orléans which was great, since my butt was already starting to hurt! I’m such a pansy. Look! We haven’t fallen over! The cycle paths were easy to follow. \nWe met our guide from the reserve, Damien Hemeray, also on a bicycle, at the park’s entrance. Damien was obviously more comfortable on a bicycle than we were but he adapted to our pace, as we explored the park. Damien shows us the narrow confines of the nature reserve. \nThe reserve, Damien explained, is extremely narrow, in most places only including a few metres on each side of the river. The central idea of the reserve is preservation of the river banks, which are habitats for all sorts of birds, animals, insects, and vegetation. As one of the last ‘wild’ rivers in France, this reserve is an important place for researchers to study the river’s ecosystem and to educate local residents about the importance of preservation. Reserve guide, Damien Hemeray, took us through the park and explained the importance of the park to the river’s ecosystem. \nDamien guided us to a larger section of the park that encompassed an entire point of land, Point de Courpain. This point is formed by the Loiret River flowing into the Loire and is rich in vegetation and wildlife. Point de Courpain is a lovely spot to enjoy a picnic and escape from the city. In the early summer, river plants flower here, carpeting the surface in white. It must be spectacular! \nIt was amazing to think we were only a 40 minute bicycle ride from the bustle of Orléans. The joining of the Loiret and Loire at Point de Courpain. \nWe spent 90 minutes cycling the trails of the park, learning about the wildlife of the river and the mission of the reserve. Although a lot of the work in the reserve is about managing or restoring nature, certain sections of the park have been designated ‘wild’ meaning they are being left alone. The idea is to see what happens naturally, in the ecosystem, when there is no human intervention. \nAs a Canadian, where we have huge wild forests, I find the idea of managing a forest, by not managing, it a bit amusing. However, in Europe, where there are few truly wild forests left, this hands-off approach is unusual. However, we’ve seen this approach yield interesting results elsewhere, when species of plants, which were thought to have disappeared, return and thrive. The Reserve Naturelle de Saint-Mesmin is a beautiful place to explore the nature of the Loire River. \nCycling out of the park, we noticed other trails, making it possible to do a bit of a loop. The paths are well established, mostly flat, and, with water on both sides, you are not going to get lost. The reserve is free to access and we saw lots of people out walking the trails, enjoying some exercise in the forest. If you want to do a tour, free walking tours of the reserve are scheduled, throughout the year, and are listed on their website. \nHopping back on the Loire-à-Vélo, we remarked on how well sign posted the trail is. The route does make use of some minor roads, but the ride was fairly easy, even for inexperienced cyclists. Most of the stages of the Loire-à-Vélo are no more than 40km long, making the route accessible to cyclists of all ages and skill levels. Further, the route is flat, the river only climbing 190m over more than 700km. Andrew cruises home on the Loire-a-Velo cycle path. \nIf you are interested in cycling some (or all) of the Loire-à-Vélo route, Detours de Loire will rent you a bike you can drop off at any of their shops along the route. So you can pick up a bike in Angers and drop it off in Orléans. This makes returning your bicycle one less thing to worry about. With fifteen partners to help with bicycle rentals, lodging, and meals along the way, I am impressed with the amount of thought put into this route. It makes me want to do more, especially if we include some of the chateaux along the way! \nHave you cycled the Loire-à-Vélo? What was your most interesting discovery? Share your experience in the comments below. \nWe’d like to thank the Région Centre-Val de Loire Tourism office for hosting us in the area and Damien Hemeray for the excellent introduction to the nature of the Loire. As always, all opinions are our own.", "external_links": [], "published": "2015-09-01T07:46:00.000+03:00", "crawled": "2015-09-01T16:03:22.920+03:00", "highlightTitle": ""}