{"organizations": ["Blue Sky", "Moben Global Inc."], "uuid": "64a5aad44363e31d63fcc197b52488dec5900135", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/fosjoas_self_balancing_electric_scooters_bring_back_the_blue_sky/", "country": "US", "title": "Fosjoas Self-balancing Electric Scooters Bring Back the Blue Sky", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "Fosjoas Self-balancing Electric Scooters Bring Back the Blue Sky", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T04:18:00.000+03:00", "replies_count": 0, "uuid": "64a5aad44363e31d63fcc197b52488dec5900135"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/fosjoas_self_balancing_electric_scooters_bring_back_the_blue_sky/", "ord_in_thread": 0, "title": "Fosjoas Self-balancing Electric Scooters Bring Back the Blue Sky", "locations": ["China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fosjoas Self-balancing Electric Scooters Bring Back the Blue Sky With the rapid development of modern society, the environment confronts severe challenges. At the same time, resources and environmental bearing capacity faces tremendous pressure. China, 30 September 2015 -- With the rapid development of modern society, the environment confronts severe challenges. At the same time, resources and environmental bearing capacity faces tremendous pressure. The air is becoming dirtier and the sky is getting gray. Fosjoas self-balancing electric scooters are the green and safe vehicles in the intelligent era. One person’s strength is small, thousands of people’s strength is great enough to protect the environment. If Fosjoas intelligent scooters become the main means of transportation, the blue sky will be brought back.Many citizens have advocated green ways of traveling, such as taking public vehicles, riding bike, car pooling and walking. But in fact, there are some objective factors that affect the positive response of citizens. Moben Global Inc. has rolled out several series of Fosjoas self-balancing scooters : single-wheeled V6, twin-wheeled V3, V5 and V8, two-wheeled V9 and U3. These new intelligent vehicles help to reduce the number of motors on the roads. To reduce air pollution, electric scooters can effectively take place of other vehicles. Fosjoas intelligent electric scooters are driven by the green resource, electricity. There is no harm to the environment. Moreover, they’re so small that citizens won’t be afraid of traffic jam when riding them. Users can easily cross the streets with Fosjoas scooters. So, Fosjoas scooters lead more citizens to participate in the team of green trips. Owing to the portability and small size, the scooters must attract more and more citizens. They will be citizens’ first choice of green travel in their low-carbon life. Some environmentalists have taken the lead to use Fosjoas electric scooters as their vehicles in short-distance trips. They all said the new vehicles brought them more convenient and greener lifestyle. As more and more Fosjoas intelligent scooters appear on roads, the sky will be no longer gray. # # #", "external_links": [], "published": "2015-09-30T04:18:00.000+03:00", "crawled": "2015-09-30T13:51:24.085+03:00", "highlightTitle": ""}