{"organizations": [], "uuid": "44413f7252db40f4597c8c5da362af6ab6e1188d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://ww3.hdnux.com/photos/41/20/27/8717822/5/rawImage.jpg", "site_section": "http://www.seattlepi.com/lifestyle/travel/", "section_title": "Travel: Air, Land and Sea Guides and Resources - seattlepi.com", "url": "http://www.seattlepi.com/news/world/article/First-wave-of-cold-weather-hits-migrants-hard-in-6540174.php", "country": "US", "title": "First wave of cold weather hits migrants hard in Balkans", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "First wave of cold weather hits migrants hard in Balkans - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "44413f7252db40f4597c8c5da362af6ab6e1188d"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/world/article/First-wave-of-cold-weather-hits-migrants-hard-in-6540174.php", "ord_in_thread": 0, "title": "First wave of cold weather hits migrants hard in Balkans", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BERKASOVO, Serbia (AP) — Afghan asylum-seeker Asina Ansari stood ankle-deep in mud on the border between Serbia and Croatia, clutching her feverish and shivering 2-year-old son Mohtar in a blanket.\nTheir dream is to reach Sweden, where she has an uncle. But as the teacher from Kabul stood in a cornfield with hundreds of other asylum- seekers waiting for hot soup, that dream seemed far away.\n\"I just want to get somewhere dry and warm,\" she said feebly. \"My boy is sick.\"\nThe journey for Ansari and thousands of asylum-seekers hoping to find sanctuary in rich European Union nations took a turn for the worse this week. The onset of fall weather in the Balkans sent temperatures plummeting and brought relentless rain and biting winds.\nThe weather spread despair among people on long and perilous journeys from war and poverty in the Middle East, Africa and Asia. Aid workers help the exhausted and the frightened, many with small children, like Ansari's boy.\nThe situation will get worse. Temperatures can drop below freezing as soon as November.\n\"The refugees are not used to this,\" said Davor Rako of the U.N. refugee agency. \"They arrive here wearing shorts and no socks, shaking with cold.\"\nRefugees from countries such as Syria, Iraq and Eritrea are used to warmth without sudden weather shifts. The majority passing through the Balkans started their months-long journeys in the summer, unaware it would take so long to reach Western Europe.\nMany have traveled from Turkey to Greece, and then set off on foot, walking north to Macedonia and Serbia. Those with children, in particular, have needed extra time.\nSeveral aid and medical groups were helping this week at Serbia's border with Croatia, offering hot soup and tea, food and water. Volunteers handed out rain ponchos and blankets.\nMore than 87,000 people have entered Croatia from Serbia in the past two weeks, and the flow is not expected to wane, part of a human wave of more than 500,000 so far this year. There are volunteers and aid groups, but they can only do so much.\nJust a few hours spent near the border where migrants were crossing offered a searing snapshot of misery. As they lined up for warm drinks and food, the asylum-seekers blinked in the rain or kept their heads low. Some carried infants on one arm and plastic bags of belongings on the other.\nSyed Ghadeer , a 16-year-old who traveled from Afghanistan, rolled up his trousers to the knees to avoid the mud, treading carefully on his tiptoes.\n\"There is not so much rain in Afghanistan,\" he said.\nA pregnant woman shivered with fever, covering her round belly with her hands and pushing through the crowd to reach a tent with doctors offering help. Children were crying, the tears on their faces mixing with raindrops on their cheeks. Those that cried the hardest had accidentally dropped their stuffed animals in the mud. They had to leave them behind, now too dirty to be carried on.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T22:44:56.867+03:00", "highlightTitle": ""}