{"organizations": [], "uuid": "992bb6a8802843477de44f5201e147b91ad4da49", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://www.independent.co.uk/incoming/article10489388.ece/binary/original/valletta-dooley.jpg", "site_section": "http://www.independent.co.uk/travel/rss", "section_title": "- Travel RSS Feed", "url": "http://www.independent.co.uk/travel/news-and-advice/travel-photography-making-the-most-of-the-golden-hour-10490768.html", "country": "IE", "title": "Travel photography: Making the most of the golden hour - News & Advice - Travel", "performance_score": 1, "site": "independent.co.uk", "participants_count": 1, "title_full": "Travel photography: Making the most of the golden hour - News & Advice - Travel - The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "992bb6a8802843477de44f5201e147b91ad4da49"}, "author": "John Dooley", "url": "http://www.independent.co.uk/travel/news-and-advice/travel-photography-making-the-most-of-the-golden-hour-10490768.html", "ord_in_thread": 0, "title": "Travel photography: Making the most of the golden hour - News & Advice - Travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When visiting exotic destinations it can often be a challenge to reproduce the life-affirming vision before your eyes with your camera. However, being aware of the best time of day to take photographs can improve your odds considerably in your quest to create memorable images.\nSo, when is the best time to take a photograph? Photographers often rhapsodise about the quality of light during the hour after sunrise and the hour before sunset. The golden hour is invaluable for the photo seeker. Also known as the magic hour, this captivating time of day can pay dividends when it comes to improving your outdoor travel photography.\nDuring the golden hour, the colour of the sky turns from red and orange to yellow, producing, as its name suggests, golden tones. The light takes on an almost ethereal quality as the sun moves lower in the sky creating longer shadows, adding texture and depth to images. The resulting diffuse light increases the dynamic range by softening shadows and retaining highlights, while the overall scene is imbued with an appealingly reddish hue that enhances colours.\nJust after sunrise and before sunset the low sun produces more directional light, adding dimension. During this transformative time of the day, landscape subjects, and especially portraits, benefit from the pleasing effects of the golden light.\nTo ensure the images you capture during the golden hour are photographs to be treasured, move quickly and purposefully. The lighting conditions are constantly changing, and you have limited time.\nIf your itinerary allows it, revisit the same spot at different times of day to witness the changing light and decide if sunset or sunrise is preferable in your particular location. Pay attention to your surroundings, and carefully observe the light falling on your scene or subject – natural light is a photographer's best friend. It will make the single biggest difference to your photography, no matter what camera you are using. Set your white balance to cloudy to avoid neutralising the magical light.\nThe term \"golden hour\" is figurative, so you may receive more or less time depending on where in the world you are. To help you plan ahead and make the most of the natural light, consider \"The Photographer's Ephemeris\" ( photoephemeris.com ). This useful app, and indispensable travel companion, calculates the direction of the sun and identifies the optimum time to experience the best lighting conditions at any given location in the world. It is an invaluable tool, helping you discover the exact time of sunrise and sunset.", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T18:37:26.665+03:00", "highlightTitle": ""}