{"organizations": [], "uuid": "7ec293ee1e18b037982e0d7cab9f9bf67592df5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/2/9/w/2/l/image.related.StuffLandscapeSixteenByNine.620x349.174cnz.png/1443150443177.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/travel-troubles/72426527/Selfie-stick-tourists-social-media-obsessions", "country": "AU", "title": "Selfie stick tourists: social-media obsessions", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Selfie stick tourists: social-media obsessions", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T06:07:00.000+03:00", "replies_count": 0, "uuid": "7ec293ee1e18b037982e0d7cab9f9bf67592df5e"}, "author": "Ben Groundwater", "url": "http://www.stuff.co.nz/travel/travel-troubles/72426527/Selfie-stick-tourists-social-media-obsessions", "ord_in_thread": 0, "title": "Selfie stick tourists: social-media obsessions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Selfie stick tourists: social-media obsessions BEN GROUNDWATER Last updated 05:00, September 26 2015 Gregg Briggs \nSelfie sticks have now become the most obvious sign that you are a tourist. \nThe selfie sticks are the most obvious sign. You see them everywhere now, attached to the arms of mugging tourists in museums, at monuments, in national parks, at lookouts and city squares and touristy bars the world over. \nThese \"wands of narcissism\" get a guernsey in some fairly unlikely places. I was in the Bardo​ Museum in Tunisia a few months ago - a place that's home to some of the best preserved Roman mosaics in the world, as well as a destination that's only being visited by pretty hardcore travellers at the moment, given the country's security issues - and watched as a couple walked through the entire museum with selfie stick in hand, pausing at each mosaic to line up a photo in front of it, and then moving right along. \nThey didn't actually look at any of the artworks, just mugged in front of them for the camera mounted on the end of their telescopic metal rod. AFP \nSelfie sticks may soon be banned inside the Louvre, the world's most visited museum. \nThe selfie sticks are the most intrusive sign I've found that travel has changed, that the landscape has shifted when it comes to the way we communicate our experiences of being away from home. The postcard is all but dead, obviously. The letter is a bygone fad. But even emails and blog posts are too time-consuming for the modern-day traveller. We're now in the age of travel for social media. \nAnd social media is not just a product of our travel experiences, either. It's become the very reason for them. \nThose selfie sticks are not just there to augment people's personal collections. The photos they take are designed to be shared, custom-built to be stuck straight on Facebook or Instagram or Snapchat, provided as evidence to show the world what an amazing time is being had by the awesome people whose faces are taking up most of the shots. Standing up for selfie sticks Share your stories, photos and videos. \nSocial media encourages travel for bragging rights, and, particularly among \"Millennials\" - although it's not confined to them - it's taken hold. It's also a phenomenon that hasn't gone unnoticed by those people providing the travel. \nJust as holidaymakers are looking for experiences they can easily capture and share, so the offerings on tours and cruises and any other package journey are being tailored towards social media. It's the same way some restaurants employ food stylists to make their dishes more visually appealing, and thus more likely to be snapped by diners and shared. More shares equals more advertising, so it's worth taking the time to create something pretty. \nSame goes with travel. Operators are creating experiences that are likely to be popular on social media. They're shouting trips for \"influencers\" and professional Instagrammers. Some even prompt clients with a hashtag to put in their captions once their holiday photos inevitably go live – #lame. \nBut that's not the most annoying thing about the sharing generation. The selfie sticks are only a hassle if you're trying to get your own photo and you don't want it to be filled with other people and their cameras. The hashtags are completely up to the user. This phenomenon becomes truly painful, however, when you're travelling with someone who's social media-obsessed. Ad Feedback \nThat's when you get a window into the true craziness of sharing culture, particularly when it comes to travel. Because the perfect travel photo to put on Instagram or Facebook isn't a completely natural shot that you just happened to capture - it's a very carefully curated and painstakingly posed photo that is made to look like a completely natural shot that you just happened to capture. \nAll of a sudden travel becomes the search for the most shareable photo, as you hike up mountains and gaze at lakes and stroll through quaint streets while ensuring that someone is capturing it in a way that makes you look really rugged and adventurous and cool. You're posing with your partner for a million photos to make sure everyone can see how happy you are. Put it on social media and wait for the likes to pour in. \nIt's easy to scoff at this as a habit of the young, but I've seen plenty of hotel foyers packed with people of all ages sharing their day's photos on Facebook, or applying filters for the perfect Instagram post. There are kids doing it, but their parents are getting involved as well. We're all guilty, to varying degrees. \nMaybe you could liken this to the modern-day equivalent of keeping a travel diary, but at least that was personal. Sharing culture becomes a bit strange when you realise that all of these things you're doing while on holidays are in the hope of impressing other people who aren't even there. \nThe selfie sticks aren't the problem, it seems. It's what we're doing with them.", "external_links": [], "published": "2015-09-25T06:07:00.000+03:00", "crawled": "2015-09-25T21:28:54.235+03:00", "highlightTitle": ""}