{"organizations": [], "uuid": "0501f384beab251e62b595ee608013352db98378", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30116786/autoalert-study-highlights-risk-to-future-vehicle-saar-growth-without-shortening-the-trade-cycle", "country": "US", "title": "AutoAlert Study Highlights Risk to Future Vehicle SAAR Growth without Shortening the Trade Cycle", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "AutoAlert Study Highlights Risk to Future Vehicle SAAR Growth without Shortening the Trade Cycle - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "0501f384beab251e62b595ee608013352db98378"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30116786/autoalert-study-highlights-risk-to-future-vehicle-saar-growth-without-shortening-the-trade-cycle", "ord_in_thread": 0, "title": "AutoAlert Study Highlights Risk to Future Vehicle SAAR Growth without Shortening the Trade Cycle", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " AutoAlert\nNew data from IHS finds length of U.S. vehicle ownership hits another record high\nIRVINE, Calif. , Sept. 25, According to the latest U.S. vehicle registration data analysis by global market intelligence firm IHS, length of vehicle ownership continues to increase, hitting another all-time high average of 67.9 months – nearly 78 months for new vehicles and 63 months for used vehicles. This is more than a two year length of ownership increase for all vehicles since 2006.\n\"How long a consumer holds on to their vehicle has a direct impact on the SAAR and is a key performance indicator of the overall health of the auto industry,\" said AutoAlert CEO Brian Skutta . \"To put this in context, the lengthening ownership lifecycle is resulting in consumers buying fewer vehicles over their lifetime giving dealers fewer opportunities to sell them cars if you wait for them to come to you.\"\nIn order to gain direct insight from consumers, AutoAlert conducted an online study surveying over 400 vehicle owners to better understand why consumers are holding on to their vehicles for longer periods.\nSome key findings from the AutoAlert Study are:\n75% of consumers would be very likely or somewhat likely to trade-in their vehicle today if their monthly payment would remain about the same 49% of survey respondents were not aware they were able to upgrade their current vehicle before their loan or lease is at end-of-term Regardless of how long consumers have owned their current vehicle, 63% of them would like to upgrade their vehicles every three years or less Dealerships that keep their service customers coming back are smart because 57% are very likely or somewhat likely to purchase a new car from the dealership where they service their car 69% of consumer respondents felt it was very important or somewhat important for the place they bought their vehicle to proactively notify them when they are in a position to upgrade their vehicle if it doesn't impact their monthly car payment More than half of consumers want to be notified about key points in their ownership lifecycle (e.g. warranty is expiring, trade-in value is about to decrease rapidly, before incurring mileage overages on lease, end of contract). The three highest motivating factors to buy or lease a new vehicle were: 83% Better fuel-efficiency 68% Too many repairs to be made on current vehicle 65% Additional safety features \"Dealerships find better stewardship of their customer records through data mining, empowering them to disrupt longer trade cycles down to an average of 36 months - a dramatic increase in trade-cycle velocity,\" Skutta said. \"This type of data-driven engagement with consumers is where dealerships are finding a great return on investment.\"\nAs a leader in data mining and trade-cycle management, AutoAlert is sharing some of its study findings to inform the automotive industry about why consumers are holding on to their vehicles for longer periods and to better equip dealers on how to increase sales.\nDownload the white paper to learn more about how your dealership or manufacturer can shorten the trade cycle at www.autoalert.com/tradecycle .\nAbout the Study\nAutoAlert conducted an online survey with Survey Sampling International of over 400 vehicle owners in September 2015. The purpose of the study was to:\nUnderstand why consumers are holding on to their vehicles for longer periods Determine what motivates consumers to trade-in their vehicle Measure consumer awareness on their ability to trade-in to a new car before contract end Learn how consumers want to be notified when they are able to upgrade to a newer vehicle Evaluate what services would increase customer retention Analyze differences in responses between generations, gender, length of ownership and location Survey participants were vehicle owners. Out of the over 400 participants, 35% were Millennials, 31% were Gen X and 34% were Baby Boomers.\nAbout AutoAlert\nAutoAlert is the automotive industry's leading data mining and trade-cycle management platform helping dealerships identify high-quality sales opportunities, increase gross margin and improve customer retention. With AutoAlert, dealerships build long-term client relationships that compound sales, provide better customer service, and make more informed marketing decisions. Founded in 2002, AutoAlert pioneered the equity-mining campaign and a new client engagement methodology through innovative software, marketing and training solutions.\nMedia Contact\nNathan Warner\nDirector of Marketing\n949-398-7008\nNathan@autoalert.com\nPhoto - http://photos.prnewswire.com/prnh/20150925/270882-INFO\nLogo - http://photos.prnewswire.com/prnh/20150119/169985LOGO\n releases/autoalert-study-highlights-risk-to-future-vehicle-saar-growth-without-shortening-the-trade-cycle-300149232.html\n ", "external_links": ["http://photos.prnewswire.com/prnvar/20150119/169985LOGO", "http://www.prnewswire.com/news-releases/autoalert-study-highlights-risk-to-future-vehicle-saar-growth-without-shortening-the-trade-cycle-300149232.html", "https://photos.prnewswire.com/prnvar/20150925/270882-INFO", "http://photos.prnewswire.com/prnh/20150119/169985LOGO", "http://photos.prnewswire.com/prnh/20150925/270882-INFO", "http://www.xmlnews.org/ns/", "http://www.autoalert.com/tradecycle", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG12137&Transmission_Id=201509251209PR_NEWS_USPR_____CG12137&DateId=20150925"], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T20:16:57.861+03:00", "highlightTitle": ""}