{"organizations": [], "uuid": "48168a0943bef1a0b9e402b9295a6bc4d607d8e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63393/superb-education-and-networking-opportunities-imex-america-2015", "country": "US", "title": "Superb education and networking opportunities at IMEX America 2015", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Superb education and networking opportunities at IMEX America 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T22:28:00.000+03:00", "replies_count": 0, "uuid": "48168a0943bef1a0b9e402b9295a6bc4d607d8e8"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63393/superb-education-and-networking-opportunities-imex-america-2015", "ord_in_thread": 0, "title": "Superb education and networking opportunities at IMEX America 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Superb education and networking opportunities at IMEX America 2015   \nSep 04, 2015 eTN   \nIncreasing revenues, designing better meetings and using mobile technologies in meetings are among the engaging subjects to be explored at Association Focus, a key part of IMEX America’s Smart Monday education program on October 12, 2015 in Las Vegas. \nThis special educational event, designed by IMEX together with ASAE and ICCA, is packed with fascinating discussions and insightful presentations led by an inspiring group of engaging speakers including industry professionals and independent specialists. \nTaking place at the Venetian®| The Palazzo® Congress Center, the free event is exclusively for association executives. More than 180 association professionals from over 15 countries are expected to attend. \nThe day will be packed with motivating sessions where delegates can boost their knowledge and gather valuable insights and advice from peers and experts that will be helpful both in running associations as well as their events. The event also offers superb opportunities for association executives to network with peers and experts from across the globe. \nAfter a networking lunch, delegates will first have a choice of three tracks. The ICCA session is “What’s Your Story?” Led by Betsy Bair of Penton Media, Lisa Astorga, CMP of the International Society of Thrombosis and Haemostasis and Martin Sirk, CEO of ICCA, it starts from the premise that every association meeting is a chance to tell a great story - so how can associations make the most of these stories and opportunities? \nAt the same time, Willis Turner, CEO of Sales & Marketing Executives International Inc and Shelly Alcorn, Principal of Alcorn Associates will explore the potential role and opportunities to use gaming to increase loyalty and engagement. \nDedicated Executive Track \nThe dedicated ASAE Executive Track will open with “The Journey to Great Governance,” presented by Susan Robertson, CAE, Executive Vice President, ASAE, highlighting best practice in how non-profit boards of directors can fulfil their roles in living up to public and stakeholder expectations. This will be followed by Amy Hissrich, VP Web Strategies & Communications at ASAE explaining how mobile technologies can be used to maximise results from meetings. \nMeanwhile delegates can also choose to learn about increasing non-due revenues in international markets from Faris Abouhamad of the International Advertising Association and Steen Jakobsen of Dubai Business Events. Alternatively, they can hear from John Folks and Katie Callahan-Giobbi of Mindingyourbusiness on measuring the attendee experience - and how different approaches can help to design a better meeting. \nA packed day of education will be followed by a superb social event - Association Evening - which will feature Cocktails and Canapés at the stunning “indoor-outdoor” Foxtail Nightclub, SLS Las Vegas; a fantastic opportunity to network with peers and invited exhibitors in a relaxed environment. \nCarina Bauer, CEO of the IMEX Group says: “Association Focus is a unique event in North America – bringing together association executives from around the US and the world to network and learn with each other in a private environment. We work hard with the market to ensure that the education sessions are highly relevant and delivered by first class educators. The Association Evening is a great culmination to the day and we are excited this year to be at a beautiful new poolside venue – it promises to be spectacular.” \nFor more details about IMEX America’s Association Focus and Evening and to register http://www.imexamerica.com/events/education/association-focus/ \nPlease click here to download the Association Focus & Evening Brochure and to apply: http://tinyurl.com/onsp7t9 \nTo attend Association Focus, delegates must first be registered as either a Hosted Buyer or a Visitor for the IMEX America trade show taking place on 13 – 15th October at Sands Expo® and The Venetian®| The Palazzo® Las Vegas. The Association Evening is also open to exhibitors who are members of one of the supporting industry associations – ICCA, ASAE, AIPC, IAEE, IACC, DMAI, PCMA, IAPCO. More information on the evening can be found at: http://www.imexamerica.com/events/networking-events/association-evening/ \nThe education providers for Association Focus are ASAE and ICCA. SLS Las Vegas is the evening host sponsor. \neTN is a media partner for IMEX America.", "external_links": [], "published": "2015-09-04T22:28:00.000+03:00", "crawled": "2015-09-04T22:51:27.006+03:00", "highlightTitle": ""}