{"organizations": [], "uuid": "bc5647e3f2e90a073b33661f07b59e12968b4eb0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150904161636-japan-hiroshima-cat-map-03-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss\r", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/09/04/asia/japan-hiroshima-cat-map/index.html", "country": "US", "title": "In Japan there's now a 'Street View' for cats", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "In Japan there's now a 'Street View' for cats", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T14:25:00.000+03:00", "replies_count": 0, "uuid": "bc5647e3f2e90a073b33661f07b59e12968b4eb0"}, "author": "barry.neild", "url": "http://edition.cnn.com/2015/09/04/asia/japan-hiroshima-cat-map/index.html", "ord_in_thread": 0, "title": "In Japan there's now a 'Street View' for cats", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> New map lets you wander Hiroshima from a cat's perspective By Yoko Wakatsuki, CNN and Elaine Yu , for CNN Updated 1204 GMT (1904 HKT) September 4, 2015 Hiroshima has created a map simulating the perspective of cats. Story highlights Hiroshima creates map styled after Google Street View -- for cats Inspiration comes from cats' intimate knowledge of town's hidden spots Tokyo (CNN) It almost feels like a Haruki Murakami novel: A new tool lets you experience a Japanese town from a cat's eye-view, and even hang out with the neighborhood cats. The online map , unveiled this week by the Hiroshima tourism board, claims to be the world's first based on a cat's purr-spective -- whether or not they need such human inventions. Lala, a cat and newly minted \"Manager of Backstreet Tourism\" of Hiroshima, leads you through the main shopping arcade and narrow backstreets of the prefecture's small port city, Onomichi, allowing you to imagine life through her Peridot-like eyes and fluffy paws. You can even hang out with the neighborhood cats, who lick their paws placidly as you -- a virtual cat -- approach. And of course, you can find Google Map-style snapshots on the map that capture the scenes of daily life in Onomichi, as seen from three inches above the ground. \"Cats are everywhere here, and they know best the charms of this town, including the small backstreets. That's how we came up with the idea,\" Hideki Yoshino from Hiroshima Prefecture's tourism department told CNN. Cat-ographer Lala also provides tips on every page of the map about the tourist attractions of her choice. The hope is that the map can introduce tourists and cat lovers alike to the city's more intimate parts privy to small, four-pawed creatures. The map is dotted with icons that contain the biography of other cat residents. More cat maps on the way Hiroshima tourism officials tell CNN they have been surprised by the attention they've gotten for the map, and are mulling possibilities to create similar guides for other cities. But first, the prefecture plans to add two more routes on the map in October. After all, says Yoshino, Hiroshima has many port towns known for ubiquitous feline populations, thanks to the abundance of fish caught in the area. JUST WATCHED", "external_links": [], "published": "2015-09-04T14:25:00.000+03:00", "crawled": "2015-09-04T14:54:50.290+03:00", "highlightTitle": ""}