{"organizations": [], "uuid": "f1dc1db841f90cb51bf1145e1ceed550117f8e25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63502/tram-experience-eat-brussels-drink-bordeaux", "country": "US", "title": "The Tram Experience at Eat! Brussels, Drink! Bordeaux", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "The Tram Experience at Eat! Brussels, Drink! Bordeaux", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T16:09:00.000+03:00", "replies_count": 0, "uuid": "f1dc1db841f90cb51bf1145e1ceed550117f8e25"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/63502/tram-experience-eat-brussels-drink-bordeaux", "ord_in_thread": 0, "title": "The Tram Experience at Eat! Brussels, Drink! Bordeaux", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Tram Experience at Eat! Brussels, Drink! Bordeaux Original, timely global, travel, tourism, business news and research: \nSep 08, 2015 eTN Exclusive: Unique and original, timely, global breaking news: \nAlongside the Brussels restaurants and Bordeaux wine pavilions at eat! BRUSSELS, drink! BORDEAUX, running from 10 through 13 September in the Parc de Bruxelles/Warandepark, the Tram Experience also offers its share of culinary delights. In fact, guests will find dishes from Giovanni Bruno of Senzanome on the Tram Experience menu. He will be on hand for the Saturday noon and Sunday seatings. \nThe Tram Experience is a tram outfitted as a restaurant on wheels that tours Brussels all year round and offers a gourmet journey through the city by serving a menu designed by a great chef every evening. This gourmet concept is back on the festival schedule again this year at the eat! BRUSSELS, drink! BORDEAUX festival. The menu for this edition will be designed by Senzanome's own Brussels chef Giovanni Bruno. He figures prominently among those chefs who have made prior Tram Experience seasons such a success. His cooking is influenced by his native Sicily and shows what a big part international flavours play in the gourmet cuisine of Brussels. \nAt eat! BRUSSELS, drink! BORDEAUX, the chef offers two two-course menus in which he will incorporate the produce of his native region in his unique style. This will also be an opportunity to (re)discover his contemporary cuisine since his restaurant moved to Petit Sablon/Kleine Zavel, just a stone's throw from the festival. \neat! BRUSSELS, drink! BORDEAUX, it will be held: - From 10 through 13 September 2015 in the Parc de Bruxelles/Warandepark - Thursday, Friday, and Saturday from 12 PM to 11 PM and Sunday from 12 PM to 8 PM - 18 Brussels restaurants and six Bordeaux wine pavilions - 10 partner regions - Mmmmh! cooking classes Bordeaux Wine School workshops - A Brussels village, an artisans' village, and gourmet counters", "external_links": [], "published": "2015-09-08T16:09:00.000+03:00", "crawled": "2015-09-08T18:49:14.867+03:00", "highlightTitle": ""}