{"organizations": ["Greenpeace"], "uuid": "061e198f920531a326ede2b80cba32e4c44a6060", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/c063944d-53d1-45b8-b188-a47afce54e68.img", "site_section": "http://www.ft.com/rss/companies/travel-leisure", "section_title": "Travel & Leisure", "url": "http://www.ft.com/cms/s/0/ad0b80e6-55a8-11e5-9846-de406ccb37f2.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "country": "US", "title": "Greenpeace slams outdoor clothing makers", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Greenpeace slams outdoor clothing makers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T07:51:00.000+03:00", "replies_count": 0, "uuid": "061e198f920531a326ede2b80cba32e4c44a6060"}, "author": "", "url": "http://www.ft.com/cms/s/0/ad0b80e6-55a8-11e5-9846-de406ccb37f2.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Greenpeace slams outdoor clothing makers", "locations": ["New York", "Rome"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Shannon Bond", "James Politi"], "text": "Greenpeace slams outdoor clothing makers James Politi in Rome and Shannon Bond in New York ©Bloomberg \nGreenpeace, the international environmental group, is challenging the green credentials of outdoor clothing makers including The North Face, Columbia and Patagonia, accusing them of failing to eliminate toxic chemicals in their products. \nThe attack by Greenpeace came after its scientists this year found traces of perfluorinated chemicals (PFCs) in the waters of high-altitude lakes around the world, including the Lago di Pilato in the Apennine mountain range of central Italy. More China grocery sales set to increase \nGreenpeace said its study — released on Tuesday — proved how slowly the environment breaks down these chemicals, which outdoor clothing makers routinely use in their waterproof gear. \n”It is ironic to think that companies who depend on nature for their business willingly release dangerous chemicals into the environment,” said Mirjam Kopp, toxics campaigner for Greenpeace. “They need to set short-term deadlines for completely eliminating the entire group of PFCs in production processes,” she added. \nGreenpeace said Puma and Adidas have already adopted “ambitious elimination targets” for PFCs and some companies have “entire collections “of PFC-free waterproof clothing. But it took aim at The North Face, Columbia, Patagonia, Salewa and Mammut for showing “little sense of responsibility when it comes to eliminating hazardous chemicals such as PFCs”. \nGreenpeace criticism could be especially problematic since outdoor apparel companies go to great lengths to appear environmentally friendly. In their catalogues, advertisements and social media channels, they use stunning pictures of pristine landscapes and often include messages of conservation and calls for environmental action. \nPatagonia in particular has made environmentalism a core part of its marketing efforts, touting its use of recycled and ethically-sourced materials and its involvement in creating a national park in Chile. \nThe company is a B corporation , meaning it includes social and environmental performance alongside its financial goals. Two years ago it started a venture fund, $20 Million and Change, to invest in socially and environmentally responsible start-ups. \nLike other outdoor apparel companies it has been phasing out its use of waterproof finishes that create toxic byproducts. Patagonia said it has switched from “long-chain” PFCs to “shorter-chain” PFCs, whose byproducts “break down faster in the environment and with less potential toxicity over time to humans, wildlife and fish.” But Greenpeace said it had found traces of shorter-chain PFCs — as well as long-chain PFCs — in its study of remote areas. It is ironic to think that companies who depend on nature for their business willingly release dangerous chemicals into the environment \n- Mirjam Kopp, Greenpeace \nPatagonia acknowledged this was a “temporary solution” that “is not good enough, but it’s the best option we have found so far”. \nIn April, its venture capital unit invested $1m in a Swiss start-up that is developing new waterproofing techniques based on natural materials that could one day replace petrochemical-based finishes. \nPatagonia said: “Overall, we’ve set the most stringent requirements in the industry to make sure our materials do not pose a safety risk to our customers as a result of chemicals they contain.” \nColumbia Sportswear said: “We are aware of Greenpeace’s effort, but have yet to see a copy of the report, so are unable to make any specific comments”. \nMeanwhile, The North Face said its “commitment to cleaner chemistry” was a “journey”. \n“We continue to make strides in this space — reducing the potential impact of PFC treatments in all of our products and in some cases, eliminating them entirely where we have identified high-performance, sustainable alternatives,” it said. Related Topics Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-09-08T07:51:00.000+03:00", "crawled": "2015-09-08T18:44:23.516+03:00", "highlightTitle": ""}