{"organizations": [], "uuid": "b4e1eefd60c5d8257e95eccc27ea1a1403a62f76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/9/f0e24f16-2afd-4a1d-b038-1bebb9ff1992MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Travel", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/travel/insider-s-guide-there-is-more-to-lalbaug-than-lalbaugcha-raja/article1-1387509.aspx", "country": "US", "title": "Insider's Guide: There is more to Lalbaug than Lalbaugcha Raja", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Insider's Guide: There is more to Lalbaug than Lalbaugcha Raja", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T18:51:00.000+03:00", "replies_count": 0, "uuid": "b4e1eefd60c5d8257e95eccc27ea1a1403a62f76"}, "author": "", "url": "http://www.hindustantimes.com/travel/insider-s-guide-there-is-more-to-lalbaug-than-lalbaugcha-raja/article1-1387509.aspx", "ord_in_thread": 0, "title": "Insider's Guide: There is more to Lalbaug than Lalbaugcha Raja", "locations": ["Lalbaug"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "| Updated: Sep 04, 2015 21:39 IST An artisan giving finishing touches to a Ganesh idol at a workshop in Lalbaug. (Kalpak Pathak/HT photo) \nIt’s that time of the year when Lalbaug comes alive. Ganesh Chaturthi (on September 17) is almost here and preparations for the festival are underway. While the Lalbaugcha Raja idol (known as the Navsacha Ganpati, meaning ‘one who fulfils all wishes’) is being crafted on-site, the area’s other Ganesh shalas (workshops) too are busy putting finishing touches to numerous idols. Originally part of Girangaon (village of mills), the neighbourhoods of Byculla, Lalbaug, Parel and Worli were home to workers employed at the 130 textile mills located in the 600 acre area. \nWithin its narrow gullies lie other markers of Lalbaug’s past. Visit them before the swarms of devotees descend. \n* The dargah of 14th century saint Syed Hazrat Lal Shah Baj Kalunder or Lal Shah Sahib, at Tawaripada, is believed to have given the area the name ‘Lalbaug’. \n* The Parsi colony of Nowroz Baug is built in the memory of shipbuilder Loeji Nusserwanjee Wadia. An alternate theory of how Lalbaug got its name is attributed to this site. Pestonji Wadia built himself a country home called Lal Baug. The house distinguished the neighbourhood from the rest of Parel and houses Nowroz Baug today. \n* The Lalbaugcha Raja Sarvajanik Ganeshotsav Mandal is one of the oldest in Mumbai. The idol of Lalbaugcha Raja is made on-site annually by Kambli Arts. While you cannot view the idol till Ganesh Chaturthi, the stone represents the idol till it is unveiled. A pundit worships it before the making of the idol begins. \n* Bharatmata Cinema is one of the few theatres in Mumbai that screen Marathi movies through the year. It was meant to be an entertainment hub for British officers of the then David Sassoon Mill. It was established in 1936. In 2012, it underwent digitisation. \nDid you know? * While the Ganesh idols are made across Mumbai and Raigad, they are brought to the Ganesh shalas (workshops) in the Ganesh Talkies lane for finishing touches. \n* The Ganesh galli pandal or Mumbaicha Raja, among the oldest pandals in the city, is known for its innovative décor. Last year, their pandal was the replica of the Jejuri temple. \n\n* Hanuman Theatre was famous for its tamasha shows. The premises is now occupied by a paraphernalia shop but you can spot the Mari Aai temple in the compound, dedicated to a tamasha artiste. \n* Located adjacent to Hanuman Theatre is Lal Shah Sahib’s younger brother Pir Chand Shah Sahib’s dargah. Historians believe it to be the oldest dargah in Mumbai. Its structure was destroyed during the 1992 riots, but it was reconstructed in 1993 by the Hindu caretaker family. \n* Lalbaug is home to the Chiwda galli, a spice market (the renowned Khamkar spice shop is here) and Ladu Samrat, a restaurant known for Maharashtrian delicacies like Thalipeeth. \n(With inputs from Beyond Bombay Tours) \n(HT Photos: Kalpak Pathak; File photo) \n(The writer tweets as @SomaRKDas ) Tags", "external_links": [], "published": "2015-09-04T18:51:00.000+03:00", "crawled": "2015-09-04T19:29:34.780+03:00", "highlightTitle": ""}