{"organizations": [], "uuid": "e425e48e4c38603474a1ebce7758c03e668e0f01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/09/Tourism-Australia.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-global-agency-pr-panel-appointed-by-tourism-australia/", "country": "US", "title": "New global agency PR panel appointed by Tourism Australia - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "New global agency PR panel appointed by Tourism Australia - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "e425e48e4c38603474a1ebce7758c03e668e0f01"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-global-agency-pr-panel-appointed-by-tourism-australia/", "ord_in_thread": 0, "title": "New global agency PR panel appointed by Tourism Australia - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New global agency PR panel appointed by Tourism Australia Published on : Monday, September 14, 2015\nTourism Australia has announced the appointment of a new global agency panel that will provide specialist PR support to its existing in-house teams in a dozen of its key overseas markets.\nThe panel will provide support in Brazil, Canada, China and Hong Kong, India, Japan, Korea, New Zealand, Malaysia, Singapore, the UK and US, as well to the Business Events team based in Tourism Australia’s Sydney head office.\nThe agencies who have been appointed to the global panel are:\nCountry Agency Brazil Edelman, Interamerican Canada Citizen, Ketchum China EBA Communications, Ogilvy Public Relations, Weber Shandwick Hong Kong Sinclair India Avian Media, Weber Shandwick Japan Full house, Milepost Malaysia Bell Pottinger, Ogilvy Public Relations Singapore ALSOKNOWNAS Pt Ltd, Weber Shandwick South Korea Edelman, Weber Shandwick UK 3 Monkeys, Good Relations, The Red Consultancy USA Ace, Citizen, Finn, Ketchum, Weber Shandwick Business Events Ogilvy Public Relations, Red Agency\nThe decision to move towards a panel model follows a global review aimed at ensuring that Tourism Australia’s international markets have access to the best available public relations services across a broad range of requirements.\nThe agency panel will provide support across strategy, media and stakeholder relations, influencer programs, content generation and publishing, social media, brand and reputation (including crisis) management, and ad hoc projects including event/campaign management.\nAll agencies were selected through a competitive tendering process and will provide Tourism Australia access to their services over the next three to five years, if required, on a project-by-project and market-by-market basis.\nOnly those markets where the existing PR agency contract arrangements were coming to an end in 2015 were included in the tender process. Germany, France, Italy and Indonesia were excluded as existing agency arrangements are in place within those markets until 2016 and/or 2017.", "external_links": [], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T14:24:50.182+03:00", "highlightTitle": ""}