{"organizations": ["EU", "Davies Commission"], "uuid": "d1a630b579118f68c2d3c033447ba5228db3f53f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "news.scoopasia.com", "main_image": "", "site_section": "http://scoopasia.com/index.php/syndication/news/C3/", "section_title": "Press Releases - Automotive & Travel", "url": "http://news.scoopasia.com/index.php/news/august_2015_is_gatwicks_busiest_month_to_date/", "country": "US", "title": "August 2015 is Gatwick's Busiest Month to Date", "performance_score": 0, "site": "scoopasia.com", "participants_count": 0, "title_full": "August 2015 is Gatwick's Busiest Month to Date", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T00:03:00.000+03:00", "replies_count": 0, "uuid": "d1a630b579118f68c2d3c033447ba5228db3f53f"}, "author": "", "url": "http://news.scoopasia.com/index.php/news/august_2015_is_gatwicks_busiest_month_to_date/", "ord_in_thread": 0, "title": "August 2015 is Gatwick's Busiest Month to Date", "locations": ["France", "Gatwick Airport", "Heathrow", "Spain", "Gatwick", "Europe", "London Gatwick", "London Gatwick Airport"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "August 2015 is Gatwick's Busiest Month to Date In August, 4.53 million passengers passed through London Gatwick airport, making it the busiest month since the airport’s founding. The implications for the airport and surrounding areas are far-reaching. Spain, 24 September 2015 -- After a solid two-and-a-half years of growth, London Gatwick Airport has recorded its busiest ever month. Around 4.53 million passengers used the airport this August, bringing the airport within spitting distance of the 40 million mark (which it was originally projected to reach in 2024). More traffic in the airport means more traffic on both land and air, and airlines, airport shuttle companies, taxi services and parking space providers are feeling the upsurge in Gatwick’s business through their own increasing customer numbers. Heathrow versus Gatwick With the final decision on the proposed extra runway looming, Gatwick Airport officials are pressing for it to be built there instead of at Heathrow, pointing to their figures of growth as supporting evidence for their case. Other reasons given for building the new runway at Gatwick include the information that fewer home demolitions would be required, no public funding would be needed, fewer people would be affected by noise and the fact that Heathrow’s air quality is already far in excess of EU guidelines. The Davies Commission, however, has recommended that Heathrow play host to the new runway, meaning that the debate is far from settled. Gatwick Also Boosting Business on Land Meanwhile, the airport’s growth has brought with it increased business for not only airlines, but also transport firms, such as airport transfer specialists Shuttle Direct , who carry passengers to and from airports, as well as between them. Such services are popular due to the convenience of pre-booked transport, as well as being able to avoid parking or car rental issues. Recently, an increasing number of travellers have also been making use of Uber, which allows passengers to hire a driver directly, often at a lower cost. However, Uber has been criticised for dodging the administrative costs that established companies like Shuttle Direct are required to pay, and has also encountered legal difficulties, being banned outright in France. It is clear that, as more and more passengers are passing through London Gatwick, the need for transit and airport transfer solutions increases as well, and companies like Shuttle Direct will no doubt be watching with interest. # # # About Shuttle Direct: Shuttle Direct operate safe, reliable and affordable shared or private taxi shuttle services from airports to cities, hotels and ski resorts across Europe. Contact them at http://www.shuttledirect.com/en/php/airport_shuttle_direct.php . Media Contacts:", "external_links": [], "published": "2015-09-24T00:03:00.000+03:00", "crawled": "2015-09-24T10:26:56.121+03:00", "highlightTitle": ""}