{"organizations": [], "uuid": "ba365e3965e7dba61614bd204926723911585f29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/11/Abu-Dhabi’s-Tourism-Culture-Authority-logo-300x128.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/abu-dhabi-target-morocco-for-tourism/", "country": "US", "title": "Abu Dhabi Target Morocco For Tourism - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Abu Dhabi Target Morocco For Tourism - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "ba365e3965e7dba61614bd204926723911585f29"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/abu-dhabi-target-morocco-for-tourism/", "ord_in_thread": 0, "title": "Abu Dhabi Target Morocco For Tourism - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Abu Dhabi Target Morocco For Tourism Published on : Monday, August 31, 2015\nAbu Dhabi has the potential to become a leading tourism destination from Morocco according to a delegation of travel industry leaders on a recent turbo-charged trip to the emirate. Citing a combination of first-class infrastructure, top-class accommodation, an extensive array of attractions for the family and impressive air access, the influential Moroccan operators believe the emirate can gain a larger slice of outbound travel from the country.\nThe 10-strong trade delegation – guests of Abu Dhabi Tourism & Culture Authority (TCA Abu Dhabi) and Etihad Airways – visited many of the emirate’s top attractions on their four-day visit, including the Sheikh Zayed Grand Mosque and Yas Island – the emirate’s entertainment destination – for first-hand experiences of the world’s largest indoor theme park Ferrari World Abu Dhabi, the award-winning Yas Waterworld, the iconic Yas Viceroy Abu Dhabi, the only hotel in the world to straddle a formula one race track and Yas Mall, the emirate’s latest shopping destination – the second largest retail nexus in the UAE. “We have seen year-on-year hotel guest arrivals growth from Morocco of 40%, putting the country in the top four of overseas markets showing the strongest growth,” said Mubarak Al Nuaimi, Director of Promotions & Overseas Offices, TCA Abu Dhabi.\n“Only China, Oman and Switzerland improved more than Morocco. “This performance persuaded us to stage an inbound familiarisation trip for the Moroccan travel trade who will help us convert further business from the country. We hope the sheer range of world-class attractions and top-level accommodation will leave a hugely positive impression.”\nThe delegation also explored some of the UAE capital’s other delights including Emirates Palace, Jumeirah at Etihad Towers and The Marriot Hotel as well as the World Trade Centre development. The group also visited what will be the emirates’ cultural centre – Saadiyat Island, where they took in Manarat Al Saadiyat, The St. Regis Saadiyat Island as well as the Corniche Breakwater’s Heritage Village.\nSource:- Abu Dhabi Tourism", "external_links": [], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-09-01T00:09:08.939+03:00", "highlightTitle": ""}