{"organizations": [], "uuid": "5eec6342b1d50e21b14618810be2047af58f09f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.myrtlebeachonline.com", "main_image": "http://www.myrtlebeachonline.com/static/images/myrtlebeachonline/facebook.jpg", "site_section": "http://www.myrtlebeachonline.com/living/travel/?widgetName=rssfeed&widgetContentId=712015&getXmlFeed=true", "section_title": "Travel News & Reviews | MyrtleBeachOnline.com &", "url": "http://www.myrtlebeachonline.com/living/travel/article35172636.html", "country": "US", "title": "Are tourists harming whale sharks off the Yucatan coast?", "performance_score": 0, "site": "myrtlebeachonline.com", "participants_count": 1, "title_full": "Are tourists harming whale sharks off the Yucatan coast?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T11:00:00.000+03:00", "replies_count": 0, "uuid": "5eec6342b1d50e21b14618810be2047af58f09f5"}, "author": "PAM LEBLANC Austin American-Statesman", "url": "http://www.myrtlebeachonline.com/living/travel/article35172636.html", "ord_in_thread": 0, "title": "Are tourists harming whale sharks off the Yucatan coast?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Are tourists harming whale sharks off the Yucatan coast? By PAM LEBLANC Austin American-Statesman Order Reprint of this Story \nEvery summer, hundreds of whale sharks gather off the Yucatan Coast, within an easy boat ride of the Mexican tourist hubs of Cancun, Isla Mujeres and Isla Holbox. \nThe sharks, toothless plankton eaters that stretch up to 40 feet in length, congregate there to feed on the eggs of a fish called the little tunny, a type of tuna. The sharks skim the surface of the ocean, their tire-sized mouths agape, slurping up food. \nIn recent years, though, the phenomenon has attracted crowds of humans, too, who flock to the site 20 miles offshore to snorkel alongside the graceful, slow-moving creatures. \nThe practice pumps tourism dollars into Mexico's economy and gives people a chance to see the largest fish in the ocean in its natural environment. But experts say it might also be threatening the welfare of the whale sharks, which are considered a \"vulnerable\" species by the International Union for Conservation of Nature. \nWhen first discovered by fishermen, the whale sharks were gathering closer to Isla Holbox, a relatively remote destination too far from Cancun or Isla Mujeres for an easy day trip. They were adjacent to a national park, too, and in 2009 the park extended the boundaries of its protected area to cover the feeding location. \nThat same year, though, the sharks shifted their gathering site farther east into the Yucatan upwelling zone, where currents draw in nutrients that also attract manta rays, sailfish, dolphins and turtles. That put the whale sharks within an hour's boat drive of many more tourists, where the sharks have stayed. \nScientists say the whale shark population in the Caribbean, which numbers about 1,500, is generally healthy. In 2011, the biggest congregation known to science - more than 400 animals - occurred off the Yucatan. \nThe gathering was smaller this year. Scientists say that could be due to El Nino, increased amounts of a type of seaweed called sargassum or a decrease in fish eggs, because, for the first time, the Mexican government allowed Cuban boats to fish for bonito in Mexican waters. \nNobody knows for sure how the tourists are affecting the population. \nIn Mexico, the Direccion General de Vida Silvestre regulates the industry that's sprung up around whale shark tourism. At first, the agency issued just a handful of licenses to boat operators. But the number of licenses has increased rapidly, reaching 250 in 2013, 280 in 2014 and more than 320 today. \n\"Every year we ask them not to increase the number, and every year they increase the number,\" said Alistair Dove, 41, a marine biologist and director of research and conservation at the Georgia Aquarium in Atlanta. \n\"It's hard to understand that decision, but needless to say it's to the detriment of the animals and the tourist industry itself,\" said Dove, the founding chairman of the board of Ch'ooj Ajauil AC, or Blue Realm, a nonprofit organization based in Cancun that works for improved conservation in the Yucatan upwelling zone. \nDove said he's counted up to 116 boats at a time scrambling for position around the whale sharks. \"No one has been injured by a boat yet, but I think it's a matter of time,\" he said. \"With that combination of inexperienced people and the sheer number of boats, it's inevitable.\" \nIt's dangerous for the animals, too. Roughly 20 percent to 30 percent of the whale sharks have been injured by a boat propeller, although regulations require that they stay 5 meters (about 161/2 feet) away from the animals. \nThere are other regulations, too. No more than two snorkelers per boat are allowed in the water, with a guide, at one time, and they can only spend a limited amount of time in the water. Humans can't get within a meter of a whale shark, and they can't touch them. \nNot everyone, though, sticks to the rules. \"When there's no enforcement presence out there, which there rarely is, it's a free for all,\" Dove said. \nFurther exacerbating the problem, some outfitters offer guarantees that customers will see a whale shark up close. If they don't, the customer doesn't pay. As a result, boat captains do everything they can to make that happen. \n\"They get out there and dump everyone in the water at once to meet that guarantee,\" said Dove, who thinks such promises should be prohibited. \"It provides significant incentive for people to misbehave when they're on the water.\" \nProfepa, the equivalent of the U.S. Environmental Protection Agency, is charged with enforcing the rules. CONANP, which regulates national parks in Mexico, sometimes patrols the site, too, although it's not technically a park. \n\"It really is a bit of a Wild West operation,\" Dove said. \"What you won't see out there with any regularity is enforcement.\" \nMost of the Mexican tour boat operators, Dove said, have good intentions. \"They love the animals but get caught in a competitive situation. If they don't take people out there, the other guy will,\" he said. \nDavid Oliver, who works with Solo Buceo, a licensed tour boat operator based in Cancun, said his company's guides work hard not to bother the whale sharks. \"We take (educational) courses before the season starts to ensure the safety of the animal, the crew and our guests,\" he said. \nBut he's worried about the large number of boats at the site - some of which are properly licensed and some that aren't. \"We have all our permits, but in the area you will find private boats with no permits or yachts or captains or guides without courses to ensure the safety of the animals,\" Oliver said. \nDove and others with Blue Realm are tagging the animals for tracking purposes so they can see how the presence or absence of tourists affects their behavior. Anecdotally, though, he believes the sharks are eating less and taking in fewer calories because of the boats and snorkelers. Ultimately, they might go elsewhere in search of food. \n\"They spend less time at the surface with their mouths open actively feeding if they're swarmed by people,\" he said. \"It's definitely a distraction from normal feeding behavior.\" \nOther countries have instituted plans to manage whale shark tourism. \nIn Western Australia, the government instituted seasonal quotas limiting the number of people who can snorkel with whale sharks. A five-year study by the Australian Institute of Marine Science showed that this limited eco-tourism resulted in no negative, long-term effecct on the whale shark population at the Ningaloo Reef, and that sharks that frequently encounter humans are just as likely to return to the reef as those that don't. \nBut the limits drive up prices, and tourists there pay two or three times as much money - the equivalent of about $350 to $450 - for the experience of snorkeling with the whale sharks. Such limits are controversial. \n\"It all hinges on effective enforcement and active management,\" Dove said. \"Someone has to step in. This is not sustainable. If we're not careful, we're going to destroy one of the greatest gifts that nature has given us.\" Related content", "external_links": [], "published": "2015-09-14T11:00:00.000+03:00", "crawled": "2015-09-14T17:06:17.669+03:00", "highlightTitle": ""}