{"organizations": [], "uuid": "e789ff06cdac579a5a8d01d26fa057bb47f49ca6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.couriermail.com.au", "main_image": "http://resources0.news.com.au/images/2015/09/04/1227512/173824-3a01b4ec-4e1b-11e5-9956-40bbe7ca6ff2.jpg", "site_section": "http://www.couriermail.com.au/travel/holiday-ideas", "section_title": "Holiday Ideas | Travel Tips and Holiday Ideas | The Courier-Mail", "url": "http://www.couriermail.com.au/travel/holiday-ideas/clia-accredited-travel-agents-have-cruise-specials-discounts-and-promotions/story-fnjjv4qy-1227512173937", "country": "US", "title": "CLIA-accredited travel agents have cruise specials, discounts and promotions | Travel | Travel News and Holiday Deals |", "performance_score": 0, "site": "couriermail.com.au", "participants_count": 1, "title_full": "CLIA-accredited travel agents have cruise specials, discounts and promotions | Travel | Travel News and Holiday Deals | | The Courier-Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "e789ff06cdac579a5a8d01d26fa057bb47f49ca6"}, "author": "couriermail.com.au", "url": "http://www.couriermail.com.au/travel/holiday-ideas/clia-accredited-travel-agents-have-cruise-specials-discounts-and-promotions/story-fnjjv4qy-1227512173937", "ord_in_thread": 0, "title": "CLIA-accredited travel agents have cruise specials, discounts and promotions | Travel | Travel News and Holiday Deals |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Enjoy a 10-night New Caledonia and Vanuatu cruise on-board Carnival Legend , departing Sydney on February 26, 2016, visiting Lifou, Mystery Island, Mare and Noumea. Cruise Week fares are from $950 a person, twin-share.\nBookings made during Cruise Week include up to $200 on-board credit, $99 deposits and ocean-view to balcony upgrades. Book through a CLIA-accredited travel agent.\nPh 13 31 94 or see carnival.com.au\nSTATEROOM SPECIALS\nDURING Cruise Week, book a 2016 Princess cruise through a CLIA-accredited cruise specialist and receive up to $100 on-board credit for each stateroom on selected cruises of seven nights or longer, plus pay only 50 per cent of the standard deposit.\nFor example, fares start from $2749 a person, twin-share, on a Mediterranean Medley 14-night cruise from Barcelona to Athens on-board Royal Princess departing May 7, 2016, and calling at Marseilles, Genoa (for Milan), Florence/Pisa (Livorno), Tunis (La Goulette), Sicily (Palermo), Rome (Civitavecchia), Naples (for Capri and Pompeii), Crete (Heraklion), Kusadasi (for Ephesus), Istanbul and Mykonos.\nFares start from $3149 a person, twin-share, for a 14-night roundtrip Baltic cruise from Southampton on-board Emerald Princess , departing July 9, 2016, and calling at Brussels/Bruges (Zeebrugge), Copenhagen, Stockholm, Helsinki, St Petersburg (overnight) Tallinn and Gdansk (Gdynia).\nPh 13 24 88 or see princess.com\nSCORE LOYALTY POINTS\nBOOK a P&O Cruises trip before September 16, 2015, and receive a free soft drink package, on-board credit, oceanview upgrade and reduced deposit.\nDuring Cruise Week, bookings made through CLIA-accredited travel agents will receive bonus on-board credit of up to $100.\nExplore the Loyalty Islands on an 11-night cruise on-board Pacific Eden , departing Melbourne on February 22, 2016 and visiting Noumea, Isle of Pines, Lifou and Mare. Prices from $949 a person, quad-share.\nPh 13 24 94 or see pocruises.com.au\nSPEND $US150 ON BOARD\nDURING Cruise Week, bookings of all Cunard sailings of seven nights or longer made through a participating CLIA-accredited travel agent will receive bonus on-board credit of up to $US150 ($A210) a person (a maximum of $US300 a cabin).\nPh 13 24 41 or see cunard.com\nSEE CHINA IN LUXURY\nAPT is offering exclusive deals for guests who book one of its many river and small ship ocean cruise holidays. For example, couples who book through a CLIA Member Travel Agent during Cruise Week to travel together on any of the eight remaining 2015 departures of APT’s 13-day Best of China luxury land and cruise holidays will receive one free return flight to China with Singapore Airlines and a saving of $500 a couple.\nWith the saving the journey is priced from $5145 a person, twin share and takes guests from Beijing, where guests spend three nights at the five-star Raffles Hotel, to Shanghai for a three-night stay at the Fairmont Peace Hotel, and includes an exclusive luxury four-night river cruise aboard the Sanctuary Yangzi Explorer and then two nights in Xi’an.\nPh 1300 196 420 or see aptouring.com.au\n Spend two nights at Waikiki Beach with the Inside Passage trip. Source: Supplied\nFIRE AND ICE IN THE US\nFROM the lights of Las Vegas to the glaciers of Alaska, see some of North America’s most spectacular sights on a fly-cruise-stay package. The Fire and Ice tour starts with a flight from Brisbane to Las Vegas for four nights then a flight to Vancouver for a night followed by a seven-night Alaska cruise on Celebrity Solstice .\nThe Inside Passage trip calls at Ketchikan, Tracy Arm Fjord, Juneau, Skagway, Victoria and Seattle. Spend a night in Seattle then fly to Hawaii for two nights at Waikiki Beach, in Honolulu, before heading home to Australia. The package is priced from $3599 a person, twin-share, from Brisbane. Departure is on May 1, 2016.\nPh 1300 596 345 or see cruise1st.com.au\nSCENIC TREAT IN EUROPE\nTRAVEL in 2017 at today’s prices plus save an additional $500 a couple on a special Cruise Week deal from Scenic, limited to the first 100 bookings.\nThe offer is for all-inclusive luxury Europe and France river cruising with Scenic.\nThe 15-day Jewels of Europe river cruise is priced from $6795 a person, twin-share. Explore Europe’s waterways between Amsterdam to Budapest on board one of Scenic’s all-inclusive luxury Space Ships. Discover the historic castles, lush vineyards and charming towns and villages along the Rhine, Main and Danube rivers and the beautiful landscapes such as Austria’s Wachau Valley.\nPh 13 81 28 or see scenic.com.au\nENJOY FREE HOTEL STAYS\nRECEIVE two complimentary hotel nights to enjoy before or after your Tauck journey when you book and pay a deposit on a 2016 Land, River Cruise or Small Ship Cruise during Cruise Week. For example, a seven-night roundtrip cruise from Venice aboard Le Lyrial calling at Korcula, Sibenik/Split, Dubrovnik, Kotor, Hvar and Pula/Rovinj includes the hotel nights, airport transfers, shore excursions, gratuities and an open bar, priced from $US6990 ($A9802) a person, twin-share.\nPh 1300 857 437 or see traveltheworld.com.au\n Royal Caribbean Cruise Lines ship 'Radiance of the Seas'. Source: Supplied\nHALF YOUR DEPOSIT WITH RCI\nROYAL Caribbean International is celebrating Cruise Week by offering two bonus offers – up to $US200 in bonus on-board credit plus 50 per cent reduced deposits – on top of savings\nof up to 30 per cent a person, for cruises of five nights or longer in Australia, New Zealand, the South Pacific and Asia departing from October 1, 2015 onwards.\nPrices start from $899 for an eight-night South Pacific roundtrip cruise on-board Radiance of the Seas , departing Sydney on January 31, 2016, with calls at Noumea and Isle of Pines in New Caledonia, as well as Lifou in the Loyalty Islands.\nPh 1800 754 500 or see royalcaribbean.com.au\nBONUS CREDITS TO THE MED\nCELEBRITY Cruises is offering a $US100 on-board credit and 50 per cent reduced deposits on any 2016 voyage booked by September 16, on voyages of six nights or longer. For example a seven-night Mediterranean cruise on Celebrity Equinox priced from $2189 departing on June 25, 2016, includes the on-board credit.\nThe cruise from Rome to Barcelona calls at Florence, Nice, Ajaccio and Palma de Mallorca.\nPh 1800 754 500 or see celebritycruises.com.au\n Enjoy a relaxing rail tour of the Outback on The Ghan. Source: Supplied\nOUTBACK AND COASTAL TOUR\nSEE the nation’s diversity on a rail-sail tour. Travel through the Outback from Adelaide to Darwin on The Ghan , spend four nights in Darwin with tours including to Kakadu, then relax with a 10-night cruise on Sun Princess calling at Yorkey’s Knob, Alotau (PNG), Brisbane and finishing in Sydney. Priced from $6749 a person, twin share, departing on May 1, 2016.\nPh 1300 854 897 or see holidaysofaustralia.com.au\n Enjoy a 40 per cent discount on cruise fares on the Sapphire Princess to Singapore. Source: Supplied\nSALE ON SUMMER SAILING\nGRAB a discount of up to 40 per cent on a summer cruise if booked by September 30. The 14-night package on Sapphire Princess departing on January 27, 2016, is priced from $2199 a person, twin share, including return airfares to Singapore, an 11-night roundtrip cruise from Singapore in an inside cabin, three nights’ accommodation at the centrally-located Holiday Inn Clarke Quay, private transfers in Singapore and a Singapore City Sightseeing Pass. The cruise calls at ports in Brunei, Vietnam and Thailand.\nPh 1300 369 848 or see ecruising.travel\nOriginally published as The best cruise deals of the week", "external_links": ["http://www.heraldsun.com.au/travel/holiday-ideas/clia-accredited-travel-agents-have-cruise-specials-discounts-and-promotions/story-fnjjv4qv-1227512173937", "http://resources0.news.com.au/images/2015/09/04/1227512/179008-3159ee42-4f81-11e5-9956-40bbe7ca6ff2.jpg", "http://resources2.news.com.au/images/2015/09/04/1227512/173466-bd72c474-4e1b-11e5-9956-40bbe7ca6ff2.jpg", "http://resources0.news.com.au/images/2015/09/04/1227512/173412-f944cc0c-4f80-11e5-9956-40bbe7ca6ff2.jpg", "http://resources0.news.com.au/images/2015/09/04/1227512/174992-761fac86-4f83-11e5-9956-40bbe7ca6ff2.jpg"], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-11T12:39:51.044+03:00", "highlightTitle": ""}