{"organizations": [], "uuid": "c84a0ceb10ec1456677177644ccdd8959a7ed646", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/28889-meetings-industry-veteran-grant-snider-launches-new-company", "country": "US", "title": "Meetings industry veteran Grant Snider launches new company", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Meetings industry veteran Grant Snider launches new company", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T11:30:00.000+03:00", "replies_count": 0, "uuid": "c84a0ceb10ec1456677177644ccdd8959a7ed646"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/28889-meetings-industry-veteran-grant-snider-launches-new-company", "ord_in_thread": 0, "title": "Meetings industry veteran Grant Snider launches new company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Meetings industry veteran Grant Snider launches new company Meetings industry veteran Grant Snider launches new company Details Category: Agency & Association Created on Friday, 18 September 2015 09:30 Meetings industry veteran Grant Snider has launched a new company, Meeting Escrow Inc., to protect client deposits and ensure timely payment to supplier-partners. Using the company’s segregated account system, planners and their clients are guaranteed their advance deposit payments are 100% secure prior to program operation while supplier-partners are relieved of the burden of constantly chasing payments. \n“Unfortunately, our industry is not regulated so there is no global standard for the protection of deposits. Standard practice is to mix client deposits with general operating accounts which means these monies are potentially at risk. Recent high profile failures have highlighted these risks and left planners reluctant to part with their money causing huge challenges for the entire supply chain,” said President and CEO, Grant Snider. Snider continued: “Meeting Escrow was founded to bridge this ‘trust gap’ in the market. Planners and supplier-partners sign an escrow contract with Meeting Escrow for the total amount to be protected. Funds are wire transferred by the client directly to Meeting Escrow and safeguarded in a segregated bank account to the benefit of the supplier-partner. There is no commingling of Meeting Escrow’s own operational funds with client funds; nor is there any commingling of any client’s funds with any other client’s. The individual deposit payments are then wire transferred to the supplier-partner per the deposit payment schedule in the escrow contract. Client funds are secure and fully protected and supplier-partners are paid on time. Meeting Escrow offers security and efficiency, a win-win for everyone”. Sandy Monkemeyer, Senior Vice President & Corporate Travel Director for Captive Resources, LLC, welcomed Snider’s new initiative. “Meeting Escrow is an important addition to our industry as it provides Meeting Planners with the guarantee that any funds paid by way of advance deposits are 100% secure and only released to supplier-partners when they fall due. This provides great comfort for companies where internal regulations and due diligence are increasingly important.” Katherine Wright, CMP, CMM, President of Toronto-based meeting planning company The Wright Solution, added that “Meeting Escrow finally provides the solution planners have been looking for: how to give our suppliers commitment without jeopardizing the often large deposits we pay months in advance to book future programs. I can’t think of a better person in this industry to be spearheading such a venture - Grant Snider embodies trust, confidence and fairness in all of his business dealings and will help streamline the whole process so we can focus on what we do best: planning and executing meetings and events.” Grant Snider brings lifelong meetings industry experience and an indisputable reputation as a person of integrity and trust to Meeting Escrow. Following an early career in the hotel industry, Snider moved to the destination services sector eventually becoming co-owner of JPdL, Canada’s largest DMC. He sold his stake in the company in 2014. Over the years he has served in a variety of leadership positions in meetings industry associations such as ADMEI, SITE and FICP. Related articles", "external_links": [], "published": "2015-09-18T11:30:00.000+03:00", "crawled": "2015-09-18T12:13:10.897+03:00", "highlightTitle": ""}