{"organizations": [], "uuid": "82fcfc85c9448b5e3054b64ff6a9e288ae23f632", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03443/Pennyhill-park_3443692a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-20.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/hotels/11871352/Britains-25-best-cosy-hotels-for-autumn.html", "country": "US", "title": "Britain's 25 best cosy hotels for autumn", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Britain's 25 best cosy hotels for autumn - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T16:00:00.000+03:00", "replies_count": 0, "uuid": "82fcfc85c9448b5e3054b64ff6a9e288ae23f632"}, "author": "Fiona Duncan", "url": "http://www.telegraph.co.uk/travel/hotels/11871352/Britains-25-best-cosy-hotels-for-autumn.html", "ord_in_thread": 0, "title": "Britain's 25 best cosy hotels for autumn", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What do we look for in an autumn break in Britain? Warmth and cosiness, log fires, comfortable beds and beautiful views, certainly. And menus based on local, seasonal produce including mushrooms and game, as well as long, lazy afternoon teas, with papers and books and maybe a board game by the fire. And if we can find a hotel close to a sight – a garden, park, arboretum or forest, famed for its glorious autumn colours, so much the better. The following hotels answer all these requirements and more. Pennyhill Park, Bagshot, Surrey Two excellent Autumn Break packages are being offered at Pennyhill Park: Wish upon a Spa and Escape to the Country. No wonder autumn is a focus here: the suburban hotel is unexpectedly surrounded by beautiful hilly wooded parkland, it has one of the cosiest two Michelin-starred restaurants in the country (Michael Wignall at the Latymer) and its huge spa is a haven of tranquility and second to none. Double rooms from £225. Read the full review: Pennyhill Park, Surrey For more information, see: 01276 471774; pennyhillpark.co.uk The Pig, Brockenhurst, Hampshire The New Forest is one of Britain’s prime places for edible fungi and foraging expeditions. Wild mushrooms are on the menu at The Pig, a pretty Georgian shooting lodge with a cosy, shabby-chic appeal and abundant kitchen garden, even in autumn. Nearby are Bolderwood and Rhinefield Ornamental drives and Exbury Gardens, all spectacular sights. Double rooms from £149. Read the full review: The Pig, Hampshire For more information, see: 01590 622354; thepighotel.com • The best hotels in Hampshire Barnsdale Lodge, Oakham, Rutland Close to Rutland Water, this characterful hotel on the Exton Park estate of the Earls of Gainsborough makes an exceptional base for the area. The ground floor is engaging, warm and welcoming, with a long, cosy flagstone hallway with original cast-iron stove; picture-filled, warm red sitting room and a clubby dining room fit for the hotel’s aristocratic owner. Nearby are several historic houses, including Belton House, famed for the stunning autumn colours in its Pleasure Grounds. Double rooms from £97.50. Read the full review: Barnsdale Lodge, Rutland For more information, see: 01572 724678; barnsdalelodge.co.uk Boconnoc House, Lostwithiel, Cornwall Milder temperatures than in the rest of the country, and with plenty of the county’s famous gardens still open make Cornwall a great place for an autumn break. Few vistas – of deer park, woodland and lake – are as lovely as those surrounding this stunning manor. Inside, tuck up with hot chocolate and blankets for a movie night in the library or read by a crackling log fire. Double rooms from £130. Read the full review: Boconnoc House, Cornwall For more information, see: 01208 872507; boconnoc.com • The best hotels in Cornwall Ockenden Manor, Cuckfield, West Sussex A hotel that has it all for an autumn break: the tranquil and charming Elizabethan manor offers Michelin-starred cooking in its restaurant, an elegant sitting room warmed by a roaring log fire, a cosy wood-panelled bar and – for all-important pampering as winter sets in – a state of the art spa in a contrastingly modern adjacent building. And to admire the burnished hues of autumn, there is nowhere more spectacular than nearby Sheffield Park. Double rooms from £179. Read the full review: Ockenden Manor, West Sussex For more information, see: 01444 416111; hshotels.co.uk • The best hotels in West Sussex The Inn at Whitewell, Whitewell, Lancashire Whether you decide to pull on your boots and head out to explore the fell or stay put and enjoy the views with a glass of wine by the fire, you will find a haven at this family-run pub, restaurant, hotel and wine shop in the Forest of Bowland. The road descends through the wild, steep-sided Trough of Bowland but at Whitewell it opens into a natural amphitheatre of meadows and hills, with the River Hodder, where fishing is available, running past. Double rooms from £128. Read the full review: The Inn at Whitewell, Lancashire For more information, see: 01200 448222; innatwhitewell.com Salcombe Harbour, Salcombe, Devon With a breezy seaside style, balconies overlooking the water, the excellent Jetty restaurant (specialising in the freshest of fish) and easy access to bracing coastal walks, this south Devon hotel has great appeal in autumn. Make time for a visit to The Garden House at Buckland Monachorum, a beautiful 10-acre valley garden where Devon’s most colourful autumn foliage is on display in the Acer Glade. Double rooms from £155. Read the full review: Salcombe Harbour, Devon For more information, see: 01548 8 ; salcombe-harbour-hotel.co.uk • The best hotels in Devon Hotel Endsleigh, Milton Abbot, Devon In an incomparable setting in its own secret valley, this Grade-I listed Regency shooting lodge, now a stylish hotel owned by Olga Polizzi, is at its best in autumn, when the hanging woods beyond the River Tamar are clothed in red and gold and the many fine trees in the hotel’s beautiful gardens, designed by Humphrey Repton, have also taken on their autumn colours. Double rooms from £190. Read the full review: Hotel Endsleigh, Devon For more information, see: 01822 870000; hotelendsleigh.com • The best hotels in Devon Bowood Hotel, Calne, Wiltshire Next year sees the tercentenary of the birth of ‘Capability’ Brown, so why not get a sneak preview of one of his finest landscapes by staying at Bowood Hotel and enjoying his arboretum, which will be blazing with colour. As the leaves fall, Brown’s landscape design becomes ever more clear. Then there’s golf on the Bowood course, and treatments in the hotel’s spa, not to mention books to browse in its stylish library, designed by Lady Lansdowne. Double rooms from £140. Read the full review: Bowood Hotel, Wiltshire For more information, see: 01249 822228; bowood.org • The best hotels in Wiltshire Beckford Arms, Fonthill Gifford, Wiltshire 15 minutes’ drive from this stylish, animated and enveloping inn is Stourhead, so famous for the autumn colours in its 18th-century landscape garden that reports on its progress are broadcast in season on Radio 4’s Today programme. Not only that, but the magical Fonthill estate is on the doorstep. Bedrooms are charming, the food seasonal, and you can curl up in the inn’s sitting room with log fire, sofas and tables piled with books. Double rooms from £95. Read the full review: Beckford Arms, Wiltshire For more information, see: 01747 870385; beckfordarms.com The Portobello Hotel, Notting Hill, London If you don’t want to go grand in London, why not go intimate? There’s no restaurant at the Portobello, but you can nestle in the pretty, colourful sitting room with a cup of tea (the floral cups are finds from Portobello Market) a drink from the honesty bar or a light supper. The hotel still encapsulates its bohemian spirit from the days when film and rock stars made it their base of choice, but is nowadays a highly characterful but hugely comfortable place to stay, especially in the winter months. Double rooms from £195. Read the full review: The Portobello, London For more information, see: 020 7727 2777; portobellohotel.com Hotel Terravina, Woodlands, Hampshire Conveniently close to Southampton, but also the New Forest, this exceptional restaurant with pleasant, airy bedrooms is a great base for witnessing the annual autumn Pannage (until mid-November), a beautiful and rare sight, when domestic pigs are turned out on to the forest floor to graze on acorns and beechmast. A warm welcome and seasonal dishes, including pork, await you back at Terravina, plus superb wines courtesy of owner and world-class sommelier Gerard Basset. Double rooms from £165. For more information, see: 02380 293784; hotelterravina.co.uk The George and Dragon, Clifton, Cumbria If ‘local’ and ‘seasonal’ is what you are after, then it will be hard to beat the George and Dragon. Much of the produce is grown at the owners’ gardens at Askham Hall, two miles away; most of the rest comes from local suppliers and farmers on their family estate, Lowther. As for feeling cosy and comfortable on a chilly autumn night, look no further: the ground floor is a triumph of conviviality and authenticity with a wood-topped bar, wood-burning stoves and banquette seats strewn with kilim-covered cushions. Double rooms from £95. Read the full review: The George and Dragon, Cumbria For more information, see: 01768 865381; georgeanddragonclifton.co.uk The Milk House, Sissinghurst, Kent Where better than to stay in one of the stylish bedrooms – choose from Dairy, Churn, Byre, Buttery or Udderly Private – at this 16th-century former hall house where the food is sourced from within 20 miles and includes a menu of pub classics as well as more adventurous dishes. Sissinghurst Castle Gardens are on your doorstep and at Bedgebury National Pinetum eight miles away, fiery leaves and brilliant berries make a sharp contrast to the background of rich green conifers, the finest collection on one site in the world. Double rooms from £100. Read the full review: The Milk House, Kent For more information, see: 01580 720200; themilkhouse.co.uk • The best hotels in Kent The Dorchester, Mayfair, London Even if you don’t live far from the capital – even, indeed, if you live in the capital – there’s nothing more spoiling that a night or two in a luxury London hotel. Where better in autumn than The Dorchester, overlooking Hyde Park? Of The Dorchester’s several stand-out restaurants, choose at this time of the year The Grill, established in 1931 and serving the finest grilled dishes, unmissable blue lobster chowder and an extensive choice of sweet soufflés. Double rooms from £450. Read the full review: The Dorchester, London For more information, see: 020 7629 8888; thedorchestercollection.com • The best hotels in central London Tregulland, Launceston, Cornwall There are few more stylish places to stay in all of Cornwall than this private house where you can enjoy all the services of a hotel, including a cook, if you prefer. There’s an indoor pool and steam room, perfect for chilly months, and autumn brings a special sight in the skies above: the starling murmurations, when spectacular flocks fly over before roosting nearby. Double rooms from £75. For more information, see: 01566 770880; tregulland.co.uk Number Sixteen, South Kensington, London Stroll over the road from Number Sixteen to the V&A to catch an exhibition. After a day of walking round the museum, put your feet up in the gorgeous Drawing Room, Library or Orangery for a restorative and fulsome afternoon tea, followed perhaps by a stroll around the hotel’s newly re-designed, tree-lined private garden. Double rooms from £300. For more information, see: 020 7589 5232; firmdalehotels.com • The best hotels in central London The Feathered Nest , Nether Weston, Oxfordshire The very name of this glossy converted pub is enough to make you want to head there at the first sign of autumn chill. The Feathered Nest at Nether Weston has four individually decorated bedrooms, with antiques and comfy beds, plus a good library of DVDs and board games for whiling away those rainy days. The delicious seasonal cooking of head chef Kuba Winkowski is served in an array of dining areas, including the bar where the stools are fashioned from leather saddles. Double rooms from £180. Read the full review: The Feathered Nest, Oxforshire For more information, see: 01993 833030; thefeatherednestinn.co.uk • The best hotels in Oxfordshire Gliffaes, Crickhowel, Powys The Victorian Italianate house stands proudly above the River Usk, crowned by two quirky campaniles. There are lovely grounds (pick up a tree map and explore their amazing selection of specimen trees, never finer than in autumn) and five salmon and trout beats along the river. As well as satisfying dishes that hit the spot at dinner, there are copious afternoon teas and bedrooms that are traditional and pretty. A lovely autumnal place. Double rooms from £118. Read the full review: Gliffaes, Powys For more information, see: 01874 730371; gliffaeshotel.com Killiecrankie Hotel, Pitlochry, Perthshire Scottish warmth and hospitality are guaranteed at this delightful small hotel at the head of the beautiful Pass of Killiecrankie. A four-course table d’hôte dinner is served at white-clothed tables, and the ten bedrooms are elegant, with pretty fabrics and fresh flowers. Not to be missed are glimpses of running salmon at Soldiers’ Leap, a stroll away, the autumn colours around Loch Faskally, at the other end of the Pass, and the stupendous Meikleour Beech Hedge 40 minutes’ drive away. Double rooms from £90. Read the full review: Killiecrankie Hotel, Perthshire Fore more information, see: 01796 473220; killiecrankiehotel.co.uk Airds Hotel, Port Appin, Argyll After a thrilling drive through Glencoe, whose late autumn colours lend the landscape a beauty even greater than that of summer’s cloak of purple heather, you arrive at Loch Linnhe, where Castle Stalker stands enigmatically on its tiny islet. Drive futher still and you reach little Port Appin and this enveloping small hotel, where peace, tranquility, locally sourced dinners, comforting teas by roaring fires and warm beds are guaranteed. Double rooms from £290, including dinner. Read the full review: Airds Hotel, Argyll For more information, see: 01631 730236; airds-hotel.com Ynyshir Hall, Machynlleth, Wales Queen Victoria herself is reputed to have planted the Persian Ironwood (Parrotia), famed for its autumn colour, that graces the wonderful gardens which she loved so much when she owned Ynyshir Hall as a private retreat. The handsome white house now houses another secret: the cooking of Gareth Ward and his tight-knit team, no better discovered than in autumn with its abundance of personally foraged local ingredients. Double rooms from £215. Read the full review: Ynyshir Hall, Wales For more information, see: 01654 781209; ynyshirhall.co.uk • The best hotels in Wales Bodysgallen Hall, Llandudno, Conwy Why not time your stay at this Historic House Hotel of the National Trust? It has a spa and large indoor pool in its former farmhouse, with a tour, lead by the head gardener, of its exceptional gardens. The sweeping views from the medieval look-out tower are sensational and the house has great character, with 15 antique-filled bedrooms and a formal dining room in the main hall. Double rooms from £179. Read the full review: Bodysgallen Hall, Conwy For more information, see: 01492 584466; bodysgallen.com Little Barwick House, Barwick, Somerset Roe deer, sweetbreads and wild mushroom risotto are all on the menu at this charming, unpretentious family-run restaurant with rooms with superb food, cosy bedrooms and a pretty garden. Nearby is Mapperton House and (unusual, three-tiered) Gardens, in the spotlight since its appearance in the Far from the Madding Crowd film. Also wonderful in autumn is Sculpture by the Lakes, where Simon Gudgeon’s sculptures and his wife’s landscapes combine to stunning natural effect. Double rooms from £100. Read the full review: Little Barwick House, Somerset For more information, see: 01935 423902; littlebarwick.co.uk Ram Inn, Firle, West Sussex November 5th sees Ram Inn, Firle, West Sussex November 5th sees Britain’s largest Guy Fawkes celebrations in nearby Lewes, but delightful Firle has its own historic Bonfire Society too, and this year’s celebrations are held on October 24th, with huge bonfire, fireworks, parade and marching band. The focus for all the fun is this characterful village pub, with snuggly bedrooms in the rafters, open fires, food that includes game from Firle Estate, local ales and often the vicar, sporting his famous cowboy hat, propping up the bar with other village residents. Double rooms from £90. Read the full review: Ram Inn, West Sussex For more information, see: 01273 858222; raminn.co.uk • The best hotels in West Sussex Ram Inn, Firle, West Sussex November 5th sees Britain’s largest Guy Fawkes celebrations in nearby Lewes, but delightful Firle has its own historic Bonfire Society too, and this year’s celebrations are held on October 24th, with huge bonfire, fireworks, parade and marching band. The focus for all the fun is this characterful village pub, with snuggly bedrooms in the rafters, open fires, food that includes game from Firle Estate, local ales and often the vicar, sporting his famous cowboy hat, propping up the bar with other village residents. Double rooms from £90. Read the full review: Ram Inn, West Sussex For more information, see: 01273 858222; raminn.co.uk • The best hotels in West Sussex Britain’s largest Guy Fawkes celebrations in nearby Lewes, but delightful Firle has its own historic Bonfire Society too, and this year’s celebrations are held on October 24th, with huge bonfire, fireworks, parade and marching band. The focus for all the fun is this characterful village pub, with snuggly bedrooms in the rafters, open fires, food that includes game from Firle Estate, local ales and often the vicar, sporting his famous cowboy hat, propping up the bar with other village residents. Double rooms from £90. Read the full review: Ram Inn, West Sussex For more information, see: 01273 858222; raminn.co.uk • The best hotels in West Sussex • The best New England hotels for autumn Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-09-20T16:00:00.000+03:00", "crawled": "2015-09-20T11:01:05.580+03:00", "highlightTitle": ""}