{"organizations": [], "uuid": "b3b95c4604b02069a8fcf551ab4cba68af4d3ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/08/31/48/39/dd8e4eab3b684256b51c073f2a07ce18-959d9873336241dca75b48b9f9173bc3-0.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/top-news/suspect-in-officer-attack-had-history-of-mental-il/nnWFS/", "country": "US", "title": "Suspect in officer attack had history of mental illness | www.ajc.com", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Suspect in officer attack had history of mental illness | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T15:28:00.000+03:00", "replies_count": 0, "uuid": "b3b95c4604b02069a8fcf551ab4cba68af4d3ac2"}, "author": "JUAN A. LOZANO", "url": "http://www.ajc.com/ap/ap/top-news/suspect-in-officer-attack-had-history-of-mental-il/nnWFS/", "ord_in_thread": 0, "title": "Suspect in officer attack had history of mental illness | www.ajc.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A man charged with murder in the ambush of a suburban Houston sheriff's deputy had a history of mental illness and was once declared mentally incompetent, according to authorities and his former attorney.\nShannon J. Miles, 30, was being held without bond after an initial court hearing Monday. Prosecutors accuse him of opening fire from behind on Harris County Sheriff's Deputy Darren Goforth on Friday night in what the sheriff called a \"cold-blooded assassination.\"\nGoforth was shot 15 times, Harris County District Attorney Devon Anderson said in court.\nShannon Miles is escorted out of a courtroom after a hearing, Monday, Aug. 31, 2015, in Houston. Miles has been charged with capital murder in the death of Harris County Sheriff's Deputy Darren Goforth. He is being held without bond. (AP Photo/Pat Sullivan) Anderson would not comment on a motive, saying investigators were still trying to figure that out. When asked if it might be connected to heightened tensions around the country between law enforcement and civilians, Anderson said: \"I have no idea whether it does or not.\"\nThis weekend, Sheriff Ron Hickman said the attack was \"clearly unprovoked,\" that authorities believe the 47-year-old deputy was targeted because he was in uniform and that there is no evidence Goforth knew Miles.\nAnthony Osso, one of Miles' two court-appointed attorneys, told The Associated Press that his client intends to plead not guilty.\nMiles' criminal history dates back to 2005 and includes an arrest in Austin in 2012 that led to Miles being sent to a state mental hospital for several months.\nIn 2012, the Travis County District Attorney's Office charged Miles with aggravated assault with a deadly weapon after he got into a fight at a homeless shelter over a remote control, prosecutor Joe Frederick said. Miles was found to be mentally incompetent in October 2012 and he was sent to North Texas State Hospital in Vernon, Texas.\n\"From this case, you could never tell what would happen\" in the future, Frederick said, adding that prosecutors treated the case as a \"very serious offense\" and had offered Miles a plea agreement of seven years in prison. Miles was declared mentally competent in February 2013, but the charge was dropped after the victim could not be located, Frederick said.\nJon Evans, Miles' attorney in the Austin case, said medical privacy laws prevent him from offering any details about Miles' mental illness history. But he was told by Miles' mother that her son had a lifelong history of mental illness.\nAt the time of the case in 2012, Miles \"suffered from severe mental illness,\" Evans said.\nMiles also has three convictions for resisting or evading arrest, as well as convictions for disorderly conduct with a firearm, criminal mischief and giving false information to police. Records show he was sentenced to several short stints in jail, from six to 10 days.\nFrom fall 2003 to spring 2004, Miles attended Prairie View A&M University. He also attended the University of Houston for a time.\nPresident Barack Obama on Monday said Goforth's killing was contemptible and \"an affront to civilized society.\" Obama spoke with Goforth's wife, Kathleen, conveying his condolences and telling her he will keep highlighting the uncommon bravery of police officers.\nGoforth's funeral is scheduled for Friday.\n___\nAssociated Press writers Seth Robbins in San Antonio and Alan Scher Zagier in St. Louis contributed to this report.", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/08/31/48/39/dd8e4eab3b684256b51c073f2a07ce18-959d9873336241dca75b48b9f9173bc3-0.jpg"], "published": "2015-09-01T15:28:00.000+03:00", "crawled": "2015-09-01T16:35:38.052+03:00", "highlightTitle": ""}