{"organizations": [], "uuid": "f7d09d9838381981896b8b59aeec9fae47cbf23e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.fodors.com", "main_image": "", "site_section": "http://www.fodors.com/wire/feedlimited.xml", "section_title": "Fodor's Travel Wire", "url": "http://www.fodors.com/news/5-reasons-smaller-cruises-might-be-right-for-you-11519.html", "country": "US", "title": "5 Reasons Smaller Cruises Might Be Right for You", "performance_score": 0, "site": "fodors.com", "participants_count": 0, "title_full": "5 Reasons Smaller Cruises Might Be Right for You", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T12:00:00.000+03:00", "replies_count": 0, "uuid": "f7d09d9838381981896b8b59aeec9fae47cbf23e"}, "author": "", "url": "http://www.fodors.com/news/5-reasons-smaller-cruises-might-be-right-for-you-11519.html", "ord_in_thread": 0, "title": "5 Reasons Smaller Cruises Might Be Right for You", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kathleen Squires"], "text": "5 Reasons Smaller Cruises Might Be Right for You Posted by Kathleen Squires on September 22, 2015 at 9:00:00 AM EDT | Post a Comment \nIt’s a cliché, but it’s true: Bigger isn’t always better—especially, for certain types of travelers, when it comes to cruise ships. While large cruise lines do offer some amazing amenities—from Broadway-style productions to lavish spas to sprawling ice-skating rinks—sometimes it’s the little things that make a big difference. We talked to some industry experts who agree: If any of the below apply to you, consider booking your next sail on a smaller ship. You Don’t Like Crowds \nThink of it this way: Chances are you won’t be competing for a lounge on the sundeck. Smaller cruise ships are more sparsely populated, and fewer people means less hassle during embarkation and disembarkation. \n“You can walk on and off the ship with more ease and no lines,” Margarita Navarrete of CruisePlanners.com points out. “This comes in handy especially during sightseeing. You can tour in the morning, come back on the ship for lunch, and leave again in the afternoon or evening. Guests can come and go as they please.” You Enjoy Being Spoiled \nPersonally monogrammed pajamas, butler service, a poolside steward who’s ready to polish your sunglasses—these are some of the niceties that come with an intimate ship. \n“Smaller ships have a high level of service,” says Stewart Chiron, founder of TheCruiseGuy.com . “It’s a completely different experience with fewer people as there is [with] a higher ratio of crew to guests.” This allows the crew to pay more attention to detail, such as what your favorite cocktail might be. \n“Recently on a Seabourn cruise, the bartender would have my husband’s brand of Scotch at the ready and hand it to him on his way through the lounge,” says Linda Coffman, founder of CruiseDiva.com . “On some lines, everyone has a butler, not just passengers in suites,” she adds. That can make a meaningful difference for travelers who are celebrating. \n“We celebrated our wedding anniversary on a Silversea ship, and when we left our room our butler handed me a long-stem red rose,” Coffman says. ”When we came back from dinner that night, there was a special table set up in our room, with a cake and balloons. Small ships go out of their way to make those occasions special. You won’t find that on a large ship unless you pay extra.” You’re a Foodie \nNot only are open dining times a valued bonus (passengers are not relegated to timed seatings on small ships), but smaller can also be better in terms of food quality. A manageable dining room allows for local sourcing, for starters. \n“If you are on a small ship in Alaska, for example, you are likely going to have salmon for dinner that was caught that morning,” Coffman explains. \nA small kitchen makes all the difference in quality, too, says Sudesh Kishore, executive chef of SeaDream Yacht Club . \n“When one has a well-designed, compact kitchen, the executive chef has complete control of all aspects of the operation and is able to check every dish going out of the kitchen for quality. Having the executive chef personally involved in the food preparation is only possible in a smaller operation.” \nOn ships like SeaDream I and SeaDream II , the number of guests in the dining room is on par with any medium-sized restaurant. Therefore, food is prepared to order, which is impossible on a large cruise ship feeding thousands of passengers. You’re an Adventurous Traveler \nSmall ships have the advantage of accessing ports that large ships can’t. This can mean anything from traveling up the Thames in London to chasing the Northern Lights in Scandinavia to getting up close and personal with sea turtles in the Galapagos. \n“Small ships tend to go to off-the-beaten-path ports. In fact, only small vessels can travel through places like the Galapagos or Antarctica,” Chiron points out. “Even in places like the Mediterranean, where I have been many times, it was a small ship that took me to spots that I have never seen, and that a larger ship couldn’t dream of getting into.” \nAnd there are special perks that come with small-ship access, too. \n“I sailed on a Silversea ship that docked on the river right across from the Hermitage in St. Petersburg,” Coffman says. “So the Hermitage opened early, just for people on our ship. We were the only visitors in the building that morning.” \nIf you’re an explorer-type looking to tick destinations off the bucket list, some small lines, like Quark Expeditions , which specializes in Arctic and Antarctic cruises, come equipped with kayaking, skiing and mountaineering equipment. You Want to Meet Like-Minded People \nAre you a shutterbug? Wildlife enthusiast? Cyclist? Wine aficionado? Many small cruise lines offer themed experiences where passengers can meet others who share common passions. For example, the luxury small river-cruise line AMAWaterways features art cruises, on which guests can take painting classes, attend lectures by art historians, and visit where the masters worked. Customized land tours are also geared toward small group excursions that range in style, difficulty, duration and theme. \n“Nearly everything is customizable on a river cruise,” says Kristin Karst, AMAWaterways executive vice president. “There is truly something for everyone.” \nA serial traveler who often lets a country’s cuisine dictate her itineraries, New York City-based writer Kathleen Squires has visited all 7 continents and over 60 countries, with stints living in London, Tokyo, and Buenos Aires. Her work also appears in The Wall Street Journal, Details, Saveur, Cooking Light and National Geographic Traveler. \nCourtesy of Uniworld Boutique River Cruise Collection", "external_links": [], "published": "2015-09-22T12:00:00.000+03:00", "crawled": "2015-09-23T09:01:52.174+03:00", "highlightTitle": ""}