{"organizations": [], "uuid": "042bedadc4f62f948842224212789d2041459fad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/New-Executive-Chef.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-cornhusker-a-marriott-hotel-announces-new-executive-chef/", "country": "US", "title": "The Cornhusker, A Marriott Hotel, Announces New Executive ChefTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "The Cornhusker, A Marriott Hotel, Announces New Executive ChefTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "042bedadc4f62f948842224212789d2041459fad"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-cornhusker-a-marriott-hotel-announces-new-executive-chef/", "ord_in_thread": 0, "title": "The Cornhusker, A Marriott Hotel, Announces New Executive ChefTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Cornhusker, A Marriott Hotel, Announces New Executive Chef\nThe Cornhusker, A Marriott Hotel, majority owned and operated by Marcus Hotels & Resorts, has announced the addition of Brandon Ganus as executive chef. Ganus will oversee all culinary operations of the hotel in Downtown Lincoln, including banquets, special events and daily dining.\nGanus brings 13 years of culinary experience to our Lincoln NE hotel’s Miller Time Pub & Grill and Cafe at The Cornhusker. He started his career as a kitchen steward at Renaissance Tulsa Hotel & Convention Center in Tulsa, OK, and worked his way up to sous chef under accomplished chef Bill Doyle, who is now executive chef at Marcus Hotels & Resorts’ InterContinental Milwaukee.\nAfter nine years in Tulsa, the Oklahoma native moved south and held the role of executive sous chef at Renaissance Dallas Richardson Hotel in Richardson, TX, for two years and then served as executive chef at Marriott Hotel & Convention Center in Allen, Texas.\nIn his new position, Ganus strives to bring local fare and food purveyors to the hotel. With a focus on fresh, seasonal foods and market-style presentations, Ganus continually customizes the menus at this Lincoln NE hotel to reflect what’s growing best in Nebraska’s fields and farms. This includes our event and wedding menus. His unique style already is being noticed in Lincoln, as his braised beef short rib with red wine demi-glace took home the “Best in Show” award at the Lincoln Chamber of Commerce’s Savor the City event on Aug. 27, 2015, at Nebraska Champions Club.\n“Chef Ganus has created new banquet menus focusing on today’s educated diners, using the freshest ingredients from the area,” said Susan Madsen, general manager of The Cornhusker. “He also excels at creating customized menus to make each event special and unique. We are excited to have Brandon on board, and I know travelers and local residents alike will enjoy his creative and flavorful Nebraska cuisine.”\nGanus received an associate degree in Culinary Arts from The Culinary Institute of America in Hyde Park, NY.\nSource: Marcus Hotels & Resorts", "external_links": [], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-24T00:15:16.455+03:00", "highlightTitle": ""}