{"organizations": [], "uuid": "9bb3eb0e4a56ec9dfd914a22e23cde9d8ad7cd0e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28543-indulge-in-a-wellness-break-in-beautiful-breck", "country": "US", "title": "Indulge in a wellness break In beautiful Breck", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Indulge in a wellness break In beautiful Breck", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T15:30:00.000+03:00", "replies_count": 0, "uuid": "9bb3eb0e4a56ec9dfd914a22e23cde9d8ad7cd0e"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28543-indulge-in-a-wellness-break-in-beautiful-breck", "ord_in_thread": 0, "title": "Indulge in a wellness break In beautiful Breck", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Indulge in a wellness break In beautiful Breck Indulge in a wellness break In beautiful Breck Details Category: Venues & Events   13:30 With an estimated 300 days of sunshine each year, an average summer temperature of a pleasant 22 degrees and an elevation of 9,600 feet, Breckenridge’s stunning mountain position ensure it’s the perfect destination for a relaxing wellness break. The mountain town is situated just two hours west of Denver in the heart of Colorado and offers visitors the chance to enjoy the likes of indulging in luxury spa experiences, perfecting their yoga skills whilst also mastering the art of stand up paddle boarding, and hiking through the high alpine scenery. \nThis season, Breckenridge Tourism Office is encouraging all those looking for some well earned peace and relaxation to choose beautiful Breckenridge. Yoga Classes In Mountain Studios Or On The Water Stand-Up Paddle Boarding Develop your yoga skills by attending a class at one of the town’s multiple yoga studios, each providing classes tailored to beginners and experienced ‘yogis’. Alternatively, those looking to take things to the next level and try out a different form of yoga, can also put their balance and concentration to the ultimate test with stand-up-paddle boarding yoga classes. The morning classes take place on the beautiful, fresh mountain water at Maggie Pond or Dillon Marina. Stand-up paddle boarders (SUPs) will be taught everything from basics on how to paddle, to how to stand up on the board and how to manoeuvre to get safely into yoga postures. Clear Minds With A High Altitude Hike Thanks to Breckenridge’s mountain position and fresh mountain air, it is the perfect place to clear busy minds on a hike. Choose from gentle paved paths that wind along the scenic Blue River to those where you can get your toes wet in waterfalls, or traverse along challenging mountain summits at more than 14,000 feet above sea level. Mohawk Lakes and McCullough Gulch are two of the most popular spots to explore on foot thanks to their stunning high-alpine scenery including glacier-sculpted peaks, colourful wildflowers and clear mountain lakes. Soothe Away Your Stresses With A Luxury Spa Treatment A trip to the spa is the perfect complement to any wellness break and fortunately Breckenridge is home to more than 15 world-class spas, each offering the latest and most luxurious treatments. Whether guests are looking for cleansing and detox therapies, a body wrap, a therapeutic massage or a simple manicure and pedicure, Breckenridge has much to offer spa-lovers. The spa atmospheres vary from cosy mountain retreats to airy and fresh open spaces, but the outcome will remain the same — a feeling of relaxation and rejuvenation. Related articles", "external_links": [], "published": "2015-09-01T15:30:00.000+03:00", "crawled": "2015-09-01T16:58:04.909+03:00", "highlightTitle": ""}