{"organizations": [], "uuid": "3b1e5ca69fca07d943fb34f446e6191036e69bf7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29940360/autonation-announces-reported-retail-new-vehicle-unit-sales-of-31032-in-august-2015", "country": "US", "title": "AutoNation Announces Reported Retail New Vehicle Unit Sales of 31,032 in August 2015", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "AutoNation Announces Reported Retail New Vehicle Unit Sales of 31,032 in August 2015 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "3b1e5ca69fca07d943fb34f446e6191036e69bf7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29940360/autonation-announces-reported-retail-new-vehicle-unit-sales-of-31032-in-august-2015", "ord_in_thread": 0, "title": "AutoNation Announces Reported Retail New Vehicle Unit Sales of 31,032 in August 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " AutoNation, Inc.\n- For industry sales reporting purposes, the Labor Day Holiday weekend was reported in August 2014. In 2015, the Labor Day Holiday weekend will be reported in September. Industry sales reporting for August 2015 includes a total of two fewer calendar days than in August 2014.\n- Adjusting for the two fewer calendar days, reported retail new vehicle unit sales in August 2015 were up 1% from the prior year on a per day basis\nFORT LAUDERDALE, Fla. , Sept. 2, 2015 /PRNewswire/ -- AutoNation, Inc. (NYSE: AN), America's largest automotive retailer, today announced that it reported to automotive manufacturers, based on their respective sales transaction reporting standards, retail sales of 31,032 new vehicles in August 2015 , a decrease of 5% as compared to August 2014 . August 2015 reported retail new vehicle unit sales for AutoNation's operating segments were as follows:\n10,239 for Domestic, up 2% versus August 2014 , 14,641 for Import, down 14% versus August 2014 , and 6,152 for Premium Luxury, up 8% versus August 2014 . On a same-store basis, reported retail new vehicle unit sales in August 2015 were down 7% as compared to August 2014 .\nAutoNation expects to announce September 2015 reported retail new vehicle unit sales on Friday, October 2, 2015 .\nThe information provided in this news release is based on unaudited sales reports provided by our stores to the applicable automotive manufacturers. These reports are prepared based on the sales transaction reporting standards established by the applicable automotive manufacturers, which differ from GAAP revenue recognition and other requirements. For example, the classification of certain transactions under the standards established by certain such manufacturers differs under GAAP. Transactions reported as retail sales include vehicles placed into certain manufacturer-approved demonstrator vehicle and service loaner programs, which vehicles may be sold by our stores to retail customers as new or used vehicles under GAAP in subsequent periods. Manufacturers sometimes provide marketing incentives to place vehicles into such programs during particular periods. In addition, the sales reports are based on the time periods set by the automotive manufacturers for reporting monthly sales, which generally differ from the calendar month and may be modified by particular manufacturers from time to time. As a result, our operating results calculated and presented in accordance with GAAP, including our new vehicle unit sales, may differ materially from any results expressed or implied by the information provided in our monthly sales reports and summarized in this news release and future news releases. In addition, reported retail sales are subject to seasonal trends. Consequently, reported retail sales for a particular month are not necessarily indicative of results to be expected for a full quarter or year. Please refer to our public filings with the U.S. Securities and Exchange Commission, including without limitation our Annual Report on Form 10-K for the year ended December 31, 2014 and our subsequent Quarterly Reports on Form 10-Q and Current Reports on Form 8-K, for additional information regarding our business. Investors should not assume that our disclosure of the information in this news release means that we have determined that such information is material to the Company.\nAbout AutoNation, Inc.\nAutoNation is transforming the automotive retail industry through bold leadership. We deliver a peerless automotive retail experience through our customer-focused sales and service processes. Owning and operating 293 new vehicle franchises, which sell 35 new vehicle brands across 15 states, AutoNation is America's largest automotive retailer, with state-of-the-art operations and the ability to leverage economies of scale that benefit the customer. As an indication of our leadership position in our industry, AutoNation is a component of the S&P 500 Index.\nPlease visit investors.autonation.com , www.autonation.com , www.autonationdrive.com , www.twitter.com/autonation , www.twitter.com/CEOMikeJackson , www.facebook.com/autonation , and www.facebook.com/CEOMikeJackson , where AutoNation discloses additional information about the Company, its business, and its results of operations.\nLogo - http://photos.prnewswire.com/prnh/20150602/220399LOGO\n releases/autonation-announces-reported-retail-new-vehicle-unit-sales-of-31032-in-august-2015-300136557.html\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://www.twitter.com/autonation", "http://investors.autonation.com/", "http://www.autonationdrive.com/", "http://photos.prnewswire.com/prnh/20150602/220399LOGO", "http://www.prnewswire.com/news-releases/autonation-announces-reported-retail-new-vehicle-unit-sales-of-31032-in-august-2015-300136557.html", "http://www.autonation.com/", "http://photos.prnewswire.com/prnvar/20150602/220399LOGO", "http://www.facebook.com/autonation", "http://www.facebook.com/CEOMikeJackson", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL92142&Transmission_Id=201509020700PR_NEWS_USPR_____FL92142&DateId=20150902", "http://www.twitter.com/CEOMikeJackson"], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T15:26:14.189+03:00", "highlightTitle": ""}