{"organizations": [], "uuid": "05ba4e1ed9e40dc32c6ee41d03efea29ce1cdb47", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25783", "country": "", "title": "Lufthansa rolls out GDS levy, claims interest in direct connectivity", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "Lufthansa rolls out GDS levy, claims interest in direct connectivity", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "05ba4e1ed9e40dc32c6ee41d03efea29ce1cdb47"}, "author": "Bangkok, September 2, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25783", "ord_in_thread": 0, "title": "Lufthansa rolls out GDS levy, claims interest in direct connectivity", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lufthansa rolls out GDS levy, claims interest in direct connectivity Bangkok, September 2, 2015 \nTHE Lufthansa Group – including Austrian Airlines, Brussels Airlines, Lufthansa and SWISS – yesterday implemented the controversial GDS levy of 16 euros (US$18) for any ticket issue via GDS. \n\nIn a press statement, Lufthansa claims that the efforts to develop and establish new “direct connect” booking channels are generating strong interest among the industry partners. \n\n“The market is clearly ready for innovations and developments of this kind,” said Jens Bischof, executive oard member and chief commercial officer of Lufthansa German Airlines. “Our realignment of our distribution has prompted an intensive exchange of views and experiences within our industry.” \n\n“This process has had its share of controversy, too,” Bischof admitted. “But we are still as convinced as ever that offering advanced and, at the same time, substantially cheaper additional booking channels – that also allow us to better present our products – is in our customers’ best interests.\" \n\nAccording to the release, customers of the Lufthansa Group can avoid paying for the new DCC by making their bookings via its member airlines’ websites, an airline service centre, or at an airport desk. \n\nThere will be no changes for corporate clients making their bookings at their individually-agreed contractual rates (i.e. with no DCC) via www.LH.com . The Lufthansa Group has also signed an agreement with Concur to provide corporate customer travel management units with special programmes for managing bookings from next year onwards.", "external_links": [], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T18:18:41.793+03:00", "highlightTitle": ""}