{"organizations": [], "uuid": "d13e32b477b0b9f8b2fab7d3adde4c2d03002c48", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63656/defunct-skygreece-airlines-issues-update-its-passengers", "country": "US", "title": "Defunct SkyGreece Airlines issues update for its passengers", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Defunct SkyGreece Airlines issues update for its passengers", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T22:35:00.000+03:00", "replies_count": 0, "uuid": "d13e32b477b0b9f8b2fab7d3adde4c2d03002c48"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63656/defunct-skygreece-airlines-issues-update-its-passengers", "ord_in_thread": 0, "title": "Defunct SkyGreece Airlines issues update for its passengers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Defunct SkyGreece Airlines issues update for its passengers   \nSep 11, 2015 eTN   \nTORONTO, Canada - Late last month SkyGreece Airlines, SA (\"SkyGreece\") made the difficult decision to temporarily suspend its operations. Since then the Company has been working to rebuild and resume services. In spite of its recent challenges, the Company looks forward to serving passengers again soon and to doing everything it can to take care of those passengers who have been recently affected. \nAs part of our commitment to rebuild, SkyGreece has filed a Notice of Intention to Make a Proposal and Ernst & Young Inc. has been appointed as the Trustee in the company's proposal proceedings. A Notice of Intention is the first stage of a restructuring process and allows the company to pursue a restructuring of its financial affairs and operations, through a formal Proposal to creditors. \nErnst & Young has set up the following website for affected passengers to file claims in the proposal proceedings: www.ey.com/ca/skygreece \nClaim forms are available on the website. SkyGreece encourages everyone affected to complete the form and return it to the Proposal Trustee at skygreece@ca.ey.com . \nSkyGreece is working with the Trustee to develop a restructuring plan. Although the success of the Company's restructuring effort cannot be assured, the restructuring proceedings are the best way to see that all parties, including passengers, are compensated fairly. Passengers whose flights have been cancelled are encouraged to contact their travel agent to make alternate travel arrangements. In the event any SkyGreece passenger requires additional or local assistance in a foreign country, the airline has arranged for the following independent travel agencies to assist passengers with booking alternate travel arrangements: \nNorth America", "external_links": [], "published": "2015-09-11T22:35:00.000+03:00", "crawled": "2015-09-11T22:36:13.732+03:00", "highlightTitle": ""}