{"organizations": [], "uuid": "8fff44df30eb760f4e1c09af113ff81a18e34f7d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/technology/28993-worldsim-launches-neuvo-smart-watch", "country": "US", "title": "WorldSIM launches Neuvo Smart Watch", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "WorldSIM launches Neuvo Smart Watch", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T11:30:00.000+03:00", "replies_count": 0, "uuid": "8fff44df30eb760f4e1c09af113ff81a18e34f7d"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/technology/28993-worldsim-launches-neuvo-smart-watch", "ord_in_thread": 0, "title": "WorldSIM launches Neuvo Smart Watch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WorldSIM launches Neuvo Smart Watch WorldSIM launches Neuvo Smart Watch Details Category: Technology Created on Thursday, 24 September 2015 09:30 Unlike other smart watches the WorldSIM Neuvo Smart Watch enables users to use their SIM card inside, meaning the wearer can leave their phone at home. This affordable design is packed with unique features and could even replace a smart phone – particularly useful while exercising, travelling or being out for the evening. \nWhat’s really different about the WorldSIM Neuvo smart watch is the impressive 380mah battery capacity, up to 32GB expandable memory, make and receive calls, SMS and the ability to search the web through the built in browser. As well as being very affordable, the Neuvo smart watch has also has plenty of features similar to the leading brands including the ability to see email notifications, make and answer calls, send SMS and manage their fitness. The Neuvo smart watch comes with an international SIM card inside so users can benefit from free international roaming in almost 100 countries as well as reduced SMS and data rates worldwide. Travellers can access everything they need from these smart watches including the internet, music, calls, data, camera and even video so they can leave their phone at their hotel if they want. Arif Reza, WorldSIM’s CEO commented “This is a game changer for many travellers and an exciting new step forward for WorldSIM. Staying ahead of customer needs is what makes us unique; innovation is the core part of our business and always will be.” WorldSIM Neuvo smart watches went on sale today and are available in three different colours. RRP £54.99. Related articles", "external_links": [], "published": "2015-09-24T11:30:00.000+03:00", "crawled": "2015-09-24T12:48:33.303+03:00", "highlightTitle": ""}