{"organizations": [], "uuid": "ef4728193a751a4709266d47ac89699825e43290", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03449/bcms-sale_3449351k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-25.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/business-reporter/11882881/selling-business-outcomes.html", "country": "US", "title": "How an intelligent sale opens doors for your business", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "How an intelligent sale opens doors for your business - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T20:31:00.000+03:00", "replies_count": 0, "uuid": "ef4728193a751a4709266d47ac89699825e43290"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/business-reporter/11882881/selling-business-outcomes.html", "ord_in_thread": 0, "title": "How an intelligent sale opens doors for your business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Read more at Business Reporter Where will your company be in two, three, five or 10 years’ time? The answer for many of BCMS’s clients – who are typically SME business owners, turning over between £1m and £100m – is simple: selling the business. Their goal – and consequently BCMS’s – is realising the potential of what may be their most valuable asset. It may sound controversial, but selling all or part of your business may be the best route to revitalising and rejuvenating the company you have built. And at the same time, you can secure the optimum outcome for you, your staff, and your customers. BCMS’s SME clients have multiple motivations for selling. Many are entrepreneurs and “ideas” people; great at spotting the opportunity, but perhaps less skilled in day-to-day business management. Selling your business may revitalise and rejuvenate the company you have built Many actually feel they have reached the limit of their abilities as a business owner. They sense what they need to do to grow their business, but lack the resources, funding or expertise to deliver. For some, there is no capacity in the business, and they are actually turning away lucrative new work. Others say that they feel their continued involvement is holding their business back. And here’s where a company sale can be the best route. BCMS has completed in excess of 500 successful transactions in the last decade alone. But selling a business the right way is not simply transactional. It’s about finding the right partner to transform your business. Interestingly, many acquirers are looking for partners, too. They are actively seeking strategic targets, with products, services and specialist skills that can complement their existing offering. BCMS negotiates with global corporates, stockmarket-listed plcs, private equity houses, and high net-worth individuals, on transactions ranging from full share sales to MBOs and “buy-and-build” investment deals. And because reasons for purchase are strategic, not just financial, major organisations do buy smaller SMEs. In recent deals in the tech sector (where acquirers have included Siemens and Dentsu Aegis) BCMS estimates that acquisition of a client added, on average, less than 1pc to the revenues of the buyer. As an established international business, BCMS searches globally for potential acquirers. Thirty per cent of its UK clients are now acquired by overseas organisations. There is clear, global appetite to acquire: successful deals in the last few months alone have seen UK businesses sell to acquirers in the US, Canada, Germany and Thailand, in sectors including healthcare, consultancy, manufacturing and software. Although the personal reasons for selling may differ from business to business, in the SME marketplace the reasons for buying are clearer: expansion, growth, access to new skills, customers and complementary expertise. It’s a point well made by Peter Jones of US firm LB Foster Inc, which acquired BCMS’s client TEW Engineering earlier this year. “There is a natural synergy, ambition and an underlying desire to work together in the markets we share,” he says. “We are eager to grow our business in the UK and European markets, and we have identified TEW Engineering as a perfect partner.” Selling is not closing the doors on your business. It is opening up a whole set of new ones.\" • David Rebbettes is founding director of BCMS Corporate. Call 01635 296 193 or visit www.bcmscorporate.com/approach • This article was originally produced and published by Business Reporter. View the original article at www.business-reporter.co.uk", "external_links": [], "published": "2015-09-25T20:31:00.000+03:00", "crawled": "2015-09-25T14:50:15.404+03:00", "highlightTitle": ""}