{"organizations": [], "uuid": "4f87b1bfafda99915ff15019926285c21609138a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/bddfdb6e177811243533892f82f6e945", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/airplane-seat-design-promises-faster-boarding-time-and-roomier-middle/story-fn6yjmoc-1227541572515?from=public_rss", "country": "IL", "title": "Clever idea to solve boarding hassles", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Clever idea to solve boarding hassles", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T02:52:00.000+03:00", "replies_count": 0, "uuid": "4f87b1bfafda99915ff15019926285c21609138a"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/airplane-seat-design-promises-faster-boarding-time-and-roomier-middle/story-fn6yjmoc-1227541572515?from=public_rss", "ord_in_thread": 0, "title": "Clever idea to solve boarding hassles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email a friend \nPLANE designers have been racing to discover the next wave of revolutionary aircraft interiors. \nWhether airlines want to save space, lighten their load or speed up boarding times, engineers have come up with dozens of solutions — and not all of them seem comfortable. \nThe latest seat design from US-based Molon Labe Designs claims it has the one-row-fits-all solution for airlines looking to save big money on fuel costs and make the boarding process more efficient. \nThe Side-Slip features a typical three-seat per row configuration, but, with the simple push of a button, the aisle seat glides over the middle seat creating a wider aisle — from the standard 19 inches to 41 inches. \n“I was travelling a lot, and I was always running late and just wanted to get off the plane faster,” Hank Scott, founder and CEO of Molon Labe Designs and inventor of the Side-Slip seat, told the Denver Post. \n“I just started thinking about it, and ideas popped into my head ... Now the line won’t stop. Just get out of the way and let people walk around you.” Move over ... Source: \nSide-Slip’s seat configuration not only features an adjustable aisle seat, but the middle seat is a roomier 20 inches wide. The aisle and window seats are 18 inches wide, in line with industry averages. \nThe flexible seats are being targeted at lower-cost airlines making multiple trips per day, usually less than three hours. Some carriers have cited turnaround time as a major obstacle to staying on schedule. \nScott believes with more an efficient boarding and deplaning process, the Slip-Seat configuration could save these airlines big money in the long run. \nThe US trade organisation Airlines for America estimates that every minute a plane sits docked at a gate with the engine running costs about $US81-100 ($115-143) in fuel and associated costs. \nThe Slip-Slide team conducted boarding efficiency trials with their aisle seats using the “sit anywhere” boarding method favoured by some airlines, and block boarding used by most carriers, with impressive results. \nWhen the sliding seats are fully folded up, boarding efficiency is improved by 4.5 minutes during random boarding and a full 6.7 minutes — or 33 per cent — for blocking boarding. If an airline performs 1,000 turnarounds a day, 6.7 minutes amounts to nearly $957,000 saved per day — about $350 million a year. \n“If you can offer a product that makes the airlines save fuel and increase revenue, and also makes the passengers more comfortable and less stressed — it’s a win-win,” said Scott. \nSide-Slip debuted their seats last week to hundreds of airline executives at the annual World Low Cost Airlines Congress in London. They are currently undergoing the Federal Aviation Administration’s certification process. \nThis story originally appeared on Fox News . Seat", "external_links": [], "published": "2015-09-24T02:52:00.000+03:00", "crawled": "2015-09-24T03:12:12.542+03:00", "highlightTitle": ""}