{"organizations": [], "uuid": "8abf66b381b294d4499ea0a4bb8c6f9d6c8b4f96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesswireindia.com", "main_image": "", "site_section": "http://businesswireindia.com/RSSFeeds/subcat-travel-tourism.xml", "section_title": "BusinessWire India.com - Travel & Tourism", "url": "http://businesswireindia.com/news/news-details/renaissance-hotels-debuts-north-india/45347", "country": "US", "title": "Renaissance Hotels Debuts in North India", "performance_score": 0, "site": "businesswireindia.com", "participants_count": 0, "title_full": "Renaissance Hotels Debuts in North India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T14:30:00.000+03:00", "replies_count": 0, "uuid": "8abf66b381b294d4499ea0a4bb8c6f9d6c8b4f96"}, "author": "", "url": "http://businesswireindia.com/news/news-details/renaissance-hotels-debuts-north-india/45347", "ord_in_thread": 0, "title": "Renaissance Hotels Debuts in North India", "locations": ["Lucknow India", "North India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Monday, September 21, 2015 5:00PM IST (11:30AM GMT) Renaissance Hotels Debuts in North India Tallest Hotel in Lucknow India \nRenaissance Hotels, a hotel brand known around the world for helping the next generation of business travelers to discover unexpected cultural experiences, announced today the opening of its first hotel in North India , in the city of Lucknow. With 16 floors and 112 stylish rooms, it is the tallest hotel to open in Lucknow and offers stunning views of the Gomti River and the city’s landscape. Renaissance Lucknow Hotel is the brand’s second hotel in India after almost 14 years, with the first Renaissance hotel being based out of Mumbai city. Marking the occasion said Mr. Rajeev Menon, Chief Operating Offer – South East Asia & Pacific for Marriott International. “Lucknow is fast emerging as a cultural and business hub in Uttar Pradesh and makes for the perfect location for a Renaissance Hotel. Renaissance Hotels is a global, lifestyle hospitality brand that seeks to inspire and provoke its guests to discover something new and different each and every time they visit.” The Renaissance Lucknow Hotel features a contemporary design that is juxtaposed against the heritage background of Lucknow. The centrally located hotel provides easy access to business hubs as well as popular leisure destinations in the city. Designed with refined sophistication and exuberant fun, Renaissance Lucknow Hotel has 96 tastefully appointed rooms and 16 suites that offer modern luxury and unparalleled convenience to its guests. All guest rooms feature cotton rich linen, 42-inch LED HD televisions, spacious work and seating areas along-with a modern three-point bathroom. The hotel features a variety of dining options that include L – 14 , the international cuisine all day dining restaurant; Sepia – the Awadhi speciality fine dining restaurant, Coffee & Cakes - the hotel patisserie that specializes in freshly baked pastries, sandwiches, cakes and brewed coffee; and the Sky Bar – the poolside bar located on the 16th floor offering exquisite wines, cheese boards and an exclusive range of International beverages. Leisure facilities at the hotel also include a well-equipped fitness centre, a yoga studio and a rooftop infinity pool and Jacuzzi. Conveniently located in Lucknow city centre, the hotel offers extensive facilities for social events and meetings . Spread over 26,000 sq ft, the versatile indoor and outdoor space features the Renaissance Hotels signature R.E.N. meetings program, designed to bring live entertainment and the best of the local destination to your business or social gathering. Dedicated event & wedding specialists, specialized services, customized menus and modern fittings ensure attention to the last detail. The hotel will also feature Renaissance Hotels exclusive NAVIGATOR concierge program and its recognized entertainment program, known for bringing the very best of music, arts, culinary and more into each of the brand’s 160 hotels around the world. “The Renaissance Lucknow Hotel brings a modern, new face of hospitality to Lucknow and is sure to set benchmarks in the city,” said Mr. Rahul Maini, General Manager, Renaissance Lucknow Hotel . “With our vibrant new F&B options, extensive leisure facilities and insights into the city, we are confident that the hotel will be a favourite for travellers and Lucknow residents alike”. RENAISSANCE HOTELS: Renaissance Hotels encourages guests to Live Life to Discover SM at 160 hotels in over 35 countries around the world. Each hotel is unique and every stay offers an opportunity to explore local discoveries exclusive to the destination. At Renaissance Hotels, we believe that every guest is a storyteller and we aim to deliver with unexpected experiences meant to be shared. Our signature events in our lobbies, bars and lounges are designed to showcase emerging talent in music, the arts, mixology, gastronomy and more to inspire new discovery. Renaissance Navigators are neighborhood experts who are ready to assist guests in discovering true local flavors and activities. R.E.N. Meetings offers groups an experience beyond a traditional meeting, rooted in creative sensory meeting design and custom-curated local Navigator excursions and networking events. At Renaissance Hotels, we work to ensure that every trip is transformed into an eye-opening, unforgettable journey. Renaissance Hotels believes that since you spend your life working, you should discover the world as you go. To discover more visit www.renhotels.com . For upcoming events visit www.renhotels.com/events . Like us on Facebook www.facebook.com/RenHotels . Follow us on Twitter www.twitter.com/RenHotels . Like us on Instagram www.instagram/RenHotels . For News Release background on RENAISSANCE HOTELS click here Tripti Pandey, Madison Communications Pvt. Ltd., +91-9820678871, tripti@fort.madisonindia.com", "external_links": [], "published": "2015-09-21T14:30:00.000+03:00", "crawled": "2015-09-21T16:55:23.364+03:00", "highlightTitle": ""}