{"organizations": [], "uuid": "7113b20d31bae1b4a337d669bc1617e19364efd5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29998170/isolux-corsan-consolidates-its-railway-business-in-india-with-the-award-of-three-electrification-contracts", "country": "US", "title": "Isolux Corsan Consolidates its Railway Business in India With the Award of Three Electrification Contracts", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Isolux Corsan Consolidates its Railway Business in India With the Award of Three Electrification Contracts - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "7113b20d31bae1b4a337d669bc1617e19364efd5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29998170/isolux-corsan-consolidates-its-railway-business-in-india-with-the-award-of-three-electrification-contracts", "ord_in_thread": 0, "title": "Isolux Corsan Consolidates its Railway Business in India With the Award of Three Electrification Contracts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Isolux Corsan\nMADRID , September 10,\nThe company will design and build a total of 563 Km of Over-Head Equipment, including five Traction SubStations and associated intelligent railway operations systems, in the States of Rajasthan and Karnata-Telengana\nThese three major rail electrification contracts awarded to Isolux Corsan, strengthens its position in India , where the Group is already a relevant player in the areas of T&D and transport infrastructure.\nIsolux Corsan, the global benchmark critical infrastructure contractor, has been selected by Rail Vikash Nigam Ltd (RVNL), Special Purpose Vehicle (SPV) wholly owned by Government of India under National Railway Board, for the design and construction of Over-Head Equipment, Traction Substations and associated intelligent railway operations systems in the major railway sections in State of Rajasthan and Karnata-Telengana.\n(Logo: http://photos.prnewswire.com/prnh/20150129/727670 )\nThe contract includes the engineering, procurement, construction, testing and commissioning of Over-Head Equipment, Switching Stations, Traction SubStations, SCADA, signalling, Telecommunication, Buildings and other associated works. The three projects involve 563 km of railway electrification and five traction substations.\nThe Electrification work includes Traction Substations and 25 kV AC Over-Head Equipment (OHE). Signalling and Telecommunication work includes Automatic Signalling, Electronic Interlocking, Train Detection using Multi Section Digital Axle Counters (MSDAC) and OFC based communication system. The Building works include Station Buildings, Substations Control Room buildings and Staff Quarters.\nOne project is located in section Rani to Swarupganj, in Ajmer Division of North Western Railway in the State of Rajasthan, including one Traction Substation and a total of 198 Km of High Rise (7.2m contact wire height) Traction Over-Head Equipment.\nThe other two projects are located in the State of Karnata-Telengana. One project is in the Hubli Division of South Western Railway. The works will be done in sections Hospet to Kudatini and Toranagallu to Ranjitpura, with a total of 187 Km of Track Railway Electrification and two Traction Substations. The other project is in the Guntakal Division of South Central Railway. The works will be done in section Kudatini to Guntakal, with a total of 178 Km of Track Railway Electrification and two Traction Substations.\nThese projects are part of a massive investment plan conceived by Government of India for rail sector to eliminate capacity bottlenecks on Golden Quadrilateral and Diagonals to provide strategic rail communication links to ports, construction of mega-bridges for improving communication to the hinterland and development of multi-modal transport corridors. This initiative has been given the name of National Rail Vikas Yojana.\nThese three major rail electrification contracts awarded to Isolux Corsan strengthens its position in India , where the Group is already a relevant player in the areas of T&D and transport infrastructure, the latter, with projects awarded over 120 million Euros .\nIsolux Corsan is firmly established as a leading specialist in High Speed railway throughout the world, with over 2,000 Km of high-speed railway electrification already in operation.\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://photos.prnewswire.com/prnh/20150129/727670", "http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201509098821&Transmission_Id=201509100630PR_NEWS_USPR_____enUK201509098821&DateId=20150910", "http://www.xmlnews.org/ns/"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-10T15:22:04.629+03:00", "highlightTitle": ""}