{"organizations": [], "uuid": "88cc14ef7868a1fef434f1d540d81286e41109e3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64179/ethiad-airways-showcases-its-innovation-europe", "country": "US", "title": "Ethiad Airways Showcases its Innovation in Europe", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Ethiad Airways Showcases its Innovation in Europe", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T16:56:00.000+03:00", "replies_count": 0, "uuid": "88cc14ef7868a1fef434f1d540d81286e41109e3"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/64179/ethiad-airways-showcases-its-innovation-europe", "ord_in_thread": 0, "title": "Ethiad Airways Showcases its Innovation in Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ethiad Airways Showcases its Innovation in Europe   \nSep 25, 2015   \n•Airline will showcase its cabin product innovations around Europe •The Etihad Airways Mobile Exhibition will visit nine key European markets \nEtihad Airways has launched a unique new mobile exhibition which will visit its key European markets to give commercial partners and consumers first-hand experience of the airline’s revolutionary new cabin products and inflight service elements. \nWeighing approximately 22 tonnes and measuring 50m², the 16m long mobile exhibition includes full-size mock-ups of The Residence, the world’s only three-room cabin on a commercial airline, and the First Apartment – both currently onboard the airline’s A380 fleet, and also the B787 First Suite. \nThe Business Studio and Economy Smart Seat, which feature on both aircraft types, are also displayed. \nPeter Baumgartner, Etihad Airways’ Chief Commercial Officer, said: “Our cabin products have captured the world’s imagination, setting a new standard in sophisticated flying. \n“The Etihad Airways Mobile Exhibition will give our corporate and industry partners an understanding of the innovation and creativity which went into designing these industry-leading cabins.” \nThe first phase of the tour will commence on 24 September in Switzerland’s commercial capital Zurich, in time for the start of the Zurich Film Festival, of which Etihad Airways is a major sponsor. \nIt will then head to Munich, Frankfurt, Hannover, Düsseldorf, Paris, Lyon, Strasbourg, Cannes, Milan, Torino and Bologna, ending in Amsterdam on 14 December. \nThe second phase, beginning in January 2016, will see the Etihad Airways Mobile Exhibition visit the UK, Ireland, Belgium and Spain, followed by repeat visits to the cities included in the first phase of the tour. \n“We are delighted to commence this tour in Switzerland, which is world renowned for design, craftsmanship, hospitality and generosity of spirit. These are all core elements of the Etihad Airways brand and service philosophy, now brilliantly showcased in this mobile exhibition.” \nThe mobile product exhibition allows Etihad Airways to bypass the logistical constraints of transporting cabin mock ups to multiple locations, taking its ground-breaking premium products directly to target markets, trade events, and exhibitions. \nThe mobile exhibition vehicle will be painted in Etihad Airways’ ‘Facets of Abu Dhabi’ corporate colours, ensuring optimal exposure of the airline’s branding as it makes its way around Europe.", "external_links": [], "published": "2015-09-25T16:56:00.000+03:00", "crawled": "2015-09-25T19:37:01.413+03:00", "highlightTitle": ""}