{"organizations": ["Cabot Trail", "Fortress of Louisbourg The Fortress of Louisbourg", "Fortress of Louisbourg", "Dundee", "Bell Bay", "McDonalds", "Parks Canada"], "uuid": "15ab607b550b2c8394f257743afb6653ba1cf5c2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gocanada.about.com", "main_image": "http://f.tqn.com/y/gocanada/1/S/h/L/-/-/172341756.jpg", "site_section": "http://z.about.com/6/o/m/gocanada_t2.xml", "section_title": "About.com Canada Travel: What's Hot Now", "url": "http://gocanada.about.com/od/novascotia/tp/things_to_do_cape_breton.htm", "country": "US", "title": "Canadian Travel: 10 Things You Must Do in Cape...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Canadian Travel: 10 Things You Must Do in Cape...", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T14:05:00.000+03:00", "replies_count": 0, "uuid": "15ab607b550b2c8394f257743afb6653ba1cf5c2"}, "author": "", "url": "http://gocanada.about.com/od/novascotia/tp/things_to_do_cape_breton.htm", "ord_in_thread": 0, "title": "Canadian Travel: 10 Things You Must Do in Cape...", "locations": ["France", "North America", "Cape Breton", "Baddeck", "Nova Scotia", "Cape Breton National Highlands Park", "St. Lawrence", "Le Portage", "Cape Breton Cape Breton", "New World", "Louisbourg", "Atlantic Ocean"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Cabot", "Cape Bretoners", "Ashley McIsaac", "Stan Rogers", "Pete Ryan", "Robert Rushton/E", "Rita McNeil", "Scott McLean"], "text": "Things to Do in Cape Breton Cape Breton offers up local culture, food and nature to enjoy. Sign Up for our Free Newsletters Thanks, You're in! Health Tip of the Day Sign up There was an error. Please try again. Please select a newsletter. Please enter a valid email address. Did you mean ? Expert Videos Much of the charm of Cape Breton comes from the people that live there. Just interacting with Cape Bretoners is an activity to be enjoyed. Of course the natural beauty of the island and its location doesn't hurt either. Whether you're looking for a party or want to drink in the culture and scenery, here is a list of things to do in Cape Breton. Robert Rushton/E+/Getty Images 1. Do the Cabot Trail Named for explorer John Cabot, the Cabot Trail winds around the northern end of Cape Breton island. Drivers or hardy cyclists begin and end at many points in the circuit, but typically do so at the town of Baddeck. The 300 km (185 mi.) long Cabot Trail is famous for the vistas it offers of the Gulf of St. Lawrence, the Atlantic Ocean and lush landscapes, particularly spectacular in fall. The Cape Breton National Highlands Park is at the trail's most northern points and where the trail reaches its highest elevation. The trail takes a few hours to drive, but tourists generally spend a day or two, stopping in at one or two of the towns along the way. Photograph by Pete Ryan / Getty Images 2. Visit the Fortress of Louisbourg The Fortress of Louisbourg is an unexpected treasure for visitors to Cape Breton. One of the busiest harbours in North America during the 18th century and one of France’s key economic and military centres in the New World, today the Fortress of Louisbourg is North America’s largest historical reconstruction. Visitors get a good feel for what life was like in the 1700s through displays, on-site interpreters in costume, and even a restaurant serving up traditional fare. The fortress is in the town of Louisbourg and part of Parks Canada system of national parks. More » 3. Feast on Lobster If you like lobster, you can eat it morning, noon and night in Cape Breton (McDonalds even serves up a McLobster sandwich, which is a cold, real-lobster sandwich). Lobster is caught fresh daily in Cape Breton May through July but seafood is always plentiful as the industry thrives year-round on mainland Nova Scotia. You'll see lobster dinner signs across the island, especially along the coast. 4. Go to the Celtic Colours Festival If you visit Cape Breton in October, you can take in the vibrant red, yellow and oranges of the fall foliage and partake in one of Nova Scotia's biggest festivals. Celtic Colours celebrates Cape Breton's celtic heritage through music, food, culture and a late-night party back in Baddeck, the centre of the action during the festival. More » 5. Check out a Ceildh (pronounced Kay-lee) If you visit Cape Breton, you'll understand how big a role music plays in the lives of its residents. Popular acts like Rita McNeil, Stan Rogers, and Ashley McIsaac were either born in Cape Breton or lived there and became influenced by the music. One of the most authentic experiences for a visitor is to attend a ceilidh (pronounced \"kay-lee\"). These casual musical get-togethers take place in town halls, pubs and barns across the island on any given night and are open to all. There's even Ceilidh Trail - a route along Cape Breton's scenic west coast from the Canso Causeway to the Cabot Trail. More » 6. Golf the Fab Four Cape Breton is a top Canadian golf destination. The Maritime island boasts the \"Fabulous Foursome\" - Highlands Links, Bell Bay, Le Portage and Dundee. Three of these four courses are on the Cabot Trail, all have splendid views of the water, and all are open to the public. More » Photo © Scott McLean 7. Go Whale Watching \nSurrounded by the Atlantic Ocean, Cape Breton waters are some of the best places to catch sight of a whale or go on an organized tour, such as Love Boat Whale & Seaside Cruise in Cheticamp. 8. Visit the Miners Museum Located in Glace Bay, the Miners Museum offers visitors the chance to experience the life of miners through an interactive tour of an actual mine and miner family housing.Cape Breton has a rich history of coal mining, dating back to the 1700s and continuing to the 1980s when the last mine closed. Tours are given by former miners, giving the experience added authenticity.People with an aversion to cramped, damp spaces or extremely tall people may have trouble doing the tour, as the tunnels are about 5 feet high. More » Photo courtesy Glenora Distillery 9. Lunch & Whisky Tasting at the Glenora Distillery Glenora produces Canada's only single malt whisky: Glen Breton Rare Canadian Single Malt Whisky. The distillery is scenically situated in the hills of Glenville, Cape Breton, and includes an inn, pub and dining room. Even if you're not interested in whisky, the distillery offers great food, including a fine seafood chowder (not too creamy), and local draft on tap. More » The beauty and serenity of Cape Breton attracts many artists there. Especially along the Cabot Trail, stop by some of the many shops along the way for one-of-a-kind jewelry, paintings, clothing, wood bowls, baskets, pottery and more. More » Related Articles", "external_links": [], "published": "2015-09-14T14:05:00.000+03:00", "crawled": "2015-09-14T16:50:35.555+03:00", "highlightTitle": ""}