{"organizations": [], "uuid": "766f341eb962be66c7eb8d5e80d4d1b34d75cae9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03433/marston1_3433741k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/cottages/11851732/Morston-Barn-Morston-Norfolk-review.html", "country": "US", "title": "Morston Barn, Morston, Norfolk: review", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Morston Barn, Morston, Norfolk: review - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T19:00:00.000+03:00", "replies_count": 0, "uuid": "766f341eb962be66c7eb8d5e80d4d1b34d75cae9"}, "author": "Sophie Butler", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/cottages/11851732/Morston-Barn-Morston-Norfolk-review.html", "ord_in_thread": 0, "title": "Morston Barn, Morston, Norfolk: review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Telegraph expert rating: 8/10 Although within five minutes’ walk of National Trust-owned Morston Quay, the starting point for seal boat excursions to Blakeney Point, this barn is quietly tucked down a small lane and well protected from the peak season day-trippers who flock into this pretty coastal village on sunny days. A beautifully-designed barn conversion, it offers plenty of communal space, a sheltered garden and large picture windows. For foodies, the proximity to Morston Hall, with its Michelin-starred restaurant, is a big bonus. An atmospheric inn specialising in local seafood and game, is also within walking distance. Location: 8/10 Next to the coast road, yet undisturbed by traffic noise, the barn is just over a mile away from Blakeney’s quayside and shops, and well located for exploring the best of the north Norfolk coast, including the sandy beaches at Wells-next-the-Sea and Holkham (a 15-20 minute drive). An excellent base for walkers, the coastal footpath runs to the east and west of the village, and there’s a sailing school located next to the quay. Style & character: 8/10 A long living-dining area is the heart of this imaginatively-converted barn: at one end, a kitchen with Aga and butler’s sink; at the other a cluster of sofas and easy chairs grouped around a wood-burning stove. Morston Barn's vast open living space makes it perfect for a group Exposed walls, original rafters and stripped wooden floors combine with nautical colours and fish-themed artwork to give a seaside feel. Three large French doors open onto a broad, part-gravel garden and large parking area (not ideal for children who want to kick footballs, but table-tennis is provided in open-sided cart barns). A second sitting room upstairs is equipped with plenty of books and offers a quiet retreat. Five airy bedrooms include two ensuites with low-slung, king-size beds. A twin room in the attic is a cosy hideaway for older children. Facilities: 7/10 The kitchen is spacious and well-equipped - there’s both an oil-fired Aga and separate electric Aga cooker - plus a large fridge-freezer and a separate utility room with washer-dryer. Two wood burners are useful for chillier weeks. Morston has kept the high ceilings of the original barn Value for money: 7/10 From £1,500 per week in low season; rising to £2,845 in high. Cheaper three-night breaks are available out of peak season. Family-friendly: 8/10 Good for large families or two sharing. Games and DVDs are provided. Eating Morston Hall and the Anchor Inn are within two minutes’ walk. The nearest shops are in Blakeney, which has a fishmonger, delicatessen and a small supermarket. Access for guests with disabilities? Two twin rooms on the ground floor. The ground-floor bathroom has a walk-in shower, but it isn’t specially adapted. Details Bingham Lane, Morston, Norfolk, NR25 7AA Blakeney Cottage Company Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-09-09T19:00:00.000+03:00", "crawled": "2015-09-09T14:28:29.601+03:00", "highlightTitle": ""}