{"organizations": [], "uuid": "8fcaa8881037d855199e290f780698b7ce36b244", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/11/Anantara-Bophut-Full-Moon-Restaurant-low-res.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/step-beyond-pub-street-to-uncover-siem-reaps-foodie-scene-with-anantara-angkor-resort/", "country": "US", "title": "Step Beyond Pub Street to uncover Siem Reaps foodie scene with Anantara Angkor ResortTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Step Beyond Pub Street to uncover Siem Reaps foodie scene with Anantara Angkor ResortTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "8fcaa8881037d855199e290f780698b7ce36b244"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/step-beyond-pub-street-to-uncover-siem-reaps-foodie-scene-with-anantara-angkor-resort/", "ord_in_thread": 0, "title": "Step Beyond Pub Street to uncover Siem Reaps foodie scene with Anantara Angkor ResortTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Step Beyond Pub Street to uncover Siem Reaps foodie scene with Anantara Angkor Resort Published on : Wednesday, September 16, 2015\nCambodia’s cuisine is influenced by its rich Khmer and French colonial history but to truly enjoy authentic Cambodian food in Siem Reap it’s a good idea to take Anantara Angkor Resort’s Vespa Foodie Tour which combines a unique culinary trip with the added appeal of gaining insider knowledge from a local’s point of view.\nGuest’s will taste authentic savoury fried noodles, chive cakes and sinfully delicious sweets in a variety of off-the-beaten-locations; from street vendors, local night markets to a lesser known yet popular with local’s restaurant.\nComfortably seated on the back of a Vespa, experienced drivers safely glide along Siem Reap’s streets and alleys, driving guests to lesser known restaurants and local haunts, making this an unusual and magical experience guests will remember long after they’ve left Cambodia.\nThe Vespa Foodie Tour begins amidst the hustle and bustle of Siem Reaps local night market which is brimming with vendors, colourful produce, fresh herbs and exotic spices. Guests will be given not only a glimpse of local night life, but also an introduction to French baguettes and an array of fruits, herbs and spices used to create the distinctive piquant flavours of Cambodian cuisine.\nThe next stop on the tour is a visit to specialist grill vendor to taste freshly prepared meat and seafood appetizers. This delicious treat is best sampled with local Angkor beer. The tour then takes guests to a clandestine restaurant hidden between bars and nightclubs, renowned for its quality Khmer dishes, savoury rice, seafood grilled to perfection, rich Cambodian chicken curry flavoured with Kroeung, a distinctive spice paste made from lemongrass and galangal, and to top of the evening, guests are treated to a musical performance.\nThe last stop on the foodie tour, is a visit to a residential home for dessert. Khmer sweets as they’re known include taro and wine infused rice pudding, and tropical banana, mango and coconut desserts.\nSource:- Anantara", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T11:24:35.773+03:00", "highlightTitle": ""}