{"organizations": [], "uuid": "525d6f13017a5464881c6ea6f1fa0ed6856b8596", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150921Gardeningworms.jpg", "site_section": "http://www.ticotimes.net/categories/topics/health", "section_title": "Health Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/09/21/the-most-earth-friendly-way-to-supercharge-your-soil", "country": "US", "title": "The most Earth-friendly way to supercharge your soil", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "The most Earth-friendly way to supercharge your soil -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T16:00:00.000+03:00", "replies_count": 0, "uuid": "525d6f13017a5464881c6ea6f1fa0ed6856b8596"}, "author": "Ed Bernhardt", "url": "http://www.ticotimes.net/2015/09/21/the-most-earth-friendly-way-to-supercharge-your-soil", "ord_in_thread": 0, "title": "The most Earth-friendly way to supercharge your soil", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "See also: Not a gardener? No space? Try this simple at-home salad bar\nIn the virtual gardening circle, the terms “biochar” and terra preta have been receiving a great deal of attention. It all started when archeologists in the Amazon discovered the remains of indigenous settlements whose agricultural lands where distinctly different from the surrounding soils. They called this rich, black fertile soil terra preta , which is very high in carbon and humus, a complex soil community of bacteria, fungi, protozoa and earthworms.\nResearchers believe these early agriculturalists cleared their lands by making charcoal from dense tropical biomass and then returning it to the soil to improve their crops. Making charcoal is an ancient practice for cooking, heating and agriculture. Wood and other organic wastes can be burned in a kiln without the presence of oxygen, which turns the material into charcoal – unlike ashes, which are produced by a regular fire.\nYou can view many tutorials online about building your own kiln for home use. The Ministry of Agriculture here in Costa Rica has also promoted a home garden system using bio-char made from rice hulls, which is used to grow plants in a nutrient-rich water solution. Red clay soils can also be improved by adding biochar to garden beds along with minerals and compost. As the red clay soil becomes fertile, it changes to a rich, dark brown color as the humus is restored. That brown to black color of soil indicates how much carbon (black) is present in the humus. Charcoal can act as a matrix building material for humus.\nMany advocates have promoted biochar as a “carbon negative” initiative, stating that it could save the climate and boost food production by storing carbon in the soil, but many of their calculations have now been challenged. Addressing climate change turns out to be not just about curbing the rise of CO2, but also about keeping oxygen levels up, which only green plants and phytoplankton can do. Making biochar also has its downside: it gives off lots of heat and dense smoke, which is high in creosote. Pulverized charcoal can also pose a health risk for your lungs, so be sure to use a protective mask when handling charcoal. And remember that biochar alone is not a magic bullet for soil fertility. Biochar needs compost and biological cultures of soil organisms to activate the production of humus.\nWhen we compare earthworm composting to biochar we can see several positive aspects to the former. Earthworms break down organic material into humus through enzymatic processes with minimal heat and no smoke. Earthworm compost is safe to handle and is a complete fertilizer. Earthworms continue to grow and populate the soil without much effort on the part of the gardener. It’s like having thousands of little friends in your soil working day and night to produce carbon rich humus and nutrients for the plants.\nSo why isn’t worm composting as trendy as biochar? Perhaps it’s a deep, cultural taboo we have against these little creatures, which prevents us from perceiving their true value in our web of life on planet earth. I always enjoy introducing earthworms to children. At first they yell and scream at the sight of these critters, but at the end of the gardening session, you can see the delight in their eyes when they overcome another unfounded fear of the world around them.\nFortunately, there’s a growing silent revolution happening as folks once again learn to become skillful gardeners like our ancient ancestors. Online you’ll also find plenty of tutorials on worm composting. Once you have a worm composting system going that’s right for your home garden, it’s quite easy to live in harmony with the earthworms and harvest their super compost fertilizer.\nYou can also find more seeds and books on tropical gardening and tropical medicinal plants by accessing our website: www.thenewdawncenter.info . And we’ll try to answer your gardening questions at: thenewdawncenter@yahoo.com\nUntil next time, happy gardening in Costa Rica!\nRead more of Ed Bernhardt’s monthly Home Gardening columns here .\nFor more information on tropical gardening – naturally – visit Ed at http://thenewdawncenter.info/blog.html or contact him at the newdawncenter@yahoo.com.", "external_links": ["http://www.thenewdawncenter.info/", "http://thenewdawncenter.info/blog.html"], "published": "2015-09-21T16:00:00.000+03:00", "crawled": "2015-09-21T14:22:23.082+03:00", "highlightTitle": ""}