{"organizations": ["Local Corporation By Steve Stephens Dispatch"], "uuid": "0b0fa887126c7f06298dda6bada3850857a72dfb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/09/04/1-guide05----packing-effectively-art-g44133rpt-101-packing-effectively-clh-jpg.jpg", "site_section": "http://www.dispatch.com/content/syndication/lae_travel.xml", "section_title": "The Columbus Dispatch Travel Feed", "url": "http://www.dispatch.com/content/stories/life_and_entertainment/2015/09/05/1-how-to-lug-less.html", "country": "US", "title": "Guide to Life: How to pack efficiently when traveling", "performance_score": 0, "site": "dispatch.com", "participants_count": 0, "title_full": "Guide to Life: How to pack efficiently when traveling", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T19:36:00.000+03:00", "replies_count": 0, "uuid": "0b0fa887126c7f06298dda6bada3850857a72dfb"}, "author": "", "url": "http://www.dispatch.com/content/stories/life_and_entertainment/2015/09/05/1-how-to-lug-less.html", "ord_in_thread": 0, "title": "Guide to Life: How to pack efficiently when traveling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Powered by Local Corporation By Steve Stephens Dispatch • Friday September 4, 2015 12:36 PM \nTravelers have a lot on their minds: catching the flight; finding the hotel; calculating the tip for — well, just about everyone along the way. \nCompared with such worries, packing might seem a small concern. \nStill, deciding what — and what not — to put into a suitcase can be a big deal, especially for air travelers in an era of security checks and baggage fees. \nIn fact, entire books have been written about the finer points of packing — one of them by Anne McAlpin. \nMcAlpin — who as the author of Pack It Up: Travel Smart, Pack Light (Flying Cloud, 150 pages, $19.95) also maintains the website www.packitup.com — has shared her expertise at many travel shows nationwide, including the AAA Great Vacations Travel Expo in Columbus. \n“Everybody tends to overpack,” McAlpin said recently from her Oregon home. \nOverpacking can cost the traveler not just in the inherent hassle of lugging too much stuff but in cold, hard cash. Air travelers are allowed one carry-on bag and one personal item. \nMost airlines charge for checked bags, and all have weight limits — usually 50 pounds a bag. Exceed that, and you’ll find yourself paying an extra $100 or more to get the bag to your destination and paying again to get it back home. \n“A luggage scale is one of the best gadgets you can buy for traveling,” McAlpin said. \nA small scale, often costing less than $20, is designed to be easily packed, of course. \n“It adds literally 8 ounces, and it saves so much stress if you’re worried about your bags being overweight. You see people all the time pulling things out at the ticket counter, trying to lighten overweight bags. It’s sad.” \nBaggage fees contribute a lot to airline profitability, said Thomas Spagnola, a travel expert for the online travel agency CheapOair. \n“You’ve got to check the policies of the airline you’re flying with, especially if you’re a larger family or traveling with a lot of luggage,” he said. “When you get into paying for a second or third (checked) bag, you can get into a tremendous amount of money.” \nEven frequent fliers can be tripped up when flying on an unfamiliar airline. \n“The airlines have so many different rules, and they are changing all the time,” cautioned Elizabeth Blount McCormick, owner of Uniglobe Travel Designers in Columbus. \n“Be sure you check the airline website and know the baggage policy.” \nMcCormick, like many other frequent fliers, has her own system for packing. \nAlthough many experts suggest rolling clothing instead of folding — for easier, more compact packing — McCormick prefers a combination of rolling and folding. \n“I’ve tried rolling up everything in the bag,” she said, “but some items always end up with wrinkles that won’t come out.” \nShe rolls only the items that won’t wrinkle (or won’t show) — such as undergarments and workout clothes — and uses those to create a base at the bottom of her bag along with heavier items, such as shoes. \n“Then you can fold the other clothes and put them on top of the base,” she said. “To prevent more wrinkles, I use tissue paper and plastic from dry cleaners. \n“Who wants to iron when you get to your destination?” \nDeciding which clothes to take — and how many — can also be a challenge. \nMcAlpin’s top packing tip: Wherever you’re going, however long you’re staying, pack for no more than a week and, if necessary, do laundry. \nAnother McAlpin top tip: “Pack three tops to every bottom. That has changed my life.” \nAnd, related to this tip: “Bring basic items you can intermingle with each other — instead of those really loud, unique pieces which make you stand out but which you can’t mix and match.” \nTry leaving behind things that aren’t absolutely necessary, McAlpin said. \n“I use a hair dryer every day, but I haven’t packed one in 20 years,” she said. “There’s a hair dryer in just about every hotel in America. \n“If you are particular about one thing, though — if you really need your familiar hair dryer — go ahead and make that a priority, but leave something else behind.” \n“Remember, if you’re going to a nice hotel,” McCormick said, “they’ll have nice soap and shampoo, so you don’t need to pack those. \n“Even toothpaste and a toothbrush are things you can get from the front desk” of many hotels, she said. \nWhen traveling with family or friends, McAlpin suggested, distribute each person’s items among several bags, so no one would lose all of his or her stuff if one bag were to go missing. \nAnd always carry an empty, lightweight, collapsible or foldable bag as an extra, in case you buy souvenirs or other items during the trip. \nIf you do check bags, some items should absolutely be kept in your carry-on: Medications, valuables, electronics, keys and identification should stay with you, in case a checked bag is lost. \nBut remember that all liquids carried through airport security must fit inside one 1-quart transparent, resealable bag. And the containers inside the bag can be no larger than 3.4 ounces each. \nFinally, McCormick said, be sure to carry a smile. \n“It doesn’t have anything to do with packing, but kindness will get you through a lot of situations,” she said. “Try being nice and smiling at that TSA officer, that gate agent. \n“Not only does it make traveling more pleasant, but, if your bag does weigh in at 55 pounds, he may just let you through.” Tips for air travelers \nRolling clothes allows more to fit in a smaller space. The rolled items can also act as a cushion for delicate gear, such as a camera. Toiletries go into one 1-quart clear zippered bag. Place them near the outside; you’ll need to take them out when you pass through security. The same goes for a laptop computer. Make sure that items such as keys and passports are secure; zip them into inner pockets. For convenience, put all your charging cables into one small drawstring bag, Make sure you can easily access the cable bag if you plan to recharge or plug in on the plane. \nFlying out of Columbus? \nTravelers flying from Port Columbus on domestic or Canadian flights can take one carry-on bag and one “personal” item — such as a purse, small backpack or laptop computer bag — aboard the aircraft for free. \nPersonal item \nThe item must fit completely under the seat. \nCarry-on bag \nThe carry-on size limit is 22 by 14 by 9 inches for American, Delta, United and US Airways flights. Southwest fliers get a slightly more generous 24 by 16 by 10 inches. Air Canada flights allow a bag 21.5 by 15.5 by 9 inches. The size includes the handles and wheels. \nLuggage charges \nSouthwest offers to check two bags free. Other airlines serving Port Columbus charge most customers for checked baggage — usually $25 for the first bag and $35 for the second — on flights within the United States and Canada. \n@SteveStephens", "external_links": [], "published": "2015-09-04T19:36:00.000+03:00", "crawled": "2015-09-04T19:49:04.532+03:00", "highlightTitle": ""}