{"organizations": [], "uuid": "2557e4925204a934706a5446f9dd325bc83327f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/i/x/h/x/image.related.StuffLandscapeSixteenByNine.620x349.16i39a.png/1441252560928.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/asia/71387902/Lantau-Island-Hong-Kongs-quiet-side", "country": "AU", "title": "Lantau Island: Hong Kong's quiet side", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Lantau Island: Hong Kong's quiet side", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T20:00:00.000+03:00", "replies_count": 0, "uuid": "2557e4925204a934706a5446f9dd325bc83327f3"}, "author": "Liz Light", "url": "http://www.stuff.co.nz/travel/destinations/asia/71387902/Lantau-Island-Hong-Kongs-quiet-side", "ord_in_thread": 0, "title": "Lantau Island: Hong Kong's quiet side", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lantau Island: Hong Kong's quiet side LIZ LIGHT Last updated 05:00, September 6 2015 Liz Light \nNgong Ping 360 makes the journey up to Muk Yue Shan Peak, Po Lin Monastery and the Big Buddha. \nI love Hong Kong's audacious verticality, its full-on frenetic fuss, the double-decker buses, pacy taxis, pedestrian overpasses and crowded shopping malls. It's a big, noisy, vibrant city. But, after a few days, I'm buzzed out and wish for something slower, quieter and green. \nThe cable car taking us across the green hills of Lantau Island is totally transparent and completely soundless. There is a travelling-in-a-bubble effect that is exciting and it's odd to see everything passing below our feet. It is hilly terrain covered in bush and, from time to time, we see less lazy people walking up an ancient pilgrim path. Some are devotes on their way to Po Lin Monastery, easy to recognise because they have shaved heads and are wearing grey. \nLantau is the biggest of Hong Kong's many outlying islands (it is twice the size of Hong Kong island) and more than half of it is designated Country Park. Its sparsely populated greenness is a dreamy contrast to high-density Hong Kong. The cable car, Ngong Ping 360, makes a 5.7 kilometre journey from Tung Chung, near Hong Kong airport, to Muk Yue Shan Peak, Po Lin Monastery and the Big Buddha. Liz Light \nThe richly decorated interior of Po Lin Monastery. \nWe exit the bubble near a serenely smiling, dignified Big Buddha (34 metres high) sitting in the middle of a lotus flower on a hill top. The enormity of it has a wow factor and I'm impressed with its artfulness. \nThe size of the Big Buddha makes it an ambitious engineering project – he is made of 260 bronze pieces, joined seamlessly, and his face has gold mixed with bronze to give it an extra gleam. He has elongated earlobes, symbolising wisdom, and his right hand is raised, representing the removal of affliction. This Buddha is peacefully beautiful, as are the numerous kneeling maidens – eyes lowered and arms outstretched, hands holding gifts – that circle the Buddha on a lower level. \nPo Lin translates to Precious Lotus. The lotus, an exquisite flower that grows in muddy ponds, is a symbol of purity; anyone is able to attain enlightenment regardless of the murky depths from which they come. Two Po Lin temples face each other across a wide palm-fringed courtyard. They are bright and busy, painted orange, red, blue and gold. The upturned corners of the yellow-tiled roofs are decorated with animals and birds, symbols of the belief that no living creature should be harmed. Liz Light \nStilt houses are built on estuary edges above the water in Tai Ho, a traditional fishing village. \nA young woman standing, hands pressed together and clasping a bunch of burning incense, has tears pouring down her anguished face. I get watery-eyed observing her sorrow and wonder what grieves this pretty wearer of tight jeans and a pink T-shirt emblazoned with kitty cartoons. \nThe temple interior, though dark, is rich with colour. Angels and dragons frolic across the ceiling and gold-leaf-covered Buddhas, in dark corners, glimmer to the glow of hundreds of tiny oil candles. \nOn a more mundane note, lunchtime is long past and I'm hungry. Tai O fishing village is a curly but inexpensive taxi ride down the mountain. Tai O is one of Hong Kong's few remaining traditional fishing villages where stilt houses are built on estuary edges above the water and fishing boats are tied up to most back verandas. Though the village dates back hundreds of years it has a temporary, dishevelled ambience (it has been burnt out by fires, flooded and blown away in typhoons) and, one suspects, there are no building codes here. Liz Light \nA feline resident keeps watch over the goings-on in Tai Ho. \nArriving hungry is ideal because strolling along its lanes is a street-food extravaganza. Initially, the focus is on seafood; skewers of abalone, scallops, baby squid, prawns and sardines are all braised over charcoal fires. Then I see steamy caldrons full of cuttlefish, suckered tendrils and ballooned bodies, boiling in a pink spicy soup. The seafood pancakes are delicious and cooked while I watch. Ad Feedback \nNumerous shops sell dried seafood, including salted fish that people from Hong Kong buy enthusiastically; this local delicacy is cheap here. \nThe sweet-treat cuisine is further into the heart of the village where people queue for potato-shaped piping-hot donuts doused in icing sugar and small, round, waffles straight from the waffle pan. Liz Light \nStrolling along Tai Ho's lanes is a street-food extravaganza. \nBeyond that Tai O loses its shop-street ambience and becomes suburban. Stilt houses have laundry flapping in the breeze on their over-water verandas, pot plants are bright with bougainvillea and I hear chatter and the clatter of mah-jong tiles as a group of older ladies engage in late-afternoon four winds battles. \nThis is a world away from high-revving Hong Kong but it's time to head back there. The Number 1 bus goes to Mui Wo, then it is a gentle, hour-long ferry ride to Central. Full tummy, big day, the lull of the boat and motion of the sea; I'm soon snoozing. \nFact file \nGetting there Fly to Hong Kong on Cathay Pacific. cathaypacific.co.nz \nStaying there Hong Kong Harbour Grand, on Hong Kong Island, has great views, beautiful rooms and terrific breakfasts. harbourgrand.com \nBeing there To get to Lantau Island, take the train to Tung Chung then the Ngong Ping 360 cable car to the Big Buddha. Then taxi to Tai O. There are good restaurants in Tai O or just cruise the food stalls. Return to Hong Kong by bus to Mui Wo (on Lantau Island) then get the ferry back to Central. \nMORE INFORMATION discoverhongkong.com is a terrific website with loads of info about Hong Kong. - Stuff", "external_links": [], "published": "2015-09-05T20:00:00.000+03:00", "crawled": "2015-09-07T21:36:52.353+03:00", "highlightTitle": ""}