{"organizations": [], "uuid": "08b0c5fd721a6b45bc658bd0ee261406eb57734b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/technology/28660-china-s-leading-travel-e-commerce-aggregator-shijie99-partners-with-amadeus-as-it-eyes-global-expansion", "country": "US", "title": "China’s leading travel e-commerce aggregator Shijie99 partners with Amadeus as it eyes global expansion", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "China’s leading travel e-commerce aggregator Shijie99 partners with Amadeus as it eyes global expansion", "spam_score": 0.0, "site_type": "news", "published": "2015-09-07T17:15:00.000+03:00", "replies_count": 0, "uuid": "08b0c5fd721a6b45bc658bd0ee261406eb57734b"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/technology/28660-china-s-leading-travel-e-commerce-aggregator-shijie99-partners-with-amadeus-as-it-eyes-global-expansion", "ord_in_thread": 0, "title": "China’s leading travel e-commerce aggregator Shijie99 partners with Amadeus as it eyes global expansion", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "China’s leading travel e-commerce aggregator Shijie99 partners with Amadeus as it eyes global expansion China’s leading travel e-commerce aggregator Shijie99 partners with Amadeus as it eyes global expansion Details Category: Technology Created   15:15 Amadeus’ cutting edge search technology and leading content to power Shijie99’s growth in international markets China’s burgeoning travel sector takes another global leap as Amadeus signs an agreement with Shijie99, China’s leading travel e-commerce aggregator, to power their international growth. The multi-year agreement will include the provision of extensive air content via Amadeus’ advanced Master Pricer search technology for points of sale outside of mainland China. Prepaid and postpaid hotel and car rental, as well as rail content will be available to customers in all markets, including China. \nCatering to inbound tourism and Chinese travellers in overseas markets, the agreement will enable Shijie99 to expand and diversify its product portfolio by adopting the same technology used by leading global online travel agents. This means that travellers will have access to the finest global content via the best search technology, meeting the needs of travellers today and into the future. Ms. Feng Na, COO of Shijie99 said, “Shijie99 has enjoyed phenomenal growth in China, becoming the leading e-commerce aggregator in a matter of years. As we look to drive similar success outside of China, collaboration with a global leader like Amadeus is critical. Our partnership means that travellers will have access to the best global content via the best search technology, meeting the needs of travellers today and into the future.” Sebastien Gibergues, Head of Leisure Online & Travel Media, Amadeus, said, “Shijie99 is a powerhouse in China’s expanding travel industry, delivering content to the leading travel players. I have no doubt that Amadeus’ leading technology and comprehensive global content will support Shijie99 in their international expansion. This is a great match and an exciting partnership, and Amadeus is proud to be part of Shijie's global growth.\" Albert Pozo, President, Amadeus Asia Pacific, commented, “Amadeus continues to invest in technology and solutions that enable the success of Asia Pacific travel players, as we have done for many years. The agreement with Shijie99 is the latest of many successful partnerships in the region and we are excited to enable and support their expansion onto the global stage.” Related articles", "external_links": [], "published": "2015-09-07T17:15:00.000+03:00", "crawled": "2015-09-08T02:31:02.861+03:00", "highlightTitle": ""}