{"organizations": [], "uuid": "7cf641d7dcdbb308e557e197a31db06dc6f23803", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/download-74.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/grand-beach-hotel-miami-beach-awarded-tripadvisor-certificate-of-excellence-for-five-consecutive-years/", "country": "US", "title": "Grand Beach Hotel Miami Beach Awarded TripAdvisor Certificate of Excellence for Five Consecutive YearsTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Grand Beach Hotel Miami Beach Awarded TripAdvisor Certificate of Excellence for Five Consecutive YearsTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "7cf641d7dcdbb308e557e197a31db06dc6f23803"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/grand-beach-hotel-miami-beach-awarded-tripadvisor-certificate-of-excellence-for-five-consecutive-years/", "ord_in_thread": 0, "title": "Grand Beach Hotel Miami Beach Awarded TripAdvisor Certificate of Excellence for Five Consecutive YearsTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Grand Beach Hotel Miami Beach Awarded TripAdvisor Certificate of Excellence for Five Consecutive Years\nGrand Beach Hotel Miami Beach today announced that it has been recognized as a TripAdvisor® Certificate of Excellence Hall of Fame winner. The Certificate of Excellence award celebrates excellence in hospitality and is given only to establishments that consistently achieve great traveler reviews on TripAdvisor. The ‘Hall of Fame’ was created to honor those businesses that have earned a Certificate of Excellence for five consecutive years. Winners include accommodations, eateries and attractions located all over the world that have continually delivered a superior customer experience.\n“Being awarded the TripAdvisor Certificate of Excellence five years in a row and inducted into the ‘Hall of Fame’ is a true source of pride for the entire team at Grand Beach Hotel Miami Beach and we’d like to thank all of our past guests who took the time to complete a review on TripAdvisor,” said Harald Bindeus, Director of Sales & Marketing at Grand Beach Hotel Group. “There is no greater seal of approval than being recognized by one’s customers. With the TripAdvisor Certificate of Excellence based on customer reviews, the accolade is a remarkable vote of confidence to our business and our continued commitment to excellence.”\n“Winning the TripAdvisor Certificate of Excellence for five consecutive years is a remarkable feat. TripAdvisor is pleased to induct five-time award winners into the ‘Hall of Fame’,” said Marc Charron President, TripAdvisor for Business. “By putting a spotlight on businesses that are focused on consistently delivering great service to customers, TripAdvisor not only helps drive an improvement to hospitality standards around the world, it also gives businesses both large and small the ability to shine and stand out from the competition.”\nWhen selecting Certificate of Excellence winners, TripAdvisor uses a proprietary algorithm to determine the honorees that takes into account the quality, quantity and recency of reviews and opinions submitted by travelers on TripAdvisor over a 12-month period as well as business’s tenure and ranking on the Popularity Index on the site. To qualify, a business must maintain an overall TripAdvisor bubble rating of at least four out of five, have a minimum number of reviews and must have been listed on TripAdvisor for at least 12 months.\nSource:-Grand Beach Hotel", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T19:50:53.894+03:00", "highlightTitle": ""}