{"organizations": [], "uuid": "bf3838ca85a9ba03c5dd49e004a0c0aaa8275437", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goafrica.about.com", "main_image": "http://f.tqn.com/y/goafrica/1/S/D/F/ougadougouwikimedia.JPG", "site_section": "http://z.about.com/6/o/m/goafrica_t2.xml", "section_title": "About.com Africa Travel: What's Hot Now", "url": "http://goafrica.about.com/od/africatraveltips/ig/Africa-s-Capital-Cities/Ouagadougou--Burkina-Faso.htm", "country": "US", "title": "Ouagadougou - Facts and Information about...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Ouagadougou - Facts and Information about...", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T14:05:00.000+03:00", "replies_count": 0, "uuid": "bf3838ca85a9ba03c5dd49e004a0c0aaa8275437"}, "author": "", "url": "http://goafrica.about.com/od/africatraveltips/ig/Africa-s-Capital-Cities/Ouagadougou--Burkina-Faso.htm", "ord_in_thread": 0, "title": "Ouagadougou - Facts and Information about...", "locations": ["West Africa", "Ouagadougou Ouagadougou", "Ouagadougou", "Burkina Faso", "Upper Volta", "French West Africa", "Yonyonse", "Ougadougou"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Wogodogo"], "text": "Expert Videos Basic Facts about Ouagadougou Ouagadougou is the capital city of Burkina Faso in West Africa . Almost 1.5 million people live in Ouagadougou, making it Burkina Faso's largest city and its commercial capital. Ougadougou was founded in the mid 15th century by the Yonyonse tribe who named the area “Wogodogo,” meaning \"where people get honor and respect\". It soon became the capital of the Mossi Empire . When the French colonized what was then called French West Africa in the 1890's, (later Upper Volta and now Burkina Faso), they gave Wogodogo a French accent, and named the capital Ougadougou.\nToday, Ouagadougou (commonly called Ouaga - pronounced wa-ga) is a sprawling city with a lively economy. The city is also a major cultural center and hosts the biennial FESPACO film festival . The heart of the city is focused around the Grand Marche , newly built since the last one burned to the ground in 2003. Ouagadougou is laid out in a grid-like pattern and is easy to navigate from the Place des Nations Unies (pictured above) where the city's 5 main roads converge. \nIn Ouaga most people speak French, More, Dyula and Fulfulde. Travel to Ouagadougou Ouaga is home to Burkina's international airport. Air Burkina is the national airline serving domestic and regional cities. You can also fly direct from Paris on Air France .\nWhat to see in Ouaga Musee National - Housed in a new complex, you'll find tribal artifacts, masks and textiles. Moro-Naba Palace - You can't go in, but do attend a traditional ceremony held outside the gates at 7am every Friday. Grand Marche - newly reconstructed after a fire burned it down, the market is still a lively place for bargaining. Le Musee de la Musique - a good selection of traditional musical instruments. Village Artisanal - Great place to watch local craftsmen at work. \nHotels Luxury - Laico Ouaga 2000 Hotel ; Mid-range - Hotel OK Inn and Hotel Les Palmiers ; Budget - Le Pavillon Vert . See more hotels... \nBars and Restaurants There are excellent restaurants, try: L'eau Vive ; le Gondwana ; le Verdoyant and Maquis le Pouvoir . Ouaga's nightlife is lively, tourist friendly places include Zaka and Bar Matata Plus. More restaurants ... \nTransport Ouaga is easy to get around by taxi. You can travel to and from the capital by train or long-distance bus to Burkina's other main towns as well as Ghana, Cote D'ivoire, Benin, Mali and Niger. Sources and More Info", "external_links": [], "published": "2015-09-18T14:05:00.000+03:00", "crawled": "2015-09-18T21:14:19.826+03:00", "highlightTitle": ""}