{"organizations": [], "uuid": "c48019ebcf55dbcc3260cad134d2581a84b42a17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64135/newest-member-etn-s-list-comes-peru", "country": "US", "title": "Newest member to eTN’s THE LIST comes from Peru", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Newest member to eTN’s THE LIST comes from Peru", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T07:09:00.000+03:00", "replies_count": 0, "uuid": "c48019ebcf55dbcc3260cad134d2581a84b42a17"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64135/newest-member-etn-s-list-comes-peru", "ord_in_thread": 0, "title": "Newest member to eTN’s THE LIST comes from Peru", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Newest member to eTN’s THE LIST comes from Peru   \nSep 24, 2015 eTN   \nCosta del Sol hotel in Lima, Peru, was nominated to be added to THE LIST by eTurboNews. Sending in the nomination was Rachida Mustafa. Rachida said that all of the Costa del Sol hotels give the customer a difference in service and hospitality from the moment they step into the hotel. It is a mix of professionalism and style accompanied by a smile. \neTN publisher Juergen T. Steinmetz said of the nomination: “From the testimony I have heard, the staff is warm, and they do not compromise when it comes to service. Their goal is to always be one step ahead of the guest so that they can exceed their expectations, and that is exactly what THE LIST wants to recognize.” \nSo how does one make it on THE LIST? Anyone can nominate a hotel, destination, attraction, airline, person, cruise, or restaurant based on a best moment or experience. THE LIST is not about rating how “luxurious” something is. It is more about how much something is appreciated or different. \nGeilan Mustafa, Corporate Marketing Manager and GM of the Costa del Sol, said: “I have been a regular reader of eTurboNews for a long time, and I know and appreciate the level and professionalism of eTN’s communication. I consider the content valuable, and appreciate its quality and the extent of its geographical coverage. \n“We are honored to have Costa del Sol added to eTN’s THE LIST. This award is an achievement we’re proud of, and all of us at Costa del Sol work very hard to make our hotel group special. \n“I have been involved in the hospitality industry since childhood, because my father owns a hotel. There was always a culture of traveling in our family, and we went all over the world for any reason - tourism, vacation, business, family, studies, etc. I learned to recognize what is excellence and how to make a difference in the quality of service at the hotel level and go beyond guests’ expectations.” \n“The slogan for our hotel is: brand new, modern and a perfect place to do business in a modern place.” \nCosta del Sol is a very prestigious Peruvian hotel chain that has just now completed its 8th hotel in Peru. It started on 1995 with the opening of the first Costa del Sol in the city of Tumbes. Hotels are located in Tumbes, Piura, Chiclayo, Cajamarca, Trujillo, Lima Airport, Lima and Cusco. Construction will begin soon on another hotel in Arequipa city. \nTo make a nomination for THE LIST, go to honesttravelawards.com.", "external_links": [], "published": "2015-09-24T07:09:00.000+03:00", "crawled": "2015-09-24T07:55:51.140+03:00", "highlightTitle": ""}