{"organizations": [], "uuid": "ac53b54522819544382498c345a8485375c450b7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3337804/images/o-DEFAULT-facebook.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/judi-freedman/cruising-the-douro-a-peac_b_8180094.html", "country": "US", "title": "Cruising the Douro - A Peaceful Way To See Portugal", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Cruising the Douro - A Peaceful Way To See Portugal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T23:46:00.000+03:00", "replies_count": 0, "uuid": "ac53b54522819544382498c345a8485375c450b7"}, "author": "Judi Freedman", "url": "http://www.huffingtonpost.com/judi-freedman/cruising-the-douro-a-peac_b_8180094.html", "ord_in_thread": 0, "title": "Cruising the Douro - A Peaceful Way To See Portugal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \n\"Take me back to Portugal, I miss the picturesque villages, pristine waters, and magnificent vineyard covered mountains,\" I said to my boyfriend L. \"The trip is over,\" L said. \"You'll just have to cherish all the memories.\" It had been a fun adventure on our first-ever river cruise on the Douro.* \nLots To Do On-Board There were many activities on-board and unlike L, who enjoyed relaxing and reading on deck, I was eager to participate in all. \n\"Como està,\" I said to L when I returned from my Portuguese language lesson. L smiled and went on reading. Elia taught us how to say popular words and phrases, like bom dia (good morning), boa tarde (good afternoon), boa noite (good evening and good night), adeus (good bye), and olà (hello). \"There are two ways to say thank you,\" said Elia. \"If you are a woman you say obrigada , but if you are a man you say obrigado .\" \n\"I helped Chef Carlos make Pastel de Nata pastries,\" I told L. \"Where is my sample,\" L asked. \"I ate it,\" I replied. L smiled and went on reading. The puff pastry dough is rolled and pressed into tart pans, then filled with a creamy vanilla custard, baked until lightly browned and sprinkled with cinnamon and sugar. \"We make more than 700 pastries a week,\" said Chef Carlos. \"It's like a perfect marriage - an espresso and a Pastel de Nata.\" \nI toured the galley. \"This is where the magic happens,\" said Elia, as she led us down the steps into the galley. The space was very small with only four chefs considering all the food that is prepared for 100+ people each day. Chef Carlos told us that \"eighty percent of the menus use Portuguese foods. We buy from local suppliers at each stop and refresh our menus seasonally.\" The team starts cooking at 5:30 a.m. for breakfast and stays until 2:30 p.m. after lunch. Then returns at 5:30 p.m. to 10:30 p.m. for evening service. They work 7 days a week from March through November. (Wow-o-wow, what a crew!) \nBreathtaking Views Of The Douro Valley Cruising along the Douro between the cities of Regua , Pinhào , and Barca d'Alva offered the most breathtaking views of vineyards, olive and almond trees, mammoth bridges, the sparkling river below and the glorious blue sky above. The ship's deck was my favorite place to \"stop, breathe, and be\" and soak in all the beauty. \n\"Here we have 100 year old vines,\" said our guide at the Quinta do Seixo estate, home to the famous Sandeman brand of port. We sampled red and white port and saw how the wine is produced. Before dinner that evening, we would witness the formal opening of a vintage bottle, which requires ice and fire so the cork doesn't crack. \"This wine gets better every year,\" said our program director Jorge as he carefully pulled out the cork and removed the sediment. (Just like moi ! No wonder I grew to adore this sweet wine during the course of my trip.) \nAnother highlight was the Mateus Palace , one of Portugal's most recognized icons with a long history of winemaking. The palace was built in the 18th century and has ornate stairways, exquisite pinnacles on the roof, and beautiful gardens surrounding the countryside estate. The family still lives there during the summer. \nThe Last Portuguese Village Along The Douro By mid-week, we had reached Barca d'Alva, the last Portuguese village along the Douro, situated just over a mile from the Spanish border. During our bus ride to the historical village of Castelo Rodrigo , Elia educated us on the rich agriculture of the area. \n\"Olive oil was one of the first exports of Portugal,\" said Elia. \"One third of the world's olive oil is exported from Portugal. We don't export many almonds, they are mostly for local use.\" Being an almond lover, I did as the locals do, and ate my share of these delicious nuts at the specialty shop in Castelo Rodrigo. I tasted every variety - cinnamon covered almonds, salted almonds, blanched almonds, seasoned almonds. - all were yummy.) \nCastelo Rodrigo is one of 12 historical villages in Portugal. Christians, Muslims, and the Jewish community had a peaceful co-existence here centuries ago. There were different entrances for each religious group, yet they all lived in the same place. \nGood Food and Good Friends \nWe enjoyed our daily excursions, but also liked our time on-board ship. It was pleasurable to dine with different couples each evening. We met people from all over the world - there were couples from England, Scotland, Australia, and all parts of the USA. Plus, after visiting the galley, I had a great appreciation for the waitstaff who carried our meals up and down the steps to our tables. Good food and good friends - who could ask for a better vacation? \nP.S. For more posts about my trip to Portugal, visit my Travel and Leisure page at aboomerslifeafter50.com . \n*Disclosure of Material Connection: Viking River Cruises provided me with a complimentary press trip river cruise on the Douro. Regardless, I only recommend products or services I use personally and believe will be good for my readers. \nFollow Judi Freedman on Twitter: www.twitter.com/judiboomergirl More:", "external_links": [], "published": "2015-09-23T23:46:00.000+03:00", "crawled": "2015-09-24T01:15:46.795+03:00", "highlightTitle": ""}