{"organizations": [], "uuid": "a2269e1fc23ae2b525267ad727ac4f95d99f772d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/07/malaysia-airlines.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/malaysia-airlines-offers-exclusive-deals-at-matta-fair-2015/", "country": "US", "title": "Malaysia Airlines Offers Exclusive Deals at MATTA Fair 2015Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Malaysia Airlines Offers Exclusive Deals at MATTA Fair 2015Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "a2269e1fc23ae2b525267ad727ac4f95d99f772d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/malaysia-airlines-offers-exclusive-deals-at-matta-fair-2015/", "ord_in_thread": 0, "title": "Malaysia Airlines Offers Exclusive Deals at MATTA Fair 2015Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Malaysia Airlines Offers Exclusive Deals at MATTA Fair 2015\nMalaysia Airlines is offering its customers with exclusive travel deals across its routes at Malaysian Association of Tours and Travel Agents (MATTA) Fair beginning today until 6 September 2015 and for those who missed out MATTA Fair, the irresistible deals will also be made available on Malaysia Airlines website until 9 September 2015.\nThis MATTA Fair promotion is valid for immediate travel until 31 June 2016.\nThese attractive all-inclusive return flight deals are available for grabs during the 3-day carnival at Putra World Trade Centre (PWTC) via all of Malaysia Airlines participating agents.\nMalaysia Airlines’ Senior Manager Regional Sales Malaysia, Kathleen Leong, said, “What better way to celebrate the start of a new airline with some great bargains for our customers! Take advantage of these great deals and enjoy up to 50 per cent discount on flight tickets on Malaysia Airlines’ domestic and international routes. Customers can choose from a wide array of destinations may it be for shopping, relaxing by the beach or just spending quality time with your loved ones.”\n“Besides fares, Malaysia Airlines is also giving out 10 free return tickets on Business and Economy Class seats to London, Paris, Hong Kong and Tokyo to winners of the MATTA Fair Buyers Contest,” added Kathleen.\n“So take this opportunity to plan your holidays with our long travel period and stand a chance to win some amazing prizes!” she added.\nFor passengers who wish to upgrade their meals, Malaysia Airlines is giving a special discount of up to 30 per cent off on its MHGourmet pre-ordered Economy Class meal. Served complete with appetizer and dessert, alongside perfectly baked bread rolls and chocolates, there are six delicious menu options to choose from for only RM49 instead of the usual RM70. This promotional rate will only be available during the MATTA sales campaign period.\nEnrich members will also be in for a treat as ‘Carnival of Hotels’ redemption campaign returns! Enrich, Malaysia Airlines’ loyalty programme, offers a wide array of hotel partners who have come on board to offer members more value for their Enrich Miles. Members are able to utilise their RM50 Enrich Vouchers to pay for selected hotel stays across Malaysia and offer is valid from now to 31 October 2015.\nTo redeem Enrich vouchers for the hotel stay, members can submit their request via enrich.malaysiaairlines.com. To make hotel reservations, members can call or email their preferred hotel and present their Enrich voucher upon check-in.\nSource:- Malaysia Airlines", "external_links": [], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-05T23:43:46.954+03:00", "highlightTitle": ""}