{"organizations": [], "uuid": "d39399645cb940d9f5923490397b6715fa9a7bfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150901JohnnyRockets1.jpg", "site_section": "http://www.ticotimes.net/categories/topics/business", "section_title": "Business Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/09/01/franchise-restaurants-sector-costa-rica-sees-boost-openings", "country": "US", "title": "Rica's restaurant franchise sector plans new openings, more jobs", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rica's restaurant franchise sector plans new openings, more jobs -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T05:03:00.000+03:00", "replies_count": 0, "uuid": "d39399645cb940d9f5923490397b6715fa9a7bfc"}, "author": "L. Arias", "url": "http://www.ticotimes.net/2015/09/01/franchise-restaurants-sector-costa-rica-sees-boost-openings", "ord_in_thread": 0, "title": "Rica's restaurant franchise sector plans new openings, more jobs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Costa Rica’s restaurant sector – and specifically its fast-food sector – is showing improvement in the number of openings in the second half of this year, a trend Costa Rican Restaurants Chamber President Jorge Figueroa said is good news for job growth.\nExpanding franchises include sports bar chain Hooters , which on Monday opened a new location in Moravia, with a total investment of $3.3 million. The location is the company’s sixth restaurant here and it added 50 jobs in the area northwest of the capital. Owners said at the opening they expect to add four more restaurants by the end of next year.\nHooligan’s opened its sixth location last July at Mall Multiplaza Curridabat, east of the capital. That added 23 new jobs for a total of 160.\nU.S. restaurant chain Cosí on Oct. 15 will open its sixth restaurant in City Place, a mall in the southwestern San José suburb of Santa Ana. The company announced two more openings for next year.\nChili’s in coming months will invest $2.4 million in two new restaurants, bringing to five the total number of locations in the country. The chain currently is looking for locations in Heredia and Alajuela.\nChicken chain Rostipollos is investing $1 million in the opening of three new restaurants: Two will be located in Alajuela at City Mall and Plaza Real, and one will open in Cartago. That will add 65 new jobs, the weekly El Financiero reported last week.\nFast food chains\nCosta Rica’s fast-food sector, which earlier this year and in 2014 saw several closures, seems to be slightly recovering.\nU.S. burger chain Johnny Rockets confirmed the opening of three new locations, for a total investment of $2 million. Brand manager Andrea Rojas said that in November the company will open a new 300-square-meter restaurant in City Mall, Alajuela, and two more in 2016.\nThe new locations of the California-based themed restaurant, which imitates 1950s and ’60s U.S. burger joints, will be located west of the capital. One is planned at Escazú Village, a new residential and commercial development, and the second will be located at Terrazas Lindora.\nOn Thursday, KFC will open a new restaurant in Desamparados, south of the capital. This will be the chain’s 33rd location at an investment of $1.5 million. General Manager Isidro Perera said Tuesday it would create 35 new jobs.\nTaco Bell this year opened two new restaurants in Cartago and Heredia and is expected to open two more by the year’s end in San José and Alajuela, the company announced last month. Each new location represents an investment of $500,000 and 80 new jobs.\nFigueroa said the fast food restaurant expansions are good news for the sector because they represent more investment and jobs. However, he added that expansion in the fast food sector usually occurs in the last months of a year.\nDespite several closings last year, Costa Rica’s franchising regime grew by 12.7 percent in 2014, according to the National Franchise Center , part of the Costa Rican Chamber of Commerce . A total of 34 new franchises launched operations last year, 22 of them representing international chains.\nContact L. Arias at larias@ticotimes.net", "external_links": ["http://rostipolloscostarica.com/new/", "http://www.cacore.cr/index.php/en/", "http://www.qsr.bz/index.php/kfc-costa-rica", "http://www.elfinancierocr.com/"], "published": "2015-09-02T05:03:00.000+03:00", "crawled": "2015-09-06T14:00:23.414+03:00", "highlightTitle": ""}