{"organizations": [], "uuid": "4a1fa703293f9d446536e9238e776a864ac1bdb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25932", "country": "", "title": "[Sponsored Post] IT&CMA and CTW Asia-Pacific 2015 to set new records", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "[Sponsored Post] IT&CMA and CTW Asia-Pacific 2015 to set new records", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "4a1fa703293f9d446536e9238e776a864ac1bdb9"}, "author": "Singapore, September 25, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25932", "ord_in_thread": 0, "title": "[Sponsored Post] IT&CMA and CTW Asia-Pacific 2015 to set new records", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "[Sponsored Post] IT&CMA and CTW Asia-Pacific 2015 to set new records Singapore, September 25, 2015 \nTHE Leading International MICE event centred in the Asia-Pacific region is set to kick off on September 29, 2015 at the Bangkok Convention Centre at CentralWorld Bangkok, Thailand. \n\nIt presents the largest line-up of over 20 MICE, events intelligence, corporate travel and association management knowledge sessions helmed by over 30 expert speakers. \n\nHeadlining the education front is the first-ever ASEAN MICE Forum, endorsed by the ASEAN Marketing and Communications Working Group. This unprecedented event enables IT&CMA to play a pioneering role in developing ASEAN’S MICE potential through the engagement of global industry leaders. \n\nThe 2015 edition sees a growth of 14 per cent in exhibitors’ participation, with sponsorship engagements increasing by more than 40 per cent over 2014. All these have been made possible by TTG Events’ unwavering commitment to deliver quality content and buyers to the events. \n\nFeaturing one of the largest CVB collections in the region, IT&CMA has once again delivered a truly global showcase of Convention Visitor bureaus. The international presence is witnessed by the entrance of new European, Middle Eastern and Asian bureaus like Berlin, Geneva, Lucerne, Zurich, Dubai and Jeju, while returning destinations Switzerland, Philippines, Macau and India are making a statement with an even bigger showing this year. \n\nRalf Ostendorf, director of market management at Berlin Tourismus & Kongress GmbH explained the motivation behind exhibiting at IT&CMA 2015 for the first time: “Our first experience with IT&CM Events was at IT&CM China earlier in Shanghai this year, and it proved to be a successful show for us. We are looking forward to the same success at IT&CMA 2015, as we see a lot of potential for Berlin as a MICE destination in Asia.” \n\nHaving reaped results from past sponsored networking functions at IT&CMA, Seoul Metropolitan Government, is delighted to return as a luncheon host for buyer and media delegates. \n\nMaureen O'Crowley, executive director, MICE Division, Seoul Tourism Organisation expressed her confidence backed by success at previous years' events: \"We had been the proud sponsor of Seoul Gala Dinner for several years. This year, we are excited to engage with buyers and media at a Seoul Hosted Luncheon. At this luncheon, we will be highlighting new incentives from Seoul, especially our special support programs. Through this intimate session, we want to create an event stronger working relationship with our target audience.\" \n\nIT&CMA and CTW Asia-Pacific 2015 will be held from September 29 to October 1, 2015 at the Bangkok Convention Centre at CentralWorld. For more information, log on to www.itcma.com or www.corporatetravelworld.com/apac .", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-26T08:03:47.895+03:00", "highlightTitle": ""}