{"organizations": [], "uuid": "91390b83d363b163f8e90ba1d450bf1a520de3a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/09/02/13/2BE7D33D00000578-0-image-a-100_1441197226903.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3219479/Are-world-s-BEST-hotels-Caribbean-hideaway-Indian-palace-lodge-path-Wildebeest-migration-voted-addresses-prestigious-travellers-awards.html", "country": "GB", "title": "Are these the world's BEST hotels?", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 4, "title_full": "Are these the world's BEST hotels? | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T20:59:00.000+03:00", "replies_count": 3, "uuid": "0a0a29680952788b71a6a0588045343fcb06e387"}, "author": "Naomi Leach For Mailonline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3219479/Are-world-s-BEST-hotels-Caribbean-hideaway-Indian-palace-lodge-path-Wildebeest-migration-voted-addresses-prestigious-travellers-awards.html#post-0", "ord_in_thread": 0, "title": "Are these the world's BEST hotels?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "21 shares 3\nView\ncomments\nWorking on your bucket list of the best hotels in the world to stay at?\nThen you're in luck, the results of the prestigious Conde Nast Traveller Annual Readers' Travel Awards have just been revealed, triggering wanderlust and setting the benchmark in desirable global destinations.\nReaders crowned a palatial Moroccan resort as the most exclusive address in the world, while a lodge in the Serengeti on the path of the wildebeest migration was also voted an experience not to miss.\nItaly was named the favourite country to visit, while discerning travellers chose Paris as their preferred overseas city.\nScroll down for video\n1. La Mamounia, Marrakech\nKing of hospitality: Legendary La Mamounia in Morocco was awarded the coveted title as the top hotel in the world, by readers of the magazine\nA stone’s throw away from the famous Jamaa El Fna Square in Marrakech, the property opened its doors in 1923\nInfused with Arab-Moorish design flourishes, the hotel offers an aesthetic of bygone opulence and one of the top spas in Morocco\nLa Mamounia was voted by readers as the world's best due to its 'design and rooms' according to Conde Nast Traveller\nAn ornately tiled pavilion surrounded by geraniums and palm trees in the garden of La Mamounia Hotel\nLegendary La Mamounia was voted by Conde Nast Traveller readers as the best hotel in the world.\nRELATED ARTICLES Previous 1 Next Life with the sea tribe: Fascinating pictures show how... The 'lost' world of old New York: Iconic bars, clubs and... Scrubbing 135 toilets, spreading cow dung and picking up dog... Share this article Share The property has been wooing travellers since 1923, with celebrated patrons of yesteryear including Winston Churchill and Princess Caroline of Monaco.\nInfused with Arab-Moorish design flourishes, the hotel offers an aesthetic of bygone opulence and one of the top spas in Morocco.\nA stone’s throw away from the famous Jamaa El Fna Square in Marrakech, La Mamounia was voted by readers as the world's best due to its 'design and rooms' according to Conde Nast Traveller.\nmore videos 1 2 3 Watch video A look at the beautiful historic Tuscan city of Lucca\nWatch video Janice Dickinson has fit after allergic reaction to insect bite\nWatch video Is this the saddest little bookworm in the world?\nWatch video French tourist Natalie Amyot looking for father of unborn child\nWatch video Ellie Goulding pleads with fans after fight breaks out at gig\nWatch video Watch: Miley's reaction to Nicki Minaj calling her a b****\nWatch video Police step in to stop Notting Hill Carnival fight\nWatch video United new boy Anthony Martial stunning volley vs St Etienne\nWatch video Nowhere Left To Run - Coronation Street's LIVE hour episode\nWatch video Afghanistan TV broadcast Woman receiving 100 lashes\nWatch video Cat is extremely jealous of owners new pet pooch\nWatch video Chloe Jasmine cries over fears she and Stevi will split up\n2. The Oberoi Udaivilas, Udaipur\nThe sumptuous 50-acre palace resort boasts a number of swimming pools fringed by regal surroundings\nSerenity:Set in Western India's Rajasthan, guests can enjoy yoga at The Oberoi Udaivilas in Udaipur\nThe hotel has an intricate layout of interconnecting domes and corridors boasting views of the lake and gardens\nLocated on the bank of Lake Pichola in Rajasthan, India, The Oberoi, Udaivilas stands on the 200 year old hunting grounds of the Maharana of Mewar.\nSpread over an expansive 50 acres, wildlife enthusiasts can explore its 20 acre wildlife sanctuary of deer and wild boar.\nThe hotel has an intricate layout of interconnecting domes and corridors boasting views of the lake and gardens.\n3. Singita Grumeti, Tanzania\nLocated in the Serengeti National Park, guests can enjoy opulent service at the Singita Grumeti in Tanzania\nInto the wild: The hotel is located on the path of the annual wildebeest migration and is an ideal spot for viewing the big five game animals\nAmidst the wilderness of the Serengeti National Park in Tanzania, guests can experience high luxury while staying at Singita Grumeti.\nOffering a chance to see the big five game animals, Singita Grumeti is situated on the migratory route of wildebeest.\nThe hotel comprises two safari lodges and a tent camp.\n4. Cheval Blanc St-Barth Isle de France, St Barth’s\nLVMH recently acquired the resort transforming it into an exclusive address in the Cheval Blanc collection\nBlank canvas: The breezy white aesthetic allows guests to focus on the enchanting and vivid Caribbean panorama outside\nIn a tropical garden, the Cheval Blanc Spa features four treatment rooms, a hammam and a relaxation pavilion\nThis iconic property on the Flamands beach, is loved for its exclusivity and privacy as it only has 40 rooms, suites and villas.\nRecently acquired by LVMH, the glamorous Caribbean destination is a go to stop for celebrities and global jet setters alike.\n5. Le Bristol Paris\nThe City of Lights: The classical Parisian charm and exceptional service at Le Bristol scored highly with travellers\nMidnight in Paris: Ideal for exploring the city, guests can take a step back in time with the 18th century aesthetic\nThis exclusive address in the heart of Paris' arts and fashion district has welcomed guests since 1925.\nGuests can take a step back in time as rooms are decorated in 18th century style.\nThe swimming pool boasts panoramic views of the City of Light's rooftops and guests can sample the new La Prairie spa at the hotel.\n6. Anse Chastanet, St Lucia\nNestled on St Lucia's stunning coves next to two sandy beaches, Anse Chastanet offers an idyllic hideway\nExclusive privacy: The resort is set within a 600 acre estate on the shoreline and stretching out to the tropical hillside\nReflecting its jungle and tropical beach surroundings, the estate is set within 600 acres on an idyllic cove of St Lucia.\nA dozen rooms are nestled behind the coconut palms that line the beach and the remainder are perched on the hillside.\nTo gain full advantage of the panoramic views and the refreshing tradewinds the whitewashed cottages come with wraparound balconies.\n7. One&Only Reethi Rah, Maldives\nInterconnecting over water huts at One & Only Reethi Rah in the Maldives means there is always a chance to gaze at the colourful sea life\nParadise island: White sands, azure waters and palm trees await at this high-end Indian Ocean luxury retreat\nTo infinity and beyond: A pool with a view for guests keen to stay within the resort while being soothed by the dreamy panorama\nThis dreamy Maldivian gem in the Kaafu Atoll has a variety of accommodations to choose from including stunning Water Villas.\nDesigned in a contemporary style, 128 private resort villas are separated along the shoreline by greenery and the lagoon.\nIdeal for guests keen to explore the vibrant Indian Ocean, the resort also has the Maldives first PADI National Geographic Dive Centre.\n8. Four Seasons Resort Sharm El Sheikh, Egypt\nFour Seasons Resort Sharm El Sheikh Egypt boasts a stunning swimming pool and opportunities to soak up the Egyptian sun\nGlamorous dining: The luxury resort provides ambient dining options for guests to the Red Sea resort\nDespite recent challenges facing Egypt's tourism industry, travellers continued to flock to this five-star Red Sea resort.\nOverlooking some of the world's best coral reefs, guests at the Four Seasons can go snorkelling or diving in the Sharm El Sheikh.\nThere are also option to take a camel ride and unwind at the property's celebrated spa.\n9. COMO Shambhala Estate, Bali\nGreen with envy: The intoxicating view from the 'Tirta-Ening' private suite/pavilion at COMO Shambhala Estate Resort in Bali\nRevitalising dip: A guest enjoying a refreshing swim in the crystal clear pool waters of the Source Spa\nThe bedroom in the Uma Bona private suites at COMO Shambhala Estate Resort is furnished in an Asian and European fusion design\nThe cuisine at the Restaurant at Como Shambhala Estate Resort is New World with Indonesian accents and is served in a rustic setting\nThe stunning bathroom in the 'Uma Bona' pavilion at the COMO Shambhala Estate Resort is surrounded by lush greenery\nFor a holistic journey like no other, travellers book themselves onto a 'Retreat for Change' at COMO Shambhala Estate Ubud, Bali.\nResident experts including a yoga teacher, Ayurvedic doctor and residence dietician create bespoke transformative stays for guests.\nThe resort has a gym and outdoor activities such as hiking and climbing make the most of the Estate’s unique location.\n10. Mandarin Oriental Bangkok\nHaven of tranquillity: A colourful and inviting lobby at the Mandarin Oriental Bangkok gives respite from the bustle of the capital city\nMandarin Oriental Bangkok is situated on the banks of the Chao Phraya River (left) but has corridors with seating to unwind (right)\nThe opulent Mandarin Oriental Hotel is famed for its impressive Thai hospitality.\nProviding a contemporary stay in the heart of bustling Bangkok, the hotel has been a go to address in the capital for 45 years.\nRecently renovated, the classy property provides a haven of serenity on the banks of Chao Phraya River.\nFrench charm: Paris hit the top spot as the preferred overseas city destination for discerning travellers\nMarina Grande in Sorrento on the Amalfi coast is just one of the many tourism hotspots that Italy boasts. The Mediterranean gem was awarded favourite country by readers of Conde Nast Traveller\nTOP 10 OVERSEAS CITIES IN THE WORLD VOTED BY READERS 1.Paris (2)\n2. New York (1)\n3. Barcelona (6)\n4. Rome (7)\n5. Venice (3)\n6. Sydney (4)\n7. Istanbul (5)\n8. Amsterdam (11)\n9. Berlin (16)\n10. Florence (8)\nIn the awards, London has been voted the UK's favourite city for the fifth year running thanks to its top bars, restaurants and hotels.\nFresh from its triumphant festival, Edinburgh came second while Bath, famed for its Georgian architecture, was third in the poll, voted for by readers of the Conde Nast Traveller magazine.\nItaly was named favourite country by readers for the sixth year running, with France and America in second and third.\nParis took the top spot for overseas city, with New York coming in second and Barcelona in third.\nThe coveted title of top UK holiday hotel went to The Pig in Hampshire - beating Babington House in Somerset, where actor Eddie Redmayne married his long-term girlfriend Hannah Bagshawe last year, into second.\nWhile the Mandarin Oriental in Hyde Park, London was named top UK business hotel, followed by the art deco splendour of Claridge's in second and Mayfair's the Connaught in third.\nThe full results of the awards are available to see in the October issue of the magazine.", "external_links": ["http://dailym.ai/1Urrms9", "http://pubads.g.doubleclick.net/gampad/ads?sz="], "published": "2015-09-02T20:59:00.000+03:00", "crawled": "2015-09-02T19:11:23.085+03:00", "highlightTitle": ""}