{"organizations": [], "uuid": "767677924fd77adb7ad960edb2aa15788f14caf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/10/lufthansa.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lufthansa-publishes-special-timetable-for-tomorrow-more-than-half-of-all-planned-long-haul-flights-to-operate/", "country": "US", "title": "Lufthansa publishes special timetable for tomorrow: more than half of all planned long-haul flights to operateTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Lufthansa publishes special timetable for tomorrow: more than half of all planned long-haul flights to operateTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "767677924fd77adb7ad960edb2aa15788f14caf8"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/lufthansa-publishes-special-timetable-for-tomorrow-more-than-half-of-all-planned-long-haul-flights-to-operate/", "ord_in_thread": 0, "title": "Lufthansa publishes special timetable for tomorrow: more than half of all planned long-haul flights to operateTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lufthansa publishes special timetable for tomorrow: more than half of all planned long-haul flights to operate\nLufthansa has published a special timetable for its services tomorrow Tuesday 8 September. The action has been taken following a call by the Vereinigung Cockpit pilots’ union (VC) for its members at Lufthansa German Airlines and Lufthansa Cargo to take strike action.\nA total of 1,500 passenger flights (including some 170 long-haul services) and seven cargo flights were scheduled to be operated during the planned strike period tomorrow.\nWith a relatively large number of cockpit personnel indicating their willingness to fly, the airline will be able to operate more than half of its intercontinental passenger services despite the VC’s strike call. All in all, 84 long-haul services from or to Frankfurt, Munich or Düsseldorf will have to be cancelled, while 90 such flights can be operated.\nThe willingness of many pilots to work despite the strike call will also permit all seven scheduled cargo flights for Tuesday to be performed. Lufthansa Cargo will thus be able to maintain its full flight program.\nA small number of inbound intercontinental flights to Frankfurt, Munich and Düsseldorf will also have to be cancelled today, to ensure that flight operations can resume as smoothly as possible on Wednesday after the strike.\nAny customers whose flight is cancelled as a result of the strike will be able to rebook or to cancel their booking free of charge or penalty.\nLufthansa is doing its utmost to minimize the impact of this strike action on its customers. All Lufthansa customers holding tickets for long-haul travel from or to Frankfurt, Munich or Düsseldorf are urged to check the latest status of their flight on well in advance of their scheduled departure.\nSource:- Lufthansa", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T12:49:10.810+03:00", "highlightTitle": ""}