{"organizations": [], "uuid": "f3a834a5358d19aa050b2d104b029014b33cc499", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/ATR-72-600-Binter.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-canary-islands-airline-will-progressively-upgrade-its-atr-fleet-with-the-arrival-of-12-new-atr-72-600s/", "country": "US", "title": "The Canary Islands airline will progressively upgrade its ATR fleet with the arrival of 12 new ATR 72-600sTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "The Canary Islands airline will progressively upgrade its ATR fleet with the arrival of 12 new ATR 72-600sTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3a834a5358d19aa050b2d104b029014b33cc499"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/the-canary-islands-airline-will-progressively-upgrade-its-atr-fleet-with-the-arrival-of-12-new-atr-72-600s/", "ord_in_thread": 0, "title": "The Canary Islands airline will progressively upgrade its ATR fleet with the arrival of 12 new ATR 72-600sTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Canary Islands airline will progressively upgrade its ATR fleet with the arrival of 12 new ATR 72-600s\nThe Spanish carrier Binter, based in the Canary Islands, took delivery today in Toulouse of the very first of its 12 ATR 72-600s ordered through two different contracts signed in 2014 and earlier this year. With the introduction of these new ATR ‘-600s series’ aircraft the airline will progressively upgrade its current fleet, consisting of 16 ATR 72-500s. Binter, which is a long-standing ATR operator, has progressively developed its regional network over the Canary Islands with ATR aircraft since 1989.\nThe new ATR 72-600s, configured with 70 seats and equipped with the latest technologies in the fields of navigation aid tools and the highest standards of comfort for passengers, will enable Binter to upgrade its fleet to continue providing an optimal service in the inter-islands connections in the Canary Islands and in its international routes operated with this aircraft model (Madeira, Marrakech, Casablanaca, Agadir and El Aaioun).\n“We have needed an important investing effort to achieve this operation”, declared “Pedro Agustin del Castillo, President of Binter. “Our aim is to keep and even further enhance the standards of quality in the inter-islands operations, thus responding to our commitment with the Canary Islands”. He also underlined, among the developments of the new ATR, “the lower fuel burnt, the thinner, roomier and ergonomical seats, the larger overhead bins capacity, the larger flight autonomy and the state-of-the-art cockpit technology, close to the one of the Airbus A380”.\nPedro Agustin del Castillo, President of Binter, stated: “We have been successfully operating ATRs for more than 25 years, and bringing the latest ATR -600s is a natural step forward in our long-standing partnership. We will be pleased to offer to our passengers the latest standards of comfort available in the ATR -600 series aircraft, and we are convinced that these aircraft are the right tool to expand our services to countries around the Canary Islands archipelago.”\nPatrick de Castelbajac, Chief Executive Officer of ATR, declared: “The ATR aircraft feature outstanding operational results on short routes and on small and short runways, thus being the perfect tool to ensure air connectivity in archipelagos. For many years, ATR aircraft have built up a strong reputation for inter-island operations, and we are honored that such a long-standing partner as Binter is now introducing the many advantages of the ATR -600s into its fleet”.", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T19:06:06.960+03:00", "highlightTitle": ""}