{"organizations": [], "uuid": "3b5c849a7c93f7a56e61cf8e21d98394214ff455", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03443/woman-on-loo-2_3443762a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-18.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/extraordinary-road-tales/11863539/driving-stories-when-nature-calls.html", "country": "US", "title": "Embarrassing driving stories: what to do when nature calls", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Embarrassing driving stories: what to do when nature calls - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T23:16:00.000+03:00", "replies_count": 0, "uuid": "3b5c849a7c93f7a56e61cf8e21d98394214ff455"}, "author": "Barbara O’Neill", "url": "http://www.telegraph.co.uk/sponsored/motoring/extraordinary-road-tales/11863539/driving-stories-when-nature-calls.html", "ord_in_thread": 0, "title": "Embarrassing driving stories: what to do when nature calls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": ">> More extraordinary road tales The strangest – and certainly most awkward – driving experience I’ve ever had happened last year, on the way back from a holiday in the Lake District. My husband Tom and I – along with our children Sophie, 8, and Freddie, 6 – were driving home to Oxford after a wonderful week camping with our friends Phil and Kate and their two children. We would ordinarily have stopped for what might be called a “comfort break” – but with the kids mercifully asleep in the back of the car, we decided to press on. Thirty minutes from our home in Oxford, the traffic ground to a halt. Traffic was jammed solid. We waited and waited. And then the inevitable happened There were emergency vehicles everywhere – a helicopter circling overhead, police cars and ambulances flying down the hard shoulder. Nothing else moved. I checked Twitter and it seemed a minibus had overturned across the middle of the motorway (thankfully no-one was hurt – I checked later). The traffic was jammed solid and before long most people had switched their engines off, had got out of their cars and were stretching their legs or simply talking to each other. We waited and waited. And then the inevitable happened. Perhaps it was all that waiting. Perhaps it was the fact that it was a hot day and so I’d drunk over a litre of water since leaving the Lakes. Perhaps it was watching a fairly steady trickle of men ducking over the fence by the hard shoulder and standing, legs apart, backs to the road… but before long, I felt the call of nature. I ran to the hard shoulder, planning to nip over the fence and go discreetly in a field As time dragged on, the need became urgent, then desperate – and then absolutely necessary. I ran to the hard shoulder, planning to nip over the fence and go discreetly in a field. I got to the fence – but on the other side there was only wide-open space: and no shelter to protect a lady’s modesty. Also, by this point, many bored motorists were watching to see my next move. One was a friendly looking coach driver, next to our car. I grinned and shrugged at him, he gave me a thumbs-up and pointed towards the rear of his coach… where he had a toilet. I leapt aboard, gave the passengers a slightly self-conscious smile and shot into the loo. Even if I'd ended up in London, it would have been worth it for that minute of blessed relief? And then, as soon as I shut the door behind me, the traffic started moving – and the coach was heading to London – about 60 miles further down the M40 from my house. Tom shrugged at the driver, he shrugged back and both were forced to drive off. I emerged from the loo to laughter and applause – and a text from Kate in the car behind ours saying they were all crying with laughter. I sat at the front with the driver and wondered how I’d get home from London. The coach and Tom stayed in the slow lane near each other and thankfully, just before the Oxford junction, the traffic stopped again. Tom pulled onto the hard shoulder, I leapt off the coach and dived into the car… to another round of applause from my temporary fellow London-bound passengers. Awkward? Yes. Embarrassing? Yes. But even if I had ended up in London, it would all have been worth it for that minute or two of blessed relief… • The AA can't erase the embarrassment of getting trapped on a random coach - but they can come to your rescue when the unpredictable happens on the motorway. Find out more theaa.com", "external_links": [], "published": "2015-09-18T23:16:00.000+03:00", "crawled": "2015-09-18T20:29:28.603+03:00", "highlightTitle": ""}