{"organizations": [], "uuid": "17047d0ed934ba6636b681554f18a4dcec798518", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30105832/porsche-rennsport-reunion-v-assembles-all-star-cast-of-cars-and-drivers", "country": "US", "title": "Porsche Rennsport Reunion V Assembles All-Star Cast of Cars and Drivers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Porsche Rennsport Reunion V Assembles All-Star Cast of Cars and Drivers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T03:00:00.000+03:00", "replies_count": 0, "uuid": "17047d0ed934ba6636b681554f18a4dcec798518"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30105832/porsche-rennsport-reunion-v-assembles-all-star-cast-of-cars-and-drivers", "ord_in_thread": 0, "title": "Porsche Rennsport Reunion V Assembles All-Star Cast of Cars and Drivers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Porsche Cars North America, Inc.\nThe Porsche highlights for a weekend full of highlights\nATLANTA , Sept. 24, For the Porsche Rennsport Reunion V taking place at Mazda Laguna Seca Raceway this weekend, September 25-27, 2015 , both the men and the machines they drove are expected to outdraw one of the largest crowds in track history – the last Rennsport Reunion held in 2011. Pre-event buzz from the passionate Porsche enthusiasts and collectors indicate that this iteration of Porsche Rennsport Reunion will outdo all others that came before. Another indication to the size and scope of the upcoming weekend: ticket sales are approximately thirty percent higher than four years ago.\nA very special ingredient of this year's Porsche Rennsport Reunion V: The Porsche Factory LMP1 team. Direct from its overall victory at the Lone Star Grand Prix at the Circuit of the Americas last weekend, the 919 Hybrid, the first overall winner at the 24 Hours of Le Mans since the 911 GT1-98 did it in 1998 will be on display and making demonstration laps at the renowned Mazda Raceway Laguna Seca circuit. Over 10 current factory drivers will be on hand as well, including Patrick Long , Jorg Bergmeister , Mark Webber and the 24 Hours of Le Mans winning pair – Earl Bamber and Nick Tandy .\nAs Porsche celebrates all things \"Porsche at Le Mans,\" the natural choice for Co-Grand Marshals at Rennsport Reunion V is Jacky Ickx and Hurley Haywood . The two most successful racers for Porsche at the famed 24 Hour race in France , one from each side of the Atlantic Ocean, Ickx is six--time winner and Haywood has three overall victories.\nIckx, born in Belgium in 1945 has had an extraordinary career in both sports cars and Formula 1. He has eight wins in F1, six overall at the 24 Hours of Le Mans and two World Championships to his name. Additionally, he is a Can-Am Champion and winner of the Paris - Dakar rally and is credited with changing the \"running start\" rule at Le Mans, making the race infinitely safer.\nHaywood, born in Chicago in 1948 is the most successful American endurance driver in history. Adding to his three overall victories at Le Mans, including one famous win shared with Ickx and Jurgen Barth , he has five overall victories at the 24 Hours of Daytona and two at the 12 Hours of Sebring. He has two IMSA GT Championship titles under his belt and is the chief driving instructor for the Porsche Sport Driving School.\nThe guest list for Porsche Rennsport Reunion V once again reveals names that are well entrenched in Porsche Motorsport history.\nDerek Bell , five time winner for Porsche at Le Mans; George Follmer , Can-Am Champion in the mighty 917/10; Vic Elford , Monte Carlo and 24 Hours of Daytona winner, on back-to-back weekends; Hans Hermann and Richard Attwood , first overall winners at Le Mans for Porsche in 1970; Hans Stuck , Dany Sullivan , and many others. Overall, there will be 50-plus legendary drivers on hand, signing autographs and making appearances over the three days.\nAnd it's not just drivers that made their Porsche race cars famous. Attendees will include Norbert Singer , retired Porsche Motorsport engineer, known as the father of the Porsche 962; Alwin Springer , past president of Porsche Motorsports North America and Hartmut Kristin , recently retired Vice President of Porsche Motorsport responsible for GT Racing and the return of the Porsche Factory GT teams to Le Mans.\nAnd of course, the racecars. Another group with too many to list. A sampling of Porsche racecars brought in from the museum in Stuttgart, Germany :\n1962 Porsche 718 W-RS – Porsche's first two-liter, eight-cylinder vehicle; nicknamed \"Grandmother\" because it competed from 1961-1964; class victories in the 1962 Targa Florio and 1,000-kilometer race at the Nurburgring; dominated the 1963 and 1964 European Hill Climb Championship with driver Edgar Barth\n1971 Porsche 917 LH – Built specifically for the 24 Hours of Le Mans, the long-tail version of the Porsche 917 is one of the fastest cars ever seen at the 24-hour classic; hit over 240 mph in race trim on the 3.7-mile Mulsanne Straight in 1971.\n1987 Porsche 962 – Porsche introduced a new three-liter engine at the 1987 24 Hours of Le Mans that both maintained reliability and increased horsepower; the result was a sixth consecutive Le Mans victory.\n1995 Porsche WSC95 Spyder – Overall winner of the 24 Hours of Le Mans in both 1995 and 1996, the third time in Le Mans history, and the second time for Porsche, that the exact same car had consecutive victories at Le Mans.\n1998 Porsche 911 GT1-98 – Almost 50 years after the first Porsche sports car saw the light of the day, the 911 GT1 98 achieved the record 16th victory in 24 Hours of Le Mans. The last Porsche overall winner until 2015 when the 919 Hybrid extended the record to 17.\nCurrent GTLM 911 RSR from the TUDOR United Sports Car Championship – 2014 TUDOR GTLM Champion and current Manufacturer, Team and Drivers Championship points leader.\nCurrent LMP1 919 Hybrid from the United World Endurance Championship (WEC). Fresh from its overall victory at the Lone Star Grand Prix at the Circuit of the Americas last weekend, the Porsche LMP1 team now has a string of victories dating back to the historic win at Le Mans in June, the 17th overall for Porsche.\nSpecial mention must be made to the 356 on display courtesy of Cameron Healy , the 1951 Le Mans class winning Porsche was the first Porsche ever entered into the famed endurance race at the French Circuit de la Sarthe. This first entry in 1951 began a streak that stands today, as there has been at least on Porsche in the 24 Hours of Le Mans every year since. Another record Porsche holds at Le Mans. The 356 Coupe will be part of the Rennsport Reunion Poster Car display in the Porsche Park in the Paddock area.\nOverall there will be 320 Porsche racing cars in seven race classes. The groupings range from a special class for the Porsche Club of America to run groups ranging from 356 and 550 Spyders, to the 917 and modern 911 RSRs. In addition, IMSA's 911 GT3 Cup Challenge series will hold their last two rounds of their one-make race series, crowning the series champion at Rennsport Reunion V.\nAdd 1,400 Porsche cars on display in the Porsche Club of America corrals, over 75 Le Mans significant race cars on display in the Porsche Heritage tent, and cars from prominent Porsche collectors such as the Revs Institute, Brumos Racing, Gunnar Racing, the Ingram Collection and Canepa Design, the weekend promises to be another Family Reunion not to be missed, and not soon forgotten.\nTicket information is available by contacting 831-242-8200 or online at www.mazdaraceway.com .\nMore information and event updates can be found at http://porscherennsportreunion.com/\nSocial Media Hashtag: #PorscheRRV\nAbout Porsche Cars North America, Inc. | One Porsche Drive, Atlanta, GA 30354 USA\nEstablished in 1984, Porsche Cars North America, Inc. (PCNA) is the exclusive U.S. importer of Porsche 918 Spyder, 911, Boxster and Cayman sports cars, the Macan and Cayenne SUVs, and Panamera sports sedans. Headquartered in Atlanta, Georgia since 1998, PCNA is also home to the first Porsche Experience Center in North America featuring a module-based 1.6 mile driver development track, business center, human performance center, and fine dining restaurant. PCNA employs approximately 300 people who provide parts, service, marketing, and training for 189 dealers. They, in turn, work to provide Porsche customers with a best-in-class experience that is in keeping with the brand's 65-plus year history and leadership in the advancement of vehicle performance, safety and efficiency. PCNA is a wholly-owned subsidiary of Porsche AG, which is headquartered in Stuttgart, Germany .\nAt the core of this success is Porsche's proud racing heritage that boasts some 30,000-plus motorsport wins to date.\nFollow us: twitter.com/porsche | facebook.com/porsche\nFor Porsche apps: http://www.porsche.com/usa/entertainment/apps/\nPhoto - http://photos.prnewswire.com/prnh/20150924/270367\nLogo - http://photos.prnewswire.com/prnh/20120628/CL32476LOGO\n releases/porsche-rennsport-reunion-v-assembles-all-star-cast-of-cars-and-drivers-300148455.html\n ", "external_links": ["http://photos.prnewswire.com/prnh/20150924/270367", "http://www.porsche.com/usa/entertainment/apps/", "http://www.xmlnews.org/ns/", "http://twitter.com/porsche", "http://photos.prnewswire.com/prnh/20120628/CL32476LOGO", "https://photos.prnewswire.com/prnvar/20150924/270367", "http://porscherennsportreunion.com/", "http://www.prnewswire.com/news-releases/porsche-rennsport-reunion-v-assembles-all-star-cast-of-cars-and-drivers-300148455.html", "http://facebook.com/porsche", "http://rt.prnewswire.com/rt.gif?NewsItemId=CL10737&Transmission_Id=201509240830PR_NEWS_USPR_____CL10737&DateId=20150924", "http://photos.prnewswire.com/prnvar/20120628/CL32476LOGO"], "published": "2015-09-24T03:00:00.000+03:00", "crawled": "2015-09-24T18:21:14.262+03:00", "highlightTitle": ""}