{"organizations": [], "uuid": "d878fea1fdbf89a77bed50d36a3fce6c18af82b8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/4/6/c/6/image.related.StuffLandscapeSixteenByNine.620x349.1745op.png/1443143726265.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/life-style/home-property/72417481/World-s-first-3D-hotel-suite-complete-with-jacuzzi-printed-in-100-hours", "country": "AU", "title": "World’s first 3D hotel suite complete with jacuzzi printed in 100 hours", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "World’s first 3D hotel suite complete with jacuzzi printed in 100 hours", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T04:15:00.000+03:00", "replies_count": 0, "uuid": "d878fea1fdbf89a77bed50d36a3fce6c18af82b8"}, "author": "Christina Zhou", "url": "http://www.stuff.co.nz/life-style/home-property/72417481/World-s-first-3D-hotel-suite-complete-with-jacuzzi-printed-in-100-hours", "ord_in_thread": 0, "title": "World’s first 3D hotel suite complete with jacuzzi printed in 100 hours", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "World’s first 3D hotel suite complete with jacuzzi printed in 100 hours CHRISTINA ZHOU Last updated 05:00, September 26 2015 SUPPLIED \nThe owner of the Lewis Grand Hotel in the Philippines is 3D printing an expansion to the hotel. \nThe world's first 3D-printed hotel suite has been unveiled in Angeles City, Philippines, and it took just 100 hours to print. \nBut don't misjudge the luxury a mere five days could create. \nAs a part of the expansion to the Lewis Grand Hotel, its owner Lewis Yakich has printed a two-bedroom villa, complete with a jacuzzi room with a 3D-printed concrete jacuzzi. \n* The future of food: Lab-grown meat and 3D-printed meals \nThe 130-square-metre structure measures 10.5 metres by 12.5 metres and stands 3 metres tall. \nAccording to 3DPrint.com , the building would be the first fully-permitted 3D-printed operational commercial building in the world if all went to plan. \nThe two-bedroom villa spread over 130 square metres features a 3D-printed concrete jacuzzi (on the left). Photo: ANTHONY RUDENKO VIA 3DPRINT.COM \nAndrey Rudenko, who built the world's first 3D-printed concrete castle in Minnesota, was the lead designer for the printer and teamed up with Yakich to work on the project. \nThough the structure took about 100 hours to print, there were several interruptions to install plumbing, wiring and rebars and complete testings along the way. Ad Feedback \nThe planning, design and assembling the machine took several months. They also had to develop the right concrete mix from local materials, including sand and volcanic ash. \nYakich said the printer is still a work in progress, and he has signed a contract to print a subdivision of 20 homes this November. \nHe estimates it would take one week to print six houses simultaneously, which could save 60 per cent on building costs. \n\"The Philippines is actually a great place for concrete printing because of the weather. Currently everything is made out of concrete, and it's a third world country so it can do a lot of good in disaster zones, etc.,\" Yakich said. \nThe hotel villa is just another example of how 3D printing has taken off in recent years. \nIn China, a 3D-printed house was built in just three hours , while the WinSun Decoration Design Engineering Co built a five-storey apartment block in China's Suzhou Industrial Park.", "external_links": [], "published": "2015-09-25T04:15:00.000+03:00", "crawled": "2015-09-25T21:28:37.534+03:00", "highlightTitle": ""}