{"organizations": [], "uuid": "d350a5eb344e4a20c79116474d94c48579203528", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150902Pasta.jpg", "site_section": "http://www.ticotimes.net/categories/topics/health", "section_title": "Health Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/09/02/the-gluten-free-movement-is-ruining-the-worlds-love-for-pasta", "country": "US", "title": "The gluten-free movement is ruining the world's love for pasta", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "The gluten-free movement is ruining the world's love for pasta -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T23:40:00.000+03:00", "replies_count": 0, "uuid": "d350a5eb344e4a20c79116474d94c48579203528"}, "author": "Roberto A. Ferdman | The Washington Post", "url": "http://www.ticotimes.net/2015/09/02/the-gluten-free-movement-is-ruining-the-worlds-love-for-pasta", "ord_in_thread": 0, "title": "The gluten-free movement is ruining the world's love for pasta", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON, D.C. – Behind closed doors, dinner tables are getting less doughy. Grains, still ubiquitous in diets around the globe, are losing favor as a result of a growing fear that they might be adding inches to our guts, or discomfort to our stomachs. And there is, perhaps, no better example of this phenomenon than what’s happened to one of the world’s favorite foods: pasta.\nSimply, people are eating less of it. The data show that the cheap and easy meal hasn’t disappeared from diets, but diners aren’t consuming it with the gusto they once did.\nThe trend can be seen in the North America, where sales of dried pasta have fallen by 6 percent since 2009, according to data from market research firm Euromonitor. A report published in April by Mintel projects that the U.S. decline will continue through at least 2019 for the pasta category.\nIt can be seen in Australia, too, where the market for pasta has contracted by almost 8 percent since 2010.\nThe popular Italian food is also losing its luster in Europe, where several countries have scaled back in recent years. In Germany, dried pasta sales have dipped by 12 percent since their peak in 2008. In Greece, they have fallen by 15 percent over the same period.\nEven in Italy, the birthplace of pasta, people are growing wary of the carb-heavy food. Sales of dried pasta have plummeted by more than 25 percent since 2009 in Italy. “Italians – particularly women – increasingly see pasta as fattening, boring and time-consuming,” the Wall Street Journal wrote in 2013.\nLong the staple of so many diets around the world, pasta is losing its appeal. The reasons are many: the rising popularity of carb-free – or at least carb-light – diets; growing sentiment that pasta offers little in the way of nutrition; and a new reality that a horde of healthier alternatives exist.\nFew trends have been as problematic for pasta as the villainization of carbs.\nThe shift away from breads, potatoes, and, yes, pasta, began with Dr. Atkins, whose popular fad diet scared an entire nation. But carbs have been maligned by more than merely one fleeting diet – they have been victim of most dietary trends since the late 1980s.\nDr. Atkins’ “New Diet Revolution” books on sale at the Castus Low Carb Superstore in California, in 2005.\nJustin Sullivan/Getty Images/AFP\nThe South Beach Diet, which didn’t disallow carb intake entirely, still made people wary of the reality that there is such thing as a good carb, and a bad carb, epitomized by the difference between whole-grain wheat and processed white bread. The Paleo diet, meanwhile, which is arguably the most popular eating rulebook du jour, has flipped conventional nutrition on its head, encouraging fat intake and discouraging the eating of any carbs at all.\n“What all these fad diets have done is identify what’s a good carb and what’s a bad carb for people,” said Seifer. “The problem for pasta is that we found out that things like pasta are part of the bad group.”\n“It’s not just pasta,” Simone Baroke, a food industry analyst at Euromonitor added. “It’s affecting bread and potatoes, too. It’s affecting all sorts of carbohydrate staples.”\nThe anti-carb fad has become an international phenomenon. Italians are increasingly fearful that their favorite food might be adding to their waistlines too. The share of women in their late twenties who believe pasta is fattening jumped by more than 25 percent, between 2008 and 2012, according to a Nielsen. For men in their late twenties, the share increased by more than 16 percent over that period.\nEven Pope Francis is being advised to scale back on pasta to better preserve his health.\n“For the longest time, people thought fat was what added to their waistline,” said Seifer. “Now it’s carbs [that] everyone blames.”\nThe gluten-free movement has all contributed to the trend. Gluten-free is less concerned with avoiding carbs than gluten, which many feel can cause great gastrointestinal discomfort. Some 20 million U.S. consumers now say that eating it causes them distress. One hundred million people in all, meanwhile, say that they are actively working to eliminate gluten, the protein that gives pasta its chewiness, from their diet. The concern is echoed elsewhere in the world.\n“A lot of people are really watching their intake these days,” said Darren Seifer, food and beverage analyst at market research firm NPD group. “That’s definitely making a dent in pasta sales.”\nIt doesn’t help either that protein, which pasta has very little of, is so gauche these days. More than half of people in the U.S. say they want more of it in their diet. The desire has been a boon for the protein shake business. So too has it been for the protein bar market, which was valued at more than $500 million in 2013.\n“You can’t discount the trend towards protein-rich foods,” said Baroke. “It’s probably the most impactful in the United States, but the same is happening over here in Europe.”\nFresh foods have also forced shoppers away from the middle of the supermarket, where most pastas are sold. Many grocery store goers likely enter and leave without ever having looked down the pasta aisle.\nAnd finally, pasta has never been as replaceable as it is today. The rise of alternative grains, like quinoa, which are similarly filling but far richer in protein, have gained popularity at the expense of spaghetti. So too have certain vegetables, which, when cut into thin, long strips, and spiralized, approximate the experience of eating pasta. Spaghetti squash, which was named for its pasta-liked texture when cooked, has become exceedingly popular.\n“As these grains and other alternatives become more popular, they will only become more threatening to pasta,” Seifer said.\n© 2015 , The Washington Post", "external_links": ["https://www.npd.com/wps/portal/npd/us/news/press-releases/us-consumers-want-more-protein-in-their-diets-and-look-to-a-range-of-sources-for-it/?_ga=1.252854793.1469345126.1405102903", "http://www.wsj.com/articles/SB10001424127887324807704579082953783065812", "http://www.nbcnewyork.com/news/national-international/Pope-Francis-Cut-Back-Pasta-Weight-Gain-298470571.html", "http://www.chicagobusiness.com/article/20130831/ISSUE01/308319971/why-is-everyone-selling-protein-bars", "http://www.newyorker.com/magazine/2014/11/03/grain", "http://blog.euromonitor.com/2015/08/spiralized-vegetables-succeed-as-ersatz-pasta.html"], "published": "2015-09-02T23:40:00.000+03:00", "crawled": "2015-09-06T03:16:06.528+03:00", "highlightTitle": ""}