{"organizations": [], "uuid": "f25c44446880bfdd88dc09180c64a2600fba8c3f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/mrt.png", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/first-marriott-hotel-in-chongqing-to-help-guests-travel-brilliantly/", "country": "US", "title": "First Marriott Hotel in Chongqing to Help Guests Travel BrilliantlyTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "First Marriott Hotel in Chongqing to Help Guests Travel BrilliantlyTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "f25c44446880bfdd88dc09180c64a2600fba8c3f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/first-marriott-hotel-in-chongqing-to-help-guests-travel-brilliantly/", "ord_in_thread": 0, "title": "First Marriott Hotel in Chongqing to Help Guests Travel BrilliantlyTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "First Marriott Hotel in Chongqing to Help Guests Travel Brilliantly\nMarriott International, Inc. is proud to announce the recent opening of its first hotel under the iconic flagship Marriott brand in Chongqing. With 341 well-appointed rooms located on the30th to 48th floor of one of the city’s landmarks, Guorui Centre, the Chongqing Marriott Hotel overlooks a scenic area in the city and is close to business activities, enabling guests to explore the city conveniently.\nChongqing has over 3000 years of history and local culture. Situated in the Southwestern part of China, it is the largest inland city that is surrounded by rivers and mountains. It is well-known for the Three Gorges, Fairy Mountain and Dazu Stone Carving.\nCongqing Marriott Hotel exteriorAt the foot of Nanshan Mountain, the brand new Chongqing Marriott Hotel offers mountain, city and Yangtze River views. The hotel is located near the central Nanping business district and Jiefangbei CBD center, a 10-minute drive from Chongqing International Convention & Exhibition Center and a 30-minute drive from Chongqing International Airport.\n“Marriott International has over 80 hotels in Greater China,” said Henry Lee, Chief Operations Officer, Greater China. “This opening demonstrates our aggressive growth plan as we expect to more than double our presence in the country.”\n“The Chongqing Marriott Hotel has the best of both worlds in terms of location. It has the convenience of being close to the business districts and the international airport as well as being situated in the proximity of beautiful surrounding nature,” continued Lee. “Marriott’s brand mission is to take care of the needs and desires of the next generation traveler so that they can expand their minds and explore the world. The Chongqing Marriott Hotel is set up based on this philosophy and will live up to the Marriott brand of enabling guests to travel brilliantly.”\nMarriott Hotels embraces the increasingly mobile and global world. Marriott Rewards members can complete check-in and check-out with a few touches on their smartphones through the exclusive Marriott Mobile app. Messages can also be pushed through the app to alert guests on check-out and other services.\n“As with other hotels under the flagship Marriott brand, the Chongqing Marriott is designed to allow travelers to fully enjoy their experience, whether it is for work or play,” commented James Lu, General Manager of Chongqing Marriott Hotel. “From guestrooms to meeting rooms, from culinary outlets to wellness facilities, the hotel displays Marriott’s recognized leadership in design and technology innovations in the travel industry.”\nCongqing Marriott Hotel executive loungeInspired by the “Marriott Modern” design philosophy, Chongqing Marriott Hotel has incorporated the old Chongqing Stilt House concept in the layout of the property. With full-height windows and elevated ceiling, panoramic views of the city are presented at the rooftop bar and each of the rooms. The rooms also feature comfortable Bedding, streamlined décor, high speed internet, 50’’ TV screen, ergonomic work desks and warm, personal service that make travel brilliant.\nThe Chongqing Marriott Hotel is also an ideal choice for meetings, conference and other memorable events. Two pillar-less ballrooms, five multi-function rooms plus a boardroom together provides more than 1800 m2 of meeting and event space which can accommodate up to 1330 people. Each of these rooms is equipped with a full set of audio-visual equipment including oversized LED screens and onsite associates are always available to ensure the smooth operations of functions.\nThe hotel offers a range of dining options including Cantonese, local Sichuan, and international food. The Sky bar on the 50th floor offers amazing Chongqing night views and is a fantastic place for parties.\nGuests can maintain their wellness routines in the indoor heated swimming pool and a state-of-the-art 24-hour gymnasium. These facilities will help keep them healthy and rejuvenated.\nSource:- Marriott Hotel", "external_links": [], "published": "2015-09-12T03:00:00.000+03:00", "crawled": "2015-09-12T19:14:00.319+03:00", "highlightTitle": ""}