{"organizations": [], "uuid": "ef5ef99ec84e16606e7829dbe09b59ff5fe8feb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30005469/conductive-ink-markets-2015-2025-forecasts-technologies-players", "country": "US", "title": "Conductive Ink Markets 2015-2025: Forecasts, Technologies, Players", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Conductive Ink Markets 2015-2025: Forecasts, Technologies, Players - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "ef5ef99ec84e16606e7829dbe09b59ff5fe8feb7"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30005469/conductive-ink-markets-2015-2025-forecasts-technologies-players", "ord_in_thread": 0, "title": "Conductive Ink Markets 2015-2025: Forecasts, Technologies, Players", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " ReportBuyer\nLONDON , Sept. 10, 2015 /PRNewswire/ -- The conductive ink and paste business is a large market that will generate $2.2 billion in 2015 in revenue at the ink/paste level. This market however is segmented, consisting of many emerging and mature markets. Overall, the market will experience 2.7% CAGR over the coming decade, although growth will be unevenly spread with several target markets experiencing rapid growth while others decline. This represents both opportunities as well as risk for all market participants. At the same time, emerging technologies and alternatives are improving fast too, increasingly becoming price and performance competitive with mature incumbents. This too, coupled with fluctuating base metal prices, suggests that companies must develop the right technology and market strategy to benefit from this changing market landscape. IDTechEx supports your decision making by assessing each market segment and each technology in great detail; and by providing detailed market forecasts, comprehensive technology and application assessment, and thorough business intelligence on key players.\nThe photovoltaic sector is a large target market for conductive paste. It however underwent a period of distress characterised by tumbling prices, bankruptcies and consolidation. This was triggered by the rapid expansion of production capacity in China and the simultaneous reduction of subsidies in Europe . In the same period however, other markets such as the touch screen and the automotive (with conductive inks/paste) sectors experienced continued growth while many others remained at a nascent or emerging state. In the background to all this, the financial crisis impacted the price of raw silver (the dominant technology), causing it to increase by 4.5 times between 2009 and 2012. These trends had huge implications for the market, strongly affecting the demand and changing its composition, while generating a global wave of interest in alternatives.\nIDTechEx fully characterises the market dynamics for each application. It finds that the photovoltaic sector will recover, registering growth. However, various plating technologies will steal market share away from silver flake paste, adversely affecting demand. This will however happen slowly over the coming decade and screen printed paste will continue to dominate the market. The penetration rate of plating will be slow thanks to falling silver prices. Inkjet printable inks will also slowly penetrate this sector as silicon wafers thin requiring non-contact printing. The underlying incentive for uptake will however remain weak here given the low spot prices of silicon ingots, limiting growth. In general, silver nanoparticles will remain a very small player in this sector. The report gives a detailed quantitative analysis of market shares for each technology in the PV sector.\nThe touch market will continue its growth, particularly because touch capability will penetrate the notebook and monitor markets too. This will represent a growing addressable target market segment, although sputtering will continue to present stiff competition to printed bezels or edge electrodes. Fine lines with narrow spacing will be the trend in this market as bezels narrow further. This suggests opportunity for gravure offset printing, in particular. The metal mesh transparent conductive film technology (fine metallic grid) will also take market share away from ITO, particularly in large-area devices where a low sheet resistance really matters. This translates into demand for silver nanoparticles as fine lines (<5um) are required.>\nThe automotive market will grow in prominence too, particularly as the interior products such as seat heaters, overhead consoles, etc adopt printed conductive pastes and inks. Here, the market will value long term reliability therefore price will be less of a differentiator in commoditised paste markets. The ability to combine good form factor and conductive functionality will play an important role here. The sensor market, particularly glucose sensors, will also grow fast, although there is large market uncertainty thanks to cost pressures applied by the US government and also due to a changing regularity framework. Printed logic and memory will remain at a nascent or R&D stage, contributing little to overall market figures, while smart packaging and RFID antennas will grow in units, but consumption per item will remain intrinsically small.\nSilver flake paste is mature and thus unlikely to show further performance improvement or cost reduction (unless base metal prices fall). At the same time, silver nanoparticles will improve, particularly as large corporations with capacity and leverage enter the scene. The trend towards alternatives such as copper and silver alloys will also continue, particularly in Japan where many companies offer different migration-free and relatively stable copper pastes and curing techniques. This is despite the fact that the switching motive is now weakened thanks to reducing raw silver prices. Graphene, PEDOT and carbon nanotubes will all find niche applications. For example, graphene is already in the RFID and smart packaging sectors thank to its low cost, fast printing and low curing temperature. Sintering techniques will also change and/or improve with photo-sintering registering particular success as it increases processing speeds and brings compatibility with low-temperature substrates.\nThe total market depicted above consists of at least 14 sub-segments. Overall, the market will experience 2.7% CAGR over the coming decade, although growth will be unevenly spread with several target markets experiencing rapid growth while others decline.\nThis report provides a detailed assessment of the market. IDTechEx has interviewed or visited over 50 relevant companies, and has organised and attended many events around the world. This has given IDTechEx unique access and insight into primary information. This report in particular provides:\n1- Ten year market forecasts by technology market share, volume demand and market value in 14 market segments including automotive, touch, photovoltaics, RFID, sensors, smart packaging, logic and memory, etc.\n2- Comprehensive technology assessment, benchmarking and competitive landscaping for silver flake pastes, silver nanoparticle inks, copper nano and flake pastes and inks, graphene and carbon nanotubes, PEDOT, and silver nanowires.\n3- Detailed application assessment including dynamics and drivers.\n4- Competitive business intelligence on all key industry players including over 50 profiles based on direct interviews and/or visits.\nDownload the full report: https://www.reportbuyer.com/product/3003834/\nAbout Reportbuyer\nReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers\nhttp://www.reportbuyer.com\nFor more information:\nSarah Smith\nResearch Advisor at Reportbuyer.com\nEmail: query@reportbuyer.com\nTel: +44 208 816 85 48\nWebsite: www.reportbuyer.com\n releases/conductive-ink-markets-2015-2025-forecasts-technologies-players-300141384.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=BR98594&Transmission_Id=201509101957PR_NEWS_USPR_____BR98594&DateId=20150910", "http://www.reportbuyer.com/", "http://www.prnewswire.com/news-releases/conductive-ink-markets-2015-2025-forecasts-technologies-players-300141384.html", "http://www.xmlnews.org/ns/", "https://www.reportbuyer.com/product/3003834/"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T04:43:28.186+03:00", "highlightTitle": ""}