{"organizations": [], "uuid": "39f539a4875e651c138c822d83db8932d3d71a1c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/08/150801ElChapo.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/09/13/lawyer-for-mexicos-most-wanted-man-says-he-doesnt-know-where-client-is", "country": "US", "title": "Lawyer for Mexico's most-wanted man, 'El Chapo,' doesn't know where client is -The", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Lawyer for Mexico's most-wanted man, 'El Chapo,' doesn't know where client is -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T01:57:00.000+03:00", "replies_count": 0, "uuid": "39f539a4875e651c138c822d83db8932d3d71a1c"}, "author": "Joshua Partlow | THE WASHINGTON POST", "url": "http://www.ticotimes.net/2015/09/13/lawyer-for-mexicos-most-wanted-man-says-he-doesnt-know-where-client-is", "ord_in_thread": 0, "title": "Lawyer for Mexico's most-wanted man, 'El Chapo,' doesn't know where client is -The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MEXICO CITY — Lawyer Juan Pablo Badillo, a silver-haired gentleman of 74, has only superlatives for his most famous client.\nHe’s a man of “exceeding intelligence” and the “greatest fortitude” who treats others with the “utmost respect.” In their meetings inside Mexico’s highest-security prison, Badillo said, he felt he was talking to a kindred spirit: “He knows laws, he knows the constitution, and obviously the penal code.”\nThis type of flattery might be a prerequisite for representing Joaquín “El Chapo” Guzmán, one of the world’s most notorious drug dealers, who tunneled out of prison in July. Another requirement is apparently discretion, and Badillo, lunching on breaded veal at the swanky Balmoral restaurant in the capital’s Hotel Presidente Intercontinental the other day, has many things he would not care to share.\n“I don’t want to venture into that terrain.”\n“Those things are in the past.”\n“I have a bad memory.”\n“I forget.”\nWhat Badillo can recall is that he grew up in the northern city of Durango, graduated from University of Juárez law school and began practicing in 1970, focusing on criminal law. He said he met Guzmán in 1993 when the drug lord was held in another Mexican prison, Puente Grande, from which he escaped in 2001, reportedly in a laundry cart. In those days, Badillo said, he would meet Guzmán two or three times a week, and got to know him well. So he was recruited to serve on Guzmán’s legal team when the trafficker was arrested last year in a commando raid in Mazatlán.\n“It was a professional challenge,” Badillo said.\nBadillo said he only met Guzmán six times during his recent yearlong stint at the Altiplano prison and their videotaped discussions focused on his legal defense. The U.S. government had requested Guzmán’s extradition — something Mexican authorities declined — and that possibility worried Guzmán above all else, Badillo said. When talk reached the drug lord that he might be extradited after all, he fled through a hole cut into his prison shower stall and then escaped through a mile-long tunnel. He has not been heard from since .\n“He was concerned and motivated [to escape] precisely by these rumors that his extradition was imminent,” Badillo said. “He was anticipating that they would kill him.”\nSee also: Is ‘El Chapo’ in Costa Rica? Probably not, but he wouldn’t be the first kingpin to flee here\n'Mercenarios extranjeros' que buscaban asesinar a 'El Chapo' Guzmán: Juan Pablo Badillo… http://t.co/j4RVGGyy5f pic.twitter.com/sgm53RkGI9\n— Periódico Expreso (@expresoweb) August 13, 2015\nEl Chapo: Hollywood material? Badillo, who insisted he had no advance knowledge of the escape nor any contact with Guzmán afterward, has not stopped defending his client just because he’s on the lam. He has filed two judicial requests, known as amparos , arguing that the state should stop hunting Guzmán. He believes that belligerent language coming from authorities in Mexico and the United States — phrases like “we’re going to find him and take him off the streets” — sound like death threats, and he wants the authorities to protect his client.\nBadillo also claims that a group of Colombian soldiers “armed to the teeth” have come to Mexico and are now trying to assassinate his client.\n“This is a critical moment for him,” Badillo said. “He’s living under the sword of Damocles.”\nEven if the government doesn’t accept Badillo’s arguments, he hopes people could just relax a little bit about ol’ Chapo. He’s a living legend, give the guy some peace.\n“It was a clean escape. There wasn’t any violence. There wasn’t harm to third parties. Perhaps a bit of damage to the bathroom floor. But a plumber could easily fix that,” Badillo said.\n“What if this had happened in the U.S.?” he asked. “In New York, Chicago, Alcatraz, Washington? It would be on the big screen in Hollywood. It already would have raked in a billion dollars in the first weekend. With Tom Cruise. ‘Mission Impossible’ number six or eight, who knows? So why is it such a big scandal here? It doesn’t make sense.”\nSee also: Undermining Mexico: How ‘El Chapo’ built a criminal empire, and escaped prison, by digging deep\nA DEA wanted poster distributed in Mexico by the U.S. Embassy announcing an active free phone for information on Joaquín “El Chapo” Guzmán and a $5 million reward.\nAFP/DEA/HO\nFor all his lawyer’s high praise, Guzmán has established himself as one of the most terrifying drug lords in the world. He leads the Sinaloa Cartel, the dominant narcotics smuggling organization in Mexico, responsible for bringing more heroin, cocaine and marijuana into the United States than any other group. His cartel has also waged deadly battles with other gangs for supremacy across Mexico.\nBadillo is not the only attorney for Guzmán. He said there were four or five others, but he didn’t know how to reach them. Apart from sharing the message that he thinks Guzmán is in danger, he didn’t want to discuss much about the fugitive’s career or his own. When I asked whether Badillo had represented other drug lords, he would only say, “I have had some relevant cases.”\nAfter lunch, a customer at another table came over and greeted Badillo warmly. As we were leaving, I figured I might as well ask whether the lawyer knew where Guzmán was now. He said he didn’t.\n“Some things are better not to know.”\nRecommended: After 23 years in prison, top assassin for Pablo Escobar is a ‘reformed’ man\n© 2015, The Washington Post", "external_links": ["http://t.co/j4RVGGyy5f", "https://twitter.com/expresoweb/status/631873331503861760", "http://www.cnn.com/2015/09/08/americas/mexico-reported-el-chapo-guzman-sighting/", "http://t.co/sgm53RkGI9", "http://www.huffingtonpost.com/entry/el-chapos-sons-twitter_55f04cb6e4b03784e2774e23"], "published": "2015-09-14T01:57:00.000+03:00", "crawled": "2015-09-14T09:08:06.522+03:00", "highlightTitle": ""}