{"organizations": ["Postmedia Network"], "uuid": "5e8e712bc732e58a52fec7318df312b52eb884f3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.torontosun.com", "main_image": "", "site_section": "http://www.torontosun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.torontosun.com/2015/09/25/colours-of-fall-by-postmedia-network-photographers---2015", "country": "CA", "title": "Colours of fall by Postmedia Network photographers - 2015 [Photos]", "performance_score": 0, "site": "torontosun.com", "participants_count": 0, "title_full": "Colours of fall by Postmedia Network photographers - 2015 [Photos]", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T18:14:00.000+03:00", "replies_count": 0, "uuid": "5e8e712bc732e58a52fec7318df312b52eb884f3"}, "author": "", "url": "http://www.torontosun.com/2015/09/25/colours-of-fall-by-postmedia-network-photographers---2015", "ord_in_thread": 0, "title": "Colours of fall by Postmedia Network photographers - 2015 [Photos]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Colours of fall by Postmedia Network photographers - 2015 First posted: Friday, September 25, 2015 11:14 AM EDT Colours of fall by Postmedia Network photographers - 2015 Previous Next \nThe Niagara Parks Commission’s Reiger Begonia display at the Floral Showhouse. The Fall Harvest theme of the show features over 300 Begonia’s surrounded by coleus, ferns, and tropicals, with pumpkins and gourds rounding out the fall theme. Mike DiBattista/Postmedia Network Mike Dibattista/Niagara Falls Re \nThe Niagara Parks Commission’s Reiger Begonia display is on now at the Floral Showhouse. Mike DiBattista/Postmedia Network Mike Dibattista/Niagara Falls Re \nA swather rolls east on Township 712 on Saturday September 19, 2015 west of Grande Prairie, Alta. Tom Bateman/Postmedia Network Tom Bateman/Daily Herald-Tribune \nTrent University president Leo Groake samples tomatoes during a tour of Trent University Market Garden on Friday September 11, 2015 on Douro Ninth Line in Peterborough, Ont. Clifford Skarstedt/Postmedia Network Clifford Skarstedt/The Examiner \nA palette of fall colours warm up a chilly morning in Jubilee Park on 100 Street on Thursday September 17, 2015 in Grande Prairie, Alta. Tom Bateman/Postmedia Network Tom Bateman/Daily Herald-Tribune \nA magpie squawks in its search for food at the Alberta Legislature grounds in Edmonton, Alta., on Thursday September 17, 2015. Ian Kucerak/Postmedia Network Ian Kucerak/Edmonton Sun \nA seagull picks up a maple leaf out of a puddle in front of city hall in Ottawa Ontario Monday Sept 14, 2015. Tony Caldwell/Postmedia Network Tony Caldwell/Ottawa Sun \nCottonwood leaves and willows along Berry Creek west of Wardlow, Ab., on Wednesday September 23, 2015. Mike Drew/Postmedia Network Mike Drew/Calgary Sun \nJan Krosse plows under a field of corn that was harvested for the families dairy herd near Highbury in north London, Ont. on Monday September 21, 2015. Mike Hensen/Postmedia Network Mike Hensen/London Free Press \nFall colours settle into the landscape on Wednesday September 9, 2015 at Magoo's Landing along the Wapiti River, south of Grande Prairie, Alta. Tom Bateman/Postmedia Network Tom Bateman/Daily Herald-Tribune \nFall colours. A minivan turns north onto 129 St., off of a yellow leaved trees along 102 Ave., in Edmonton on Monday Sept. 14, 2015. Tom Braid/Postmedia Network. Tom Braid/Edmonton Sun/Postmedia Network \nFall flowers at the Innisfil Farmers' Market, in Innisfil, Ont. on Thursday September 17, 2015. Miriam King/Postmedia Network Miriam King/Bradford Times \nFall colours are seen on trees at the Alberta Legislature grounds in Edmonton, Alta., on Thursday September 17, 2015. Ian Kucerak/Postmedia Network Ian Kucerak/Edmonton Sun \nAn autumn magic chokeberry plant, one of several plants suited to sensory gardens at Heirloom Greens and Gallery on Fanshawe Road East in London, Ont. on Monday August 3, 2015. Craig Glover/The London Free Press/Postmedia Network Craig Glover/The London Free Pre \nDenim Days was the theme at this years Port Hope Fall Fair at the Town Park Rec Centre and fields on Friday September 18, 2015 in Port Hope, Ont. Pete Fisher/Postmedia Network Pete Fisher/Northumberland Today \nKatlyn Anderson, events assistant at the Belleville Chamber of Commerce (left) and special events co-ordinator, Susan Walsh, get ready for Flavours of Fall with Culture Days, in Belleville, Ont. Wednesday, September 23, 2015. Sarah Hyatt/Postmedia Network Sarah Hyatt/The Intelligencer \nSome fall-tinted leaves catch the sun on the last day of summer, Tuesday September 22, 2015 at the Bear Creel Reservoir in Grande Prairie, Alta. Tom Bateman/Postmedia Network Tom Bateman/Daily Herald-Tribune \nGrade 3 student Lily Pascoe bobs for apples during the second annual Fall Fun Fair on Friday September 18, 2015 at Queen Mary Public School in Peterborough, Ont. Clifford Skarstedt/Postmedia Network Clifford Skarstedt/The Examiner \nKelsey Smart walks her dog, a blue healer mix named Summit in Shouldice Park in NW Calgary, Alta. as the fall colours come out in force on Tuesday September 22, 2015. Stuart Dryden/Postmedia Network Stuart Dryden/Calgary Sun \nA cyclist makes their way along a tree lined 88 Avenue near 110 Street, in Edmonton Alta. on Thursday Sept. 24, 2015. David Bloom/Postmedia Network David Bloom/Edmonton Sun \nJohn Koob and Jenna O'Hare walk through the fall leaves in Hawrelak Park, in Edmonton Alta. on Wednesday Sept. 23, 2015. David Bloom/Postmedia Network David Bloom/Edmonton Sun \nA fountain is seen running at the Alberta Legislature grounds in Edmonton, Alta., on Thursday September 17, 2015. Ian Kucerak/Postmedia Network Ian Kucerak/Edmonton Sun \nA jogger cruises down an autumn-laden path east of Edworthy Park in Calgary, Alta., on Thursday, Sept. 24, 2015. Lyle Aspinall/Postmedia Network Lyle Aspinall/Calgary Sun", "external_links": [], "published": "2015-09-25T18:14:00.000+03:00", "crawled": "2015-09-25T20:53:10.344+03:00", "highlightTitle": ""}