{"organizations": [], "uuid": "d28b7bdd48888953564802ea494dce62add8dab6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03458/JohnHannah_3458430a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-30.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/11901407/John-Hannahs-Dartmouth-My-Kind-of-Town.html", "country": "US", "title": "John Hannah's Dartmouth: My Kind of Town", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "John Hannah's Dartmouth: My Kind of Town - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T21:56:00.000+03:00", "replies_count": 0, "uuid": "d28b7bdd48888953564802ea494dce62add8dab6"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/11901407/John-Hannahs-Dartmouth-My-Kind-of-Town.html", "ord_in_thread": 0, "title": "John Hannah's Dartmouth: My Kind of Town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why Dartmouth? It is a beautiful town. The way it tumbles down the hill, with the Britannia Royal Naval College (01803 832141; royalnavy.mod.uk ) overlooking the harbour, is very aesthetically pleasing. I first visited about 12 years ago, when I spent a long weekend there with my wife, who was pregnant at the time. We fell in love with it. Just walking around the narrow streets, with staircases up to different levels, is interesting. It feels untouched by time, which is very appealing. As our twins have grown, we’ve been back often. We like to explore further afield, too. Dartmoor and Totnes aren’t far away. • Devon travel guide A view of the River Dart in Dartmouth Photo: Alamy Anything special I should pack? A raincoat and all-weather gear. It is a coastal resort, so will often catch the rain. What do you miss most when you’re away? The peace, the light, the size of the sky, the colours from the sea. I like to just hang out for a bit, do a bit of reading, painting, cycling. It is perfect for the whole family to relax and recharge. What’s the first thing you do on arrival? After scouting around the town, maybe having a coffee in a café, we’d head off to the beach. Blackpool Sands and Slapton Sands are both quite pebbly, but further down the coast, at Gara Rock, there is a nice sandy one. Slapton Sands is fascinating because of its association with the Second World War. There is a tank on the beach, and the village has quite an eerie feel. • 36 Hours In...Devon The exterior of Browns Hotel in Dartmouth Where’s the best place to stay? Browns Hotel (01803 832572; brownshoteldartmouth.co.uk ) is a nice modern hotel on the high street. We stayed there when we first went to the town but now tend to hire cottages. • The best hotels in Devon Where would you meet friends for a drink? The Dolphin Inn (01803 833698; 5 Market Street) is a good pub and there is also the restaurant at Dart Marina Hotel and Spa (01803 832580; dartmarina.com ) , which is a swanky place and has a great view. Local beers and the Devon cider are worth trying. • The best places for nightlife Where’s the best place for lunch? Café Alf Resco (01803 835880; cafealfresco.co.uk ) is the “go to” spot. It is only open for breakfast and lunch. Just down the road in Salcombe is the Winking Prawn (01548 842326; winkingprawn.co.uk ), a beach shack where you can get crab and lobster within a stone’s throw of the sea. • The best restaurants in Devon Cafe Alf Resco, Dartmouth Photo: Alamy And for dinner? The Seahorse (01803 835147; seahorserestaurant.co.uk ) is a good upmarket choice. But a few miles out of town, in Strete, the Laughing Monk (01803 770639; thelaughingmonkdevon.co.uk ) is hard to beat. Where would you send a first-time visitor? A stroll around the town to take in the harbour. Dartmouth Castle (0370 333 1181; english-heritage.org.uk ) has an interesting history. A boat trip up the river inland is great for exploring the small villages, while the naval college is also worth a visit. I’ve always wanted to take a boat out to sea and explore the coastal coves as well. Train enthusiasts should do a journey on the Dartmouth Steam Railway (01803 555872; dartmouthrailriver.co.uk ). You can also join guided tours of the area with Monty Halls, the BBC television presenter, through Great Escapes Dartmouth (01803 431858; greatescapesdartmouth.co.uk ) . The town also has a fantastic tradition during New Year when everyone is in fancy dress, and is a lot of fun. • Devon attractions The Seahorse restaurant in Dartmouth Photo: Alamy What should I avoid? Visiting at the height of summer. The town is a magnet for day-trippers, so we usually don’t visit around that time. Public transport or taxi? You can walk everywhere. But to enjoy surrounding areas, you need your own mode of transport. Manbag or moneybelt? I’d say manbag, as it is a very safe place to visit. Dartmouth harbour at dusk Photo: Alamy What should I bring home? Local wines from Sharpham Vineyard (01803 732178; sharpham.com ) . Anywhere that isn’t your kind of town? I tend to get disappointed with every high street in every city I visit, as they all look the same. When I first started out as an actor and visited cities such as Bristol and Leeds, each had its own character and vibe with different shops – but that isn’t the case anymore. Marley’s Ghosts, a new television series starring John Hannah, starts at 10pm tonight on Gold. Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-09-30T21:56:00.000+03:00", "crawled": "2015-09-30T16:41:45.209+03:00", "highlightTitle": ""}