{"organizations": [], "uuid": "a01eac0486790d00f1d5b025e5ddd6127c23313e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeasteurope.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/480298179.jpg", "site_section": "http://z.about.com/6/o/m/goeasteurope_t2.xml", "section_title": "About.com Eastern Europe Travel: What's Hot Now", "url": "http://goeasteurope.about.com/od/praguetravel/a/pragueindecember.htm", "country": "US", "title": "Prague in December - Weather, Events, and Tips", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Prague in December - Weather, Events, and Tips", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T14:05:00.000+03:00", "replies_count": 0, "uuid": "a01eac0486790d00f1d5b025e5ddd6127c23313e"}, "author": "", "url": "http://goeasteurope.about.com/od/praguetravel/a/pragueindecember.htm", "ord_in_thread": 0, "title": "Prague in December - Weather, Events, and Tips", "locations": ["Prague"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Average December temperature: 0ºC / 32ºF December average high: 2ºC / 35ºF December average low: -3ºC / 26ºF December in Prague is cold, with temperatures that can dip below freezing. The positive side to winter in Prague is reduced precipitation. Spring and summer sees rainfall, but winter sees little snow.\nGet more Prague weather information. What to Pack for Prague in December Pack for winter weather for December travel to Prague. Follow tips for winter dress , consider your ability to layer clothing, and bring necessary items, like gloves and scarf, to protect your skin from the cold. You'll want to bundle up as you sightsee, travel to concert venues, or shop the famous market on Old Town Square.\nDon't forget: Warm, comfortable boots or shoes and woolen socks Hat, gloves, scarf December Holidays and Events in Prague December 5th : St. Nicholas Eve , or Mikulas is an annual event during which the Czech St. Nick rewards good children with treats in Old Town Square and elsewhere in Prague. During this fun time, you may see bearded actors on the streets of Old Town accompanied by mischievous angels and devils.\nDecember 24-26 marks the official celebration of Czech Christmas . Christmas in Prague , however, is a month-long event, with Prague Christmas Markets drawing tourists to the city despite the cold weather. Nativity scenes, a visit from St. Nicholas, the appearance of the Christmas carp – all of these traditions help make December in Prague memorable for visitors. Don't forget to pack your camera, but leave plenty of room in your luggage for handmade souvenirs, gifts, and decorations to take back home with you. \nAll Month : An annual Christmas exhibition at Bethlehem Chapel showcases crafts and decorations chosen around a holiday theme. View photos of Christmas in Prague \nNew Year's Eve in Prague is celebrated around the city on the night of December 31st , with fireworks lighting up the sky over Old Town. Parties and concerts mean that celebrants can choose indoor venues if they don't want to stand around in the cold waiting for the fireworks over Old Town Square. Tips for Travel to Prague in December Celebrate Christmas with the Czechs during December. Enjoy hot mulled wine as you peruse the goods at the Christmas Market on Old Town Square. Attend Christmas concerts and be sure to venture out at night, when Christmas lights set historic Prague aglow. Don't let Prague Christmas hours of operation put a crimp in your plans. Schedule reservations and buy tickets in advance for December 24th - 26th. Book Flights and Hotels for Prague in December Hotels in Prague: Compare Prices Flights to Prague: Compare Prices", "external_links": [], "published": "2015-09-28T14:05:00.000+03:00", "crawled": "2015-09-28T18:06:52.221+03:00", "highlightTitle": ""}