{"organizations": [], "uuid": "cc0e216a6a62125e08d08db9644ce8de49f03f19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/omanair_profile-300x164.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-oman-air-rahal-multi-segment-ticket-option-launched/", "country": "US", "title": "New Oman Air Rahal Multi-Segment Ticket Option LaunchedTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "New Oman Air Rahal Multi-Segment Ticket Option LaunchedTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "cc0e216a6a62125e08d08db9644ce8de49f03f19"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-oman-air-rahal-multi-segment-ticket-option-launched/", "ord_in_thread": 0, "title": "New Oman Air Rahal Multi-Segment Ticket Option LaunchedTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Oman Air Rahal Multi-Segment Ticket Option Launched Published on : Wednesday, September 9, 2015\nOman Air, the designated carrier of the Sultanate of Oman is a business enterprise committed to the basic objective of providing safe, reliable and profitable air transport services for passengers and cargo as well as other aviation related services. Apart from being recognized as a strong business presence, Oman Air is respected for its professional attitude and recommended for its punctuality and service excellence.\nStarting off as a regional player, Oman Air as Oman’s national carrier, has witnessed rapid growth since the time it was established. The ownership of Oman Air rests in the hands of the government of Oman. Oman Air has its hub base at Muscat International Airport in Muscat, Oman. Oman Air Head Office is situated at Muscat, Oman. This airline has a strong work force of well-trained employees whose dedication and hard work has helped us to build a distinct identity and customer base.\nOman Air partners with many carriers around the world, while having a special code-share partnership with several select carriers. Oman Air has implemented its Frequent Flyer Programme with these code share partners. Today, it has carved a niche of its own with its renowned traditions of hospitality, and flies to several destinations, on both domestic and international sectors. Oman Air is now the airline of choice for the discerning business and leisure traveller in the regional airline scenario. Bringing together, people from different nations and diverse cultures. Welcoming each one of its guests with true hospitality and warmth that it’s quintessentially Omani.\nSource:- Oman Air", "external_links": [], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T04:15:43.395+03:00", "highlightTitle": ""}