{"organizations": [], "uuid": "bb8d2fc9a840080780ea39517896f844bce105c4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30124103/las-vegas-sands-builds-200000-hygiene-kits-for-clean-the-world", "country": "US", "title": "Las Vegas Sands Builds 200,000 Hygiene Kits for Clean the World", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Las Vegas Sands Builds 200,000 Hygiene Kits for Clean the World - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "bb8d2fc9a840080780ea39517896f844bce105c4"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30124103/las-vegas-sands-builds-200000-hygiene-kits-for-clean-the-world", "ord_in_thread": 0, "title": "Las Vegas Sands Builds 200,000 Hygiene Kits for Clean the World", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Information contained on this page is provided by an independent third-party content provider. WorldNow and this Station make no warranties or representations in connection therewith. If you have any questions or comments about this page please contact pressreleases@worldnow.com .\nSOURCE Las Vegas Sands\nToday, 4,000+ volunteers in Las Vegas, Pennsylvania, Singapore and Macao worked around the clock and across the globe to deliver much-needed hygiene supplies to people in need\nLAS VEGAS , Sept. 26, 2015 /PRNewswire/ -- Las Vegas Sands Corp. (NYSE: LVS) and international social enterprise Clean the World today completed an unprecedented 24-hour global volunteer effort to build 200,000 hygiene kits that will be distributed to populations in need worldwide, including to help homeless people in the United States .\nMore than 4,000 LVS Team Members and community volunteers participated in the Las Vegas Sands Global Hygiene Build with Clean the World – which was both organizations' largest volunteer effort to date, resulting in the most kits ever built for Clean the World at one time. The build was held at LVS' Singapore , Macao , Bethlehem and Las Vegas properties sequentially and all within a 24-hour period on Saturday, starting at Marina Bay Sands, LVS' property in Singapore, at 9 a.m. locally and culminating at 6 p.m. Pacific Time in Las Vegas . The effort was part of LVS's global corporate citizenship program, Sands Cares , and its ongoing partnership with Clean the World.\n\"Through this ambitious global Sands Cares event, we are helping hundreds of thousands of people without access to hygiene supplies to help them stay healthy,\" said Ron Reese , senior vice president of corporate communications at LVS. \"Today showed the amazing impact people can have by uniting around a single mission.\"\nEach hygiene kit contains soap and other hygiene items collected from Clean the World's hospitality partners, including LVS properties globally. Soap is recycled through Clean the World's sanitation and processing equipment and packed with other amenities, such as shampoo, conditioner, a toothbrush and toothpaste, to form individual personal care kits.\nThe global event was underwritten by LVS and also received support from Sysco. LVS and Clean the World have a strong partnership built upon a collective commitment to help people in need while protecting the planet. Since 2011, LVS and Clean the World have recycled more than 50 tons of waste from LVS properties into more than 550,000 bars of soap.\n\"Today's accomplishment illustrates the collective commitment of Las Vegas Sands and Clean the World to make our world healthier through sustainable solutions that address and solve social ills. A global build of this magnitude makes far-reaching impact, providing reclaimed hygiene supplies to people and places we normally can't reach – a win for people and a win for the planet,\" said Shawn Seipler , founder and CEO of Clean the World.\nLVS' partnership with Clean the World is part of the company's global corporate citizenship program, Sands Cares. Announced in April 2014 , Sands Cares manifests the company's core corporate social responsibility focus: supporting people in the company and the hospitality industry, making local communities where LVS operates a better place to live and reducing environmental impact on the planet. Sands Cares unites corporate and property-level giving in communities where LVS operates to address the most pressing issues in local communities and make them better places to live. For more information about Sands Cares and key initiatives, please visit www.sandscares.sands.com .\nAbout Las Vegas Sands Corp.\nLas Vegas Sands (NYSE: LVS) is the world's leading developer and operator of Integrated Resorts. Our collection of Integrated Resorts in Asia and the United States feature state-of-the-art convention and exhibition facilities, premium accommodations, world-class gaming and entertainment, destination retail and dining including celebrity chef restaurants and many other amenities.\nOur properties include the five-diamond Venetian and Palazzo resorts and Sands Expo Center in Las Vegas , Sands Bethlehem in Eastern Pennsylvania , and the iconic Marina Bay Sands in Singapore . Through majority ownership in Sands China Ltd., LVS owns a portfolio of properties on the Cotai Strip in Macao , including The Venetian Macao, The Plaza and Four Seasons Hotel Macao and Sands Cotai Central, as well as the Sands Macao on the Macao Peninsula .\nLVS is dedicated to being a good corporate citizen, anchored by the core tenets of delivering a great working environment for nearly 50,000 employees worldwide, driving impact through its Sands Cares corporate citizenship program and leading innovation with the company's award-winning Sands ECO360° global sustainability program. To learn more, please visit www.sands.com .\nAbout Clean the World\nClean the World is a social enterprise with the mission of saving millions of lives around the world. Clean the World leads a Global Hygiene Revolution to distribute recycled soap and hygiene products to children and families in in need. Clean the World is the largest global recycler of hotel amenities with more than 4,000 hotel and resort partners, and 500 event partners, throughout North America. Since 2009, Clean the World has distributed more than 25 million bars of soap to children and families in 99 countries worldwide, while fulfilling an environmental mission by diverting 3,800 tons of hotel waste from polluting More information: http://www.cleantheworld.org .\nPhoto - http://photos.prnewswire.com/prnh/20150926/271083\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/las-vegas-sands-builds-2 -hygiene-kits-for-clean-the-world-300149576.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://cleantheworld.org/", "http://www.xmlnews.org/ns/", "http://www.sandscares.sands.com/", "https://photos.prnewswire.com/prnvar/20150926/271083", "http://rt.prnewswire.com/rt.gif?NewsItemId=AQ12736&Transmission_Id=201509262100PR_NEWS_USPR_____AQ12736&DateId=20150926", "http://photos.prnewswire.com/prnh/20150926/271083", "http://www.cleantheworld.org/", "http://www.sandscares.sands.com./", "http://www.prnewswire.com/news-releases/las-vegas-sands-builds-200000-hygiene-kits-for-clean-the-world-300149576.html", "http://www.sands.com/"], "published": "2015-09-26T03:00:00.000+03:00", "crawled": "2015-09-27T06:04:58.957+03:00", "highlightTitle": ""}