{"organizations": [], "uuid": "52a595555a5d2673a6d009e7249afe5062fa2087", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/seattle-news/city-council-restricts-commissions-granted-to-retired-spd-officers/", "country": "EU", "title": "Seattle City Council restricts commissions granted to retired cops", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Seattle City Council restricts commissions granted to retired cops | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T01:51:00.000+03:00", "replies_count": 0, "uuid": "52a595555a5d2673a6d009e7249afe5062fa2087"}, "author": "Steve Miletich", "url": "http://www.seattletimes.com/seattle-news/city-council-restricts-commissions-granted-to-retired-spd-officers/", "ord_in_thread": 0, "title": "Seattle City Council restricts commissions granted to retired cops", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Seattle City Council passed an ordinance Tuesday that repeals the authority of the police chief to grant special commissions to retired police officers used for private work.\nThe issue attracted attention last year when a retired Seattle police officer charged with criminal impersonation for working at a construction site with lapsed credentials agreed to perform 150 hours of community service and pay $50 in restitution to a woman who complained he angrily grabbed and pulled her as she crossed the street.\nAnne Levinson, auditor of the Seattle Police Department’s Office of Professional Accountability, had recommended the department discontinue its practice of authorizing “Extended Authority Commissions” that permit retired officers to act in a law-enforcement capacity, wear their uniforms and carry firearms at private work sites.\nLevinson warned the commissions create liability for the city while providing little or no accountability to citizens when poor practices or misconduct occurs.\n Although the retired officers were required to meet some initial qualifications, they might have left the department years ago, were not required to go through the training of active officers, nor were they supervised in the same manner, Levinson noted in a 2013 report.\n“The public has no way of distinguishing them from active officers so any poor demeanor or performance reflects badly on the force as a whole,” the report said.\nUnder the new ordinance, the police chief may appoint former employees, including retired parking-enforcement officers, with training and experience in traffic control, to conduct such work.\nBut they won’t wear Seattle police uniforms and their employers will decide if they should be armed, said Brian Maxey, the Police Department’s senior legal counsel.\nFormer employees who have been wearing Seattle police uniforms while working as security guards at places such as banks or movie theaters won’t be allowed to wear the uniforms, Maxey said.\nThe ordinance allows the chief to appoint qualified government employees to conduct limited law-enforcement duties, such as Seattle Municipal Court marshals or animal-control officers.\nThe police department supported the changes, which were ushered through the council’s public-safety committee by its chairman, Councilmember Bruce Harrell.\nThe ordinance was passed 9-0 by the full council.\nInformation from Seattle Times archives is included in this story.Steve Miletich: 206-464-3302 or smiletich@seattletimes.com", "external_links": [], "published": "2015-09-09T01:51:00.000+03:00", "crawled": "2015-09-10T01:56:59.134+03:00", "highlightTitle": ""}