{"organizations": [], "uuid": "cd3c6fccb1dd27f750c7a1cd5f1d3ae70960feee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/278882/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29928798/attend-fall-atlanta-home-show-and-stay-at-hampton-inn-suites-atlanta-galleria", "country": "US", "title": "Attend Fall Atlanta Home Show and Stay at Hampton Inn & Suites Atlanta Galleria", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Attend Fall Atlanta Home Show and Stay at Hampton Inn & Suites Atlanta Galleria - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T11:04:00.000+03:00", "replies_count": 0, "uuid": "cd3c6fccb1dd27f750c7a1cd5f1d3ae70960feee"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29928798/attend-fall-atlanta-home-show-and-stay-at-hampton-inn-suites-atlanta-galleria", "ord_in_thread": 0, "title": "Attend Fall Atlanta Home Show and Stay at Hampton Inn & Suites Atlanta Galleria", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hampton Inn & Suites Atlanta Galleria, located near Smyrna, GA offers convenient lodging to guests attending the Fall Atlanta Home Show on September 11-13, 2015.\n ATLANTA, GA, September 01, Vendors and guests attending the Fall Atlanta Home Show will find convenient lodging at the Hampton Inn & Suites Atlanta Galleria Hotel . Georgia's largest fall home show will be held at the Cobb Galleria Centre on September 11-13. The featured speaker will be architect, designer, and HGTV host John Gidding. A new part of this fall show will be the Outdoor Living Expo. More than 300 companies will represent their home improvement and landscape products and services. Visitors can tour a Tiny House, the latest trend for those considering downsizing.\n\"We are happy to welcome vendors and guests attending the Fall Atlanta Home Show,\" comments Sabrina Claiborne, Director of Sales at the Hampton Inn and Suites Atlanta Galleria. \"Our hotel is just two minutes from the Cobb Galleria Centre,\" explains Ms. Claiborne.\nThis award winning Smyrna GA hotel features comfortable guest rooms and suites with free high speed Internet and Hampton Clean and Fresh beds. Travelers will appreciate the convenience of the in-room microwave and mini refrigerator. The hotel's indoor pool is the perfect place to unwind after a busy day. Other amenities include a business center, fitness center, and Pavilion Pantry Market for snacks and beverages. The Hampton On the House Breakfast, with hot waffle station, is complimentary. Convenient Hampton On the Run Breakfast Bags are available on weekday mornings. Free weekday shuttle service is available to nearby locations including Cobb Galleria Centre. The Hampton Inn & Suites Atlanta Galleria recently received the 2015 TripAdvisor Certificate of Excellence Award.\nGuests can save up to 15% with the Book Early & Save deal. AAA, senior, and military discounts are available. HHonors members will earn points toward free hotel nights. The Hampton Inn & Suites Atlanta Galleria is located near the junction of I-75 and I-285.\nFor information about the Fall Atlanta Home Show, visit www.atlantahomeshow.com . To book your stay at the Hampton Inn & Suites Cobb Galleria hotel , call (770) 955-1110 or visit www.HAMPTONINNGALLERIA.com .\nAbout Hampton Inn & Suites Atlanta-Galleria\nIf you're looking for a great hotel in Atlanta, be a guest at the Hampton Inn & Suites hotel in Atlanta Galleria. It's super-convenient, located within walking distance of the Cobb Galleria Convention Center (which you may be visiting for business in Atlanta). This Atlanta area hotel is also just 12 miles from the Georgia Aquarium, Georgia World Congress Center, Six Flags Over Georgia and the Georgia Dome. The Smyrna, Georgia hotel also offers a broad range of services and amenities to make its guests' stay exceptional.\nFor more information visit: http://www.HamptonInnGalleria.com\nFor all media inquiries, please contact:\nAllison Reinert\nCardinal Web Solutions\nhttp://www.CardinalWebSolutions.com\n release/attend-fall-atlanta-home-show-and-stay-at-hampton-inn-amp-suites-atlanta-galleria-412052.php", "external_links": ["http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/attend-fall-atlanta-home-show-and-stay-at-hampton-inn-amp-suites-atlanta-galleria-412052.php"], "published": "2015-09-01T11:04:00.000+03:00", "crawled": "2015-09-01T12:16:24.017+03:00", "highlightTitle": ""}