{"organizations": [], "uuid": "8d64db7d44f12213d4e3cd61865ac8fa0c673eb9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/09/16/travel/images/30268900-01_big.jpg", "site_section": "http://www.nationmultimedia.com/home/rss/travel.rss", "section_title": "NationMultimedia.com - Travel", "url": "http://www.nationmultimedia.com/travel/Seasons-for-the-skin-30268900.html", "country": "TH", "title": "Seasons for the skin", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "Seasons for the skin", "spam_score": 0.0, "site_type": "news", "published": "2015-09-15T21:00:00.000+03:00", "replies_count": 0, "uuid": "8d64db7d44f12213d4e3cd61865ac8fa0c673eb9"}, "author": "", "url": "http://www.nationmultimedia.com/travel/Seasons-for-the-skin-30268900.html", "ord_in_thread": 0, "title": "Seasons for the skin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » travel » Seasons for the skin GETAWAYS THE NATION September 16, 2015 1:00 am \nSo Spa at Sofitel So Bangkok Escape the hustle and bustle of the city life and chill at the So Spa at Sofitel So Bangkok ... BANGKOK Seasons for the skin Escape the hustle and bustle of the city life and chill at the So Spa at Sofitel So Bangkok, which is welcoming winter with a seasonal facial treatment that combines the Asian touch with botanical products by Ytsara. It's priced at Bt2,200 per person and is available all through November. Call (02) 6240000 or e-mail: H6835-TH2@Sofitel.com. Advance reservations are highly recommended. Perfect relaxation Located only 15 minutes from Suvarnabhumi Airport, Eastin Easy Siam Piman, part of the Eastin chain of international hotels and residences, is the perfect base for you to relax before or after a long flight. With comfortable and well-equipped rooms featuring complimentary Wi-Fi, an all-day dining restaurant offering both local and international favourites, a swimming pool and a gym, Eastin Easy Siam Piman welcomes guests with a very special Book Now Pay Later offer priced at Bt1,317 per night for a Deluxe room including breakfast. Call (02) 917 5212 or visit www.EastinEasySiamPiman.com. Make mine a moon cake Delicious moon cakes return to The Sukosol, Bangkok to celebrate the Mid-Autumn festival. From now until the end of September, enjoy the full range of tempting moon cakes filled with mouth-watering savoury and sweet fillings including traditional Lotus Seed, Mixed Nuts, Durian, Chinese Date, Green Tea and Chestnut & Macadamia flavours. Call (02) 247 0123, extension1820 for Lin-Fa, extension1505 for The Deli Shop or extension1811 for Sapphire Bar. KANCHANABURI Romance by the river Set amid towering trees, lush foliage and landscaped gardens with the gently flowing River Kwai as a backdrop, U Inchantree Kanchanaburi is a great place for a wedding. The resort is currently offering a very special Engagement and Water Pouring Ceremony Package starting from Bt39,900 and catering for up to 50 guests. The package includes an indoor and outdoor wedding venue, monk ceremony, floral stand, backdrop, Thai-style water pouring set up and one night's stay for the bride and groom. It's available from now until December 31. Call (034) 521 584 or e-mail: reserve@ukanchanaburi.com. Visit www.UKanchanaburi.com. Destination of desire Skyscanner, the leading online travel search engine, is offering travellers a chance to win a holiday package to Asia's top travel destinations. Launched across Thailand, Malaysia, and Singapore, nine lucky travellers will stand a chance of winning a pair of return flight tickets and sponsored accommodation in Bali, Phuket or Chiang Mai . To participate, fans simply need to write in 150 words why they want to travel to the destination of their choice. The winning entries will be selected based on originality, relevance and creativity and will be announced by October 12. Skyscanner is accepting entries at www.Skyscanner.co.th/news/win-a-trip-sep-2015 from now until September 27. SPAIN Marvellous Madrid Hotel Ritz, Madrid is offering guests a selection of Experience Programmes that reveal the Spanish capital's attractions, both world-renowned and offbeat. Available until December 30, all four packages include accommodation in the guest's chosen room category, private airport transfer with chauffeur, Ritz continental breakfast and welcome treats. The Art Experience package for art lovers for two nights starts at 995 euros, the Madrid Experience package to discover the city for four nights starts at 2,605 euros, the Family Experience package for two nights starts at 1,455 euros and the Romantic Experience package for couples for two nights at 98 euros. Except for the Family Experience package, all rates are for two people sharing. Rates vary according to the guest's room choice. Visit MandarinOriental.com/ritzmadrid or e-mail: rzmad-reservations@mohg.com or phone at (+34 91) 701 67 67. 129 Viewed", "external_links": [], "published": "2015-09-15T21:00:00.000+03:00", "crawled": "2015-09-16T03:58:33.954+03:00", "highlightTitle": ""}