{"organizations": [], "uuid": "14f6b55d3bc67e77b0a2f36d0a2008b44cc59817", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/08/starwood.jpeg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/four-points-crosses-200th-hotel-milestone-in-dynamic-markets-around-the-world/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Four Points Crosses 200th Hotel Milestone in Dynamic Markets around the WorldTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Four Points Crosses 200th Hotel Milestone in Dynamic Markets around the WorldTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "91f11b276c520350aa5a619c4802215a35b9a016"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/four-points-crosses-200th-hotel-milestone-in-dynamic-markets-around-the-world/", "ord_in_thread": 0, "title": "Four Points Crosses 200th Hotel Milestone in Dynamic Markets around the WorldTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Four Points Crosses 200th Hotel Milestone in Dynamic Markets around the World  \nStarwood Hotels & Resorts Worldwide, today announced that its booming Four Points brand has crossed the 200th hotel milestone worldwide, fueled by unprecedented demand in dynamic destinations across the globe. Boasting the largest pipeline in the Starwood Hotels & Resorts portfolio, Four Points continues to exceed expectations with plans to open 12 additional hotels around the world by the end of this year – roughly one a week. With the recent openings of Four Points Istanbul Dudullu (Turkey); Four Points Seoul, Namsan (South Korea); Four Points Bali, Kuta (Indonesia); and Four Points Moncton (Canada), the brand, currently represented in 40 countries worldwide, continues its bullish global growth.\n \n“Four Points is proud to cross the 200th hotel milestone with the recent openings of these four hotels in diverse and dynamic markets across the globe. The brand’s explosive growth reflects its tremendous appeal for global travelers as well as our laser-like focus on expanding our global footprint,” said Brian McGuinness, Global Brand Leader, Specialty Select Brands for Starwood. “Built for the modern, everyday traveler, Four Points continues to offer our guests exactly what they need while on the road. Demand for our winning formula is at an all-time high, and the brand’s performance has never been better.”\nWhether travelling for business or pleasure, all fans of Four Points know they can expect consistent, authentic experiences in a relaxed atmosphere at any of the brand’s hotels around the world. From essentials like fast and free WiFi throughout the hotel, to the brand’s iconic Best Brews and BBQ™, where guests can always enjoy a crisp local craft beer and seasonal BBQ-style appetizers at the hotels’ signature pubs, Four Points is designed for the smart, independent traveler seeking excellent service and a great travel experience.\nFour Points is on track to expand its portfolio of rooms by nearly 60% in the next five years with new hotels strategically located in nearly every corner of the globe. Today, the brand has 119 hotels in North America, 44 in Asia Pacific, 21 throughout Europe, Africa and the Middle East, and 19 in Latin America. Hotels expected to open by year’s end include: Four Points Vadodara (India), Four Points Bellingham Hotel & Conference Center (WA), Four Points Istanbul Batisehir (Turkey), Four Points Phoenix North (AZ), Four Points Midland (TX), Four Points Oran (Algeria), Four Points San Diego – SeaWorld (CA), Four Points Penghu (Taiwan), Four Points Chengdu, Anren, Pujiang Resort (China), Four Points Fargo (ND), Four Points, Barrie (Ontario), and Four Points Cincinnati North (OH).\nSource:- Starwood Hotels", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T18:47:06.936+03:00", "highlightTitle": ""}