{"organizations": [], "uuid": "90af2a52e60509e50a0f088167e9a5f01d44ef70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63632/isiolo-s-new-airport-springboard-kenya-s-north", "country": "US", "title": "Isiolo’s new airport: A springboard to Kenya’s north", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Isiolo’s new airport: A springboard to Kenya’s north", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T05:38:00.000+03:00", "replies_count": 0, "uuid": "90af2a52e60509e50a0f088167e9a5f01d44ef70"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63632/isiolo-s-new-airport-springboard-kenya-s-north", "ord_in_thread": 0, "title": "Isiolo’s new airport: A springboard to Kenya’s north", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Isiolo’s new airport: A springboard to Kenya’s north Original, timely global, travel, tourism, business news and research: \nBy Prof. Wolfgang H. Thome, Ph.D., eTN Africa Correspondent | Sep 11, 2015 Terminal building at the new Isiolo airport, both pictures courtesy of KAA eTN Exclusive: Unique and original, timely, global breaking news: \nProgress is reported from one of Kenya’s new aviation facilities, the Isiolo Airport, long seen as a sort of a white elephant but coming into its own now. Tourists flying to some of the northern parks and game reserves near Isiolo have traditionally been using the airfield inside Samburu and smaller strips serving the more isolated camps, all but inaccessible for Kenyans living in the Isiolo area if they wanted to fly to Nairobi instead of undertaking a long journey by car. \nThe new airport, part of the LAPSSET infrastructure development – LAPPSET stands for Lamu Port, South Sudan, and Ethiopia - refers to the ambitious project to build a new deep-sea port in Lamu. A pipeline, highway, and rail connection eventually linking South Sudan and Ethiopia with Kenya will, however, change that. Information received from the Kenya Airport Authority suggests that the runway is now all but complete and work is ongoing to finish the passenger terminal and peripheral buildings, cargo section, roads, and parking. When open, Kenya’s latest airport will be able to handle over half a million passengers a year, enough to entice local airlines to launch scheduled flights to Isiolo. Safari lodges and camps will also be able to use the airport to receive clients and transport them to their properties with their vehicles, similar to the way tourists fly to Nanyuki’s airfield – which, however, is privately owned – and are then driven to the camps and lodges where they are booked. \nAt the same time, the contractors of the Isiolo-Ethiopia highway are pushing ahead to complete the last section of this mega project which will eventually allow an all tarmac drive from Nairobi via Isiolo and Marsabit to Moyale and then on to Addis Ababa, a stark contrast to the old days when it could take days on rough roads and poor tracks to even reach the frontier between the two countries.", "external_links": [], "published": "2015-09-11T05:38:00.000+03:00", "crawled": "2015-09-11T10:57:20.644+03:00", "highlightTitle": ""}