{"organizations": [], "uuid": "782525de594e4a00ad838581a2a9fb9d0d1d48ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theplanetd.com", "main_image": "http://theplanetd.com/images/Peggys-cove-nova-scotia-2.jpg", "site_section": "http://theplanetd.com/feed", "section_title": "The Planet D: Adventure Travel Blog", "url": "http://theplanetd.com/peggys-cove-from-land-and-sea/", "country": "", "title": "Peggy’s Cove: the famous landmark from land and sea", "performance_score": 0, "site": "theplanetd.com", "participants_count": 1, "title_full": "Peggy’s Cove: the famous landmark from land and sea", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T15:37:00.000+03:00", "replies_count": 0, "uuid": "782525de594e4a00ad838581a2a9fb9d0d1d48ee"}, "author": "Dave and Deb", "url": "http://theplanetd.com/peggys-cove-from-land-and-sea/", "ord_in_thread": 0, "title": "Peggy’s Cove: the famous landmark from land and sea", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  No Comments » • Canada As we climbed aboard the Sea Dog IV, we felt giddy with excitement. This was our first boat tour ever on the Atlantic Coast of Canada, and we were going out to view one of Nova Scotia’s most iconic landmarks from the sea. Peggy’s Cove epitomizes the life and history of Atlantic Canada. This small village is still a fishing community with lobster boats moored in the harbour where colourful wooden houses line the tiny inlet. It’s a timeless destination that lets you feel what life was, and is like for the hard-working families of Nova Scotia. A beautiful Peggy’s Cove sunset Peggy’s Cove Lighthouse \nTourists flock to Peggy’s Cove to see the lighthouse standing proud on rolling granite rocks. The unique coastline was carved over thousands on years from retreating glaciers and ocean tides carving the 400 million year old rock created by molten lava bubbling up from the surface of the earth. \nIt’s an incredible landscape that Dave and I couldn’t quite put our finger on where we’ve seen anything like it before. It’s an experience to walk along the giant rolling formations to view the lighthouse from all different angles. Warning: When exploring Peggy’s Cove, stay off the black rocks. Rogue waves have been known to sweep people out to sea. This year two separate incidents happened to two Ontario men . One was rescued, the other wasn’t so lucky: His body was never found. Pay attention to the warning signs and don’t become a Peggy’s Cove Moron. \nPart of the attraction of Peggy’s Cove is due to hiking along the massive smooth rocks. The 100 year old lighthouse makes for postcard perfect photographs where it rests high above the raging sea where it’s beacon still acts as a guide for passing ships. Taking in the stunning view at Peggy’s Cove. \nIt’s a wonderful afternoon to stroll through the village, searching for local art or ordering a fresh catch of the day off the menu at the Sou’Wester restaurant located right beside the lighthouse. We loved sitting on colourful Adirondack Chairs at the local coffee shop as we basked in the sun listening to visitors rave about the destination. \nFor more Canada travel, enjoy this beautiful photostory of Ontario \nTourists come from around the world. While eavesdropping on conversations, we determined that all nations and cultures agree, Peggy’s Cove is a magical timeless destination where one could rent a cottage for the summer and slow down to enjoy Canada’s coastal playground. The village of Peggy’s Cove \nBut Peggy’s Cove can be overrun with tourists when the busses arrive, so we suggest visiting at sunrise or sunset when the crowds disappear and you feel as though you have it all to yourself. If you look hard enough, you can find a secluded rock to take in the view away from any care in the world. Peggy’s Cove by Sea \nWhile seeing Peggy’s Cove from land is extraordinary, viewing it from sea is even better. It’s while on these waters that you realize how powerful the Atlantic Ocean can be and how important of a role the lighthouse played in keeping vessels safe through fog and rough weather. Our boat for the day for exploring Peggy’s Cove \nThere is only one tour company that offers boat tours and you can book in advance or see if you can hop on the next tour that leaves port two to five times each day during peak season. \nSee Peggy’s Cove Boat Tours for more details. \nCaptain Peter and first mate Courtney welcomed us with hearty smiles and after a quick safety drill, we were heading out to sea. The first thing you see once you leave the harbour is the Peggy’s Cove lighthouse and as the Captain sounds the horns, everyone on boards hoots and hollers letting the people on shore know just how much fun we were having. Our mighty Captain for our tour of Peggy’s Cove \nCourtney told us about the history of Peggy’s Cove and a bit about the life of a fisherman today. It’s a dying breed on the East Coast as corporations buy up fishing licenses from retiring fishermen and the younger generation seeks new and exciting lives in the cities. The youngest age of the fishermen in Peggy’s Cove in 50 years old! Now that is a boat that is prepared for sea! \nBut life goes through changes and careers come and go, so I guess this is the way of the world in many places. As technology introduces people to a different way of life, career paths change and new generations turn their heads towards greener pastures. \nSee: Dave and Deb fly fishing in Ontario, Canada \nFor now, the life of the fisherman continues in Peggy’s Cove and some men have flourished so much, they have bought beautiful homes and plots of land with private beaches in the nearby inlet of West Dover. The colourful inlet of West Dover \nThe tour is peaceful, informative and entertaining. Captain Peter, even lets you take a spin at the wheel when we are safely in a quiet bay. We donned his captain’s hat and kept the wheel steady as we tried to keep the boat heading in a straight line. It’s tougher than it looks, but as Captain Peter said, if you can drive a car, you can do this. Different perspectives from the sea: And tourists are following the rules avoiding black rocks. \nStay off the Black Rocks at Peggy’s Cove! \nSeeing the lighthouse from a different perspective is definitely a highlight of the Peggy’s Cove boat tour, but exploring the islands and nearby harbours is something that shouldn’t be missed. It’s worth getting out on the water to explore the coastline and view the different island formations of the surrounding area. \nWhile many people simply spend a couple of hours at Peggy’s Cove, we felt that two solid days wasn’t enough. There are many places to hike, kayak, watch the sunrise or enjoy a night by the campfire. There the William E. de Garthe fisherman’s monument carved on 30 feet of granite rock in town and there’s the beautiful Swiss Air monument honouring the 229 people who lost their lives in the 1998 plane crash that happened off the coast of Nova Scotia. Where to Stay at Peggy’s Cove Our Oceanstone Cabin on the Beach \nWe suggest 3-5 days to truly enjoy the beauty and hospitality of Peggy’s Cove. There are plenty of places to stay and there’s a beautiful landscape to explore. Take your time at Peggy’s Cove and enjoy! \nWe stayed at Oceanstone Resort located just 5 minutes from Peggy’s Cove. The beautiful private cottages are perfect for couples or families. With complete kitchens, private fire pits and beachfront properties, it’s a secluded piece of paradise that you won’t ever want to leave. There’s a dining room and bakery. It’s places like this that add to the charm of travel through Nova Scotia. Many of the B&Bs are family run with personal touches added to make you feel at home. So go to Nova Scotia at feel like", "external_links": [], "published": "2015-09-14T15:37:00.000+03:00", "crawled": "2015-09-14T19:02:52.966+03:00", "highlightTitle": ""}