{"organizations": [], "uuid": "24a2ecb9c68af9c2f5bf497f207ba165c2c37174", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/287919-India-Ad-3_med-res.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/boeing-receives-order-from-india-for-22-apache-and-15-chinook-helicopters/", "country": "US", "title": "Boeing Receives Order from India for 22 Apache and 15 Chinook HelicoptersTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Boeing Receives Order from India for 22 Apache and 15 Chinook HelicoptersTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "24a2ecb9c68af9c2f5bf497f207ba165c2c37174"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/boeing-receives-order-from-india-for-22-apache-and-15-chinook-helicopters/", "ord_in_thread": 0, "title": "Boeing Receives Order from India for 22 Apache and 15 Chinook HelicoptersTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Boeing Receives Order from India for 22 Apache and 15 Chinook Helicopters\nThe India Ministry of Defence has finalized its order with Boeing for production, training and support of Apache and Chinook helicopters that will greatly enhance India’s capabilities across a range of military and humanitarian missions.\nIndia will receive 22 AH-64E Apache attack helicopters and 15 CH-47F Chinook heavy-lift helicopters. Both are the newest models of those aircraft.\n“This is a milestone in Boeing’s expanding commitment to India,” said Pratyush Kumar, president, Boeing India. “This acquisition enhances the Indian Air Force’s capabilities and offers us an opportunity to further accelerate ‘Make in India.’ Large sections of the Chinook fuselage are already manufactured in India and discussions are ongoing with our Indian partners to make Apache parts.”\nThe Apache is the world’s leading multi-role attack helicopter. The AH-64E Apache, the most modern variant also flown by the U. S. Army, features enhanced performance, joint digital operability, improved survivability and cognitive decision aiding.\nThe CH-47F Chinook is an advanced multi-mission helicopter operated by the U.S. Army and 18 other defense forces. The Chinook has proven its ability to operate in the range of conditions that typify the Indian subcontinent, including delivering heavy payloads to high altitudes.\n“These new aircraft will provide world-class capabilities to meet the Indian Air Force’s missions today, tomorrow and well into the future,” said David Koopersmith, vice president and general manager, Boeing Vertical Lift division. “This agreement represents another major step forward in our long and successful relationship with India.”\nIndia is the 14th nation to select the Apache and the 19th nation to select the Chinook.\n“The Apache and Chinook represent the best of high-performing technologies that will modernize India’s defense capabilities,” said Dennis Swanson, vice president, Defense, Space & Security in India. “We look forward to delivering the newest Apache and Chinook to our customers and remain focused on delivering on its commitments to the Indian Air Force and India’s Ministry of Defence.”\nSource:- Boeing", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T15:44:38.712+03:00", "highlightTitle": ""}