{"organizations": [], "uuid": "f1e38fddf71c14ce81ced814118709e45e85b33a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/images14-300x110.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/travel-association-news/", "section_title": "TRAVEL ASSOCIATION NEWS Archives - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/airbus-prepares-short-airfield-package-modification-for-a320neo/", "country": "US", "title": "Airbus prepares “SHort AiRfield Package” modification for A320neoTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Airbus prepares “SHort AiRfield Package” modification for A320neoTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "f1e38fddf71c14ce81ced814118709e45e85b33a"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/airbus-prepares-short-airfield-package-modification-for-a320neo/", "ord_in_thread": 0, "title": "Airbus prepares “SHort AiRfield Package” modification for A320neoTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Airbus prepares “SHort AiRfield Package” modification for A320neo Published on : Friday, September 18, 2015\nA team at Airbus’ facility in Filton, UK, has designed, built and tested a performance-enhancing component as an option for the A320neo. The innovation, referred to as “SHARP” , aims to increase wing lift at low speeds and thus enhance take-off and landing performance for operations on short runways. A key component of the package is a Kevlar composite panel modification to the wing’s ‘Root Fillet Fairing’ to enable the improved landing performance.\nThe requirement for such a modification was driven in part to facilitate operations into Brazil’s Santos Dumont airport, where the runway is only around 1,300m long.As well as the short runway there is a mountain to one side and a long bridge on the other,which makes this a challenging operation. Airbus has identified several operators which would like to fly their future A320neos into this airport – and SHARP will allow them to do so.\nThe UK team, working with their engineering colleagues in Bremen (Germany) had considered various proposals to reduce the approach speed at landing. The resulting ‘winner’ was a modification to optimise the airflow over the Root Fillet Fairing panel, and which could be delivered as retrofit-able option. Construction of a test panel took place in Filton’s “ProtoSpace” facility using ‘rapid prototyping’ Additive Layer Manufacturing (ALM) technology to ‘3D-print’ the moulds. Fibre glass was then layered into the moulds to create the new panel prior to final finish and paint. Metrology experts then scanned the panel to ensure that exact profile being tested was well understood. The prototype’s subsequent flight-testing in Toulouse was successful and the engineering and industrial teams are now finalizing this design for production.\nA320 Family ‘Max-Pax’ and new cabin solutions gain momentum by retrofit\nThe recently achieved ‘increased exit-limit’ certification on the A320 Family ‘Max-Pax’ solution allows more passengers to be comfortably and safely accommodated. Key to this, the innovative Space-Flex and Smart-Lav designs together with the latest technology and materials enable space optimisation in the cabin and aft galley areas, making room for more seats,without reducing seat pitch comfort.\nThe aftermarket embodiment can provide a return on investment for the airline in around two years dependent on the route they operate. The new configurations and additional seats are already specified for line-fit on newly delivered aircraft by various operators, and now the option is making inroads in the retrofit market. The main drivers include: revenue generation, harmonisation and the ability to retain high standards of comfort and service with additional passengers.\nSource:-Airbus", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T15:05:23.919+03:00", "highlightTitle": ""}