{"organizations": [], "uuid": "3b557de22d3a6ee7e8449045e84336083c7841bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30096198/intertain-announces-adoption-of-shareholder-rights-plan", "country": "US", "title": "Intertain announces adoption of shareholder rights plan", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Intertain announces adoption of shareholder rights plan - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "3b557de22d3a6ee7e8449045e84336083c7841bc"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30096198/intertain-announces-adoption-of-shareholder-rights-plan", "ord_in_thread": 0, "title": "Intertain announces adoption of shareholder rights plan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " The Intertain Group Limited\nTORONTO , Sept. 23, 2015 /CNW/ - The Intertain Group Limited (\" Intertain \" or the \" Company \") ( TSX: IT ) announced today that that its board of directors has approved the adoption of a new shareholder rights plan (the \" Rights Plan \"), effective September 22, 2015 .\nThe purpose of the Rights Plan is to provide shareholders and the board of directors with adequate time to consider and evaluate any unsolicited take-over bid made for the Company's common shares, provide the board of directors with adequate time to identify, develop and negotiate value-enhancing alternatives, and encourage the fair treatment of shareholders in connection with any take-over bid made for the Company's common shares. The Rights Plan is intended to prevent any person from acquiring beneficial ownership of more than 20% of the outstanding common shares of Intertain while the board of directors' process is ongoing, or from entering into arrangements or relationships that have a similar effect. The Rights Plan is subject to ratification by the Company's shareholders at a meeting of shareholders which will be held on or before March 22, 2016 . If ratified by the shareholders, the Rights Plan will continue in force until the end of the Company's first annual meeting of shareholders following the third anniversary of the Rights Plan. The Company is not aware of any specific take-over bid for the Company's common shares that has been made or is contemplated.\nIn order to implement the Rights Plan, the board of directors has authorized the issuance of the rights to holders of its common shares at the rate of one right for each common share outstanding. The rights will automatically attach to the common shares and no further action will be required by shareholders.\nPursuant to the terms of the Rights Plan, any bid that meets certain criteria intended to protect the interests of all shareholders will be deemed to be a \"permitted bid\" and will not trigger the Rights Plan. These criteria require, among other things, that the bid be made by way of a take-over bid circular to all holders of voting shares other than the offeror under the bid, and remain open for acceptance by shareholders for at least 60 days (or such other minimum period of days as may be prescribed by securities legislation). In the event a take-over bid does not meet the permitted bid requirements of the Rights Plan, the rights issued under the plan will entitle shareholders, other than any shareholder or shareholders involved in the take-over bid, to purchase additional common shares of the Company at a significant discount to the market price.\nA copy of the Rights Plan will be filed at www.sedar.com .\nAbout The Intertain Group Limited\nIntertain is an online gaming company that provides entertainment to a global consumer base. Intertain currently offers bingo and casino to its customers using the InterCasino www.intercasino.com , Costa www.costabingo.com , Vera&John www.verajohn.com , Jackpotjoy www.jackpotjoy.com , and Botemania.es brands. For more information about Intertain, please visit www.intertain.com .\nDisclaimer in Regards to Forward-Looking Statements\nCertain statements contained in this press release constitute forward-looking information within the meaning of Canadian securities laws. Forward-looking information is provided for the purposes of presenting information about management's current expectations and plans relating to the future and readers are cautioned that such information may not be appropriate for other purposes. Forward-looking information may relate to the Company's future outlook and anticipated events, including the implementation of the Rights Plan and the intended effect and benefits of the Rights Plan described herein.\nForward-looking information necessarily involves known and unknown risks and uncertainties, which may be general or specific, and which give rise to the possibility that expectations will not prove to be accurate, that assumptions may not be correct and that objectives, strategic goals and priorities will not be achieved. A variety of factors, many of which are beyond the Company's control, could cause actual results to differ materially from current expectations of estimated or anticipated events or results, including decisions of the courts and/or securities regulators relating to rights plans or the Rights Plan which may cause the Rights Plan to operate other than as intended by the Company. The reader is cautioned to consider these and other factors, uncertainties and potential events carefully and not to put undue reliance on forward-looking information as there can be no assurance that actual results will be consistent with such forward-looking information.\nThe forward-looking information in this press release is dated, and relates only to events or information, as of the date of this press release. Except as specifically required by law, the Company undertakes no obligation to update or revise publicly any forward-looking information, whether as a result of new information, future events or otherwise, after the date on which the statements are made or to reflect the occurrence of unanticipated events.\n ", "external_links": ["http://www.costabingo.com/", "http://www.verajohn.com/", "http://www.intertain.com/", "http://www.sedar.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=C7359&Transmission_Id=201509230800CANADANWWEB______C7359&DateId=20150923", "http://www.jackpotjoy.com/", "http://www.xmlnews.org/ns/", "http://www.intercasino.com/"], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-23T23:34:58.076+03:00", "highlightTitle": ""}