{"organizations": [], "uuid": "6e4008246915e3f4331c1e619a7fbefb299b6679", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03431/microsoft-uk-water_3431983a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-08.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/britains-healthiest-company/11849367/microsoft-holistic-approach-to-health.html", "country": "US", "title": "Take a holistic approach to health, says Microsoft | Britain's Healthiest Company", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Take a holistic approach to health, says Microsoft | Britain's Healthiest Company - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:31:00.000+03:00", "replies_count": 0, "uuid": "6e4008246915e3f4331c1e619a7fbefb299b6679"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/britains-healthiest-company/11849367/microsoft-holistic-approach-to-health.html", "ord_in_thread": 0, "title": "Take a holistic approach to health, says Microsoft | Britain's Healthiest Company", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "2015 Britain’s Healthiest Company awards » Alcohol and smoking are among the risk factors that have the most significant impact on Vitality Age – and, of course, on an individual’s general health, so any company that can help its employees tackle these sorts of issues could, in theory, be encouraging the sort of lasting changes that will have positive long-term implications for individuals. The problem is that, according to the analysis from RAND Europe, these types of interventions – be they information about stop-smoking programmes or alcohol counselling – don’t tend to engage large numbers of individuals. \"For alcohol and smoking, interventions were shown to be largely ineffective,\" says Ben Baruch of RAND Europe. \"The overall percentage of company employees benefiting from them is often as small as 1 per cent or less.\" This may be because employees are reluctant to bring problems into the working environment that they feel may affect their careers, especially if services have to be accessed via the human resources department. The on-site clinic definitely helps to foster productivity However, as all medical staff must respect patient confidentiality, creating an on-site medical centre can be a way to ensure employees get help they need in a way they feel won't compromise their jobs. \"At Microsoft, we have a variety of well-being and lifestyle initiatives to help people be as healthy and motivated as they can,\" says Theresa McHenry, senior HR director at Microsoft UK. \"For example, our on-site well-being centre offers a GP, a nurse, physiotherapy, complementary therapies and a hygienist, as well as free health assessments and follow-up appointments. The on-site clinic definitely helps to foster productivity.\" The company also has a well-being week every six months, during which potential health issues are highlighted. \"We have a specialist nurse on site to complete breast checks and talk about possible risk factors relating to breast cancer,\" McHenry says. Visit telegraph.co.uk/britainshealthiestcompany to find out how winners have benefited from the 2015 Britain's Healthiest Company awards, or sign up to the 2016 awards here »", "external_links": [], "published": "2015-09-09T03:31:00.000+03:00", "crawled": "2015-09-08T23:03:40.869+03:00", "highlightTitle": ""}