{"organizations": [], "uuid": "c8429238b3c5bea117625e56bf3a94199dd8e83c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/flintstones_themepark.jpg", "site_section": "http://www.foxnews.com/travel/", "section_title": "Travel News, Videos &amp; Vacation Guides for Planning Your Trip | Fox News", "url": "http://www.foxnews.com/travel/2015/09/08/bye-bedrock-flintstones-theme-park-closes/", "country": "US", "title": "Bye, Bedrock! 'Flintstones' theme park closes", "performance_score": 1, "site": "foxnews.com", "participants_count": 1, "title_full": "Bye, Bedrock! 'Flintstones' theme park closes | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "c8429238b3c5bea117625e56bf3a94199dd8e83c"}, "author": "Associated Press", "url": "http://www.foxnews.com/travel/2015/09/08/bye-bedrock-flintstones-theme-park-closes/", "ord_in_thread": 0, "title": "Bye, Bedrock! 'Flintstones' theme park closes", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 08, 2015 Associated Press Email Print The site sits on 62 acres. That includes the theme park made to look like Bedrock, the campgrounds and a drive-in diner. (AP)\nA \"Flintstones\"-themed park in South Dakota is closing after the Labor Day weekend and being taken over by a new owner who will have to negotiate for the rights to keep using characters and scenes from the classic animated series.\nOwner Joe Speckels said the Flintstones Bedrock City Theme Park and Camping Resort, which his family members helped build almost 50 years ago, was sold for $1.5 million to hotel operator Custer Hospitality. The company will take over the 62-acre theme park, drive-in and campground from Speckels on Sept. 15.\n\"It's really been great. I've enjoyed it, but I'm tired,\" Speckels, 74, told KOTA-TV. \"I'd like to get some rest.\"\nThe theme park in Custer was built by several men including Speckels' father, Eddie Speckels, and uncle, Woody Speckels.\nSteve Olson, director of operations for Custer Hospitality, told the Rapid City Journal that the site will continue to be used as a campground. \"And it's our intention to contact Warner Bros. to see if (the theme park) is something we can do,\" he said.\nMembers of Speckels' family broke off from the original park and opened the spinoff Flintstones Bedrock City in Williams, Arizona. Linda Speckels started operating that theme park with her husband, Francis Speckels, in 1972. She told The Associated Press in June tha t she's selling the attraction for $2 million.\nWhile the future of South Dakota's Flintstones theme park remains unclear, Joe Speckels said he's glad it will remain locally owned.\n\"They're good neighbors and a good part of the community,\" Speckels said of Custer Hospitality, which operates several hotels in the small southwestern South Dakota community. \"I'm glad it didn't go out of state and I'm glad it went to someone who has an appreciation of what the Flintstones mean to the community.\"", "external_links": ["http://global.fncstatic.com/static/managed/img/U.S./flintstones_themepark.jpg", "http://www.ap.org/"], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T17:07:22.984+03:00", "highlightTitle": ""}