{"organizations": [], "uuid": "0a75f01672ae67bc1e5890d3e5f1d672ebcc31b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thecultureist.com", "main_image": "", "site_section": "http://feeds.feedburner.com/culture-ist", "section_title": "The Culture-ist - An online travel & culture magazine for the socially conscious citizen", "url": "http://www.thecultureist.com/2015/09/24/shinrinyoku-forest-bathing/", "country": "US", "title": "How Forest Bathing Can Reduce Stress and Foster Well-being", "performance_score": 0, "site": "thecultureist.com", "participants_count": 1, "title_full": "How Forest Bathing Can Reduce Stress and Foster Well-being", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T21:07:00.000+03:00", "replies_count": 0, "uuid": "0a75f01672ae67bc1e5890d3e5f1d672ebcc31b2"}, "author": "Community Changemaker", "url": "http://www.thecultureist.com/2015/09/24/shinrinyoku-forest-bathing/", "ord_in_thread": 0, "title": "How Forest Bathing Can Reduce Stress and Foster Well-being", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "How Forest Bathing Can Reduce Stress and Foster Well-being September 24, 2015 by Community Changemaker Leave a Comment By Michael Long \nI’ve long been a believer in the healing power of connecting with nature. If I had a pancake for every time I felt a little stressed and magically felt “cleared out” after taking a walk in nature, I would probably be able to feed every Canadian citizen a good breakfast. It’s not that it comes from any religious belief, per se, and until recently, I had never read up on the subject. My experiences pointed me to the same place every time. I live in the city of New Orleans and when I take the time to get out into the bayou and the swamp, the results are almost always the same: I feel less stressed, I come alive a bit more, I feel more creative, even silly, and I feel better in general. Unless I run into something poisonous, in which case I have a very brief freak-out. \nI recently stumbled upon an article about the practice of Shinrinyoku, or “forest bathing” (a term with origins in Japan, as you may have guessed), and I immediately became interested. Even before any further reading or digging, the phrase “forest bathing” alone was enough to grab my attention. The two words inspired thoughts of becoming cleansed, cleaned, or cleared out by immersion in nature. They were words just waiting for me to stumble upon them and place them to my catalogue of experiences. \nThe term Shinrinyoku came to us in the early 1980’s. Unsubstantiated at first, the term was coined by the director of the Japanese Forestry Agency based on his general hunch that one’s mood is improved after being in the forest. More than anything, it was a marketing device. But upon research conducted in following years, the gut-feeling turned out to be demonstrably true. In fact, in addition to a general improvement measured in subject’s immune system after spending two nights per month in the forest, the study indicated increased maintenance in cells that prevent cancer generation and development. A little time in the forest seems to be able to do wonders for one’s physiological health. This particular study hypothesized a kind of “aroma-therapy”, or that the trees themselves released an “essential oil” into the air that were behind the benefits people experienced. This study was specific to Japan, but it was thought that these essential oils would also be found in parts of the US. \nAfter reading a curious study that took place in Japan that indicated the is a link between immune function and immersion in nature, my interest was at its apex. Could it be that all my swamp-trips really had been contributing to my physical health in some measurable way? Were the gators really boosting my immune system? It turns out, yes. \nIn further studies that have been carried out, exercising in forests, or even just doing some forest-lounging has been linked to decreased blood-pressure and lowered stress. Even looking at pictures of trees has been shown to have a measurable impact on one’s mood! (Although the noted effects are considerably muted from the actual experience of being in nature) \nIndeed, in addition to the physical wonders that a quick “bath” can do you, other studies conducted have pointed to the link between stress, anxiety, and depression, and living in urban settings. Not that urban life necessarily creates those feelings, but as the New York Times points out: “Various studies have found that urban dwellers with little access to green spaces have a higher incidence of psychological problems than people living near parks and that city dwellers who visit natural environments have lower levels of stress hormones immediately afterward than people who have not recently been outside.” \nDrawing from a few studies , they explored the link between walking in nature on “morbid rumination”, or dwelling on negative thoughts. The study showed that participants who walked near cars on a busy road showed no reduction in their stress-levels. Those who walked in a leafy and quiet part of the Stanford campus did demonstrate “slight but meaningful” reductions in their stress. Whether it’s something in the air, or some more basic biological connection we, as animals, feel toward natural spaces, there is definitely a positive connection to be had. \nIn our recent blog post about “Blue Zones” this idea of nature as a healing entity was also credited with being a contributing factor in the abnormal longevity exhibited in a few different parts of the world, including Costa Rica, Italy, Japan, and Greece. Among the influences attributed to the high number of folks who live to be over 100 was a regular, healthful interaction with the natural world. Usually, nature and being outdoors were built in to their daily routines, so they spent a significant amount of time in nature. \nPerhaps best of all, assuming one has the time or physical means to get into a natural space of some kind, access to nature is typically a low-cost and under-utilized form of combating stress and maintaining wellness. Group nature walks have risen in popularity as a way to explore one’s surroundings, boost positive feelings, and bond with friends, family, or a local community. \nIf we take this practice seriously as a species, we get the added bonus of taking care of the environment. If we begin to identify forests and undisturbed, natural spaces as useful or even necessary for maintaining our health, then protections will be afforded to those spaces. This has been the case in Japan where there have been over 40 designated sites for “forest therapy” across the country. \nSo next time you’re feeling stressed, anxious, or feel a cold coming on, get yourself out into a field, in between some trees, or at least “get some fresh air”. It might save your life! ABOUT THE AUTHOR \nMike Long hails from shady Washington State and now called New Orleans home. He enjoys growing food and hiking!” Mike is the Operations Manager at Gondwana Ecotours .", "external_links": [], "published": "2015-09-24T21:07:00.000+03:00", "crawled": "2015-09-25T20:22:04.400+03:00", "highlightTitle": ""}