{"organizations": [], "uuid": "1d9f228af16e6de27345db7497de1225b84fdff9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63347/apple-hospitality-acquires-courtyard-marriott-san-diego", "country": "US", "title": "Apple Hospitality acquires Courtyard by Marriott in San Diego", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Apple Hospitality acquires Courtyard by Marriott in San Diego", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T22:28:00.000+03:00", "replies_count": 0, "uuid": "1d9f228af16e6de27345db7497de1225b84fdff9"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63347/apple-hospitality-acquires-courtyard-marriott-san-diego", "ord_in_thread": 0, "title": "Apple Hospitality acquires Courtyard by Marriott in San Diego", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Apple Hospitality acquires Courtyard by Marriott in San Diego   \nSep 03, 2015 eTN   \nRICHMOND, VA - Apple Hospitality REIT, Inc today announced that it has closed on the previously announced acquisition of a 245-room Courtyard by Marriott in San Diego, CA for a purchase price of $56 million, or approximately $229,000 per key. \n“We are pleased to add the recently renovated Courtyard San Diego Central to our portfolio of upscale hotels and increase our presence in the dynamic San Diego market,” said Nelson Knight, Executive Vice President and Chief Investment Officer for Apple Hospitality REIT. “San Diego’s economy is diversified across numerous leisure and corporate demand generators and we believe this hotel is well positioned for future growth.” \nIn addition to popular leisure activities, the San Diego market provides a wealth of diverse demand generators with an economy marked by a strong military concentration, technology industries and innovative life science research and healthcare organizations. The Courtyard® San Diego Central, located at 8651 Spectrum Center Boulevard in San Diego, is convenient to Qualcomm Stadium, San Diego State University, the University of California San Diego, the San Diego Zoo, Marine Corps Air Station Miramar, SeaWorld San Diego, the Gaslamp Quarter, downtown San Diego and San Diego’s beaches. Hotel industry fundamentals have continued to accelerate across the San Diego market and according to data provided by Smith Travel Research (STR), RevPAR improved by 10.7 percent for the first six months of 2015 as compared to the same period of 2014. \nFollowing this acquisition, the Apple Hospitality portfolio includes 177 hotels, with approximately 22,750 guestrooms, geographically diversified across 32 states.", "external_links": [], "published": "2015-09-03T22:28:00.000+03:00", "crawled": "2015-09-03T22:55:16.278+03:00", "highlightTitle": ""}