{"organizations": [], "uuid": "030fed8b155e1414c036fb9ba4b71793d4a5359f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gochina.about.com", "main_image": "http://f.tqn.com/y/gochina/1/S/N/W/-/-/MO_Pudong_PresSuite.jpg", "site_section": "http://z.about.com/6/o/m/gochina_t2.xml", "section_title": "About.com China Travel: What's Hot Now", "url": "http://gochina.about.com/od/wheretostayinshanghai/tp/TopLuxSH_Hotel.htm", "country": "US", "title": "Top 11 Luxury Hotels in Shanghai", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Top 11 Luxury Hotels in Shanghai", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T14:04:00.000+03:00", "replies_count": 0, "uuid": "030fed8b155e1414c036fb9ba4b71793d4a5359f"}, "author": "", "url": "http://gochina.about.com/od/wheretostayinshanghai/tp/TopLuxSH_Hotel.htm", "ord_in_thread": 0, "title": "Top 11 Luxury Hotels in Shanghai", "locations": ["Shanghai"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Updated Articles and Resources \nShanghai is fast becoming a city of opulence. From Cartier on the Bund to Gucci on Nanjing Road, five-star treatment is not difficult to find. \"The Paris of the East\" has no shortage of luxury 5-star hotels, and more are being built as this is written. Here are the best of the bunch (in alphabetical order). Nice views from the Presidential Suite, Mandarin Oriental Pudong, Shanghai. Photo courtesy of Mandarin Oriental Hotals. All rights reserved. 1. Mandarin Oriental Pudong, Shanghai \nThe Mandarin Oriental is arguably the best brand name in Shanghai for luxury hotels . Noted worldwide for their excellent service, the MO Shanghai is no exception. Located in Pudong on the riverside in the heart of the financial district, Lujiazui, business and leisure guest will find this an excellent location to enjoy their stay in Shanghai. \nAddress: 111 Pudong Road (S), Pudong, Shanghai 200120 China Tel: +86 (21) 2082 9888 Website: Mandarin Oriental Shanghai More » 2. JW Marriott \nThe JW Marriott at Tomorrow Square has the most futuristic name and is housed in the most futuristic building in Puxi (Shanghai east of the river). Towering above People's Square, the JW Marriott commands views of the whole city. Their Mandara Spa is an eastern retreat in itself and a necessary indulgence after a long flight. Boasting one of the few outdoor pools in Shanghai, it also has a very good fitness center. With all the usual five-star room amenities, the JW Marriott is a good choice for visitors who want to be at the heart of downtown Shanghai. \nAddress: 399 Nanjing West Road, Shanghai, 200003 China Tel: +86 21 5359 4969 Fax: +86 21 6375 5565 Website: JW Marriott 3. Pudong Shangri-La \nAnother fantastic hotel for views alone is the Shangri-La. Request a room on a high floor in their new tower and you'll have views of Puxi and the Bund, the river and the Pudong skyline. The hotel is located right at the river front, so you can take a walk along the Pudong promenade, a nice way to unwind in the early jet-lagged hours or the late evening. There are plenty of cafes along the river to have a drink or a coffee although you need not venture out of the hotel for amazing food. The Yi Cafe has a signature buffet (don't miss the hand-pulled noodles) and the Japanese at Nadaman is fantastic. \nAddress: 33 Fu Cheng Road, Pudong, Shanghai 200120 China Tel: +86 21 6882 8888 Fax: +86 21 6882 6688 Website: Pudong Shangri-La 4. The Four Seasons \nThe Four Seasons is the talk of the town these days and is the place many 5-star dwellers choose when they decide to stay in Puxi (east side of the river). Rooms have views of the skyline downtown and you can relax to your own music as rooms have connections for your portable music player. It is centrally located to both Nanjing Road locations as well as the Bund and right outside on Weihai Road are a wealth of cafes, boutiques and restaurants. \nAddress: 500 Weihai Road, Shanghai 200041, China Tel: +86 21 6256-8888 Website: Shanghai Four Seasons 5. The Grand Hyatt Stay at the Grand Hyatt , if for no other reason, the view. Currently housed in the tallest building in Shanghai, the Jin Mao Tower (though that will change soon as the new highest building in Shanghai is under construction next door), the Grand Hyatt's rooms command views over the new and old of Shanghai. Venture up to Cloud 9 , the highest bar in Shanghai for a nightcap overlooking the Bund .\nAddress: Jin Mao Tower, 88 Century Boulevard, Pudong, Shanghai 200120 China Tel: +86 21 5049 1234 Fax: +86 21 5049 1111", "external_links": [], "published": "2015-09-26T14:04:00.000+03:00", "crawled": "2015-09-27T09:44:09.541+03:00", "highlightTitle": ""}