{"organizations": [], "uuid": "dba5dacde915c0cf6b0be275c73811f5b63269c9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64024/monttra-new-luxury-brand-debuts-pattaya", "country": "US", "title": "The Monttra - a new luxury brand debuts in Pattaya", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "The Monttra - a new luxury brand debuts in Pattaya", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T05:47:00.000+03:00", "replies_count": 0, "uuid": "dba5dacde915c0cf6b0be275c73811f5b63269c9"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64024/monttra-new-luxury-brand-debuts-pattaya", "ord_in_thread": 0, "title": "The Monttra - a new luxury brand debuts in Pattaya", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Monttra - a new luxury brand debuts in Pattaya Original, timely global, travel, tourism, business news and research: \nSep 22, 2015 eTN Exclusive: Unique and original, timely, global breaking news: \nBANGKOK, Thailand - Miners Hospitality Pte., Ltd., a diversified one-stop hotel development company, is launching “The Monttra – Pattaya,” the last magical sanctuary in Pattaya, on December 1, 2015. \nLocated right next to the Royal Varuna Yacht Club on Phra Tumnak Hill, sitting atop a seaside cliff under a lush tree canopy, one may imagine to be on an exclusive stunning location with its secluded white sand beach and clear water invites. Here, guests may enjoy the utmost privacy in the green gardens, offering an unspoiled last sanctuary to Pattaya’s busy night life. \nMendes Cavin reveals that in addition to the perfect location, The Monttra-Pattaya introduces discerning travelers to a new level of redefined hospitality, offering unique services to the market such as the soap concierge and the skin supervisor. \nWith the introduction of the soap concierge and the skin supervisor, Miners Hospitality has set a new level of luxury hospitality. \nThe soap concierge allows guests to enjoy the luxury of choosing their own soap scent whenever they wish, self-chosen from a platter of soaps presented to at the guest’s door step. Start the day with an awakening scent and find rest with a relaxing aroma before falling asleep. \nThe skin supervisor makes sure guests’ skin is well treated. While at the pool or in the garden, call the skin supervisor and choose from a variety of oils and sun screens, and if desired, have them applied directly onto the body with a short massage. \nMany more services are provided on a complimentary basis on a rotating weekly program such as Conscious Awakening, Kitchen Fun, Spine Fitness, and many more.", "external_links": [], "published": "2015-09-22T05:47:00.000+03:00", "crawled": "2015-09-22T07:24:04.186+03:00", "highlightTitle": ""}