{"organizations": [], "uuid": "31cb93686197e00627adb7dac9e29aee4b7e2ad1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/5-santa-barbara-beaches-fall-getaway", "country": "US", "title": "5 Santa Barbara beaches for a fall getaway", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "5 Santa Barbara beaches for a fall getaway", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T17:47:00.000+03:00", "replies_count": 0, "uuid": "31cb93686197e00627adb7dac9e29aee4b7e2ad1"}, "author": "senh", "url": "http://www.wopular.com/5-santa-barbara-beaches-fall-getaway", "ord_in_thread": 0, "title": "5 Santa Barbara beaches for a fall getaway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Santa Barbara beaches for a fall getaway El Capitan State Beach lies about 25 minutes north (by Highway 1... State park campgrounds at the reopened beaches were fully booked through summer, so fall is a good time to get reacquainted with El Capitan. Below a bluff and reached by stairs and ... 09/18/2015 - 9:00 pm | View Link Checking for Oil on Ventura Beaches \"We don't know at this time if the oil is from naturally occurring seeps or if it is related to the spill near Refugio Beach in Santa Barbara County,\" said ... Beach to Faria Beach. The beaches along that stretch fall under several jurisdictions. 05/29/2015 - 11:50 am | View Link Beach closures take toll on Santa Barbara County businesses Time is of the essence for Cohen’s business. With more than 70 percent of Santa Barbara Adventure Co.’s customers being students on school field trips, having the state beaches open before the fall is vital. Other businesses, such as 101 RV Rentals ... 05/28/2015 - 9:00 pm | View Link Oil-fouled beaches a blow to tourist-dependent Santa Barbara Cleanup crews wearing white coveralls and masks shoveled oil-soaked mud to plastic bags Thursday in Santa Barbara, Calif., where a ruptured pipeline fouled beaches just days before ... the spill appears to fall far short of the most serious in the United ... 05/21/2015 - 7:41 am | View Link The Goodland Hotel — Goleta, California’s Golden Escape You Need to Know About For those ready to partake in a “Golden State of Mind” on the American Riviera, there’s a haven for unpacking and spending some time – The Goodland Hotel Santa Barbara ... do when it comes to beloved beaches, Makarechian decided to share it ...", "external_links": [], "published": "2015-09-20T17:47:00.000+03:00", "crawled": "2015-09-20T19:38:27.703+03:00", "highlightTitle": ""}