{"organizations": ["Travel Corporation Canada", "Eastern Mediterranean & Morocco"], "uuid": "7ef7ab3f52f308931032ccfedd42ec7db3cf878a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "globenewswire.com", "main_image": "", "site_section": "http://globenewswire.com//Rss/subjectcode/42/Travel", "section_title": "GlobeNewswire: Travel", "url": "http://globenewswire.com/news-release/2015/09/29/771617/10150892/en/Insight-Vacations-Proudly-Launches-2016-17-Europe-Collection-with-New-Premium-All-Inclusive-Journeys.html?f=22&fvtc=1&fvtv=Travel", "country": "US", "title": "Insight Vacations Proudly Launches 2016-17 Europe Collection with New Premium All-Inclusive Journeys", "performance_score": 0, "site": "globenewswire.com", "participants_count": 0, "title_full": "Insight Vacations Proudly Launches 2016-17 Europe Collection with New Premium All-Inclusive Journeys", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T04:22:00.000+03:00", "replies_count": 0, "uuid": "7ef7ab3f52f308931032ccfedd42ec7db3cf878a"}, "author": "", "url": "http://globenewswire.com/news-release/2015/09/29/771617/10150892/en/Insight-Vacations-Proudly-Launches-2016-17-Europe-Collection-with-New-Premium-All-Inclusive-Journeys.html?f=22&fvtc=1&fvtv=Travel", "ord_in_thread": 0, "title": "Insight Vacations Proudly Launches 2016-17 Europe Collection with New Premium All-Inclusive Journeys", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Insight Vacations Proudly Launches 2016-17 Europe Collection with New Premium All-Inclusive Journeys Presenting over 100 handcrafted trips with 13 new exciting itineraries including Eastern Mediterranean & Morocco September 28, 2015 21:22 ET | Source: The Travel Corporation Canada \nTORONTO, Sept. 28,   Insight Vacations ( www.insightvacations.com ), the leader in premium and luxury escorted journeys launches its 2016-17 Europe and Britain collection with nine new premium all-inclusive trips and four new outstanding itineraries. With over 100 hand picked itineraries and 13 new escorted journeys, its collection of Signature Experiences, Hotels and Dining have been extended with a host of itinerary enhancements. Many of the Signature Hotels have been upgraded and in the best locations. They have also introduced their new \"Relaxed Starts\" which are featured on various itineraries with leisurely starts at 9:00 am or later. Their 2016 Signature Highlights include VIP and priority access to amazing excursions including an open-top cable car to the summit of Mt. Stanserhorn and fast track entry to Trinity College's Book of Kells. In celebration of the new European collection, clients can book and pay early and save up to $2,690 per couple* before January 14, 2016. \n\"I've just returned from our global conference in Venice in Italy where I was immensely proud to unveil our stunning 2016 collection of truly amazing escorted journeys,\" says John Boulding, Global CEO of Insight Vacations. \"As the European Specialists, Insight Vacations is a trailblazer in style, quality and value and has been the leader in experiential travel for almost 40 years.\" \nFor clients looking for complete convenience, these nine new all-inclusive premium journeys include daily breakfast buffet, evening dining, excursions, all exclusive Signature Experiences and Premium Highlights in one single price: \nEuropean Spotlight - 11 days - Signature Experiences includes the high-speed Eurostar train from London to Brussels and a Dine-Around evening from a selection of authentic local restaurants in Lucerne. \nSplendors of Andalucia & Morocco - 13 days - Signature Dining features a Freestyle evening in Seville and a Dine-Around experience in Granada sampling the best of local Spanish cuisine. \nItalian Elegance - 12 days - Signature Highlights includes cruising by boat to the elegant village of Portofino and a romantic gondola serenade to the tune of accompanying musicians while gliding across the canals in Venice. \nThe Bohemian - 9 days - Signature Hotel property in Budapest at the five star Sofitel Budapest with spectacular views of the famous Chain Bridge. Guests join a Local Expert in Vienna for a private tour of the Schonbrunn Palace and its formal gardens followed by an evening performance of Viennese classical music. \nGlories of Greece - 7 days - Premium highlights include joining a local chef in Olympia for an interactive cooking demonstration and a lively Signature Dining Celebration Dinner in Athens. \nGrecian Legends, Grecian Dreams & Grecian Fables -11, 12 or 15 days of Premium Cruising with relaxing voyages of discovery around Turkey and the Greek islands and stay at an Athens Signature Hotel, the Divani Caravel , a member of The Leading Hotels of the World. \nTreasures of Greece & The Islands - 14 days - Explore the historic wonder of mainland Greece before travelling to the stunning islands of Mykonos and Santorini. Clients will enjoy a Freestyle evening in Delphi with a superb choice of dining options and joining a Local Expert to explore the legendary temple of Apollo. \nThe other 4 new premium escorted journeys include: \nClassic Cities of Northern Europe - On this new 11-day Easy Pace journey guests will discover the iconic cities of Paris, Amsterdam, Berlin and the charm of Bremen. They will begin their journey with a leisurely three-night stay in the City of Lights with priority access to the viewing platforms of the Eiffel Tower. While in Amsterdam, they will enjoy Signature Experiences including a special canal cruiser and join a Dutch Art Historian for an exclusive tour of the renowned Rijksmuseum. Clients will explore the fairy tale city of Bremen including a Dining Around Evening to enjoy authentic regional cuisine. They will journey to Berlin and relax at their Signature Hotel, the Swissotel - the city's best luxury property in the midst of world-class shopping . Guests will have a deeply moving visit to the Berlin Wall Memorial and enjoy a farewell Celebration Dinner with authentic German cuisine and wine at a family run restaurant with lively music. \nScenic France and Northern Spain This new 17-day Regional journey enables travellers to explore some of the most magnificent places of France and Spain to immerse themselves in the local cultures and traditions including Lyon, Lourdes, San Sebastián and the Bordeaux region. Guests will begin their trip with a Welcome Reception in Paris and sample French cuisine and wine. They will then head to the picturesque Loire Valley and later join a Local Expert to explore the cobbled streets of La Rochelle's Old Quarter. \nGuests will travel to the Dordogne Valley and enjoy a 3-night stay at the luxurious Signature Hotel, Chateau Des Vigiers set amidst the famous vineyards. In this scenic town of Monestier, they will enjoy Signature Dining with a Highlight Dinner at a rustic family-run countryside restaurant . \nEasy Pace Spain - This new leisurely 10-day Easy Pace itinerary showcases the best of vibrant Barcelona, the culinary capital and Michelin starred city of San Sebastián and historic Madrid and surrounding destinations with a 3 night stay in each city. Signature Highlights in Toledo include a visit to a local Damascene workshop where expert craftsmen inlay steel with silver gold and copper thread and with a Local Expert, guests visit the Church of Santo Tome and view an El Greco Masterpiece. Other Signature Experiences include a visit to Bilbao's magnificent Guggenheim Museum and a Highlight Dinner in San Sebastián famous for its pinxtos cuisine. \nRomantic Northern Italy - This new 10-day Country Roads escorted journey enables clients to do discover the unique charming places and experiences that are off the beaten path. This itinerary highlights the fashion capital of Milan, Shakespeare's Verona, the stunning Dolomite region, iconic Venice and the scenic Italian Lake District. Clients will stay in Italy's most exclusive ski resort area, Cortina d'Ampezzo and stay at a Signature Hotel, Hotel Ancora which is built in the characteristic Ampezzano style with wooden balconies and intricately carved interiors. They will travel to Conegliano and see how Italy's most famous sparkling wine, Proseco is produced. While in Bavano, guests will enjoy a Signature Dining experience with a Dine-Around evening and they can choose from a selection of handpicked restaurants. \nFor more information, please contact your local Sales Manager, visit www.insightvacations.com , or contact an Insight Specialist at the National Sales Centre at 1-800-387-8490. \nAbout TreadRight \nCreated as a joint initiative between The Travel Corporation's family of brands, the TreadRight Foundation is a not-for-profit working to ensure the environment and communities we visit remain vibrant for generations to come. To date, TreadRight has supported more than 35 sustainable tourism projects worldwide. The Foundation's guiding principle is to encourage sustainable tourism development through conservation, leadership and support for communities. Foundation priorities are set by the Steering Committee, which includes sustainability leaders like Céline Cousteau and Costas Christ. \nTreadRight's past project partners include WWF, Conservation International and The National Trust in the UK. Current initiatives include sponsoring the National Geographic Society's inaugural \"World Legacy Awards,\" and inspiring wildlife advocates like Terri Irwin. \nTo learn more about our past and current work at TreadRight, please visit us at treadright.org . \nAbout Insight Vacations \nFor more than 35 years, Insight Vacations ( www.insightvacations.com ) has been designing the world's finest escorted travel itineraries. Insight offers 113 journeys to more countries across Europe than any other operator and provides the same legendary service across North America, South America, India, Bhutan, Nepal, Morocco, Egypt and Israel. Media Contacts: Winston Ma PR & Digital Media Specialist The Travel Corporation | 33 Kern Rd., Toronto, ON, M3B 1S9 (416) 322-8468 ext. 7294 | Marie Anne MacRae Global VP, Strategic Partnerships The Travel Corporation | 33 Kern Rd., Toronto, ON, M3B 1S9 (416) 915-7016 | Related Articles", "external_links": [], "published": "2015-09-29T04:22:00.000+03:00", "crawled": "2015-09-29T05:58:15.616+03:00", "highlightTitle": ""}