{"organizations": [], "uuid": "ca4bd2a2cd2e24c2bcf1ac8e383eca4d97210842", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/754f6ef0e5128fc671bc930d5b1f0c1250b3cb1c/c=0-174-2121-1372&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/23/USATODAY/USATODAY/635786161791100395-ThinkstockPhotos-470611726.jpg", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/travel/destinations/2015/09/24/new-england-fall-foliage-towns/72678900/", "country": "US", "title": "Eight secret New England towns perfect for a fall getaway", "performance_score": 2, "site": "usatoday.com", "participants_count": 1, "title_full": "Eight secret New England towns perfect for a fall getaway", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T15:02:00.000+03:00", "replies_count": 1, "uuid": "cc98311c1a36c38c981e2123527c4c2078e96a2a"}, "author": "", "url": "http://www.usatoday.com/story/travel/destinations/2015/09/24/new-england-fall-foliage-towns/72678900/#post-0", "ord_in_thread": 0, "title": "Eight secret New England towns perfect for a fall getaway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jackson, N.H.: New Hampshire's White Mountains buzz with tourists each fall, and the town of North Conway plays host to them all. Stay a bit outside the madness in the tiny town of Jackson, where covered bridges and pastoral scenes come standard. (Photo: Getty Images/iStockphoto)\n595 CONNECT 48 TWEET LINKEDIN 1 COMMENT EMAIL MORE Winding roadways ... packed with cars. Cider donuts ... you've been waiting three hours to eat. Trees afire with red, orange and yellow blooms ... that you can't really see over someone else's selfie stick. If you love New England in the fall, but hate the crowds, then head to these hidden gems where you can actually enjoy the foliage and explore the outdoors unfettered by the tourist hordes.\nRockport, Mass.\nThe small but tourist-friendly town of Rockport on the tip of Cape Ann has welcomed travelers since the Puritans settled the area in the 1600s. Rockport is marked by its many fishing boats, windswept coastline and some 40 artists' studios, where painters churn out evocative New England seascapes. Best of all, Rockport is just an hour's drive north of Boston, providing a nice pairing for your weekend city escape.\nWhat to do: Rockport HarvestFest brings fall to the pretty coastal community with live music and classic New England eats (cider donuts, seafood chowders). Throughout the year, indulge in fresh lobster dishes at no-frills Roy Moore Lobster Co. (it's one of the best in New England).\nUSA TODAY\nPhoto tour: The most beautiful places in New England\nJackson, N.H.\nNew Hampshire's White Mountains buzz with tourists each fall, and the town of North Conway plays host to them all. North Conway is known for its scenic railway, outlet shops and kitschy general stores, which get comfortably crowded with leaf-seeking city slickers. Stay a bit outside the madness in the tiny town of Jackson (population: 800), where covered bridges and pastoral scenes come standard.\nWhat to do: Fishing, bicycling, hiking and (if temperatures dip and early snow appears) cross-country skiing are all available right in Jackson, while less-outdoorsy types can enjoy some of the Granite State's best antiquing.\nCastine, Maine\nPenobscot Bay, in mid-coastal Maine, has always been a favorite for visitors, and among its many towns, Castine reigns supreme for its cinematic seaside charms. Historic farms, forts and even a blacksmith shop offer family-friendly exploration, and a number of Instagrammable lighthouses spot the shores. But it's the seaside town of Castine itself and its slate of adorable inns that win hearts (and return trips).\nWhat to do: See the Castine and Dice Head lighthouses (the latter of which is available to tour). Kayak or sail the bay on warmer days. Get brilliant autumn views of Maine on the Penobscot Narrows Observatory Bridge.\nUSATODAY\nNew England's best fall foliage cruise deals\nPeterborough, N.H.\nCool restaurants and cozy inns sit side by side in the Hillsborough County village of Peterborough, which purportedly inspired Thornton Wilder's Our Town . Home to outfitter Eastern Mountain Sports, it's no surprise that Peterborough is an outdoorsy hot spot where kayak-topped cars and tourists loaded down with hiking gear ply the streets. But Peterborough offers much more, from live theaters and folk music to flower farms and bookshops.\nWhat to do: Hit the outdoors. Hike and peep leaves at Miller State Park, where on clear days you can see through to Boston's skyline. Pack a picnic lunch.\nEast Haddam, Conn.\nNearly 60 square miles of rolling countryside, historical farmsteads, and a waterfall or two — this is East Haddam, a place so idyllic that Gilmore Girls used its exteriors as the fictional town of Stars Hollow. Natural beauty abounds in this Connecticut River Valley outpost, but so do the arts, with the 19th-century Goodspeed Opera House bringing musicals to the masses until December. It's hard to believe you're but a two-hour drive from New York City.\nWhat to do: Catch beautiful views at Gillette Castle, a European-inspired manse built by the quirky actor William Gillette in 1919, before catching a show at Godspeed.\nUSATODAY\nAutumn colors: Beautiful fall foliage around the USA\nBecket, Mass.\nIf you want some arts and culture alongside your fall foliage, Massachusetts' Berkshire Mountains are your spot in the (autumn) sun. And if you want to be blissfully free from crowds, consider Becket, an artsy village of less than 2,000 full-time residents. Home to the summertime Jacob's Pillow dance festival as well as a number of arts centers and studios that are open year-round, this rural town offers a perfectly painted stay.\nWhat to do: Hop on Canterbury Farms' many trails for hiking and biking (and in colder months, cross-country skiing). Get your art on at the many art studios that dot the area and pick up pieces of your own at a gallery in town.\nLittle Compton, R.I.\nForget Newport and its glitzy mansions. Little Compton is the better bet for a relaxed autumnal escape. A 17th-century town and rural farming community near the Massachusetts border situated to one side of the Sakonnet River, Little Compton is scattered with historical sites, a winery and pretty Goosewing Beach. It's packed in summer but uncrowded and cool each fall, perfect for a brisk walk or two.\nWhat to do: Other than relax and curl up with a good mystery? Sip at Sakonnet Vineyards, the oldest winery in New England, or visit the historical Wilbor House for a taste of life in 1690.\nGrafton, Vt.\nGrafton is a postage stamp-sized town bursting with Vermont charm, from its whitewashed church, to its gazebo-dotted village green, to the 600 self-reliant residents who have lovingly restored the historical town. Farms, cafes, sugarhouses and artisanal bakeries supply tourists with fall eats and sweets, while the outdoors glows with fall color throughout the season.\nWhat to do: Pop into the Grafton Village Cheese Company to sample dozens of cheeses; lucky visitors can take a tour of the cheesemaking process. Burn off the calories on Grafton Ponds' miles of groomed hiking trails.\nREAD THE ORIGINAL ARTICLE: Eight secret New England towns perfect for fall\n595 CONNECT 48 TWEET LINKEDIN 1 //usat.ly/1Fhm7dk TOP VIDEOS", "external_links": ["http://www.gannett-cdn.com/media/2015/09/23/USATODAY/USATODAY/635786161791100395-ThinkstockPhotos-470611726.jpg", "http://usat.ly/1Fhm7dk", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/1d3775de9229d2ddb15a0508374ac63d4213dd1d/r=500x375&r=400x400&c=400x400/local/-/media/2015/09/17/USATODAY/ExperienceCruise/635780965967073298-XXX-FALL-FOLIAGE-66856546.JPG", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/d56a4f7c254b83827e23692971e805e1c7a76eb8/r=500x332&r=400x400&c=400x400/local/-/media/2015/09/11/USATODAY/ExperienceAmerica/635775887088804028-Fall2.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1Fhm7dk&text=Eight%20secret%20New%20England%20towns%20perfect%20for%20a%20fall%20getaway&via=usatoday", "http://www.gannett-cdn.com/-mm-/4044b1e7645488621f157de466cf1a990870caa2/r=500x333/local/-/media/2015/09/23/USATODAY/USATODAY/635786161791100395-ThinkstockPhotos-470611726.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1Fhm7dk&mini=true", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/b6c5def947311db9140fb967b13fc7187b73b7f4/c=0-0-2123-1197&r=x633&c=1200x630/local/-/media/USATODAY/USATODAY/2014/06/06/1402066813000-Bass-Harbor-Head-Catuncia-iStock.jpg", "http://www.smartertravel.com/photo-galleries/editorial/8-secret-new-england-towns-perfect-for-fall.html?id=1102&all=1", "http://www.gannett-cdn.com/-mm-/89e6dca77c727f338cedc0411b2fef169f6f1172/c=34-0-1917-1416&r=x404&c=534x401/local/-/media/2015/09/23/USATODAY/USATODAY/635786161791100395-ThinkstockPhotos-470611726.jpg"], "published": "2015-09-24T15:02:00.000+03:00", "crawled": "2015-09-25T07:06:25.672+03:00", "highlightTitle": ""}