{"organizations": [], "uuid": "31b3ecec4fbd4ad8bd4e3944c0526d4d21bed8d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/agency-news/28669-conference-care-team-prepare-for-epic-bike-ride", "country": "US", "title": "Conference Care team prepare for epic bike ride", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Conference Care team prepare for epic bike ride", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T11:45:00.000+03:00", "replies_count": 0, "uuid": "31b3ecec4fbd4ad8bd4e3944c0526d4d21bed8d2"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/agency-news/28669-conference-care-team-prepare-for-epic-bike-ride", "ord_in_thread": 0, "title": "Conference Care team prepare for epic bike ride", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Conference Care team prepare for epic bike ride Conference Care team prepare for epic bike ride Details Category: Agency & Association Created on Tuesday, 08 September 2015 09:45 With the start date of 14th September looming, the four intrepid riders at Conference Care are putting the finishing touches to their training regime. Starting on the 14th September from the agency’s Dunfermline office and making their way over the borders and across the country to the Headquarters in Coventry, the route will see the team take on many tough climbs and cycling an average of 80 miles each day. \nFrom 14th to 18th September Conference Care Directors – Chris Peacock and Andrew Deakin along with Pauline Beattie - Head of Sales Scotland and Sean Henderson – New Business Scotland will be braving the elements to complete an epic 400 mile cycle challenge in aid of Help4Harry and Muscular Dystrophy UK. Pauline has a very close family friend whose son was diagnosed with Muscular Dystrophy at the tender age of 5 years old in 2013. The “Conference Care office to office - Bike Ride Challenge” was cooked up over dinner at a senior team meeting, back in 2014. Donations have now reached over £7,000, which still leaves a big reach to meet the £10,000 team target; which will go towards more specialist research in the hope that a cure will be found. “None of us are exactly trained athletes, so the training regime has been pretty tough – just fitting the time in alone is hard enough! What really drives us on is to see the donations coming in every day, and my sincere thanks goes to those who have already supported us.” said Pauline Beattie Muscular Dystrophy is a rare and painful muscle wasting condition, which there is currently no cure with most sufferers using a wheelchair by the age of 12. For more information and to show your support visit: www.justgiving.com/ConferenceCareHelp4Harry Alternatively you can text CCHH88 £10 to 70070 Related articles", "external_links": [], "published": "2015-09-08T11:45:00.000+03:00", "crawled": "2015-09-08T12:48:43.972+03:00", "highlightTitle": ""}