{"organizations": [], "uuid": "dbc33fc51cb98d904a38c0c651239cfc70b23640", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/U.S./0/0/labordaytravel_istock.jpg", "site_section": "http://www.foxnews.com/travel/", "section_title": "Travel News, Videos &amp; Vacation Guides for Planning Your Trip | Fox News", "url": "http://www.foxnews.com/travel/2015/09/04/5-last-second-labor-day-getaways/", "country": "US", "title": "5 last-second Labor Day getaways", "performance_score": 1, "site": "foxnews.com", "participants_count": 2, "title_full": "5 last-second Labor Day getaways | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 1, "uuid": "c2c038878e6d6a26b7a7696b629d5170c5079529"}, "author": "Donald Wood", "url": "http://www.foxnews.com/travel/2015/09/04/5-last-second-labor-day-getaways/#post-0", "ord_in_thread": 0, "title": "5 last-second Labor Day getaways", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Donald Wood\nPublished September 04, 2015 Facebook 0 Twitter 0 livefyre Email Print\nLabor Day is the unofficial close to the summer, but travelers have been blessed with a late holiday in 2015, meaning an extra weekend of potential fun in the sun.\nWith airlines, hotels and popular destinations offering cheap deals for last-second travelers, it's time to get away one final time before the leaves begin changing this autumn. Here are the last-second deals for an impromptu Labor Day vacation.\nAtlantic City, New Jersey\nTravelers think of gambling immediately when talking about Atlantic City, but the beaches, boardwalk and other activities are enough to entice families to make the journey to the area.\nOne of the most underrated activities to squeeze in during the Labor Day holiday weekend would be a short cruise into the Atlantic Ocean to spot dolphins. Led by Atlantic City Cruises, passengers will pay $35 for the chance to sail the open ocean and see majestic animals.\nFor those travelers looking to save some money, the close proximity to the weekend will force hotels to keep their prices cheap to fill their rooms. Thanks to GroupOn.com, families and groups of friend can get affordable deals for Labor Day weekend at the very last minute.\nLake Winnipesaukee, New Hampshire\nThere are many places to visit on a whim for the three-day weekend, but few have the entertainment value associated with Lake Winnipesaukee, New Hampshire. While Atlantic City is a typical shore destination, Lake Winnipesaukee has both beaches and wooded areas.\nNot only can visitors travel to Lake Winnipesaukee to enjoy the 72 square miles of water surface—activities include swimming, canoeing, kayaking, boating and more—but the area around the lake is also great for hiking, enjoying the scenic views and just relaxing.\nTravelers should stop at Fay’s Boat Yard to rent all of the necessary items for a great day at the lake. From renting a simple canoe to chartering a full-size pontoon boat for the day, the boatyard has great weekend deals to make the trip worth it for a family on a budget.\nOrlando, Florida\nHave you wanted to visit Orlando, Florida, and all of the amusement parks? Collecting your family and traveling to Walt Disney World or Universal Orlando during the Labor Day weekend would make for an unforgettable final summer vacation.\nWith some of the tallest, longest and fastest roller coasters in the world, adults and the older children in your group will have their day made by the unparalleled thrill rides at almost all of the parks in Orlando.\nFor younger children, there are plenty of activities, including several water parks still enjoying the sun’s heat. One of the best water parks in the area is Wet ‘n Wild Orlando, and with affordable prices, it could be the key to maximizing your family’s final summer vacation.\nNew York City\nWhether you plan on just doing a day trip or staying for the entire Labor Day weekend, a visit to New York City would make for an unforgettable holiday. The City that Never Sleeps will not disappoint.\nFor the families visiting the city, there are many sites you must enjoy. From Times Square to Central Park to The Metropolitan Museum of Art to The National 9/11 Memorial & Museum, there is enough history and beauty in the city to appeal to tourists of all ages.\nOn the other hand, people making their way to NYC to party and enjoy the nightlife have plenty of options as well. Starting with a show on Broadway, adults can make their way down the main roads of the city and enjoy a lively bar scene and several marquee comedy clubs.\nAdd in the fact that Expedia.com is offering vacation packages that include discounts on airfare, hotel costs and cheaper tickets to local attractions, and money is no longer an excuse to miss out on an incredible vacation finale.\nLas Vegas, Nevada\nLas Vegas is still a place where people can unwind in fun and interesting ways, but it is not the hotbed of sin it has been portrayed as in the past. TravelPulse’s own Rich Thomaselli recently visited the gambling paradise, and showcased all of the positive changes being made.\nWhile gambling is still a draw, the city has completely reinvented itself to continue drawing people to the desert paradise. From long-term residencies by the top singers and performers in the world to Broadway quality shows, almost every major casino in Las Vegas has a marquee performer taking the stage each night.\nThe key to visiting Las Vegas during the Labor Day weekend will be finding an affordable hotel. Thanks to LastMinuteTravel.com, tourists will be able to book affordable hotels—up to 40 percent off normal prices—for less than they would expect to pay.\nThe final weekend of the summer could be the wildest to date if you can make it to Las Vegas.", "external_links": ["http://global.fncstatic.com/static/managed/img/share/source/travelpulse.png", "http://www.travelpulse.com/"], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-05T01:38:45.305+03:00", "highlightTitle": ""}