{"organizations": [], "uuid": "9b27a233c14fdbfdb33068c163797f300c7fed70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/tripideas/old-sacramento-tours-descend-to-history-underground/ar-AAdKqJR", "country": "US", "title": "Old Sacramento tours descend to history underground", "performance_score": 0, "site": "msn.com", "participants_count": 3, "title_full": "Old Sacramento tours descend to history underground", "spam_score": 0.0, "site_type": "news", "published": "2015-08-31T03:00:00.000+03:00", "replies_count": 2, "uuid": "21f49644bdf615441f9a3a45e411bb5fb4773ae5"}, "author": "Jennifer Crane / The Sacramento Bee", "url": "http://www.msn.com/en-us/travel/tripideas/old-sacramento-tours-descend-to-history-underground/ar-AAdKqJR#post-0", "ord_in_thread": 0, "title": "Old Sacramento tours descend to history underground", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Old Sacramento tours descend to history underground Pittsburgh Post-Gazette 1 day ago By Jennifer Crane / The Sacramento Bee © TNS Visitors learn about Sacramento, Calif., history on an Old Sacramento Underground Tour.\nSACRAMENTO, Calif. — The sun doesn’t shine here, but it used to.\nA path made of old, cracking wood leads into a dark tunnel. The air is dusty, the lighting dim and the brick walls crumbling.\nThis ancient underground is part of Sacramento’s history, and is open for tours.\nThe Old Sacramento Underground Tours, started six years ago by city historian Marcia Eymann, offer both a family-friendly interactive history tour and an adult tour that also covers gambling, crime and prostitution in Sacramento.\nPG map: Old Sacramentno\n(Click image for larger version) The underground experience educates the Sacramento community and visitors on the rich history of the region, said Shawn Turner, manager of Old Sacramento Underground Tours.\n“People don’t realize the Old Sac they are walking in is not actually the original city. It is actually 25 feet below,” Mr. Turner said of the Front Street area.\nMost of the buildings were lifted while others were destroyed to make room for newer buildings, Mr. Turner said. Some of the buildings, such as a few hotels and the Fat City Bar & Restaurant at the corner of Front and J streets, were left at their original level with a level built on top, out of reach of floodwaters.\nThe tale of the up-and-coming capital of California is filled with loss and triumph.\nSteve Rossi, a tour guide who is working toward a master’s degree in history at Sacramento State, said he enjoys leading visitors and sharing his knowledge about Sacramento’s past.\n“It is such a unique story,” Mr. Rossi said. “The city was destroyed so many times, but kept coming back.”\nIf you go Underground Tours Where: Sacramento History Museum, 101 I Street, Old Sacramento. When: Weekends April-December, Weekday tours vary by month; check tour calendar. Cost: $10-$15, children 5 and under free, although the tour is not recommended for young children. sachistorymuseum.org or 1-916-808-7973 As Mr. Turner puts it, “The history of Sacramento is a story of birth, death and rebirth.”\n• John Sutter planned to establish a town named Sutterville outside Sacramento. Plans changed with the discovery of gold in 1848, and later in the rivers of the Sierra Nevada and the Sacramento River. Sam Brannan, an elder in the Mormon church who became California’s first millionaire, persuaded Mr. Sutter to form the city next to the water, which was a port for shipping goods to mining areas. Shortly after, Mr. Brannan ushered in a great migration of people to search for gold. Mr. Brannan and John Augustus Sutter Jr., Mr. Sutter’s son, laid out the city in 1848. Mr. Brannan named the city “Sacramento” after the river.\n• To Sacramento’s dismay, the early 1850s was an era of fires and flooding. Then, from late December 1861 through February 1862 a disastrous flood swept over the city. During this period, Sacramento experienced snow and 45 days of heavy rainfall. Thirty inches of rain fell in two months. The filled American River broke through the levee around the city.\n• In 1864 Sacramento residents came together, laced up their boots and started to uniformly lift the city. The city was lifted an average of 9½ feet above the flooding. The buildings were lifted with screw jacks by the muscle of community members.\n“The city was rather proud and full of itself,” Mr. Turner said. “These buildings and businesses were built fancy and were imposing. They weren’t going to move somewhere else.”\nThe underground tour guides come from different backgrounds but were selected because they share a passion for the history. Some dress in costume and act out figures from the time. Each tour guide uses his or her own knowledge, so no two tours are alike, Mr. Turner said.\n“I think it is important to know where we come from, and to have fun while learning about it,” said Julie Ivanovich, Sacramento native and the educational and interpretive programs assistant at the Sacramento History Museum.\n“This city (has) survived all these catastrophes and will need to again,” Mr. Turner said.\n ", "external_links": ["http://www.post-gazette.com/", "http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAdKqJR%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdJSSQ.img&description=Visitors+learn+about+Sacramento%2c+Calif.%2c+history+on+an+Old+Sacramento+Underground+Tour.+-+TNS"], "published": "2015-08-31T03:00:00.000+03:00", "crawled": "2015-09-01T20:01:42.164+03:00", "highlightTitle": ""}