{"organizations": [], "uuid": "c4186bb397ddf2204aabb56f8efd603c83ac2c6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150917Chile04.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/09/17/photos-chile-recovers-from-quake-nightmare-11-dead-so-far", "country": "US", "title": "PHOTOS: Chile recovers from quake 'nightmare', 11 dead so far", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "PHOTOS: Chile recovers from quake 'nightmare', 11 dead so far", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T00:48:00.000+03:00", "replies_count": 0, "uuid": "c4186bb397ddf2204aabb56f8efd603c83ac2c6a"}, "author": "David Boddiger", "url": "http://www.ticotimes.net/2015/09/17/photos-chile-recovers-from-quake-nightmare-11-dead-so-far", "ord_in_thread": 0, "title": "PHOTOS: Chile recovers from quake 'nightmare', 11 dead so far", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nA fishing boat ran aground in the port of Coquimbo, some 445 km north of Santiago, during a massive earthquake on Sept. 17, 2015. Martin Bernetti/AFP \nILLAPEL, Chile – Rattled Chileans recounted a night of terrifying aftershocks on Thursday after a powerful quake struck offshore , killing at least 11 and triggering tsunami waves that ravaged stretches of the coast. \nThe magnitude-8.3 Chile earthquake on Wednesday evening was the sixth most powerful in the history of the geologically volatile country and the strongest anywhere in the world this year, officials said. \nClose to one million people were evacuated from Pacific coastal areas as a precaution as Chile sounded a tsunami alert, with warnings issued as far away as Japan and New Zealand. \nA man crosses a street next to a destroyed house after an earthquake in Illapel, some 200 km north of Santiago, on Sept. 17, 2015. A powerful magnitude-8.3 earthquake struck off Chile killing eight people and forcing the evacuation of a million. Martin Bernetti/AFP \nResidents took refuge on high ground as aftershocks jolted the region all night and into Thursday. \n“It was a nightmare,” Maria Ramírez told AFP as she swept up debris outside her house in the badly hit coastal town of Illapel. \n“We felt the tremors for a long time, too long. And then all the aftershocks — it was terrible,” she said. “I couldn’t stay standing, but luckily we made it out alive.” \nThe Chile earthquake occurred at a shallow depth, and the epicenter was located 228 kilometers (about 140 miles) north of the capital Santiago, a city of 6.6 million people, where there were scenes of pandemonium as thousands fled swaying buildings. \nIn the hours that followed, tsunami waves of up to 4.5 meters (15 feet) came crashing onshore in the region of Coquimbo, 400 kilometers north of Santiago, causing extensive damage to the port itself. \nThe fishing village of Tongoy was among the worst-hit, with television footage showing entire seafront areas destroyed. Two-meter waves also struck the tourist port of Valparaíso. \nA coastal area ravaged by the sea in Coquimbo, some 445 km north of Santiago, during the Chile earthquake on Sept. 17, 2015. Martin Bernetti/AFP ‘Ring of fire’ \nPresident Michelle Bachelet headed to the quake-hit area Thursday to assess the relief effort. \n“We know this is a very difficult situation,” Bachelet said after meeting with a group of local fishermen in Coquimbo. “But we wish to salute the enormous cooperation of the population which ensured that — despite the scale of this earthquake — there are thankfully few victims.” \nThe most recent toll from the quake stood at 11 dead, with nine others injured, according to National Emergency Office (ONEMI) director Ricardo Toro. The last known victim was a man killed in Coquimbo. \nAt least 526 homes were damaged, most of them in the Coquimbo region, according to the ONEMI. A state of emergency was declared in the area, Interior Minister Jorge Burgos said. \nPeople recover belongings in Concón, Chile, some 110 kilometers northwest of Santiago, on Sept. 17, 2015. Vladimir Rodas/AFP \nChile lies on what is known as the “Ring of Fire”— an arc of fault lines that circles the Pacific Basin and is prone to frequent earthquakes and volcanic eruptions. \nFive years ago in February 2010, a magnitude-8.8 quake off the southern Chilean coast killed more than 500 people and inflicted an estimated $30 billion in damages. \nThe Hawaii-based Pacific Tsunami Warning Center said tsunami waves were possible this time in French Polynesia, Hawaii and California, as well as smaller waves as far afield as Japan and New Zealand. \nJapan Meteo agency issued a tsunami advisory — though not an alert — saying a wave up to one meter high could reach the entire east coast of Japan, from Hokkaido in the north to Okinawa in the south, early Friday. \nThe agency asked people to stay away from the coast, warning that a larger wave could follow the first. \nExtensive damage caused by the sea in the port of Coquimbo, some 445 km north of Santiago, during the massive Chile earthquake on Sept. 17, 2015. Martin Bernetti/AFP ‘The longest time’ \nIn Illapel, a city of 30,000, daybreak revealed the damage done, with power knocked out, shacks destroyed, store shelves overturned and the local cemetery a chaos of broken crosses, vases and coffins. \n“It was the most horrific moment, a terrible thing,” local resident Ana Cortes, 35, told AFP. “Everything just kept moving, for the longest time.” \nFacebook said it had activated a geolocation tool allowing people in Chile to reassure friends and loved ones. The Safety Check tool is accessed through Facebook’s regular interface, and lets members check whether their contacts are in a disaster zone, signal their own presence and let others know they are safe and well. \nChileans recover their belongings in Concón, some 110 km northwest of Santiago, after a massive earthquake on Sept. 17, 2015. Christian Miranda/AFP", "external_links": [], "published": "2015-09-18T00:48:00.000+03:00", "crawled": "2015-09-18T04:42:24.332+03:00", "highlightTitle": ""}