{"organizations": [], "uuid": "f65ec994d98f6bf0777916ac7fc22675c8361ab7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63961/top-chinese-press-experience-seychelles-brand", "country": "US", "title": "Top Chinese press experience the Seychelles brand", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Top Chinese press experience the Seychelles brand", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T23:18:00.000+03:00", "replies_count": 0, "uuid": "f65ec994d98f6bf0777916ac7fc22675c8361ab7"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63961/top-chinese-press-experience-seychelles-brand", "ord_in_thread": 0, "title": "Top Chinese press experience the Seychelles brand", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top Chinese press experience the Seychelles brand   \nSep 20, 2015 eTN   \nA 10-member delegation representing the Chinese press are in Seychelles on an 8-day visit to explore, experience, and capture the unique beauty of these islands. \nThis trip has been made possible thanks to the support of the Seychelles Tourism Board and Sony (China). \nTheir mission here is to photograph and video shoot the various unique points of Seychelles. Pcpop.com, xitek.com, pchome.com, zol.com, Breadtrip, and Travel and Photography are the media being represented on this trip. One of China’s rising stars in photography is also part of the group. \nApart from visiting other islands like Praslin and Silhouette, the delegation will experience the comfort and good hospitality of the hotels in Seychelles in the likes of Kempinski Seychelles Resort, Hilton Seychelles Labriz Resort and Spa, Banyan Tree Seychelles, Coral Strand Smart Choice Hotel, Indian Ocean Lodge, and the newly-opened H Resort. \nOn Silhouette, they had the chance to enjoy the untouched natural beauty of the island as they hiked to Anse Mondon on the northern side. \nThey also visited and had photo shoots at the National Assembly building and the Palais de Justice, both located at Ile du Port. These two infrastructures were part of projects financed by the Chinese government. \nThe delegation will be traveling to Praslin tomorrow morning to get a chance of a lifetime to see the famous Coco de mer nut, which is the biggest in the world, along with other endemic species. \nVisiting the Fond Ferdinand Park along with one of the most photographed beaches - the stunning Anse Lazio beach - will also be part of their program for the day. \nPartners that have come on board to make this trip a successful one are Ethiopian Airlines, Mason's Travel, Kempinski Seychelles Resort, Hilton Seychelles Labriz Resort and Spa, Banyan Tree Seychelles, and Indian Ocean Lodge. \nSeychelles is a founding member of the International Coalition of Tourism Partners (ICTP) . Source: Seychelles Ministry of Tourism and Culture", "external_links": [], "published": "2015-09-20T23:18:00.000+03:00", "crawled": "2015-09-20T23:52:43.114+03:00", "highlightTitle": ""}