{"organizations": [], "uuid": "147662e9329cdd01a121c342ac360edfbc90aa29", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eveningtribune.com", "main_image": "http://www.eveningtribune.com/Global/images/head/nameplate/hornelleveningtribune_logo.png", "site_section": "http://www.eveningtribune.com/lifestyle/travel?template=rss&mime=xml", "section_title": "Travel - The Evening Tribune", "url": "http://www.eveningtribune.com/article/20150924/NEWS/150929855/2010/LIFESTYLE?rssfeed=true", "country": "US", "title": "Hornell 6th 'most redneck' in NY", "performance_score": 0, "site": "eveningtribune.com", "participants_count": 1, "title_full": "Hornell 6th 'most redneck' in NY", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T02:35:00.000+03:00", "replies_count": 0, "uuid": "147662e9329cdd01a121c342ac360edfbc90aa29"}, "author": "Jason Jordan The Evening Tribune", "url": "http://www.eveningtribune.com/article/20150924/NEWS/150929855/2010/LIFESTYLE?rssfeed=true", "ord_in_thread": 0, "title": "Hornell 6th 'most redneck' in NY", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hornell 6th 'most redneck' in NY Comment Posted Sep. 24, 2015 at 6:35 PM Updated Sep 24, 2015 at 6:35 PM By Jason Jordan Posted Sep. 24, 2015 at 6:35 PM Hornell, N.Y. HORNELL — A web posting, calling the Maple City one of the most \"redneck\" locations in the state is going viral locally, and is being met with mixed opinions. The info-tainment travel site Roadsnacks.net ranked the city of Hornell number six on its list of most redneck locations in the state of New York. Even Hornell Mayor Shawn Hogan said he's seen the post making the rounds on social media. \"We live in a rural area. We have rednecks here, and some people take pride in that, and there's a lot of other people here too. I'm not embarrassed by it in the least,\" he said. \"At least we're six, we're not number one.\" Hogan was quick to point out that the website is \"not based on any factual data,\" but didn't dismiss the title as something negative either. \"Certainly I celebrate more the fact that we were named the number four most affordable place in the state and that was done by a legitimate organization and number six most liveable by an organization based on credible statistics,\" he said. The website used a loose set of criteria to define what is redneck, scouring the internet for related posts. \"Rednecks like to hunt, fish, drink, smoke and shoot things. And shop at Walmart,\" rankers explained. All of which are activities that are in no short supply in Hornell. According to the site, Hornell ranks third in the state in the number of dollar stores, and second on the list of most bars per capita in the state of New York. \"Looks like Hornell rednecks ain’t messin around with their drinking. There are just about more bars per capita in Hornell than anywhere else in the state,\" said the list caption. \"There's a lot less bars now than when I was a kid, I couldn't even begin to count, so if that's their criteria we would have been number one back then,\" Hogan recalled. Having an abundance of dollar stores is also a positive thing in the mayor's estimation. \"I saw just the other day Dollar Tree is traded on the stock market, it's a major national corporation,\" he said. \"So is Dollar General, they have thousands of stores and they are today's corner store.\" Also, boding well for Hornell's placement on the list is the fact that it's just a stone's throw away from the number 5 town on the list, Bath. Bath was largely chosen for its ready availability of legally purchased firearms. A picture of Louie's Gun Shop was the chosen art announcing the village on the Roadsnacks' list. The fact that the village also has three dollar stores for its modest population helped its ranking. Page 2 of 2 - \"A thrifty redneck knows that when one dollar store is outta Christmas lights, you just take the truck over to the other one,\" the list cited. Some find the term redneck to be derogatory because it implies lack of education and poverty, but others embrace and even celebrate the monicker. According to Google, the word is an informal, derogatory term for \"A working-class white person, especially a politically reactionary one from a rural area.\" \"Heck even someone with a Ph.D. can be a redneck,\" Hogan said. While the ranking is admittedly more opinion than fact based, some readers can be found agreeing in the comment section, and others dismiss it as salacious garbage only meant to seek a reaction. \"This site is proof anyone can start a website and just post random (garbage),\" posted one commenter. Who finished number 1? That \"honor\" went to Hudson. From number 10 to 1, it's Camden, Norwich, Penn Yan, Johnstown, Hornell, Bath, Albion, Medina, Monticello and Hudson. Notably absent from the list were any towns or villages in Allegany County. In fact, they didn't even make the top 100 most redneck places in New York, something locals will find both relief and anguish in. By Jason Jordan", "external_links": [], "published": "2015-09-25T02:35:00.000+03:00", "crawled": "2015-09-26T09:31:34.355+03:00", "highlightTitle": ""}