{"organizations": [], "uuid": "4cc3a2f122d555860e3716b65ab88fd4ff181564", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/fire-sparks-carnival-cruise-ship-engine-room-0", "country": "US", "title": "Fire Sparks in Carnival Cruise Ship Engine Room", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "Fire Sparks in Carnival Cruise Ship Engine Room", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T01:47:00.000+03:00", "replies_count": 0, "uuid": "4cc3a2f122d555860e3716b65ab88fd4ff181564"}, "author": "senh", "url": "http://www.wopular.com/fire-sparks-carnival-cruise-ship-engine-room-0", "ord_in_thread": 0, "title": "Fire Sparks in Carnival Cruise Ship Engine Room", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Fire Sparks in Carnival Liberty Cruise Ship Engine Room Passengers and crew aboard a Caribbean Carnival Cruise through the holiday weekend got a scare Monday when a fire broke out in one of the ship's engine rooms. No one was injured in the fire, which sparked while the 952-foot-long Carnival Liberty was docked ... 09/7/2015 - 9:52 am | View Link Fire sparks aboard Carnival Liberty Crews responded to a fire aboard the Carnival Liberty docked in St. Thomas Monday, according to officials with Carnival Liberty. While the Carnival Liberty was docked in St. Thomas, there was a fire in the ship's engine room, officials said. There were no ... 09/7/2015 - 8:46 am | View Link Freedom of the Seas Fire: A Word From Your Captain The captain of the Freedom of the Seas, Captain Ron Holmes ... Captain Holmes says that the fire erupted from what he describes as the engine spaces. It spread, he says, from the bottom of the ship to the top, above the Viking Crown lounge via an exhaust ... 07/28/2015 - 10:51 pm | View Link Carnival Triumph resumes service after fire Carnival Triumph, which suffered an engine room fire ... upgrades to the 14 year old ship hit $115 million, including six new entertainment areas. The incident led to the cancellation of cruises and prompted Carnival Cruise Lines to embark on a $300 ... 06/13/2013 - 1:00 pm | View Link Ship fire ends Royal Caribbean cruise Carnival Corp. also had trouble with fire aboard ship earlier this year. The 900-foot Triumph was disabled during a February cruise by an engine room fire in the Gulf of Mexico, leaving thousands of passengers to endure cold food, unsanitary conditions and ...", "external_links": [], "published": "2015-09-08T01:47:00.000+03:00", "crawled": "2015-09-08T10:26:55.733+03:00", "highlightTitle": ""}