{"organizations": [], "uuid": "cda556f7c2913ce2d952475a67284191b36f85a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.sun-sentinel.com", "main_image": "http://www.trbimg.com/img-55e761cc/turbine/la-trb-top-16-new-rides-2016-us-20150902", "site_section": "http://www.sun-sentinel.com/travel/rss2.0.xml", "section_title": "Travel - Sun Sentinel", "url": "http://www.sun-sentinel.com/travel/la-trb-top-16-new-rides-2016-us-20150902-story.html", "country": "US", "title": "Top 16 for 2016: Best new rides coming to U.S. theme parks", "performance_score": 0, "site": "sun-sentinel.com", "participants_count": 1, "title_full": "Top 16 for 2016: Best new rides coming to U.S. theme parks", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T18:30:00.000+03:00", "replies_count": 0, "uuid": "cda556f7c2913ce2d952475a67284191b36f85a2"}, "author": "Brady MacDonald", "url": "http://www.sun-sentinel.com/travel/la-trb-top-16-new-rides-2016-us-20150902-story.html", "ord_in_thread": 0, "title": "Top 16 for 2016: Best new rides coming to U.S. theme parks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you took all 123 roller coasters at Cedar Fair parks and put them end to end they’d stretch for 58 miles. Stack all those lift hills on top of one another and they’d reach more than 10,000 feet into the sky. ( Brady MacDonald ) \nUniversal Studios Hollywood plans a spring debut for the highly anticipated West Coast version of the Wizarding World of Harry Potter. \nThe new themed land is expected to be a carbon copy of the Orlando original with one significant twist: The marque Harry Potter and the Forbidden Journey attraction will feature 3-D technology. \n2) Skull Island: Reign of Kong \nThe next generation of King Kong attractions at Universal Orlando will take riders into the jungle island home of the gargantuan beast rather than bring the colossal ape to civilization as a chained captive. \nThe Skull Island: Reign of Kong dark ride at the Islands of Adventure theme park will combine massive 3-D screens, larger-than-life physical sets and huge animatronic figures. \n3) Lightning Rod \nDollywood's newest ride is being billed as both the world’s first launched wooden coaster and the world’s fastest wooden coaster. \nThe hot rod-themed Lightning Rod coaster built by Rocky Mountain Construction will feature 12 airtime hills, taking advantage of the Tennessee theme park's terrain. \n4) Frozen Ever After \nFrozen Ever After replaces the Maelstrom water ride in the Norway pavilion at Disney's Epcot theme park in Florida. \nBased on the “Frozen” film, the new boat ride is expected to take visitors to Arendelle and Elsa’s ice palace during a Winter in Summer celebration. \n5) Storm Chaser \nKentucky Kingdom will convert a portion of the existing Twisted Twins dueling coaster into a hybrid ride with multiple inversions. \nRenovated by Rocky Mountain Construction, Storm Chaser will feature a barrel roll first drop that looks simply amazing. \n6) Luigi's Rollickin' Roadsters \nAfter a little more than two years in service, the beleaguered Luigi's Flying Tires at Disney California Adventure will be replaced by an entirely new ride. \nConcept art of the new Luigi's Rollickin' Roadsters attraction released by Disney shows riders in classic cars zooming around an enclosed course free of a track or turntable. \n7) Valravn \nCedar Point’s 17th roller coaster will be a Bolliger & Mabillard Dive Machine called Valravn, according to Screamscape . \nSections of track have already begun arriving at the Ohio amusement park. An official announcement is expected Sept. 9. \n8) Mako \nThe 200-foot-tall Mako coaster coming to SeaWorld Orlando will be the centerpiece of a two-acre shark exhibit with an underwater theme. \nThe 73-mph Bolliger & Mabillard hyper coaster will feature nine airtime hills and a custom musical score. \n9) Cobra’s Curse", "external_links": [], "published": "2015-09-02T18:30:00.000+03:00", "crawled": "2015-09-03T00:24:59.205+03:00", "highlightTitle": ""}