{"organizations": [], "uuid": "a77ac6d0d579d461ec9a3102c29ea1ce637649a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.maxim.com", "main_image": "", "site_section": "http://www.maxim.com/maxim-man/travel", "section_title": "Travel | Maxim", "url": "http://www.maxim.com/maxim-man/travel/article/oman-road-trip-2015-9", "country": "US", "title": "My Solo Trek Across The Unforgiving Deserts of Oman", "performance_score": 0, "site": "maxim.com", "participants_count": 1, "title_full": "My Solo Trek Across The Unforgiving Deserts of Oman | Maxim", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "a77ac6d0d579d461ec9a3102c29ea1ce637649a4"}, "author": "Alexandra E. Petri", "url": "http://www.maxim.com/maxim-man/travel/article/oman-road-trip-2015-9", "ord_in_thread": 0, "title": "My Solo Trek Across The Unforgiving Deserts of Oman", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "I sat behind the wheel of my powder blue Toyota Corolla rental feeling like I had been plugged into an electrical socket. As I put the car into drive, I was excited, nervous, afraid, and then suddenly... confused. A pesky beep broke the silence.\nI looked around: Seatbelt? On. Tank? Full. Doors and trunk? Closed. I drove a little farther. The beeping continued. I whipped out my phone and dialed the rental agent’s number.\n“This is Allie, I just picked up the car from you. It keeps beeping, and I don’t — the emergency brake? Right. Thanks!”\nAnd so began my solo, six-day road trip through Oman, armed with a foldout map, two words of Arabic and questionable driving skills in my arsenal.\nIf you Googled “Oman,” don’t feel bad. Buried in the Southeastern corner of the Persian Gulf, this Middle Eastern country — bordered by the UAE, Saudi Arabia and Yemen — has kept a low profile, save for its peacekeeping role between the U.S. and Iran.\nYet Oman, named among the top destinations for 2015, is an adventurer’s dream: fringed with jagged coastlines, bubbling with rocky mountains, teeming with secret caves and sprawling with desert. To experience its glory is to hit the road or take to the seas and let the country reveal itself to you.\nI set out on a furiously hot May morning. I plotted my route, accounting for time spent lost: a few days in Muscat to start, drive south for the night, journey up to the Jebel Shams mountains for hiking and camping, come down to sleep under the stars in the desert, spend a night turtling watching in a coastal town, and finish in Muscat. I also planned stops at wadis, valleys with freshwater pools for swimming.\nThough I have traveled extensively alone, this was beyond my comfort zone, and that's exactly why I did it. I had a death grip on the steering wheel as Muscat disappeared in my rearview mirror, giving way to a terrain devoid of life, what another planet might look like. The highways were small, two lanes in either direction, and empty. I fast learned the rules of the road: People don’t drive, they tailgate. At times, I wanted to stop short to teach the person behind me a lesson.\nGuidebooks recommend renting a 4x4, as Oman is rich with off-roading for skilled thrill seekers. It was Day 3 of my trip, and I wanted to drive up to Jebel Shams, part of the Al Hajar Mountains and home to Oman’s highest peak as well Wadi Ghul, or the grand canyon. I also wanted to camp and go hiking the next day, but getting there was the problem. The drive, I read, was a terrifying one: hairpin turns along unpaved roads through steep mountains. Perhaps I overestimated myself.\nI stopped in a megastore called LuLu’s to pick up some camping gear when I came across three guys with a cart ready for a Fourth of July barbecue.\n“Hey, are you travelers?” I asked. They weren’t. Originally from South Africa, they were working construction on nearby Jebel Akhdar, a more treacherous mountain, building hotels.\n“I am heading to Jebel Shams. Have you been before? I have this little car, and I am an astonishingly bad driver. Is it really difficult? Will I die?”\n“I went 10 years ago on holiday with my family,” one of the kids, Matt, said. He was flawlessly handsome, like Ryan Reynolds. “Who are you driving with?”\n“Alone,” I said.\nHe looked at me. “ You’d never be able to come up to Jebel Akhdar. We have a monster parked outside. But Jebel Shams is definitely steep and narrow, take it slow and leave while it’s light out,” Matt said. I thanked them and turned to walk away when Matt asked me if I would also be hiking on my own.\n“Insha'Allah,” I joked, using the Arabic phrase for \"God Willing\" that follows everything locals say. “That’s the plan.”\n“You’re badass.” He took my phone from my hand. “Here’s my number. Call if you need anything.”\nI walked out of LuLu’s with camping gear and a renewed sense of confidence. I’m badass! I told m yself. It was 3:30pm when I started driving. As I reached the base, I got nervous. “Please dear God, let me make it to the top of this mountain,” I said.\nThe first couple of miles was paved yet steep with little guard rail for protection. My car crept forward at a glacial pace. I pushed down on the gas so hard I practically Fred Flintstoned -my foot through the floor, but still the car cried in protest. This was going to be a long ride.\nJeeps and trucks sped by me and beeped loudly as they peeled around corners, passengers peering into my car. “Nothing to see here,” I said as I white-knuckled my way forward. My friends often make fun of me for how close to the steering I sit when I drive, almost like someone is holding a flame to my back that will burn me alive should I lose the position.\nEventually, the paved road ended, and the rocky trails began. I drove once before on unsealed roads through the A ustralian Outback, but they didn’t have the potential for me to go flying off a cliff. (Instead, I could break down in the desert). On the radio was the rhythmic trance of traditional Arabic music. If you’ve watched war movies where the scene surveys mountains in Afghanistan or Iraq with those eerie, haunting Arabic melodies lightly playing in the background — that’s what I was listening to. I am one for theatrics, and as I prayed my way to the top, it seemed fitting.\nI had never seen mountains like these before — a washed out mix of tan and brown, like the earth has seen too much sun. It was a dramatic, stark contrast to the blue skies above. There was only one way up and down. Rocks kicked up against my doors. This rental company is going to make a fortune. There were no more cars passing anymore. My mind raced: I am going to break down, and coyotes are going to eat me. (There were no signs of coyotes, though there were plenty of goats.)\nTwelve kilometers later, I saw it: beautifully sealed roads. I jumped up and down in my seat and continued driving until I reached the the Wadi Ghul viewpoint.\nI got out of the car, and Oman’s Grand Canyon practically swallowed me whole. I stood there and let the quiet of the world wash over me. It was nearly sunset; the air was cool, a welcome respite from 100 degree heat. I arrived in Oman without any idea of how beautiful this country is, and so far I had only seen a small part. As I got back in my car and headed to the camp grounds, I thought about messaging my new friend Matt.\n“On second thought,” I told myself, “better wait til I make it down in one piece tomorrow.”", "external_links": ["https://en.wikipedia.org/wiki/Jebel_Shams"], "published": "2015-09-04T03:00:00.000+03:00", "crawled": "2015-09-04T19:19:40.342+03:00", "highlightTitle": ""}