{"organizations": ["APEX", "The Airline Passenger Experience Association", "Association", "Marlborough", "Emory University"], "uuid": "c61a7696ac113a4bf4e7dc06916df0ecb7a9ebce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/all-pics/press_releases_2_lead.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13277886/1/apex-selects-aviation-and-technology-veteran-joe-leader-as-associations-ceo.html?cm_ven=RSSFeed", "country": "US", "title": "APEX Selects Aviation And Technology Veteran Joe Leader As Association's CEO", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "APEX Selects Aviation And Technology Veteran Joe Leader As Association's CEO", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T04:25:00.000+03:00", "replies_count": 0, "uuid": "c61a7696ac113a4bf4e7dc06916df0ecb7a9ebce"}, "author": "", "url": "http://www.thestreet.com/story/13277886/1/apex-selects-aviation-and-technology-veteran-joe-leader-as-associations-ceo.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "APEX Selects Aviation And Technology Veteran Joe Leader As Association's CEO", "locations": ["Oregon", "Virgin America", "NEW YORK", "Portland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Joe Leader", "Alfy Veretto", "Joe"], "text": "APEX Selects Aviation And Technology Veteran Joe Leader As Association's CEO By PR Newswire | 09/03/15 - 09:25 PM EDT Reprint NEW YORK , Sept. 3, 2015 /PRNewswire/ -- The Airline Passenger Experience Association (APEX), today announced the selection of Joe Leader as Chief Executive Officer of the nearly 40-year-old international association. As CEO, Leader will serve as the global champion for APEX, working with senior executives at all of the world's leading airlines, top industry suppliers, government organizations, major media groups, and related industry leaders to elevate the travel experience for all passengers. Photo - http://photos.prnewswire.com/prnh/20150903/263719 \"The APEX Board of Directors selected Joe as our association's CEO because of the depth of his experience, education, and leadership. He has a comprehensive understanding and appreciation of all aspects of passenger experience,\" said APEX President Alfy Veretto of Virgin America. \"We are confident Joe will take APEX to the next level of global recognition and influence that will bring transformative, positive change for the air travel industry.\"As CEO, Leader will be working with APEX's worldwide team to further the association's growth and success, while prominently positioning APEX as the most influential, value-driven membership organization in the industry. In addition to fostering ancillary revenue opportunities for airlines, Leader will represent the association before industry groups and governments. He will also serve as an industry spokesperson on public policy matters and global strategic alliances. Leader will demonstrate the impact APEX members have had across all aspects of the passenger experience at APEX EXPO in Portland, Oregon on Sept. 28 , highlighting advances in cabin, comfort, ambience, entertainment, connectivity, catering, seating, and service. During his speech, he will also share his vision for APEX's expanding industry leadership globally as passenger experience becomes a growing profit center for airlines. Considered the industry's most comprehensive and exclusive trade event, APEX EXPO is expected to draw more than 3,500 members and influencers in air travel. In a four-month search process, Leader was selected from over 600 high profile CEO applicants, who were screened and interviewed via the renowned Marlborough aviation executive search group. Prior to joining APEX, Leader served in executive roles at aviation and technology companies for more than two decades. He previously worked as the president of an international aviation association, led the advancement of aviation booking technology expansion at a multi-billion dollar GDS company, and served in the international leadership of advanced technology companies. With a passion for education, Leader's business Ph.D. dissertation research focused upon accelerating the passenger adoption of new aviation technology. Leader also holds undergraduate and graduate degrees from Emory University alongside an MBA/TM focused upon technology management. \"I am honored to join the incredible team at APEX and to serve our members who represent the full breadth of the air travel industry,\" said Leader. \"The airline passenger experience is currently the central differentiating factor amongst carriers worldwide. This is why APEX will continue its longstanding commitment to working closely with members and partners to advance that experience in a manner that positively benefits our customers, our industry, and the countless individuals who work tirelessly to make air travel a pleasure.\" 1 of 3", "external_links": [], "published": "2015-09-04T04:25:00.000+03:00", "crawled": "2015-09-04T05:06:32.138+03:00", "highlightTitle": ""}