{"organizations": [], "uuid": "4386fbee422b0d17e62030c3910efb396b58f48c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/jumeirah-group-grosvenor-house-hero-1.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/rugby-world-cup-spirit-arrives-at-park-lane/", "country": "US", "title": "Rugby World Cup Spirit Arrives At Park LaneTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Rugby World Cup Spirit Arrives At Park LaneTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "4386fbee422b0d17e62030c3910efb396b58f48c"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/rugby-world-cup-spirit-arrives-at-park-lane/", "ord_in_thread": 0, "title": "Rugby World Cup Spirit Arrives At Park LaneTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rugby World Cup Spirit Arrives At Park Lane\nGrosvenor House Apartments by Jumeirah Living is inviting rugby fans to find their home away from home in the heart of Mayfair and enjoy an exclusive week-long break in the capital during the Rugby World Cup.\nThe luxury hotel residence has launched a new ‘Stay 7, Pay 5’ experience, offering visitors the chance to enjoy the best of the luxury London lifestyle, while indulging in seven nights for the price of five during the Rugby World Cup. The offer is available from 18 September – 31 October 2015.\nIdeally located for the World Cup’s London venues, Grosvenor House Apartments by Jumeirah Living stands in one of the city’s most exclusive addresses on Park Lane. Guests can start each day with a delicious complimentary full English breakfast and, when not engrossed in the rugby, can explore the inspiring boutiques of Mayfair, the retail charms of Bond Street and the West End’s theatres and restaurants. The hotel’s expert concierge team is also on hand to assist with any travel requirements or recommendations.\nThe offer also includes £75 worth of food or drink from the hotel’s menus, to be enjoyed in the Atrium or in the comfort of your suite when watching the match on your widescreen TV.\nWhen taking time out from watching the matches, Grosvenor House Apartments by Jumeirah Living is ideally situated for enjoying autumn in the capital. Hyde Park is on the doorstep and the cafés, boutiques and bars of Mayfair are just around the corner. Guests looking to explore more cultural destinations will be spoilt for choice as the capital’s galleries and museums are within easy distance.\nCombining the refined services of a luxury hotel with the privacy, comfort and generous living space of a contemporary Mayfair residence, Grosvenor House Apartments by Jumeirah Living is an ideal location to enjoy London. It offers 130 residences, ranging in size from studios to the five-bedroom Grosvenor Penthouse. Appealing to discerning travellers looking for a more private form of luxury, it offers a highly personalised service with luxurious amenities and flexible accommodation.\nSource:- Jumeirah", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T01:37:15.110+03:00", "highlightTitle": ""}