{"organizations": [], "uuid": "5a5f3b7746b5c41a4518fb06420654ab69877978", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thestreet.com", "main_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/poison-insidelarge_600x400.jpg", "site_section": "http://www.thestreet.com/feeds/rss/search.html?topicSearch=Travel&puc=relatedtopic", "section_title": "TheStreet Search RSS Feed: Travel", "url": "http://www.thestreet.com/story/13300742/1/dreaded-death-cross-threatens-nasdaq-japan-china-germany-india.html?cm_ven=RSSFeed", "country": "US", "title": "Dreaded 'Death Cross' Threatens Nasdaq, Japan, China, Germany, India", "performance_score": 0, "site": "thestreet.com", "participants_count": 0, "title_full": "Dreaded 'Death Cross' Threatens Nasdaq, Japan, China, Germany, India", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T12:55:00.000+03:00", "replies_count": 0, "uuid": "5a5f3b7746b5c41a4518fb06420654ab69877978"}, "author": "", "url": "http://www.thestreet.com/story/13300742/1/dreaded-death-cross-threatens-nasdaq-japan-china-germany-india.html?cm_ven=RSSFeed", "ord_in_thread": 0, "title": "Dreaded 'Death Cross' Threatens Nasdaq, Japan, China, Germany, India", "locations": ["Germany", "China", "Japan", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Richard Suttmeier"], "text": "Dreaded 'Death Cross' Threatens Nasdaq, Japan, China, Germany, India By Richard Suttmeier | 09/25/15 - 05:55 AM EDT Reprint \nNEW YORK ( TheStreet ) -- A spectre is haunting the markets in Japan, China, India, Germany and the U.S. All are at risk of confirming bear markets with a \"death cross\" pattern on their daily charts. \nA \"death cross\" occurs when the 50-day simple moving average declines below the 200-day simple moving average. This formation is a warning of further declines ahead. \nLet's take a closer technical look, starting with the daily chart of the Nikkei 225. \nCourtesy of MetaStock Xenith \nJapan's Nikkei 225 closed at 17,571.83 on Thursday, up just 0.7% year to date. However, the index is in correction territory, down 16.1% from its multiyear high of 20,952.71 set on June 24. The 50-day simple moving average of 19,526.80 is declining towards the 200-day simple moving average of 19,115.43. A \"death cross\" will likely be confirmed by the end of next week. \nA long-term problem for the Nikkei 225 is that the index has not been able to recapture 50% of its crash that began more than 25 years ago after setting an all-time high of 38,957.44 in December 1989. The 50% retracement of 22,966.96 was last tested in February 1992. \nTraveling next to China, here's the daily chart of the Shanghai Composite. \nCourtesy of MetaStock Xenith \nThe Shanghai Composite had a close of 3,143.69 on Thursday, down just 2.8% year to date but solidly in bear market territory. It is down 39.3% from its 2015 bubble peak of 5,178.19 set on June 12. The panic of \"Black Monday,\" Aug. 24, spread around the globe began when this index opened below its July 9 low of 3,373.54. This eventually pulled the 50-day simple moving average below the 200-day simple moving average on Sept. 9 with these averages now at 3,522.29 and 3,730.19, respectively. \nRemember that the crash of 2015 was a retracement of the crash of 2008, which followed an all-time high of 6,124.04 set in October 2007. The June 12 peak of 5,178.19 was well above the 61.8% Fibonacci retracement of the first bubble. Monday's decline was below 3,365, which is the 38.2% Fibonacci Retracement of the crash of 2008. The downside risk is to the 23.6% retracement of 2,714. 1 of 3", "external_links": [], "published": "2015-09-25T12:55:00.000+03:00", "crawled": "2015-09-25T13:28:52.890+03:00", "highlightTitle": ""}