{"organizations": [], "uuid": "16b067007c1b168f226187749eafb245a1e17bce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "http://247PRESS.images.worldnow.com/images/8824264_G.jpg", "site_section": "http://www.cbs8.com/category/278882/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30060616/august-superyacht-charter-fleet-news-from-fraser-yachts", "country": "US", "title": "August Superyacht Charter Fleet News from Fraser Yachts", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "August Superyacht Charter Fleet News from Fraser Yachts - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T11:26:00.000+03:00", "replies_count": 0, "uuid": "16b067007c1b168f226187749eafb245a1e17bce"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30060616/august-superyacht-charter-fleet-news-from-fraser-yachts", "ord_in_thread": 0, "title": "August Superyacht Charter Fleet News from Fraser Yachts", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fraser Yachts announces the addition of M/Y WHEELS to their fleet of superyachts for charter and special weekly charter offers for four other yachts.\n MONACO, September 18, The month of August has seen the addition of the impressive M/Y WHEELS to the Fraser Yachts charter fleet.\nM/Y WHEELS is a beautiful 50m superyacht, built in 2009 by Trinity Yachts. She is a stunning yacht that offers plenty of outdoor space, making her a perfect yacht for entertaining and relaxing. She can accommodate up to 12 guests in six luxurious staterooms and has a wide selection of watersports and toys available, including the 80' sport fish REEL WHEELS. She is available for charter in Florida and Bahamas from USD 200,000/week during both the summer and winter months.\nThe incredible 63.30m M/Y FORCE BLUE from Royal Denship is now available for charter with Fraser Yachts at a special rate of EUR 195,000/week from the 31st of August onwards from Southern Italy. She offers the ultimate relaxation experience complimented by a first class crew providing the highest service.\n56m M/Y ULYSSES is available from 27th of August onwards from the South of France at the unbeatable rate of EUR 200,000/week for a minimum of 7 days charter. . She boasts some of the latest technology and offers a variety of superyacht toys such as wave runners, water skis and paddle-boards, making her an excellent pick for the adventurous. She offers first class service and an exceptionally talented chef.\nRecently re-launched in 2014, M/Y RIMA II is a magnificent yacht available for charter with Fraser Yachts. She is a modern Benetti superyacht with beautiful spacious and modern interiors and new exterior styling, offering seven staterooms for up to 12 guests. M/Y RIMA II is now available at a reduced rate of EUR 135,000/week from August 26th in Cannes. Open to bookings in the West Med and Balearics, Captain and crew are keen to secure more charters to complete a very successful season!\nFollowing an extensive interior and mechanical refit, M/Y ALASKA OF GEORGE TOWN is now available to charter from the beginning of September. The luxurious 43.90m yacht built by Shipworks Brisbane is an excellent pick for families. She can accommodate up to 10 guests in five beautiful staterooms. She is available for weekly charters all year round in the Western Mediterranean at the introductory rate of EUR 110,000-120,000/week. Licensed to charter in Spain, she is open to all enquiries and can be flexible on destinations in the Western Med.\nFor further information, please do not hesitate to contact a charter broker at Fraser Yachts today.\nFraser Yachts is the world's leading, full-service yachting company, and provides a professional team of yachting experts ready to support, advise and to assist you in every aspect of superyacht charter, luxury yacht sales, yacht ownership , and day-to-day operation. Visit their website at www.fraseryachts.com for further information.\n release/august-superyacht-charter-fleet-news-from-fraser-yachts-412890.php", "external_links": ["http://fraseryachts.com/Charter/charter_gallery.aspx?YachtID=Y3419_MC", "http://fraseryachts.com/Sale/sale_gallery.aspx?YachtID=Y487_MC_MC", "http://purl.org/rss/1.0/modules/content/", "http://www.24-7pressrelease.com/press-release/august-superyacht-charter-fleet-news-from-fraser-yachts-412890.php", "http://fraseryachts.com/Charter/charter_gallery.aspx?YachtID=Y6453_MC", "http://fraseryachts.com/Charter/charter_gallery.aspx?YachtID=Y9918_MC", "http://www.fraseryachts.com/Owning_a_yacht/Default.aspx", "http://fraseryachts.com/Charter/charter_enquiry.aspx?YachtID=Y7545_MC", "http://fraseryachts.com/Charter/charter_gallery.aspx?YachtID=Y6360_FL"], "published": "2015-09-18T11:26:00.000+03:00", "crawled": "2015-09-18T10:39:51.832+03:00", "highlightTitle": ""}