{"organizations": [], "uuid": "bc6d145f86cd67924d3ed90fc094ed4a45c7c998", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30087114/akceukanuba-national-championship-tickets-on-sale-and-premium-list-available-now", "country": "US", "title": "AKC/EUKANUBA National Championship Tickets on Sale and Premium List Available Now", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "AKC/EUKANUBA National Championship Tickets on Sale and Premium List Available Now - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "bc6d145f86cd67924d3ed90fc094ed4a45c7c998"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30087114/akceukanuba-national-championship-tickets-on-sale-and-premium-list-available-now", "ord_in_thread": 0, "title": "AKC/EUKANUBA National Championship Tickets on Sale and Premium List Available Now", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " American Kennel Club\nNEW YORK , Sept. 22, 2015 /PRNewswire-USNewswire/ -- Daytime and evening tickets are on sale now for the 2015 AKC/EUKANUBA National Championship (AENC), which returns to Orlando's Orange County Convention Center this December 12 th and 13 th . Simultaneously, the premium list is also available today to competitors. Both tickets and premium list can be found at www.akc.org .\nThe only dog show hosted by the American Kennel Club, AENC, with its long standing Best Bred-by Exhibitor competition, has been the largest dog show in the United States for the past three years and is considered one of the world's premiere dog events. It joins an array of special consumer attractions, breeder seminars and of course the crowning of a new National Champion.\nThis year AENC will present, for the first time, the Canine Breeder Excellence Seminar powered by AKC, the EUKANUBA™ brand, and the Theriogenology Foundation where attendees will receive cutting edge information straight from the experts. Other event highlights include the National Owner Handled Series finals, the AKC Agility Invitational, AKC Obedience Classic, AKC Meet the Breeds ® and Junior competition in Conformation, Agility, Obedience and AKC Rally ® .\nFor those who can't be in Orlando in person, extensive evening event coverage will once again be offered free of charge via streaming video at www.akc.org .\nEnhanced Schedule of Competitions\nNotable events include:\nTuesday - December 8\nSpace Coast KC of Palm Bay Dog Show NADD/AKC Diving Dogs AKC/DJAA Advanced Judges Institute for Sporting & Toy Groups Wednesday - December 9\nBrevard Kennel Club Dog Show Orlando Dog Training Club Obedience & Rally Trial NADD/AKC Diving Dogs AKC/DJAA Advanced Judges Institute for Sporting & Toy Groups Michael J Sauve Memorial Benefit (Evening Event) Thursday - December 10\nCentral Florida Kennel Club Dog Show Orlando Dog Training Club Obedience & Rally Trial NADD/AKC Diving Dogs AKC Institute for Aspiring & Newly Approved Judges AKC/DJAA Advanced Judges Institute for Sporting & Toy Groups AKC Canine Health Foundation Canines & Cocktails Reception Friday - December 11\nSpecialty Shows / Group Shows FSS / Miscellaneous Breeds Open Show Orlando Dog Training Club Obedience & Rally Trial AKC Juniors Agility Competition AKC National Owner-Handled Series Finals – Breeds & Groups NADD/AKC Diving Dogs AKC Institute for Judging Junior Showmanship AKC Judges Education Coordinator Symposium AKC/DJAA Advanced Judges Institute for Sporting & Toy Groups Canine Breeder Excellence Seminar powered by AKC, Royal Canin & Theriogenology Foundation Saturday - December 12\nAKC/EUKANUBA National Championship (Daytime and Evening events) AKC Agility Invitational AKC Obedience Classic AKC Juniors Classic – Obedience AKC National Owner-Handled Series Finals – Best NOHS in Show (Evening event) NADD/AKC Diving Dogs AKC Meet the Breeds BreederU – featuring free seminars from top experts in canine and breed-specific nutrition Sunday - December 13\nAKC/EUKANUBA National Championship (Daytime and Evening events) AKC Agility Invitational AKC Obedience Classic AKC Juniors Classic – Rally NADD/AKC Diving Dogs AKC Meet the Breeds BreederU – featuring free seminars from top experts in canine and breed-specific nutrition A full schedule of events is available on the AKC website.\nThe American Kennel Club (AKC), founded in 1884, maintains the largest registry of purebred dogs in the world. Its rules and regulations govern more than 20,000 canine competitions each year. For more information, visit www.akc.org .\nAbout EUKANUBA™ Pet Food\nWith over 45 years of research, the EUKANUBA™ brand offers a complete food lineup, delivering exceptional customized nutrition by life stage, breed size as well as health and performance requirements. EUKANUBA™ is a pet food brand of Mars Petcare. You can visit us on the Web at http://www.eukanuba.com or at Facebook.com/Eukanuba.\n®/™ Trademarks © The Iams Company 2015.\n releases/akceukanuba-national-championship-tickets-on-sale-and-premium-list-available-now-300146986.html\n ", "external_links": ["http://www.akc.org/", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC08342&Transmission_Id=201509220822PR_NEWS_USPR_____DC08342&DateId=20150922", "http://www.prnewswire.com/news-releases/akceukanuba-national-championship-tickets-on-sale-and-premium-list-available-now-300146986.html", "http://www.eukanuba.com/", "http://www.xmlnews.org/ns/"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T16:54:10.804+03:00", "highlightTitle": ""}