{"organizations": [], "uuid": "8735645e5f05345b9cde27f324589c8651851835", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.jewishjournal.com", "main_image": "http://www.jewishjournal.com/images/featured/Bar_Refaeli_Cannes_2008.jpg", "site_section": "http://www.jewishjournal.com/wesaidgotravel/2011/11", "section_title": "We Said Go Travel | November 2011 | Jewish Journal ", "url": "http://www.jewishjournal.com/hollywood/article/israeli_supermodel_bar_refaeli_marries_under_no_fly_zone", "country": "US", "title": "Israeli supermodel Bar Refaeli marries under no-fly zone | Hollywood", "performance_score": 0, "site": "jewishjournal.com", "participants_count": 1, "title_full": "Israeli supermodel Bar Refaeli marries under no-fly zone | Hollywood | Jewish Journal", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "8735645e5f05345b9cde27f324589c8651851835"}, "author": "jewishjournal.com", "url": "http://www.jewishjournal.com/hollywood/article/israeli_supermodel_bar_refaeli_marries_under_no_fly_zone", "ord_in_thread": 0, "title": "Israeli supermodel Bar Refaeli marries under no-fly zone | Hollywood", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Bar Refaeli. Photo from Shutterstock.com\nIsraeli supermodel Bar Refaeli married Adi Ezra in a traditional Jewish wedding at the Carmel Forest Spa Resort in northern Israel.\nRefaeli, 30, and Ezra, 40, a businessman whose family owns the Israeli food importing company Neto ME Holdings, wed Thursday. Rabbi Yitzchak Dovid Grossman officiated at the ceremony, which according to some reports had 300 guests. (Others placed it at 400.)\nRefaeli wore a gown designed by Chloé. Israeli singer and “The Voice Israel” judge Shlomi Shabbat sang his popular song “The Beginning of the World,” according Israeli websites Walla and Mako.\nThe wedding was preceded by conflict over whether or not it was permissible to impose a no-fly zone over it.\nOn Tuesday, Israel’s Civil Aviation Authority announced that it would override the transportation minister, Israel Katz, reinstating the no-fly zone in the 4-square-mile airspace over the site of the wedding.\nIn canceling the order on Sunday, Katz said he objected to the special treatment for Refaeli and Ezra.\n“As the person responsible for civil aviation and setting policy, I expect you to fully implement my instructions on the matter,” Katz told Feldsho, the Israeli business daily Globes reported. “I look gravely on attempts to operate against the instructions and I policies that I have set. The skies belong to the public at large and exclusivity should not be granted for commercial reasons to relevant organizations. Justice must be done and seen to be done.”\nFive drones, two helicopters and an observation balloon circled the area as part of the wedding – including to photograph the affair and to transport the couple to the site, according to Israeli reports. The reports suggested that the request to close the area to other aircraft was a safety issue.", "external_links": [], "published": "2015-09-26T03:00:00.000+03:00", "crawled": "2015-09-26T05:57:21.338+03:00", "highlightTitle": ""}