{"organizations": [], "uuid": "1f4da991e781e37972de9a22f2081e2ad554548a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64303/japan-transocean-air-latest-select-gogo-2ku", "country": "US", "title": "Japan Transocean Air latest to select Gogo 2Ku", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Japan Transocean Air latest to select Gogo 2Ku", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T21:03:00.000+03:00", "replies_count": 0, "uuid": "1f4da991e781e37972de9a22f2081e2ad554548a"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64303/japan-transocean-air-latest-select-gogo-2ku", "ord_in_thread": 0, "title": "Japan Transocean Air latest to select Gogo 2Ku", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Japan Transocean Air latest to select Gogo 2Ku     \nCHICAGO, IL - Gogo, the global leader in providing broadband connectivity solutions and wireless entertainment to the aviation industry, announced today that JTA is the latest airline to select 2Ku – Gogo's next generation connectivity solution. \nJTA, a member of the Japan Airlines group, has awarded its new 737-800 aircraft to Gogo for installation of Gogo's 2Ku in-flight connectivity solution. In addition, passengers on these aircraft will receive Gogo's wireless in-flight entertainment service – Gogo Vision. \"We are excited to partner with JTA to bring what we believe will be the best performing connectivity solution for global aviation to its aircraft,\" said Michael Small, Gogo's president and CEO. \"Eight commercial airlines around the world have agreed to deploy 2Ku on more than 550 aircraft. This is over half of the aircraft committed in the industry since we announced 2Ku. The adoption rate is unprecedented and clearly demonstrates that airlines realize the benefits of 2Ku and partnering with Gogo.\" \nGogo is several weeks into flight testing of 2Ku and the tests completed to date have exceeded expectations. The flight tests have demonstrated that 2Ku can deliver more bandwidth at less cost than gimbaled satellite antennae used on aircraft today. \n\"2Ku brings reliable, high capacity connectivity to the global aviation market, and I'm excited to see it performing so well in flight,\" added Mr. Small. \"As the market leader, we had the opportunity to evaluate every available technology and found significant shortfalls with each. We engineered 2Ku to be the best of all worlds. Other technologies in this market, whether based in the Ka- or Ku-band, cannot, we believe, match the combination of speed, reliability and global availability offered by 2Ku.\" \n2Ku is capable of matching or exceeding the bandwidth of any other system currently offered, including regional Ka-band solutions, while benefiting from the global coverage, resiliency and certainty of supply provided by the more than 100 satellites in the Ku-band. By contrast, systems based in the Ka-band are only able to access a few satellites. The recent flight tests demonstrate that 2Ku's proprietary antenna design delivers at least twice the performance of any gimbaled antennae currently in the market, regardless of spectrum band, and uniquely solves the \"skew angle\" problem that plagues current generation systems when aircraft are flying in tropical regions. \n2Ku's benefits span all forms of IP traffic, as shown by the recent successful flight tests, which included concurrent streaming video use on multiple devices and everything from web browsing to VPN access. 2Ku is also an excellent solution for delivering live television programming via IPTV. As previously announced, Gogo expects to launch its Gogo TV service in 2016. \nWhile 2Ku system testing continues, Gogo is making rapid progress towards the commercial launch scheduled for later this year. Initial installations are complete at Aeromexico and in progress at Virgin Atlantic. Beginning in early 2016, installations are expected to ramp up on other airline partners, including Air Canada, Delta, GOL and United. During 2016, Gogo anticipates completing retrofit installations on fleet types that include the Airbus 320, 330 and 340 families and the Boeing 737, 747 and 757 families and, while Gogo continues to advance its line fit programs with the airline manufacturers for future new delivery aircraft. \n\"We pride ourselves on providing the most trusted services in the industry across multiple technology generations,\" continued Mr. Small. \"With 2Ku we believe that we now have the best solution in the market for larger aircraft. Its performance is unmatched today and will be upgraded to higher speeds as newer spot beams become available. In addition, we are continuing our next generation air-to-ground (ATG) development efforts, targeting industry leading performance for smaller and more regionally focused aircraft. We are proud that our initial ATG technology disrupted this space and transformed the in-flight experience years ago, and we expect our technology roadmap to drive continued expansion of our leadership position through new and better solutions.\"", "external_links": [], "published": "2015-09-29T21:03:00.000+03:00", "crawled": "2015-09-30T00:35:52.844+03:00", "highlightTitle": ""}