{"organizations": ["Jennifer Sorentrue Palm Beach Post"], "uuid": "231d5a03558f59955e6625a9c20397e369f772da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.whio.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/09/02/85/ca/DSCN7097.JPG", "site_section": "http://www.whio.com/feeds/categories/travel/", "section_title": "News | Travel", "url": "http://www.whio.com/news/travel/what-you-need-remember-when-traveling-your-pet-lab/nnW3t/", "country": "US", "title": "What you need to remember when traveling with your pet for Labor Day", "performance_score": 0, "site": "whio.com", "participants_count": 0, "title_full": "What you need to remember when traveling with your pet for Labor Day", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T17:49:00.000+03:00", "replies_count": 0, "uuid": "231d5a03558f59955e6625a9c20397e369f772da"}, "author": "", "url": "http://www.whio.com/news/travel/what-you-need-remember-when-traveling-your-pet-lab/nnW3t/", "ord_in_thread": 0, "title": "What you need to remember when traveling with your pet for Labor Day", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Jennifer Sorentrue Palm Beach Post \nBefore you hit the road with your pet this Labor Day weekend, TripsWithPets.com has put together these tips to keep your four-legged friend safe during the trip. \nTripsWithPets.com , a website designed for those who enjoy traveling with their pets, recommends the following: No Heads Out the Window : Although many pets find that sticking their head out the window is the best part of the road trip, it’s not safe. Your pet can easily be injured by flying debris. This should go without saying, but NEVER travel with a pet in the back of a pickup truck. Some states have laws restricting such transport and it is always dangerous. Frequent Pit Stops: Always provide frequent bathroom and exercise breaks. Most travel service areas have designated areas for walking your pet. Be sure to stay in this area particularly when your pet needs a potty break, and of course, bring along a bag to pick up after your pet. When outside your vehicle, make sure that your pet is always on a leash and wearing a collar with a permanent and temporary travel identification tag. Proper Hydration : During your pit stops be sure to provide your pet with some fresh water to wet their whistle. Occasionally traveling can upset your pet’s stomach. Take along ice cubes, which are easier on your pet than large amounts of water. Watch the Food Intake : It is recommended that you keep feeding to a minimum during travel. Be sure to feed them their regular pet food and resist the temptation to give them some of your fast food burger or fries — that never has a good ending! Don’t Leave Them Alone: Never leave your pet unattended in a vehicle. On warm days, the temperature in your vehicle can rise to 120 degrees in minutes, even with the windows slightly open. In addition, an animal left alone in a vehicle is an open invitation to pet thieves. Practice Restraint: Be sure that your pet is safely secured in your vehicle. Utilizing pet safety restraints are the best way to keep your pet safe. They not only protect your pet from injury, but they help by keeping them from distracting you as you drive. Pet safety harnesses/seat belts, travel kennels, vehicle pet barriers, and pet car seats are all good choices for securing your pet. No matter what option you choose, make sure your pet does not travel in the front seat. Safe and Comfortable: Whatever method you select to properly secure your pet in your vehicle, be sure to make their comfort a priority. Just as it’s important for your “seat” to be comfortable for your road trip, your pet’s seat should be comfortable too. Typically their favorite blanket or travel bed will do the trick. There are also some safe and very cozy pet car seats available that your pet may find quite comfy.", "external_links": [], "published": "2015-09-02T17:49:00.000+03:00", "crawled": "2015-09-03T00:28:30.552+03:00", "highlightTitle": ""}