{"organizations": [], "uuid": "07b918ddd2ff9797423ccfdf969be8d1d56e6bf1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eglobaltravelmedia.com.au", "main_image": "http://www.eglobaltravelmedia.com.au/wp-content/uploads/2015/09/unnamed-1111-300x200.jpg", "site_section": "http://www.eglobaltravelmedia.com.au/feed/", "section_title": "Global Travel Media", "url": "http://www.eglobaltravelmedia.com.au/travellers-good-buys-compiled-by-john-rozentals-16/", "country": "US", "title": "Travellers Good Buys Compiled By John Rozentals", "performance_score": 0, "site": "eglobaltravelmedia.com.au", "participants_count": 1, "title_full": "Travellers Good Buys Compiled By John Rozentals", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T17:55:00.000+03:00", "replies_count": 0, "uuid": "07b918ddd2ff9797423ccfdf969be8d1d56e6bf1"}, "author": "Chisa Boonmee", "url": "http://www.eglobaltravelmedia.com.au/travellers-good-buys-compiled-by-john-rozentals-16/", "ord_in_thread": 0, "title": "Travellers Good Buys Compiled By John Rozentals", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cosmos has announced earlybird savings of $300 per couple across its newly released range of 2016 Asian holidays, including two new tours exploring sights and ancient landmarks of China. \nThe discounts are valid for bookings made prior to December 1. \nThe new nine-day ‘China Experience’, for instance, is priced from $1680 per person twin-share, including discount, with optional add-on stays in Hong Kong and Macau. \nIts focus is on the great cities of China, combining the modern metropolis of Shanghai with the terracotta warriors of Xi’an and the ancient palaces and monuments of Beijing. \nPhone 1300 230 234 or visit www.cosmostours.com.au . Silver Galápagos … highlighting the endemic wildlife that inspired Charles Darwin. \nCruise Express is offering a 24-night luxury cruise tour next October that will take travellers from Cuba to Ecuador, where 13 days will be spent exploring the Andes, the world’s tallest volcanoes, pristine jungle and Ecuador’s famous Galápagos Islands. \nThe tour features two, fully-inclusive five-star cruises — an 11-night journey aboard the 132-guest Silver Explorer from Nassau in the Bahamas to the time-warped country of Cuba; and a seven-night sailing aboard the 100-guest Silver Galápagos to see the endemic wildlife that inspired Charles Darwin. \nThe package costs from $23,895 per person, twin-share. \nPhone 1300 764 509 or visit www.cruiseexpress.com.au . Sheraton Fiji Resort … a choice of 17 restaurants and bars, six swimming pools, kids’ clubs and daily activities schedules. \nSave 50 per cent with TravelOnline on a five-night stay at the Sheraton Fiji Resort by paying from $629 per person twin-share, including daily breakfast, free wifi, return airport transfers by private vehicle, plus free accommodation, free kids club and discounted meals for children. \nThe deal is valid for sale until September 30 for travel from November 1 to December 26 and from January 3 to March 24. \nGuests at the resort have access to all the facilities at the adjacent Sheraton Denarau Villas, The Westin Denarau Island Resort & Spa and the Denarau Golf & Racquet Club, including a choice of 17 restaurants and bars, six swimming pools, kids’ clubs and daily activities schedules. \nVisit www.travelonline.com . Canberra’s Floriade festival … now in its 28th year \nCelebrate the burst of spring warmth at Canberra’s 28th annual Floriade festival with the choice of four Accor packages. \nAccor has deals offering two nights accommodation, buffet breakfast for two, and picnic-style lunch for two people, prepared in a lightweight take-home picnic basket or cooler bag. \nStarting rates range from $145 per night at Ibis Styles Canberra Eaglehawk to $191 at Novotel Canberra. \nThe ‘Spring Festival Package’ is valid for stays to October 31. Northern Lights near Fairbanks, Alaska The spectacular Northern Lights. Image: Jillian Mitchell \nFor those brave enough to experience an Alaskan winter, Intrepid Travel has just launched a trip that will reward travellers with the rare opportunity to experience the spectacular Northern Lights. \nTravelling from Anchorage to Fairbanks, this eight-day trip is an exclusive ticket to witness a natural phenomenon that most people never get to experience. \nTravellers will also get the opportunity to embark on a guided snowshoe hike through the forests of Denali National Park, take an optional flight over Mount McKinley, the highest mountain in North America, visit the historic gold-mining town of Talkeetna, walk through frozen boreal woods with reindeer in Fairbanks, and soak in the outdoor hot mineral waters at Chena Hot Springs. \nPrices are from $3920 per person twin-share. For more information visit www.intrepidtravel.com . At the extremes of the earth with Lindblad Expeditions and National Geographic. \nFeel like an adventure? Explore a couple of the world’s most untouched regions with Lindblad Expeditions and National Geographic as they offer savings of 25 per cent on their 19-day excursion around Cape Horn to visit Chilean Patagonia and Argentina’s Staten Island. \nPrices start at $20,980 per person twin-share ex Santiago. \nVisit au.expeditions.com . Murray Princess … serenely cruising Australia’s longest river \nCaptain Cook Cruises is offering 25 per cent discount on its Murray River cruises until February 26, with prices beginning at $695 per person twin-share for a three-night cruise from Mannum on board the refurbished Murray Princess. \nSit back in the air-conditioned paddlewheel lounges and enjoy the views as the Murray Princess cruises past towering limestone cliffs, through picturesque gorges and along riverbanks lined with mallee scrub and red gum forests. \nFour-nights ‘Outback Heritage’ cruises are priced from $950 per person twin-share and seven-night ‘Murraylands & Wildlife’ cruises from $1416 per person twin-share. \nPhone 1300 729 938 or visit www.murrayprincess.com.au . An extreme destination — seven days cruising the Antarctic. \nEcruising.travel has just 20 places on its 15-night ‘66 Degrees South’ package, which departs January 28, 2017, and includes seven days cruising the Antarctic and a flight over Drake Passage. \nPrices start from $26,579 per person twin-share, including return flights from Sydney, Melbourne and Brisbane, two nights in each of Valparaiso and Santiago, pre- and post- accommodation in Punta Arenas, seven nights cruising with all meals, plus beer, wine and soft drinks with lunch and dinner, regional flights, and Santiago and Valparaiso tours. \nThe Ocean Nova is a purpose-built expedition vessel with expansive picture windows to enjoy views of a world of fjords, icebergs and teeming wildlife. \nPhone 1300 369 848 or visit www.ecruising.travel . Working out on southern hemisphere’s biggest sand dunes. \nThe Retreat Port Stephens is offering an all-inclusive $250 health-and-fitness bootcamp from Friday, October 30, to Sunday, November 1. \nNestled in natural bushland and backing onto the biggest sand dunes in the southern hemisphere, The Retreat Port Stephens will provide a range of outdoor and indoor fitness and relaxation sessions with a personal trainer, two nights accommodation, six healthy meals, information sessions on nutrition and how to achieve health and fitness goals, and a goodies bag including a workout top. \nPhone 02 4982 1244 or visit www.theretreatportstephens.com.au . Singapore … explore the city for free during stopovers. \nChangi Airport Group, in collaboration with the Singapore Tourism Board and Singapore Airlines, has relaunched the Free Singapore Tour which enables transit travellers to explore the city during stopovers. \nNine tours operate daily and cover attractions such as Gardens by the Bay and the Singapore Flyer to cultural precincts such as Chinatown and Kampong Glam. \nVisit www.yoursingapore.com . Kimberley Gardens Hotel & Serviced Apartments … save 25 per cent. \nSave 25 per cent on a stay at the four-star Kimberley Gardens Hotel & Serviced Apartments, in Melbourne’s St Kilda East. \nBook and stay by 30 December and pay from $109 per night. \nThe hotel is a short drive from the Melbourne Cricket Ground, Luna Park, St Kilda Beach and the National Sports Museum. \nPhone 1800 912 386 or visit www.hotels.com . The Frecciarossa 1000 … a new addition to Trenitalia’s service. \nItalian rail operator Trenitalia has launched its latest train, the Frecciarossa 1000, offering customers a highly modern and fast service which is available through Melbourne-based International Rail. \nThe new high-speed trains will be utilised on the popular tourist and business route from Turin-Milan-Bologna-Florence-Rome-Naples. It offers 457 seats across four categories of cabins. New catering options, internet access and entertainment monitors are present in each class. \nFares start, for example, at $48 per person Rome-Milan. \nPhone 1300 387 245 or visit www.internationalrail.com.au . Share this:", "external_links": [], "published": "2015-09-18T17:55:00.000+03:00", "crawled": "2015-09-18T18:34:03.133+03:00", "highlightTitle": ""}