{"organizations": [], "uuid": "f15a20a17029a0dac8b796c7c28721560a37c643", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03434/Paula-Angel-Terase_3434866k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-09.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/news/worldnews/europe/italy/11855007/Sabotage-investigation-after-British-horse-trainer-hospitalised-in-fall.html", "country": "US", "title": "Sabotage investigation after British horse trainer hospitalised in fall", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Sabotage investigation after British horse trainer hospitalised in fall - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T07:45:00.000+03:00", "replies_count": 0, "uuid": "f15a20a17029a0dac8b796c7c28721560a37c643"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/news/worldnews/europe/italy/11855007/Sabotage-investigation-after-British-horse-trainer-hospitalised-in-fall.html", "ord_in_thread": 0, "title": "Sabotage investigation after British horse trainer hospitalised in fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A British horse trainer and amateur jockey has been hospitalised after her horse stumbled in a hole at a Milan race course that investigators suspect was an act of sabotage. Amateur jockey and racehorse trainer Paula Angel Terase, 52, suffered serious head injuries after her horse tripped in a large hole while galloping around the San Siro course at dawn on Tuesday. “This was probably sabotage, with tragic consequences,” an investigative source in Milan reportedly said. “The hole was very deep, too deep to be created by the hooves of another horse.” Mrs Angel Terase was placed in an induced coma and underwent emergency surgery. By Wednesday evening, she was reported to be in a stable condition. Her horse was not injured. There was a similar incident on the race course just an hour later. Originally from the village of Hawkhurst in Kent, Mrs Angel Terase has lived in Italy for 24 years and works as a Rome-area horse trainer. She is married to Italian racehorse trainer Fabrizio Camici. Witnesses said she was thrown approximately 30 feet from her horse, Madiam, after the purebred tripped in a hole hidden in the turf. Detectives said the large depression, which measured 20 cm deep and 40 cm wide, could have been caused by a faulty irrigation tube or other maintenance problem, but may also have been deliberately dug with a tool. \"That hole should not have been there,\" said Fabio De Pasquale, Milan prosecutor, who is leading the investigation. After the second accident the course was closed and investigators arrived to take measurements, gather evidence and question maintenance workers and race course staff. In January 2012, jockeys, trainers and breeders across Italy lamented a series of drastic budget cuts they claimed were hurting racetrack maintenance. The San Siro track, which has also been struggling economically, had a similar incident eight months ago when another prized racehorse worth over £70,000 stumbled in a hole, ending its racing career before it had even made its debut. Investigators believe any possible sabotage was aimed at the track owner, not individual riders, as the course schedule is constantly changing. The company that operates the track, Trenno, said the race and training schedule had been temporarily suspended while the investigation continued. telegraph.co.uk Follow @telegraphnews", "external_links": [], "published": "2015-09-10T07:45:00.000+03:00", "crawled": "2015-09-10T04:36:03.810+03:00", "highlightTitle": ""}