{"organizations": [], "uuid": "be207031150338f09657992386a47ccec55c3290", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.oxfordmail.co.uk", "main_image": "http://www.oxfordmail.co.uk/resources/images/4257214/", "site_section": "http://www.oxfordmail.co.uk/life/travel/rss/", "section_title": "Oxford Mail | Travel", "url": "http://www.oxfordmail.co.uk/life/travel/13776340.A_wild_weekend_in_the_New_Forest/?ref=rss", "country": "GB", "title": "A wild weekend in the New Forest", "performance_score": 0, "site": "oxfordmail.co.uk", "participants_count": 0, "title_full": "A wild weekend in the New Forest", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T18:44:00.000+03:00", "replies_count": 0, "uuid": "be207031150338f09657992386a47ccec55c3290"}, "author": "", "url": "http://www.oxfordmail.co.uk/life/travel/13776340.A_wild_weekend_in_the_New_Forest/?ref=rss", "ord_in_thread": 0, "title": "A wild weekend in the New Forest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A wild weekend in the New Forest Canoeing on the Beaulieu river 0 comments \nThere is nothing to make that perfect weekend away just a little more perfect than stumbling on the perfect pub. \nToo often, when you need that lunchtime pick-me-up in a relaxed proper pub, you only find the kitsch fake ones. \nSo there we were. \nThe second day of a family activities weekend in the New Forest, having just spent the morning hunting each other in laser gun tag. \nA hardy lunch and refreshments were needed, and there was the Turfcutters Arms, the first turn after the Collie killing fields, in East Boldre. \nIt had just what you’d want: a lovely village garden, top ales, sturdy pub portions and even a well-lubricated local perched on the corner of the bar ready to chat with anyone. \nWhilst the weekend was about getting away for a short break with kayaking and the like, the Turfcutters Arms seemed to encapsulate the New Forest perfectly. \nIt was just authentic, relaxed and relaxing. \nWe managed to pack in three decent activities over the course of two days, a fine evening meal and said-lunchtime pub refresher in just two days. \nThe New Forest is comparatively close, just a dash down the A34 , M3, M27 and turn left. \nYour plans can be catered for by New Forest Activities, a company with a number of venues in and around Beaulieu. Promoted stories \nThe first afternoon saw our inner Robin Hood coming out, as we tried our hand at archery. \nIt was expected to be a flop but all in all there was some considerable success. \nNo bulls-eyes, admittedly, but everyone did walk away with both eyes intact. \nAn hour-and-a-half might sound a little long but the instructor kept changing up the rules to keep it interesting, with the hardest challenge being to try to skewer a cut-out of a Simpsons cartoon character (sorry for the new earring hole, Homer). \nBattlefield Live, the laser tag game, was the undoubted highlight. \nAgain there was some doubt about surviving two hours charging around a forest setting but the time flew by. \nAbout 20 people had turned up and we were soon split into two groups. \nOr elite fighting commandos, to be more accurate. \nAnd despite being pitched in with complete strangers, you soon bond into a unit as you hunt through the trees for the enemy or the electronic box you have to capture, dodging the opposition – or evildoers to be fair – to prevent them killing you off. \nIt is remarkable how you’re prepared to start dishing out head shots to loved ones within about five minutes of donning camouflage gear and crouching behind bracken. \nIt’s the young ones you have to watch, as they sneak up and kill you off. \nMy eight-year-old Alex was delighted with one particular kill as he bravely strolled through the battle zone and zapped his dear old dad. \nAfter that lunch and a pint, what could be more sedate than a canoe trip up the Beaulieu river? \nTo be honest, the pace might have been sedate but the effort needed was not far off charging around the bush with a gun for two hours. \nUnder expert guidance, you slip-off in a (very stable) Canadian canoe and paddle your way up the Beaulieu, taking in the sights. Dylan Collie tries his hand at archery \nAgain, despite the best intentions, the competitive spirit does kick in and you find yourself carving out deeper and faster strokes just to keep ahead of the rest of the canoes. \nAccommodation is varied within the New Forest, from staying in tents through to top hotels. \nWe stayed in the Forest Lodge hotel, in Lyndhurst, a lovely Georgian property boasting a swimming pool and a divine restaurant. \nLyndhurst itself can be more widely known as a very tricky traffic bottleneck in the middle of the New Forest. \nBut it is worth spending a summer evening stroll in, dipping in and out of the shops with a tasty New Forest ice cream in hand. \nAnd that is the key to the New Forest. \nYou can choose to be as active or relaxed as you want. \nSwitching from sharing an ice cream... to gunning down your relatives in just a matter of a few minutes. \nTHE FACTS \nNew Forest Activities, based in Beaulieu offers kayaking, canoeing, archery, bicycle hire, rope courses, laser gun combat, forage walks and bush craft sessions.", "external_links": [], "published": "2015-09-22T18:44:00.000+03:00", "crawled": "2015-09-23T01:40:46.728+03:00", "highlightTitle": ""}