{"organizations": [], "uuid": "c6d936e50c119c3addca189fde586b5c6e9b20e2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30058453/scientific-games-receives-world-lottery-association-responsible-gaming-framework-certificate-of-alignment-for-lottery-suppliers", "country": "US", "title": "Scientific Games Receives World Lottery Association Responsible Gaming Framework Certificate of Alignment for Lottery Suppliers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Scientific Games Receives World Lottery Association Responsible Gaming Framework Certificate of Alignment for Lottery Suppliers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "c6d936e50c119c3addca189fde586b5c6e9b20e2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30058453/scientific-games-receives-world-lottery-association-responsible-gaming-framework-certificate-of-alignment-for-lottery-suppliers", "ord_in_thread": 0, "title": "Scientific Games Receives World Lottery Association Responsible Gaming Framework Certificate of Alignment for Lottery Suppliers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Scientific Games Corporation\nLAS VEGAS and ATLANTA , Sept. 17, Scientific Games Corporation (NASDAQ: SGMS) (\"Scientific Games\" or the \"Company\") today announced that the Company has received the World Lottery Association's (WLA) Responsible Gaming Framework Certificate of Alignment. The certification recognizes that Scientific Games has been granted accreditation by WLA in accordance with the criteria set in the Responsible Gaming Certification Standards for associate members. Scientific Games, a leading supplier to the global lottery and gaming industry, was invited by WLA in 2012 to help develop the pilot supplier Corporate Social Responsibility (CSR) certification, which features Responsible Gaming Standards as the first component.\nSimone Harrison , Senior Vice President, Lottery for Scientific Games, said, \"Scientific Games is honored to have played a role in establishing the WLA CSR certification standards based on our global best practices and more than 40 years of experience serving the lottery industry. Most importantly, we are honored to achieve the Responsible Gaming certification. As one of the industry's major suppliers, we have a responsibility to all stakeholders: our business partners, our employees, our lottery customers, lottery retailers and consumers to ensure the development of secure and quality products. We recognize that suppliers in our industry should help our customers address the small percentage of players who are adversely affected by problem gambling.\"\nThe WLA Responsible Gaming Standard is made up of eight areas, including employee program, product and service development, research, advertising and marketing communications, remote gaming environment, client awareness, stakeholder engagement, and reporting. The Responsible Gaming framework encourages and improves communication between lotteries and their suppliers.\n\"Scientific Games aligns closely with our lottery customers' business practices and overall mission to responsibly drive revenue to maximize proceeds to their good causes. Stakeholder engagement is paramount to the success of any Responsible Gaming program, and the WLA framework successfully educates and informs everyone in the industry about Responsible Gaming,\" said Harrison.\nScientific Games received a third party appraisal performed by Corporate Citizenship, a WLA-approved assessor that provided a comprehensive, knowledgeable and unbiased assessment of the Company's lottery operations and completed a Statement of Alignment reflecting compliance with WLA Responsible Gaming Standards for Associate Members.\nScientific Games develops and provides products and services to more than 150 lotteries in 50 countries around the world. The Company will continue to monitor for best practices in the area of responsible gaming, assess its Responsible Gaming program on a regular basis as well as review the guidance of government regulators, research conducted by the gaming industry and its own global knowledge and experience gained by supplying the lottery industry since 1973. Scientific Games will seek recertification to the WLA Responsible Gaming standard in 2018.\nAbout Scientific Games\nScientific Games Corporation (NASDAQ: SGMS) is a leading developer of technology-based products and services and associated content for worldwide gaming, lottery and interactive markets. The Company's portfolio includes gaming machines, game content and systems; table games products and utilities; instant and draw-based lottery games; server-based lottery and gaming systems; sports betting technology; loyalty and rewards programs; and interactive content and services. For more information, please visit www.scientificgames.com\nCompany Contacts\nInvestor Relations:\nBill Pfund (702) 532-7663\nMedia Relations:\nMollie Cole (773) 961-1194\nLottery Communications:\nTherese Minella (770) 825-4219\nForward-Looking Statements\nIn this press release, Scientific Games makes \"forward-looking statements\" within the meaning of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements describe future expectations, plans, results or strategies and can often be identified by the use of terminology such as \"may,\" \"will,\" \"estimate,\" \"intend,\" \"plan,\" \"continue,\" \"believe,\" \"expect,\" \"anticipate,\" \"target,\" \"should,\" \"could,\" \"potential,\" \"opportunity,\" \"goal,\" or similar terminology. These statements are based upon management's current expectations, assumptions and estimates and are not guarantees of timing, future results or performance. Actual results may differ materially from those contemplated in these statements due to a variety of risks and uncertainties and other factors, including, among other things: competition; U.S. and international economic and industry conditions, including declines in or slow growth of lottery retail sales or gross gaming revenues, reductions in or constraints on capital spending by gaming or lottery operators and bankruptcies of, or credit risk relating to, customers; limited growth from new gaming jurisdictions, slow addition of casinos in existing jurisdictions and declines in the replacement cycle of existing gaming machines; ownership changes and consolidation in the casino industry; opposition to legalized gaming or the expansion thereof; ability to adapt to, and offer products that keep pace with, evolving technology; ability to develop successful gaming concepts and content; laws and government regulations, including those relating to gaming licenses and environmental laws; inability to identify and capitalize on trends and changes in the gaming and lottery industries, including the expansion of interactive gaming; dependence upon key providers in our social gaming business; retention and renewal of existing contracts or entry into new or revised contracts; level of our indebtedness, higher interest rates, availability and adequacy of cash flows and liquidity to satisfy obligations or future needs, and restrictions and covenants in our debt agreements; protection of our intellectual property, ability to license third party intellectual property, and the intellectual property rights of others; security and integrity of our software and systems and reliance on or failures in our information technology systems; natural events that disrupt our operations or those of our customers, suppliers or regulators; inability to benefit from, and risks associated with, strategic equity investments and relationships, including (i) the inability of our joint venture to meet the net income targets or otherwise to realize the anticipated benefits under its private management agreement with the Illinois lottery (or in connection with any termination thereof), (ii) the inability of our joint venture to meet the net income targets or other requirements under its agreement to provide marketing and sales services to the New Jersey lottery or otherwise to realize the anticipated benefits under such agreement and (iii) failure to realize the anticipated benefits related to the award to our consortium of an instant lottery game concession in Greece ; failure to achieve the intended benefits of the Bally acquisition or the WMS acquisition, including due to the inability to successfully integrate such acquisitions or realize synergies in the anticipated amounts or within the contemplated timeframes or cost expectations, or at all; litigation relating to the Bally acquisition; disruption of our current plans and operations in connection with the Bally acquisition and the WMS acquisition (including in connection with the integration of Bally and WMS), including departure of key personnel or inability to recruit additional qualified personnel or maintain relationships with customers, suppliers or other third parties; costs, charges and expenses relating to the Bally acquisition and the WMS acquisition; inability to complete or successfully integrate future acquisitions; incurrence of restructuring costs, revenue recognition standards and impairment or asset write-down charges; fluctuations in our results due to seasonality and other factors; dependence on suppliers and manufacturers; risks relating to foreign operations, including fluctuations in foreign currency exchange rates and restrictions on the payment of dividends from earnings, restrictions on the import of products and financial instability, including the potential impact to our instant lottery game concession or VLT lease arrangements resulting from the recent economic and political conditions in Greece ; dependence on our key employees; litigation and other liabilities relating to our business, including risks relating to product defects or other claims relating to products; influence of certain stockholders; and stock price volatility.\nAdditional information regarding risks, uncertainties and other factors that could cause actual results to differ materially from those contemplated in forward-looking statements is included from time to time in our filings with the SEC, including the Company's current reports on Form 8-K, quarterly reports on Form 10-Q and its latest annual report on Form 10-K filed with the SEC on March 17, 2015 (including under the headings \"Forward Looking Statements\" and \"Risk Factors\"). Forward-looking statements speak only as of the date they are made and, except for Scientific Games' ongoing obligations under the U.S. federal securities laws, Scientific Games undertakes no obligation to publicly update any forward-looking statements whether as a result of new information, future events or otherwise.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/scientific-games-receives-world-lottery-association-responsible-gaming-framework-certificate-of-alignment-for-lottery-suppliers-300145024.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/scientific-games-receives-world-lottery-association-responsible-gaming-framework-certificate-of-alignment-for-lottery-suppliers-300145024.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY05011&Transmission_Id=201509171730PR_NEWS_USPR_____NY05011&DateId=20150917", "http://www.xmlnews.org/ns/", "http://www.scientificgames.com/"], "published": "2015-09-17T03:00:00.000+03:00", "crawled": "2015-09-18T02:06:09.725+03:00", "highlightTitle": ""}