{"organizations": [], "uuid": "36e56968b14d1ddb2177820f231295ef6a1abb50", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30087743/chrysler-brand-celebrates-90-years-of-style-engineering-innovation-and-groundbreaking-products", "country": "US", "title": "Chrysler Brand Celebrates 90 Years of Style, Engineering Innovation and Groundbreaking Products", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Chrysler Brand Celebrates 90 Years of Style, Engineering Innovation and Groundbreaking Products - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "36e56968b14d1ddb2177820f231295ef6a1abb50"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30087743/chrysler-brand-celebrates-90-years-of-style-engineering-innovation-and-groundbreaking-products", "ord_in_thread": 0, "title": "Chrysler Brand Celebrates 90 Years of Style, Engineering Innovation and Groundbreaking Products", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " FCA US LLC\nAUBURN HILLS, Mich. , Sept. 22, 2015 /PRNewswire/ -- Chrysler Six, Airflow, Imperial, New Yorker, 300 and Town & Country are just some of the nameplates that mark the rich history of the Chrysler brand.\n2015 marks the 90 th anniversary of Chrysler, which was founded on June 6, 1925 , by Walter P. Chrysler . Chrysler represents more than a brand – it symbolizes the people behind the products, and the influence of its founder can still be felt today.\nWalter P. Chrysler built a company and a brand that wasn't afraid to push the limits and think outside of the box. In 1925, when he realized his dream of creating his own company, he dedicated the company's efforts to excellence in engineering, while building affordable, luxurious cars at a price consumers could afford. That tradition continues today.\nThrough the last 90 years, Chrysler vehicles were known for innovative engineering, groundbreaking style and \"looking more expensive than they were,\" the forerunner to affordable luxury.\n1920s – The first Chrysler branded vehicle was born as part of Maxwell Motors: the Chrysler Six. Walter P. Chrysler was Chairman of Maxwell Motors prior to establishing Chrysler Corporation in June 1925 . Priced at $1,565 , the light, powerful vehicle had a groundbreaking L-head six-cylinder engine and four-wheel hydraulic brakes, an uncommon feature in the 1920s. Additional Chrysler Six features included tubular front axles, full pressure lubrication, aluminum pistons, replaceable oil and air filters, shock absorbers and indirect interior lighting.\n1925-1930 – Early Chrysler vehicles provided style and power, but were also affordable, which contributed to the brand's rapid success. Early models were named after their top speed: the Chrysler 58 had a top speed of 58 miles per hour (mph); a Chrysler 72 could go a max 72 mph and so on. In 1926, Chrysler introduced a more powerful and costly Imperial model, giving Chrysler a response to Cadillac, Packard and Peerless. The Imperials offered prestige as a top-of-the-line Chrysler. Chrysler production in the late 1920s focused on both four- and six-cylinder powered vehicles.\n1930s – The 1930s brought the Great Depression in the United States and technology took hold in the automotive industry. Chrysler survived the Great Depression with stylish, economically priced cars and its reputation for practical, advanced engineering. Beginning in 1931, Chrysler introduced a number of engineering feats. Chrysler took \"Floating Power,\" a two-point mounting system strategically placed so the engine's natural rocking axis would intersect with its center of gravity, keeping the engine's natural vibration from reaching the frame and body, and improved it with rubber engine mounts, which further reduced engine vibration in the body. By the 1932 model year, all Chrysler models featured Floating Power. Industry firsts also featured on Chrysler products in the 1930s included a downdraft carburetor, automatic spark control and rustproofed, welded steel bodies.\nThe most groundbreaking vehicle from the 1930s was the Chrysler Airflow. Carl Breer was inspired by a squadron of Army Air Corps planes flying overhead in the late '20s. Pushing the boundaries of design, aircraft design principles were used for the development of the vehicle, along with inspiration from pilot Orville Wright , with whom Breer consulted. Chrysler constructed a wind tunnel at their Highland Park, Michigan , headquarters during the development of the Airflow. As the design team developed early prototypes, they learned about aerodynamics as they worked. They built at least 10 full-size semi-streamliners during development. Wind tunnel testing inspired the modified teardrop shape. The body sported a short, curved nose with faired-in headlamps, and the engine sat 20 inches farther back than was normal for the time.\nChrysler shocked the industry with a vehicle that represented future design and engineering advances when it introduced the Chrysler Airflow in 1934. The Airflow was an \"engineer's\" car with impressive innovations at the time. A beam-and-truss body gave great strength but weighed less than expected, through a tighter interlocking method of blending body and chassis. Body panels extended below the frame and all passengers sat within the wheelbase. The engine reached past the front axle, enabling a smooth ride to rear-seat passengers. Automatic overdrive was introduced with both the Chrysler and DeSoto Airflows. For maximum passenger comfort, the Airflow seats were stretched to 50 inches, the widest in the industry.\nThe 1934 Imperial Airflow set 72 national speed records and recorded 95.7 mph in the flying mile at Bonneville.\nWhile the Airflow was an engineering success, it was a car too far ahead of its time and was a retail failure. Yet, just a few years later, many of the cars being produced looked similar to the Airflow. While people flocked to see the vehicle when it was introduced because it was new and distinct, it didn't translate to sales at the time. Today, the Airflow is considered one of the most significant industrial designs ever. It launched streamlined, modern shaping into the automotive world, as well as signaled an end to what was the traditional body construction and engine placement.\nIn the late 1930s, Chrysler made significant steps in transmissions with the introduction of \"Fluid Drive.\" The new gearbox design eliminated a lot of shifting required in transmission designs of the era and was a precursor to the modern automatic transmission. A fluid coupling was mounted in tandem with the conventional clutch, allowing slippage between the engine and transmission when the latter was in gear, allowing the driver to start in high gear if he chose, or the driver could shift gears the traditional way.\nChrysler developed the \"Superfinish\" method of mirror-finishing engine and chassis components, which set a new benchmark for bearing smoothness and helped minimize friction.\nNotable vehicles that debuted in this period were the New Yorker and the Town & Country.\n1940s – The Chrysler Thunderbolt was introduced in 1940.\nWalter P. Chrysler , founder of the company and the brand, died in August 1940 .\nThe early 1940s saw the development of the \"Vacamatic,\" a four-speed gearbox with two ranges. The driver used the clutch in the normal way by selecting either a Low (1-2) or High (3-4) range. Most driving could be done in high. While not a true automatic, it satisfied many buyers in the '40s and '50s.\nThe shapely, wood-bodied Chrysler Town & Country sedans and wagons were part of the smoother look for Chrysler products, with signature grille bars that wrapped around the front fenders.\nChrysler, like many automakers, geared up for war production after the start of the 1942 model year and halted civilian production of automobiles in February 1942 . Among the better known of Chrysler's World War II products were the M-4 Sherman tank, \"Sea Mule\" marine tugs, Harbor Utility Tugs (HUTs) and Chrysler-Bell air raid sirens.\nThe government authorized civilian auto production to begin in July 1945 and gas rationing ended in August 1945 . Chrysler resumed production of civilian vehicles in December 1945 .\nThe late 1940s saw the wood-bodied Town & Country sedans and the graceful and beautiful Town & Country convertibles draw the interest of celebrities, which began to spark interest in the full line of Chrysler vehicles.\n1950s – 1951 was the birth of what would be one of the most recognized, powerful engines in the automotive industry, the hemispheric-head V-8 engine, otherwise known as the HEMI®. Initially installed in the Chrysler Saratoga, New Yorker and Imperial, the HEMI operated with exceptional volumetric efficiency and delivered truly thrilling performance for its day. The engine's lower compression ratio also let the HEMI run on lower octane fuel than most V-8s at the time.\nIn 1955, the first muscle car, the Chrysler 300, was introduced. The hardtop contained a 300-horsepower HEMI V-8 with solid valve lifters and dual four-barrel carburetors, the most powerful full-size car in the world. A tight, competition suspension made the big Chrysler handle as well as it accelerated. The new Chrysler 300 would dominate NASCAR racing with the Kiekhaefer Mercury Outboard Racing team and driver Tim Flock . The Kiekhaefer team would win 20 of its 40 NASCAR races.\nHighway Hi-Fi from CBS debuted in 1956 and featured a compact phonograph mounted under the dash with sound that came from regular speakers.\nVirgil Exner took over Chrysler design in the early 1950s, with his \"Forward Look\" styling debuting in 1955. Exner's new styling language featured a flat hood, light, airy roof and soaring tailfins.\nIn 1957, Chrysler Corporation's entire line of cars was awarded Motor Trend's \"Car of the Year\" award, and Exner and his team received the Gold Medal from the Industrial Design Institute.\n1957 saw the introduction of torsion-bar front suspension, which delivered superior handling and allowed for much lower bodies. Chrysler also introduced the first rear-window defogger and child-guard rear door locks on its vehicles. In addition, the push-button TorqueFlite transmission with three speeds was offered. The three speeds allowed for better fuel economy and the TorqueFlite quickly earned a reputation as the industry's best automatic transmission. In 1957, Chrysler Corporation products took first place in every class of the Mobil Economy Run.\nIn 1958, a Chrysler 300-D set a land speed record at Bonneville at 156.387 mph.\n1960s – The brand continued to produce \"style and speed\" with the 300 J, as well as \"affordable luxury\" with the Newport line and the New Yorker.\nThe 1960s brought the move of all of Chrysler's cars to unibody construction, rather than body-on-frame construction. Unibody construction is lighter, which helps to improve performance and fuel economy, and it is also designed to dissipate energy in a crash by enabling the frame to crumple and bend in specific ways, which allows the kinetic energy to travel through the car's body, around the passenger compartment.\nChrysler began testing its gas turbine cars, producing 50 fourth-generation turbine-powered cars to be tested by consumer representatives all over the U.S. beginning in 1962. 1962 also marked the end of the Windsor nameplate, which was replaced with a non-letter 300. In the letter series, the Chrysler 300-H debuted in 1962.\nIn 1963, Chrysler shook up the automotive industry by offering a five-year, 100,000-mile powertrain warranty – the first of its kind in the industry.\nThe late '60s birthed the muscle car era, as well as a redesign of the big cars. Elwood Engel , the head of Chrysler design, went to a squarish but smooth exterior look highlighted by his trademark bright metal fender edging. Cleanly swept fenders ran in an unbroken front-to-rear line and a conventional column-mounted shifter replaced the push button controls inside for the TorqueFlite automatic transmission. Full-size cars could get the biggest V-8 to date, a 440-cubic-inch engine, and Chrysler issued the last of its 300 letter series cars, the 300-L in 1965, but production of the non-letter series 300s continued.\n1968 brought the availability of rear washer/wiper for Chrysler wagons.\n1969 debuted the new \"fuselage styled\" Chryslers, which were larger than the models they replaced.\n1970s – The muscle car era came to an end as a result of stricter emissions and safety rules, rising insurance rates and a trend toward less expensive vehicles.\nElectronic ignition is standard on all Chrysler vehicles in 1973, 5 mph front crash bumpers and 2½ mph rear crash bumpers are mandated and anti-theft devices operate the horn and lights.\nWith the 1973 oil embargo and fuel shortages, Chrysler had to shift its focus to production of mid-size and small vehicles.\n1975 was the debut of the new Chrysler Cordoba, and Hollywood actor Ricardo Montalban took TV by storm as the pitchman for the vehicle. The Cordoba was billed as the new small Chrysler and a personal luxury coupe. It was the smallest post-World War II Chrysler built to date.\nA new \"fuel pacer\" option debuted on 1975 models to warn drivers when they hit the gas pedal too hard.\nIn 1977, Chrysler and Calspan jointly develop a Research Safety vehicle that featured a reinforced body structure, soft elements, run-flat tires and a driver's side airbag. 1977 also marked the last of Chrysler's turbine concept cars, the LeBaron Turbine Special, which featured knife-edge-shaped front fenders and headlamps hidden behind huge doors.\nNovember 1978 , Lee Iacocca is named President of Chrysler Corporation.\n1980s – A financial crisis forced the brand to return to the basics.\nIn 1981, the Chrysler Imperial received a makeover to be one of the most distinctive cars of the year with hidden headlamps, knife-edge fenders and a unique \"bustleback\" rear end. Each car got a 5.5-mile road test at the assembly plant before it was delivered to the dealer.\nThe K-car platform was introduced by the company in 1981.\n1982 brought the debut of the Chrysler brand K-car, the all-new front-wheel-drive Chrysler LeBaron. 1982 also saw the debut of the LeBaron Town & Country \"woody\" wagon, as well as a LeBaron convertible, the first convertible from Chrysler in a decade.\nChrysler Corporation introduced an entirely new vehicle segment in 1984 that revolutionized the automotive industry, the minivan, a front-wheel-drive compact van that was garagable, and provided easy entry and exit for drivers and passengers.\nChrysler acquired Lamborghini and debuted the Chrysler Portofino concept vehicle at the Frankfurt Motor Show in 1987.\n1990s – All Chrysler products are now front-wheel drive, and all Chrysler 1990 models offer a driver's side airbag as standard equipment, leading the industry with this emerging safety technology.\nThe 1990 model year brought the introduction of the world's first luxury minivan, the Chrysler Town & Country. It sported imitation wood paneling and luxury accommodations and other features typically not found on a minivan at the time.\nWith more than 75 minivan and industry innovations and more than 275 awards worldwide, the Chrysler minivan forever changed the automotive world. Even today, nothing moves people and things better than a minivan for the price of the vehicle: seating for seven, flat cargo load floor that can hold an 8-foot sheet of plywood with the Stow 'n Go seats stored in the floor, excellent fuel economy and a variety of price points make the minivan the best people mover in the marketplace. Integrated child safety seats were available in the Town & Country minivan in 1992, an industry first.\nIn 1993, the front-wheel-drive LH-body Concorde sedan debuted. The Concorde was larger than a mid-size sedan, but smaller than a full-size sedan. The Concorde featured the new \"cab forward\" design where the windshield was pushed forward and the wheels were located much closer to the corners of the car than was normal at the time, creating more interior cabin space for passengers.\nThe Chrysler Cirrus mid-size sedan debuted the cab forward design when it entered the market in 1995. The Cirrus also debuted simple but significant details like an easy-to-remove battery and, for the first time, ashtrays were not standard equipment, they were an option.\n1996 ushered in the debut of the third-generation minivan. The big news was the availability of a second sliding door for the passenger side and Easy-Out roller seats, both industry firsts.\nThe 300 nameplate returned to the Chrysler lineup in 1999 with the introduction of the 300M. Based on a 10-inch shortened version of the Concorde and LHS, it was designed for European export in mind. The Chrysler 300M was the first in the series to be powered by a front-wheel drive six-cylinder engine. Meant to be a modern interpretation of the 300 series, the 3.5-liter, 253-horsepower 300M offered a balance of performance, handling and fuel efficiency. The 300M sedan would be named Motor Trend's \"Car of the Year\" in 1999.\n2000s – With the merger of the Daimler and Chrysler companies, Chrysler continued to develop cars that people wanted, as well as taking a page from the minivan playbook by inventing vehicles that created new segments in the marketplace.\nIn 2001, the Chrysler Town & Country debuted the fourth generation of the minivan with an industry-first power liftgate. The Town & Country also featured power sliding doors with industry-first opening direction obstacle detection and in-door motors.\nThe PT Cruiser sedan also joined the Chrysler family in 2001, and was named Motor Trend's \"Car of the Year.\" The too-cool-to-categorize PT Cruiser added a soft-top option in 2005 with the Chrysler PT Cruiser Convertible, the latest in a long line of factory-backed customizations for the vehicle.\nThe Chrysler Pacifica debuted in 2004 as a \"Sports Tourer,\" the forerunner to the now popular crossover segment. The Pacifica was a segment buster with the flexibility and safety of a minivan, the capability of an SUV, but the style and refinement of a luxury sedan. With three-row \"2+2+2\" seating and front- or all-wheel-drive capability, the Pacifica was a stylish alternative for drivers who wanted flexibility and capability with luxury amenities.\nThe introduction of the 2005 Chrysler 300 series marked a return to rear-wheel drive and included the 5.7-liter HEMI-powered 300C model with 345 horsepower. The new 300 was named \"Car of the Year\" by Motor Trend . Adding even more performance to the lineup, the 425-horsepower Chrysler 300C SRT8 featured a 6.1-liter HEMI engine, four-piston Brembo brakes, performance styling, suspension and exhaust, and was capable of 0-60 mph times in the low 5-second range. Additional models within the 2005 to 2010 model year span included all-wheel-drive versions, the \"blacked out\" 300S, the 300C and 300C SRT8 Touring models (outside of North America ) and the 300 \"DUB\" edition with standard 20-inch wheels.\n2005 also saw the debut of a new Chrysler Town & Country minivan, which offered a revolutionary new feature, the Stow 'n Go seating and storage system. The system featured industry-first, fold-in-the-floor, second- and third-row seats for a completely flat load floor that could still accommodate an 8-foot sheet of plywood, still an exclusive in the industry.\nThe fifth-generation Chrysler Town & Country minivan made its debut in the 2008 model year with 35 new or improved features for the \"family room on wheels,\" including the Swivel 'n Go seating system. Swivel 'n Go featured second-row seats that swiveled 180 degrees to face the third row and included a removable table that installed between the second and third row, along with covered storage bins in the second row. The 2008 Chrysler Town & Country also offered an integrated child booster seat in the second-row quad captain's chairs, which was an industry first, and a minivan exclusive one-touch power-folding, third-row, 60/40 bench seat.\n2010s – The Chrysler brand, after emerging from bankruptcy and now a part of Fiat Chrysler, continues to engineer excellence with an entirely all-new lineup of vehicles in the pipeline.\nIn May 2014 , as part of the FCA US LLC five-year plan, Chrysler brand refocused it efforts and returned to the founding principles of Walter P. Chrysler : a mass-market brand that delivers innovative engineering, groundbreaking style and most important, all of this at a very attainable price. Chrysler products today are a value proposition that Walter P. would be proud of.\nWith these principles in mind, Chrysler debuted the all-new-from-the-ground-up Chrysler 200 mid-size sedan in 2014 as a 2015 model-year vehicle. The first mid-size sedan to offer a nine-speed automatic transmission as standard equipment, the 200 brought a number of features into the mid-size segment that were previously only seen on luxury cars. Advanced safety and security features, including Forward Collision Warning-Plus with crash mitigation, Lane Departure Warning with Lane Keep Assist, Parallel and Perpendicular Park Assist and available luxury amenities, including heated steering wheel, heated and ventilated seats, premium leather interiors with real wood trim, handsfree phone and navigation, state-of-the-art all-wheel-drive system with a segment-first disconnecting rear axle for improved fuel economy and much more.\nWith roots that include the breakthrough 1955 and 2005 models, Chrysler debuted the new Chrysler 300 in 2015. It takes the nameplate's bold style and sophistication to new levels and highlights six decades of ambitious American ingenuity through iconic design proportions and inspired materials, world-class quality and craftsmanship, best-in-class 31 mpg highway fuel economy, plus class-exclusive innovations, including a state-of-the-art TorqueFlite eight-speed transmission now standard on every model, the segment's most advanced all-wheel-drive system, award-winning Uconnect Access services, all-new and segment-exclusive 7-inch full color driver information display and the newest generation Uconnect systems.\nThe Chrysler story continues in the second half of the decade with the introduction of an all-new Chrysler Town & Country minivan. The highly anticipated next generation of the minivan will make its debut in the first quarter of 2016.\nAbout Chrysler Brand\nThe Chrysler brand has delighted customers with distinctive designs, craftsmanship, intuitive innovation and technology all at an extraordinary value since the company was founded in 1926.\nWhether it is the groundbreaking, bold design of the Chrysler 300, the simple elegance and extraordinary driving experience of the all-new 2015 Chrysler 200 or the family-room-on-wheels functionality of the Chrysler Town & Country, Chrysler brand vehicles reward the passion, creativity and sense of accomplishment of its owners. Beyond just exceptionally designed vehicles, the Chrysler brand has incorporated thoughtful features into all of its products, such as the innovative center console with pass through storage and sliding cup holders in the 2015 Chrysler 200, the industry-exclusive Stow 'n Go® seating and storage system on the Chrysler Town & Country and the fuel-saving Fuel Saver Technology in the Chrysler 300.\nThe Chrysler brand's succession of innovative product introductions continues to solidify the brand's standing as the leader in design, engineering and value. The premium for the Chrysler brand is in the product, not the price.\nFollow Chrysler brand and FCA US news and video on:\nFCA Content On Demand (COD): www.fcacod.com\nCompany blog: http://blog.fcanorthamerica.com\nCompany website: www.fcanorthamerica.com\nMedia website: http://media.fcanorthamerica.com\nFCA360: www.fca360.com\nChrysler brand: www.chrysler.com\nChrysler blog: blog.chrysler.com\nFacebook: www.facebook.com/chrysler or www.facebook.com/ChryslerGroup\nFlickr: www.flickr.com/chryslerautos or www.flickr.com/chryslergroup/\nPinterest: www.pinterest.com/chryslerautos or www.pinterest.com/FCAcorporate\nInstagram: www.instagram.com/chryslerautos or www.instagram.com/FCAcorporate\nStreetfire: www.streetfire.net/uploaded/chryslervideo.htm\nTwitter: www.twitter.com/chryslerautos or www.twitter.com/FCAcorporate\nYouTube: www.youtube.com/chrysler or www.youtube.com/pentastarvideo\n releases/chrysler-brand-celebrates-90-years-of-style-engineering-innovation-and-groundbreaking-products-300146969.html\n ", "external_links": ["http://media.fcanorthamerica.com/", "http://blog.fcanorthamerica.com/", "http://www.fcanorthamerica.com/", "http://www.xmlnews.org/ns/", "http://www.pinterest.com/chryslerautos", "http://www.pinterest.com/FCAcorporate", "http://www.instagram.com/FCAcorporate", "http://www.youtube.com/pentastarvideo", "http://rt.prnewswire.com/rt.gif?NewsItemId=DE07513&Transmission_Id=201509221000PR_NEWS_USPR_____DE07513&DateId=20150922", "http://www.youtube.com/chrysler", "http://www.twitter.com/chryslerautos", "http://www.fcacod.com/", "http://www.prnewswire.com/news-releases/chrysler-brand-celebrates-90-years-of-style-engineering-innovation-and-groundbreaking-products-300146969.html", "http://www.chrysler.com/", "http://www.twitter.com/FCAcorporate", "http://www.streetfire.net/uploaded/chryslervideo.htm", "http://www.fca360.com/", "http://blog.chrysler.com/", "http://www.instagram.com/chryslerautos", "http://www.facebook.com/chrysler", "http://www.facebook.com/ChryslerGroup"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T19:30:57.195+03:00", "highlightTitle": ""}