{"organizations": [], "uuid": "cc6d7e591ffde293d1d173666c11e2c73455ef85", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2014/08/140819trash01.jpg", "site_section": "http://www.ticotimes.net/categories/topics/science-and-technology", "section_title": "Science and Tech Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/09/01/nearly-all-seabirds-will-have-ingested-plastic-by-2050", "country": "US", "title": "Nearly all seabirds will have ingested plastic by 2050", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Nearly all seabirds will have ingested plastic by 2050 -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T23:19:00.000+03:00", "replies_count": 0, "uuid": "cc6d7e591ffde293d1d173666c11e2c73455ef85"}, "author": "AFP", "url": "http://www.ticotimes.net/2015/09/01/nearly-all-seabirds-will-have-ingested-plastic-by-2050", "ord_in_thread": 0, "title": "Nearly all seabirds will have ingested plastic by 2050", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MIAMI, Florida — Most seabirds have already eaten plastic in the oceans, and scientists projected Monday that 99 percent will have done so by 2050.\nPlastics are pervasive in the world’s waters due to pollution, and birds — including albatrosses, penguins and gulls — can mistake brightly colored bottle tops or other fragments for food.\nBirds can become sick and die if they ingest too much plastic .\nResearchers reviewed studies on 135 bird species between 1962 and 2012, then made projections based on the currently known level of plastics in the oceans.\n“For the first time, we have a global prediction of how wide-reaching plastic impacts may be on marine species — and the results are striking,” said Chris Wilcox, senior research scientist at Australia’s Commonwealth Scientific and Industrial Research Organization (CSIRO).\n“We predict, using historical observations, that 90 percent of individual seabirds have eaten plastic . This is a huge amount and really points to the ubiquity of plastic pollution.”\nWatch a trailer for the documentary Midway (still in production), about a remote island inhabited by albatrosses, many of whose bodies are filled with plastic.\nResearch done in the early 1960s showed that, back then, less than five percent of seabirds had ingested plastic .\nBut that number has soared in recent decades, reaching 80 percent in 2010, with even more birds likely to be affected in years to come, the study found.\n“We predict that plastics ingestion is increasing in seabirds, that it will reach 99 percent of all species by 2050, and that effective waste management can reduce this threat,” said the study in the Proceedings of the National Academy of Sciences (PNAS), a peer-reviewed U.S. journal.\nWATCH: Researchers remove plastic straw from sea turtle’s nose\nEver since commercial plastic production began in the 1950s, production has doubled every 11 years, according to background information in the article.\n“Thus, between 2015 and 2026, we will make as much plastic as has been made since production began,” said the study.\nScientists have documented concentrations of up to 580,000 plastic pieces per square kilometer in the world’s oceans.\nBut the full extent of plastics’ impact on birds is not yet known.\n“Although evidence of population level impacts from plastic pollution is still emerging, our results suggest that this threat is geographically widespread, pervasive, and rapidly increasing,” said the study.\nWhile coastal bird populations have received much focus from researchers, the study warned that some areas that were not previously seen as particularly dangerous may be perilous for seabirds.\n“The highest area of expected impact occurs at the Southern Ocean boundary in the Tasman Sea between Australia and New Zealand” because of the high plastic concentration and high seabird diversity in those areas, it warned.", "external_links": ["http://www.pnas.org/content/early/2015/08/27/1502108112.full.pdf?sid=0f0a231c-0f0b-473e-8c86-f0013d70d843", "http://www.csiro.au/", "https://www.youtube.com/embed/3JK3hY2oOf8?feature=oembed"], "published": "2015-09-01T23:19:00.000+03:00", "crawled": "2015-09-02T03:23:24.391+03:00", "highlightTitle": ""}