{"organizations": [], "uuid": "fad3c5ec173d586675e90481ff3b60a2fadb2fda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/Alice-Spring-and-Uluru.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-bentley-launch-in-backdrop-of-stunning-alice-spring-and-uluru/", "country": "US", "title": "New Bentley launch in backdrop of stunning Alice Spring and Uluru - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "New Bentley launch in backdrop of stunning Alice Spring and Uluru - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "fad3c5ec173d586675e90481ff3b60a2fadb2fda"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/new-bentley-launch-in-backdrop-of-stunning-alice-spring-and-uluru/", "ord_in_thread": 0, "title": "New Bentley launch in backdrop of stunning Alice Spring and Uluru - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "New Bentley launch in backdrop of stunning Alice Spring and Uluru\nThe Northern Territory will be showcased to millions of people around the world following the launch of Bentley’s new model Continental GT Speed in Central Australia.\n“The new $485,000 GT Speed Coupe W12 luxury car was unveiled and taken for a test drive on the Stuart Highway at Bond Springs, north of Alice Springs,” Chief Minister Adam Giles said.\n“This is a huge coup for the NT with the media coverage generated of the launch expected to be worth more than $2 million.\n“Bentley is a world-wide recognised luxury brand so it was a no brainer for the NT Government to partner with the company to show off its new model Continental GT Speed to the rest of the world.\n“The Central Australian outback was chosen as the launch destination over a competitive field after the company was impressed by what they saw in this year’s NT Top Gear episode, which saw host Richard Hammond drive a yellow Bentley Continental through the spectacular Northern Territory outback.\n“While the Top End was featured in the Top Gear episode, the Bentley launch is a chance for the Centre to shine.\n“Home to the majestic MacDonnell ranges, Alice Springs is the perfect adventure playground and ultimate self-drive destination and now the whole world knows it.”\nBentley News and Product Communications Manager, Mark Mustard, said they were blown away by the Northern Territory.\n“Coming from the United Kingdom, the landscapes and the colours here are like nothing we’ve ever seen before. It is truly a unique location and made for a stunning backdrop to launch our new Continental GT,” Mr Mustard said.\nAs part of the Bentley launch, the company’s travelling international media contingent took in the stunning sights and attractions on offer in both Alice Springs and Uluru. As a result, the Northern Territory is set to feature in magazine, newspapers and websites in the UK, USA, Canada, Germany and China.\nNo expense was spared on the launch with Bentley transporting a specifically designed luxury tent, manufactured in South Africa, to Bond Springs airstrip to set up a temporary base camp for the launch.\nMinister for Transport Peter Chandler said when you think of Bentley you think about superior quality and now Bentley fans will view the Northern Territory as a quality experience too.\n“The Bentley launch will raise the profile of the NT to a market of high net worth individuals and the profile of Alice Springs in particular,” Mr Chandler said.\n“This initiative is part of the Government’s plan to drive the development of North Australia and build a $2.2 billion visitor economy by 2020.”", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T20:29:20.630+03:00", "highlightTitle": ""}