{"organizations": [], "uuid": "5c5938ae9184cd1874922e0a163c826338b7153a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/09/29/idlib-syria-september-28-2015/ALTERNATES/crop_100x100/Idlib+Syria+September+28+2015", "site_section": "http://www.bdlive.co.za/life/travel", "section_title": "Travel &amp; Food | BDlive ", "url": "http://www.bdlive.co.za/world/mideast/2015/09/30/strained-relations-hamper-syria-crisis-talks", "country": "ZA", "title": "Strained relations hamper Syria crisis talks | Middle East", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "Strained relations hamper Syria crisis talks | Middle East | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T14:19:00.000+03:00", "replies_count": 0, "uuid": "5c5938ae9184cd1874922e0a163c826338b7153a"}, "author": "Margaret Talev, Ilya Arkhipov and Nicole Gaouette", "url": "http://www.bdlive.co.za/world/mideast/2015/09/30/strained-relations-hamper-syria-crisis-talks", "ord_in_thread": 0, "title": "Strained relations hamper Syria crisis talks | Middle East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A vendor sells vegetables near badly damaged buildings at a market in Ariha, Idlib province, Syria. The deteriorating situation in Syria took centre stage on the first day of the UN General Assembly. Picture: REUTERS Related articles What has Putin achieved on Syria after UN showdown? Syrian war dominates UN as strained ties hamper Obama, Putin NEWS ANALYSIS: New Russian move to form rival Mideastern coalition jolts US Obama and Putin at odds over Syria in duelling UN speeches In this article People: Vladimir Putin NEW YORK — World leaders remain divided over how to end the carnage in Syria after the first face-to-face talks between the presidents of Russia and the US ended without signs of a breakthrough.\nRussian leader Vladimir Putin, wrapping up a one-day visit to New York on Monday, said a 90-minute meeting with Barack Obama at the United Nations (UN) was \"frank\" and that \"relations between Russia and the US are unfortunately at a pretty low level\".\nWith Russia sending troops and weapons to bolster embattled President Bashar al-Assad, the deteriorating situation in Syria took centre stage on the first day of the annual UN General Assembly.\nWestern leaders differ over their willingness to co-ordinate anti-terror attacks with Syria’s government, hampering an agreement to end a conflict that has killed hundreds of thousands of people and displaced millions more.\nThe prospect of an accord on Syria had been dangled heading into this week’s UN gathering, as leaders including German Chancellor Angela Merkel and UK Prime Minister David Cameron signalled more flexibility in their stance toward Mr Assad, who they have previously said must step aside. In his speech to world leaders on Monday, Mr Obama said he was willing to co-operate on the issue, but only to a certain extent.\n\"The US is prepared to work with any nation, including Russia or Iran, to resolve the conflict,\" Mr Obama said.\n\"But we must recognise there cannot be — after so much bloodshed, so much carnage — a return to the pre-war status quo.\"\nMr Putin said the strained ties with the US, which has criticised Russia’s annexation of Crimea, should not get in the way of them working together on Syria.\nWith control of Syria divided between the government and a collection of militant Islamic groups, the two nations did at least agree that their militaries would communicate to try to avoid conflicts.\nMr Obama, who hosted a summit on countering extremism in New York on Tuesday, left the meeting without speaking to reporters. An administration official said he and Mr Putin were willing to explore a political resolution including ways to potentially bring in different parts of the Syrian opposition, but no formal mechanism was established.\nUS Secretary of State John Kerry called the meeting \"very candid\" and \"genuinely constructive\" in an interview with MSNBC on Tuesday, and said he would continue discussions today with Russian Foreign Minister Sergei Lavrov.\nMr Kerry said Mr Obama and Mr Putin agree that Syria should be unified and secular, but disagree on Mr Assad remaining in power.\n\"Violence in Syria ends once Mr Assad steps aside,\" Mr Kerry said. The Russians \"need to understand you can’t have peace unless you have Sunni buy-in\" as they represent 60% to 65% of the population. Mr Assad is of the minority Alawite sect.\nMr Cameron on Tuesday told CBS’ This Morning show Syria is \"the most difficult and intractable problem that we face\", and that Islamic State and Mr Assad’s regime must be removed from the country. He said he would work with anybody to build a Syria free of both. \"We’ll never have a secure Syria until both those things are eradicated.\"\nOne major disagreement is over backing for anti-Assad rebels, which Mr Putin said amounted to illegal support for groups he considered to be terrorists.\nTurkey and France were among nations holding firm to their position that Mr Assad should go.\n\"Turkey cannot move forward with Assad in charge,\" Prime Minister Ahmet Davutoglu said. \"Assad can’t be trusted to manage Syria’s transition to peace.\"\nWhile ruling out the use of ground troops in Syria, Mr Putin kept open the possibility of Russia joining western nations and Mr Assad’s government in co-ordinating air strikes in Syria. He said strikes under way by the US, France and Australia without the Syrian government’s authorisation were illegal.\n\"We are doing everything possible to, if not achieve a breakthrough on Syria, to avert a breakdown,\" Mr Lavrov said.\nRussia, which has set up a military centre in Baghdad to share information with Syria, Iran and Iraq, would not accept a single command structure in alliance with the US-led coalition, but proposed a co-ordinated campaign on the ground and in the air, Mr Lavrov told state-run RT television.\nMr Putin also made it clear that he thought the US and others should not be weighing in on the fate of Mr Assad, a long-time ally of Russia. He respected \"my colleagues, the US president and the French president, but I don’t think they’re Syrian citizens, so I don’t think they should be involved in deciding the future. It’s up to the Syrian people to decide that.\"\nRussia will introduce a UN Security Council resolution today backing political and military co-ordination among nations, which would also include the governments of Syria and Iran, according to a diplomat familiar with the proposal.\nFour vetoes cast by Russia and China at the Security Council have limited intervention in the crisis that erupted in 2011 after protesters demanded Mr Assad’s ousting.\nBloomberg", "external_links": [], "published": "2015-09-30T14:19:00.000+03:00", "crawled": "2015-09-30T19:46:43.960+03:00", "highlightTitle": ""}