{"organizations": [], "uuid": "688a4a56232ccf3ceee1b0b4945ed8f173770486", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "articles.economictimes.indiatimes.com", "main_image": "http://economictimes.indiatimes.com/photo/48985300.cms", "site_section": "http://economictimes.indiatimes.com/Features/ET-Travel/rssfeeds/640246854.cms", "section_title": "Travel-Magazines-The Economic Times", "url": "http://articles.economictimes.indiatimes.com/2015-09-17/news/66642504_1_barbados-sun-head-atlantis-submarine", "country": "IL", "title": "Little Britain of the Caribbean calling: Tiptoe on turquoise waters of Barbados", "performance_score": 0, "site": "indiatimes.com", "participants_count": 1, "title_full": "Little Britain of the Caribbean calling: Tiptoe on turquoise waters of Barbados - timesofindia-economictimes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T03:00:00.000+03:00", "replies_count": 0, "uuid": "688a4a56232ccf3ceee1b0b4945ed8f173770486"}, "author": "timesofindia.indiatimes.com", "url": "http://articles.economictimes.indiatimes.com/2015-09-17/news/66642504_1_barbados-sun-head-atlantis-submarine", "ord_in_thread": 0, "title": "Little Britain of the Caribbean calling: Tiptoe on turquoise waters of Barbados", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By Rashmi Hemrajani \nApart from endless nights of partying and dancing, if you are the one who enjoys active memorable holidays, then head to Barbados, try surfing, kitesurfing and enjoy long days at the beach. For your bachelor party, your friends and you can also swing to reggae while scuba diving in Jamaica . Still looking for something totally off the radar, then plan a trip to Jerusalem and soak in the history, art and delicious cuisine the city has to offer. Don't forget to share pictures and amazing stories with us on economictimestravel@gmail. com. We will be waiting...\nNATURE'S WALK \nRegion: Barbados \nTourists flock to the Barbados, Caribbean's leading tourist destinations and is also considered the most developed island in the region. Most bachelors who seeks adventure, sand and the sun head to Barbados with their friends. The city offers sun, two seas, and an indescribable richness of colour. The island abounds with exotic locations and exciting history, while the extensive variety of culture, sports and activities make Barbados the gem of the Caribbean . Onboard the Atlantis Submarine, explore a journey down 130 feet below sea level or deeper and experience one of Barbados' oldest natural artifacts — the Freshwater Bay coral reef. Tourists can enjoy wonderful beaches and watersports activities. Take a look at the popular Animal Flower Cave located in the parish of St. Lucy. The name comes from the sea anemones found in the pools of the cave.\n\nWOW FACTOR \nBeware of the sun, Barbados is said to be only 13 degrees off the Equator and tourists can get sun burnt easily. Stay hydrated and carry an umbrella to shade yourself against the sun.\n ", "external_links": [], "published": "2015-09-17T03:00:00.000+03:00", "crawled": "2015-09-22T02:50:45.311+03:00", "highlightTitle": ""}