{"organizations": [], "uuid": "317fb72cd0469806bc4f4235791db3cf1679ad51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150928Buses.jpg", "site_section": "http://www.ticotimes.net/", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel -The Tico Times", "url": "http://www.ticotimes.net/2015/09/27/la-nave-the-joys-and-mysteries-of-san-jose-buses", "country": "US", "title": "La nave: the joys and mysteries of San José buses", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "La nave: the joys and mysteries of San José buses -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T04:09:00.000+03:00", "replies_count": 0, "uuid": "317fb72cd0469806bc4f4235791db3cf1679ad51"}, "author": "Katherine Stanley", "url": "http://www.ticotimes.net/2015/09/27/la-nave-the-joys-and-mysteries-of-san-jose-buses", "ord_in_thread": 0, "title": "La nave: the joys and mysteries of San José buses", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Recommended: The amazing true story of tuanis and brete – words to be thankful for\nEvery year since I became a mom, I’ve tried to spend one month in the States with my family, reminding myself where I’m from. This year I spent that month at my parents’ new home near the water in Downeast Maine. It is a place that operates on the rhythm of the sea and the ships that travel that sea. It is a place whose native residents look out on the bay, perhaps with fondness, but also with a practicality that is lost upon the tourists who see it only as a beautiful view, or who hear in the foghorn only a cozy bit of ambiance, or who respond to rain or fog only in terms of how it affects our whale-watching plans. To those who make their lives in such a town, the sea is a determiner of fates and fortunes. Whether a ship comes into port bearing scallops or sightseers, that cargo is precious to the businesses and families ashore. You can sense that everyone is attuned to the comings and goings of the vessels, the shade of the sky.\nI don’t know what that’s like. When it comes to ships and boats and oceans, I’m the tourist all the way, admiring them from the pier with a nice hot coffee in my hand, gazing out over the water with the requisite far-off look in my eye, snuggling into my covers at night when I hear that cozy foghorn. Where I live now, my ship, my nave , is a different type of craft. It creaks and wails just as much as a wooden vessel. It plows through waves on occasion, as optimistically and ill-advisedly as a tugboat in a storm. We, too, live in its rhythms, memorize its sounds and tricks and fickle schedules. But here in San José, the nave is not a ship. It is a bus.\nCosta Ricans, looking down the street to see their bus approaching, might say, “ Allí viene la nave ” – “there comes my boat.” The first time I heard my husband say this, years ago, I was charmed, and I have thought of the city’s buses that way ever since. They might not determine our fates and fortunes, but in a place where city bus schedules are virtually nonexistent, good or bad bus luck can certainly color your whole day. Most of us don’t develop a personal relationship with a San José bus driver the way you might with taxistas , but you do come to recognize them, and when your bus pulls up just at the right moment – as you are clinging to groceries and a toddler in the pouring rain, for example – you are as grateful as a castaway boarding a luxurious cruise ship. You feel a deep, deep love for the curmudgeonly man driving the Doña Xiomara , or Jesús es mi Salvador , or whatever the painted letters on the side might proclaim.\nMy favorite bus, ridden once and never found again, was a Zapote-to-San José vessel with a huge sign inside that said “I love my wife,” with photos of this matronly personage and little felt hearts all over the windshield. There were even hearts on the ubiquitous foam coin-holder near the stick shift. I wondered whether the unsmiling driver was a secret romantic, or whether his wife had taken some precautionary measures to protect her spouse. This might have been justified, since I have been told that sometimes bus drivers attain groupies. I have yet to see a bus driver whose appearance seems to justify this status, but gustos son gustos – there’s no accounting for taste.\nBus stories tend to be less vivid than taxi stories. Rather than being thrust into close proximity and intimate conversation with one stranger, you are dipping your toes into a river of humanity in a more detached way. If Heraclitus had been a bus rider, he might have pointed out that the water in that river changes – the faces and conversations around you switch out, the buskers and the characters – but it’s always the same river. The people stand out in your bus memory not so much as individuals, but as types. The busker selling lollipops who pulls up his shirt to show the terrible scar from the surgery that has made him unfit to work. The flocks of teenagers squawking over smartphones after school gets out, an event that can take place at virtually any time of day. The neat and friendly abuelos y abuelas who always seem to forgive the sullen riders refusing to give up their seat for the elderly, or pretending to be asleep so no one will take the window seat next to them. The English-speakers who are trying to figure out the stops and count their change, or those who show quiet competence and inevitably make me wonder what brought them here.\nThen there are the captains of these unruly crews, who jostle their way through exhausting and repetitive journeys, day after day. They have their patterns, their tricks; they wave and honk at their colleagues passing by the other way. They pick up their family members or friends who hop up the back steps so as not to register on the people-counter up front, or vault right over the metal bars. They allow certain buskers while not others.\nSometimes they’ll surprise you. One driver, just the other day, stopped the bus in the middle of a busy street, got off, and disappeared. I had lived here long enough to know that he was probably picking up lunch or a snack, but I couldn’t see where he might have gone, and he was gone for a while.\n“Where is the MAN?” my daughter asked. I realized she and I were the only people on the bus. I contemplated moving up front and driving the bus on home, alone.\n“That’s a good question,” I said. “But get used to this.”\nHe returned eventually, clutching the classic Styrofoam-housed casado , and the bus groaned on up the hill.\nRiding the bus has its moments, and I can’t imagine getting to know San José without it. That said, if I never had to take a bus again, especially during a steamy rainy-season rush hour, I would be perfectly content. (My little daughter would not agree: she clearly believes that every time she steps onto one, she is entering a party at which every guest was invited for her own personal delight.) This is why I have started keeping running clothes and shoes at my office, an escape hatch on those days when the commute home seems too daunting.\nThis past Friday, photos of flooded streets in downtown San José popped up all over Twitter, causing everyone in my office a shiver of fear at the thought of the trips that awaited us. I looked out at the rain coming down, changed my clothes and shoes, wrapped my wallet and phone in plastic before stashing them in my small backpack, and headed out. I stepped into a vertical wave. I was instantly drenched to the bone. I am as slow as can be, but as I watched cars lurch out of our parking lot, I felt like the Flash. I felt like a kid.\nSquelching with every step, but faster and freer than any ship, I set out alone, swimming for shore.\nRead previous Maeology columns here .\nKatherine Stanley Obando is The Tico Times’ arts and entertainment editor. She also is a freelance writer, translator, former teacher and academic director of JumpStart Costa Rica . She lives in San José. Follow her on Twitter or visit her blog “ The Dictionary of You ,” where she writes about Costa Rican language and culture, and raising a child abroad. “Maeology” is published monthly.\nContact Katherine Stanley at kstanley@ticotimes.net", "external_links": ["https://twitter.com/kstancr", "http://dictionaryofyou.com/2014/07/06/what-ill-tell-my-daughter-about-la-sele-2014/", "http://www.jumpstartcostarica.org/"], "published": "2015-09-28T04:09:00.000+03:00", "crawled": "2015-09-28T12:10:54.662+03:00", "highlightTitle": ""}