{"organizations": [], "uuid": "f08536a8d3be08dd4750733b1d9ddee7b0014782", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "", "site_section": "http://www.ticotimes.net/categories/topics/latin-america", "section_title": "Latin America Archives - Tico Times | Costa Rica Information | Travel | Real Estate | HotelThe Tico Times", "url": "http://www.ticotimes.net/2015/09/01/guatemalan-president-faces-judgment-day-in-congress", "country": "US", "title": "Guatemalan president faces judgment day in Congress", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Guatemalan president faces judgment day in Congress -The Tico Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T00:59:00.000+03:00", "replies_count": 0, "uuid": "f08536a8d3be08dd4750733b1d9ddee7b0014782"}, "author": "Katell Abiven | AFP", "url": "http://www.ticotimes.net/2015/09/01/guatemalan-president-faces-judgment-day-in-congress", "ord_in_thread": 0, "title": "Guatemalan president faces judgment day in Congress", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GUATEMALA CITY , Guatemala — Guatemala’s Congress will debate Tuesday whether to strip embattled President Otto Pérez Molina of his immunity and force him to face prosecution over massive corruption at the national customs service.\nA congressional investigative committee recommended three days ago that lawmakers vote to revoke the conservative leader’s immunity, which would trigger a criminal trial and possibly force him from office.\nCongress will convene at 2:00 p.m. to consider the motion, which needs 105 votes to pass in the 158-member legislature.\nIf the motion passes, it will be the first time a president has been stripped of his immunity in the Central American country.\nPérez Molina survived a similar vote last month — but that was before prosecutors had accused him of masterminding the alleged systematic corruption.\nProsecutors and investigators from a special U.N. anti-graft commission say Pérez Molina ran a scheme in which businesses paid bribes to clear their imports through customs at a fraction of the actual tax rate.\nRead our ongoing coverage of the corruption scandal in Guatemala\nPérez Molina, a 64-year-old retired general, has repeatedly denied the allegations and rejected calls from an increasingly virulent protest movement for his resignation.\n“I have not received a cent from this fraudulent system,” he said Monday.\n“I reiterate yet again my position on the allegations made by the prosecution, and it is that I am completely calm,” he told a news conference.\nThe scandal, which has already felled his former vice president and a string of top officials, comes as Guatemala prepares for elections Sunday to choose Pérez Molina’s successor.\nPérez Molina, who has been in power since 2012, is constitutionally barred from running for reelection. His term ends on January 14.\nThe leading candidate to replace him, Manuel Baldizón , has called for Congress to strip Pérez Molina’s immunity. Baldizón leads right-wing party Renewed Democratic Liberty, the largest in Congress.\nPérez Molina’s lawyers, however, have challenged the vote before the Constitutional Court, which is expected to rule by Thursday and could suspend a decision on stripping his immunity.\nProtests outside Congress\nGuatemalans have taken to the streets in protest every week since April, when investigators first accused a top aide to then-vice president Roxana Baldetti of involvement in the corruption.\nOn Tuesday dozens of protesters blocked the entrances to Congress ahead of the immunity vote. Indigenous Guatemalans and farmworkers planned to join the protest by blocking roads around the country later in the day.\nSome of the protesters are calling for Sunday’s elections to be postponed until sweeping political reforms can be implemented in Guatemala, a country of 15.8 million that is troubled by poverty, drug trafficking and violent crime.\nInvestigators say their accusations are based on some 89,000 wire-tapped phone calls that uncovered a scheme called “La Linea” (the line), named for a hotline businesses would call to access corrupt officials and get illegal discounts on their customs duties.\nBaldetti, who resigned as vice president in May, was arrested on August 21 and is in jail awaiting trial on corruption charges.\nThe probe has also netted the head of Guatemala’s tax administration, his predecessor and several dozen other agency officials.\nWatch a documentary about the recent protests (in Spanish):", "external_links": ["https://www.youtube.com/embed/C75nVBMIeY8?feature=oembed", "https://www.facebook.com/ManuelBaldizonMendez"], "published": "2015-09-02T00:59:00.000+03:00", "crawled": "2015-09-04T21:19:07.785+03:00", "highlightTitle": ""}