{"organizations": ["Heritage"], "uuid": "511d2bb9825a4bd0b259d4009e66807995f06c9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bellaonline.com", "main_image": "http://www.bellaonline.com/images/editors/irishculture.jpg", "site_section": "http://www.bellaonline.com/channel.rss?id=15", "section_title": "Travel and Culture @ BellaOnline", "url": "http://www.bellaonline.com/articles/art1554.asp", "country": "US", "title": "Irish Culture 2025", "performance_score": 0, "site": "bellaonline.com", "participants_count": 0, "title_full": "Irish Culture 2025", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T13:00:00.000+03:00", "replies_count": 0, "uuid": "511d2bb9825a4bd0b259d4009e66807995f06c9f"}, "author": "", "url": "http://www.bellaonline.com/articles/art1554.asp", "ord_in_thread": 0, "title": "Irish Culture 2025", "locations": ["Ireland"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Eimear McBride", "Aoife Duffin", "Donal O'Kelly", "Pat Kinevane", "Fishamble", "Kinevane", "Heather Humphries"], "text": "BellaOnline's Irish Culture Editor Irish Culture 2025 The Minister for Arts, Heritage and Gaeltacht, TD Heather Humphries, launched a discussion document last month, inviting the Irish to discuss the direction that Irish arts policy will take over the next decade. All comments are to be submitted by September 30, 2015. All round the country County Arts Offices are launching symposium for members of the public and artists to contribute to the first cultural policy strategy by the Republic of Ireland. Part of the debate will inevitably be financial: how much can the State afford to support arts projects and practitioners. As a noun culture is broadly defined as the 'arts and other intellectual achievements regarded collectively.' But as a verb it refers to 'conditions for growth.' The Culture 2025 Plan is looking forward. It will be possible to broaden the remit to embrace not just 'The Arts', but how they can be wedded to education and public health and wellbeing. While experimental art may not fare so well, since the collective is often resistant to the sometimes patent weirdness of innovation in art forms. But it also refers to the collective support of works in progress. Grant aid can make it possible for Irish artists to take their work abroad to great acclaim. Take the case in point of Fishamble Theatre. Fishamble cultivates new dramatic works, often written and performed as solos or 'two handers'. These are shoe-string productions that are easilly performed in small spaces or studio theatres. They often tackle topics that challenge the Irish status quo. One of the most powerful pieces of theatre I have seen in years is a solo show written by actor Pat Kinevane. While many may have spotted him in films like \"Ella Enchanted\" or \"The General\", his play \"Silent\" tackles all the Irish taboos: alcoholism, homelessness, suicide, homosexuality, and mental illness. He took on all the 'biggies' with wit, verve and whole heart. Two Fishamble productions have just taken the 2015 Edinburgh Fringe Festival by storm. Kinevane's new solo production \"Underneath\" traveled there with the support of Culture Ireland. \"Underneath\" was the Fringe First winner of 2015. Fishamble's production \"Little Thing Big Thing\" garnered actors Donal O'Kelly and Sorcha Fox the Best Ensemble Acting Award at Edinburgh Fringe for 2015. And Aoife Duffin, better known for her television role in \"Moone Boy\", also garnered an award for acting excellenc for her performance the dramatic adaptation of the Eimear McBride's Man Booker 2014 winner, \"A Girl is a Half-Formed Thing.\" Irish culture is dynamic. It's evolving and responding to the world at large - to climate change, social problems, refugees and war. To add your two cents to the discussion you can read the full document and forward comments by following these links: www.ahg.gov.ie/en/Culture/Culture2025 or email culturalpolicy@ahg.gov.ie Related Links:", "external_links": [], "published": "2015-09-10T13:00:00.000+03:00", "crawled": "2015-09-11T01:54:10.325+03:00", "highlightTitle": ""}