{"organizations": [], "uuid": "e859b5c0bdc6cdbc97a88c5bcb6270d2ffc73b5f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03445/Sergio_Parisse_out_3445155k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-18.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sport/rugbyunion/rugby-world-cup/11875258/Rugby-World-Cup-2015-No-Sergio-Parisse-means-Italy-have-no-chance-against-France-in-opener.html", "country": "US", "title": "Rugby World Cup 2015: No Sergio Parisse means Italy have no chance against France in opener", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Rugby World Cup 2015: No Sergio Parisse means Italy have no chance against France in opener - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T01:39:00.000+03:00", "replies_count": 0, "uuid": "e859b5c0bdc6cdbc97a88c5bcb6270d2ffc73b5f"}, "author": "Steve James", "url": "http://www.telegraph.co.uk/sport/rugbyunion/rugby-world-cup/11875258/Rugby-World-Cup-2015-No-Sergio-Parisse-means-Italy-have-no-chance-against-France-in-opener.html", "ord_in_thread": 0, "title": "Rugby World Cup 2015: No Sergio Parisse means Italy have no chance against France in opener", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "No Sergio Parisse, no chance. You can dress it up however you want, but that has to be the conclusion to the news that the Italian captain and No 8 will miss his side’s World Cup opener against France at Twickenham on Saturday night. Few, if any, international teams have one player so evidently occupying a drawer so far above his colleagues. To lose him is devastating. He was there when Italy beat France in Rome in the Six Nations in both 2011 and 2013 (they have beaten France on only one other occasion – in Grenoble in 1997 – in 33 Tests) but he will not be there as Italy begin the arduous task of repairing a poor World Cup record. They have never progressed to the knockout stages and the roll call of the vanquished in their nine victories from 24 matches is hardly magnificent. Beating Argentina in 1995 was memorable, but wins against Fiji, USA (twice), Tonga, Canada, Romania, Portugal and Russia are nothing to shout about. Italy are yet to make a significant impression at a RWC What is more there appears to be a little trouble in the camp, if the observations of Mirco Bergamasco – now out of the squad, admittedly – are anything to go by. Apparently Jacques Brunel, the coach, is to blame. “The coach doesn’t have relations with the players, he doesn’t speak and he doesn’t communicate with them,” Bergamasco said. “He has failed to create a group, both on and off the pitch.” Italrugby hooker @LeoGhira to skipper the Azzurri in their #RWC2015 opener #FRAvITA in Twickenham on Saturday pic.twitter.com/FTkKlzj39b — Italrugby (@Federugby) September 17, 2015 Italy’s greatest hope is that France are in a similar state under Philippe Saint-André. It certainly looked that way in the Six Nations and has done for most of his tenure, during which France have lost 21 of 40 Tests. That said, however, they looked very good in their two warm-up Tests against England this summer. They were not so good against Scotland, but overall there was enough evidence to suggest that their set-piece is going to be strong and that they are extremely fit since they have been torn away from the masochistic rigours of the Top 14. “We will be much better than in the Six Nations,” said Saint-André, whose only significant absentee tonight is the injured centre Wesley Fofana. “We have been together since July 6. We’ve shown it already in the warm-up games. The team is ready, much, much fitter. We are ready to enter the competition. The guys have been ­living like in a club and we are looking forward to this game against Italy. I have been waiting for this for four years and we must arrive with a smile on our faces.” Saint-André is aiming high in the tournament as a whole, saying: “We have been in three finals and we have never brought one [trophy] home. We should take each match one at a time and approach the tournament with humility. “But the goal is to play a great World Cup. [It means] coming back home in November. [It means finishing] first or second. We’re not favourites but we have what it takes to beat any team in any one game.” These two teams have never met before in the World Cup, and the hope is that this match is better entertainment than their latest encounter, on a wet Sunday in March. France won 29-0, but it was a dreadful spectacle, littered with mistakes, turnovers and penalties. Italy’s strength has long been their pack, and so it is little surprise that they field the most experienced front row in World Cup history. Matías Agüero (36), Leonardo Ghiraldini (78), who captains in Parisse’s absence, and Martin Castrogiovanni (113) have 227 caps, 12 more than the previous best of 215, when South Africa beat Namibia in 2011. “We will have to be aggressive from the start and build pressure from the off,” flanker Alessandro Zanni said. “How we start will be vital, especially our physicality.” That is true, but physicality has never been Italy’s problem. Class has. And you suspect that France, even if they are placing a lot of faith in the unpredictable Frédéric Michalak at fly-half, will have too much of it. • The 20 hardest men to ever play rugby • Every Rugby World Cup - ranked and rated, by Mick Cleary Telegraphsportpage Follow @telegraphsport", "external_links": [], "published": "2015-09-19T01:39:00.000+03:00", "crawled": "2015-09-19T22:38:23.044+03:00", "highlightTitle": ""}