{"organizations": [], "uuid": "fe955065bc04b45b25db10ed5e37025a3a46df5e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/59944aa10e6639a6353c627ec6c5148a0b0a6eb0/c=0-307-2996-2000&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/19/USATODAY/USATODAY/635782987145417916-GTY-488732482.jpg", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/news/world/2015/09/20/chinas-president-seek-better-us-ties-during-visit-obama/72501586/", "country": "US", "title": "China's president to seek better U.S. ties during visit with Obama", "performance_score": 0, "site": "usatoday.com", "participants_count": 2, "title_full": "China's president to seek better U.S. ties during visit with Obama", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T22:18:00.000+03:00", "replies_count": 2, "uuid": "536466150be2d2fde2e746ab03eb209239ec36d8"}, "author": "", "url": "http://www.usatoday.com/story/news/world/2015/09/20/chinas-president-seek-better-us-ties-during-visit-obama/72501586/#post-0", "ord_in_thread": 0, "title": "China's president to seek better U.S. ties during visit with Obama", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese President Xi Jinping meets with U.S. business leaders at the Great Hall of the People in Beijing on Sept. 17, 2015. (Photo: Lintao Zhang, Getty Images)\n16 CONNECT 51 TWEET 31 LINKEDIN 2 COMMENT EMAIL MORE BEIJING — When Chinese President Xi Jinping arrives Tuesday on his first state visit to the USA, he will struggle with two seemingly contradictory objectives.\nOne is the need to project an image of China as a major world power that doesn't kowtow to America. The other is a desire to get relations with the United States back on a more positive footing.\nFailure to achieve both goals would fall short of Xi's own nationalist rhetoric and leave him open to domestic and international criticism when his handling of China's slowing economy is being questioned.\n“Xi really needs this trip to be a success,\" said Zhang Lifan, a Beijing-based historian and political commentator. \"If he can say, ‘America supports me,’ it will take the wind out of his opponents’ sails.\"\nThe six-day tip, which will begin in Seattle and end in a speech at the United Nations in New York, comes as tensions between Washington and Beijing run high.\nSince assuming the presidency in 2013, Xi has preached a message of \"national rejuvenation,\" which has seen China's military become more assertive in the South China Sea.\nDuring the past three years, the U.S. government has become more vocal about cyberattacks on U.S. companies, which it says are carried out by hackers connected to Beijing.\nBoth issues are likely to dominate talks when President Obama greets Xi at the White House at the end of the week.\n“By meeting face to face, the two presidents can calm tensions. But they are unlikely to solve their fundamental differences,” said Yang Xiyu, a senior fellow at China’s Institute of International Studies.\nXi and Obama have met five times. This time, they will have an informal dinner Thursday. Friday morning, Xi and his wife, Peng Liyuan, will receive a formal welcome on the White House lawn. That evening, Xi and Peng will be the guests of honor at a state dinner, the White House said.\nThe two presidents will discuss the economy, climate change, trade and human rights during their time together. Chinese officials played down the possibility that a long-awaited investment treaty would be signed.\n“The two sides will endeavor to bridge differences and strive for new and important progress in Bilateral Investment Treaty negotiations,” China’s foreign minister, Wang Yi, said last week.\nIf there are any major business announcements, they may come while Xi is in Seattle for the first two days of his American trip. He will give a speech Wednesday to 30 U.S. and Chinese CEOs at the Paulson Institute. In the afternoon, he will tour the Boeing facility in Everett, Wash., and the Microsoft Campus at Redmond.\nXi and his wife will visit Lincoln High School in Tacoma, Wash., which Xi visited in 1993 when he was Communist Party chief of Fuzhou. A year later, the two cities signed “sister” agreements.\n“The trip is chance for ordinary Americans to get to know Xi,\" said Jia Xiudong of the China Institute of International Affairs. \"They will see he is a very easygoing, spontaneous guy.”\nAfter his visit in Washington, Xi will travel to New York, where he will chair a U.N. meeting of global leaders on gender equality and women’s empowerment Sunday and address the 70th General Assembly on Monday. His message: peace and prosperity.\n“What China stands for is peaceful development, not hegemony; greater democracy in international relations, not power politics; win-win cooperation, not zero-sum game; and a right approach to interests and principles, not a pursuit for selfish interests,” Foreign Minister Wang said.\n16 CONNECT 51 TWEET 31 LINKEDIN 2 //usat.ly/1F9qXtc TOP VIDEOS", "external_links": ["http://usat.ly/1F9qXtc", "http://www.gannett-cdn.com/media/2015/09/19/USATODAY/USATODAY/635782987145417916-GTY-488732482.jpg", "http://www.gannett-cdn.com/-mm-/4044b1e7645488621f157de466cf1a990870caa2/r=500x333/local/-/media/2015/09/19/USATODAY/USATODAY/635782987145417916-GTY-488732482.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1F9qXtc&text=China%27s%20president%20to%20seek%20better%20U.S.%20ties%20during%20visit%20with%20Obama&via=usatoday", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1F9qXtc&mini=true", "http://www.gannett-cdn.com/-mm-/27f6664fb8ef48299f06ee96e2d6771613497b2a/c=170-0-2830-2000&r=x404&c=534x401/local/-/media/2015/09/19/USATODAY/USATODAY/635782987145417916-GTY-488732482.jpg"], "published": "2015-09-20T22:18:00.000+03:00", "crawled": "2015-09-21T08:59:30.912+03:00", "highlightTitle": ""}