{"organizations": [], "uuid": "0a92076150e7d57014b99608fa1cca5c78c4e428", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/7/6/k/q/k/image.related.StuffLandscapeSixteenByNine.620x349.176kka.png/1443494112182.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/themes/food/72530074/Food-holidays-Travels-new-big-thing", "country": "AU", "title": "Food holidays: Travel's new big thing", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Food holidays: Travel's new big thing", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T05:35:00.000+03:00", "replies_count": 0, "uuid": "0a92076150e7d57014b99608fa1cca5c78c4e428"}, "author": "Ben Groundwater", "url": "http://www.stuff.co.nz/travel/themes/food/72530074/Food-holidays-Travels-new-big-thing", "ord_in_thread": 0, "title": "Food holidays: Travel's new big thing", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Food holidays: Travel's new big thing BEN GROUNDWATER Last updated 05:00, September 30 2015 Getty Images \nFood has become the sole reason to visit a destination for some travellers. \nNine restaurant bookings. I was doing a little tallying up in my head while I was at the airport a few months ago, and realised that's how many reservations I'd made for the trip to Europe I was about to embark upon. \nIt seemed a bit ridiculous, really. It was a month-long adventure, and I figured out I'd made four hotel bookings, one car-hire booking, three sights or museum bookings, and had locked in reservations at no fewer than nine restaurants across Spain, Italy, Belgium and Hong Kong. \nThese eateries ranged from three-Michelin-star fine-diners to zero-star holes in the wall. They went from refreshingly cheap to stupidly expensive. And they were all, clearly, a high priority. My three-day stop in Barcelona, for example, was set to involve one visit to La Sagrada Familia, and three meals at restaurants owned by people with the surname Adria. \nSomething has changed here. When did food become the sole reason for travel? \nI mean, culinary culture was always there as a side benefit, a tasty little hors d'oeuvre to the main course of the jet-setting experience. You'd book a trip and then think, \"Oh, and apparently they have great food there too.\" But all of a sudden, for plenty of us, that food is the main reason we're going. \nWhy do we travel? I've jetted off for plenty of reasons. I've travelled for sport. I've travelled for music, I've travelled for beer, I've travelled for festivals… And I've travelled for beer festivals. \nBut now, I travel for food. \nAnd what a way to travel it is. I travel for pho, for fresh-baked croissants, for empanadas, for tapas, tacos, caramels, carbonara, thalis, rotis, ramen and mee. I travel to eat street food, to eat fancy restaurant food, and to eat everything in between. \nI don't think I'm the only one, either. You just have to look at the proliferation of local food tours in cities across the world to realise what a big deal this has become. Local food bloggers are taking groups of visitors to their local restaurants. Big tour companies are including cooking classes on their itineraries. \nEntire enterprises have been set up specialising in culinary tourism. There are two-or three-week tours aimed at investigating food culture by companies that have never before given it such focus.", "external_links": [], "published": "2015-09-29T05:35:00.000+03:00", "crawled": "2015-09-30T08:51:39.344+03:00", "highlightTitle": ""}