{"organizations": [], "uuid": "dcce3c04a2df0b6dd2c59ece37a8d0451f4baa71", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/6/w/2/8/2/image.related.StuffLandscapeSixteenByNine.620x349.16w0vf.png/1442203876362.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/news/72037995/Adventure-Cats-making-their-mark-on-Instagram", "country": "AU", "title": "'Adventure Cats' making their mark on Instagram", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 0, "title_full": "'Adventure Cats' making their mark on Instagram", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T07:11:00.000+03:00", "replies_count": 0, "uuid": "dcce3c04a2df0b6dd2c59ece37a8d0451f4baa71"}, "author": "", "url": "http://www.stuff.co.nz/travel/news/72037995/Adventure-Cats-making-their-mark-on-Instagram", "ord_in_thread": 0, "title": "'Adventure Cats' making their mark on Instagram", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Adventure Cats' making their mark on Instagram Last updated 16:11, September 14 2015 AdventureCats \nPurrfect Penny is on a cross-country #roadtrip. #adventurecats #cats #catstagram #catoftheday #catsofinstagram #catleash by @mgmua. \nLast week images of a man taking his dog on epic adventures around the US made us swoon, but when it comes to the internet, anything dogs can do - cats can do equally as well. \nThat is the premise behind \"Adventure Cats\" a new Instagram account that showcases our feline friends enjoying the great outdoors with their owners in tow. \nThe account is the brainchild of Laura Moss, a woman who came up with the idea after researching how she could \"train her kitties to walk on a harness outdoors\" she told DailyMail.com . A photo posted by Adventure Cats (@adventurecatsorg) on Aug 4, 2015 at 4:27am PDT \n\"While cats have a reputation as being lazy and aloof, there are actually plenty of badass cats out there that will join you on the trail, scale mountains and even go for a dip,\" she wrote in an article called \"Take your cat on an excellent adventure\" for Mother Nature Network . \n\"These are the kitties we want to spotlight.\" \nThe Instagram account Adventure Cats was launched in April, and Moss has been overwhelmed by the response. \n\"The response has been overwhelming in the best possible way.\" Moss told Wired. \n\"I haven't had to seek out a single contributor. \n\"I launched the Instagram account in April, kicking it off with photos of my two cats or my friends' cats, and within a matter of days, people were tagging adventurecats in photos. \n\"Every day I'm awed by these incredible cats and their owners.\" Ad Feedback \nThe beautiful images posted to the account show cats in various states of adventure. There is a paddle-boarding cat, a camp cat and even a hiking cat. \nSo how do you train your cat to become an adventure enthusiast? One regular contributor, Erin Verplaetse, shared her tips with the MailOnline. \n\"We try to keep outings a part of her daily routine. \n\"Even throughout the busy work week we will take her on car trips and errands. \n\"Having your cat feeling comfortable in a harness and leash trained is definitely the first step! \n\"If you want an adventure kitty: follow your cat's lead and comfort level: experiment while safely harnessed/leashed in the yard and move to more open spaces. \n\"It's definitely not an activity for all cats, as they are very independent by nature.\" \nWould you train your cat to go on adventures? Let us know in the comments below. - Stuff", "external_links": [], "published": "2015-09-14T07:11:00.000+03:00", "crawled": "2015-09-14T23:17:36.406+03:00", "highlightTitle": ""}