{"organizations": [], "uuid": "e59d2d0df3080547db3527e1186241e52e4bd1ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eglobaltravelmedia.com.au", "main_image": "http://www.eglobaltravelmedia.com.au/wp-content/uploads/2015/09/Martin-Ferguson-hi-res-square-300x300.jpg", "site_section": "http://www.eglobaltravelmedia.com.au/feed/", "section_title": "Global Travel Media", "url": "http://www.eglobaltravelmedia.com.au/dedicated-tourism-minister-recognises-industrys-economic-potential-says-taas-martin-ferguson/", "country": "US", "title": "Dedicated tourism minister recognises industry’s economic potential, says TAA’s Martin Ferguson", "performance_score": 0, "site": "eglobaltravelmedia.com.au", "participants_count": 1, "title_full": "Dedicated tourism minister recognises industry’s economic potential, says TAA’s Martin Ferguson", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T17:57:00.000+03:00", "replies_count": 0, "uuid": "e59d2d0df3080547db3527e1186241e52e4bd1ef"}, "author": "Stephen Morton", "url": "http://www.eglobaltravelmedia.com.au/dedicated-tourism-minister-recognises-industrys-economic-potential-says-taas-martin-ferguson/", "ord_in_thread": 0, "title": "Dedicated tourism minister recognises industry’s economic potential, says TAA’s Martin Ferguson", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email \nThe appointment of Senator Richard Colbeck as a dedicated Minister for Tourism in the new Malcolm Turnbull-led Federal Government is an encouraging sign that the value and importance of tourism is being recognised, says Australia’s peak accommodation body, Tourism Accommodation Australia (TAA). \nChair of TAA, and the last dedicated Federal Tourism Minister, Martin Ferguson, said that while tourism had been well served at Cabinet level in the Abbott Government by Trade Minister Andrew Robb, the industry deserved its own voice in Government. \n“While we would have preferred tourism to have a seat at the Cabinet table, we are confident that Senator Colbeck will represent tourism strongly,” said Mr Ferguson. Martin Ferguson \n“With Senator Colbeck coming from Tasmania, he will know the importance of tourism and its potential to create jobs and generate income. \n“We will be calling on him to address a number of major issues that require urgent attention to drive future demand and ensure the industry is both competitive and responsive to the changing market conditions. \n“For the accommodation sector that means ensuring workplace conditions are conducive to maximising the potential of businesses and growing employment. With the largest expansion of hotels in Australia for over two decades, there needs to be a clampdown on unregulated commercial accommodation, and there needs to be a continued priority for Government to invest in tourism-related infrastructure, promotion and events to drive future international and domestic demand. \n“The importance of the industry will require the continued support of Andrew Robb at cabinet level, as trade relations – particularly the Free Trade Agreements – will have profound implications for the growth of tourism from Asia. It will be essential for tourism to be aligned to future trade liberalisation.” Share this:", "external_links": [], "published": "2015-09-20T17:57:00.000+03:00", "crawled": "2015-09-20T18:13:32.799+03:00", "highlightTitle": ""}