{"organizations": [], "uuid": "949cffa997fe9055e9b7a031c8afaf8e740f6567", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03442/Woman_using_a_lapt_3442218k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-28.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/business-travel-rewards/11868916/save-money-on-business-travel.html", "country": "US", "title": "A better way to book business travel", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "A better way to book business travel - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T19:07:00.000+03:00", "replies_count": 0, "uuid": "949cffa997fe9055e9b7a031c8afaf8e740f6567"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/business-travel-rewards/11868916/save-money-on-business-travel.html", "ord_in_thread": 0, "title": "A better way to book business travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "If you buy your company's travel, you're always looking to demonstrate where you can add value. But where in the past, that responsibility could have meant constant phone calls with multiple airlines and their various departments, reams of invoices and logs for frequent flyer rewards, today things are far simpler. Praise be to technology, by using the right tools, today’s travel bookers are in the enviable position of being able to show off exactly how much they’ve added to the bottom line and ensured that travellers will be guaranteed the smoothest, most efficient experience when flying for work. Using a company loyalty programme such as British Airway’s On Business , it’s easy to keep track of where your company has travelled on business, who has gone where and what has been spent on business travel, at the touch of a button. The data can be segmented by department, date, type of travel or individual employee, and the data can be exported to Excel or PDF. And the savings can be significant. On Business is unusual in that members can earn points to redeem against future flights, benefit from immediate upfront discounts where available, enjoy upgrades on British Airways and Iberia as well as access to member-only special offers and rewards. Points earned increase on a tiered system based on how much your company spends over the course of a year, with bigger spenders earning up to 50pc more points for every pound. It’s easy to work out what points the company, department, or individual has accrued and what they can be spent on The flexibility of the programme means that everyone can benefit; from frequent international flyers accumulating points, to less frequent travellers benefitting from access to instant, member only discounts on selected flights, On Business helps you save money on your company travel budget. The programme can be managed from within your company or by nominated travel agent outside it, so it’s easy enough to share the workload without losing track of things. Through an online dashboard, it’s easy to work out what points the company, department, or individual has accrued and what they can be spent on, whether your business is flying once a year or once a week. After all, even the smallest company wants to get the most bang for its buck – and that can mean hours spent trying to track down the best deals – particularly when you’re arranging flights for multiple travellers across multiple departments. That’s where a large business travel programme such as On Business comes into its own. By reaching across the networks of three major airlines – British Airways, American Airlines and Iberia – bookers can stay focused on ensuring they are making the most of their companies' travel budget. And thanks to the huge array of flights offered by these global airlines, that value for money doesn’t mean missing out on convenient flight times, which certainly makes your life easier when those eleventh-hour travel requests come in. • Find out more about how your company can make savings on business travel by visiting British Airways On Business", "external_links": [], "published": "2015-09-28T19:07:00.000+03:00", "crawled": "2015-09-28T13:40:35.129+03:00", "highlightTitle": ""}