{"organizations": [], "uuid": "e97044390029238ba9433fc1f95c4f53255cbc65", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailytelegraph.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/04c6e11e8bb313c2e21919d5d950af56", "site_section": "http://www.dailytelegraph.com.au/travel/travel-advice", "section_title": "Travel Advice | Holiday and Travel Advice | dailytelegraph.com.au", "url": "http://www.dailytelegraph.com.au/travel/holiday-ideas/essential-tips-to-help-first-time-cruisers-before-they-go-and-when-theyre-on-the-water/story-fnjjv4qx-1227511234574", "country": "US", "title": "Essential tips to help first-time cruisers before they go and when they’re on the water | DailyTelegraph", "performance_score": 0, "site": "dailytelegraph.com.au", "participants_count": 1, "title_full": "Essential tips to help first-time cruisers before they go and when they’re on the water | DailyTelegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T22:00:00.000+03:00", "replies_count": 0, "uuid": "e97044390029238ba9433fc1f95c4f53255cbc65"}, "author": "Brad Crouch", "url": "http://www.dailytelegraph.com.au/travel/holiday-ideas/essential-tips-to-help-first-time-cruisers-before-they-go-and-when-theyre-on-the-water/story-fnjjv4qx-1227511234574", "ord_in_thread": 0, "title": "Essential tips to help first-time cruisers before they go and when they’re on the water | DailyTelegraph", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "THE bling on the formal lanyard, the mysterious badges, the VIP invites to the captain’s drinks – and free laundry. All this and more can be bewildering for a newbie cruiser trying to find the spa and ending up in an ice-skating rink, but it won’t take long for virgin cruisers to get their sea legs and realise just why cruising is one of the biggest boom sectors of leisure on Earth.\nBut to give a helping hand to holidaymakers thinking about dipping a toe in the seven seas or where the rivers run for the first time, here is a baker’s dozen of practical hints.\nTAKE A ‘SAMPLER CRUISE’\nOther Stories Aylan’s dad denies he’s ‘a people smuggler’ News 0 comments McManus to make ‘strenuous defence’ over charges: lawyer Nsw Teen found alive a week after crash Nsw 0 comments ‘I’m the most hated man in Australia’ Television 0 comments Inside the mind of a 9/11 truther World Fans want Heather as next Bachelorette Sydney Confidential 0 comments Being stuck on a cruise for weeks is madness if you find it is not for you. Major cruise lines offer sampler cruises of one, two or three nights to test the waters.\nJust be aware these can end up as party cruises where people full of the joie de vivre are keen to check out every experience and drinks flow freely. Longer cruises tend to be more sedate as people enjoy the initial excitement of the trip then settle in. The disembarkation of a sampler cruise can resemble a scene out of The Hangover.\nPICK YOUR LINE AND TIME\nDo your research and talk to your travel agent. Each cruise line positions for a niche market, and while most people easily flow over several such markets, not all will feel they are getting their best value-for-money holiday if on the wrong ship or line.\nFor example, some cruises are geared for family fun, some are adults-only, some are affordable luxury, some are super luxury with prices to match.\nTiming matters. Shoulder seasons and repositioning cruises, where ships head from the northern hemisphere for the southern summer or vice versa, can have amazing deals to fill cabins. Long voyages such as a trans-Pacific voyage tend to attract people with time and money to spend – retirees.\nRunning track on deck of cruise ship Azamara Journey (Azamara Club Cruises). Picture: Alamy WALK THE SHIP\nIt is fine to check out deck plans online or in a brochure but you really only get to know a ship by walking it. A great time is if your luggage has not arrived at your cabin when you board.\nAfter thoroughly checking out your cabin, instead of fretting walk all the public decks end to end (obviously avoid the cabin-only decks) to get your bearings. Many large ships have two or three upper decks and two or three lower decks which are the main centres of action. Get back to your cabin, unpack as by now your luggage has arrived, then head up to the pool deck for a champagne and rock on with the sail away party!\nPACE YOURSELF\nThere will be plenty of adrenalin with the excitement of a great holiday, a new trip and a brand new cruise experience. New friends, a sail-away party, music and a drink or three can leave you open to embarrassment if you end up dancing on a piano. Cruise ship security will pounce and it is not a cool look for the rest of the trip.\nDitto with food – there are loads of choices and delicious treats on board but don’t overdo it, and perhaps balance it with gym sessions or a daily walk around the promenade deck.\nSome people come on as passengers and leave as freight – be sensible.\nAquavit Terrace for alfresco drinks and seafood dining aboard the Viking Star. TREASURE YOUR CRUISE CARD\nOn many lines this is the key to your cabin and your charge card for everything from drinks to spa treatments. You will need it to get on and off the ship. Many people use lanyards and simply drape it around their neck as a necessary accessory.\nRemember when you go on a port visit you will need cash or a credit card – local merchants won’t take your cruise card as payment. It is easy to get used to the cashless system, with the trap of forgetfully leaving your wallet in the in-room safe on a port day.\nAnd lapel badges. The bling lanyards for cruise cards on formal evenings is a personal choice.\nTALK TO SEASONED CRUISERS\nThey have the inside goss and while some might bore you with a litany of their cruises, others will provide insights, such as loyalty programs various lines offer which include invitations to drinks with the captain and even free laundry depending on the number of cruises you have done with them.\nCHECK OUT DRINKS PACKAGES\nYou can save a small fortune with a daily package covering everything from just soft drinks through to booze.\nSome may appear pricey at first but bear in mind this is a holiday where, unlike at home, you may have a coldie or two by the pool over lunch, a pre-dinner cocktail, some wine with dinner and a late night spirit while enjoying a show or live music.\nSEASICKNESS\nJust as wind and bike helmets are the natural enemies of hair, so is the movement of the sea a natural enemy of some folks’ system.\nIf mal de mer – seasickness – is an issue, try Quells, ginger, or my family swears by special wristbands available at chemists.\nAlso check your itinerary. My Viking bride who gets seasick on a jetty had no problem cruising the calm waters of the Mexican Riviera but has threatened serious consequences if I ever try to entice her to sail the big seas of the Great Australian Bight again.\nOne of the magnificent desserts in Le Champagne restaurant on Silversea Cruises. DINING ON BOARD\nDining has come a long way since the days when cruising was derisively dismissed as being for the newly wed, nearly dead or over fed.\nAs well as the main dining room and buffet, many ships are adding a host of specialty restaurants (with surcharges), ranging from fine dining to intimate “chef’s table” degustations to those overseen by celebrity chefs.\nOn some cruises you can easily dine in a different restaurant every night.\nLines also are introducing “anytime dining” concepts where you simply turn up to the main dining room when you feel like it, although there is no guarantee there will be a table immediately available.\nMany main dining rooms have two sittings for dinner, so everyone can catch one of the two evening theatre shows – check whether you would prefer the early or late sitting.\nBe prepared for a bill at the end\nCruises are extraordinarily good value, with meals, activities and entertainment included.\nBut for newbies there will be a host of things that can add up when you get your bill on the final night.\nFor example: drinks (soft and alcoholic); spa treatments from teeth whitening to seaweed wraps; specialty restaurant meals (separate to the main dining room or buffet where meals are included in the ticket price).\nIt can also include the casino; courses in things like cooking; internet use; shopping at boutiques; room service drinks; laundry; shore tours; portrait photos. Also check if gratuities are included.\nLEGAL AGE DRINKING RULES\nCruise lines running on American rules may have an age-21 policy for drinking which can be a trap for some Australians.\nSome lines operating in waters out of America will allow 18-year-olds and above to have a drink provided parents are in attendance and there is a signed waiver. Which is how my 18-year-old son managed to enjoy a single, small martini with his mother in the gorgeous Martini Bar of Celebrity Solstice in the Mediterranean while dressed in a tuxedo on formal night.\nDo as little as you want aboard the cruise ship Astor. Picture: Supplied DON’T STRESS ABOUT DRESS\nYou unpack once so you can take a fair bit of luggage. Casual wear is fine by day and around the pool – don’t wear swimmers to dining rooms of course – and the sort of smart casual gear you might wear out to a nice restaurant is a good guide for most nights.\nMany cruises have formal nights – for men a dark suit or tuxedo, for women formal wear – which is a great excuse to get dolled up and have portrait photos taken, even if it does add to packing hassles.\nYou can skip it altogether and eat at the buffet or have room service, but why not glam up and join the fun? Some ships hire formal outfits.\nENJOY. IT’S A HOLIDAY\nEvery guest on board is on holiday so the feel-good vibes should be flowing pretty nicely, where you make casual conversation with new friends in everything from around the pool to dancing classes. There are sports to play, activities to join, nightly shows, and you can just relax in between port tours. Getting on board may take some queuing (but not much these days), as do boarding tender boats at some ports, there will be a mandatory safety drill, but really, just exhale, relax your shoulders and enjoy.\nOriginally published as The best tips for a first-time cruiser", "external_links": ["http://cdn.newsapi.com.au/image/v1/0a654193241113bdf737ae7e222c3c3c", "http://cdn.newsapi.com.au/image/v1/9173e1bacee13eb30a84c6576330c901", "http://cdn.newsapi.com.au/image/v1/9235171ec91cd6d99b1e893dfbeac96a?width=650", "http://cdn.newsapi.com.au/image/v1/47d77865b62638070a2d56b0d2d5b212?width=650", "http://cdn.newsapi.com.au/image/v1/abd161374ae6c06689ece67c0c09c03d?width=650", "http://cdn.newsapi.com.au/image/v1/4fa7a8322bd361cd2ea475f44dfa50e6", "http://cdn.newsapi.com.au/image/v1/1ed6e60bd4fdf6904e35d0102f7c7f7a?width=650", "http://cdn.newsapi.com.au/image/v1/122e8e8db8ff946a9dba40dd88fe4d47", "http://cdn.newsapi.com.au/image/v1/01540d1cbf9c070498614b568c9a9341", "http://www.heraldsun.com.au/travel/holiday-ideas/essential-tips-to-help-first-time-cruisers-before-they-go-and-when-theyre-on-the-water/story-fnjjv4qv-1227511234574?sv=268f3c6bd0fbf07025f943083a3b42b4", "http://cdn.newsapi.com.au/image/v1/524f4517f20a2d39a4e94ed88452de75", "http://pixel.tcog.cp1.news.com.au/track/news/content/v1/?category=/section/dailytelegraph.com.au/collection/popular-content/all/24hours/&t_product=most-popular-mobile&td_standfirst=false&td_kicker=false&td_byline=false&td_resultSize=6&maxRelated=20&display:footer=true&origin=omniture&t_template=s3/chronicle-component/otherstories/templates/index&domain=dailytelegraph.com.au"], "published": "2015-09-05T22:00:00.000+03:00", "crawled": "2015-09-11T18:02:55.781+03:00", "highlightTitle": ""}