{"organizations": [], "uuid": "0f80fcfdae31fe9f682069dd1d88d5286dd81a5d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64131/alaska-airlines-and-icelandair-announce-codeshare-frequent-flier", "country": "US", "title": "Alaska Airlines and Icelandair announce codeshare, frequent flier partnership agreement", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Alaska Airlines and Icelandair announce codeshare, frequent flier partnership agreement", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T06:43:00.000+03:00", "replies_count": 0, "uuid": "0f80fcfdae31fe9f682069dd1d88d5286dd81a5d"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64131/alaska-airlines-and-icelandair-announce-codeshare-frequent-flier", "ord_in_thread": 0, "title": "Alaska Airlines and Icelandair announce codeshare, frequent flier partnership agreement", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Alaska Airlines and Icelandair announce codeshare, frequent flier partnership agreement   \nSep 24, 2015 eTN   \nSEATTLE, WA - Alaska Airlines and Icelandair have entered into a codeshare agreement and frequent flier partnership, which will give customers easier connections and more ways to earn benefits when flying between the US and Europe. \nWith the new codeshare agreement, to take effect Nov. 1 pending government approval, customers flying on Alaska Airlines and Icelandair will enjoy seamless reservations and ticketing, one-stop check-in, baggage checked to its final destination, coordinated flight schedules, the ability to earn miles and/or points on the reciprocal airline and consistent passenger service standards. Elite-level members of each airline's frequent flier program also will receive reciprocal club lounge benefits. \n\"This new partnership with Icelandair is another example of how Alaska is raising the bar to allow its Mileage Plan members to travel and earn miles to all corners of the globe through a diverse network of international carriers,\" said Andrew Harrison, Alaska Airlines' executive vice president and chief commercial officer. \"Icelandair offers our frequent fliers a unique option for flying and earning miles to Europe from our Seattle, Portland and Anchorage gateways.\" \nIcelandair operates flights from 16 cities in North America to Iceland with connections to more than 20 destinations in Europe, including Amsterdam, Brussels, Copenhagen, Frankfurt, London and Paris. Travelers can also enjoy an Icelandair stop-over to visit the city of Reykjavik and tour surrounding areas for up to seven nights at no additional airfare charge. \n\"With today's announcement of our Alaska Airlines partnership, Icelandair continues to expand its network, including more flights, more gateways and more destinations,\" said Helgi Mar Bjorgvinsson, Icelandair's senior vice president of sales and marketing. \"Our codeshare flights and mileage partnership will make travel seamless from the West Coast, reward frequent travelers on both Icelandair and Alaska Airlines, and offer our passengers even more options when traveling to Iceland and beyond.\" \nAs an added benefit, starting Oct. 1 Alaska Airlines Mileage Plan MVP Gold and Gold 75K members will receive complimentary access to Icelandair's Saga Lounge at Keflavik International Airport in Reykjavik and Icelandair Saga Gold and Silver members will enjoy complimentary access to Alaska Board Room lounges in Seattle, Portland, Anchorage and Los Angeles. \nMembers of Alaska Airlines Mileage Plan can begin earning miles on Icelandair starting Oct. 1, and through Dec. 15, 2015 the airline is offering double miles.* Miles flown will count toward elite status in Alaska's Mileage Plan. Members of Icelandair's Saga Club can begin earning Saga Points for flights on Alaska starting Oct. 1. Redemption for award travel will start later this year. \nIcelandair has a long history of providing flights from the United States to Europe. The airline offers onboard Wi-Fi access, personal inflight entertainment, three cabins of service and two free checked bags for customers. Icelandair Saga Club, Icelandair's frequent flier program, offers members multiple options to redeem their Saga Points, whether it is a flight with Icelandair, onboard refreshments and duty free items, hotel accommodations around the world or gift certificates at various retailers in U.S. and Canada. The most frequent fliers with Saga Gold and Silver status enjoy excellent benefits, such as upgrades, lounge access and extra baggage allowance. \nOver the last few years Alaska has grown its codeshare and frequent flier partnerships with the world's best airlines to provide customers with convenient service to most every point on the globe. \nIn July, Alaska added China-based carrier Hainan Airlines as a Mileage Plan partner. Mileage Plan was ranked \"Highest in Customer Satisfaction with Airline Loyalty Rewards Programs, Two Years in a Row\" in the J.D. Power Airline Loyalty/Rewards Program Satisfaction Report.", "external_links": [], "published": "2015-09-24T06:43:00.000+03:00", "crawled": "2015-09-24T07:54:56.634+03:00", "highlightTitle": ""}