{"organizations": [], "uuid": "19f72ab9023182d4330b699109e3f62eed1cb3ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/ABC-Virginia-Tourism.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sales-of-virginia-craft-spirits-and-wine-increase-more-than-100-percent-during-virginia-abc-virginia-tourism-partnership/", "country": "US", "title": "Sales of Virginia Craft Spirits and Wine Increase More Than 100 Percent During Virginia ABC-Virginia Tourism PartnershipTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Sales of Virginia Craft Spirits and Wine Increase More Than 100 Percent During Virginia ABC-Virginia Tourism PartnershipTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "19f72ab9023182d4330b699109e3f62eed1cb3ab"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/sales-of-virginia-craft-spirits-and-wine-increase-more-than-100-percent-during-virginia-abc-virginia-tourism-partnership/", "ord_in_thread": 0, "title": "Sales of Virginia Craft Spirits and Wine Increase More Than 100 Percent During Virginia ABC-Virginia Tourism PartnershipTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sales of Virginia Craft Spirits and Wine Increase More Than 100 Percent During Virginia ABC-Virginia Tourism Partnership Published on : Saturday, September 19, 2015\nVirginia is for Lovers-of trucker hats. The summer partnership between the Virginia Department of Alcoholic Beverage Control (ABC) and Virginia Tourism Corporation (VTC) offering “Virginia is for Lovers” trucker hats with every purchase of Virginia wine and spirits at select stores resulted in an almost 116 percent increase in sales of Virginia-made products.\n“Results of Virginia ABC’s partnerships with Virginia Tourism demonstrate the benefits of agencies working together across secretariats,” said Secretary of Public Safety and Homeland Security Brian Moran. “The two agencies worked together to inspire Virginians to support the economy by shopping local-all while showing their Virginia pride by sporting the ‘Virginia is for Lovers’ brand. I look forward to even more successful agency collaborations in the future.”\nNine Virginia ABC stores across the commonwealth were supplied with the extremely popular trucker hats emblazoned with VTC’s venerable slogan, handed out with every purchase of a 750 mL or larger bottle of Virginia wine or Virginia craft spirits. Employees of these stores also wore co-branded polo shirts with both the Virginia ABC and “Virginia is for Lovers” logos during the promotion, which ran Memorial Day through Labor Day.\n“This collaboration was an innovative and creative way to promote Virginia-made products, the ‘shop local’ movement and the Virginia is for Lovers travel brand,” said Maurice Jones, Secretary of Commerce and Trade. “Tourism is an instant revenue generator for Virginia.”\nVirginia ABC reported that total sales at the stores topped $196,570, a $105,501 increase over 2014, and more than 9,488 bottles of Virginia-made product were sold.\n“This promotion demonstrates what can be accomplished when we get together and think outside of the box to promote Virginia,” said Virginia ABC Commissioner Judy Napier. “These exciting collaborations deliver an economic boost for tourism, while highlighting ABC’s role in introducing new and outstanding Virginia-made craft products to consumers. I join Secretary Moran in looking forward to future creative partnerships that bolster Virginia’s economy and in turn support some of Virginia’s most important programs. We also are proud to recognize that the success of each in-store promotion is a direct result of the buy-in and support of our store employees.”\nThe success of the trucker hat promotion has led to a second partnership effort for Virginia ABC and VTC. Cowbells branded with “Virginia is for Lovers” are now being handed out free with the purchase of a 750 mL or larger Virginia-made spirit or wine to highlight the UCI Road World Championships coming to Richmond Sept. 19-27. The cowbells-the noisemakers of choice for professional cycling events-are available at 35 Richmond-area stores.\n“I applaud the creative and fun partnership between ABC and VTC to further promote Virginia’s outstanding wines and distilled spirits, two products that staff at the Virginia Department of Agriculture and Consumer Services and the Virginia Wine Marketing Office and I market here and abroad,” said Todd Haymore, Secretary of Agriculture and Forestry. “The tremendous success of the Virginia is for Lovers trucker hat promotion shows what can be accomplished by more state agencies working in partnership to meet the Governor’s call to build a new Virginia economy.”", "external_links": [], "published": "2015-09-19T03:00:00.000+03:00", "crawled": "2015-09-18T22:02:47.842+03:00", "highlightTitle": ""}