{"organizations": [], "uuid": "fe4565009be4a6043e04568aa21ad525b1d1061f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64302/westin-san-francisco-airport-completes-extensive-10-million-reno", "country": "US", "title": "Westin San Francisco Airport completes extensive $10 million renovation", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Westin San Francisco Airport completes extensive $10 million renovation", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T21:14:00.000+03:00", "replies_count": 0, "uuid": "fe4565009be4a6043e04568aa21ad525b1d1061f"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64302/westin-san-francisco-airport-completes-extensive-10-million-reno", "ord_in_thread": 0, "title": "Westin San Francisco Airport completes extensive $10 million renovation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Westin San Francisco Airport completes extensive $10 million renovation     \nMILLBRAE, CA - The Westin San Francisco Airport, owned and operated by Ultima Hospitality, has completed an extensive $10 million dollar renovation. The new design combines relaxing yet invigorating elements creating an environment ideal for business and leisure travelers alike. The arrival experience is welcoming and efficient with the hotel's public space, restaurant and lounge flowing seamlessly into the meeting room layout. \n\"The Westin San Francisco Airport has always been an important hotel to visitors and locals alike,\" stated General Manager, Tom Scaramellino. \"It was our goal to create a hotel which best served the needs of our many loyal and future social, leisure and corporate guests. We believe the well-planned space and thoughtful design achieved our ultimate goal of enhancing the overall guest experience.\" \nThe renovated lobby integrates numerous natural elements including a soothing water feature which subtly directs traffic flow as well as a new stone fireplace helping to delineate space and add a beautiful focal point for gatherings. The botanical themed carpet and living wall complement the surroundings and maintain an organic feel throughout the space. The Westin San Francisco Airport evokes a resort atmosphere balanced with convenience and connectivity designed for the savvy traveler. \n\"Our guests really love the new lobby. I watch them enjoying the beautiful surroundings all the time,\" commented Tom Scaramellino, General Manager. \"The setting is perfect for gathering, to catch up on work, or just to relax. Use has greatly increased because people are immediately drawn to the space. There is a natural ease throughout the lobby that speaks directly to the Westin philosophy of living well. \" \nThe hotel features a variety of dining options. The upgraded Runway Cafe is ideal for families on their way out to enjoy the sights as well as the business traveler on the go. The Cafe is a full service coffee bar offering both items prepared to order and freshly packaged meals for expedited service. The Grill & Vine Restaurant serves three meals daily. The restaurant menu features delicious, locally sourced and sustainable meat and produce. The lounge is active and welcoming and feels very much part of the lobby ambiance. The renovation added a private dining room to Grill & Vine creating a perfect spot for parties or dinner meetings. \nThe new Westin San Francisco Airport guest rooms have a wonderful richness that is noticed the moment you arrive. Expanded doorways open the entries to natural light. The warm woods, textured fabrics, contemporary sconces and mixed metal finishes, used in the 397 rooms, welcome and delight. Knauer Inc. the designers, led by Warren Stetson, blended two Westin color palettes to layer a clean, fresh and inviting aesthetic throughout the guest rooms. Neutral tones are mixed with environmental greens and blues, creating a serene surrounding. The Heavenly Bed and Heavenly Shower complete the transforming experience. \nThe newly renovated Westin San Francisco Airport is conveniently located at 1 Old Bayshore Highway in Millbrae, California. Its recent $10 million dollar renovation to the guest rooms, meeting space and lobby unveils an inviting, contemporary design. The welcoming and rejuvenating Westin sits along the beautiful Bayfront Park and adjacent to its sister property - the fresh and fun Aloft San Francisco Airport. Guests benefit from the two unique brands and can enjoy services and amenities offered at both hotels. The two hotels are owned and operated by Ultima Hospitality. The Westin San Francisco Airport is committed to providing a true Westin guest experience that helps you be at your best in mind, body, and spirit.", "external_links": [], "published": "2015-09-29T21:14:00.000+03:00", "crawled": "2015-09-30T00:35:49.801+03:00", "highlightTitle": ""}