{"organizations": [], "uuid": "26df8f26d3f7ad71cd59d7fe324dc6d6222b2e11", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03449/Cruise_ship_Mekong_3449524k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-25.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/unforgettable-holidays/11883252/mekong-river-cruise.html", "country": "US", "title": "Vietnam: set sail on a Mekong adventure", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Vietnam: set sail on a Mekong adventure - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T20:14:00.000+03:00", "replies_count": 0, "uuid": "26df8f26d3f7ad71cd59d7fe324dc6d6222b2e11"}, "author": "Stuart Rogers", "url": "http://www.telegraph.co.uk/sponsored/travel/unforgettable-holidays/11883252/mekong-river-cruise.html", "ord_in_thread": 0, "title": "Vietnam: set sail on a Mekong adventure", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "APT’s luxurious 15-day Vietnam & Cambodia Highlights river cruise and tour takes you on a spectacular journey of history, culture and adventure along the Mekong River from Ho Chi Minh City to Siem Reap. A mixture of land touring and river cruising means you will not only explore famous landmarks but also go off the beaten track to get into the heart of these fascinating countries. You’ll visit floating markets, temples and remote villages, many accessible only by water. You’ll meet local people, witness rice workers in paddyfields and children waving from the riverbank. APT’s hand-picked English-speaking local guides will further enhance your experience by telling you their own stories. A mixture of land touring and river cruising means you will not only explore famous landmarks but also go off the beaten track Your adventure begins with a two-night stay at the Sheraton Saigon Hotel and Towers in Ho Chi Minh, a city where the sights and sounds of Vietnam unfurl. Here, you can visit the Cu Chi Tunnels, built by resistance fighters during the Vietnam War, or journey to Ba Ria and attend a Long Tan memorial service. Later, you will be treated to a degustation dinner with matching wines at Saigon’s acclaimed Xu Restaurant, inspired by celebrity chef and APT ambassador Luke Nguyen. In key locations you can also choose from a range of Freedom of Choice activities. In Ho Chi Minh, options include a visit to the Ky Long Art Villa, a walking tour and cyclo ride, a cookery class or a shopping outing, all at no extra cost. Room with a view: a luxurious suite on board the cruise ship Next, you’ll step aboard the RV AmaLotus for your eight-day luxury Mekong river cruise. On board your ship, there’s a guest-to-staff ratio of 2:1, exemplary service and Khmer, Vietnamese and Western cuisine to enjoy along with complimentary drinks throughout. Suites are spacious and a variety of public areas include a sun deck with a pool and panoramic viewing lounges to watch snapshots of everyday life in Vietnam slip by. All this and you only have to unpack once. Going ashore in Cai Be you’ll visit a rice-paper manufacturer; learn the story behind Marguerite Duras’ novel The Lover and visit a traditional temple in Sa Dec; and you’ll take a rickshaw tour of Tan Chau. Passing into Cambodia, there’s an overnight stop in its sultry capital Phnom Penh. Here, you can choose to take a poignant guided tour to the infamous Killing Fields and the Genocide Museum, or to the Royal Palace complex with its ornate Silver Pagoda. Continuing upriver, there are shore excursions to the remote village of Koh Chen, known for its copperware; Oudong, where on a visit to a Buddhist monastery monks will shower you with lotus petals to bring you happiness; and lush Wat Kampong Tralach, where an ox-cart ride through rice fields takes you back to your ship. Tuck in: savour a traditional Vietnamese shrimp dish On board, as you enjoy a farewell dinner, you will float through the beautiful Kampong Chhnang wetlands. Disembarking the following morning, you’ll transfer to Siem Reap and stay three nights at the five-star Sofitel Angkor, giving easy access to the World Heritage-listed Angkor Archaeological Park. There can be no more fascinating inclusion to an itinerary than a close-up view of the ancient temples, such as the 12th-century Bayon and the root-covered Ta Prohm. And for something really special, you’ll witness a magical sunrise with champagne at Angkor Wat. Meanwhile, Freedom of Choice experiences in Siem Reap include a bicycle tour, quadbiking, a cooking class, an Apsara dance class or a relaxing spa treatment. For an authentic insight into local life in these exotic countries, APT’s Vietnam & Cambodia Highlights tour is outstanding. Tour highlights • Get active Enjoy Freedom of Choice activities, such as cooking or dance classes or bicycle tours, in Ho Chi Minh City and Siem Reap. • Fine dining In Ho Chi Minh, enjoy a degustation dinner designed by celebrity chef and APT ambassador Luke Nguyen at Xu Restaurant. • Going underground Visit the Cu Chi Tunnels in Ho Chi Minh or tour Long Tan and attend a memorial service. • Authentic travel Take a tour of Tan Chau by rickshaw and explore Wat Kampong Tralach by ox-cart. • Poignant reminders Take a moving excursion to the infamous Killing Fields and Tuol Sleng Genocide Museum in Phnom Penh. • Ancient wonders Explore Angkor Archeological Park from Siem Reap and experience sunrise with champagne at Angkor Wat. • Body and soul Experience a Buddhist blessing and be showered with lotus petals at the monastery in Oudong. What’s included • APT’s 15-day Vietnam & Cambodia Highlights luxury river cruise and tour costs from £3,795pp, twin share. Book by 31 October 2015 and your companion flies free. Price includes flights, sightseeing, five-star accommodation, 31 meals, unlimited drinks on board, tips, taxes, porterage and home-to airport transfers by private car. Departures July 2016 to April 2017. • Take a virtual tour of the AmaLotus » • For more information or to book, call 0800 046 7729 or visit aptouring.co.uk »", "external_links": [], "published": "2015-09-25T20:14:00.000+03:00", "crawled": "2015-09-25T14:47:51.826+03:00", "highlightTitle": ""}