{"organizations": [], "uuid": "91fb3099d0c7cf11b9740258adeb5a36d89ed0e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/02/Marriott-300x300.gif", "site_section": "http://www.travelandtourworld.com/news/article/category/europe-travel-news/", "section_title": "Europe Travel News - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/marriott-europe-aims-to-create-20000-career-opportunities-for-young-people-by-2020/", "country": "US", "title": "Marriott Europe aims to create 20,000 career opportunities for young people by 2020Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Marriott Europe aims to create 20,000 career opportunities for young people by 2020Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "91fb3099d0c7cf11b9740258adeb5a36d89ed0e5"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/marriott-europe-aims-to-create-20000-career-opportunities-for-young-people-by-2020/", "ord_in_thread": 0, "title": "Marriott Europe aims to create 20,000 career opportunities for young people by 2020Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Marriott Europe aims to create 20,000 career opportunities for young people by 2020 Published on : Thursday, September 10, 2015\nThroughout the month of September, participating Marriott International Hotels in Europe will donate £1 or €1 for every lunch and dinner served as part of a Europe-wide ‘You Eat, We Give’ campaign established by Marriott to raise funds to help tackle youth unemployment.\nThe promotion is part of Marriott’s Europe-wide “World of Opportunity” initiative, which helps young people from disadvantaged backgrounds reach their full potential by providing employment skills and vocational opportunities. In the UK, Marriott’s funding will enable youth charity The Prince’s Trust to run employability courses for vulnerable young people and in Europe the funds will provide vocational training and scholarships through SOS Children’s Villages’ Youth Programme.\nOver the past four years, Marriott in Europe has raised nearly €1.5 million cash and in-kind donations for its charitable partners and offered training and development opportunities to 650 disadvantaged youths, with some securing jobs in culinary fields.\n“This fundraising campaign is now in its fourth year and it continues to be a rewarding project for our hotels and also our charitable partners. ‘You Eat, We Give’ is a way for us to show our commitment to helping young people in Europe find meaningful employment. Giving back to our community is at the heart of the Marriott culture and the way we do business. We look forward to welcoming guests into our hotels for a great meal while showing support to the young people in our communities,” said Reiner Sachau, chief operations officer for Marriott International in Europe.\nMarriott’s long-term commitment to responsible business practices includes support that ‘gives back’ to local communities. The company supports local and global charities through financial contributions, in-kind donation of products and services and the volunteer services of our associates around the world. In addition to youth employability, Marriott’s social responsibility strategy encompasses sustainability, hunger relief, affordable housing, children’s well-being, education in the hospitality industry and empowerment of women, people with disabilities and other underrepresented groups. In Europe last year, Marriott’s charitable contributions totalled more than €2.4 million in cash and in-kind donations and more than 40,000 hours of volunteer time.", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T00:20:29.530+03:00", "highlightTitle": ""}