{"organizations": [], "uuid": "2180967f2f46c6c1171b14bdccc0867fb4f7bd99", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/iberiaexpress.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/iberia-group-to-launch-birmingham-madrid-route/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Iberia Group to Launch Birmingham-Madrid RouteTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Iberia Group to Launch Birmingham-Madrid RouteTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "35c24a7924c2798459eda649b44918baa551e604"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/iberia-group-to-launch-birmingham-madrid-route/", "ord_in_thread": 0, "title": "Iberia Group to Launch Birmingham-Madrid RouteTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Iberia Group to Launch Birmingham-Madrid Route  \nThe Iberia Group will launch a new Birmingham-Madrid service on 27 March 2016. The low-cost carrier Iberia Express will operate the return flights on Mondays, Wednesdays, Fridays and Sundays.\n \nOn the route the airline will use 180-seat Airbus A320s with Business and Economy sections. The timetable will be as follows:\n \n \nFlight no. From At To At Days   IB3709  \nBirmingham  \n10:35  \nMadrid  \n14:05  \nMon., Fri.  \nIB3708  \nMadrid  \n08:45  \nBirmingham  \n10:00  \nMon., Fri.  \nIB3709  \nBirmingham  \n17:35  \nMadrid  \n21:05  \nWed., Sun.  \nIB3708  \nMadrid  \n15:45  \nBirmingham  \n17:00  \nWed., Sun. \n \nMadrid is a major destination for business travellers and tourists alike. Famous for its art museums as well as its football teams, Madrid is also a shopper’s paradise, boasting both name-brand shops and independent establishments offering the highest quality for affordable prices. Another attraction is the variety and quality of the city’s many restaurants.\n \nThe Birmingham flights are scheduled to offer the best connections in Madrid to another 34 Iberia Groupdestinations, such as Alicante, Bilbao, Gran Canaria, Jerez, Malaga, Majorca and Tenerife in Spain; Lisbon and Oporto in Portugal; Luanda, Malabo, Lagos and Dakar in Africa; Tel Aviv; and Buenos Aires, Havana, Mexico City, Montevideo, Santiago de Chile, and São Paulo in Latin America.\n \nSilvia Mosquera, Commercial Director of Iberia Express, said “This new route strengthens our capacity in the United Kingdom, the country where we offer the largest number of flights and from which we bring many tourists to Spain. Our flights will expand connection options for people in Birmingham, Britain’s second-largest city, and the West Midlands, where the Iberia Group will be operating for the first time.”\n \nAccording to Paul Kehoe, Chief Executive at Birmingham Airport , “The West Midlands is a thriving business region which needs greater global connectivity to grow trade and open up new business opportunities. Iberia can offer this through its strong network from Madrid to many of the world’s emerging markets and we are delighted that the airline has chosen Birmingham as its new UK airport, recognising our strong catchment and extensive business and leisure market in our region.”\n \n \nSource:- Birmingham Airport", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T18:35:48.033+03:00", "highlightTitle": ""}