{"organizations": [], "uuid": "c5a68459c95c6c496d63ffe6abbe78f59573f1c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29943110/connectedyard-announces-seed-funding-from-investors-including-playground-global-and-tandem-capital-for-phin-the-smart-pool-and-hot-tub-solution", "country": "US", "title": "ConnectedYard Announces Seed Funding from Investors Including Playground Global and Tandem Capital for pHin, the Smart Pool and Hot Tub Solution", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "ConnectedYard Announces Seed Funding from Investors Including Playground Global and Tandem Capital for pHin, the Smart Pool and Hot Tub Solution - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "c5a68459c95c6c496d63ffe6abbe78f59573f1c5"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29943110/connectedyard-announces-seed-funding-from-investors-including-playground-global-and-tandem-capital-for-phin-the-smart-pool-and-hot-tub-solution", "ord_in_thread": 0, "title": "ConnectedYard Announces Seed Funding from Investors Including Playground Global and Tandem Capital for pHin, the Smart Pool and Hot Tub Solution", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " ConnectedYard\nCAMPBELL, Calif. , Sept. 2, 2015 /PRNewswire/ -- ConnectedYard, an innovator in smart technology and the Internet of Things (IoT), today announced that it has closed a $2.2-million seed round of funding led by Playground Global. The round was also joined by ConnectedYard's pre-seed investor, Tandem Capital.\npHin, the company's first product, is reinventing pool and hot tub care by combining a Bluetooth® Smart and WiFi-enabled sensor, a mobile phone app and pre-measured chemicals into a subscription-based solution to take the guesswork out of maintaining chemical balance and water quality.\n\"The U.S. market alone encompasses more than 14 million residential pools and hot tubs, representing a significant opportunity for pHin,\" said Justin Miller , Co-Founder and CEO of ConnectedYard. \"Our goal is to bring simplicity and fun to the backyard through the Internet of Things. We are very gratified to have the support of investors who are experts in deploying smart technology.\"\n\"pHin is not just another connected sensor for your home. The ConnectedYard team is building an intelligent system that provides homeowners a frictionless, full-service solution for maintaining the quality and care of their pools. We are excited to be partnering with entrepreneurs like Justin and Mark who are dedicated to delighting customers and who exemplify the depth of product vision that gets us excited about the long-term potential for the company,\" said Bruce Leak , Co-Founder of Playground Global.\nRecent research from International Data Corporation indicates that the worldwide IoT market will reach $1.7 trillion in 2020 on a compound annual growth rate of 16.9%. The majority of that market is expected to involve devices, connectivity and IT services, with devices (modules/sensors) alone representing 31.8% of the total. In addition, earlier this year, BI Intelligence released a report indicating that connected-home device shipments will grow at a compound annual rate of 67% over the next five years and will comprise some 25% of the broader IoT category.\n\"We recognized the innovation represented by pHin and were very pleased to be the initial investor in this revolutionary concept. It's a perfect fit with our focus on supporting developers who are accelerating the integration of hardware, platforms and apps,\" said Doug Renert , Partner of Tandem Capital. \"It is highly encouraging to see the company moving ahead rapidly and to have the opportunity to place a follow-on investment in its very positive future.\"\npHin continuously monitors pool and hot tub water quality on a 24/7 basis, with automatic alerts sent to a mobile device when chemicals are needed. Also provided under the subscription-based solution are shipments of pre-measured, water-soluble, color-coded chemical pods as well as access to a network of on-demand, qualified pool service technicians. Currently offered for pre-sale, pHin will be available in the first quarter of 2016.\n\"The pHin solution has generated tremendous interest from the tech community, the media, the pool service industry and pre-sale customers alike,\" noted ConnectedYard Co-Founder and COO Mark Janes . \"That level of affirmative response tells us unequivocally that we are on the right track with a perfect match of state-of-the-art product, strong market demand and international interest for rapid growth.\"\nFor more information and to pre-purchase, visit www.phin.co .\nAbout ConnectedYard\nConnectedYard, headquartered in Silicon Valley ( Campbell, Calif. ), is dedicated to being the center of the connected backyard. pHin is reinventing the pool industry with smart technology designed to help people have more time to enjoy an outdoor lifestyle. Learn more at www.phin.co , @getPhin and on Facebook .\nPhoto - http://photos.prnewswire.com/prnh/20150902/263104\nLogo - http://photos.prnewswire.com/prnh/20150601/219935LOGO\n releases/connectedyard-announces-seed-funding-from-investors-including-playground-global-and-tandem-capital-for-phin-the-smart-pool-and-hot-tub-solution-300136733.html\n ", "external_links": ["https://www.facebook.com/getpHin", "http://photos.prnewswire.com/prnh/20150902/263104", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA92414&Transmission_Id=201509021200PR_NEWS_USPR_____LA92414&DateId=20150902", "http://www.phin.co/", "http://photos.prnewswire.com/prnh/20150601/219935LOGO", "https://photos.prnewswire.com/prnvar/20150902/263104", "http://www.prnewswire.com/news-releases/connectedyard-announces-seed-funding-from-investors-including-playground-global-and-tandem-capital-for-phin-the-smart-pool-and-hot-tub-solution-300136733.html", "http://photos.prnewswire.com/prnvar/20150601/219935LOGO"], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T20:56:26.265+03:00", "highlightTitle": ""}