{"organizations": [], "uuid": "df5c445fdc07baaedbadadf08779fcaf4af93cc8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03456/aa-hero-son-rescue_3456877a.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-29.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/motoring/extraordinary-road-tales/11885075/aa-recovery-keys-locked-in-car.html", "country": "US", "title": "AA recovery patrol: 'I locked my keys in the car'", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "AA recovery patrol: 'I locked my keys in the car' - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T19:41:00.000+03:00", "replies_count": 0, "uuid": "df5c445fdc07baaedbadadf08779fcaf4af93cc8"}, "author": "Adrian Monti", "url": "http://www.telegraph.co.uk/sponsored/motoring/extraordinary-road-tales/11885075/aa-recovery-keys-locked-in-car.html", "ord_in_thread": 0, "title": "AA recovery patrol: 'I locked my keys in the car'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "More roadside recovery stories » Our six hour drive to North Devon had been hellish. Holiday traffic, numerous diversions and a sat nav that froze somewhere south of Salisbury were accompanied by the soundtrack of our two squabbling toddlers in the backseat. In the front, my wife Judy and I were no better. I couldn’t believe she hadn’t packed my “other” flip flops. You get the picture. So some 270 miles later, when we finally arrived at our rental cottage, we were hardly full of holiday exuberance. But what had happened on the drive down was merely the amuse-bouche of what was to follow. As Judy stomped towards the cottage, I began to unpack the car. After tossing the car keys on the luggage shelf, I eased the travel cot out and slammed the boot shut still seething about my flip flops. And then it dawned on me. Once that boot had firmly shut, I’d entombed the key – which controlled the car’s central locking – inside. Our spare key was still safe... but in a kitchen drawer back home. All eyes turned to our three-year-old son Kit. Would he be able to save the day? After all break-in attempts (bar using the travel cot as a battering ram) failed, I called the AA. When the smiling recovery patrol arrived, I admit I felt a fraud. This skilled mechanic, who could breathe life into cars stranded on the hard shoulder, was now going to fathom out how to hoick my key from behind the backseat headrest. Following a fair bit of huffing and puffing, the AA recovery patrol eventually eased the rear passenger window open several inches. Not enough for us to reach the key, but enough for someone to go in and retrieve them. Someone very small…. All eyes turned to our three-year-old son Kit. Would he be able to save the day? The fate of our holiday was in the hands of a young boy now trying to force a pair of swimming trunks over his brother’s head. Rescue Kit: Adrian's three-year-old son saved his family from holiday hell Photo: © moodboard / Alamy Stock Photo I gave Kit a quick pep talk. I told him his hero Fireman Sam would relish coming to the rescue like this. But no, he wouldn’t need a turntable ladder or jet hose for this task. I instructed him to slither in, grab the keys and pass them to Daddy. I fed him through the gap and he clambered over the car seats and grabbed the key. Luckily my unrestrained cheering didn’t distract him. With a single click, the magical sound of the car unlocking rang out. After much back-patting of Kit and thanking the AA recovery patrol, the holiday could at last begin. Grins replaced grimaces as I slipped the precious key into my pocket. Kit was that week’s hero and the “other” flip flops were never mentioned again. Don’t let your holiday take a turn for the worse. When the unpredictable happens, the AA is there to help. Find out more at theaa.com", "external_links": [], "published": "2015-09-29T19:41:00.000+03:00", "crawled": "2015-09-29T14:20:29.613+03:00", "highlightTitle": ""}