{"organizations": [], "uuid": "0e23ca94989e3fb292f55786b217d3bb2d256804", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29978789/2015-consumers-choice-award-for-movers-in-dallas-fort-worth-honors-north-dallas-moving-and-storage-ndms-for-excellence", "country": "US", "title": "2015 Consumers' Choice Award for Movers in Dallas-Fort Worth Honors North Dallas Moving and Storage (NDMS) for Excellence", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "2015 Consumers' Choice Award for Movers in Dallas-Fort Worth Honors North Dallas Moving and Storage (NDMS) for Excellence - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "0e23ca94989e3fb292f55786b217d3bb2d256804"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29978789/2015-consumers-choice-award-for-movers-in-dallas-fort-worth-honors-north-dallas-moving-and-storage-ndms-for-excellence", "ord_in_thread": 0, "title": "2015 Consumers' Choice Award for Movers in Dallas-Fort Worth Honors North Dallas Moving and Storage (NDMS) for Excellence", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " North Dallas Moving and Storage\nDallas Moving Company NDMS Earns Second Consecutive Consumers' Choice Award for Best Residential Movers in Dallas-Fort Worth Metroplex\nDALLAS , Sept. 8, North Dallas Moving and Storage (NDMS) was recently honored with a 2015 Consumers' Choice Award for best residential movers in Dallas-Fort Worth . This marks the second consecutive year the Dallas moving company has won the award, which recognizes business excellence as exemplified by superior customer service, integrity and professionalism.\nLogo - http://photos.prnewswire.com/prnh/20150908/264256LOGO\nArea residents cast more than 25,000 votes for their favorite local businesses in the annual VoteDFW.com campaign, which determines the winners of the Consumers' Choice Awards across dozens of categories. The program is managed by Market Data Systems, Inc. with polling assistance from Survey Sampling International.\n\"We're honored to have earned a Consumers' Choice Award for the second year in a row, and we're grateful to our customers for their vote of confidence,\" said Brandon Morris , President of North Dallas Moving and Storage. \"Our company takes great pride in delivering exceptional relocation services, exceeding customers' expectations, and giving back to the community in which we live and work.\"\nNDMS provides household and commercial/office solutions for local and long-distance relocations, including in-state and interstate moving services. Family owned and locally operated since 1966, the company is a top booking agent for United Van Lines. In addition to the 2015 Consumers' Choice Award, NDMS has further distinguished itself among Dallas movers with a 2015 Best of Carrollton Award, a United Van Lines Master Club Award and a consistent A+ rating from the Better Business Bureau.\nTo learn more about North Dallas Moving and Storage and its full range of moving services and secure storage solutions, visit http://www.ndms.com .\nAbout North Dallas Moving and Storage:\nFounded in 1966, North Dallas Moving and Storage (NDMS) is a family-owned and operated business serving residential and commercial customers throughout Texas . NDMS was appointed as agent for United Van Lines in 1975 and has since established itself as one of United's largest booking agents. The company offers local moving and storage solutions for residential and commercial clients throughout the Dallas/Fort Worth metroplex, while its interstate movers provide long-distance moving and relocation services nationwide. NDMS has consistently maintained an A+ rating from the Better Business Bureau and has earned many accolades, including the Consumer's Choice Award, United Van Lines Masters Club Award and Best of Carrollton Award. NDMS is affiliated with the American Moving & Storage Association (AMSA) as well as its ProMover and Registered International Mover (RIM) programs, and the company is a proud supporter of MoveRescue, Move for Hunger, and the North Texas Food Bank (NTFB) and its Food 4 Kids program.\nMedia Inquiries:\nBrandon Morris\nPresident\nNorth Dallas Moving and Storage\nhttp://www.ndms.com\nMoving Company in Carrollton, TX\n(972) 241-1562\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/2015-consumers-choice-award-for-movers-in-dallas-fort-worth-honors-north-dallas-moving-and-storage-ndms-for-excellence-300138943.html\n ", "external_links": ["https://plus.google.com/+NdmsDallas/posts", "http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=PH95706&Transmission_Id=201509080821PR_NEWS_USPR_____PH95706&DateId=20150908", "http://www.prnewswire.com/news-releases/2015-consumers-choice-award-for-movers-in-dallas-fort-worth-honors-north-dallas-moving-and-storage-ndms-for-excellence-300138943.html", "http://photos.prnewswire.com/prnh/20150908/264256LOGO", "http://www.ndms.com/"], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T16:23:13.018+03:00", "highlightTitle": ""}