{"organizations": [], "uuid": "28ce5737a01f1d01a4e8943d142e362ae71cdfee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/incoming/2015/01/28/hlaudi-motsoeneng-xxx-january-28-2015/ALTERNATES/crop_100x100/Hlaudi+Motsoeneng+xxx+January+28+2015", "site_section": "http://www.bdlive.co.za/life/travel", "section_title": "Travel &amp; Food | BDlive ", "url": "http://www.bdlive.co.za/national/media/2015/09/23/sabc-annual-report-shows-hlaudi-motsoenengs-r1m-salary-increase", "country": "ZA", "title": "SABC annual report shows Hlaudi Motsoeneng’s R1m salary increase | Media", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "SABC annual report shows Hlaudi Motsoeneng’s R1m salary increase | Media | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T22:51:00.000+03:00", "replies_count": 0, "uuid": "28ce5737a01f1d01a4e8943d142e362ae71cdfee"}, "author": "Bekezela Phakathi", "url": "http://www.bdlive.co.za/national/media/2015/09/23/sabc-annual-report-shows-hlaudi-motsoenengs-r1m-salary-increase", "ord_in_thread": 0, "title": "SABC annual report shows Hlaudi Motsoeneng’s R1m salary increase | Media", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hlaudi Motsoeneng. Picture: RUSSELL ROBERTS Related articles SABC annual report shows Hlaudi Motsoeneng’s massive salary increase NEWS ANALYSIS: Muthambi stance on SABC’s Motsoeneng sets bad precedent In this article Companies and organisations: South African Broadcasting Corporation THE South African Broadcasting Corporation’s (SABC’s) annual report shows that controversial chief operating officer Hlaudi Motsoeneng received an almost R1m pay bump in the 2014-15 financial year.\nAccording to the report, tabled in Parliament this week, Mr Motsoeneng’s salary increased by R912,000, which included a R279,000 bonus, in the period.\nHis salary jumped from R2.8m to R3.7m.\nThe Democratic Alliance (DA) said on Wednesday that the increase was \"incomprehensible, given the ongoing crisis at the SABC\".\nDA spokesman on communications and MP Gavin Davis said there could be no justification for Mr Motsoeneng’s 31% pay rise.\n\"The DA will be requesting that the public protector investigate the lawfulness of Motsoeneng’s million-rand pay rise. We cannot sit back and allow Motsoeneng to wreck the SABC and be rewarded handsomely for doing so,\" Mr Davis said.\nThe SABC has been riddled with acute financial, personnel and management troubles.\nIn 2014 Public Protector Thuli Madonsela released a report which found that Mr Motsoeneng’s salary had risen from R1.5m to R2.4m in one year. Also, according to the report, he had lied about his academic qualifications and purged senior staff.\nThe public protector recommended that Mr Motsoeneng, who was acting chief operating officer at the time, be suspended, pending a disciplinary inquiry.\nBut he remains in his position and no disciplinary action has been taken against him.\nIn the same year, Communications Minister Faith Muthambi endorsed Mr Motsoeneng’s appointment as the permanent chief operating officer.\nThe DA then lodged an application in the Western Cape High Court, seeking an enforcement of the public protector’s recommendations. The court ordered that the SABC chief operating officer be suspended, pending a disciplinary inquiry.\nBut Mr Motsoeneng appealed the ruling, and the case was heard in the Supreme Court of Appeal on Friday.\nThe appellate court reserved judgment.\n\"The fact is that Motsoeneng should have been suspended and disciplined by the SABC board, as directed by the public protector. Instead, Motsoeneng continues to rake in millions at the expense of the TV licence-paying public,\" Mr Davis said.", "external_links": [], "published": "2015-09-23T22:51:00.000+03:00", "crawled": "2015-09-23T18:12:21.917+03:00", "highlightTitle": ""}