{"organizations": [], "uuid": "f7c7d4f5b85d520b41431de278fc29b6603b9552", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63251/becky-vealey-appointed-new-general-manager-sheraton-sioux-falls", "country": "US", "title": "Becky Vealey appointed new General Manager of Sheraton Sioux Falls", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Becky Vealey appointed new General Manager of Sheraton Sioux Falls", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T02:38:00.000+03:00", "replies_count": 0, "uuid": "f7c7d4f5b85d520b41431de278fc29b6603b9552"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63251/becky-vealey-appointed-new-general-manager-sheraton-sioux-falls", "ord_in_thread": 0, "title": "Becky Vealey appointed new General Manager of Sheraton Sioux Falls", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Becky Vealey appointed new General Manager of Sheraton Sioux Falls   \nSep 01, 2015   \nSIOUX FALLS, SD & SPRINGFIELD, MO - John Q Hammons Hotels & Resorts (JQH) today announced the appointment of Becky Vealey to general manager of the company’s owned and operated Sheraton Sioux Falls & Convention Center in South Dakota. Vealey, an 18-year veteran of JQH, will be responsible for overseeing operation of the 243-room/suite, upscale hotel and maintaining high quality standards and guest satisfaction. Springfield, Mo.-based JQH is a leading private, independent owner and manager of hotels in the United States. The company also operates more than 5.4 million gross square feet of superb meeting and convention space. \n“Becky is a true motivator of people and has a proven drive that transcends into results, as reflected by her other successful assignments with JQH. We foresee her being a great leader at the Sheraton Sioux Falls,” said Tony Moody, JQH regional vice president. \nMost recently, Vealey served as director of sales and marketing for JQH’s award-winning Embassy Suites by Hilton Nashville SE – Murfreesboro in Tennessee, ranked among the top performing Embassy Suites across the Americas. During her nine years with the Murfreesboro property, she was recognized for many accomplishments, including Embassy Suites Director of Sales of the Year, Murfreesboro Magazine Women in Business, and JQH Sales Leadership in Excellence. She also worked as opening director of sales and marketing for JQH’s Embassy Suites by Hilton Hampton Roads – Hotel, Spa and Convention Center in Virginia, and as director of sales and marketing for JQH’s Embassy Suites by Hilton Charleston in West Virginia. Vealey is active in the communities in which she lives and works, with a special interest in early childhood literacy. \n“I’m so pleased to continue my journey within JQH. I appreciate the company’s strong values and emphasis on maintaining high quality properties, so we can focus on an exceptional guest experience,” Vealey said. “I look forward to collaborating with the Sioux Falls Convention Center and Denny Sanford PREMIER Center to help attract group business to the area.”", "external_links": [], "published": "2015-09-02T02:38:00.000+03:00", "crawled": "2015-09-02T05:58:01.002+03:00", "highlightTitle": ""}