{"organizations": [], "uuid": "79c56b279521743285fdd3e05461e5d256f31169", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/09/14/18/2C5044B100000578-0-image-a-27_1442253200653.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3234179/Why-open-luggage-bathroom-floor-paper-peephole-door-hotel-secrets-guest-know.html", "country": "GB", "title": "Hotel secrets guests should know including opening luggage on the bathroom floor", "performance_score": 1, "site": "dailymail.co.uk", "participants_count": 31, "title_full": "Hotel secrets guests should know including opening luggage on the bathroom floor | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T15:07:00.000+03:00", "replies_count": 32, "uuid": "ba40a74e44dfe3100547cfb4bff3d34c8cd72227"}, "author": "Becky Pemberton For Mailonline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3234179/Why-open-luggage-bathroom-floor-paper-peephole-door-hotel-secrets-guest-know.html#post-0", "ord_in_thread": 0, "title": "Hotel secrets guests should know including opening luggage on the bathroom floor", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "20 shares 38\nView\ncomments\nIt's a thought you may not want to linger on - that thousands of people have stayed in your hotel room before you and left a few germs behind, too.\nNow insiders have revealed how these often actually congregate on wooden luggage racks and that some hotels even use UV wands to spot bacteria the human eye can't see.\nAnd that's not all.\nThese experts, including Michael Forrest Jones, who works for Beechmont Hotels Corporation, and insider-turned-author Jacob Tomsky, go on to reveal lots of other hotel secrets that will make you see your next stay in a whole new light.\nScroll down for video\nSore point: Wooden luggage racks can be a breeding ground for bedbugs\nDon't use wooden luggage racks\nIf you arrive at a hotel which has a luggage rack, be aware of what it is made of before placing your suitcase on it.\nForrest Jones wrote on a post on Quora : 'After checking the bathroom floor to see that it appears clean, open your bag there. It's literally safer.\n The bizarre spa where guests soak in baths filled with BEER... The iconic Icehotel in Sweden reveals the magical suites set... A masterpiece: Michelangelo's sprawling eight-bedroom... Feel the force: Star Wars invasion at Disney World pulls... 20 shares 'Bedbugs love wood and they don't come from nasty people, they come from baggage that's been in nasty places.'\nHow often is everything cleaned?\nLast year Buzzfeed leaked an unnamed three-star hotel chain's cleaning schedule – and the findings make for grim reading.\nCLEANED ONCE A MONTH Room edging\nCords behind the night-stand\nCheck for cobwebs\nMarks on the walls\nHVAC filter\nRoom threshold\nToilet hinges\nLoo roll holders\nSink overflows\nBathroom door and frame\nCurtains\nLampshades\nChairs\nCushions\nPicture frames\nCLEANED JUST FOUR TIMES A YEAR Bedspreads\nBlankets\nMattress pads\nShower curtains\nForrest Jones agreed that every three or four months rooms are subjected to a deep clean.\nThis process involves the mattresses being stripped of all linens and mattress covers, left to air for several hours, then flipped over and left to air some more before the bed is again made.\nAs this process is happening, the furniture, curtains and carpets, which should never be more than ten years old, are cleaned.\nMattresses have a life expectancy of maybe five years, even if they are flipped regularly.\nSome hotels check for germs using a UV wand\nRoom quality can be determined based on how many fixtures are in the bathroom, including sinks, baths, stand-alone showers and a toilets\nThe eye may think something is clean and stain free, but a UV light will reveal the full, and less pleasant, truth.\nBest Western hotels now use ultra violet sterilisation wands from Purelight that are used to sterilise 'high touch points' in the hotel such as telephones, clocks, light switches, door handles, bathroom fixtures and common areas.\nThey also routinely use UV inspection black lights to detect any biological matter, food particles, and more, that the human eye cannot see.\nFrom doing history checks to finding the perfect room, the check-in process can have up to 26 steps, sometimes on a slow computer system\nThis is why check-in takes so long\nYou may be desperate to get to your room, but a surprisingly large amount of your information is logged by the hotel before.\nSystems will scan guests' driver's licences and extract as much data as possible.\nIdentification will be verified, not just for use with a credit card, but sometimes to check if a guest qualifies for any rates they are given, e.g. if they get a discount through work.\nThere will also be a history check performed, which brings up previous information and whether the person is enrolled on a rewards program.\nFollowing this, a room that matches the requirement needs to be sourced, along with bookings for wake-up calls and extra assistance with luggage.\nStacy Jean with five years industry experience wrote on Quora : 'In addition, even though all of this information may be in the computer already, most of the hotels I've worked at have old systems that require you to key your way through every single step, whether or not you need to type the information.\n'In all, it's about 26 steps, some of which require a brief wait (say, to verify the credit card).'\nHOW TO SPEED UP YOUR CHECK-IN PROCESS Forrest Jones said that the complexity of computer records for hotels varies, but there are certain factors which can help speed up the process when you arrive:\nKeep your requirements simple. If you must have a fifth floor non-smoking king with a view of the pool, it might take a while to juggle things around to find you one. Stick with the same hotel on each stay. It won't always work, but in many cases, you'll be in the system's guest history. Join the hotel brand's loyalty program. Much of the information will already be kept on file: all the clerk has to do is enter the loyalty program number. The reason loyalty programs exist is to collect, store, properly route, and analyse guest information. Make your reservation in advance. They'll already have much of the information in place when you show up.\nLodging a piece of paper in the peep hole is a good solution to ensuring your safety, if you think it has been broken\nCheck the peep hole\nIt may not be the first thing you think of when you enter your room, but inspect the door's peep hole when you arrive.\nIf it has been damaged or tampered with, Forrest Jones advises asking for a different room.\nRemember, ESPN's Erin Andrews was filmed while she was naked in 2009 by a stalker who removed the peephole from her hotel door.\nJones said: 'After you check your peephole to make sure it's not damaged, missing or tampered with, find a piece of notepaper, tear off a strip of it, roll it up and twist it until it's about the size of a cigarette butt, and 'plug' it in the peephole.'\nMake sure it is not lodged in too deeply so it can be removed when you check-out of your room.\nHow do they work out prices for each room\nZeev Sharon, CEO & Co-Founder of Hotelied, said on Quora : 'The old industry rule of thumb is that for every $1,000 invested in a room's construction, the hotel should charge $1 in average daily rate.\n'So a room that cost $300,000 to build, should sell on average for $300/night.'\nSharon explained that the quality of a room can be determined by the fixtures in a bathroom, the most expensive area to build in guest rooms.\n'A standard three-fixture bathroom has a sink, bath and toilet, a five-fixture bathroom is more typical for luxury hotels, and has two sinks, a bath, stand-alone shower and a toilet,' he said.\nSome hotels use a UV wand or back light to check for germs that the eye alone cannot see\nThere is a protocol for when people die in their room\nTomsky, who worked in two top hotels in New Orleans and New York City, admitted to MailOnline Travel that deaths in hotels are not quite as rare as guests may think.\n'It's not something a hotel wishes to publicise, naturally,' he explained. 'So, they are removed as discreetly as possible.\n'This may involve flashing lights and paramedics, depending on the severity of the situation, but can also happen via employee elevators and back exits.'\nHe added: 'Death is a part of hotel life.'\nIf a death occurs, once the person is removed, the room is sanitised, cleaned and made available to the next guest - and that can happen a lot faster than you think.\nHowever, don't expect much information from the hotel about this. Staffers are forbidden from revealing any details of cause of death and room numbers.\nIf a death occurs, once the person is removed, the room is sanitised, cleaned and made available to the next guest - and that can happen a lot faster than you'd think\nStaff don't care as much as you think\nFor particularly difficult guests, it is not unknown for a staff member to seek revenge on their toothbrush or even change their key card to lock them out of their room, claimed Tomsky.\nHe said he came across staffers who stole from minibars and from valet-parked cars. Often, the mischief that staffers engaged in was purely out of boredom, he said.\nForrest Jones said that housekeepers rush in order to fulfil their Quote: of rooms, and can get questioned if they take more than a half-hour to make a room, or 15 minutes to service a room occupied by a stay-over guest.\nMany housekeepers are rushed, and a lot of the time, no one goes behind them to inspect the rooms.\nStaff look through your personal items\nTomsky claimed that boredom led to rifling through guests' stuff, reading intimate information about them and giggling over their collections of sex toys.\n'I found a pretty foul letter left in a room,' he said. 'It was about someone's wife being a whore. It was probably a joke, because there was a stamp on it of genitalia, addressed to a Mr. Cuckold, with details about her sexual activities.'\nYou may want to think twice about using hand towels according to hotel industry insider Michael Forrest Jones\nBeware hand towels\n'You know where you almost always find a hand towel in any recently-vacated hotel room that was occupied by a guy? On the floor... next to the bed,' said Forrest Jones.\nThe hotel has enough for three times the amount of guests\nForrest Jones said that ideally, a hotel will keep three 'turns', or 'par', of sheets and towels, which means enough supplies to make every room in the hotel, three times over .\nIf an item has a visible stain that doesn't come out in the wash, it will be retired, and if the quality reasonable, it will be dyed red or blue and used as a cleaning rag.\nRead more: We Found A 3-Star Hotel Chain's Cleaning Guide, And We Were Shocked At What Gets Cleaned The Least What are the things we don't know about hotel rooms? - Quora Michael Forrest Jones's answer to What are the things we don't know about hotel rooms? - Quora www.quora.com/Wh...", "external_links": ["https://www.quora.com/What-are-the-things-we-dont-know-about-hotel-rooms/answer/Michael-Forrest-Jones", "http://www.buzzfeed.com/keithhabersberger/we-found-a-3-star-hotel-chains-cleaning-guide-we-were-shocke#.qr4bZjw4wQ", "http://pubads.g.doubleclick.net/gampad/ads?sz=", "https://www.quora.com/Why-does-it-take-so-long-to-check-in-at-hotels/answer/Stacy-Jean", "http://www.quora.com/What-are-the-things-we-dont-know-about-hotel-rooms", "http://dailym.ai/1iNXmuT"], "published": "2015-09-16T15:07:00.000+03:00", "crawled": "2015-09-16T12:01:10.246+03:00", "highlightTitle": ""}