{"organizations": [], "uuid": "ed57cd8e3d6ed46aee45ae7904befb1c0844368f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63210/jamaica-house-beijing-activities-big-boost-brand-jamaica", "country": "US", "title": "Jamaica House Beijing activities a big boost for Brand Jamaica", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Jamaica House Beijing activities a big boost for Brand Jamaica", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:35:00.000+03:00", "replies_count": 0, "uuid": "ed57cd8e3d6ed46aee45ae7904befb1c0844368f"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63210/jamaica-house-beijing-activities-big-boost-brand-jamaica", "ord_in_thread": 0, "title": "Jamaica House Beijing activities a big boost for Brand Jamaica", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jamaica House Beijing activities a big boost for Brand Jamaica   \nSep 01, 2015 Dr. Wykeham McNeill discusses Jamaica's interest in attracting more Chinese visitors   \nKINGSTON, Jamaica – Minister of Tourism and Entertainment, Hon. Dr. Wykeham McNeill, returned to Jamaica from Beijing, China, yesterday (August 30) with high praises for the nation’s athletes whose exceptional performance at the 2015 IAAF World Championships not only earned Jamaica 12 medals but also had a considerable and positive impact on Brand Jamaica. \n“The outstanding performance of our athletes in Beijing has had a tremendous effect on Brand Jamaica. The eyes of the world were on our athletes, especially Usain Bolt and Shelly-Ann Fraser-Pryce, and as a result there was a greater awareness about Jamaica. The promotional space which we established dubbed Jamaica House Beijing provided the opportunity to leverage the popularity of Jamaica’s athletes to market our destination,” said Minister McNeill. \nMinister McNeill and Director of Tourism, Paul Pennicook, were in Beijing for five days to participate in activities aimed at marketing destination Jamaica during the IAAF World Championships, which ended yesterday. While in Beijing, Minister McNeill and Mr. Pennicook met with leading travel and tourism stakeholders to explore opportunities to benefit the island’s tourism sector and increase visitor arrivals from Asia, including representatives from Air China, Hainan Airlines, China Travel Service, Caissa and American Airlines. \nThe senior tourism officials also attended a number of Jamaica Tourist Board (JTB) promotional events to market Jamaica and further strengthen the links between China and Jamaica. This included the very popular JTB-hosted Jamaica House Beijing, which sought to capitalize on the global focus on the Jamaica track and field team at the major sporting event. \n“We saw scores of persons, including tour operators, travel agents and media, visiting Jamaica House Beijing each evening to enjoy our culture, food and music, and also to do business,” said Minister McNeill, underscoring the winning Jamaica House concept which was used to great success at the 2012 London Olympics, the IAAF World Championships Moscow 2013, and the 2014 Glasgow Commonwealth Games. As part of its strategy to attract visitors from the immense Chinese visitor market, in February 2014, the Jamaican Government approved the conditional waiving of visa requirements for Chinese nationals travelling to Jamaica for tourism purposes for periods of 30 days or less. \nIn April this year, a world cruise tour by the Costa Atlantica saw some 1,000 Chinese visitors arrive in Ocho Rios, the single largest number of Chinese visitors to arrive in the island ever via cruise. \nThe JTB is planning follow up meetings with the Chinese tour operators and travel agents with whom they interfaced during the four days of Jamaica House Beijing promotions.", "external_links": [], "published": "2015-09-01T03:35:00.000+03:00", "crawled": "2015-09-01T03:36:36.451+03:00", "highlightTitle": ""}