{"organizations": [], "uuid": "7571c75f84cba97f5a15ee026fc8e9e1ccc90e84", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/download-21-300x96.png", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/travel-industry-exchange-event-closes-on-high-note-heads-to-san-diego-in-2016/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Travel Industry Exchange Event Closes on High Note, Heads to San Diego in 2016Travelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Travel Industry Exchange Event Closes on High Note, Heads to San Diego in 2016Travelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "4e81beb32b004b60f42712c4e7c4656fc2606054"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/travel-industry-exchange-event-closes-on-high-note-heads-to-san-diego-in-2016/", "ord_in_thread": 0, "title": "Travel Industry Exchange Event Closes on High Note, Heads to San Diego in 2016Travelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel Industry Exchange Event Closes on High Note, Heads to San Diego in 2016  \nQuestex Travel Group today announced that its next Travel Industry Exchange event will be held Dec. 13-15, 2016, at the Hilton San Diego Bayfront in California.The inaugural 2015 event came to a successful close last week in Orlando, Florida, underscoring the value to travel professionals of becoming more niche-focused. The innovative event’s over 50 sessions focused on revenue-generating niche segments, including certification programs in luxury, cruise and romance travel as well as concentrated educational programming in technology, trends, destinations and millennial travel.\n \nJohn McMahon, Questex Travel Group executive vice president, said specialization is “a major business driver” that represents the next “great wave of opportunity” for travel professionals, based on the company’s research and consumer trends and feedback.\n \n“The positive feedback we received from both travel professionals and global suppliers has been tremendous,” he said. “Attendees were able to really build connections for new business and fine-tune the skills that will propel them into the future. As more consumers look to travel professionals for expert advice, we see untapped potential in specialty markets.”\n \nSuppliers attending next year’s event in San Diego will benefit from the “best of both worlds,” McMahon said, with the nation’s top travel professionals expected to attend “from the East and West coasts.” Suppliers this year included destinations, hoteliers, cruise lines, tour operators, transportation providers, technology companies, spas and resorts from around the world.\n \nSuppliers surveyed expressed interest in returning next year, describing the new event as “well worth the investment,” and attributing its success to the one-to-one meetings and dynamic sessions.\n \nLast week’s event was supported by a prestigious advisory board composed of travel agents and suppliers as well as 12 industry associations including the Association for the Promotion of Tourism to Africa (APTA), Africa Travel Association (ATA), American Society of Travel Agents (ASTA), Caribbean Tourism Association, Cruise Lines International Association (CLIA), Destination Wedding & Honeymoon Specialists Association (DWHSA), Family Travel Association, Global Institute for Travel Entrepreneurs (GIFTE), The International Gay & Lesbian Travel Association (IGLTA), Meetings Mean Business, Millennials in Travel and Professional Travel Bloggers Association.\n \nSponsors included Apple Vacations, Bermuda Tourism Authority, Disney Destinations, Dominican Republic Tourism Board, Emirates, Hawai’i Visitors and Convention Bureau, India Tourism, The Maldives Marketing & Public Relations Corporation (MMPRC), Las Vegas Convention and Visitors Authority, Namibia Tourism Board, Palace Resorts, Puerto Rico Tourism Company, Starwood Hotels & Resorts Worldwide Inc., Tourism Australia and The Tourism Authority of Thailand.\n \nSource:- Questex Travel", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T18:27:05.484+03:00", "highlightTitle": ""}