{"organizations": [], "uuid": "ad0105a1a1d0457d73eaee7a725131b90d55fa01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/1844793/images/o-THAILAND-PRAWNS-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/travel-tips/feed", "section_title": "Travel Tips on Huffington Post", "url": "http://www.huffingtonpost.com/findery/come-for-the-border-run-s_b_8085816.html", "country": "US", "title": "Findery: Come for the Border Run, Stay for the Food!", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "Findery: Come for the Border Run, Stay for the Food!", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T00:47:00.000+03:00", "replies_count": 0, "uuid": "ad0105a1a1d0457d73eaee7a725131b90d55fa01"}, "author": "Findery", "url": "http://www.huffingtonpost.com/findery/come-for-the-border-run-s_b_8085816.html", "ord_in_thread": 0, "title": "Findery: Come for the Border Run, Stay for the Food!", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nIn case you hadn't heard, Thailand is cheap. Like, dirt cheap. Like, $10-a-night-beachfront-hotel cheap, and $3-a-day-food-budget cheap. I'm not even joking. In fact, it's so cheap here, we've been in the country for three months. Oh sure, it's beautiful, what with the endless supply of secluded beaches, stunning waterfalls, and overflowing jungle. Yeah, yeah, yeah. But that sort of fades into the background after a few months. A few months made ridiculously affordable because... Thailand is cheap! \n$4 pool day! Photos by Evo Terra of The Opportunistic Travelers. \nBeyond budget planning (made simple in Thailand because cheap!), there's the pesky issue of visas. Being citizens of the U.S. of A., our visas allowed us to stay for 60 days. Citizens of other countries only get a month. And some are only allowed to stay for 15 days at a time. Ah, international politics. We wanted to stay for 90 days, not just 60. Good news: Extending (or in our case, resetting) a visa in Thailand is possible just a quick border-hop away. \nAnd by border-hop, I mean that quite literally. We stamped out with Thailand immigration, took a quick boat ride across the border to Myanmar, stamped in with Myanmar immigration, turned around, boated back across the river, and stamped right back in with the same Thai immigration official who stamped us out an hour earlier. \nNo trickery. That's how it works. And because of that, lots of tourists stay for months at a time in places like Bangkok, Chiang Mai, and Phuket, making the plane or bus ride to sleepy little border towns like Ranong to do their border-hop. A few hours later, they're on another plane or bus taking them back to their prime vacation spot or digital nomad hub, spending as little time in the border town as necessary. Because seriously, what's to love about a border town? \nWell here's one thing: the food. \nPut simply, the food in the little border town that's been our home the last three months is far and away better than any dish we had in Phuket, Bangkok, or Koh Tao. Hey, I'm not disparaging any of those cities. But if you're planning on skipping lunch or dinner in your tiny border town, believe me when I tell you that are missing out on some fantastic and, dare I say it again, cheap food. \nSmaller town = better food \nPut simply: the more touristy a place, the more average the food. Oh sure, people like you and me love authentic cooking. But the vast majority of our fellow travelers? Not so much. That causes a predictable march toward mediocrity that should be avoided. So when your softshell crab comes out looking like, well... softshell crab in your tiny Thai border town; eat it, and let the mouth-watering sweetness make you wish you'd ordered another. \nEven simple dishes like fried rice take on a completely different flavor when they're made with local ingredients by a local cook/chef who knows what his/her local clientele likes. News flash: They've never heard of P.F. Chang's. And they care little about a potential bad review on TripAdvisor. Other news flash: They've never heard of TripAdvisor. \nHow to find it in touristy, Westernized places \nEven if your trip to Thailand doesn't include a border run, you can still find great food wherever you happen to be. Remember: if you order Pad Thai or some other Thai staple food, you're going to get the westernized version of Pad Thai. And generally speaking, ordering a pizza or hamburger will get you an approximation of either made with local ingredients. Prepare for disappointment. \nInstead, try the oddball things you've never heard of, and look for hidden gems on the menu. (Bonus points if it's the one thing not written in English.) And just like at a good sushi bar, always order what's written on the chalkboard! \nIf that's not working for you (because some touristy places have had all the local life sucked out of them), get off the property and head to a local market ! There's one less than a kilometer from wherever you happen to be -- I promise! Just hail a taxi-scooter or tuk-tuk and say \"market\". And then hold on. If you survive the ride, your taste buds will soon be in heaven! \nAnd because this is Thailand, street food is great and available anywhere, especially where tourists and locals converge. Piers, rail stations, immigration offices... if there's a crowd gathering on a regular basis, you'll find street vendors. I'm partial to the sticky sweetness of roti prata telur , but these street kitchens have something for everyone. \nBut eating this way can hurt you \nThai food, when prepared in the traditional way free from as many western influences as possible, is HOT. There aren't enough little chili icons on your local Thai place's menu to account for this level of spiciness. It's more spice than you've probably had to deal with, and they'll rarely remember to ask you how spicy (or not) you can handle it. \nDon't believe me? Fine. Order the Papaya salad . I mean, what could be spicy about papaya (a fruit) and salad (a... salad), right? You won't ask that question again once you take your first bite. You might want to order a side of steamed rice to help kill the pain. \nSpicy stuff is hidden everywhere. And even when you say \"not spicy\", they won't leave the spice (hint: the flavor) out. They'll just tone it down a little. Well, a little in their mind. For you? Three-alarm fire in your mouth. Power through it, and then cool off with a local Thai popsicle or ice cream from their freezer. They'll have one, and your mouth will thank you. \nEating spicy is the way it is in Thailand . And yeah, I'm sure you've had spicy food and can take it. Come try that in Ranong for a couple of days. You'll make it. It'll hurt, but you'll make it. And then you can thank me forever. \nThis post, which previously appeared on the Findery Blog , was written by Evo Terra, one of The Opportunistic Travelers . He and his wife Sheila Dee have been professional travelers since January of 2015. When they're not having their tastebuds blown off their tongues, they produce The Opportunistic Travelers Podcast , a short weekly program that features the stories from the everyday experiences of their travels around the world. Discover more of their travel adventures on Findery . \nFollow Findery on Twitter: www.twitter.com/findery More:", "external_links": [], "published": "2015-09-11T00:47:00.000+03:00", "crawled": "2015-09-11T05:24:18.383+03:00", "highlightTitle": ""}