{"organizations": [], "uuid": "a7e6eb055ae7283c80a8040727244d10f4227980", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/MDC-Museum-of-Art-Design.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/america-travel-news/", "section_title": "AMERICA TRAVEL NEWS - Travelandtourworld.comTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mdc-campus-galleries-of-art-design-to-present-exhibition-featuring-alumni-william-cordova-and-luis-gispert/", "country": "US", "title": "MDC Campus Galleries of Art + Design to Present Exhibition Featuring Alumni William Cordova and Luis GispertTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "MDC Campus Galleries of Art + Design to Present Exhibition Featuring Alumni William Cordova and Luis GispertTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "a7e6eb055ae7283c80a8040727244d10f4227980"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mdc-campus-galleries-of-art-design-to-present-exhibition-featuring-alumni-william-cordova-and-luis-gispert/", "ord_in_thread": 0, "title": "MDC Campus Galleries of Art + Design to Present Exhibition Featuring Alumni William Cordova and Luis GispertTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MDC Campus Galleries of Art + Design to Present Exhibition Featuring Alumni William Cordova and Luis Gispert Published on : Tuesday, September 1, 2015\nM iami Dade College (MDC) alumni and internationally-renowned visual artists, William Cordova and Luis Gispert, have collaborated to create walls turned sideways are bridges, a series of 10 original works that will be exhibited at the MDC Museum of Art + Design (MOA+D) at the historic Freedom Tower Sept. 17 – Oct. 18. Proceeds from the sale of the artwork will benefit Arts for Learning’s (A4L) arts education programs across South Florida. The exhibition is free and open to the public.\nBefore developing careers that would prove key to heightening the national awareness of Miami’s burgeoning arts community, Cordova and Gispert both attended MDC but did not meet until they were completing undergraduate art studies far from home in Chicago.\n“We were drawn to each other’s work while studying at MDC, but never met,” recounts Cordova. “We inadvertently collaborated on the bathroom walls with pseudo-intellectual graffiti at the School of the Art Institute of Chicago and finally realized each other’s presence. We started working together on films, videos, performances and large scale installations. Luis [Gispert] and I have known of each other’s work for the past 24 years, though we’ve only been friends for the last 21.”\nAs a longtime supporter of A4L, Cordova has given of his time and talent to the organization through student workshops at afterschool programs and serving as a panel juror for A4L’s middle school intensive and high school internship programs. After helping to coordinate a successful silent auction fundraiser in 2013, Cordova presented the idea of creating a limited edition series to benefit the organization, and found this to be fitting for collaboration with Gispert.\n“We chose to collaborate on a project for Arts for Learning because Luis and I are part of the many communities that make up South Florida,” said Cordova. “We felt it important to put actions behind our words, so, when we say we believe in the arts, we are not talking about the commercial art world. We are talking about how essential art is in our early and later development as human beings.”\nCordova and Gispert will also collaborate to deliver a workshop to interns of A4L’s ArtWorks Internships in the Arts program. In its fifth year, the ArtWorks program has expanded to offer paid internships in Creative Writing, Dance, Theatre and Visual Art to more than 30 students throughout the school year and summer terms.\nMOA+D is free and open to the public Wednesday through Sunday, from Noon – 5 p.m.", "external_links": [], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T08:55:04.466+03:00", "highlightTitle": ""}