{"organizations": [], "uuid": "f422462fa5d45abbbc49992d1d5f8ae0e0b4177b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/external?url=http://content6.video.news.com.au/dqYjl1dzrRHhcgGEVBiGRs8C_288PTmr/promo267848185&width=650&api_key=kq7wnrk4eun47vz9c5xuj3mc", "site_section": "http://www.adelaidenow.com.au/travel/world/asia", "section_title": "Asia | Asian Holidays and World Travel | The Advertiser", "url": "http://www.adelaidenow.com.au/business/companies/could-glencore-trigger-the-next-gfc/story-fnkjk9kt-1227550915667", "country": "US", "title": "Glencore share price: Could collapse of company founded by criminal trigger GFC 2? | Business News | Business Finance News | |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "Glencore share price: Could collapse of company founded by criminal trigger GFC 2? | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T23:43:00.000+03:00", "replies_count": 0, "uuid": "f422462fa5d45abbbc49992d1d5f8ae0e0b4177b"}, "author": "Frank Chung", "url": "http://www.adelaidenow.com.au/business/companies/could-glencore-trigger-the-next-gfc/story-fnkjk9kt-1227550915667", "ord_in_thread": 0, "title": "Glencore share price: Could collapse of company founded by criminal trigger GFC 2? | Business News | Business Finance News | |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "GLENCORE, the London-listed commodities company whose dramatic share plunge sparked yesterday’s $60 billion rout on the Australian share market, could be the trigger for the next GFC, analysts have warned.\nShares in the world's largest commodities trader plummeted 29 per cent on Monday after investment bank Investec Securities issued a warning about the company’s ability to repay debts amid falling commodity prices.\nThat wreaked havoc on the Australian market, with shares in BHP Billiton the hardest hit, losing 6.65 per cent of their value to reach their lowest level since the GFC. The ASX’s 3.8 per cent fall was the worst since the 4.1 per cent ‘Black Monday’ plunge on August 24, and closes out a horror quarter on the local market.\n• AUSSIE SHARE MARKET REBOUNDS\n• WHAT THE BLOODBATH MEANS FOR YOU\n• GLENCORE HAS SA FARMERS ON EDGE\nLindsay David of LF Economics said the woes at Glencore, a mega-commodities company which combines a massive trading division with a mining arm, were proof the mining tide is “starting to roll out quite quickly”.\n“Glencore, like other mining companies, essentially built their business model around the notion we would never see economic instability in China and that China would continue to consume all the natural resources miners could dig from the ground and pay a premium,” Mr David said.\n“This strategy was more of a leveraged gamble than anything else and it is not going to pay off.”\nGlencore, with less than $US3 billion in cash and roughly $US30 billion of debt on its balance sheet has “always held very little cash on the sidelines relative to the size of its business operation for a rainy day”.\n“Hence it has quickly become vulnerable to the economic downturn and quite frankly worthless if we continue to see the spot price of various commodities in the Glencore portfolio fall,” he said.\nGlencore’s share price has fallen 43 per cent in the last month and 71 per cent since the start of the year.\nShould the company suffer a Lehman-style collapse, the knock-on effect would be significant as access to credit would dry up for the miners who have little liquidity, he argues. “On the back of this you would have a lot of mining operations around the world for sale — and no buyers.\n“This is precisely what happened to the housing market in the US during the GFC. Essentially it could kill the junk bond market, thus making the international investment and wholesale lending community very jittery about lending to other sectors of the global economy already over-leveraged.”\nIn a research note today, Commonwealth Bank ominously described Glencore’s commodities trading division as “opaque” and its overall exposures as “unknown”.\n“Debt has risen in recent years (primarily due to the Xstrata acquisition) and remains too high relative to earnings for our liking,” the note said.\n“The debt burden could become too big and they may be forced to liquidate their trading book. The results would be turmoil for commodity markets and it is these fears are driving commodity prices down and leading to further ‘risk off’ sentiment across equity markets.”\nThe cost of insuring Glencore’s debt has skyrocketed, indicating the market is deeply sceptical about its future. This chart basically sums up the problem:\nGlencore’s credit default swap (CDS) spread versus its share price. (Source: CommBank) Source: Supplied\nNews Corp columnist Terry McCrann has argued Glencore could well be 2015’s Lehman Brothers — the ‘black swan’ event that triggers the next crisis.\n“Back in 2008 no one really knew far less understood the linkages that flowed out from Lehman into all sorts of exotic financial instruments and into various stock, debt and currency markets around the world,” he writes. “But the smarties — and especially those ‘masters of the universe’ on Wall St — thought they did.\n“The same pretty much applies to Glencore today ... [Unless] these ‘counter-party’ relationships are actually triggered by an ‘event’, no one really knows how they will play out, how they will feed into other linkages, and how robust are the market structures in which they are situated.”\nMonday’s sell-off was triggered by a note from Investec analyst Hunter Hillcoat, who said Glencore was more exposed than rivals such as BHP Billiton and Rio Tinto because of the sheer size of its debt mountain.\nMr Hillcoat said mining companies “gorged themselves on cheap debt in a race to grow production following the Chinese stimulus that occurred in the wake of the global financial crisis” and that the consequences of that “are only now coming home to roost, as mines take a long time to build”.\nDebt, said Mr Hillcoat, “is fast becoming the most important consideration for mining company management”.\nGlencore shares rallied nearly 20 per cent on Tuesday following a statement dismissing speculation the company was on the brink of insolvency, saying it had taken “proactive steps” to weather the slump.\nAnalysts at Citi and Macquarie also issued positive notes, with Citi saying it believed “the market’s response is overdone”.\nDavid Buik, market commentator with Panmure Gordon in London, said yesterday the key question was whether Glencore’s “gargantuan” debt can be serviced for another two or three years until demand for commodities picks up.\n“There could be a rally at any time in the next year or so, which would benefit companies like Rio Tinto or BHP, but the market is not convinced that Glencore would be a quick enough beneficiary,” he told 2GB.\nWHAT IS GLENCORE?\n• Founded in 1974 as Marc Rich + Co AG by controversial commodities trader Marc Rich, who sold his 51 per cent stake to Glencore International in 1994\n• Rich, who died in 2013 , for many years was wanted by the US on numerous criminal charges including tax evasion, wire fraud and racketeering\n• Glencore floated on the London stock exchange in 2011 at a share price of 530 pence, valuing the company at a little less than 40 billion pounds ($A86.35 billion)\n• Monday’s sell-off took to Glencore’s shares to a new low of 69 pence\n• Employs more than 190,000 people with operations in more than 50 countries with its marketing activities supported by a global network of more than 90 offices\nfrank.chung@news.com.au\n— with AAP\n Company could trigger GFC 2.0", "external_links": ["http://www.economist.com/news/obituary/21580438-marc-rich-king-commodities-died-june-26th-aged-78-marc-rich", "http://www.news.com.au/finance/markets/asx200-only-bounces-back-only-08-per-cent-at-the-open-after-wednesdays-massive-plunge/story-e6frfm30-1227550425089", "http://www.news.com.au/finance/economy/the-commodity-crash-three-ways-its-going-to-personally-target-you-and-make-your-life-worse/story-fnu2pwk8-1227550553461", "http://resources1.news.com.au/images/2015/09/30/1227550/915177-40dfd03c-672a-11e5-a694-a01135d43b99.jpg", "http://www.news.com.au/finance/business/could-glencore-trigger-the-next-gfc/story-fnkgdg1h-1227550915667", "http://www.heraldsun.com.au/business/terry-mccrann/is-glencore-going-to-trigger-a-global-meltdown/story-fni0d8gi-1227549683631"], "published": "2015-09-30T23:43:00.000+03:00", "crawled": "2015-09-30T09:25:15.782+03:00", "highlightTitle": ""}