{"organizations": [], "uuid": "efbc0461d82d3dd05088dd136e23ef00d44bc986", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.couriermail.com.au", "main_image": "http://resources1.news.com.au/images/2015/09/04/1227512/346381-66e714e6-4fad-11e5-bb8e-56aa84f91c7e.jpg", "site_section": "http://www.couriermail.com.au/travel/travel-advice", "section_title": "Travel Advice | Holiday and Travel Advice | The Courier-Mail", "url": "http://www.couriermail.com.au/travel/holiday-ideas/dining-with-the-ships-captain-could-be-a-simple-as-joining-a-cruise-line-loyalty-program-heres-how-it-works/story-fnjjv4qy-1227512347290", "country": "US", "title": "Dining with the ship’s captain could be a simple as joining a cruise line loyalty program. Here’s how it works | Travel | Travel News and Holiday Deals |", "performance_score": 0, "site": "couriermail.com.au", "participants_count": 1, "title_full": "Dining with the ship’s captain could be a simple as joining a cruise line loyalty program. Here’s how it works | Travel | Travel News and Holiday Deals | | The Courier-Mail", "spam_score": 0.0, "site_type": "news", "published": "2015-09-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "efbc0461d82d3dd05088dd136e23ef00d44bc986"}, "author": "couriermail.com.au", "url": "http://www.couriermail.com.au/travel/holiday-ideas/dining-with-the-ships-captain-could-be-a-simple-as-joining-a-cruise-line-loyalty-program-heres-how-it-works/story-fnjjv4qy-1227512347290", "ord_in_thread": 0, "title": "Dining with the ship’s captain could be a simple as joining a cruise line loyalty program. Here’s how it works | Travel | Travel News and Holiday Deals |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Demand far exceeds supply to break bread with the captain and while you can make a request through staff or your travel agent, the response is likely to hinge on the colour of your lapel pin.\nThis pin shows how much you love the cruise line, and in turn determines how much extra love the line showers on you with free laundry, free internet, free dinners, even free cruises — and dinner at the captain’s table.\nCruise lines run loyalty programs to reward repeat guests, much like airlines, hotels and supermarkets offer incentives to frequent customers.\nMany cruise lines enrol guests automatically on their first cruise in a bid to entice them back — time and time again — and the more you cruise with a line, the more you become entitled to in return.\nLoyalty programs generally run on tier systems reflecting the number of days at sea.\nThe more you cruise, and depending on the class of cabin you book and how much you spend on board, the quicker you rise up through various tiers offering ever more rewards.\nThese tiers usually are reflected by the colour of your complimentary lapel pin, allowing staff to instantly recognise regular cruisers.\nLower tiers start off with newsletters and alerts of special deals, then move up to exclusive receptions hosted by the captain and senior officers. Guests are personally welcomed on entry and during speeches the captain usually will call for a show of hands to work out who has been on the most cruises with the line. Enjoy extra perks when you become a loyal member. Picture: Getty Source: Getty Images\nThis naturally reinforces a sense of loyalty to the line, not to mention competitive spirits.\nOther lucrative free offerings as you move up the tiers include free laundry (much coveted), free internet (increasingly coveted), cabin upgrades, discounts on on-board purchases, discounted future cruises, access to special lounges, meals in specialty restaurants, welcome champagne and nibbles in cabins, priority check-in and boarding, priority seating at theatre shows, and in some cases eventually a free cruise.\nAnd of course the collectable lapel pins, plus the chance of the gold envelope in your room inviting you to dine with the Captain.\nIf you do get one, dress for the occasion and prepare to enjoy an evening chatting with the captain and other guests likely to include repeat fellow travellers, perhaps a couple celebrating a special anniversary, and possibly a VIP or celebrity to add spice to the conversation.\nLoyalty programs deliver such bonuses for those who like to cruise regularly but weigh up the benefits.\nPROS\nPretty obvious — free stuff. The cruise line gets to know your preferences, staff are alerted to repeat customers, lapel pins are a visible sign of a staunch supporter, and sticking with the same line means you get to compare ships. For example you may end up sailing on all 18 ships in the current Princess fleet, or are able to talk about the differences between the various classes of ship in the Royal Caribbean International fleet. Other people try several ships in the one line then settle on a favourite which becomes their second home. Loyalty club members are alerted to early bird deals and specials such as having early access to book when a new ship is launched. There is also a nice feeling of “ownership” with touches such as the exclusive welcome party and finding evening canapés in your room.\nCONS\nAs with any loyalty program, it weds you to the one line. Although it’s great to compare ships within a fleet, many travellers prefer to compare ships — and the overall experience including service, dining, entertainment and decor — between lines. For example comparing a Seabourn ship with a Silversea trip, or a voyage aboard Cunard flagship Queen Mary 2 as compared to P&O World Cruising flagship Britannia , or a Holland America Line experience against a cruise on a Celebrity Cruises ship. Bear in mind the lure of free laundry and a new lapel pin needs to be weighed against whether you would actually prefer a slightly different itinerary at a more convenient time offered by a rival line.\n Emma Wilby performs on Royal Caribbean’ Anthem of the Seas. Source: Supplied\nNINE LOYALTY PROGRAMS ALL AT SEA\nPrincess Cruises\nThe Captain’s Circle has four tiers: Gold (one cruise), Ruby (three cruises or 30 sea days), Platinum (five cruises or 50 sea days) and Elite (15 cruises or 150 sea days). Elite level includes priority boarding and disembarkation, free laundry, shoe polishing, initial minibar, canapés, afternoon tea, internet credit, disembarkation lounge and on-board purchase discounts.\nCunard\nMembers of Cunard World Club — or “Cunarders” — progress through Silver, Gold and Platinum tiers to Diamond, which requires 15 voyages or 150 nights. As well as all lower tier benefits, Diamond Cunarders receive eight hours of internet, priority check-in and disembarkation, a free meal at a specialty restaurant and a dedicated contact at the shoreside World Club Desk.\nRoyal Caribbean International\nCrown and Anchor Society membership offers six tiers based on nights cruised (one point per night, double points if in a suite). The top Pinnacle tier requiring 700 points has rewards including a free seven-night cruise, discounts of up to 25 per cent, up to $500 credit, private lounge, priority boarding and priority seating in the theatre.\nCelebrity Cruises\nThe Captain’s Club has six tiers. The top Zenith tier requiring 3000 points includes access to a concierge lounge, a beverage package, complimentary laundry, 1600-minute internet package, multiple on-board discounts and — with extra points — a free seven-night Caribbean or Bahamas cruise.\n Sindhu Restaurant aboard Britannia cruise ship. Picture: P&O Cruises Source: Supplied\nP&O Cruises\nPast passengers are eligible for discounts but there is not a formal loyalty program at present. Southampton-based P&O World Cruising with ships such as Britannia has the Peninsula Club with six tiers.\nSeabourn\nSeabourn Club members can achieve Milestone Awards such as a free cruise after 140 days sailing, while building up Club Points based on days sailed, level of accommodation and on-board purchases. Various milestones starting at 100 days sailed are rewarded with a gift from Tiffany. Seaborn Club has five levels, the top Diamond level offering unlimited internet, free laundry, discounts on purchases including shore excursions and free massages.\nSilversea\nVenetian Society rewards rise with days sailed. After 100 days, rewards include a 5 per cent savings and free laundry; 250 days, a 10 per cent saving; 350 days, a free seven day cruise; 500 days, a free 14-day cruise then free seven-day cruise for each additional 150 days. Bear in mind Silversea is all-suite, with butler service and complimentary beverages.\nCarnival\nVIFP (Very Important Fun Person) Club. Five tiers, top tier requiring 200 points includes unlimited laundry, luggage tags, beverages, priority boarding and restaurant reservations.\nHolland America Line\nMariner Society membership is based on days sailed, money spent on board and cabin class, and has five tiers. The top tier requiring 500 cruise day credits includes two free fine dining restaurant dinners, cooking class, laundry, internet discount, priority check-in and disembarkation, discounts on on-board spending, a wine tasting, welcome lunch and collectable gift.\nOriginally published as What you need to know about cruise loyalty programs", "external_links": ["http://resources2.news.com.au/images/2015/09/04/1227512/347182-f84d707e-4f9e-11e5-bb8e-56aa84f91c7e.jpg", "http://resources2.news.com.au/images/2015/09/04/1227512/346434-7dfa3f3c-4fad-11e5-bb8e-56aa84f91c7e.jpg", "http://resources0.news.com.au/images/2015/09/04/1227512/348040-2ff0ba68-4f9f-11e5-bb8e-56aa84f91c7e.jpg", "http://www.heraldsun.com.au/travel/holiday-ideas/dining-with-the-ships-captain-could-be-a-simple-as-joining-a-cruise-line-loyalty-program-heres-how-it-works/story-fnjjv4qv-1227512347290"], "published": "2015-09-07T03:00:00.000+03:00", "crawled": "2015-09-13T00:00:24.471+03:00", "highlightTitle": ""}