{"organizations": [], "uuid": "19e36db5cac812103622d02ae1f46ca8cf97de0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/travel/texas/texas-events-calendar/20150919-lake_austin_spa_resort_46041027.ece/BINARY/original/LAKE_AUSTIN_SPA_RESORT_46041027", "site_section": "http://www.dallasnews.com/lifestyles/travel/", "section_title": "Dallas-Fort Worth Travel News and Destinations - News for Dallas, Texas ", "url": "http://www.dallasnews.com/lifestyles/travel/texas/texas-events-calendar/20150919-texas-neighbors-lake-austin-spa-named-as-a-favorite-hideaway.ece", "country": "US", "title": "Texas & Neighbors: Lake Austin spa named as a favorite hideaway", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Texas & Neighbors: Lake Austin spa named as a favorite hideaway | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T01:55:00.000+03:00", "replies_count": 0, "uuid": "19e36db5cac812103622d02ae1f46ca8cf97de0b"}, "author": "MARY DUNKLIN", "url": "http://www.dallasnews.com/lifestyles/travel/texas/texas-events-calendar/20150919-texas-neighbors-lake-austin-spa-named-as-a-favorite-hideaway.ece", "ord_in_thread": 0, "title": "Texas & Neighbors: Lake Austin spa named as a favorite hideaway", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "NEW ORLEANS Style, vibe of the 1940s to come alive during re-enactment The Roosevelt New Orleans will honor the women of 1949 during its annual Stormin’ of the Sazerac event Oct. 9. It marks the occasion when women, admitted to the bar only on Mardi Gras, entered demanding equal access.\nThe event starts at 1 p.m. in the Blue Room, where guests will enjoy a three-course, ladies-only meal featuring entertainment. A fashion show competition will pay tribute to attire popular in 1949, with the winner receiving a one-night stay and spa treatment at the Roosevelt New Orleans. Fountain Lounge will offer complimentary cocktails and light fare, and the first 50 women in costume will receive gifts.\nGuests from the Fountain Lounge and Blue Room will unite at 3:45 p.m. to “storm” the Sazerac Bar.\nBlue Room luncheon tickets are $49 each, including tax and gratuity. Complimentary parking is available.\nContact: 504-335-3131; therooseveltneworleans.com/specials-and-packages /stormin-of-the-sazerac.html\nSAN ANTONIO Historic hotel unveils haunted secret past on Halloween tours Want a spooky place to visit this Halloween? Plan a trip to San Antonio’s historic Sheraton Gunter Hotel, which will offer guided ghost tours Oct. 27-31. The hourlong tours will reveal haunted areas of the hotel and include stories of suspicious events that have happened on the site.\nGroups will visit the famously haunted sixth floor, get a look at never-before-seen artifacts and hear expert theories regarding the hotel’s past.\nThe tour will be led by Guillermo Fuentes, creator of San Antonio Paranormal Investigations and a ghost hunter for more than 15 years.\nTickets are $40.\nContact: 210-227-3241; eventbrite.com/e/sheraton-gunter-haunted-tours-tickets-18396522494\nEDOM Southwest artists ready to show, sell their wares this fall Artists from across the country — many with Southwest ties — will participate in the Edom Festival of the Arts next month.\nFor more than 40 years, the East Texas town has welcomed artists of multiple genres to the event. Visitors can expect to find pottery, jewelry, woodworking, metalwork, painting, glass blowing, weaving and more. Also included is live music and a free children’s art workshop.\nThe event is 10 a.m.-5 p.m. Oct. 17-18 in downtown Edom, at the intersection of FM279 and FM314.\nContact: edomfestivalofthearts.com\nAUSTIN Texas destination spa named one of readers’ favorite hideaways Lake Austin Spa Resort was recently named a Top 20 U.S. Hideaway in Andrew Harper’s 2015 Reader’s Choice awards.\nThe 25,000-square-foot resort has 40 rooms on 19 lakeside acres in the Hill Country. The property has indoor and outdoor treatment spaces with more than 20 fitness classes and activities daily.\nAndrew Harper’s Hideaway Report has provided reviews and information about luxury travel to its subscribers for more than 35 years. Other categories ranked include beach resorts, cruise lines and city hotels. Read the full list of winners online.\nContact: andrewharper.com/hotels/lake-austin-spa-resort ; andrewharper.com/readers-choice\nCOLORADO Hot-air balloons will fill the sky during annual fest Three mass ascensions and outdoor fun will be offered at the 11th annual Mancos Valley Balloon & Art Festival. The event, Sept. 26-27, will also include tethered rides (weather permitting), an arts festival and entertainment.\nDinner, dancing and a silent auction will take place in downtown Mancos on Saturday. Don’t miss the Sunday evening glow event when the balloons — and some specially shaped entries — will light up the sky.\nContact: mesaverdecountry.com", "external_links": ["http://eventbrite.com/e/sheraton-gunter-haunted-tours-tickets-18396522494", "http://andrewharper.com/readers-choice", "http://andrewharper.com/hotels/lake-austin-spa-resort", "http://therooseveltneworleans.com/specials-and-packages/stormin-of-the-sazerac.html"], "published": "2015-09-20T01:55:00.000+03:00", "crawled": "2015-09-25T03:52:29.083+03:00", "highlightTitle": ""}