{"organizations": [], "uuid": "96bb46c284ee0f6c097f6866a06dac69817e3225", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/awards/28925-team-from-sweden-wins-the-25th-international-fireworks-competition-in-hannover-herrenhausen", "country": "US", "title": "Team from Sweden wins the 25th International Fireworks Competition in Hannover Herrenhausen", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Team from Sweden wins the 25th International Fireworks Competition in Hannover Herrenhausen", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T14:15:00.000+03:00", "replies_count": 0, "uuid": "96bb46c284ee0f6c097f6866a06dac69817e3225"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/awards/28925-team-from-sweden-wins-the-25th-international-fireworks-competition-in-hannover-herrenhausen", "ord_in_thread": 0, "title": "Team from Sweden wins the 25th International Fireworks Competition in Hannover Herrenhausen", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Team from Sweden wins the 25th International Fireworks Competition in Hannover Herrenhausen Team from Sweden wins the 25th International Fireworks Competition in Hannover Herrenhausen Details Category: Awards   12:15 The winner of the anniversary event of the International Fireworks Competition in Hannover Herrenhausen comes from Sweden! On the evening of Saturday, 19 September, it was announced that first place went to “Göteborgs FyrverkeriFabrik”. The excellent presentation by the Swedish pyrotechnic specialists at the final evening of the competition put them ahead of their four, likewise strong, international rivals. Second place went to “Dragon Fireworks” from the Philippines, with, Spain (“Ricardo Caballer SA”) finishing third. \nThe team from Sweden succeeded in captivating the audience in the Great Garden with a brilliant fireworks choreography and impressed the jury of ten independent experts with its perfect rendering of the competition requirements and a harmonious tapestry of pyrotechnical and musical effects. “In the end, the artistic impression and the artisanship in creating the impressive images convinced the jury, which had the truly difficult task of awarding first place to one of the five excellent presentations”, commented Randell Greenlee, spokesman of the jury. On five Saturdays between May and September 2015, the anniversary year of the competition, top teams from Italy, Spain, Finland, the Philippines and Sweden presented breathtaking fireworks displays in the baroque atmosphere of the Royal Gardens of Herrenhausen, attracting a total of around 53,000 visitors as they competed for victory. A supporting programme – themed to tie in with the country of the performing team and featuring items such as outsize Venetian figures, Spanish equestrian skills, fantastic Asian performing artists and music by Abba, as well as artistic, musical and comedy acts – entertained the audiences as they waited for the fireworks to begin. This year’s winning team, Göteborgs FyrverkeriFabrik, was founded in 1994 and is meanwhile the largest fireworks display company in the whole of Scandinavia. Martin Hildeberg, his team and the way in which he presents his fireworks are already familiar and much loved in Hannover: the Swedish artists have already won the International Fireworks Competition on four occasions (2002, 2003, 2004, and 2010). Other placements include second prize at the Pyronale in Berlin (2012) and first prize at the Knokke-Heist Festival in Belgium (2007). Related articles", "external_links": [], "published": "2015-09-21T14:15:00.000+03:00", "crawled": "2015-09-21T14:51:02.602+03:00", "highlightTitle": ""}