{"organizations": [], "uuid": "73e908b958c978560c4a3f51bc41f5738d15c639", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.edmontonsun.com", "main_image": "http://storage.edmontonsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297750961443_LARGE_BOX.jpg?quality=80&stmp=1442849537601&size=100x", "site_section": "http://www.edmontonsun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.edmontonsun.com/2015/09/21/bella-thorne-bella-hadid-stranded-at-airport-after-plane-hits-fence", "country": "CA", "title": "Bella Thorne, Bella Hadid stranded at airport after plane hits fence [Photos]", "performance_score": 0, "site": "edmontonsun.com", "participants_count": 0, "title_full": "Bella Thorne, Bella Hadid stranded at airport after plane hits fence [Photos]", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T17:27:00.000+03:00", "replies_count": 0, "uuid": "73e908b958c978560c4a3f51bc41f5738d15c639"}, "author": "", "url": "http://www.edmontonsun.com/2015/09/21/bella-thorne-bella-hadid-stranded-at-airport-after-plane-hits-fence", "ord_in_thread": 0, "title": "Bella Thorne, Bella Hadid stranded at airport after plane hits fence [Photos]", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Bella Thorne"], "text": "Monday, September 21, 2015 07:53 AM MDT | Updated: Monday, September 21, 2015 08:27 AM MDT Celebrities share their travel nightmares Previous Next \nHave you ever had an absolutely horrible travel experience? You're not alone! Even the rich and famous sometimes face travel nightmares. (WENN.com) \nBella Thorne and Bella Hadid: Actress Bella Thorne and model Bella Hadid (left) were left stranded at New York City's JFK airport for 14 hours after their Virgin Atlantic flight to London was grounded when the plane's wing hit a fence. There were no injuries, but Thorne tweeted about the incident, saying, \"Our flight crashed into a fence this morning so we had to get off and wait for another flight.\" Read the full story here. (WENN.com) \nChris Hemsworth: Hemsworth and wife Elsa Pataky are reconsidering their travel plans after a nightmare 30-hour flight with their kids in April 2015. The couple flew from Australia to London and the actor admits it was \"the trip from hell\" because his three-year-old daughter and one-year-old twin sons were sick - and noisy. Read the full story here . (FayesVision/WENN.com) \nMatthew Broderick: A dream trip to Amsterdam actor Matthew Broderick took with filmmaker Kenneth Lonergan when he was a teenager turned into a nightmare after the pair lost their travel documents and credit cards on the way home. The ensuing drama included a hitchhiking trip across Ireland after the two lost Americans pleaded with an ambassador at the American embassy in England to help them. Read the full story here . (Dennis Van Tine/Future Image/WENN.com) \nKim Kardashian: Reality TV star Kim Kardashian was forced to cancel her November 2014 visit to India and had to pull out of her stint in the country's Big Brother TV show. A source told HindustanTimes.com that Kardashian ran out of time to secure a visa because she could not fit a trip to the consulate office in Mumbai, India into her schedule. Read the full story here. (WENN.com) \nTory Lane: Adult film star Lane was arrested in February 2015 after allegedly flying into a rage onboard a flight from Atlanta, Georgia to Los Angeles. The adult actress is accused of becoming drunk and argumentative on a Delta plane, where reportedly she clashed with airline staff and became physical. Read the full story here. (Derrick Salters/WENN.com) \nKevin Hart: Hart insists a new comedy routine about an over-zealous fan trying to take his photo in an airport toilet is for real - and he’s still upset about the privacy breach. He told Jon Stewart in March 2015, \"What you can relate to is me taking a s**t in an airport and somebody kicking in the door and taking a picture. That’s a true story, by the way. The first thing you wanna do is cover up, but then you’re angry, so you gotta talk with your hands.\" Read the full story here. (Judy Eddy/WENN.com) \nEwan McGregor: Actor McGregor was once left stranded on the side of the road in Utah after running out of gas while making a long-distance trip across the U.S. He says, \"I was watching my gas gauge (go down)... So I pulled along to the side and I thought, 'Someone will come along and help.' So I find a bit of paper... and I write 'gas' with a big question mark and I sat on my car (holding up the sign) as... vehicles are going past me... Nobody stopped... (Finally) this lovely lady Madeline... came on a motorbike and saved me.'\" Read the full story here. (WENN.com) \nVictoria Beckham: Victoria Beckham was forced to consult her lawyers over a false report suggesting she is a \"hotel guest from hell.\" Insiders at the Meadowood Napa Valley resort in California claim Beckham lost her cool during a stay at the venue a couple of years ago when housekeeping staff failed to grant her wishes. Beckham's publicist dismissed the accusations in the article, insisting, \"This is absolute nonsense and utterly untrue.\" Read the full story here. (WENN.com) \nDemi Lovato: Singer/actress Lovato found a way to entertain herself during a flight delay in June 2015 by live-tweeting a little passenger drama as she watched from afar. The Skyscraper hitmaker was settled into her seat for an early morning domestic U.S. flight when she heard two females arguing with air stewards. Read the full story here. (FayesVision/WENN.com) \nMos Def: Rapper Mos Def had to cancel a performance at the inaugural Soulfest tour in Sydney, Australia in October 2014 after missing his flight. His message to fans read, \"Peace Sydney. Sorry Im (sic) going to miss you today. We had some travel issues.\" Read the full story here. (Johnny Louis/WENN.com) \nMark Curry: The \"Hangin' With Mr. Cooper\" actor was left fuming at an airport in Dallas, Texas in May 2015 after an airline employee randomly confronted him about carrying a loaded weapon. Curry tells TMZ.com, \"(I) just walked to (the) first class Delta counter in Dallas. The first thing the lady said to me (was), 'Do you have a loaded weapon?' What? Delta, all black people don't have loaded weapons! That's the first thing she said to me at (the) first class (desk). She didn't say hello, she said, 'Do you have a weapon?' She was black...!\" Read the full story here. (FayesVision/WENN.com) \nChris O'Dowd: Irish actor O'Dowd took aim at U.K. airport officials amid claims his three-month-old son was frisked during a security check. He wrote on Twitter, \"Thanks Gatwick security! Some might think body-searching a baby and binning his bottle was overzealous and weird, but not me! #ScaryBaby.\" Read the full story here. (Daniel Deme/WENN.com) \nRachel McAdams: Canadian actress McAdams hates undergoing immigration and security checks at airports after an official insulted her appearance and criticized her movies. The Notebook star was travelling in the U.S. when a female customs officer made a catty remark about her hair after she had it dyed with pink streaks in 2006. Read the full story here. (Dennis Van Tine/Future Image/WENN.com) \nParis Hilton: Socialite Paris Hilton endured a nightmare journey as she made her way to the Cannes Film Festival in France in May 2014, losing a piece of luggage and nearly missing two flights. The hotel heiress came close to missing her flight out of California after her car became stuck in traffic on the freeway en route to the airport, writing on Twitter, \"Rushing to the airport! So much traffic on the 405 (freeway)! I hope I don't miss my flight to Cannes!\" Read the full story here. (WENN.com) \nLeAnne Rimes: Rimes was left red-faced when she set off a plane’s fire alarm while flying to Los Angeles in May 2015. The singer went to the bathroom mid-flight and while using dry shampoo to freshen her hair, she set off the alarm. She wrote on Twitter, \"Leave it up to me to set off the fire alarm in the airplane bathroom w/ theDrybar dry shampoo purecomedy firsttimeforeverything.\" Read the full story here. (WENN.com) \nLena Dunham: Dunham had an embarrassing encounter with a male attendant on a recent flight from New York to Los Angeles when he accidentally walked in on her peeing. She told Jimmy Kimmel in September 2014, \"For a second I thought it was the pilot, so I was excited and then I realized what was actually going on. He shrieked like there was a monster from the great beyond... I didn't know what to do; I was just like, 'That was so much worse for you than it is for me...!' He looked so traumatized.\" Read the full story here. (TNYF/WENN.com)", "external_links": [], "published": "2015-09-21T17:27:00.000+03:00", "crawled": "2015-09-21T19:20:50.863+03:00", "highlightTitle": ""}