{"organizations": [], "uuid": "d8be553d3bcdf2f77fa7bb31a40a056caf19f603", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63608/orbitz-partner-network-announces-partnership-georgia-tourism", "country": "US", "title": "Orbitz Partner Network announces partnership with Georgia Tourism", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Orbitz Partner Network announces partnership with Georgia Tourism", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T22:05:00.000+03:00", "replies_count": 0, "uuid": "d8be553d3bcdf2f77fa7bb31a40a056caf19f603"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63608/orbitz-partner-network-announces-partnership-georgia-tourism", "ord_in_thread": 0, "title": "Orbitz Partner Network announces partnership with Georgia Tourism", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Orbitz Partner Network announces partnership with Georgia Tourism Original,   \nSep 10, 2015 eTN   \nCHICAGO, IL - Orbitz Partner Network, the private label division of Orbitz Worldwide, announced today that it has partnered with the Georgia Department of Economic Development’s Tourism Division to power a custom-built travel booking system that will allow visitors of ExploreGeorgia.org to easily search for and purchase travel products. The fully integrated solution allows travelers to seamlessly book their visit to Georgia, conveniently making flight, hotel, car or vacation package reservations right from the homepage of the website which is also available across mobile devices. \n“We constantly strive to provide the best vacation experiences to our visitors from the initial planning phase to the moment they arrive,” said Kevin Langston, deputy commissioner of tourism at the Georgia Department of Economic Development. “With the new booking tool available on ExploreGeorgia.org, visitors can instantly book their airfare and hotel as well as learn more about our fantastic tourism destinations and experiences available across the state.” \nThe new reservation offering complements ExploreGeorgia.org’s dynamic design and site features including curated content, maps, itineraries, top-ten lists, social media and a blog. The “Book Now” button is easily accessible on the header of the site as well the “sticky” footer. \n“We continue to build out our technology platform to make it easy for organizations like Georgia Tourism to offer the option to book travel right from their desktop or mobile websites,” said Danny Hest, vice president, Orbitz Partner Network. “Our mobile-optimized booking engine harnesses powerful Orbitz technology and includes a wide inventory of travel products. We’re proud to partner with Georgia Tourism to help new visitors explore all their vibrant state has to offer.”", "external_links": [], "published": "2015-09-10T22:05:00.000+03:00", "crawled": "2015-09-10T22:35:52.448+03:00", "highlightTitle": ""}