{"organizations": [], "uuid": "5adfab68c3cfc29c24d0a59348d4984a6572d31a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/ORL_345_aspect16x9.jpg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/calling-all-coffee-lovers-barista-bootcamp-to-be-offered-at-four-seasons-resort-orlando/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Calling all Coffee Lovers: Barista Bootcamp to Be Offered at Four Seasons Resort OrlandoTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Calling all Coffee Lovers: Barista Bootcamp to Be Offered at Four Seasons Resort OrlandoTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "635ec11c11ef46e8dc0bac026a804d5189c1e3e9"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/calling-all-coffee-lovers-barista-bootcamp-to-be-offered-at-four-seasons-resort-orlando/", "ord_in_thread": 0, "title": "Calling all Coffee Lovers: Barista Bootcamp to Be Offered at Four Seasons Resort OrlandoTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Calling all Coffee Lovers: Barista Bootcamp to Be Offered at Four Seasons Resort Orlando  \nThe Four Seasons Orlando\nFor those who’ve ever wanted to become the consummate at-home coffee barista, Lickety Split at Four Seasons Resort Orlando at Walt Disney World Resort is presenting the perfect chance. Guests can attend a Barista Bootcamp, this December, learning how to master single drip coffee, cold brew coffee, coffee cocktails, and latte art. The Barista Bootcamp is offered as part of Four Seasons Entertain U(niversity), a series of unique classes offered between October 1 and December 31, 2015 taught by the entertaining, culinary and beverage masterminds at Four Seasonss properties across the globe.\n \nLickety Split is an innovator among Central Florida coffee shop offerings, featuring techniques and equipment that are unique to Orlando. Lickety Split features Caffe Umbria coffee, a third generation Italian coffee roaster based out of Seattle, Washington, and offers six different blends and four different brew styles, enabling baristas to customise the coffee experience.\n \nThe two-hour Barista Bootcamp at Lickety Split will give the coffee lover the necessary skills to move beyond creating a basic “cup of joe” to creating an extraordinary, signature cup of coffee rich in flavour and with an artful presentation. Baristas-in-training will learn from coffee connoisseur Allison Burkard, Manager of Lickety Split, who honed her coffee making skills in Seattle, Washington at the headquarters for Caffe Umbria coffee roasting company.\n \nBurkard will welcome guests by first teaching them how to make the signature cold brew coffee Lickety Split is known for. Next, she will discuss how to make the perfect single drip coffee. Burkard will also demonstrate how to add some holiday cheer to coffee by creating two different coffee cocktails. In addition, Burkard will provide instruction on latte art – including whimsical designs from Christmas trees to snowmen, perfect for the festive season. Guests will also learn about the art of the pour, and how to serve designer coffees with fun accents such as peppermint swizzle sticks and chocolate spoons, which can be easily made at home and lend a festive touch and holiday flavour to one’s coffee. Each guest will depart with a fun takeaway bag filled with decadent delights from Lickety Split.\n \nClasses, offered at USD 75 per person, will be offered on December 5, December 12, December 19 and December 26, 2015 from 5:00 to 7:00 pm in Lickety Split.\n \nSource:- Four Seasons Hotel & Resorts", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T18:43:31.816+03:00", "highlightTitle": ""}