{"organizations": ["Europe Travel", "Austria Vignette"], "uuid": "8c9dd8a75c6f021b075c6a0a65762ea1310bc2b0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goeurope.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/175075612.jpg", "site_section": "http://z.about.com/6/o/m/goeurope_t2.xml", "section_title": "About.com Europe Travel: What's Hot Now", "url": "http://goeurope.about.com/od/austria/qt/vignette-austria.htm", "country": "US", "title": "Why You Need a Vignette to Drive Austria's Toll...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Why You Need a Vignette to Drive Austria's Toll...", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T14:05:00.000+03:00", "replies_count": 0, "uuid": "8c9dd8a75c6f021b075c6a0a65762ea1310bc2b0"}, "author": "", "url": "http://goeurope.about.com/od/austria/qt/vignette-austria.htm", "ord_in_thread": 0, "title": "Why You Need a Vignette to Drive Austria's Toll...", "locations": ["Austria"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["James Martin"], "text": "Expert Videos The Austria Vignette displayed on a windshield (upper right corner) below the Swiss Vignette. James Martin, Europe Travel \nEurope's \"motorways\" are the fast roads. Many of them are paid for through tolls extracted as you drive. Every so often in Italy or France you'll stop and either get a ticket to commence your journey on the autostrada or autoroute or you'll pay the tolls accumulated in riding on it. In Germany , the autobahn is free of tolls. \nBut traveling on these roads in Austria and Switzerland requires a \"Vignette\" or sticker you affix to your windshield in the appropriate place so that authorities can view if you have paid for one. \nThese stickers record that you have paid the road tax that allows you to ride on the motorways. In Austria, tourists can buy a vignette good for ten days. Currently this ten day sticker costs 7.90 Euros. You can also purchase them for durations of two months or one year. \nThe sticker is designed so that you cannot remove and reattach it. You must purchase a sticker and affix it to the spot designated on the back of the vignette, either on the upper left of the windshield or in the center below the attachment point of the read-view mirror on the inside of the windshield. If the top of the windshield is tinted to prevent the entrance of sunlight, the vignette must be attached below the tinted area so it can be seen clearly. \nA motorcycle also needs a vignette. Where do I buy a Vignette in Austria? \nYou can purchase a Vignette in border countries at gas stations, tobacco stores (\"Tabaktrafik\") and motorway rest stops before reaching Austria. You can purchase one at border crossings if there is a border station, but the safe thing to do if you are outside Austria is to purchase your vignette well before you reach it--at least 10km from the border. You see, there are traps set up so that when you get on the ramp and can't turn around, you've gone too far and won't be permitted to purchase a vignette and will be subject to the fine. The fine, called a \"special tax,\" is currently 120 Euros. So, I've got a Vignette, I'm Done with Paying Tolls, Right? \nNope. There are other roads and passes in Austria that require the payment of a toll at a toll booth. Related Articles", "external_links": [], "published": "2015-09-04T14:05:00.000+03:00", "crawled": "2015-09-05T03:36:45.662+03:00", "highlightTitle": ""}