{"organizations": [], "uuid": "b53bd2328f454b77e27a78be220838668c84167f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thecultureist.com", "main_image": "", "site_section": "http://feeds.feedburner.com/culture-ist", "section_title": "The Culture-ist - An online travel & culture magazine for the socially conscious citizen", "url": "http://www.thecultureist.com/2015/09/22/the-culture-ist-founders-want-you-to-join-them-on-an-extraordinary-trip-to-bali-in-2016/", "country": "US", "title": "The Culture-ist Founders Want You to Join Them on an Extraordinary Trip to Bali", "performance_score": 0, "site": "thecultureist.com", "participants_count": 1, "title_full": "The Culture-ist Founders Want You to Join Them on an Extraordinary Trip to Bali", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T19:47:00.000+03:00", "replies_count": 0, "uuid": "b53bd2328f454b77e27a78be220838668c84167f"}, "author": "culture-ist", "url": "http://www.thecultureist.com/2015/09/22/the-culture-ist-founders-want-you-to-join-them-on-an-extraordinary-trip-to-bali-in-2016/", "ord_in_thread": 0, "title": "The Culture-ist Founders Want You to Join Them on an Extraordinary Trip to Bali", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Culture-ist Founders Want You to Join Them on an Extraordinary Trip to Bali September 22, 2015 by culture-ist Leave a Comment \nWe are heading to Bali in summer 2016 and we want our readers to join us! We hope this will be one of many trips we experience with our incredible global community as we continue to build this new venture. \nThe idea to launch trips around the world came while working with a local organization in Rwanda that empowers women living in poverty. As many of you know, 10 months ago we launched Humanity Unified a hybrid social enterprise with a nonprofit component that works to build up communities in developing nations through education, entrepreneurship and food security programs. We start by investing in women. \nIt is our goal to continuously fund projects in the developing world that align with the HU mission. Travel is and always has been the catalyst behind our passion to create positive change throughout the world, so it just made sense to offer trips that incorporate service and support sustainability, that’s why we named it Travel for Humanity . We also wanted to be able to connect with the people who have been supporting The Culture-ist and Humanity Unified in incredible places around the world where we can gather together to exchange ideas, build friendships and support the local communities we visit. The goal is to donate 100 percent of net profits to Humanity Unified International, our nonprofit that works with local organizations to break the cycle of poverty in developing nations. \nWe hope that you will consider joining us in Bali or on any of the future trips we offer. You can learn more about Travel for Humanity and our trip to Bali HERE .", "external_links": [], "published": "2015-09-22T19:47:00.000+03:00", "crawled": "2015-09-22T20:12:08.010+03:00", "highlightTitle": ""}