{"organizations": [], "uuid": "3cde68f258d28eb6c33503094b8af089816ed800", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goafrica.about.com", "main_image": "http://f.tqn.com/y/goafrica/1/S/t/Q/IMG_3533.JPG", "site_section": "http://z.about.com/6/g/goafrica/b/index.rdf", "section_title": "About Africa Travel", "url": "http://goafrica.about.com/od/africasafariguide/fl/Safari-Vehicles-Why-It-Matters-How-You-Get-Around-on-Safari.htm", "country": "US", "title": "Safari Vehicles - Best Options for Your Safari", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Safari Vehicles - Best Options for Your Safari", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T00:03:00.000+03:00", "replies_count": 0, "uuid": "3cde68f258d28eb6c33503094b8af089816ed800"}, "author": "", "url": "http://goafrica.about.com/od/africasafariguide/fl/Safari-Vehicles-Why-It-Matters-How-You-Get-Around-on-Safari.htm", "ord_in_thread": 0, "title": "Safari Vehicles - Best Options for Your Safari", "locations": ["Tanzania"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Anouk Zijlma"], "text": "Expert Videos Typical Safari Vehicle, Serengeti National Park, Tanzania. © Anouk Zijlma \nYou can expect to spend at least 6 hours a day in a 4×4 on a typical safari in Africa . That’s a long time to be in a vehicle. So it’s a good idea to understand what type of 4×4 your safari will include (don't ever go with a mini-bus!) how many it will seat, and whether it's worth opting for a private vehicle or not. How many people are there typically on one safari vehicle? \n\nA typical safari vehicle for clients on a luxury safari (like the ones we book) seat 6 people comfortably. Two passengers sit side by side in three rows. Everyone has a window seat. In most cases the seat rows gradually ascend, so the highest off the ground is in the back. This allows for optimal viewing and for photographing wildlife without constantly having half a head in the frame of the person seated in front of you. In many cases the safari vehicle will have a pop-up roof, or a soft roof that can be drawn back. This allows you to stand up for better views and photo opportunities. The sides of the vehicle are often open as well. Some safari vehicles will have a console between the seats which store binoculars, wildlife books, cold drinks and blankets. The extra room can also accommodate a child if your party exceeds the 6 person limit. What are the advantages of booking a private vehicle? \n\nThere are a number of advantages to hiring a private safari vehicle (see below) but note that it will add a fair amount to the cost of your safari . private vehicles are ideal if you have children under 10 (and some camps make this compulsory for families traveling with children under a certain age) You can spend as much or as little time as you want viewing specific animals. If you’re on your 5th safari day, and a new couple has just arrived and is sharing your vehicle, you may not appreciate spending an hour watching impala, when there could be a pride of lion further down the road. Everyone has a different “safari pace”. Some people wish to rush through checking animals off a list, others are happy to spend an hour just enjoying the birds and plant life. Private vehicles come with a driver/guide so you have the benefit of the same guide for your entire safari. You’ll get to know him well, and vice versa. One of the advantages of having your own driver/guide is he’ll be familiar with what animals you’d most like to see, and what animals you’ve already seen along the way. When you’re traveling in a private vehicle you can make stops anytime you want. This is very handy for bathroom breaks, but even more so if you come across a Maasai market for example, and want to take a look. You’ll have more room to spread out in a private vehicle if there are less than six of you in your party. This is handy for those with lots of camera equipment who might want a spare seat or two to put their equipment on. Is There Always a Private Vehicle Option? \nIn some cases you will not have the option of booking a private vehicle. If you are on safari in Botswana’s Okavango Delta for example, the safari camps are usually fly-in camps and they have their own vehicles on site for game drives. You could potentially fly in your own guide/driver but you would be responsible for the extra costs involved. Many of the best safari camps are on private conservancies or concessions. The advantage is that you get to enjoy a very exclusive safari experience without the crowds. To keep it this way, there are very strict rules about the number of guests allowed at camps, as well as the corresponding number of vehicles. If you are a party of two, it may be impossible to request a private vehicle because other guests may then be unable to take a game drive. You can always request a private vehicle, but it cannot be guaranteed. ​ What is the difference between traveling overland with a private guide and doing a fly-in safari with resident guides? \n\nThe Vehicle – If you are traveling overland in a private vehicle in northern Tanzania, or southern Kenya, your 4×4 may look a little different than those used exclusively for game drives. You’ll have windows and a roof, all the attributes that make for a more comfortable and safe drive on a tarmac road. Once you enter a national park and begin your safari, the roof can be popped up or retracted, the windows rolled down, and you’re set for some perfect game viewing. Vehicles used exclusively for game drives may be more perfectly equipped for a safari with a special side seat that a tracker uses to spot wildlife. \nThe Driver/Guide – As mentioned above, the advantage you have traveling overland with a private guide is that he’ll know what you’ve already seen and what wildlife you enjoy spending time to view. He’ll stop at markets or shops en route if you’re interested in experiencing a little culture along the way. Those clients who fly-in to camp and use resident guides and vehicles have the advantage of localized knowledge (but all the guides we use will share sightings and are very qualified). If you are a keen birder or have very specific wildlife interests that are unique to the area, a resident guide may be a better option for you. ​ What Vehicles are Used on Safari? \n\nContrary to popular opinion, Jeeps are not the safari vehicle of choice. Your safari chariot will almost always be either a Land Rover or a Land Cruiser. A small handful of hybrid safari vehicles are out there, but have not made a real dent in the market as yet. Some camps are beginning to use electric vehicles - will be interesting how many adopt this strategy going forward. Africa Travel Essentials", "external_links": [], "published": "2015-09-30T00:03:00.000+03:00", "crawled": "2015-09-30T01:51:14.304+03:00", "highlightTitle": ""}