{"organizations": [], "uuid": "8f2c69937b574a22d66db7943d1bc3b725810ecb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63610/unwto-21-million-more-international-tourists-first-half-2015", "country": "US", "title": "UNWTO: 21 million more international tourists in first half of 2015", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "UNWTO: 21 million more international tourists in first half of 2015", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T22:45:00.000+03:00", "replies_count": 0, "uuid": "8f2c69937b574a22d66db7943d1bc3b725810ecb"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63610/unwto-21-million-more-international-tourists-first-half-2015", "ord_in_thread": 0, "title": "UNWTO: 21 million more international tourists in first half of 2015", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "UNWTO: 21 million more international tourists in first half of 2015 Original,   \nSep 10, 2015 eTN   \nMADRID, Spain - The number of international tourist arrivals grew by 4% in the first half of 2015 according to the latest UNWTO World Tourism Barometer. Destinations worldwide received some 538 million international tourists between January and June 2015, an increase of 21 million compared to the same period of 2014. \nEurope, Asia and the Pacific and the Middle East all recorded 5% growth in international arrivals and the Americas 4%. Limited data available for Africa points to an estimated 6% decrease in the number of international tourists in the region. At the subregional level, the Caribbean and Oceania (both +7%) were the best performers, together with Central and Eastern Europe and Central America (both +6%). \nIn spite of this overall growth, results by destination are rather mixed. Safety and security remain a global concern while the economic scenario is comparatively more volatile with the recovery of advanced economies contrasting with the slowdown of emerging economies. Tourism demand has also been impacted by lower oil prices and currency fluctuations. \n“These results show that, despite increased volatility, tourism continues to consolidate the positive performance it has had over the last five years and to provide development and economic opportunities worldwide”, said UNWTO Secretary-General, Taleb Rifai. “As UNWTO prepares to meet in Medellin, Colombia, for its 21st General Assembly, this is the appropriate moment to call for a stronger support to tourism as the sector has the potential to deliver on some of the most pressing challenges of our time, namely job creation, economic growth and social inclusion”, he added. \nAccording to the UNWTO forecast issued at the beginning of 2015, international tourist arrivals are expected to increase by 3% to 4% worldwide for the whole year, in line with the long-term forecast of an average growth of 3.8% a year set for the period 2010 to 2020. \nRegional Results \nEurope, the most visited region in the world, led growth and increased international arrivals by 5%, benefiting from a weaker currency in the euro area. Growth was driven by the recovery in Central and Eastern Europe (+6%), while Western Europe, Northern Europe and Southern Mediterranean Europe (each +5%) all outgrew the worldwide average. \nAsia and the Pacific recorded a 5% increase in international arrivals in the first half of 2015, with Oceania (+7%) in the lead. Destinations in North-East Asia and South-East Asia (both +5%) reported rather mixed results, led by Japan (+47% through July) and Thailand (+30% through July). South Asia recorded a comparatively modest 4% increase in arrivals after two years of double-digit growth. \nInternational arrivals in the Americas grew by 4% in the first half of 2015, consolidating last year’s strong results. All four subregions recorded positive growth, although with variations across destinations. The strong US dollar fuelled robust outbound demand from the United States. The Caribbean (+7%) and Central America (+6%) led growth. In North America (+3%), arrival numbers were strong in Canada and Mexico (both +8%), while for the United States indications point to more modest growth. Most destinations in South America (+4%) reported sound results, in spite of Brazil’s outbound travel stalling. \nThe limited data available for Africa indicates that international tourist numbers were down by 6% with a decline of 10% in arrivals to North Africa and 4% in Sub-Saharan Africa. Alongside the impacts of the terrorist attacks, African destinations have been impacted by the aftermath of the Ebola outbreak in a few West African countries and the slower growth of regional economies depending on the export of oil and other commodities. \nInternational tourist arrivals in the Middle East grew by 5% consolidating the recovery initiated in 2014. \n(Data for Africa and Middle East should be taken with caution as it is based on limited available data.) \nSource markets show mixed results \nIn terms of outbound tourism, data for the first quarters of 2015 shows a diverse picture in spending abroad. \nAmong the emerging markets, China and India both started the year with double-digit growth in the first quarter, while expenditure from the Russian Federation and Brazil reflected the slower economic growth in both markets and the depreciation of the rouble and the real against the US dollar and the euro. \nAs for the traditional advanced economy source markets, demand from the United States, France, Sweden and Spain remains strong, while it is weaker in Germany, the United Kingdom, Italy and Canada.", "external_links": [], "published": "2015-09-10T22:45:00.000+03:00", "crawled": "2015-09-10T22:35:51.342+03:00", "highlightTitle": ""}