{"organizations": [], "uuid": "6f5fea871b1fa68b1260c96c2d7376e99ad2245f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.deccanchronicle.com", "main_image": "http://dd508hmafkqws.cloudfront.net/sites/default/files/beer%20NZ_0_0_0_0_0_0_0_0_0_0_0_0.jpg", "site_section": "http://www.deccanchronicle.com/lifestyle/travel", "section_title": "Travel | Deccan Chronicle", "url": "http://www.deccanchronicle.com/150919/lifestyle-travel/article/thousands-vistors-expected-munichs-oktoberfest", "country": "US", "title": "Thousands of vistors expected at Munich's Oktoberfest", "performance_score": 0, "site": "deccanchronicle.com", "participants_count": 1, "title_full": "Thousands of vistors expected at Munich's Oktoberfest", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T06:59:00.000+03:00", "replies_count": 0, "uuid": "6f5fea871b1fa68b1260c96c2d7376e99ad2245f"}, "author": "AP", "url": "http://www.deccanchronicle.com/150919/lifestyle-travel/article/thousands-vistors-expected-munichs-oktoberfest", "ord_in_thread": 0, "title": "Thousands of vistors expected at Munich's Oktoberfest", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AP | September 19, 2015, 19.07 pm Representational image. (Picture Courtesy: File photo) Munich : The beer is flowing again at Munich's fabled Oktoberfest. Mayor Dieter Reiter inserted the tap into the first keg Saturday with two blows of his hammer and the cry of \"O'zapft is!\" - \"It's tapped!\" Some 6 million visitors are expected in Munich for the 182nd Oktoberfest, which runs through Oct. 4. Ten of thousands are traveling to the feast via Munich's main train station, which has also seen floods of refugees in recent weeks. On Saturday, however, only a few dozen asylum-seekers had arrived from Germany's southern border and were quickly ushered away by police. In contrast, hundreds of Oktoberfest revelers - many dressed in traditional Bavarian lederhosen and dirndl dresses - walked from the train station to nearby Theresienwiese, site of the festivities. Munich police spokesman Simon Hegewald said the situation at the train station was calm and authorities were well prepared. Federal police said the number of asylum seekers crossing in from Austria has been declining in recent days to less than 2,000 on Friday. Since Germany introduced border controls last weekend, most migrants who enter Germany are taken to the border town of Freilassing, where they are put on buses and trains and distributed across the country. Officials said four more special trains were leaving Freilassing this weekend. \"Life in Munich will go on, and it has gone on for several weeks, despite the massive influx of refugees,\" said Linda Benedickt, a 43-year-old writer from Munich. She was not overly fond of Oktoberfest, \"because people spend an awful lot of money getting mindlessly drunk, but it is part of the city.\" Marc Reig, who had come from Sallent, Spain, to celebrate with friends at the Oktoberfest, showed compassion for the asylum-seekers. \"Today and tomorrow we are celebrating, but we aren't forgetting the refugees,\" said Reig, a 25-year-old physicist dressed in Bavarian lederhosen. He and his friends plan to bring Lego toys to refugee children once they are done partying. \"We know the Bavarian government is providing food and accommodation for them. But we want to have a present for some of the kids,\" he said. oktoberfest beer festival German festival Munich festival Also Read Time to say Prost! Pennsylvania beer festival makes nudity mandatory", "external_links": ["http://platform.twitter.com/widgets.js", "http://static.ak.fbcdn.net/connect.php/js/FB.Share", "http://vuukle.com/js/vuukle.js", "http://twitter.com/share?url=http://www.deccanchronicle.com/150919/lifestyle-travel/article/thousands-vistors-expected-munichs-oktoberfest", "https://apis.google.com/js/plusone.js", "http://dd508hmafkqws.cloudfront.net/sites/default/files/styles/article_node_view/public/beer%20NZ_0_0_0_0_0_0_0_0_0_0_0_0.jpg", "http://www.facebook.com/sharer.php", "http://dd508hmafkqws.cloudfront.net/sites/default/files/beer%20NZ_0_0_0_0_0_0_0_0_0_0_0_0.jpg"], "published": "2015-09-22T06:59:00.000+03:00", "crawled": "2015-09-21T20:31:14.529+03:00", "highlightTitle": ""}