{"organizations": ["American Tobacco plc", "Sirius Minerals PLC And Mitchells & Butlers plc"], "uuid": "71dfa5367cd8fd2779160b7f567e5bad4a646100", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "uk.finance.yahoo.com", "main_image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "site_section": "https://uk.finance.yahoo.com/news/sector-travel-leisure/?format=rss", "section_title": "Travel Industry News | Leisure Industry News - Yahoo! Finance UK", "url": "https://uk.finance.yahoo.com/news/british-american-tobacco-plc-sirius-104507281.html", "country": "US", "title": "Are British American Tobacco plc, Sirius Minerals PLC And Mitchells & Butlers plc Set To Post Stellar Returns?", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Are British American Tobacco plc, Sirius Minerals PLC And Mitchells & Butlers plc Set To Post Stellar Returns?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T13:45:00.000+03:00", "replies_count": 0, "uuid": "71dfa5367cd8fd2779160b7f567e5bad4a646100"}, "author": "", "url": "https://uk.finance.yahoo.com/news/british-american-tobacco-plc-sirius-104507281.html", "ord_in_thread": 0, "title": "Are British American Tobacco plc, Sirius Minerals PLC And Mitchells & Butlers plc Set To Post Stellar Returns?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Tip : Use comma (,) to separate multiple quotes. Learn more... \nTue, Sep 22, 2015, 15:21 BST - UK Markets close in 1 hr 9 mins Are British American Tobacco plc, Sirius Minerals PLC And Mitchells & Butlers plc Set To Post Stellar Returns? By Peter Stephens | Fool.co.uk – 3 hours ago 19.475 +0.2250 \nShares in pub company Mitchells & Butlers (LSE: MAB) have slumped by 3% today after it released a disappointing trading update. In fact, the company stated that its profit for the full-year will be towards the bottom end of current market expectations, with the key reason being challenging trading conditions in recent months. \nOne major contributor to M&B's woes is poor weather conditions, with the wet weather exacerbating a subdued eating -and drinking-out market in the UK in recent months. This has caused sales growth to slow, with like-for-like sales declining by 0.7% in the seven weeks to 12 September. Although disappointing, this performance is not going to affect M&B's plans for transforming the business, with the company having opened 14 new sites in the past year and converted 48 sites. \nIn addition to the trading update, M&B has also announced the appointment of Phil Urban as CEO. He moves up from COO, having joined the company in January 2015 and the business he will command is due to post impressive profit growth next year, with its bottom line set to rise by 10%. This puts M&B on a forward price to earnings (P/E) ratio of just 8.7, which indicates that it offers excellent share price growth prospects. \nSimilarly, British American Tobacco (LSE: BATS) also appears to be a star buy at the present time. Its earnings are set to rise by 7% next year and this should allow the company to increase dividends per share by almost 5% in 2016. This puts British American Tobacco on a forward yield of 4.7% and, with its top and bottom lines being so stable and resilient, such a high yield remains very enticing for long term investors. \nFurthermore, British American Tobacco trades on a relatively appealing forward P/E ratio of 15.8. This may be higher than for most of its peers, but for a global consumer stock with bright growth prospects it indicates that upward re-rating potential is very much on the cards. \nMeanwhile, Sirius Minerals (LSE: SXX) received a boost today as a result of being awarded prequalification status by Infrastructure UK, which is a unit of the Treasury. The prequalification is for consideration of a guarantee by the Treasury in relation to the company's potash project in York and, encouragingly for Sirius Minerals' investors, it means that obtaining funding for the £2bn+ project may become easier. \nAs a result of the news, Sirius Minerals' share price has risen by over 1% in a falling wider market. And, while there is still some way to go before in terms of funding the project, it remains a company with huge potential, a product that has high potential demand and which, in the long run, could deliver superb profits for its investors. \nOf course, finding great value stocks is never an easy task. That's why The Motley Fool has written a free and without obligation guide called 7 Simple Steps For Seeking Serious Wealth. \nIt's a step-by-step guide that could make a real difference to your portfolio returns in 2015 by helping you to find the best stocks at the lowest prices. \nClick here to get your copy - it's completely free and comes without any obligation. \nPeter Stephens owns shares of British American Tobacco. The Motley Fool UK has no position in any of the shares mentioned. We Fools don't all hold the same opinions, but we all believe that considering a diverse range of insights makes us better investors.", "external_links": [], "published": "2015-09-22T13:45:00.000+03:00", "crawled": "2015-09-22T17:24:19.826+03:00", "highlightTitle": ""}