{"organizations": [], "uuid": "14d8fa6ab59ebda159d6609db541dcc73b731d5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150827113405-fall-travel-7-japan-leaves-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss\r", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/09/01/travel/20-places-to-travel-this-fall/index.html", "country": "US", "title": "20 great places to travel this fall", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "20 great places to travel this fall", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T12:52:00.000+03:00", "replies_count": 0, "uuid": "14d8fa6ab59ebda159d6609db541dcc73b731d5a"}, "author": "maureenohare", "url": "http://edition.cnn.com/2015/09/01/travel/20-places-to-travel-this-fall/index.html", "ord_in_thread": 0, "title": "20 great places to travel this fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September's here and summer's drifting away like an autumn leaf in a swimming pool. About time! The end of summer only means the best season for travel is here. It's back-to-school season and we've done our homework to come up with the 20 hottest things to do this fall. 1. Munich Oktoberfest (Germany) Much copied but never bettered, the original Munich Oktoberfest runs from September 19 to October 4 and will welcome around 6 million beer chuggers from around the world. It's the world's largest folk festival -- you can tell by all the tourists in dirndls and lederhosen. The fancy clothes get them in the mood to consume seven million liters of beer and literally tons of pretzels and wurst. But there's far more here than beer and brats. The 'fest's fairgrounds are huge. New attractions for 2015 include the Konga, Europe's biggest and fastest swing, and the Sky Drive roller coaster. Oktoberfest , Theresienwiese, Munich, Bavaria, Germany 2. Grizzly viewing in British Columbia, Canada For most of the year, brown bear (aka grizzly bear) are shy around humans and can be tricky to spot. In Alaska and British Columbia that changes in autumn months when the majestic masters of the forest food chain descend on rivers and streams to gorge on spawning salmon. From late August until early October, we know of few better places to see this annual feed -- and get virtually guaranteed closeup views of grizzlies -- than Bear Camp , where migratory bears join a large resident population in reliable masses. Located on the Chilko River in central BC, the secluded tented camp built around an authentic 1950s fishing lodge offers rustic luxury along with world-class bear viewing. \"Bear Camp is a rare place in today's world where people and bears can live harmoniously,\" say Brian McCutcheon whose ROAM adventure company operates the camp, which also offers whitewater river rafting, hiking, mountain biking and trophy rainbow trout fishing. \"Bear Camp is a wilderness playground for people and bears.\" ROAM (Bear Camp), Nelson, British Columbia; +1 888 639 1114 3. Shoulder season in the Caribbean The Caribbean's sandy daydreamscapes can make other islands look almost dreary. In fall, they're less crowded than in winter high season and hotel rates are considerably lower (with an exception around Thanksgiving). Last year, average daily rates for hotel rooms on the colorful Dutch Antilles island of Curacao were about $45 lower in fall than during the peak winter months. Hurricane season coincides with this slower time in the Caribbean, but statistically, the ABC islands -- Aruba, Bonaire and Curacao -- have a low probability of getting hit. 4. Leaf-viewing (almost anywhere in the Northern Hemisphere) No country has a patent on trees filled with russet, scarlet and golden leaves. New England and Japan remain heavy hitters in the leaf-viewing game, but we also love Douro Valley in northern Portugal, where you can take in the view from a river cruise, explore wine-making villages and try a glass of local Port wine. Moscow has some unexpectedly fine spots for autumn hues. A number of former royal estates have been converted into grand public parks. Once owned by Catherine the Great, Tsaritsyno Park has superb colors. A 390-hectare estate on the banks of the Moskva River, Kolomenskoye is another photogenic spot. Tsaritsyno Park , Dolskaya ul., 1, Moskva, Russia; +7 495 321-63-66 \nKolomenskoye Park , Andropova ave, 39, Moscow 140102 Russia; Kyoto's autumn leaves are as stunning as its springtime cherry blossoms. 5. Day of the Dead (Mexico) Mexico's El Dia de Muertos has been subject to cultural hijacking in recent years, but there's much more to it than sugar-skull kitsch. Respectful travelers in the country are welcomed by locals enacting ancient traditions honoring deceased children (\"angelitos\") on November 1 and deceased adults on November 2. Every ofrenda (shrine) includes pictures of the deceased, food, drinks, skull-shaped candies, candles and cempasuchil, the Aztec marigold or flower of the dead. Day of the Dead festivals take place across Mexico and each region celebrates a little differently. Three of the most elaborate are held in San Andres Mixquic (in Tlahuac, Mexico City), Patzcuaro , Michoacan and Janitzio , Michoacan. Mexico City hosts the least somber of the celebrations, with a whole city of cemeteries and \"comparsas\" parades to explore. 6. Spring skiing (Chile) The tail end of the Southern Hemisphere's winter brings savings on spring skiing. At Portillo resort in the Chilean Andes, many September low-season all-inclusive rates dip by $1,000 or more per person per week from regular season rates. Shorter three- or four-night stays and select weeks when kids ski, stay and eat for free are also available late in the season. \nSki Portillo Centro de Esqui , Renato Sanchez, 4270, Santiago Chile; 7. Motorhead cruise (Bahamas) Improbable as it might seem, hard-living thrash legends Motorhead have made it to their 40th anniversary fully intact and ready to rock. To celebrate, they and their pals are hosting a cruise from Port Miami on September 28, with stops in Nassau and the private picturesque island of Great Stirrup Cay in the Bahamas. In what promises to be one of the most metal moments of all time, Slayer will perform on the ship's deck stage under a Blood Moon on the cruise's opening night. Lemmy may need to take it easy -- the band were recently forced to cut short a show in Salt Lake City after their frontman became unwell. However, support will come from Anthrax, Suicidal Tendencies, Hatebreed and many more, so the audience on the \"loudest boat in the world\" are still sure to be entertained. Lemmy might be wearing a captain's hat, but we're pretty sure those aren't military salutes. 8. Diwali Festival of Light (India) Diwali is the Hindu festival of lights. It's India's biggest and most spectacular festival, with millions attending firework displays, prayer and celebratory events. This year the main action falls on November 11, though festivities extend over a five-day period. In Varanasi, incredible fireworks displays explode over the Ganges. In the \"pink city\" of Jaipur in Rajasthan there are illuminated markets to explore. In Goa, they burn effigies of the demon Narakasura, with competitions to see who can build the most terrifying one. 9. Lake of Stars music festival (Malawi) Partly inspired by the Glastonbury Festival, Malawi's Lake of Stars may lack the big names of the UK's annual music bash, but it also lacks the mud. In the space of a decade, LoS has gone from a low-key dance party on the shores of Lake Malawi to become one of Africa's hottest music events. Running September 25-27, this year's typically eclectic lineup ranges from South Africa's club anthem collective Uhuru to erratic Scots lo-fi hip hop group Young Fathers. DJs are the lifeblood of Lake of Stars, but the real headliner is the location, a palm-fringed shoreline under hot starry skies. Lake of Stars , Sunbird Nkopola Lodge, Mangochi, Malawi 10. Football tailgating (United States) Where else is it acceptable to hang around a parking lot shirtless at nine in the morning drinking beer and shouting abuse at random strangers the color of whose sweatshirts you don't happen to approve of? OK, there's more to tailgating than raucous revelry and engaging rival fans. Most tailgate events, are in, fact like big convivial communal picnics. But there's no doubt that the autumn kickoff of football season (finally!) across America unleashes the nation's tribal party instincts. Almost anywhere you travel across the states in fall you can wander through these uniquely American cultural gatherings. They typically take place on any given Saturday in parking lots outside college football stadiums and on Sundays at pro stadiums. No admission required. You don't even have to attend the actual games to enjoy the spirit. From a near endless list of opportunities to tailgate -- though the term's origins are murky, it's now popularly associated with the custom of laying out beer and food on the open tailgate of a truck -- you can count on to these championship parties: • September 19: Auburn vs. LSU, Tiger Stadium, Baton Rouge, Louisiana • September 20: Seattle vs. Green Bay, Lambeau Field, Green Bay, Wisconsin • October 10: Wisconsin vs. Nebraska, Memorial Stadium, Lincoln, Nebraska • October 31: Florida vs. Georgia, EverBank Field, Jacksonville, Florida 11. The World Beard and Moustache Championships (Austria) Shame on you hipsters, with your unkempt chin hedges. Facial topiary should be an art form, not something that just appears when you just can't get it together enough to drag a Gillette across your jowls for a couple of weeks. Thankfully, some people still have standards when it comes to the pursuit of the hirsute -- none more so than the entrants of the biennial World Beard and Moustache Championships. This year's competition, held in the Austrian Alps from October 2 to 4, will name winners in more than a dozen categories, including imperial moustache, Dali, musketeer, Alaskan whaler and freestyle. World Beard and Moustache Championships , Leogang Saalfelden Touristik GmbH, Saalfelden, Mittergasse 21a, Austria; +43 6582 70660 12. A London all-nighter ... with Tube transport London has long been a 24-hour city, but it looks like its transport system might finally be catching up. When the Night Tube launches this year, there'll be round-the-clock service for the first time ever on five underground tube lines on Friday and Saturday nights. Night owls can enjoy their new liberty by taking in a movie marathon at the Prince Charles Cinema in Leicester Square (coming this fall are nights dedicated to Quentin Tarantino, John Hughes and The Evil Dead trilogy), getting a haircut at Neil Cornelius's 24-hour salon on New Bond Street or grabbing a coffee and a pastry at Soho institution Bar Italia, open until 5 a.m. The new service was due to launch September 12, but in a twist London commuters are well used to, it's been delayed. Transport chiefs are deep in talks with workers' unions and say they still hope to launch this fall. 13. Mid-Autumn Festival (Asia) The Danish may have invented the term hygge (a sort of \"winter coziness\") but they've mastered it in Asia, at least during the annual Mid-Autumn Festival. The festival, which in 2015 falls on September 27, is one of the most important and fun celebrations for ethnic Chinese, as well as Vietnamese. Celebrations vary from place to place. Locals from the Tai Hang neighborhood in Hong Kong weave a fire dragon -- made from more than 10,000 incense sticks -- between narrow streets. Riverbanks are transformed into barbecue sites in Taiwan. Gardens around Asia are turned into lantern exhibitions and night markets. Generally, however, in the days around mid-autumn, families and friends hang lanterns from trees, then picnic until late under the full moon, eating mooncakes and drinking tea. You might be surprised to see how many five-year-olds are still up playing at midnight. You'll need a head for heights -- and strong lungs -- to scale the 618 steps up Skellig Michael. 14. \"Star Wars\" pilgrimage (Ireland) Skellig Rocks, a remote UNESCO World Heritage Site off the southwest coast of Ireland, will be catapulted to worldwide fame when the area is featured in \"Star Wars: Episode VII -- The Force Awakens\" this December. The craggy and vertiginous peaks are uninhabited, but were once the site of a sixth-century monastery. Online gossip has suggested that the location might be used in the movie as Luke Skywalker's Jedi Academy. September is the perfect time to beat the fan masses with a visit -- summer crowds will have departed but the wild Irish winter winds will have yet to move in. Boats depart daily from Portmagee, County Kerry, and it's advised to book well in advance. \nSkelligs Rock , Farranreagh, Valentia Island IE Ireland; 15. Singles' Day (China) Couples are overrated. At least for a day in China. China's Singles' Day (Guanggun Jie) is only a recent invention, but its lack of history doesn't undermine its greatness. The idea is a payback day for all the shame and sadness lonely hearts have presumably suffered for being single on Valentine's Day. On November 11 -- chosen for the four singular number ones in the numerical rendering of the date -- the sensitive feelings and needs of \"guangun\" are meant to be catered to. Singles can enjoy the festival by chowing down four youtiao (or deep-fried flour sticks), guilt free. They can also attend one of the many speed-dating parties around the country, and hopefully find someone before the arrival of the next V-Day. Major online shopping sites support the day by offering huge discounts, making it one of the world's biggest online shopping days. 16. Festival season (Santa Fe, New Mexico) Stress comes to a fiery end in Santa Fe when a 15-meter-tall puppet filled with divorce papers, tax receipts and sad messages scribbled on bits of paper is torched during the annual Burning of Zozobra , or Old Man Gloom. The annual event, held this year on September 4 at Fort Marcy Park, is a highlight of Santa Fe's September festival season. Tickets are $10. A heated Green Chile Cheeseburger Smackdown on September 10 is followed by the Fiesta de Santa Fe from September 11-13. The Fiesta, held for more than 300 years, celebrates the Southwestern city's colonial history with traditional Spanish dancing, mariachi music, religious ceremonies and New Mexican cuisine. The Santa Fe Wine & Chile Festival (September 23-27) and a car and motorcycle show called the Santa Fe Concorso (September 25-27) finish off the month. 17.Rock in Rio (Brazil) Easily up there among the biggest and best music festivals on the planet, Rock in Rio turns 30 this year. Though it'd be impossible to top the lineup of the first Rock in Rio -- which included heavyweights like Queen, AC/DC, Rod Stewart and Ozzy Osbourne and hosted 1,380,000 people over the course of 10 days -- organizers of this year's event didn't take the challenge lightly. Confirmed bands include Elton John, Metallica, Motley Crue, Korn, Katy Perry, Rihanna, Sam Smith, Slipknot, Faith No More, System of a Down, Queens of the Stone Age, Rod Stewart and Seal. The festival hits Rio de Janiero from September 18 to 27. 18. Food festivals Fall is probably the best time of year to be a traveling foodie. There's Ireland's Galway Oyster Festival , which includes the World Oyster Opening Championships, from September 24 to 27. In October, it's white truffle season in the adorable Italian town of Piedmontese, Alba. Special events at the Alba Truffle Fair , from October 10 to November 15, include a Truffle Market, wine tastings and food demonstrations. Fine food fans in Asia shouldn't feel left out though. There's Bangkok's World Gourmet Festival , on from September 7 to 13 at the Anantara Siam hotel . Top chefs scheduled to appear include Jean-Francois Berard of Michelin-starred Hostellerie Berard and fugu master Hirofumi Imamura of Hong Kong Michelin-starred eatery Kazuo. That leaves just enough time to jet over to Tokyo for the 4th Ritz-Carlton Annual Asia-Pacific Food and Wine Festival , on from September 30 to October 4. Heavyweights scheduled to appear include Virgilio Martínez, whose Peru restaurant Central snagged the number four spot at this year's San Pellegrino World's Best Restaurant Awards. 19. Pirates Week (Cayman Islands) The highlight of the Cayman Islands' annual Pirates Week Festival is a mock pirate invasion on November 14, when two old-time sailing vessels packed to the masts with bloodthirsty old salts land at George Town harbor and \"capture\" the governor. There's also live music, street dances, a steel pan competition, sporting events and fireworks. Pirates Week Festival runs November 12-22. piratesweekfestival 20. Open House London (and elsewhere) Unfair though it seems, for 51 weekends of the year the general public isn't allowed to inside the UK's biggest sewage treatment facility. On September 19 and 20, however, the engagingly named Lee Tunnel and Beckton Sludge throws wide its fragrant doors to visitors as part of the worldwide Open Weekend movement that gives rare access to normally closed worlds. Effluent management not your thing? There are 800 other fascinating architectural gems to choose from, including the UK prime minister's hangout at 10 Downing Street. It's not just London. Various other weekends across the fall months see similar events in cities that include New York, Dublin, Helsinki, Barcelona, Lisbon, Brisbane and Chicago.", "external_links": [], "published": "2015-09-01T12:52:00.000+03:00", "crawled": "2015-09-01T13:44:32.334+03:00", "highlightTitle": ""}