{"organizations": [], "uuid": "e1963a5fe3e9f50cfd09743b6a40af22fcaa597d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03444/tusk-rhino_3444345k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-18.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/travelnews/11873714/Prince-William-Elephant-and-rhinos-will-be-extinct-in-the-wild-within-a-few-decades.html", "country": "US", "title": "Prince William: Elephant and rhinos will be extinct in the wild within a few decades", "performance_score": 2, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Prince William: Elephant and rhinos will be extinct in the wild within a few decades - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T18:16:00.000+03:00", "replies_count": 0, "uuid": "e1963a5fe3e9f50cfd09743b6a40af22fcaa597d"}, "author": "Natalie Paris", "url": "http://www.telegraph.co.uk/travel/travelnews/11873714/Prince-William-Elephant-and-rhinos-will-be-extinct-in-the-wild-within-a-few-decades.html", "ord_in_thread": 0, "title": "Prince William: Elephant and rhinos will be extinct in the wild within a few decades", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The need to protect wildlife in Africa is greater than ever before, the Duke of Cambridge said last night, warning that, without action, we are signing the death warrants of iconic species such as elephant and rhino. “You’d have thought we learnt the lessons years ago in the great campaigns to ‘Save the Whale’ or ‘Save the Polar Bear’,” Prince William said at a fundraising ball to mark the 25th anniversary of the Tusk Trust, a conservation group. “But we haven’t. The elephant and rhino, among others, are going the same way and, unbelievably, will be extinct in the wild within a few decades, or less.” Statistics revealed at the ball were shocking: 100,000 elephant slaughtered in the last three years - leaving a population today of just around 400,000, roughly half what it was in 1990. On average, three rhinos a day are being poached for their horns, Charlie Mayhew, CEO and co-founder of Tusk said. The African lion now exists in just 1 per cent of its historic range, leaving a population of less than 25,000 and making it rarer than the rhino. Prince William, a patron of the trust, is planning to appear on Chinese State television in October to address viewers about the illegal wildlife trade. China is a big market for ivory poachers. The hard work of conservationists to prevent poaching in Africa will soon be honoured by the trust in its annual awards. The three finalists include Dr Mary Molokwu from Liberia, who has worked tirelessly in often difficult circumstances to successfully establish, develop and sustain academic forestry and conservation programmes in West Africa. Tusk is celebrating progress in protecting mountain gorillas in Virunga From the Democratic Republic of Congo, Dr Emmanuel de Merode has also been nominated for his commitment to protecting the exceptional biodiversity of Virunga, specifically the mountain gorilla, in the face of civil war and continued unrest. In particular he had outstanding success in re-establishing the rule of law, introducing eco-tourism to the park and managed to provide health and education programmes while remaining apolitical. Cosmas Mumba, from Zambia, was also commended for showing great passion and commitment in his work rescuing primates which has resulted in an exemplary primate release programme which he personally developed. Despite humble beginnings and a general lack of recognition, he has achieved remarkable success. Prince William will also present a lifetime achievement award for conservation at the prize ceremony to be held in London on November 24. Black rhinos in Lewa, Kenya The Duke of Cambridge's speech in full \"Thank you, Charlie. And thank you to the Duke and Duchess of Northumberland, and to their son George, for generously giving the House and marquee for this event. Syon House is a wonderful setting for such a special occasion as this. I will be quite brief, you'll be pleased to hear, as I know some of you heard me speak on the occasion of Tusk's 25th birthday party earlier this year. Like all significant birthdays, this one runs and runs – but Tusk deserves it. Tusk has aged well, better even than me – and that's to say nothing of the fast-greying Founder and CEO Charlie Mayhew. I am proud to say that Tusk is one of the world's leading charities in its field – its expertise is second to none, its commitment to the cause undiminished, and its ability to get things actually done on the ground. That's a hard act to pull off, but Tusk does it. And thank goodness Tusk is so good at what it does. The need to protect wildlife in Africa is greater than ever before. You’d have thought we learnt the lessons years ago in the great campaigns to ‘Save the Whale’ or ‘Save the Polar Bear’. But we haven’t. The elephant and rhino, among others, are going the same way and, unbelievably, will be extinct in the wild within a few decades, or less. Do we want to allow that to happen? By staying on the course we’re on, and doing nothing, we are signing their death warrants.” So what do we need to do? I hate to say it, but it's reasonably simple – and it won't happen just by talking about it. We must take action. On the ground, we must help educate growing populations in Africa who live alongside these creatures and benefit from their economic value. I'm proud to say that Tusk specialise in this. We must also improve the protection and training of rangers in Africa's wildlife parks – which Tusk also does. And then there is the demand to tackle. The illegal slaughter of elephants and rhino for their horns is barbaric, and no-one with wealth or style should want to be associated with it. The problem, of course, is not unique to any part of the world – we must all do our bit. I am so pleased to see so many Chinese guests here today, and I very much welcome the recent moves that the Chinese Government and civil society has made on this issue. I could go on … in short, Tusk's role has never been more important in its 25 year history than right now. Their quiet diplomacy behind the scenes with Governments and their on-the-ground know-how, combined with their terrific team, make them a world-class organisation. Your support for the past quarter of the century has been invaluable – but please don't give up now. Anyway, I said I'd be brief – and I want to end with thank yous. Many of you in this room are the reason for Tusk's success. Your generosity over many years is extremely appreciated, and extends from many corners of the globe. My special thanks to those American and other international Friends of Tusk, who have recognised in this small British charity a global star. My thanks, also, to Tusk's sponsors: Land Rover for your ongoing generosity with your vehicles and funding; and Justerini and Brooks for donating tonight's wine. And to Tusk's very own Dragon, Deborah Meaden, thank you for all the time you've given to organising tonight – and don't let these people leave without a record-breaking auction! Finally, it's my very great pleasure to introduce to you a message from a man who has devoted his life to the cause of wildlife, and who has inspired generations of conservationists: Sir David Attenborough. I will leave the final word with him.\" Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-09-18T18:16:00.000+03:00", "crawled": "2015-09-18T12:22:20.415+03:00", "highlightTitle": ""}