{"organizations": [], "uuid": "e324a3d42ceb8b74267fce31f682e9d1b190c142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/forbes-travel-guide/", "section_title": "Forbes Travel Guide", "url": "http://www.forbes.com/sites/donaldfrazier/2015/09/22/movies-disco-toe-shoes-and-char-kway-teow-singapores-bet-on-a-creative-economy-hits-the-road/", "country": "US", "title": "Movies, Disco, Toe Shoes, and Char Kway Teow: Singapore's Bet on a Creative Economy Hits the Road", "performance_score": 1, "site": "forbes.com", "participants_count": 1, "title_full": "Movies, Disco, Toe Shoes, and Char Kway Teow: Singapore's Bet on a Creative Economy Hits the Road", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T17:52:00.000+03:00", "replies_count": 1, "uuid": "ffa7da49cace13919ecae36e2ed17c2f79f3a557"}, "author": "Donald Frazier", "url": "http://www.forbes.com/sites/donaldfrazier/2015/09/22/movies-disco-toe-shoes-and-char-kway-teow-singapores-bet-on-a-creative-economy-hits-the-road/#post-0", "ord_in_thread": 0, "title": "Movies, Disco, Toe Shoes, and Char Kway Teow: Singapore's Bet on a Creative Economy Hits the Road", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Backstage, there’s a green room equipped the same way they have been from Shakespeare to Sondheim, with everything from sofas, snacks, bottled water, and blocking diagrams to theatrical makeup, emergency shoe repair, and an eagle-eyed stage manager to signal ‘curtain time’.But this one in Manhattan’s Madison Square Park, heart of its arts and media scene, is special. It's an outpost of an unlikely but energetic economic development campaign. All-business, no-nonsense Singapore wants to become a force in the creative industries. It’s already got the Asia Pacific headquarters of Lucasfilm , which helped create the next chapter of the Star Wars franchise, The Force Awakens . It’s invested handsomely in arts facilities, including the massive National Gallery Singapore, due to open soon, and hosts a major new art festival.More than a stage show, Singapore: Inside Out presents itself as a vivid, interactive showcase for Singapore’s art scene, comprising dance, theater, fashion, painting and sculpture, and even conceptual art. “We want to do more than demonstrate what we can do,” says the event’s director, Randy Chan. “We want to bring the audience inside the culture and the creative experience it makes possible.”It’s just one part of a larger set of events meant to heighten Americans’ awareness of Singapore on the fiftieth anniversary of its birth as a tiny breakaway from post-colonial Malaysia with no natural resources and dubious prospects. Celebrating its survival and prosperity, the SG50 program comprises several days of Singaporean food, music, DJs, visual art events, and literature all over the city, hoping to burnish its appeal as a destination and its vibe as a global city.But the business agenda is to seduce the small number of movers and shakers who drive the world’s opinions on where the art and culture are hot. It’s already surprised the art elite who’ve seen it in London and Beijing. Sharon Ament, director of The Museum of London, said “Anyone coming to Singapore Inside/Out would realize there’s a breadth of artistic invention and intervention” going on. Alexandra Munroe, senior curator for Asian Art at New York’s Guggenheim Museum, says \"The art world in Singapore is becoming one of the most vibrant in Asia.”To convince decision-makers like them, it will have to overcome many years of actions and attitudes, official and otherwise, that have given Singapore its reputation as straitlaced, and inhospitable to the arts. This is the place that once banned the folk song Puff the Magic Dragon. In their urgency to build a robust economy, educators stressed STEM subjects and scorned arts education. Until quite recently, censors routinely disallowed works that depict nudity, sexual themes including homosexuality, drug use, religious sacrilege, and especially political opposition, which remains a hot button.All of this, plus harsh sedition and anti-gay laws, had a chilling effect on the expressive arts scene – and on the industries that prosper best in a tolerant culture, such as theater, stagecraft, broadcasting, film production, and advertising.But this city’s cultural juices began to flow around 2008. That’s when The National Museum of Singapore unveiled a massive replica of Michelangelo’s iconic nude statue, David, clad only in skin-tight batik fabric, and positioned it right in the center of its imposing rotunda where it remained for five years.Artists of all types got the message. Since then theater and dance troupes, graphic artists, and filmmakers, have cautiously edged into the limelight, many of them working in the new digital media made possible by Singapore’s massive investment in broadband Internet capacity. Employers in digital entertainment began to hire more locally-grown talent rather than expats or online service agencies. And the national Economic Development Board began to aggressively court overseas investors, part of a strategy in place as early as 2000 that's been picking up steam over the last five years.One global marquee employer saw Singapore’s potential early. LucasFilms, producer of the blockbuster Star Wars film franchise and many others, began to work out of its new Singapore studio as early as 2006 and has trained hundreds of digital artists. Teresa Cheng, its general manager, praised the local labor pool, secure telecomm links, and strong intellectual property protections, and plans to add to the staff of nearly 400 by the end of 2016. And it’s opened a flashy high-profile headquarters, its glass-covered ‘Sandcrawler’, now the largest LucasFilms studio outside of the home office.Others swiftly followed suit. Thanks to Fox, HBO, Bandai, Ubisoft, and a number of special-effects houses, Singapore’s digital entertainment space has grown 50 percent since 2008 to weigh in at more than $1.42 billion US by 2014.Policy-makers soon spotted the potential for the entire economy. A seminal white paper from futurist Richard Florida’s think tank was gaining influence among long-range planners all over the world. Creative industries, according to ‘That’s Entertainment’, benefit from so-called ‘economies of scope.’ Producers of culture, agents, technology vendors, marketers, and various middlemen cluster together, so they can exploit unpredictable, fast-moving opportunities. Creative industry companies tend to be more dynamic and fast-moving. Their success spills over into a number of sectors, like retail, professional services, and education. Dense in intellectual capital, they are easy to start, dissolve, and recreate.“If you’re going to invest heavily in education and technology infrastructure like Singapore has, this is the best way to get bang for your buck,” according to an executive recruiter who’s worked for a number of these firms. “With these jobs, there’s an immediate ramp-up, no lag time between building capacity and doing business. You get a much higher utilization of talent.”Few noticed the connection between creativity and economic growth as keenly as Tharman Shanmugaratnam. Now deputy prime minister and minister of finance, he has spoken out on the importance of the arts to the Singaporean economy since he was minister of education.”We must reinvent ourselves,\" he said in an interview in 2005 and many times since. “We have not done enough as inventors and entrepreneurs. We are redesigning our concept of meritocracy to include a broader range of merits, not just results in standardized exams, to help stimulate creativity and innovation. The arts are a big factor in this.”Singapore institutions have answered the call. The LaSalle College of the Arts, founded as a traditional art school, has become a rigorous, degree-granting boot camp for design professionals, and each year graduates around 850 web designers, video producers, digital artists, set designers, arts managers, and so on. More than 90 percent find related jobs within three months. Another, the Workforce Development Agency, has just rolled out a set of job training programs for more than a dozen segments of the digital media business.On its face this is a sensible, even visionary strategy, says one academic who lives in Singapore part-time. “The government has realized that Singapore is never going to be the low-cost producer of anything anymore. It’s also realized not everyone can be a banker. Creative industries offer a way for everybody else to keep employed on a high level.” It costs a lot to run Singapore, he says, and higher average earnings will pay for it.He cautions that nobody has ever built a creative community from the top down. “The closest were the Medicis and other great patrons of the Renaissance. They spent lavishly on culture, but then they got out of the way and let the ecosystem takes own path.”It’s a question, he said, of whether the Singaporean government is willing to relinquish control of something they are going to such trouble to create.", "external_links": ["http://singapore50usa.com/", "http://www.starwars.com/the-force-awakens/", "http://lucasfilm.com/"], "published": "2015-09-22T17:52:00.000+03:00", "crawled": "2015-09-22T21:57:36.020+03:00", "highlightTitle": ""}