{"organizations": [], "uuid": "b212ab4f5861a9baba2cabcd45eef8ea5ba686e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bdlive.co.za", "main_image": "http://www.bdlive.co.za/national/politics/2012/08/24/anc-flag-xxx/ALTERNATES/crop_100x100/ANC+flag+XXX", "site_section": "http://www.bdlive.co.za/life/travel", "section_title": "Travel &amp; Food | BDlive ", "url": "http://www.bdlive.co.za/opinion/editorials/2015/09/30/editorial-a-bribe-by-any-other-name.", "country": "ZA", "title": "EDITORIAL: A bribe by any other name…. | Editorials", "performance_score": 0, "site": "bdlive.co.za", "participants_count": 1, "title_full": "EDITORIAL: A bribe by any other name…. | Editorials | BDlive", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T13:55:00.000+03:00", "replies_count": 0, "uuid": "b212ab4f5861a9baba2cabcd45eef8ea5ba686e8"}, "author": "bdlive.co.za", "url": "http://www.bdlive.co.za/opinion/editorials/2015/09/30/editorial-a-bribe-by-any-other-name.", "ord_in_thread": 0, "title": "EDITORIAL: A bribe by any other name…. | Editorials", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Picture: DAILY DISPATCH Related articles ANC denies involvement in Hitachi, Chancellor House transaction Hitachi fined in US for paying ANC ‘front’ Why state enterprises will never get it right Nuclear plan will dwarf arms deal Irregular spending does not go into a hole to rot In this article Companies and organisations: Eskom | African National Congress JAPANESE conglomerate Hitachi’s decision not to contest a $19m fine to settle US charges that it paid kickbacks to the African National Congress (ANC) to ensure its South African subsidiary won lucrative contracts for the Medupi and Kusile power stations underlines the relevance of Wednesday’s anticorruption marches in Pretoria and Cape Town.\nIt also reinforces the argument of those who have objected to the manner in which the government has tried to forge ahead with its huge nuclear power programme without proper consultation or costing.\nHitachi Power Africa’s partnership with Chancellor House, an ANC front company, to secure Eskom contracts worth R38bn when they were awarded in 2007 was flagged as problematic from the beginning, yet neither the governing party nor any state institution tasked with preventing corruption was prepared to act.\nNow it has emerged from a US Securities and Exchange Commission investigation that Hitachi paid Chancellor House, which bought its 25% stake in Hitachi Power Africa for a piddling R1.25m in 2005, a $1m \"success fee\" and $5m in \"dividends\" for helping it land the lucrative contracts.\nIn the wake of the arms procurement corruption scandal, and now clear evidence that the ANC benefited to the tune of R50m via Chancellor House through Eskom awarding contracts to Hitachi, there is every reason to fear that a shadowy nuclear deal will produce a crooked outcome at the nation’s expense.\nEnough is enough. The governing party can no longer be allowed to get away with feigning ignorance and deflecting blame when it and its members show scant regard for the rules and the law.\nFormer ANC treasurer Mathews Phosa was slapped down by the party when he conceded that Chancellor House’s dealings with the state were problematic, and he is now on the outside looking in.\nIf the party and the government it controls want its oft-repeated claim to be taken seriously about combating corruption to retain any credibility, it must act decisively to liquidate Chancellor House. A political party cannot also be in business, especially when it is in power and controlling the public purse strings.\nIt is also essential that the Hawks follow up on the Securities and Exchange Commission’s charges and pursue those who conspired to commit bribery and repeatedly lied to the public.\nThe claim that Hitachi was the only serious bidder for the contracts and therefore would have won them anyway does not hold water — Hitachi’s cosy relationship with the ANC would have been enough to convince potential competitors that bidding would be a waste of time.\nFinally, there is a clear need to review all of the major contracts awarded by Eskom as part of its generation capacity expansion programme. Gross cost overruns are a matter of record, and if the Hitachi contracts are anything to go by, the explanation is at least partly the need to factor in the bribes required to win tenders.\nOrganised business has been reluctant to fully endorse Wednesday’s anticorruption march, for understandable reasons. The organisations behind it make no secret of their antipathy towards the private sector on ideological grounds. No business is ever going to be entirely comfortable supporting action that results in factories and shops closing, and there is an undeniable party-political flavour to the protest.\nYet as the Hitachi— Chancellor House debacle illustrates, big business is as much part of the problem as it could be part of the solution. Corruption Watch executive director David Lewis’s comments in Tuesday’s Business Day should resonate: corruption deters investment and therefore economic growth, and the popular perception that companies are deeply implicated destroys trust and is simply bad for business.", "external_links": [], "published": "2015-09-30T13:55:00.000+03:00", "crawled": "2015-09-30T11:42:08.660+03:00", "highlightTitle": ""}