{"organizations": [], "uuid": "c0c3bff8057d2e17ef38ae055bc15542d0e3419a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/content/dam/images/1/5/k/5/f/z/image.related.StuffLandscapeSixteenByNine.620x349.171qjm.png/1442890543062.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/destinations/72304546/Top-10-cities-that-never-sleep", "country": "AU", "title": "Top 10 cities that never sleep", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Top 10 cities that never sleep", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T05:55:00.000+03:00", "replies_count": 0, "uuid": "c0c3bff8057d2e17ef38ae055bc15542d0e3419a"}, "author": "Ute Junker", "url": "http://www.stuff.co.nz/travel/destinations/72304546/Top-10-cities-that-never-sleep", "ord_in_thread": 0, "title": "Top 10 cities that never sleep", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Top 10 cities that never sleep UTE JUNKER Last updated 05:00, September 23 2015 123RF \nPedestrians at the famed crossing of Shibuya district in Tokyo, Japan. Shibuya is a fashion center and nightlife area. \nLooking to keep the party going while on holiday? Check out ten cities around the world that never sleep. \nLAS VEGAS In the ultimate 24/7 city, the gambling never stops and neither does the party. You really will need to stay up all night if you want to sample even a fraction of Vegas' up-late offerings. For something upmarket, there is the Voo Doo Steak and Rooftop Night Club, with its bird's-eye view of the neon city. Or for pure Vegas tack, try the Egyptian-themed Cleopatra's Barge – yes, it's a real boat. \nThe High Roller wheel offers amazing views over Sin City. Image: Reuters \nSAO PAULO Dinner hour in Brazil doesn't begin till about 10pm, so satisfying the midnight munchies is never a problem. What may be a problem, however, particularly in the see-and-be-seen parts of town, is getting a table. At trendy 24-hour restaurants such as Paris 6, expect queues even in the early hours. The wait is worth it, for the people-watching as much as the food. \nHONG KONG Sleepless in Hong Kong? You are not alone. This city never stops, so whatever craving strikes, there is a way to satisfy it. Fancy a 2am foot massage? No problem: plenty of reflexology parlours stay open into the wee hours. As for food – a national obsession – there are plenty of all-night diners to choose from, particularly in the Wan Chai district. \nNEW ORLEANS Late nights are a lifestyle in New Orleans, where the good times just keep rolling. Plenty of drinking holes are open 24 hours a day, including the legendary Buffa's Bar, and the live music scene also caters for night owls. Many of the best music venues in town, clustered together on Frenchmen Street, offer a choice of early and late performances, and encourage patrons to kick on afterwards. \nBARCELONA Where did the Latin Americans learn their late-night ways? From the Spanish, of course. So it's only natural that in a city such as Barcelona, late night revellers have plenty of choice. Most bars, including elegant venues such as Muy Buenas, are open till about 2am. For hardcore party people, several under-the-radar bars, such as Papillon in the El Born district, don't even open until 3am. \nTOKYO In a city this well ordered, it is no surprise that night owls have plenty of late-night bars and restaurants to choose from. What makes Tokyo special, however, is that it caters to other desires, too. Need a good soak? Many onsen baths are open 22 hours a day, closing for two hours about 7am. There are also 24-hour bowling alleys, golf ranges and gyms. Even some vintage clothing stores open until 1am. \nBerlin is a colourful and modern city with a notorious nightlight. Image:123rf.com \nBERLIN Berlin's notorious nightclub scene doesn't get going until after midnight, with iconic clubs such as Berghain​, Watergate and Weekend laying down beats until sunrise and beyond. Clubbing not your thing? The thermal baths at Liquidrom are open until midnight, as is Dussmann das Kulturkaufhaus, which stocks Berlin's best selection of English language books.", "external_links": [], "published": "2015-09-22T05:55:00.000+03:00", "crawled": "2015-09-23T04:10:25.544+03:00", "highlightTitle": ""}