{"organizations": ["Macau Food & Drink"], "uuid": "9a14ea1cd8e7b830ac7b674fe1dd88487b921585", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bbc.com", "main_image": "http://ichef.bbci.co.uk/wwfeatures/624_351/images/live/p0/31/hh/p031hhtf.jpg", "site_section": "http://www.bbc.com/travel/feed.rss", "section_title": "BBC Travel", "url": "http://www.bbc.com/travel/story/20150909-the-baker-behind-macaus-famous-egg-custard-tarts?ocid=global_travel_rss", "country": "GB", "title": "A food that forever changed Macau", "performance_score": 0, "site": "bbc.com", "participants_count": 0, "title_full": "A food that forever changed Macau", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T20:06:00.000+03:00", "replies_count": 0, "uuid": "9a14ea1cd8e7b830ac7b674fe1dd88487b921585"}, "author": "", "url": "http://www.bbc.com/travel/story/20150909-the-baker-behind-macaus-famous-egg-custard-tarts?ocid=global_travel_rss", "ord_in_thread": 0, "title": "A food that forever changed Macau", "locations": ["Macau"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Kate Springer"], "text": "Food & Drink The baker behind Macau’s famous egg custard tarts Commonly considered a Portuguese import, Macau’s most iconic treat was actually born from the unbridled energy of an English pastry pioneer. By Kate Springer 10 September 2015 \nAlthough commonly considered a Portuguese import, Macau’s famous egg custard tarts actually had English roots. In fact, they were a gift from one adventurous English baker in particular – Andrew Stow – who chanced into creating the territory's most beloved treat and in turn, transformed the colourful village of Coloane into a sort of pilgrimage for pastry-loving travellers from around the world. \nVisiting Stow’s unassuming bakery today and sampling one of his pastel de nata- inspired tarts – with their flaky pastry crusts, delicious egg custard centres and a crispy crème brulee tops – provides a window in the baker’s legacy, nearly 10 years after his death. \n“He always blundered into everything and was fearless in the kitchen,” said Stow’s sister Eileen. “He was really like a six-year-old in an adult body, hence why he had no fear to change a well-known recipe to make it his own.” View image of St. Francis Xavier Church in colourful Coloane (Credit: Credit: AsianDream/iStock) \nStow opened the now famous Lord Stow’s Bakery in Coloane’s central square in 1989 – but he hadn’t moved to Macau to be a baker. First he was an industrial pharmacist, and then he opened up an ingredient import business, which eventually failed. When he then decided to start a bakery, he just happened to open shop at the right time. “In the ‘80s, a lot of Portuguese came to Macau and started their own businesses because the country was seeing an economic boom,” explained Jason Wordie, local historian and author of the book Macao – People and Places, Past and Present. Until then, very little European food culture had influenced the region. \n“[At the time], the only custard tart on sale in [local] cake shops was one with a short crust which was an import from Hong Kong, influenced by the British custard tart,” said Liz Thomas, a longtime Macau resident and former event planner and travel operator. “And, no, they weren’t very nice.” \nThe Hyatt Regency (now the Regency Hotel Macau ) was also experimenting with egg custard tarts on the buffet line from time to time, \"but these were different,” Thomas said. “They were a version of the pastel de Belem of Lisbon – an egg tart with a much paler filling which included corn flour.” \nChef Raimund Pichlmaier, who worked at the Hyatt Regency and had been a client of Stow’s import business, introduced the Englishman to the pastel de nata recipe and gave him a dozen heavy-duty tart tins to get going. View image of Whisking the cream and egg filling (Credit: Credit: Kate Springer) \nNot content with the Hyatt’s traditional tart, which had a jelly-like consistency, Stow tinkered with the recipe, jettisoning corn flour in the spirit of the creamier British custard tarts. He also chose to mould the tart’s shells by hand – a divergence from the dense English shell that’s pounded into shape. \nThe result was a Portuguese-English hybrid – with a custard that’s more like the English version, and a light, flaky shell and caramelised top that stays true to the Portuguese pastel de nata – thought by historians to be invented by the 18th-century monks of the Jeronimos Monastery in Lisbon’s Belém parish. \n“I remember walking down Oxford Street with Andrew in 1988, we passed a bakery and he pointed and said ‘That’s what I’m going to make in my bakery,” said Eileen. “It was these little gnarled up, camel-dropping things that were just very bad pastel de nata . So we went in and tried them, and I [said] ‘Ugh these are horrible.’ And he just said: ‘Mine will be much better than that.’” View image of Queuing up for Lord Stow's famous tarts (Credit: Credit: Kate Springer) \nAnd by all accounts, Stow has found success. Despite initial hurdles –“the Portuguese turned their noses up because they weren’t authentic enough and the Chinese thought the [caramelised] black spots on top would make them sick,” Eileen explained – today the company sells 13,500 to 14,000 tarts a day. Having already expanded to a second space in Coloane, a factory near the airport and a branch in The Venetian Macao resort in 2014, the family is opening a new casual dinner restaurant in Coloane in December. The original location – a peeling beige façade surrounded by two-storey, European-style buildings splashed in lively shades of turquoise, sunny yellows and pastel pinks – continues to draw queues of locals and travellers alike. \nAudrey Stow remembers her father with joy, having spent her childhood years with him in the tiny bakery, which was equipped with three ovens and located behind the family’s former apartment. “You’d see my dad and a bunch of ladies cutting and squeezing, baking and selling the tarts all in one place,” she said. View image of Prepping egg custard tarts for customers (Credit: Credit: Kate Springer) \nIn some ways, he was predictable: he wore almost the same outfit every day, with white Reebok shoes, a white T-shirt from an old Chinese store and jeans or shorts. But he could also be wholly unpredictable. “To say he was a larger than life character is a bit of an understatement,” Eileen said. “When Andrew arrived, the party started.\" \nWith the unbridled energy of a child and the slapstick, innuendo-rich humour of Benny Hill, Stow would try just about anything. He was a fixture in the social fabric of Macau, and his funeral brought people from all walks – including can can dancers, nuns, neighbours and everyone in between – to celebrate his life. \nIt’s been nearly 10 years since Andrew Stow’s passing and not much has changed in the quaint Coloane bakery. He still lords over the shop: a trio of portraits hangs by the entrance, capturing him in his signature white T-shirt and smiling as hungry patrons shuffle to taste his freshly baked egg custard tarts.", "external_links": [], "published": "2015-09-10T20:06:00.000+03:00", "crawled": "2015-09-10T07:51:21.912+03:00", "highlightTitle": ""}