{"organizations": [], "uuid": "5685bd791537d1c8734a18291410d6532fafe5da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150925121911-gandhi-tease-2-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss\r", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/09/25/travel/gandhi-descendants-durban-south-africa/index.html", "country": "US", "title": "Gandhi's South African legacy", "performance_score": 1, "site": "cnn.com", "participants_count": 1, "title_full": "Gandhi's South African legacy", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T15:49:00.000+03:00", "replies_count": 0, "uuid": "5685bd791537d1c8734a18291410d6532fafe5da"}, "author": "maureenohare", "url": "http://edition.cnn.com/2015/09/25/travel/gandhi-descendants-durban-south-africa/index.html", "ord_in_thread": 0, "title": "Gandhi's South African legacy", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Mahatma Gandhi's descendants thrive in South Africa By Colin Hancock and Pete Kowalczyk, for CNN Updated 1318 GMT (2018 HKT) September 25, 2015 12 photos: Gandhi: His life in pictures Indian leader Mahatma Gandhi (Mohandas Karamchand Gandhi, 1869 - 1948). Hide Caption 12 photos: Gandhi: His life in pictures Gandhi was born and raised in Gujarat, western India, and studied law in London. Hide Caption 2 of 12 12 photos: Gandhi: His life in pictures Gandhi with politician Mrs Sarojini Naidu, with a garland, during the Salt March protesting against the government monopoly on salt production, in 1930. Hide Caption 3 of 12 12 photos: Gandhi: His life in pictures Gandhi is greeted by a crowd of female textile workers during a visit to Darwen, Lancashire, in 1931. Hide Caption 4 of 12 12 photos: Gandhi: His life in pictures An admiring crowd gathers to witness the arrival of Mahatma Gandh in Canning Town, East London, as he calls upon Charlie Chaplin, in 1931. Hide Caption 12 photos: Gandhi: His life in pictures Gandhi in 1935. He was imprisoned several times, both in India and South Africa. Hide Caption 6 of 12 12 photos: Gandhi: His life in pictures Indian politician Jawaharlal Nehru (1889 - 1964) and Gandhi in conversation at a session of the All India Congress Committee (AICC) in Bombay, 8th August 1942. It was at this session that the Quit India Resolution was passed, calling for India's independence from British rule. Hide Caption 12 photos: Gandhi: His life in pictures Profile view of Indian Mohandas Gandhi as he gestures during a speech, mid 1940s. Hide Caption 12 photos: Gandhi: His life in pictures Gandhi fasting in protest against British rule after his release from prison in Poona, India. Hide Caption 9 of 12 12 photos: Gandhi: His life in pictures Gandhi died on 30 January 1948. Here, on 4 February, the Governor General's Bodyguard head the procession on the 5.5 mile route through New Delhi to the funeral pyre. Hide Caption 12 photos: Gandhi: His life in pictures The crowd watching the funeral procession. Hide Caption 11 of 12 12 photos: Gandhi: His life in pictures Newly elected Members of Parliament from Birju Janata Party offer white roses to the statue of India's 'father of nation' Mahatma Gandhi on their arrival on the second day of the first session of India's newly elected parliament in New Delhi on June 5, 2014. Hide Caption 12 of 12 Durban, RSA (CNN) Looking out across Durban port, the Indian ocean stretches thousands of miles east, connecting two countries whose stories are deeply entwined. Home to the largest Indian population outside of India, Durban is a bastion of Asian culture from across the sea. 10 photos: Discover Durban 10 photos: Discover Durban On the waterfront – Many South Africa visitors overlook Durban, missing out on its great beaches and sense of style. Hide Caption 1 of 10 10 photos: Discover Durban uShaka Marine World – The Point, a once-seedy dockside area, hosts high-end condos linked by canals and uShaka Marine World. Hide Caption 2 of 10 10 photos: Discover Durban Fin dining – One of uShaka's attractions is the Cargo Hold restaurant, where diners eat while sharks look on, possibly licking their lips. Hide Caption 3 of 10 10 photos: Discover Durban Beach party – One million South Africans flock to Durban's beaches every summer. For Christmas or New Year, book early or don't bother. Hide Caption 4 of 10 10 photos: Discover Durban Pulling power – If it's too hot for a stroll along Durban's Golden Mile, flag a Zulu rickshaw. A century ago, more than 2,000 of them crowded the streets and docks. Now there are about 20 registered pullers. Hide Caption 5 of 10 10 photos: Discover Durban Perfect paddling – The water off Durban is warm enough to swim in year round, making it a watersports paradise. The beaches are protected by shark nets. Hide Caption 6 of 10 10 photos: Discover Durban Shifting sands – On Durban's Golden Mile, stalls offer beach gear and Zulu crafts. Along the beach, sculptors create landmarks and wildlife from the sand. Hide Caption 7 of 10 10 photos: Discover Durban The Oyster Box – Despite the trappings of colonialism, Oyster Box hotel is one of South Africa's best spots for a sundowner. Hide Caption 8 of 10 10 photos: Discover Durban The KwaZulu-Natal Society of Arts – The KwaZulu-Natal Society of Arts , in a custom-designed building that includes a charming shop and cafe set in tropical gardens, is the best destination for contemporary arts. Hide Caption 9 of 10 10 photos: Discover Durban Phoenix Settlement – The Phoenix Settlement makes for an interesting side trip. Founded by Indian independence leader Mohandas Gandhi, it regularly attracts public figures such as Ravi Shankar, pictured here in 2006. Hide Caption 10 of 10 The palm tree clad port at Durban has welcomed Indian traders, businessmen and their families since the 1860s. Long-time home to one Mahatma Gandhi, the city has played its part as a launchpad for the young Indian lawyer's political activism and minority representation. Today, the place is a testament to multiculturalism, and a symbol of how the cultures of South Africa and India are indelibly linked. A journey across the seas JUST WATCHED", "external_links": [], "published": "2015-09-25T15:49:00.000+03:00", "crawled": "2015-09-25T16:58:02.044+03:00", "highlightTitle": ""}