{"organizations": [], "uuid": "2a74cf471bd5bb429813e23fe769320f634ce770", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/10/lufthansa-300x65.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/vereinigung-cockpit-strike-on-wednesday-2000-of-3000-planned-lufthansa-group-flights-expected-to-operate/", "country": "US", "title": "Vereinigung Cockpit strike on Wednesday: 2,000 of 3,000 planned Lufthansa Group flights expected to operateTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Vereinigung Cockpit strike on Wednesday: 2,000 of 3,000 planned Lufthansa Group flights expected to operateTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "2a74cf471bd5bb429813e23fe769320f634ce770"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/vereinigung-cockpit-strike-on-wednesday-2000-of-3000-planned-lufthansa-group-flights-expected-to-operate/", "ord_in_thread": 0, "title": "Vereinigung Cockpit strike on Wednesday: 2,000 of 3,000 planned Lufthansa Group flights expected to operateTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vereinigung Cockpit strike on Wednesday: 2,000 of 3,000 planned Lufthansa Group flights expected to operate Published on : Wednesday, September 9, 2015\nThe Vereinigung Cockpit pilots’ union has called on its members to take strike action tomorrow (Wednesday 9 September) affecting Lufthansa short- and medium-haul services from Germany. Lufthansa deeply regrets the resulting inconvenience to its customers.\nAll in all, the Lufthansa Group had some 3,000 flights planned for tomorrow. Of these, 1,520 flights with 180,000 travellers booked on them were to have been operated by Lufthansa. And 1,350 of these are short- and medium-haul services. Despite the strike action, over 500 Lufthansa flights will be able to operate tomorrow. The services of Germanwings, SWISS, Austrian Airlines and Brussels Airlines are not affected, and will operate as scheduled.\nAny customers whose flight is cancelled as a result of the strike will be able to rebook or to cancel their booking free of charge or penalty. All travellers holding a Lufthansa ticket for a flight from, to or via Frankfurt, Munich or Düsseldorf on 9 September will also be able to make one free rebooking online at LH.com under “My Bookings”. Travellers within Germany whose Lufthansa flight is cancelled as a result of the strike will be able to use the trains of Deutsche Bahn instead, by converting their air ticket into a rail ticket either online at LH.com (“My Bookings”) or at a Lufthansa check-in machine.\nLufthansa’s long-haul network will also see some cancellations tomorrow. Fifty-two of the 176 long-haul services planned for Wednesday 9 September will have to be cancelled as a result of the strike action, partly because – as a consequence of today’s strike – the aircraft concerned are not yet back where they need to be to operate tomorrow’s services as scheduled.\nSource:- Lufthansa", "external_links": [], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T04:20:24.307+03:00", "highlightTitle": ""}