{"organizations": [], "uuid": "e04bafdb86fe5faf694801b5aa961ea719b6cced", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prnewswire.com", "main_image": "http://content.prnewswire.com/designimages/logo-prn-01_PRN.gif", "site_section": "http://rss.prnewswire.com/industry/tra/", "section_title": "PR Newswire: Travel", "url": "http://www.prnewswire.com/news-releases/destination-dc-to-redesign-website-partners-with-mmgy-global-300151693.html", "country": "IL", "title": "Destination DC to Redesign Website, Partners with MMGY Glob", "performance_score": 0, "site": "prnewswire.com", "participants_count": 1, "title_full": "Destination DC to Redesign Website, Partners with MMGY Glob", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T19:41:00.000+03:00", "replies_count": 0, "uuid": "e04bafdb86fe5faf694801b5aa961ea719b6cced"}, "author": "Destination DC", "url": "http://www.prnewswire.com/news-releases/destination-dc-to-redesign-website-partners-with-mmgy-global-300151693.html", "ord_in_thread": 0, "title": "Destination DC to Redesign Website, Partners with MMGY Glob", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON , Sept. 30, 2015 /PRNewswire-USNewswire/ -- Today Destination DC, the tourism and marketing office for Washington, DC , announced the selection of MMGY Global as the developer for the relaunch of Washington.org, the official visitor website for the nation's capital. The refreshed website is expected to debut in spring 2016. \"Research tells us the majority of our targeted audience understands that our brand campaign positions Washington, DC as a must-visit destination. They're right. Besides our dazzling monuments, we have neighborhoods rich in history, art, restaurants and nightlife. MMGY Global's approach is also research-driven, and their expertise will help us bring our city to life for leisure and business travelers,\" said Elliott Ferguson , president and CEO of Destination DC. \nWith the new site, desktop and mobile users will have access to 100% of Washington.org— hundreds of pages of plan-a-trip content and vivid imagery. The relaunched Washington.org users will find:\nUp-to-the-minute trip inspiration A calendar of events, from the Smithsonian Institution's soon-to-open National Museum of African American History and Culture to comprehensive Fourth of July and inauguration festivities Meetings and convention tools and announcements Hotels and hotel packages that best suit a visitor's needs Mobile mapping capabilities to find Destination DC member hotels, restaurants, attractions, and more. Recommendations from in-house and local experts for categories including luxury, budget, LGBT, romantic, family, romantic, neighborhood, beer and festival-focused, etc. Conversation across social media channels at all stages of trip planning: aspirational, in-destination or reminiscing and advising. \" Washington DC is one of the world's great destinations. And with the prominent role a digital brand plays in the marketing of a world-class venue, we are excited to concept, develop and launch a world-class website for the tourism community,\" said Clayton Reid , president and CEO of MMGY Global.\nWhen Destination DC last relaunched its official website in winter 2012, it was among the earliest US destinations to adopt responsive design (technology that instinctively adapts content to the dimensions of a particular screen). In 2015, Destination DC expects mobile traffic to be almost 50% of all website traffic, compared to 19% prior to the relaunch in 2012. \nThe 2012 relaunch also occasioned the creation of DCcool.com, a dedicated blog for insider tips, local influencers and dynamic content such as videos, animation and a bit-moji app. The positive reception of the dedicated microsite and years-long DC Cool campaign dovetailed with honorifics including Forbes Magazine's \"Coolest city in America.\" Working with MMGY, Destination DC will wrap DCcool.com into Washington.org, capturing its content and collaborative \"insider\" spirit. \n\"The District welcomed a record number of visitors to the District in 2014. Our website and social channels are also reaching record numbers. We're working with MMGY to capitalize on the understanding that Washington.org is the surest expression of a must-visit capital and our global front door. Logging on will inspire visitation, creating a direct pathway to jobs and tax revenue for the District.\" For more information about Washington, DC , please visit www.Washington.org .\nAbout Destination DC: Destination DC, the lead destination marketing organization for the nation's capital, is a private, non-profit membership organization of more than 850 businesses committed to marketing the area as a premier global convention, tourism and special events destination with a special emphasis on the arts, cultural and historic communities. www.washington.org . \nAbout MMGY Global: MMGY Global is the world's largest and most integrated global marketing firm with more than 35 years of experience in the travel, hospitality and entertainment industries. The award-winning agency maintains a global communications practice in all marketing channels, serving many of the world's premier travel and tourism brands. MMGY Global is author of acclaimed industry research (including the Portrait of American Travelers®) that identifies the habits and preferences of travelers – insights that serve as the foundation for its marketing strategy. For more information, visit www.mmgyglobal.com . \n \n\nSOURCE Destination DC\n\n\nRELATED LINKS\nhttp://www.washington.org", "external_links": [], "published": "2015-09-30T19:41:00.000+03:00", "crawled": "2015-09-30T19:48:13.179+03:00", "highlightTitle": ""}