{"organizations": ["Airbus Americas", "U.S. Patent and Trademark Office", "Airbus"], "uuid": "ad2dffc9eaaa483ee4a769db2fe4a460b5518772", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150929103218-airbus-3-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_travel.rss", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/09/29/travel/airbus-aircraft-coach-sleeping-boxes-feat/index.html?eref=rss_travel", "country": "US", "title": "Are airline 'sleeping boxes' in your future?", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Are airline 'sleeping boxes' in your future?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T22:36:00.000+03:00", "replies_count": 0, "uuid": "ad2dffc9eaaa483ee4a769db2fe4a460b5518772"}, "author": "", "url": "http://edition.cnn.com/2015/09/29/travel/airbus-aircraft-coach-sleeping-boxes-feat/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "Are airline 'sleeping boxes' in your future?", "locations": ["About.com"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Benet J. Wilson", "Mary Anne Greczyn", "Wilson"], "text": "Airbus applies for a patent for \"sleeping boxes\" Proposed coach sleeping pods may never become a reality Airlines would need to make money with them, an expert says (CNN) Tired of trying to sleep while stuffed into your tiny coach seat on a long-haul flight? Coach passengers flying long distances may eventually get to rest in \"sleeping boxes\" proposed last week by Airbus, the European aircraft manufacturer. The sleeping boxes would be stacked in the rear of the aircraft, according to a patent application filed with the U.S. Patent and Trademark Office , first reported by the Daily Mail . Passengers would still receive meals and would still have to buckle up during takeoff and landing. Airline squeeze: It's not you, \"it's the seat\" Airbus declined to comment directly on the patent application. \"Airbus applies for hundreds of patents every year in order to protect intellectual property,\" Airbus Americas spokeswoman Mary Anne Greczyn wrote in an email. \"These patents are often based on R&D concepts and ideas in a very nascent stage of conceptualization, and not every patent progresses to becoming a fully realized technology or product.\" Aviation expert Benet J. Wilson isn't sure the plan will fly. \"You always see aircraft manufacturers studying passenger experience amenities like a sleeping box,\" said Wilson, About.com's air travel expert. \"But getting from concept to reality is a long road and most times never gets past the paper stage. \"And there are these two questions: Will airline passengers actually pay for something like this, and could the airlines make money with it? If Airbus can answer these two questions, then we are much more likely to see it someday.\" Whether the patent proposal ever becomes a reality is anyone's guess, but Airbus did confirm one interesting detail in its application: It admitted that its coach seats \"can be found by the passengers to be uncomfortable, particularly on long-haul flights.\" More from Travel", "external_links": [], "published": "2015-09-29T22:36:00.000+03:00", "crawled": "2015-09-29T23:10:05.684+03:00", "highlightTitle": ""}