{"organizations": [], "uuid": "3fd8dc1eeb08b6c265cd0753593c29eee244fd22", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150914115610-1-hidden-islands-solta-large-169.jpg", "site_section": "http://rss.cnn.com/rss/edition_travel.rss", "section_title": "CNN Travel", "url": "http://edition.cnn.com/2015/09/14/travel/unknown-island-escapes/index.html", "country": "US", "title": "5 awesome island escapes you've likely never considered", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "5 awesome island escapes you've likely never considered - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T18:58:00.000+03:00", "replies_count": 0, "uuid": "3fd8dc1eeb08b6c265cd0753593c29eee244fd22"}, "author": "Sharon McDonnell, for CNN", "url": "http://edition.cnn.com/2015/09/14/travel/unknown-island-escapes/index.html", "ord_in_thread": 0, "title": "5 awesome island escapes you've likely never considered", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(CNN) Sure, the first things that come to mind when you think \"island escape\" are white sands and palm trees.\nMaybe a coconut with a straw in it.\nBut for those willing to look beyond the tropics, there are plenty of worthy island getaways around the world that have yet to appear on the tourism radar.\nIf the thought of amazing nature walks, a relaxed pace and fabulous food and drink sounds appealing, these five destinations are for you.\nSolta (Croatia)\nLittle-known compared to nearby Dalmatian islands like Korcula and Hvar -- which has been enjoying a tourist boom since Beyonce and Jay-Z visited in 2011 -- the Croatian island of Solta has a similar look: orange-tile-roofed stone houses, the crystal-clear turquoise Adriatic Sea and pebble beaches.\nOn this peaceful pine-covered island of 24 bays and 1,400 people, visitors can taste local red wine, olive oil, tapenade and anchovies at the family-run Agroturizam Kastelanac.\nTo feast on grilled fish, seafood risotto and platters of prosciutto head for Konoba Nevera in Stomorska, a tiny fishing village. The studio of painter Vicko Buktenica, a man obsessed by local rural landscapes and donkeys, is also worth a visit.\nSolta's only hotel is the luxury Martinis Marchi, set in a seaside 18th-century castle, but inexpensive B&Bs and apartments are available.\nGetting there: Take a 25-minute catamaran or 45-minute car ferry from Split, Dalmatia's biggest city.\nAgroturizam Kastelanac , Duga gomila 7, Gornje Selo, Solta Island 21432 Croatia;\nkonoba nevera , put firula 17 put firula 17, Split 021 Croatia;\nMartinis Marchi Hotel , Put Sv. Nikole 51, Maslinica, Solta Island 21430 Croatia;\nAzores (Portugal)\nFlores is one of nine volcanic islands that make up Portugal's Azores region. This group of nine islands in the Atlantic Ocean, 1,287 kilometers (800 miles) west of mainland Portugal, features volcanoes, blue hydrangeas, steep seaside cliffs and more shades of blue and green than a paint shop's color palette.\nTurquoise-blue and emerald-green crater lakes lie side-by-side on Sao Miguel island at Lagoa das Sete Cidades.\nPico island is where Portugal's highest mountain can be found. At 7,700 feet tall (2,346 meters), Mount Pico is often shrouded in clouds.\nIn Faial, Horta's marina is adorned with art created by sailors from all over the world.\nFlores is filled with colorful flowers -- hence its name -- mountains, crater lakes and waterfalls.\nGetting there: Take a four-hour flight from Boston, Massachusetts on Azores Express, or a two-hour flight from Lisbon, to Ponta Delgada on Sao Miguel island. Inter-island flights and ferries are available.\nLummi Island (Washington state)\nOn this quiet, evergreen-covered island, 2015 James Beard Best Chef Northwest award-winner Blaine Wetzel of The Willows Inn presides over a parade of exquisite bites, all fished, farmed and foraged on the island of Lummi .\nPraised as one of 10 restaurants worldwide \"worth a plane ride\" by New York Times in 2011, his restaurant is in Lummi's only hotel.\nEven cocktails are island-sourced: A top choice is the Spotted Owl, made from Douglas fir nettles, gin and citrus.\nThere's a thriving artist community -- open studio tours showcase more than 40 artists and craftsmen three times a year.\nEnergy healing sessions can be found at Tree Frog Farm , which makes flower essences and aromatherapy products.\nGetting there: Take a 5-minute ride on the Whatcom Chief car ferry, which leaves hourly from Gooseberry Point, near Bellingham, a city 48 kilometers (30 miles) south of Vancouver and 145 kilometers (90 miles) north of Seattle.\nWillows Inn , 2579 West Shore Drive, Lummi Island, WA 98262;\nSark (Channel Islands, UK)\nDubbed the world's first \"dark-sky island\" by the International Dark Sky Association , the most rural of the five Channel Islands offers a terrific view of the Milky Way given it has no street lights or automobiles.\nCars, buses and motorcycles are banned on this island of about 600 people about 128 kilometers (80 miles) south of England, meaning visitors get to experience both pure air and quiet.\nHorse-drawn carriages, bicycles and farm tractors add to the enchanting time warp.\nSark scenery includes wildflower-filled meadows, a dramatic craggy coastline and the narrow natural causeway connecting Sark to Little Sark.\nSark has only two hotels: La Sablonnerie, with an acclaimed restaurant serving local lobster and fish and its own farm, and Stocks Hotel, a former 16th-century farm in a wooded valley. There are a few B&Bs as well.\nGetting there: One-hour ferries depart from Guernsey (a Channel Island) several times a day during peak season, daily in winter. Flights from the UK to Guernsey are serviced by Aurigny Air, Blue Islands and FlyBe.\nFerries from Normandy also run several times weekly in peak season.\nLa Sablonnerie , La Sablonnerie Hotel, GY9 0SD;\nStocks Hotel , Stocks Lane, GY10 1SD;\nSpitsbergen (Norway)\nNorway's Spitsbergen island sits about 1,000 kilometers south of the North Pole. Dramatic views of snow-covered mountains, fjords, cobalt-blue seas and electric-blue ice await in the Svalbard archipelago, the northernmost settled land in the world.\nAbout midway between north Norway and the North Pole in the Arctic Ocean, Spitsbergen is the only inhabited island. Its biggest town, Longyearbyen, has about 2,000 people.\nWildflowers blossom in summer thanks to surprisingly warm temperatures (9 degrees Celsius), while the midnight sun offers continuous daylight from mid-April to late August.\nVisitors can watch for the Northern Lights during mid-November to February, when darkness reigns.\nDog sledging in a wagon pulled by huskies, hiking and sea kayaking are popular summer activities. In winter, visitors can snowmobile, ski, dog sled and take glacier treks.\nThe atmospheric Basecamp Hotel in Longyearbyer has rooms furnished like a trapper's cabin, complete with sealskins, driftwood and slate. Its glass-roofed bar offers mountain views.\nGetting there: Take a three-hour flight from Oslo to Longyearbyen on SAS or Norwegian, or a one-hour 40-minute flight from Tromso on SAS.\nBasecamp Hotel , Main street of Svalbard Boks 316, Longyearbyen 9171 Norway;", "external_links": ["http://www.tripadvisor.com/Hotel_Review-g503715-d1723495-Reviews-m14631-Basecamp_Hotel-Longyearbyen_Spitsbergen_Svalbard.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914121435-3-hidden-islands-flores-azores-small-11.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914133023-10-hidden-islands-norway-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914121435-3-hidden-islands-flores-azores-super-169.jpg", "http://www.tripadvisor.com/Attraction_Review-g664421-d6636522-Reviews-m14631-Agroturizam_Kastelanac-Solta_Island_Split_Dalmatia_County_Dalmatia.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914133023-10-hidden-islands-norway-super-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914133023-10-hidden-islands-norway-exlarge-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914121435-3-hidden-islands-flores-azores-small-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914133023-10-hidden-islands-norway-full-169.jpg", "http://www.tripadvisor.com/Hotel_Review-g186231-d193253-Reviews-m14631-Stocks_Hotel-Sark_Channel_Islands.html", "http://www.tripadvisor.com/Restaurant_Review-g295370-d1966020-Reviews-m14631-Konoba_nevera-Split_Split_Dalmatia_County_Dalmatia.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914121435-3-hidden-islands-flores-azores-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914121435-3-hidden-islands-flores-azores-exlarge-169.jpg", "http://www.tripadvisor.com/Hotel_Review-g58574-d83145-Reviews-m14631-Willows_Inn-Lummi_Island_San_Juan_Islands_Washington.html", "http://www.treefrogfarm.com/", "http://www.tripadvisor.com/Hotel_Review-g1959802-d1951598-Reviews-m14631-Martinis_Marchi_Hotel-Maslinica_Solta_Island_Split_Dalmatia_County_Dalmatia.html", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914133023-10-hidden-islands-norway-small-11.jpg", "http://darksky.org/", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914121435-3-hidden-islands-flores-azores-medium-plus-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914133023-10-hidden-islands-norway-large-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914121435-3-hidden-islands-flores-azores-full-169.jpg", "http://i2.cdn.turner.com/cnnnext/dam/assets/150914133023-10-hidden-islands-norway-medium-plus-169.jpg", "http://www.tripadvisor.com/Hotel_Review-g186231-d199071-Reviews-m14631-La_Sablonnerie-Sark_Channel_Islands.html"], "published": "2015-09-14T18:58:00.000+03:00", "crawled": "2015-09-15T06:33:37.905+03:00", "highlightTitle": ""}