{"organizations": [], "uuid": "e0c10b854fed0ff8b6305de9a33e4a5e76890f32", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2015/09/02/Production/Sunday/Travel/Images/Hkg10199951.jpg", "site_section": "http://www.washingtonpost.com/lifestyle/travel", "section_title": "Travel - The Washington Post", "url": "http://www.washingtonpost.com/lifestyle/travel/the-weeks-best-travel-deals-from-around-the-globe/2015/09/03/3a4c08a6-4da5-11e5-902f-39e9219e574b_story.html", "country": "US", "title": "The week’s best travel deals from around the globe", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "The week’s best travel deals from around the globe - The Washington Post", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "e0c10b854fed0ff8b6305de9a33e4a5e76890f32"}, "author": "Andrea Sachs", "url": "http://www.washingtonpost.com/lifestyle/travel/the-weeks-best-travel-deals-from-around-the-globe/2015/09/03/3a4c08a6-4da5-11e5-902f-39e9219e574b_story.html", "ord_in_thread": 0, "title": "The week’s best travel deals from around the globe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A dive instructor, left, and a tourist diving on Australia's Great Barrier Reef. (William West/AFP/Getty Images) By Andrea Sachs and Carol Sottili September 3 Follow @carolsottili This week’s best travel bargains around the globe.\nLand With Down Under Answers, save more than 20 percent on an activities-filled package on Hamilton Island , near Australia’s Great Barrier Reef . The Relax on Reef package starts at $999 per person double and includes five nights at the Reef View Hotel Hamilton Island; round-trip airport transfers; daily buffet breakfasts; use of catamarans, paddle skis, windsurfers, tennis courts, etc.; a full-day trip to the Great Barrier Reef; a half-day trip to Whitehaven Beach; entry to Wild Life Hamilton Island; a round of 18-hole golf on Dent Island, including transfers and a cart; and taxes. Travel through Dec. 10, and Jan. 7-March 31. Info: 800-889-1464, www.duatravel.com/vacations/vacation/hamilton-island-reef-relax.\nAndrea Sachs (not the one who wears Prada) has been writing for Travel since 2000. She travels near (Ellicott City, Jersey Shore) and far (Burma, Namibia, Russia), and finds adventure no matter the mileage. She is all packed for the Moon or North Korea, whichever opens first. View Archive Save nearly $150 with a package at the newly renovated InterContinental Los Angeles Century City. The Shop.Spa.Sip deal starts at $329 a night single or double, plus about 16 percent tax, and includes an upgrade to a deluxe terrace room; one reflexology treatment at the spa ($55 value); breakfast for two at Park Grill (up to $60); two cocktails at the Lobby Lounge (up to $30); and a 15 percent discount at Bloomingdale’s, with free transportation in the Mercedes or Tesla S house car. Valid through Dec. 31. Info: 310-712-6936, www.intercontinentallosangeles.com.\nMagdalena Grand Beach & Golf Resort, on the Caribbean island of Tobago , is offering 45 percent savings for stays in September and 35 percent discounts for travel Oct. 1-Dec. 18. Rate with breakfast starts at $159 per night (plus $34 taxes) in September and $191 (plus $41 taxes) during the later travel period. Rooms typically start at $294, plus $59 taxes. Info: 866-353-6222, www.magdalenagrand.com .\nSea Cunard is offering savings on more than 60 cruises across the globe. For example, a seven-night transatlantic cruise aboard the Queen Mary 2 sailing from Southampton, England, to New York on Nov. 5 now starts at $699 per person double (plus $98 port charges), a savings of $799 . Book by Sept. 30 and request promo code R3A-R3Q. Info: 800-728-6273, www.cunard.com .\nAir Alaska Airlines has a sale on nonstop flights from BWI to Los Angeles. Flights start at $266 round trip on select dates in September and October; fare on other airlines starts at $306. Purchase by Sept. 7 at www.alaskaair.com .\nLOT Polish Airlines has discounted flights from New York’s JFK airport to destinations in Europe, such as Poland, Russia, Romania, Italy and Lithuania . For example, round-trip fare to Warsaw starts at $750, including taxes; air to Moscow is from $401 — more than $100 less than fares on other airlines. Book by Sept. 13; travel Dec. 1-June 30. Holiday blackout dates apply.\nInfo: www.lot.com/us/en .\nPackage Ritz Tours is offering an eight-night China Charm package starting at $1,900 per person double. The tour includes round-trip air from Washington Dulles to Beijing; round-trip air from Beijing to Shanghai; three nights at Hotel New Otani Chang Fu Gong in Beijing; two nights at Zhejiang Narada Grand Hotel in Hangzhou; one night at Crowne Plaza Wuxi Taihu; two nights at InterContinental Shanghai Puxi; 17 meals; motorcoach transport; tour guide; sightseeing tours with admission fees; and most taxes. Priced separately, hotels and airfare alone would cost about $2,200. Cheapest rate applies to the Dec. 9 departure. Info: 888-345-7489, www.ritztours.com .\n— Andrea Sachs and Carol Sottili\nSubmit travel deals to whatsthedeal@washpost.com . Prices were verified at press time Thursday, but deals sell out and availability is not guaranteed. Some restrictions may apply.", "external_links": ["http://www.lot.com/us/en/", "https://twitter.com/@carolsottili", "http://www.duatravel.com/vacations/vacation/hamilton-island-reef-relax", "http://www.lot.com/us/en/?gclid=Cj0KEQjwvJqvBRCL77m2-uKczsIBEiQAkx8VjD-UP38iVwxT8tJfVd-K5ddIcpFmuhd7gy9ZeyFJR2gaAjAD8P8HAQ", "http://www.intercontinentallosangeles.com/", "http://www.ritztours.com/"], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-10T19:27:36.879+03:00", "highlightTitle": ""}