{"organizations": [], "uuid": "370c1ec84cb2b4231ea651109419bea7a673f360", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64317/complete-sustainable-world-lefay-resort-and-spa", "country": "US", "title": "A complete sustainable world: Lefay Resort and SPA", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "A complete sustainable world: Lefay Resort and SPA", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:38:00.000+03:00", "replies_count": 0, "uuid": "370c1ec84cb2b4231ea651109419bea7a673f360"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64317/complete-sustainable-world-lefay-resort-and-spa", "ord_in_thread": 0, "title": "A complete sustainable world: Lefay Resort and SPA", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A complete sustainable world: Lefay Resort and SPA   30, 2015 eTN   \nLOS ANGELES, California - Lefay Resort & SPA Lago di Garda is located in Gargnano in Italy, inside an 11 hectares natural park in the heart of the spectacular and renowned Riviera dei Limoni. Gentle hills and natural terraces, rich in olive trees and woods, surround the resort which overlooks a mesmerizing lake. Here guests can rejuvenate body, soul and spirit in luxurious surroundings where concepts of space, nature, time for oneself and discrete service is redefined. \nGreen Globe congratulates Lefay Resort & SPA Lago di Garda on its recent recertification for the fifth year and on its magnificent compliance score of 89% against accredited criteria. \nLiliana Leali, Lefay Resort & SPA’s President said: “2015 has been a crucial year for Lefay Resort’s commitment to sustainability practices. These objectives are evident in the publication of its first Sustainability Report, certified according to Global Reporting Initiative’s guidelines, in which the company collected information on all its activities and obligations in the field of social and environmental sustainability. And the Green Globe certification is an accomplishment that acknowledges the successful completion of the efforts and duties undertaken with much dedication by Lefay. An achievement that works as a further incentive for us to continue distinguishing ourselves, consistent with the hospitality overview of building a completely sustainable world.” \nThe resort has a comprehensive sustainability management plan in place that focuses on the reduction of energy and water usage. A state-of-the-art system of thermic and electrical energy production has been established on site. A biomass system generating up to 70% of thermal requirements is fueled by wood chips. This plant considerably reduces carbon dioxide emissions and optimizes the use of local wood, thereby reducing the environmental impact to a minimum. In addition, a micro-turbine cogeneration plant fed by natural gas can produce up to 60% of electrical and 20% of thermal energy needs. An absorption cooling plant cools by using the exchange heat of the micro-turbines and biomass boiler. In 2014, Lefay Resorts reduced its thermal and energy consumption by 12% (Thermal 8% and Electrical 4%). \nAt the property, photovoltaic panels and extremely advanced software help to reduce the amount of artificial lighting when sufficient natural light is available, and also during the night. In 2014, the level of electrical and thermal energy produced by the cogeneration system and photovoltaic system increased as compared to the previous year, from 28.5% to 30%compared to the overall needs of the resort. \nAll energy and water consumption is monitored monthly. And low flow water taps and a linen reuse program have contributed to a decrease in water usage by 5% (m³ per guest night). \nLefay Resort prefers local suppliers to reduce the impact of carbon emissions and to encourage regional economic development. The property has expanded its use of organic fruit and vegetable produce in its Italian cuisine and has also sourced a new supplier of cheeses. Furthermore, in line with its environmental responsibilities a Green Book is placed in every guest room promoting the sustainability efforts at the resort. And there are plans to include information regarding local flora and fauna to protect local biodiversity in the future. \nTo reduce paper consumption, the property has upgraded all televisions in guest rooms to disseminate information about SPA facilities and resort services electronically. In addition, Lefay Resorts has increased its utilization of digital media to include Facebook, Twitter, Instagram and Pinterest. And an online version of Lefay Club Magazine has been launched thereby avoiding the printing of over 10,000 copies. \nFor more information, click here . \nAbout Green Globe Certification \nGreen Globe is the worldwide sustainability system based on internationally accepted criteria for sustainable operation and management of travel and tourism businesses. Operating under a worldwide license, Green Globe is based in California, USA and is represented in over 83 countries. Green Globe is an Affiliate Member of the United Nations World Tourism Organization (UNWTO).", "external_links": [], "published": "2015-09-30T03:38:00.000+03:00", "crawled": "2015-09-30T12:50:58.750+03:00", "highlightTitle": ""}