{"organizations": [], "uuid": "71f17317837ba1cd60411eca4ebaf5321c6be729", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.latimes.com", "main_image": "http://www.trbimg.com/img-55d612a4/turbine/la-trb-theme-park-newsletter-html-20150820", "site_section": "http://www.latimes.com/travel/rss2.0.xml", "section_title": "TRAVEL  - Los Angeles Times", "url": "http://www.latimes.com/la-trb-theme-park-newsletter-html-20150820-htmlstory.html", "country": "US", "title": "In the Loop: Was Walt Disney a hero or a villain?", "performance_score": 0, "site": "latimes.com", "participants_count": 1, "title_full": "In the Loop: Was Walt Disney a hero or a villain?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-17T20:00:00.000+03:00", "replies_count": 0, "uuid": "71f17317837ba1cd60411eca4ebaf5321c6be729"}, "author": "Brady MacDonald", "url": "http://www.latimes.com/la-trb-theme-park-newsletter-html-20150820-htmlstory.html", "ord_in_thread": 0, "title": "In the Loop: Was Walt Disney a hero or a villain?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Pandora Media, Inc. \nWelcome to another edition of In the Loop , the L.A. Times' theme park newsletter. I'm Funland theme park blogger Brady MacDonald , and this week we get all the details on the Star Wars Lands announced at the D23 Expo, check out a new Howl-O-Scream haunted maze and hang out with Tiny Hamster at Disney World. Subscribe to the newsletter D23 Expo \nDisney unveils plans for Star Wars Lands at Disneyland and Disney’s Hollywood Studios during the the D23 Expo in Anaheim, including new attractions, overlays for popular existing rides and a new seasonal festival celebrating the “galaxy far, far away.” I take a look at what wasn’t said during the announcement with eight unanswered questions about Star Wars Land. (Getty Images) \nAs if that wasn’t enough news, Disney also unveils plans for a new Toy Story Land at Disney’s Hollywood Studios in Florida. (Disney) \nAlso at the event, Disney pulls back the curtain on Pandora: The World of Avatar coming in 2017 to Disney’s Animal Kingdom in Florida with a heavily detailed model of the fictional world. \nTodd Martens , who writes about video games and interactive entertainment for The Times, takes a journey at D23 on virtual reality versions of two retired Disneyland attractions , Adventure Thru Inner Space and House of the Future. And best of all, the VR re-creations weren’t made by Walt Disney Imagineering but rather an obsessive Disney fan. (Allen J. Schaben / Los Angeles Times) \nWith the addition of attractions based on “Star Wars,”“Toy Story” and “Avatar,” Martens asks: Are Disney parks losing their essential Walt-ness ? \nWant to be a Disney Imagineer? Retired head of Imagineering Marty Sklar offers some tips and secrets at D23. \nAnd check out our full coverage page for complete details of the event. Howl-O-Scream \nA new haunted maze from the creators of “The Blair Witch Project” features a paranormal tale set in the woods with an online campaign designed to build buzz for the multimedia project. The Unearthed maze at a trio of Howl-O-Scream events this Halloween poses an unusual question: Who buries a house? (SeaWorld) Going gaga for giga \nThe New York Times test-drives four towering 300-foot-plus giga coasters and asks the question: Just how tall can roller coasters get? Singing the blues \nThe House of Blues Anaheim plans to relocate from the Downtown Disney retail center to the nearby GardenWalk mall according to the Orange County Register. The move will allow the concert hall, bar and restaurant to nearly double in size when it takes over a 40,000-square-foot space currently occupied by UltraLuxe Cinemas. Tiny Hamster \nInternet sensation Tiny Hamster drops by Disney World for a miniature turkey leg, churro and Dole Whip as well as a rides on scaled-down versions of Mad Tea Party and Haunted Mansion. It’s too adorable to miss. A second video goes over how Disney made the minuscule rides and food. Sad news \nThe Washington Post reports that a 45-year-old fifth-grade teacher retrieving his lost cellphone and wallet from a restricted area of Ohio's Cedar Point amusement park was killed when he was struck by the 57-mph Raptor inverted coaster. James Young had just landed his \"dream job\" as a high school guidance counselor, his mother said. Cost of fun \nWhich costs more: A vacation to Disneyland or a family trip to Disney World? Check out this infographic that analyzes the data and picks the cost-savings winner. (Disney) Subscribe to the newsletter \nStill need more theme park news? Check out the Los Angeles Times Funland theme park blog on Twitter , Facebook , Google+ and Instagram . Also feel free to email me with any feedback on the newsletter.", "external_links": [], "published": "2015-09-17T20:00:00.000+03:00", "crawled": "2015-09-20T21:51:15.439+03:00", "highlightTitle": ""}