{"organizations": [], "uuid": "251d9d43e7c11004d1dbb970d1a2fd95043df766", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30062397/40-chances-finding-hope-in-a-hungry-world-the-photography-of-howard-g-buffett-opens-at-the-newseum-today", "country": "US", "title": "'40 Chances: Finding Hope in a Hungry World -- The Photography of Howard G. Buffett' Opens at the Newseum Today", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "'40 Chances: Finding Hope in a Hungry World -- The Photography of Howard G. Buffett' Opens at the Newseum Today - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "251d9d43e7c11004d1dbb970d1a2fd95043df766"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30062397/40-chances-finding-hope-in-a-hungry-world-the-photography-of-howard-g-buffett-opens-at-the-newseum-today", "ord_in_thread": 0, "title": "'40 Chances: Finding Hope in a Hungry World -- The Photography of Howard G. Buffett' Opens at the Newseum Today", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Newseum\nAward-Winning Journalist Ann Curry Will Moderate 'Inside Media' Photojournalism Program on Sept. 19\nWASHINGTON , Sept. 18, 2015 /PRNewswire-USNewswire/ -- Today, the Newseum unveiled its new exhibit \"40 Chances: Finding Hope in a Hungry World - The Photography of Howard G. Buffett ,\" featuring 40 of Buffett's photos documenting the world hunger crisis as part of a global awareness campaign. On Saturday, Sept. 19 , Emmy Award-winning journalist Ann Curry will moderate an Inside Media program featuring four photographers and video journalists who will discuss how their work helps sharpen the focus on critical global issues.\nTraveling to more than 135 countries, Buffett turned his camera lens on the powerful forces that fuel hunger and poverty. A philanthropist and farmer, Buffett believes that each of us has about 40 chances to accomplish our life goals, just as farmers have about 40 growing seasons to improve their harvests. His work is a call to action to find lasting solutions to these global challenges.\n\"Buffett's photographs illuminate the stark truth that hunger and malnutrition are the biggest threats to health and education in the world,\" said Cathy Trost , senior vice president of exhibits and programs at the Newseum. \"Photojournalism has the power to make a difference in the world by compelling us not only to look, but to act.\"\nTo celebrate the opening of the exhibit, the Newseum will host a special evening program on Monday, Oct. 5 , featuring Buffett, former British Prime Minister Tony Blair and conservationist Emmanuel de Merode. The invitation-only program will be moderated by Judy Woodruff , co-anchor and managing editor of PBS NewsHour.\n\"Photojournalism plays a crucial role in capturing the world around us and sharing that information with others,\" said Buffett. \"As the world's premier institution for exhibiting photojournalism, the Newseum is the perfect place to share these photographs with a wider audience.\"\nThe photographs in \"40 Chances\" illustrate the causes and effects of hunger on five continents and reflect Buffett's belief that hunger is intertwined with poverty, fear, war and conflict, and lack of opportunity for women. The exhibit also includes an original Newseum film featuring Buffett and his work, as well as an interactive kiosk highlighting organizations that are working to combat hunger.\nThe exhibit also highlights images by Heidi Levine , winner of the International Women's Media Foundation's first Anja Niedringhaus Courage in Photojournalism Award, dedicated to the Associated Press photographer who was killed in Afghanistan in 2014 after a career covering global issues. Levine, a freelance photojournalist, has spent her career covering conflict in the Middle East . The Howard G. Buffett Foundation works with the International Women's Media Foundation to support the work of journalists reporting on hunger, poverty and violence around the globe.\n\"40 Chances\" is presented in partnership with the Howard G. Buffett Foundation and the International Women's Media Foundation. The exhibit will be on display through Jan. 3, 2016 .\nAbout the Newseum\nThe mission of the Newseum is to champion the five freedoms of the First Amendment through exhibits, public programs and education. One of the top attractions in Washington, D.C. , the dynamic, engaging and interactive museum allows visitors to experience the stories of yesterday and today through the eyes of the media while celebrating the freedoms guaranteed to all Americans by the First Amendment. The Newseum Institute serves as a forum for First Amendment study, exploration and education. The Newseum is a 501(c)(3) public charity funded by generous individuals, corporations and foundations, including the Freedom Forum. The Freedom Forum, an independent, nonpartisan, nonprofit foundation, conceived and built the Newseum, which first opened in Arlington, Va., in 1997. Over the past 20 years, the Freedom Forum has contributed more than $250 million to the Newseum, the largest philanthropic gift ever made to support First Amendment freedoms. For more information, visit newseum.org or follow us on Facebook and Twitter .\nPhoto - http://photos.prnewswire.com/prnh/20150917/267761\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/40-chances-finding-hope-in-a-hungry-world--the-photography-of-howard-g-buffett-opens-at-the-newseum-today-300145244.html\n ", "external_links": ["http://www.newseuminstitute.org/", "http://www.xmlnews.org/ns/", "http://www.newseum.org/", "https://photos.prnewswire.com/prnvar/20150917/267761", "https://twitter.com/Newseum", "http://www.newseum.org/event/inside-media-photojournalists-on-covering-global-crisis/?instance_id=12944", "http://www.newseum.org/event/40-chances-finding-hope-in-a-hungry-world/?instance_id=12956", "http://www.prnewswire.com/news-releases/40-chances-finding-hope-in-a-hungry-world--the-photography-of-howard-g-buffett-opens-at-the-newseum-today-300145244.html", "http://photos.prnewswire.com/prnh/20150917/267761", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC05456&Transmission_Id=201509180830PR_NEWS_USPR_____DC05456&DateId=20150918", "http://www.thehowardgbuffettfoundation.org/", "https://www.facebook.com/Newseum"], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T19:43:35.682+03:00", "highlightTitle": ""}