{"organizations": ["United Airlines"], "uuid": "41ee1376f8a40690c4a01722352861214c8977ad", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "businesstravel.about.com", "main_image": "http://f.tqn.com/y/businesstravel/1/S/_/5/-/-/154556043.jpg", "site_section": "http://z.about.com/6/o/m/businesstravel_t2.xml", "section_title": "About.com Business Travel: What's Hot Now", "url": "http://businesstravel.about.com/od/airlines/gr/United_Mileage_Plus.htm", "country": "US", "title": "Pros and Cons of the United Airlines Mileage...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Pros and Cons of the United Airlines Mileage...", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T14:02:00.000+03:00", "replies_count": 0, "uuid": "41ee1376f8a40690c4a01722352861214c8977ad"}, "author": "", "url": "http://businesstravel.about.com/od/airlines/gr/United_Mileage_Plus.htm", "ord_in_thread": 0, "title": "Pros and Cons of the United Airlines Mileage...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Miles not posted/credited in a timely manner \nDescription Rewards, loyalty, and travel incentive program Earn miles on your business travel and gain elite status and upgrades Turn business travel into free travel \nGuide Review - United Airlines Mileage Plus \nSigning Up: \nSigning up for United Mileage Saver is easy: from the United Airlines website, fill in your personal information and create a user name and password. United Mileage Plus will send you a welcome email explaining the program in detail. \nEarning Points: \nTravel on United, United Express, or any of the 24 airline partners (including Star Alliance members) will earn you points. Miles earned with Star Alliance partners may vary in how they are accrued. Partner airlines will also accept your Mileage Plus frequent flyer number . \nUnited Mileages Plus miles can be earned through a number of credit card partners. The main credit card partner is Chase, which offers Visa and MasterCard. Varying with special promotions, each dollar spent with a credit card partner will generally earn one United Mileage Plus mile. \nRedeeming Points: \nCashing in your miles for flights is easy. From the \"Redeem Miles\" tab on the website, plug in your travel dates and hit \"Search!\" Most domestic trips will set you back 25,000 miles, round trip. The best news is this process will only cost you $5 plus any airport fees and taxes. These low redemption fees are new as of July 2009, and even apply to last-minute reward tickets (not something you'll always find with other airlines). User Reviews Reviews for this section have been closed. cjc_sd User Rating: Customer service approach to a question -POOR \nCalled customer support when I couldn't get info on-line regarding how to upgrade to first class (with reward miles) two legs of a six leg round trip. The first person, after me ultimately calling him out about lying to me, put me on hold - but actually threw me back into the queue. The second told me that I would have to use miles plus significant $$ to upgrade all six legs.... even though two of those legs were single class, and it wasn't even possible to upgrade. Really?? United - that's the best you can do?", "external_links": [], "published": "2015-09-18T14:02:00.000+03:00", "crawled": "2015-09-19T03:18:37.598+03:00", "highlightTitle": ""}