{"organizations": [], "uuid": "af09dbb6105fc9ce932c5ab989e55fe97e32abec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64193/park-hotel-amsterdam-green-globe-way-life", "country": "US", "title": "Park Hotel Amsterdam - a Green Globe way of life", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Park Hotel Amsterdam - a Green Globe way of life", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T00:13:00.000+03:00", "replies_count": 0, "uuid": "af09dbb6105fc9ce932c5ab989e55fe97e32abec"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/64193/park-hotel-amsterdam-green-globe-way-life", "ord_in_thread": 0, "title": "Park Hotel Amsterdam - a Green Globe way of life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Park Hotel Amsterdam - a Green Globe way of life   \nSep 25, 2015   \nLOS ANGELES, California - The award-winning Park Hotel Amsterdam in The Netherlands is a quietly sophisticated hotel offering understated elegance and unparalleled service in an intimate, home-away-from–home atmosphere. Located in the city center of Amsterdam, nestled in the middle of the stunning Fashion & Museum district is the newest, fashionable urban boutique hotel styled in contemporary luxury. \nGreen Globe congratulates the Park Hotel Amsterdam on its recent recertification for the second year in a row and on its commitment to sustainable management and operations. \nAs a sustainable business the property considers the impact of its activities on the planet and also aims to positively influence all people that are involved within and outside the company. \nGreen Globe Partner and auditor Sarah Jenny, Director Duurzame Hotels Netherlands said, “By conducting interviews with the employees of the Park Hotel Amsterdam, I could conclude that Green Globe is not perceived as a set of criteria to follow, but really it has become a “way of life”. Not only at work but also at home, everyone is enjoying thinking and acting green.” \nThe hotel has twelve Green Globe Ambassadors that are members of its Green Team. In addition to instigating the Green Globe criteria, they are also looking for improvement within the hotel and try to motivate their colleagues to do the same. Their responsibility is to collect new ideas, which are then discussed with the management and if possible implemented. \n”As a proud member of Green Globe, Park Hotel Amsterdam is always on the lookout for better and more ways to be part of a conscious society on a local and international scale. Being aware of our role as a prominent hotel in the center of Amsterdam, our employees actively participate by making efforts in sustainability. The commitment of our hotel in creating awareness, is ideally reflected in the way both locals and our hotel guests treat the city,” said Scott van Schaick, the Vice President of the Green Globe Ambassadors group and also the Guest Service Manager at the hotel. \nThe Park Hotel Amsterdam has developed a comprehensive Sustainability Management Plan that targets the reduction of energy and water consumption and waste volume. With the guidance of Green Globe criteria the hotel monitors energy (gas and electricity) and water usage on a monthly basis. To reduce energy usage a building management system controls heating and cooling in the hotel and energy efficient lighting and equipment are utilized. In addition, low flow reducers are fitted in hotel rooms and public facilities in showers, baths, toilets and faucets. \nThe Park Hotel Amsterdam has a recycling program in place. Furthermore, the hotel actively co-operates with local suppliers to reduce waste output and carbon emissions through initiatives such as reusing or returning delivery containers and using bulk packaging. Finally, as part of the hotel’s environmental responsibility practices, staff members are encouraged to focus on eco-gestures such as sorting waste, reporting leaking faucets and by using public transportation. \nFor more information, click here . \nAbout Green Globe Certification \nGreen Globe is the worldwide sustainability system based on internationally accepted criteria for sustainable operation and management of travel and tourism businesses. Operating under a worldwide license, Green Globe is based in California, USA and is represented in over 83 countries. Green Globe is an Affiliate Member of the United Nations World Tourism Organization (UNWTO).", "external_links": [], "published": "2015-09-26T00:13:00.000+03:00", "crawled": "2015-09-26T08:53:23.541+03:00", "highlightTitle": ""}