{"organizations": [], "uuid": "92d4982099257a7a0df2ffe8dc9ea3cdcb1ac204", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonglobe.com", "main_image": "http://c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg-small-square.jpg", "site_section": "http://www.bostonglobe.com/lifestyle/travel", "section_title": "Travel - The Boston Globe", "url": "http://www.bostonglobe.com/lifestyle/travel/2015/09/05/you-don-have-guy-appreciate-detroit-masculine-appeal/m0r7nZJg9s5kvqHSkEnCmJ/story.html", "country": "US", "title": "You don’t have to be a guy to appreciate Detroit’s masculine appeal", "performance_score": 0, "site": "bostonglobe.com", "participants_count": 1, "title_full": "You don’t have to be a guy to appreciate Detroit’s masculine appeal - The Boston Globe", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "92d4982099257a7a0df2ffe8dc9ea3cdcb1ac204"}, "author": "Linda Clarke", "url": "http://www.bostonglobe.com/lifestyle/travel/2015/09/05/you-don-have-guy-appreciate-detroit-masculine-appeal/m0r7nZJg9s5kvqHSkEnCmJ/story.html", "ord_in_thread": 0, "title": "You don’t have to be a guy to appreciate Detroit’s masculine appeal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nBy Linda Clarke Globe Correspondent September 05, 2015\nThe Spirit of Detroit is masculine — at least the bronze statue with that name, created by Marshall Fredericks in 1858 and located on Woodward Avenue, is male — and many would agree Detroit is kind of a guy’s kind of town. Take one of the city’s main attractions, The Henry Ford Museum. It’s filled with engines (there’s a rumor guys are into engines). You’ll find one in a DC-3, in a vintage truck, in the 1961 Lincoln limousine in which JFK was assassinated, and in a royal purple 1949 Mercury, glistening like it just came off the assembly line.\nThe Henry Ford’s new photographic and ephemera collection, “Roadside America: Through the Lens of John Margolies” (through Jan. 24), tracks quirky Americana, created to catch the eye of the automobile driver at a time when Americans used to cruise, not psychotically dash from A to B.\nContinue reading below\nEvery 20 minutes, a shuttle bus leaves The Henry Ford for the Ford Rouge Factory Tour. Built in 1915, this registered National Historic Landmark produces F-150 trucks. Last year, the plant shut down in order to install a new assembly line to make the latest incarnation of the F-150, a vehicle that’s been in production here since 1948.\nThe Ford Rouge Factory Tour doesn’t gloss over the fact that the area is a massive brown site, polluted by decades of ignorant manufacturing and lax city oversight. Of course, it also points out reparations: Besides ongoing land cleanup, it boasts one of the world’s largest green roofs. Let’s just say, kayaking on the River Rouge is now possible without a Hazmat suit.\nAnother man who put Detroit on the map — the music map, that is — was Berry Gordy, who founded Tamla Records in 1959, and added several more labels, including the iconic Tamla Motown and Motown Records. What Ford did for car manufacturing, Berry did for pop music, streamlining production, but this time in an impossibly small house Gordy converted into Hitsville USA.\nContinue reading it below\nView Story Creativity powering Detroit's comeback There are problems in Detroit, but the clouds are slowly parting after the city powered through bankruptcy.\nThis is the home of the boy band: The roots of harmonizing, dancing pop bands like New Kids on the Block are in Motown’s famed Jackson Five, and before that, in guy groups like the Four Tops. The Motown studio tour gives entrée into the studio where Little Stevie Wonder got his start, Diana Ross was groomed in Motown’s in-house charm school, and Smokey Robinson oversaw some of the greatest soul records of all time. The tour ends with a singalong to Robinson’s “My Girl” in the very studio where the Temptations recorded it.\nDowntown Detroit hasn’t yet become a mass of generic glass towers, and much of the city’s wonderful early 20th century architecture remains, and remains in everyday use: The Westin Book Cadillac, Aloft Detroit at The David Whitney, and DoubleTree Suites by Hilton Detroit Downtown-Fort Shelby hotels are all located in historic buildings. The Fort Shelby hotel originally opened in 1917 and a 22-story tower was added in 1927, designed by famed Detroit architect Albert Kahn, who also designed some of the Rouge plant buildings. Like those, the Fort Shelby is also included on the National Register of Historic Places, along with some 60 other Kahn buildings, many in Detroit. No wonder Kahn, who died in his beloved city in 1948, is called the man who built Detroit.\nLinda Clarke can be reached at soundz@me.com .", "external_links": ["http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Flifestyle%2Ftravel%2F2015%2F09%2F05%2Fyou-don-have-guy-appreciate-detroit-masculine-appeal%2Fm0r7nZJg9s5kvqHSkEnCmJ%2Fstory.html%3Fevent%3Devent25%3Fevent%3Devent25&tHow", "http://twitter.com/intent/tweet?text=How", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Fwww.bostonglobe.com%2Flifestyle%2Ftravel%2F2015%2F09%2F05%2Fyou-don-have-guy-appreciate-detroit-masculine-appeal%2Fm0r7nZJg9s5kvqHSkEnCmJ%2Fstory.html%3Fevent%3Devent25&title=How", "https://www.pinterest.com/pin/create/button/?url=http%3A%2F%2Fwww.bostonglobe.com%2Flifestyle%2Ftravel%2F2015%2F09%2F05%2Fyou-don-have-guy-appreciate-detroit-masculine-appeal%2Fm0r7nZJg9s5kvqHSkEnCmJ%2Fstory.html%3Fevent%3Devent25&media=//c.o0bg.com/rw/SysConfig/WebPortal/BostonGlobe/Framework/images/logo-bg.png&description=How", "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Flifestyle%2Ftravel%2F2015%2F09%2F05%2Fyou-don-have-guy-appreciate-detroit-masculine-appeal%2Fm0r7nZJg9s5kvqHSkEnCmJ%2Fstory.html%3Fevent%3Devent25&t=How"], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-05T23:47:37.241+03:00", "highlightTitle": ""}