{"organizations": [], "uuid": "9f996e46af6938f6babee012922126599a5ca2d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/07/ctw.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/cruise/", "section_title": "Cruise News| Online Cruise Industry News| Cruise Market Trends | Cruise Business News| Travel Industry NewsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/ctw-asia-pacific-2015-welcomes-returning-sponsor-oakwood-worldwide/", "country": "US", "title": "CTW Asia-Pacific 2015 Welcomes Returning Sponsor Oakwood WorldwideTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "CTW Asia-Pacific 2015 Welcomes Returning Sponsor Oakwood WorldwideTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "9f996e46af6938f6babee012922126599a5ca2d8"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/ctw-asia-pacific-2015-welcomes-returning-sponsor-oakwood-worldwide/", "ord_in_thread": 0, "title": "CTW Asia-Pacific 2015 Welcomes Returning Sponsor Oakwood WorldwideTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CTW Asia-Pacific 2015 Welcomes Returning Sponsor Oakwood Worldwide Published on : Thursday, September 10, 2015\nAfter a successful first event in 2014, returning sponsor Oakwood Worldwide is back with an even greater commitment as Gold Sponsor.\nThe brand’s Managing Director, Asia-Pacific, Craig Ryan said, “Our participation last year played an important part in our ongoing strategy to maintain our position as the leader in the serviced apartments industry. CTW Asia-Pacific was well-attended by corporate travel buyers and professionals, and in turn, it allowed us to reach out to our target audience of decision makers and key influencers.”\nCTW Asia-Pacific’s dedication and track record of delivering this niche buying segment has cemented Oakwood Worldwide’s confidence in the event as a powerful platform that provides outreach to the corporate buying segment.\nRyan elaborated, “It can be difficult to determine an ROI on events. However with CTW Asia-Pacific, the returns from our participation in terms of generated leads, brand impressions of our logo and media exposure generated from the start till the end – were very well met, and benefitted us. This affirmed our decision that sponsoring at CTW Asia-Pacific has indeed enabled us the opportunity to connect with corporate travel key decision makers and influencers.”\nAs the only event in the Asia-Pacific with the largest hosting program for Corporate Travel Buyers, CTW Asia-Pacific validates and handpicks applicants from diverse industries across the region every year. Successful delegates hosted to each CTW Asia-Pacific comprise of key decision makers who plan, execute, and influence corporate travel matters within their organisations. Close to 100 of the top corporate travel buyers in the region are expected at the upcoming 2015 event.\nOoi Peng Ee, General Manager of event organiser TTG Events, highlighted the benefits of sponsoring at CTW Asia-Pacific. “Our breadth and depth of educational offerings developed with expert industry practitioners makes this an annual must-attend event for leading corporate travel buyers from around the region. It also provides them with the unique and rare opportunity for knowledge enhancement and peer sharing. Our sponsors and conference delegate benefit directly from such a platform as they are ensured a captive and tailored opportunity to engage this target group of potential customers.”\nRyan concluded, “We are looking forward to the 2015 show to cement our presence in the Asia-Pacific region. We are sure this year will deliver another inspiring event, that offer several opportunities for us to engage with our clients and build new relationships.”\nSource:- CTW", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-10T07:47:44.774+03:00", "highlightTitle": ""}