{"organizations": [], "uuid": "3e07b39f33ff40ece9c7e1afc47cb86f77006602", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30005507/electric-boats-small-submarines-and-autonomous-underwater-vehicles-auv-2014-2024", "country": "US", "title": "Electric Boats, Small Submarines and Autonomous Underwater Vehicles (AUV) 2014-2024", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Electric Boats, Small Submarines and Autonomous Underwater Vehicles (AUV) 2014-2024 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "3e07b39f33ff40ece9c7e1afc47cb86f77006602"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30005507/electric-boats-small-submarines-and-autonomous-underwater-vehicles-auv-2014-2024", "ord_in_thread": 0, "title": "Electric Boats, Small Submarines and Autonomous Underwater Vehicles (AUV) 2014-2024", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " ReportBuyer\nLONDON , Sept. 10, 2015 /PRNewswire/ -- Ten year forecasts\nMarine electric vehicles are now a rapidly growing market due to new capability, affordability and legislation banning or restricting internal combustion engines. Our research finds that the market for electric water craft, including those on and under water, will increase rapidly from $2.6 billion in 2013 to $7.3 billion in 2024. In addition there is a market for electric outboard motors that will more than triple in value as high power pure electric versions become increasingly viable. There is also a new market for water borne electric aircraft.\nScope of coverage\nThis report covers hybrid and pure electric marine electric vehicles; on-water and underwater, inland and seagoing. It covers the closely allied topics of electric outboard motors and electric planes operating from water and even has some mention of electrification benefiting conventional craft. Overall, it encompasses leisure, military, industrial, commercial and other applications and the technology trends.\nMarine electric vehicles make new things possible and increasingly they have lower cost of ownership and are the only practicable way of meeting the newer, more onerous pollution regulations for inland waterways and harbours. Marine electric craft are increasingly made by existing shipyards making conventional craft but there is also a trend for those making land or airborne electric vehicles to make marine ones as well. Sometimes we see Apple levels of innovation with new entrants, something notably absent with such things as electric cars. As with all electric vehicles, the advances in the components in these vehicles and their infrastructure are proceeding disruptively rather than incrementally and the report discusses this in the marine context.\nThe many interviews and investigations carried out in the preparation of the report have revealed a market that is larger and growing faster than is popularly assumed, though some incumbents miss what is happening with new entrants and in other parts of the world. The military aspect for example is very concentrated in the USA and involves small numbers and large unit prices until such things as swarming robot jellyfish become a reality. Water borne electric aircraft and the hybridisation of ocean going leisure yachts are impressive in Europe , where the leader in AUVs is located. Some of the most advanced pure electric and fuel cell hybrid AUVs are in India and Japan . Clearly a global view, presented here for the first time, is essential if the full potential is to be understood. 50 organisations from across the world are profiled and many more are mentioned in context.\nDownload the full report: https://www.reportbuyer.com/product/2284830/\nAbout Reportbuyer\nReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers\nhttp://www.reportbuyer.com\nFor more information:\nSarah Smith\nResearch Advisor at Reportbuyer.com\nEmail: query@reportbuyer.com\nTel: +44 208 816 85 48\nWebsite: www.reportbuyer.com\n releases/electric-boats-small-submarines-and-autonomous-underwater-vehicles-auv-2014-2024-300141393.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/electric-boats-small-submarines-and-autonomous-underwater-vehicles-auv-2014-2024-300141393.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=BR98610&Transmission_Id=201509102006PR_NEWS_USPR_____BR98610&DateId=20150910", "https://www.reportbuyer.com/product/2284830/", "http://www.xmlnews.org/ns/", "http://www.reportbuyer.com/"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T04:42:54.035+03:00", "highlightTitle": ""}