{"organizations": [], "uuid": "c030edcab88822456f9f04f0cc797671d75cede6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goafrica.about.com", "main_image": "http://f.tqn.com/y/goafrica/1/S/D/e/vic-falls-river-lodge.jpg", "site_section": "http://z.about.com/6/g/goafrica/b/index.rdf", "section_title": "About Africa Travel", "url": "http://goafrica.about.com/od/zimbabwe/tp/Where-To-Stay-During-the-Dry-Season-in-Victoria-Falls.htm", "country": "US", "title": "Where To Stay During the Dry Season in Victoria Falls", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Where To Stay During the Dry Season in Victoria Falls", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T19:16:00.000+03:00", "replies_count": 0, "uuid": "c030edcab88822456f9f04f0cc797671d75cede6"}, "author": "", "url": "http://goafrica.about.com/od/zimbabwe/tp/Where-To-Stay-During-the-Dry-Season-in-Victoria-Falls.htm", "ord_in_thread": 0, "title": "Where To Stay During the Dry Season in Victoria Falls", "locations": ["Victoria Falls River Lodge", "Victoria Falls"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1. Victoria Falls River Lodge \nVictoria Falls River Lodge is the first private game lodge to be set in the Zambezi National Park. This luxury tented lodge is situated on the banks of the Zambezi River. Uninterrupted panoramic views of African sunsets and exceptional wildlife viewing makes this uniquely located lodge the ideal place from which to explore Victoria Falls as it combines the safari experience with one of the world’s most famous tourist destinations. Each tent has been tastefully decorated in earthy hues and offers a larger than king size bed, freestanding bath, comfortable sitting area, indoor and outdoor shower and a private viewing deck where one can sit and watch the hippos wallowing. Family tents also offer an additional tented room, with where children can sleep comfortably, allowing their parents a bit more privacy. A stay at Victoria Falls River Lodge includes game drives, sunset cruises, Falls tours and much more - or you can simply enjoy the gorgeous location and sit back with a cold beer (also included). More » 2. Victoria Falls Safari Lodge and Victoria Falls Club \nLess than three miles from the thundering falls, the Victoria Falls Safari Lodge and the Victoria Falls Safari Club (on the same grounds) offers an ideal launching point for explorations of this Wonder of the World. The Victoria Falls Safari Lodge was created with a keen eye for detail: all of the en-suite, air-conditioned rooms are decorated in rich hardwoods, thatch and bright-colored local fabrics, and each has a private balcony overlooking the unfenced Zambezi National Park. \nthe Victoria Falls Safari Club is made up of 20 modern rooms of which four are suites. All the rooms have sliding glass doors and gauze screens leading to a balcony, and the suites include an extra sitting room. Facilities for Safari Club residents include a welcome zone with private check-in, breakfast served in the Safari Club lounge, private deck overlooking the waterhole, bar and light meal service and no other resort residents have access to the Safari Club wing \nThe friendly service from the Zimbabwean staff is a hallmark of both lodges, and you’ll experience this firsthand at the award-winning Boma Restaurant. The lodge is also well known for its entertainment, whether it is Ndebele performers captivating guests with their energetic songs, a live vulture feeding everyday at 1pm, or a sangoma (traditional story teller) regaling people with local folklore. In addition to providing convenient access to the Falls, the lodge offers a wide range of activities from guided safari walks and game drives to white water rafting and river cruises. More » 3. Victoria Falls Hotel \nSee the mist rise from The Victoria Falls you stay in stylish comfort at Victoria Falls Hotel . This “Grand Old Lady of the Falls” is one of the oldest hotels in Zimbabwe, having been founded at the turn of the last century. Lush tropical gardens with lily ponds, palm trees and semi-tropical shrubs surround this five star escape, while inside Edwardian elegance mingles with 21st century amenities. The 161 en-suite rooms (ranging from standard rooms to the Presidential Suite) have modern comforts like personal safes and digital satellite television, yet remind you of the fabled past: with colonial prints, four-poster and canopied beds, antique furniture and unique artifacts. The rest of this sweeping property replete with places to pass the time: the large swimming pool and two tennis courts, not to mention a hair salon, spa, library and reading rooms. Nearby, a spate of activities await: 18-hole championship golf, a casino, white water rafting, game walks and drives, helicopter flights over the Falls and sundowner cruises on the Zambezi. And from high tea to haute cuisine, the restaurants here offer an undeniably world-class experience: the Livingstone Room evokes colonial elegance, while Stanley’s Terrace offers humbling views of the Falls and Jungle Junction offers buffets with Makishi dancers and an indigenous choir entertaining every night. For the more discerning of guests, check into the new deluxe stable-wing section of the hotel. More » 4. The Elephant Camp \nElephant Camp is situated just 10 kilometers out of Victoria Falls town, in its own Wildlife Sanctuary, overlooking an active waterhole which is fed by natural streams in the rainy season that rush down to meet the Masuwe River, and the Zambezi gorges below the Falls. The interiors are warm and colonial, with deep couches, dark woods and wing-back chairs on cool screed flooring. The guest lounge and dining areas are under canvas, surrounded by sliding glass doors, opening out to wide wooden decking and outdoor seating, shaded by sections of pole canopies and trees. There are 9 luxurious tented suites, constructed with solid interior walls and concrete floors, framed by canvas exteriors. All the suites are air-conditioned and have overhead fans, as well as mini bars and tea and coffee stations. The twin or king beds don crisp white linens, with textured throws in earthy tones, surrounded by quality dark wood furnishings and mosquito curtaining. The en-suite bathrooms offer huge bath tubs placed beside the windows, as well as indoor and outdoor showers. Each suite has a comfy lounge area, which opens out to a private viewing deck and plunge pool, where you can enjoy views of the gorge and glorious sunrises and sunsets. For your convenience, the camp offers two complimentary transfers into Victoria Falls town on a daily basis, giving you the opportunity to do the various activities as well as explore the Falls. You can also go on walks and do some birding on the Wildlife Sanctuary and you have the chance to interact with the Wild Horizons elephants More » 5. Ilala Lodge \nThe Ilala Lodge is the perfect base from which to explore one of the World's Seven Natural Wonders, the majestic Victoria Falls. Ilala Lodge provides distinguished yet affordable accommodation in a gracious and secluded setting. The decor evokes an era of early adventure and the quest for discovery in Africa. The inviting pool and bar is the perfect place to enjoy lunch and a cooling swim. The National Park borders the front of the property and wild animals often graze on the hotel lawns, with the spray of the falls in the background. The Falls, are within easy walking distance for guests, as is the Victoria Falls town centre. Wild animals often graze on the hotel lawns and restaurant diners can see the spray of the falls in the background while they listen to the majestic roar of \"the smoke that thunders\" and enjoy Zimbabwe's finest cuisine in Ilala's Palm Restaurant. The Ilala Lodge offer sunset cruises on one of my favorite small vessels the Ra-Ikane, so make sure to enquire about the cruise if you stay. More » Africa Travel Essentials", "external_links": [], "published": "2015-09-25T19:16:00.000+03:00", "crawled": "2015-09-26T03:31:49.887+03:00", "highlightTitle": ""}