{"organizations": [], "uuid": "36c623aa4d6c6e19bb305bab88d034da90f243ca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63581/seychelles-musical-artists-congratulated-tourism-ministry", "country": "US", "title": "Seychelles musical artists congratulated by Tourism Ministry", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Seychelles musical artists congratulated by Tourism Ministry", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T04:24:00.000+03:00", "replies_count": 0, "uuid": "36c623aa4d6c6e19bb305bab88d034da90f243ca"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63581/seychelles-musical-artists-congratulated-tourism-ministry", "ord_in_thread": 0, "title": "Seychelles musical artists congratulated by Tourism Ministry", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Seychelles musical artists congratulated by Tourism Ministry   \nSep 10, 2015 Minister Alain St.Ange & PS Benjamine Rose accepting latest music album from David Andre eTN   \nMinister Alain St. Ange, the Seychelles Minister for Tourism and Culture, and Benjamine Rose, Principal Secretary for Culture, met with Mr. David Andre at the House of Culture, National Cultural Centre in Victoria to congratulate him on the release of his latest album, Zilwa, and to wish him well on his working visit to Reunion where he will be performing at St. Gilles this week. \nThe latest music album by David Andre has been conceptualized by David Andre and Joselin Govian from Reunion Island. The music reflects rhythms of the Creole beat from the islands with a fusion of jazzy tones in the background, and it is said to be music that evokes a calm and relaxing atmosphere when listening to it. The album is comprised of old songs that have been re-sung in a mixture of Seychellois and Reunion’s Creole beats. Mr. Andre expressed that the aim of the album is to expose more of the Seychellois musicians in the region and eventually to push the Zilwa music on international level. David Andre and the group Zilwa left Seychelles on September 8 for Reunion Island, and they will be performing at the Theatre St. Gilles, Friday, September 11, at 2000 hours. Belinda Moncherry, also from Seychelles, will be the female vocal who will be performing alongside David Andre. The show will also grace the presence of Laurent Begue, Nicole Sun-Keo, and Sandrine Terrentroy from La Reunion among others. \nMinister Alain St.Ange expressed his support for such an initiative whereby Seychellois musicians are making the effort to merge and exchange ideas with others from the region to produce good music that can make it big internationally. Minister St.Ange said that Seychelles is today making headway in the field of culture. \"Some musicians are calling it a cultural revolution, but for the Ministry of Tourism and Culture, we know that when a country is exporting its culture, it is delivering for its people, because the country has reached maturity, and it has overcome the complexes associated with its past,\" Minister St.Ange said as he and PS Rose wished Zilwa a good performance in La Reunion. Minister St.Ange said that the time is now for the Ministry and the National Art Council to intensify their work to increase the visibility of Seychellois artists and their music and visual art works on the international scene. \nSeychelles is a founding member of the International Coalition of Tourism Partners (ICTP) . Source: Seychelles Ministry of Tourism and Culture", "external_links": [], "published": "2015-09-10T04:24:00.000+03:00", "crawled": "2015-09-10T08:13:56.829+03:00", "highlightTitle": ""}