{"organizations": [], "uuid": "51b68846de757ccce6afd336a2bf914a782fe60c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-09/AN_file-18-9610194828180288_1c02b266-e469-4ed2-841d-3baf59e49c94.jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094346499/US-eases-rules-for-travel-doing-business-in-Cuba?src=RSS", "country": "US", "title": "US eases rules for travel doing business in Cuba", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "US eases rules for travel doing business in Cuba | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "51b68846de757ccce6afd336a2bf914a782fe60c"}, "author": "Arab News", "url": "http://www.menafn.com/1094346499/US-eases-rules-for-travel-doing-business-in-Cuba?src=RSS", "ord_in_thread": 0, "title": "US eases rules for travel doing business in Cuba", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Arab News) WASHINGTON: The Obama administration eased rules Friday for US citizens wishing to travel to Cuba or do business with its growing ranks of independent entrepreneurs hoping to kindle greater economic freedom on the island. \nThe Treasury and Commerce departments said the regulations that take effect Monday simplify procedures for tourism telephone and Internet investments and money transfers to Cuba. \nThe changes were first reported by The Associated Press on Thursday and come as both countries seek to transform their new diplomatic relationship into deeper commercial ties. By the end of the year the former Cold War foes should resume direct postal service for the first time in five decades and clinch an agreement on regularly scheduled commercial flights a US official familiar with the process told the AP. \n'A stronger more open US-Cuba relationship has the potential to create economic opportunities for both Americans and Cubans alike' Treasury Secretary Jack Lew said in a statement. Easing the embargo on Cuba he said will 'support the Cuban people in their effort to achieve the political and economic freedom necessary to build a democratic prosperous and stable Cuba.' \nCommerce Secretary Penny Pritzker said the new rules could 'stimulate long overdue economic reform across the country.' \nWhen President Barack Obama laid out his vision of improved US-Cuban relations nine months ago he said his objectives were twofold: ease economic hardship in Cuba and aid the development of a private market outside of state control. \nIn January he eased economic restrictions on Cuba in potentially the most dramatic manner since relations between the countries broke down after Fidel Castro's revolution in 1959 and the subsequent Bay of Pigs invasion and Cuban missile crisis. Only Congress can end the embargo. \nThe action sought to cut red tape for US travel to Cuba permit American companies to export telephones computers and Internet technology and allow US firms to send supplies to private Cuban enterprises. But efforts to expand business tourism and other exchanges ran into an overlapping thicket of US laws and hindrances not to mention an uneven response from Cuba's political leaders. \nMany US travelers still need to go on supervised group trips. Routine airline service hasn't satisfied various federal conditions. Cruise ships and ferries are still trying to finalize regular maritime routes with Cuban authorities. Credit card and other companies still can't transfer payments to Cuba. Telecommunications companies haven't been able to set up shop and get equipment to the island 90 miles south of Florida. And Cuba's government isn't even running its Internet connections anywhere near capacity levels. \nAuthorized American citizens now will be able to travel by cruise ship or ferry to Cuba without seeking specific authorization from the US government though a US official told the AP earlier this week that a direct maritime route probably won't be established until next year. The official wasn't authorized to speak publicly on the process and demanded anonymity. \nAll US citizens who fall under permitted rules for travel also are permitted to open and maintain bank accounts in Cuba. \nThe US official who spoke to the AP described significant progress in US-Cuban discussions since the pair reopened embassies in each other's capitals in July. At a meeting in Havana last week delegations from each side established a plan to settle a half-century of economic and legal disputes within the next 15 months. \nWhile difficult questions related to human rights and compensation claims won't be resolved immediately the official said first steps toward a broader normalization of ties would come quickly. \nWashington and Havana are slated to begin a 'pilot program' allowing Cubans and Americans to send mail directly to one another the official said. Direct mail service was halted in 1963 though letters and packages travel back and forth through countries like Canada and Mexico. The postal program will use the Miami and Havana airports the official said. \nAlso the US and Cuba should finalize an agreement on resuming direct commercial airline routes though the first flights wouldn't start until next year.", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-20T06:52:13.442+03:00", "highlightTitle": ""}