{"organizations": ["ET Discount Coupons Corporation Announces Closing of Share Exchange Agreement With Vacation Travel Corporation"], "uuid": "d11e3d0896513d7ae4dbbb91394809198032a1a3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.marketwired.com", "main_image": "http://media.marketwire.com/attachments/201509/346292_DiscountCouponsLogo.jpg", "site_section": "http://www.marketwire.com/rss/mwTravelandHospitality.xml", "section_title": "Marketwired - Travel and Hospitality", "url": "http://www.marketwired.com/press-release/discount-coupons-corporation-announces-closing-share-exchange-agreement-with-vacation-otc-pink-dcou-2053962.htm", "country": "CA", "title": "Discount Coupons Corporation Announces Closing of Share Exchange Agreement With Vacation Travel Corporation", "performance_score": 0, "site": "marketwired.com", "participants_count": 0, "title_full": "Discount Coupons Corporation Announces Closing of Share Exchange Agreement With Vacation Travel Corporation", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T16:37:00.000+03:00", "replies_count": 0, "uuid": "d11e3d0896513d7ae4dbbb91394809198032a1a3"}, "author": "", "url": "http://www.marketwired.com/press-release/discount-coupons-corporation-announces-closing-share-exchange-agreement-with-vacation-otc-pink-dcou-2053962.htm", "ord_in_thread": 0, "title": "Discount Coupons Corporation Announces Closing of Share Exchange Agreement With Vacation Travel Corporation", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "September 09, 2015 09:37 ET Discount Coupons Corporation Announces Closing of Share Exchange Agreement With Vacation Travel Corporation \nCLEARWATER, FL--(Marketwired - Sep 9, 2015) - Discount Coupons Corporation ( OTC PINK : DCOU ) -- Keith Holloway, Discount Coupons Corporation's Chief Executive Officer, announced the closing of the Share Exchange with Vacation Travel Corp., whereby Discount Coupons acquired Vacation Travel, which became its subsidiary. \nDiscount Coupons is a marketing firm that provides services to businesses on a cost per acquisition basis through the sale of discount vouchers to consumers and operates in a similar manner to businesses that define themselves as \"daily deal\" websites by leveraging the power of group buying to provide deals with savings to users. We operate the following business to consumer \"daily deal\" websites: www.gocharlestondeals.com , www.pricechoppa.com , www.discountcoupons.com . Vacation Travel also provides vacation travel reservations and bookings via www.tropicalreservations.com , as well as products, services to \"daily deal\" websites, and product directly to consumers. \nKeith Holloway said: \"Closing of this acquisition will enable us to provide quality offers and discounts to our subscribers. This also allows us to expand the Ecom Ally brand and provide a suite of services to small and medium businesses. Our goal is to be a merchant advocate by providing the tools necessary for merchants to grow their business.\" \nAbout Discount Coupons Corporation \nDiscount Coupons, an Internet marketing and technology company, operates in two segments, daily deal site management and full-service digital marketing agency services. The daily deal segment operates daily deal websites that sell discounted vouchers to consumers. Daily deal websites benefit both businesses and consumers. Businesses are provided a Cost Per Acquisition (CPA) type marketing opportunity where they pay a set fee per voucher sold. Consumers purchase discounted vouchers, typically at 50% off retail pricing, which are then redeemed at either a website or a local business. The daily deal segment intends on growing through the acquisition of established daily deal websites. The daily deal segment operates DiscountCoupons.com and other similar properties. DiscountCoupons.com has been in operation since 1997. The agency segment provides businesses with a full range of digital and traditional marketing services including, branding, interactive, advertising, business development, public relations, market research, analytics, photography and creative strategies. Managed interactive marketing channels include social media, search engine optimization, website concepts and development, graphic design, email marketing, social media marketing and search engine marketing. Discount Coupons is headquartered in Clearwater, Florida. \nFor more information about Discount Coupons, visit the website at www.discountcouponscorp.com . If you wish to be added to DCOU's mailing list, please email: Keith@discountcoupons.com . \nAbout Vacation Travel Corp. \nVacation Travel, based in Largo, Florida, provides vacation travel reservations and bookings, as well as products, and services to \"daily deal\" websites, and product directly to consumers via its \"daily deal\" website. Founded in July 2000, Vacation Travel is a licensed travel agent and operates three divisions: Vacation Travel, dba Tropical Reservations, is a Florida licensed travel agency whose website is www.tropicalreservations.com ; Ecom Ally Corp, www.ecomally.com , is a \"business to business\" (\"B2B\") website that provides \"daily deal\" sites with product sourcing, warehousing and fulfillment services; Pricechoppa.com is a \"business to consumer\" (\"B2C\") website and a \"daily deal\" website site, www.pricechoppa.com . \nForward Looking Statements This release contains \"forward-looking statements\". \"Forward-looking statements\" describe future expectations, plans, results, or strategies and are generally preceded by words such as \"may,\" \"future,\" \"plan\" or \"planned,\" \"will\" or \"should,\" \"expected,\" \"anticipates,\" \"draft,\" \"eventually\" or \"projected.\" You are cautioned that such statements are subject to a multitude of risks and uncertainties that could cause future circumstances, events, or results to differ materially from those projected in the forward-looking statements, including the risks that actual results may differ materially from those projected in the forward-looking statements as a result of various factors, and other risks. Our operations are subject to many business and financial risks, including the Company's potential failure to meet its financial and contractual obligations, You should consider these factors in evaluating the forward-looking statements included herein, and not place undue reliance on such statements. No information in this press release should be considered as any indication whatsoever of the Company's future revenues, operating results or stock price. Contact Information", "external_links": [], "published": "2015-09-09T16:37:00.000+03:00", "crawled": "2015-09-09T17:16:07.079+03:00", "highlightTitle": ""}