{"organizations": [], "uuid": "56d64ca6a6b2f83858899deef532876dace36744", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.herald.ie", "main_image": "http://www.independent.ie/incoming/article31510005.ece/ALTERNATES/h342/Dubsfans_Cropped.jpg", "site_section": "http://www.herald.ie/lifestyle/travel/", "section_title": "Travel - Herald.ie", "url": "http://www.herald.ie/opinion/anna-nolan-high-fives-and-novelty-whistles-its-just-another-day-supporting-dublin-31510008.html", "country": "", "title": "Anna Nolan: High fives and novelty whistles – it’s just another day supporting Dublin", "performance_score": 0, "site": "herald.ie", "participants_count": 1, "title_full": "Anna Nolan: High fives and novelty whistles – it’s just another day supporting Dublin - Herald.ie", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T19:03:00.000+03:00", "replies_count": 0, "uuid": "56d64ca6a6b2f83858899deef532876dace36744"}, "author": "Anna Nolan", "url": "http://www.herald.ie/opinion/anna-nolan-high-fives-and-novelty-whistles-its-just-another-day-supporting-dublin-31510008.html", "ord_in_thread": 0, "title": "Anna Nolan: High fives and novelty whistles – it’s just another day supporting Dublin", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Well, there was something for everyone last weekend. Music festivals, rugby, GAA, soccer, even The Late Late Show. Dublin fans Carla and Michelle Clancy, from Knocklyon, Co. Dublin Host Tess Daly, Daniel O'Donnell and his dance partner Kristina Rihanoff Kanye West Rob Kearney Anna Nolan – 08 September 2015 11:03 AM\nWhether you wanted to shout for your county or shout at Ryan Tubridy, no-one could complain that it was boring.\nI had the pleasure of getting to see the Dublin-Mayo match. It was a last-minute treat and one of the best days out that I’ve had in a long time.\nBut it wasn’t necessarily the game in the stadium that made it special – more what I encountered before and after.\nMyself and my friend were running a little late (as we had watched the England-Ireland rugby match), so when we hit Summerhill we joined the sprinting fans with only 10 minutes before throw-in.\nLatecomers\nIt was amazing to be part of hundreds of jogging latecomers bedecked in blue, and red and green.\nWhen we reached our seats the ball was thrown in the air. The usual thing happened with the Dub supporters. We sat back (like the team) and took things handy.\nWhile the Mayo fans were jumping, screaming, cheering and applauding, we were sitting complacent, waiting on the fire to erupt in the second half. My friend thinks us Dubs are cocky. She’s probably right.\nAt half-time I looked around. There were families from both counties sitting beside each other.\nThere was a chap sitting beside me clapping for both teams. I know, weird.\nWhen the second half started my inner foul-mouthed beast kicked off. Each time Dublin clocked up a score I had a new expletive to match it. The poor kids in front of me could have been on the Hill, with what they were hearing from me.\nAfter the third Dublin goal I was high-fiving the poor unfortunates around me.\nThe Dublin win made the walk home all the sweeter. So much so that, as we were passing The Sunset House in Summerhill, I said: “Let’s go into this pub for a drink”.\nMy friend knew I was on a high and there was no stopping me, even though it was packed. In we went, and the locals were all buzzed up with match result.\nI asked for a sauvignon blanc. “Ah here,” the barman said, “we just have white wine that we shove into a glass.” “That’ll do me thanks,” I said.\nWe stood outside and a customer came out from the pub and said: “This is for you.” He handed me a mickey whistle. As in, a whistle in the shape of a mickey. It was that sort of day.\nAs we finished our drinks, the street was packed with Dublin and Mayo supporters. The Dubs weren’t rubbing it in – there was just a warm, fuzzy feeling around Summerhill.\nLast weekend was deadly. with many things to shout at – apart from the Late Late Show.\nWhen you have days like the last few – cheering Dublin, Ireland or Grace Jones at Electric Picnic – it brings a smile to your face.\nStrictly’s all about perfection, and our Daniel is perfect in his own wee way\nHost Tess Daly, Daniel O'Donnell and his dance partner Kristina Rihanoff\nI interviewed the journalist Eddie Rowley a while back on the subject of Daniel O’Donnell.\nIt was for the Pat Kenny In The Round show and we wanted to get a sense of Daniel when he was starting out. Eddie painted a picture of a hard-grafting perfectionist who knew he wanted to be a star from an early age.\nHe also told how Daniel learned his craft when he was a young boy and mentioned the amount of time the singer would spend meeting his fans.\nDaniel also expected a level of perfection from his band and his singers. He gave the best and expected the best.\nThis reminded me of that scene from the Michael Jackson documentary This Is It, when Jackson is rehearsing with his band. One of the guitarists keeps making a mistake on one of the riffs.\nPractice\nYou could feel that the singer was getting more and more irritated. The guitarist eventually said to Jackson: “I’m getting there” Michael replied – with more than a tinge of anger – “Well, get there.”\nSo when I saw that Daniel O’Donnell was appearing on Strictly Come Dancing, I thought – here is a guy who will practise, practise, practise.\nWe have seen Daniel’s moves. He loves a little side step. He adores a twirl. When he does his jump – well, the ladies go bananas.\nBut we have never seen him do a tango, a full-on jive or any routine that demands lots of movement.\nI have a feeling that he is going to do quite well in this competition, with partner Kristina Rihanoff. I don’t think it will simply be the ‘lady vote’.\nI genuinely think that Daniel could be an Anton du Beke sort of mover. Graceful, not necessarily alpha male, but a touch of Fred Astaire.\nI may be completely wrong, but I fancy his chances very much on foot of last Saturday’s show.\nExpect to see some fabulous movin’ and shakin’ from our wee Daniel in the coming weeks.\nYes, we Kanye - or maybe not\nI dislike Kanye West more and more as time goes by. The latest cause of my irritation was when he announced that he was going to run for US President in 2020. Never mind the fact that Kanye (pictured left on a, er, diplomatic mission to Paris Fashion Week) and Taylor Swift (inset) are BFFs now after his notorious stage invasion some time back.\nThe rapper, with his knowledge of domestic policies, social issues and international diplomacy, would be a great president, I’m sure.\nMind you, Kanye West voicing megalomaniac ambitions? Seems like his president remark is just par for the course for this guy. Next year: Kanye makes a play for Master of the Universe.\nRugby to brighten up the autumn days On SATURDAY week Ireland’s journey in the Rugby World Cup begins. First off Ireland v Canada. Then we play Romania, Italy and France.\nSo here come six solid weeks of rugby – even if you’re not mad about the sport it’s going to be hard not to get caught up in the excitement.\nTo be honest, I think it’s the perfect antidote to what was a rotten summer. The World Cup will take us nicely into winter before the big C arrives.\nNow all that remains is for Joe Schmidt’s (inset) team to get to the final – over to you, lads!", "external_links": ["http://www.independent.ie/incoming/article31509388.ece/3ed16/ALTERNATES/w620/DOD1.jpg", "http://www.independent.ie/incoming/article31510005.ece/854b2/ALTERNATES/w620/Dubsfans_Cropped.jpg"], "published": "2015-09-08T19:03:00.000+03:00", "crawled": "2015-09-08T14:06:35.559+03:00", "highlightTitle": ""}