{"organizations": [], "uuid": "e12b8fbb9ae4e25371e546c96413dc880032ac70", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bootsnall.com", "main_image": "", "site_section": "http://feeds.bootsnall.com/bna/articles/", "section_title": "BootsnAll Travel Articles", "url": "http://www.bootsnall.com/articles/15-09/define-dangerous.html", "country": "US", "title": "Define Dangerous:", "performance_score": 0, "site": "bootsnall.com", "participants_count": 1, "title_full": "Define Dangerous:", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T11:03:00.000+03:00", "replies_count": 0, "uuid": "e12b8fbb9ae4e25371e546c96413dc880032ac70"}, "author": "admin", "url": "http://www.bootsnall.com/articles/15-09/define-dangerous.html", "ord_in_thread": 0, "title": "Define Dangerous:", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "1- Iceland\nAre you interested in where the USA ranks? \nNumber 94, in the bottom half of the rankings, rated as “Medium” by the index. Number 95 is Saudi Arabia, for perspective. September 21, 2015, the State Department issued a travel warning for Saudi Arabia, advising against travel to that country because it’s too dangerous. Realities to Consider I chuckled when my friend so vehemently rejected the idea of traveling to the USA because it’s not safe for her children. My children were born there and have spent about half of their lives in the USA. We’ve traveled to every single state. Not one time have we felt threatened in the least. The most violence ever done to us was when our mirrors were stolen from the sides of our van during Mardi Gras in New Orleans. That’s what we get for parking on the street during the biggest party of the year.\nWe’ve hung out in 12 of the 20 most dangerous cities in America , heck two of my kids were born in #16. I do not consider the USA dangerous. And yet, on paper, it’s dangerous. The current mass shooting count for this year stands at 280. With a gun death rate of 29.7 per 100,000 people , that shakes out to somewhere in the neighborhood of 32,000 gun deaths a year. No wonder my Australian friends are reticent to visit. \nAnd yet, the USA is safe to travel in, right? We all know that. \nHere’s the thing about statistics. If something has a one in a million chance of happening, it’s going to happen 8.4 times a day in New York City. It’s going to happen more like a thousand times a day in China. \nMost Americans would have some reservations about the safety of traveling to Mexico. The State Department estimates that 150,000 U.S. citizens cross the borders into Mexico every single day. Only 100 Americans were killed in Mexico in 2014. Are some areas more dangerous than others? Of course! Just like Chicago rates as more dangerous than Boise, Idaho. For the 19th most dangerous country, Mexico doesn’t feel very dangerous in most places. So, how do you decide which countries are safe? People ask me this all the time. I don’t have a formula to give you. It’s an intuitive balance of statistics, weighed against news, compared with boots on the ground information found in blogs (or shared by friends I know in those places) combined with the opinions of a couple of friends I have who have “inside information” that they generally can’t share, other than to say “go” or, “no-go.” Sometimes, it comes down to trusting my gut. “Sometimes, it comes down to trusting my gut.” At very least, I take into consideration the US State Department Warnings and Advisories, and the UK Foreign Travel Advice. The fact that our travel insurance is invalid in countries where there is a travel warning is enough for me to strike them from the list. I travel with four kids, I err on the side of caution.\nWhen it comes to deciding where, within a questionable country, would be best to spend our time, I pay attention to the news (which is great at pointing out the negatives) and I ask friends, or find blogs about what the best places are to visit within a particular region. Minimizing Risk No matter where a person is traveling there are certain behaviors that will put one at greater risk, and there are things you can do to actively minimize any existing risk in an iffy location.\nHaving decent manners at all times, being a good guest in a country and familiarizing yourself with cultural norms is a good place to start. Dressing conservatively, for both men and women, is a no brainer. Avoiding illegal activity. Learning to speak a bit of the language. Respecting local traditions. Keeping culturally insensitive opinions to yourself. Those measures alone will up your chances of having a positive experience. \nRegister your travel plans with the embassy in the countries you’re passing through and that will make it easier for them to alert you if the security status changes in one region or another. “Travel is not, in my opinion, a particularly risky undertaking.” Remaining sober. Keeping personal information (like hotel and travel plans) to yourself. Hiring a guide or a driver when it would make sense to do so (I did this in the Ukraine to road trip across the country). Staying in well lit, reputable parts of town. You know, having a little common sense. It’s not too much to ask is it? You have it at home, pack it on the road as well.\nTravel is not, in my opinion, a particularly risky undertaking. Even when the destinations fall a little south of the center of that list of peaceful places. Even so called, “Dangerous Destinations,” can be perfectly safe and really worthwhile places to visit. The important thing is to gather information, think it through, and make informed decisions about how and where you choose to travel. Ready for a Career Break?", "external_links": [], "published": "2015-09-24T11:03:00.000+03:00", "crawled": "2015-09-24T17:47:03.346+03:00", "highlightTitle": ""}