{"organizations": [], "uuid": "7e40e0374ad10cd8af66ffc5714e8c7b6895a5e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.providencejournal.com", "main_image": "http://www.providencejournal.com/storyimage/PJ/20150920/ENTERTAINMENTLIFE/150929989/AR/0/AR-150929989.jpg", "site_section": "http://www.providencejournal.com/lifestyle/travel?template=rss&mime=xml", "section_title": "Travel - providencejournal.com", "url": "http://www.providencejournal.com/article/20150920/ENTERTAINMENTLIFE/150929989/13931/EVERGREEN?rssfeed=true", "country": "US", "title": "Just over Rhode Island border, Mystic is a great place for a day trip", "performance_score": 0, "site": "providencejournal.com", "participants_count": 1, "title_full": "Just over Rhode Island border, Mystic is a great place for a day trip", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T08:01:00.000+03:00", "replies_count": 0, "uuid": "7e40e0374ad10cd8af66ffc5714e8c7b6895a5e8"}, "author": "Jenna Pelletier Journal Staff Writer", "url": "http://www.providencejournal.com/article/20150920/ENTERTAINMENTLIFE/150929989/13931/EVERGREEN?rssfeed=true", "ord_in_thread": 0, "title": "Just over Rhode Island border, Mystic is a great place for a day trip", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Just over Rhode Island border, Mystic is a great place for a day trip Connecticut village with a seafaring past offers plenty of opportunities for exploring, shopping and dining. Comment By Jenna PelletierJournal Staff Writer Posted Sep. 20, 2015 @ 12:01 am There's more to Mystic, Conn., than replica ships and old New England charm. The village — located within the towns of Groton and Stonington — pays homage to its seafaring history while staying on-trend with modern shopping and dining offerings. As the weather transitions from summer to fall, it's a great time to take the short trip over the Rhode Island border to explore Mystic for the day. Here's our sample itinerary, centered around an afternoon along the Mystic River downtown. A stop at Clyde's Cider Mill (129 N. Stonington Rd., Old Mystic. bfclydescidermill.com , 860-536-3354) is a must this time of the year. Start by sipping on a cup of hot cider — or cold, depending on fickle fall weather — on the sprawling porch of the mill's shop. Then, walk a few steps over to the steam-powered mill, a National Historic Landmark, built in 1881, to watch the production process. Clyde's also makes a dozen types of hard ciders and apple wines, available for sampling and purchase at a new tasting room on the property. Then, move along to charming downtown Mystic, about an eight-minute drive away. Start at Mystic River Park (Cottrell Street), where you can sit on one of the many benches and take in the view of the river. It's worth sticking around until 40 minutes past the hour to watch the Mystic River Drawbridge lift to let boats pass. If you're inspired to get on the water, Riverdog Kayak offers rentals from the park for $20-$35 per hour. Take an hour or two to explore downtown. The streets around the drawbridge on both sides, including East and West Main streets, Cottrell Street, Holmes Street and Water Street, are filled with boutiques and restaurants. Be sure to stop at Mystic Knotwork (25 Cottrell St., 860-889-3793, mysticknotwork.com ) to pick up an iconic New England sailor bracelet, knotted doormat or set of coasters. Owner Matt Beaudoin carries on a tradition started by his grandfather, who learned the nautical art while in the Merchant Marines in the 1930s. Nearby, Rochelle's (11 Cottrell St., 860-415-9445) offers youthful, trendy clothing, including party dresses and romantic tops from the likes of Free People and Jack by BB Dakota. Antique jewelry fans will want to visit N.L. Shaw and Company (50 West Main St., 860-572-5838, nlshaw.com ) to take in Nancy Shaw's jaw-dropping selection of Art Deco and Victorian-era jewelry, including several sparkling diamond pieces. Also check out the Spice & Tea Exchange (6 West Main St., 860-245-4153, spiceandtea.com ) for fall kitchen staples such as mulling spices and pumpkin spice tea; Tidal River (28 W. Main St., 860-536-6371, shop.tidalriverclothing.com ) for activewear by brands including Patagonia, Prana and Life is Good; and Peppergrass and Tulip (30 W. Main St., 860-536-1516) for a great selection of hats and fascinators. Bank Square Books (53 W. Main St., 860-536-3795, banksquarebooks.com ) offers everything you could want in an independent bookstore, including a large section of staff picks, shelf space for local and regional authors, and plenty of comfy seating. Across the street from the bookstore, you can't miss the large Mystic Pizza sign. (56 West St., 860-536-3700, mysticpizza.com ) Known for its extra-cheesy slices, the restaurant provided the inspiration for the 1988 coming-of-age movie starring Julia Roberts. It's one of many dining options in the area. If you're in the mood for a burger, the Engine Room (14 Holmes St., 860-415-8117, engineroomct.com ) is a good bet. Located in the restored Lathrop Engine building, the atmosphere — leather banquettes, exposed brick — brings an urban feel to the small town. It also offers a great selection of craft beers and whiskeys. Other popular restaurants include the Captain Daniel Packer Inne (32 Water St., 860-536-3555, danielpacker.com ), a restored 1756 captain's home with roaring fireplaces that serves New England classics such as clam chowder and fish and chips, and the more modern Bravo Bravo (20 East Main St., 860-536-3228, bravobravoct.com ), known for Italian dishes such as grilled pizza, pasta and antipasto. Most area bars and restaurants also offer Happy Hour drink and food specials from 4-6 p.m. If maritime-y Mystic has you itching to get on a boat, hop on a sunset cruise on the schooner Argia (15 Holmes St., 860-536-0416, argiamystic.com ), offered daily at 5:30 p.m. through mid-October. The two-hour trip in calm, protected waters covers the entire length of the Mystic River, and offers views of islands, lighthouses and historic homes. Don't leave before having dessert. Mystic Drawbridge Ice Cream (2 West Main St., 860-572-7978, mysticdrawbridgeicecream.com ) makes its rich ice cream on site. Flavors include pumpkin pie, chocolatey Mystic Mud and Kahlua mocha fudge. Step outside onto the drawbridge to enjoy your cone while taking one last look at the mighty Mystic. ALSO IN THE AREA Extend your visit to Mystic with these options: Old Mistick Village This re-created Colonial shopping village offers more than 60 themed stores, including those dedicated to Christmas ornaments, vintage quilts, Murano glass jewelry and Scandinavian imports. 27 Coogan Blvd., Mystic, 860-536-4941, oldemistickvillage.com . Mystic Aquarium Learn about and visit with marine life, including African penguins, sea lions, Beluga whales and white spotted bamboo sharks. 55 Coogan Blvd., Mystic. 860-572-5955, mysticaquarium.org . Mystic Seaport Located on 19 acres, this maritime museum is home to the restored wooden whaling ship Charles W. Morgan. Built in 1841, it's the country's oldest commercial ship still afloat. It also offers historic interpreters and marine exhibits. 75 Greenmanville Ave., Mystic. 860-572-0711, mysticseaport.org . Abbott's Lobster Last call for lobster rolls. Open since 1947 and until Columbus Day this year, waterfront Abbott's is a classic spot to try a Connecticut-style lobster roll, served hot with butter on a hamburger bun. 117 Pearl St., Noank. 860-536-7719, abbottslobster.com top clicks", "external_links": [], "published": "2015-09-20T08:01:00.000+03:00", "crawled": "2015-09-20T10:11:51.529+03:00", "highlightTitle": ""}