{"organizations": [], "uuid": "96df27394f7039695a397ece7bc1cef5ad67c82f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gochina.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/175075612.jpg", "site_section": "http://z.about.com/6/o/m/gochina_t2.xml", "section_title": "About.com China Travel: What's Hot Now", "url": "http://gochina.about.com/od/whattoseeinbeijing/p/ForbiddenCity.htm", "country": "US", "title": "Behind the vermillion walls - China's Forbidden...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Behind the vermillion walls - China's Forbidden...", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T14:05:00.000+03:00", "replies_count": 0, "uuid": "96df27394f7039695a397ece7bc1cef5ad67c82f"}, "author": "", "url": "http://gochina.about.com/od/whattoseeinbeijing/p/ForbiddenCity.htm", "ord_in_thread": 0, "title": "Behind the vermillion walls - China's Forbidden...", "locations": ["Forbidden City", "China"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Sara Naumann"], "text": "Possibly the most popular tourist attraction in China, Forbidden City covers 720,000 square meters, including 800 buildings and more than 8,000 rooms.. Photo: Sara Naumann \nOverview: \nNamed one of China's UNESCO World Cultural Heritage Sites in 1987, the Forbidden City is probably China's most famous museum. Its famous red walls housed Ming and Qing emperors for nearly 500 years. Now the halls, gardens, pavilions and nearly one million treasures are visited and viewed by 8 million tourists a year. \nLocation: \nThe Forbidden City is located in the heart of Beijing , directly north of Tiananmen Square . \nHistory: \nThe third Ming emperor, Yongle, constructed the Forbidden City from 1406 to 1420, as he moved his capital from Nanjing to Beijing. Twenty-four successive Ming and Qing emperors ruled from the palace until 1911 when the Qing dynasty fell. Puyi, the last emperor, was allowed to live inside the inner court until his expulsion in 1924. A committee then took charge of the palace, and, after organizing over a million treasures, the committee opened the Palace Museum to the public on October 10, 1925. \nFeatures: Surrounded by 10m high walls and a 52m wide moat Measures 961m from north to south and 753k from east to west, covering 720,000 square meters Each side has one gate. Tourists today enter through the southern Meridian Gate (Wu men) and exit through the northern Gate of Spiritual Valor (Shenwu men). 70 halls and palaces, totaling 9,999 rooms comprise the palace which spans a north-south axis Multiple galleries displaying portions of the imperial treasure trove \nServices: Audio guides in multiple languages are available at the Meridian Gate (Wu men) and the Gate of Divine Prowess (Shenwu men). Rental requires a deposit which you get back when you turn in our audio guide at the exit. Bag check at Meridian gate, Wumen Gift shops, bookstores, snacks (yes, there's even a Starbucks, located in the southeastern corner of the Hall of Preserving Harmony) Information Center in the Archery Pavilion (Jian ting) \nGetting there: Public buses that stop at the Forbidden City: 1, 4, 20, 52, 57, 101, 103, 109, 111 Metro stops: Tian'anmenxi or Tian'anmendong on the East-West line \nEssentials: Recommended time for visit : at least three hours \nTips: Even though you'll feel like you're passing all opportunities to rent a guide, hold out for the Roger Moore narrated audio guide. Trust me, it's worth it. As you enter through the Meridian Gate, be on the look out for shops selling a lovely map of the Imperial Palace. If you would like a nice souvenir, grab this now. Unlike 99% of other souvenirs in China, this one is only available at the beginning of your tour of the Forbidden City! Related Articles", "external_links": [], "published": "2015-09-04T14:05:00.000+03:00", "crawled": "2015-09-05T03:23:40.942+03:00", "highlightTitle": ""}