{"organizations": [], "uuid": "aa33abfd0626d6b7828203fa3ca0d2268acfd21f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/travel/columnists/tom-parsons/20150904-summer_flights_43942995-2.ece/BINARY/original/SUMMER_FLIGHTS_43942995+%282%29", "site_section": "http://www.dallasnews.com/lifestyles/travel/columnists/tom-parsons/", "section_title": "Dallas-Fort Worth Travel News and Destinations - News for Dallas, Texas ", "url": "http://www.dallasnews.com/lifestyles/travel/columnists/tom-parsons/20150904-airfare-bargains-to-be-had-out-of-dallas.ece", "country": "US", "title": "Airfare bargains to be had out of Dallas |", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Airfare bargains to be had out of Dallas | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T06:37:00.000+03:00", "replies_count": 0, "uuid": "aa33abfd0626d6b7828203fa3ca0d2268acfd21f"}, "author": "Parsons", "url": "http://www.dallasnews.com/lifestyles/travel/columnists/tom-parsons/20150904-airfare-bargains-to-be-had-out-of-dallas.ece", "ord_in_thread": 0, "title": "Airfare bargains to be had out of Dallas |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "We have been seeing some unbelievable airfares out of Dallas, especially on nonstop routes that are more than 500 miles one-way.\nIn recent weeks, Southwest has offered round-trip sale fares for less than $100 from Dallas to Los Angeles, Chicago, Detroit, Orlando, Tampa, Fort Lauderdale, Atlanta, Baltimore, New York City, Boston, New Orleans, Kansas City, Phoenix, Denver and Washington, D.C.\nWe’ve also even seen Minneapolis for less than $100 round trip, down from an average of $250 to $300. I haven’t seen fares this cheap to Minneapolis in a long time.\nMany short-haul destinations have been priced higher than these long-haul deals. Houston and Memphis have been averaging $160 round trip, and Midland and Wichita are averaging $172 round trip. While some of these short-haul flights have come down in price, many were averaging $170 to $220 until recently.\nWe should see some great fares on short-haul flights up to 500 miles when Southwest launches its annual sale sometime in early to mid-October for travel in late fall and in winter. Fares should start at $98 round trip and are usually tiered based on mileage. The sale will probably start Oct. 6 or 13 and last three days. Travel should be valid the two weeks between the end of Thanksgiving and the beginning of the Christmas holidays, with blackouts during the winter holidays, and from Jan. 5 through mid- to late February.\nPast Southwest October sales have offered tiers with fares for $98 for travel up to 500 miles each way, $198 for flights 501 to 1,000 miles each way, $258 for flights 1,001 to 1,500 miles away and $298 for flights more than 1,500 miles each way. Fares will probably be similar this year, and I can’t imagine these fares going up with current jet fuel prices that are close to $1.60 per gallon. If the airlines can afford to charge you less than $100 to go to Los Angeles and Boston during a sale, they can afford to sell you a $98 round-trip fare to Houston.\nPhoenix, Chicago and Atlanta are likely to be priced at $198 during this sale, but we have been seeing fares for less than $100 to these cities. Where we will see the deals is on flights 500 miles or less, which could go down to $98 round trip. When we see the really cheap sale fares, travel is often very limited and seats can be found on select Tuesdays, Wednesdays and Saturdays.\nOne thing to note with the Southwest October sale is that we will get more days a week to travel because the sale usually offers travel five days a week and excludes Fridays and Sundays.\nSome of the recent sale fares we’ve seen only have seats on one or two flights a day, which can change by date, so checking a flexible calendar while booking helps to find the cheapest option.\nThese under-$100 sales have been valid for travel through mid-November and are not available at all during the holidays. We could see these kind of prices again for travel after the holidays, but at press time, many of these fares doubled and some were even higher. When we checked fares at press time, Dallas to Chicago was $82 for travel through Nov. 18, but was $222 for travel in January. Atlanta was $82 through mid-November, but $128 in January, still a great fare. Orlando, Tampa, Fort Lauderdale, Baltimore, Boston, Kansas City and Phoenix were all more than $200 round trip when we checked prices for January travel.\nThe early bird gets the worm, so you’ll want to be on the lookout for Southwest’s sale. The demand for these cheap fares can overwhelm its website, as we saw in June during its annual anniversary sale. Hopefully, Southwest is gearing up for the increased traffic and will have fixed any issues. Believe me, Southwest wants to sell these fares to fill up seats during slow season. We also see other carriers match this sale, so you should see similar fares on competitors’ flights from Dallas Love Field and from D/FW International Airport.\nTom Parsons is the editor of bestfares.com.", "external_links": [], "published": "2015-09-05T06:37:00.000+03:00", "crawled": "2015-09-16T10:50:44.257+03:00", "highlightTitle": ""}