{"organizations": [], "uuid": "c0c0acbcf8ef4aef034ba80cc5c0864afe80d247", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/09/02/af/9d/cc1e5d6025e6489382815474bfae3975-266b6348605e497a95ffee2acad3ca38-0.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/general/officials-search-for-3-suspects-in-illinois-office/nnWsM/", "country": "US", "title": "Officials search for 3 suspects in Illinois officer's death | www.ajc.com", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Officials search for 3 suspects in Illinois officer's death | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T10:46:00.000+03:00", "replies_count": 0, "uuid": "c0c0acbcf8ef4aef034ba80cc5c0864afe80d247"}, "author": "CARRIE ANTLFINGER", "url": "http://www.ajc.com/ap/ap/general/officials-search-for-3-suspects-in-illinois-office/nnWsM/", "ord_in_thread": 0, "title": "Officials search for 3 suspects in Illinois officer's death | www.ajc.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As a small northern Illinois community mourned a popular veteran police officer who was fatally shot while on duty, authorities scoured the area overnight in search of three men wanted in his slaying.\nHelicopters were to aid about 100 officers early Wednesday as the manhunt in and around the village of Fox Lake for the suspects the fatal shooting of Lt. Charles Joseph Gliniewicz stretched toward a second day, a sheriff's office spokesman said.\nAuthorities from across the state and region poured into the village about 60 miles north of Chicago after the shooting Tuesday morning, some wearing tactical gear and toting high-powered rifles. Federal agencies, SWAT teams and 48 police dogs assisted in the search for the suspects, Lake County Sheriff's Office spokesman Sgt. Christopher Covelli said.\nMembers of various police agencies gather as they continue searching for suspects in the shooting of a police officer, Tuesday, Sept. 1, 2015 in Fox Lake, Ill. Fox Lake Police Lt. Charles Joseph Gliniewicz was shot and killed while pursuing a group of suspicious men. Police with helicopters, dogs and armed with rifles are conducting a massive manhunt in northern Illinois for the individuals believed to be involved in the death of the three-decade member of the department and a father of four sons. (AP Photo/Michael Schmidt) Officers could be seen taking up positions on rooftops and along railroad tracks, scanning the terrain with rifle scopes and binoculars. Others leaned out of helicopters with weapons at the ready. Residents were urged to stay indoors, and schools were put on lockdown.\nAuthorities said Gliniewicz radioed in Tuesday morning to tell dispatchers he was chasing three men on foot in Fox Lake. Communication with him was lost soon after.\n\"His backup arrived shortly thereafter and found him injured with a gunshot wound,\" Covelli said. Gliniewicz died of his injuries, Covelli said.\nCORRECTS TO GLINIEWICZ FROM GLINIEWITZ- A police officer uses his scope to search for suspects in the shooting of a police officer, Tuesday, Sept. 1, 2015 in Fox Lake, Ill. Fox Lake Police Lt. Charles Joseph Gliniewicz was shot and killed while pursuing a group of suspicious men. Police with helicopters, dogs and armed with rifles are conducting a massive manhunt in northern Illinois for the individuals believed to be involved in the death of the three-decade member of the department and a father of four sons. (Brian Hill/Daily Herald via AP) MANDATORY CREDIT, MAGS OUT An emotional Fox Lake Mayor Donny Schmit described the slain officer as a personal friend, a three-decade member of the department and a father of four sons.\n\"We lost a family member,\" Schmit said of the 52-year-old officer known around town as \"GI Joe.\" ''His commitment to the people of this community has been unmatched and will be dearly missed.\"\nThe area near the Wisconsin border area is popular for boating and other outdoor pursuits because of its forest preserves and a chain of lakes that partly encircles Fox Lake. Some longtime city dwellers move to the region for what is normally a quieter lifestyle.\nCORRECTS TO GLINIEWICZ FROM GLINIEWITZ- Police on foot and in the air search for suspects in the shooting of a police officer Tuesday, Sept. 1, 2015 in Fox Lake, Ill. Fox Lake Police Lt. Charles Joseph Gliniewicz was shot and killed while pursuing a group of suspicious men. Police with helicopters, dogs and armed with rifles are conducting a massive manhunt in northern Illinois for the individuals believed to be involved in the death of the three-decade member of the department and a father of four sons. (Brian Hill/Daily Herald, via AP) MANDATORY CREDIT, MAGS OUT Authorities urged residents throughout the area to stay home while they conducted the search for three men, two of them white and the other black, aided by the canines and helicopters.\nThe service of a local commuter train was halted, and residents who wanted to take their dogs out to relieve themselves were told to stay in their homes — with the job of walking the pets handled by police officers.\nSeveral schools were placed on lockdown as a precaution Tuesday, according to Schmit. And on Wednesday, seven area schools canceled classes, Covelli said.\nGliniewicz's death is the third law enforcement fatality in Illinois this year, according to the Law Enforcement Officers Memorial Fund. It says firearms-related deaths in the U.S. are down 13 percent this year compared to the same period last year, Jan. 1. to Sept. 1; there were 30 last year and 26 this year.\nAround Fox Lake, residents expressed their own sorrow over the death of the immensely popular Gliniewicz.\n\"This particular officer is a pillar in my community and definitely going to be missed, and (he) touched so many lives,\" said Gina Maria, a 40-year-old teacher who lives in the community.\nDozens gathered for hours along a street in the village to show their support for law enforcement officers.\nThirty-year-old Dan Raminick held a sign that said \"Police Lives Matter.\" He lives a couple miles away and said officers came by Tuesday evening and thanked the crowd.\nCaitlyn Kelly, a 22-year-old student, said she felt compelled to come out after other recent police shootings. She held a sign that said \"Blue and Brave.\"", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/02/0b/1c/cc1e5d6025e6489382815474bfae3975-266b6348605e497a95ffee2acad3ca38-4.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/02/d1/7f/cc1e5d6025e6489382815474bfae3975-266b6348605e497a95ffee2acad3ca38-3.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/02/af/9d/cc1e5d6025e6489382815474bfae3975-266b6348605e497a95ffee2acad3ca38-0.jpg"], "published": "2015-09-02T10:46:00.000+03:00", "crawled": "2015-09-02T12:50:21.950+03:00", "highlightTitle": ""}