{"organizations": [], "uuid": "5591861524aacb8bf7a86f0de5f88365ecf71e37", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/09/10/travel/10intransitphoto-thursday/10intransitphoto-thursday-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT > Travel", "url": "http://www.nytimes.com/2015/09/10/travel/food-and-tour-news-oysters-in-new-york-wine-and-jambalaya-in-maine.html?partner=rss&emc=rss", "country": "US", "title": "In Transit: Food and Tour News: Oysters in New York, Wine and Jambalaya in Maine", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "In Transit: Food and Tour News: Oysters in New York, Wine and Jambalaya in Maine", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T12:45:00.000+03:00", "replies_count": 0, "uuid": "5591861524aacb8bf7a86f0de5f88365ecf71e37"}, "author": "SHIVANI VORA", "url": "http://www.nytimes.com/2015/09/10/travel/food-and-tour-news-oysters-in-new-york-wine-and-jambalaya-in-maine.html?partner=rss&emc=rss", "ord_in_thread": 0, "title": "In Transit: Food and Tour News: Oysters in New York, Wine and Jambalaya in Maine", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The cost for the event is $300 a person with a maximum of 10 participants. Reservations can be made at 212-935-3785. NEW KATSUYA RESTAURANTS IN THE MIDDLE EAST Katsuya, the popular Los Angeles-based sushi chain owned by the hospitality company Sbe and run by the sushi master Katsuya Uechi, is expanding in the Middle East. Five new locations will open late next year and in early 2017, including at the Villagio and Doha Festival City, both malls in Doha, the Mall of Egypt in Cairo and two in Dubai — one stand-alone space in the city center and another at the Madinat Jumeirah hotel. The group already has eight locations including in Kuwait, Los Angeles and Miami, but John Kolaski, the chief operating officer of Sbe Restaurants, said that branching out in the Middle East is important for the brand because of the fast-growing leisure market there. Menus at the new spots will feature Katsuya staples like miso-marinated black cod and yellowtail sashimi with jalapeño. Also, like the other restaurants, the contemporary décor is a collaboration with the designer Philippe Starck. IN LOS ANGELES, A RESTAURANT FROM MOBY The musician Moby will open a vegan restaurant called Little Pine in Los Angeles’s Silver Lake neighborhood in late October. A vegan for more than 25 years, Moby previously owned Gobo, two now-closed vegan restaurants in New York City. This new spot is a short drive from where he lives and will start by serving dinner before eventually expanding to breakfast, lunch and weekend brunch.The menu features seasonal plates in unexpected ingredient combinations like roasted beet salad with arugula and pea shoots with cashew ricotta and spicy mustard vinaigrette. A retail space near Little Pine’s entryway will sell eco-sustainable housewares and gifts from Moby’s favorite artisans. \nAdvertisement", "external_links": [], "published": "2015-09-10T12:45:00.000+03:00", "crawled": "2015-09-10T13:20:24.531+03:00", "highlightTitle": ""}