{"organizations": [], "uuid": "c802783f209b3491f96479db02e48beeaa0abc19", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-09/AN_file-21-Hajpilgrims_40af833f-b4fa-4e55-b3a7-ccf6ef8a9d7a.jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094350148/3000-Hajis-from-Yemen-reach-Makkah-despite-Houthi-obstacles?src=RSS", "country": "US", "title": "3000 Hajis from Yemen reach Makkah despite Houthi obstacles", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "3000 Hajis from Yemen reach Makkah despite Houthi obstacles | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "c802783f209b3491f96479db02e48beeaa0abc19"}, "author": "Arab News", "url": "http://www.menafn.com/1094350148/3000-Hajis-from-Yemen-reach-Makkah-despite-Houthi-obstacles?src=RSS", "ord_in_thread": 0, "title": "3000 Hajis from Yemen reach Makkah despite Houthi obstacles", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Arab News) RIYADH: Fuad Omar bin Ali bin Al-Sheikh Abu Baker minister of endowments and religious guidance in Yemen has announced that a number of Yemeni pilgrims have now reached Makkah safely thanks to the extensive efforts of the Saudi authorities. These efforts have helped them to overcome any and all obstacles and barriers put in their way by the Houthi rebels a local newspaper reported. \nThe minister noted that Saudi Arabia swiftly approved the entrance of Yemeni pilgrims into the country on Saturday at dawn contradicting the Houthi's claim to the media that the Kingdom had barred Yemeni pilgrims from entering. \n\"The first 2500 Yemeni pilgrims entered the Kingdom through the Al-Wade'ah border crossing initially. Additionally approximately 500 pilgrims reached Makkah on Sunday\" the minister was quoted as saying by the newspaper. \nAdditionally investors in the Yemeni Haj and Umrah services sector said that the number of Yemeni pilgrims expected to enter the Kingdom will amount to as many as 6000 people. This is less than the predicted quota due to Houthi efforts to restrict their freedom of movement toward the Kingdom. \nHussein bin Nasser Al-Shareef undersecretary at the Ministry of Haj said that the Kingdom under the wise leadership of Custodian of the Two Holy Mosques King Salman has harnessed all human technological and financial capabilities to serve the worshippers and pilgrims with the best services so they can perform the holy rituals in comfort and peace. \nHe said that the ministry under the guidance of Minister of Haj Bandar Hajjar safely received the Yemeni pilgrims at Al-Wade'ah crossing post and provided them with all their requirements with regard to lodging and transportation. \n\"It is our duty to ensure the comfort of the Guests of God here in Makkah and at the holy sites. In terms of the Yemeni pilgrims we take into special consideration their difficult circumstances and the government of the custodian of the Two Holy Mosques has therefore offered them all the possible means in order to make them feel comfortable and welcome here\" said the undersecretary.", "external_links": [], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-22T13:00:59.869+03:00", "highlightTitle": ""}