{"organizations": [], "uuid": "d7e5f5b29808b6db6b221e4eb35790e1b35a8b7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25890", "country": "", "title": "Rebound in Asian traffic to Africa as Ebola fears wane", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "Rebound in Asian traffic to Africa as Ebola fears wane", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "d7e5f5b29808b6db6b221e4eb35790e1b35a8b7b"}, "author": "Samuel Ng, Singapore, September 18, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25890", "ord_in_thread": 0, "title": "Rebound in Asian traffic to Africa as Ebola fears wane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Rebound in Asian traffic to Africa as Ebola fears wane Samuel Ng, Singapore, September 18, 2015 \nTHE tourism sector in Africa is seeing encouraging signs of recovery following the Ebola crisis which affected the western region of the continent last year. \n\nDave van Smeerdijk, sales and marketing director of Asilia Africa, the operator of luxury safaris in Kenya, Tanzania & Zanzibar, told TTG Asia e-Daily : “The Ebola crisis absolutely hammered us. People don’t realise that Paris and London were closer (to the Ebola-affected areas) than where we were.” \n\nAs the Ebola situation stabilises, there are positive signs of growth in the Asian traffic to Africa, according to Kim Nixon, managing director of A2A Safaris, whose clients mainly hail from Singapore and Hong Kong. \n\n“So far, we’ve had 450 clients from Singapore and our business is currently accelerating at 20 per cent per year, compounded,” said Nixon. “It was a very good measure of the level of adventurousness in Singaporeans.” \n\nAccording to Nixon, a majority of their market share consists of travellers aged 45 to 60, honeymoon couples and surprisingly, families with young children in tow. “Around 45 per cent of our clients are repeats,” he added. \n\nWith average prices of around US$10,000 per head for a seven- to eight-night safari package – excluding air tickets – many younger travellers are unable or unwilling to fork out that amount of money, he noted. \n\nAs such, A2A is shifting its focus to attract young professionals by offering high-quality experiences and accommodation at more affordable prices, explained Nixon. “The highest quality accommodation doesn’t necessarily dictate the best experience,” he remarked.", "external_links": [], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T09:20:28.076+03:00", "highlightTitle": ""}