{"organizations": [], "uuid": "ac9fa8d56999f462a3a3719cb1e6920563c8813d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/ce659f7e2f72aac42018c8de31114ad0", "site_section": "http://feeds.news.com.au/public/rss/2.0/trav_around_world_357.xml", "section_title": "NEWS.com.au | Travel | Around the World", "url": "http://www.news.com.au/travel/world-travel/police-deploying-extra-security-for-oktoberfest-amid-refugee-crisis/story-e6frfqai-1227530484647?from=public_rss", "country": "IL", "title": "Oktoberfest has a massive challenge", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Oktoberfest has a massive challenge", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T09:00:00.000+03:00", "replies_count": 0, "uuid": "ac9fa8d56999f462a3a3719cb1e6920563c8813d"}, "author": "", "url": "http://www.news.com.au/travel/world-travel/police-deploying-extra-security-for-oktoberfest-amid-refugee-crisis/story-e6frfqai-1227530484647?from=public_rss", "ord_in_thread": 0, "title": "Oktoberfest has a massive challenge", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email a friend \nMUNICH’S police are bracing themselves for a busy week ahead as the beginning of the annual Oktoberfest clashes with the presence of tens of thousands of refugees and migrants in the city. \nMore than six million people are expected to attend the 16-day event which takes place in various beer tents around Munich, which ordinarily has a population of around 1.4 million. \nBut among those dressed in lederhosen drinking Lowenbrau and eating sauerkraut, city leaders, police and refugee workers will still be battling to help the thousands of refugees that have streamed into the city to seek asylum in Germany. \nAn extra 300 police will be deployed around Munich’s Central Station where the majority of the 70,000 people who have come since the start of September have arrived. \nPolice Vice-President Werner Feiler said they aren’t sure how many refugees and migrants will turn up during the event but are working with the government, mayor and rail network to ensure things remain safe and calm. \n“I am firmly convinced that we have the whole thing under control so that the impairments are all kept as low as possible can and security can be guaranteed,” he said. \nLast week, Bavarian interior minister Joachim Hermann called for extra-reinforcements and said \n“It’s also impossible to predict how some drunken Oktoberfest visitors will behave,” he said. \nArrival numbers have dwindled in recent days after Germany introduced border controls prompting other nations to do the same, however thousands of people are building up outside Hungary seeking entrance to the European Union. \nAt Munich station, those selling lederhosen and traditional dirndl dresses seemed optimistic about the event, saying Oktoberfest revellers were happy drunks and they weren’t expecting any trouble. \nIn addition to extra cops on the beat, police will also install extra CCTV cameras to crackdown on pickpockets and “beer mug-fights” which can mar the event. The annual celebration involves eating and drinking all things German. Source: Supplied", "external_links": [], "published": "2015-09-16T09:00:00.000+03:00", "crawled": "2015-09-16T11:28:27.060+03:00", "highlightTitle": ""}