{"organizations": [], "uuid": "5966a4c7307a03bda1b86f4f4142b73c6e111965", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03452/Inspire-reception_3452744k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-30.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/cruises/riversandcanals/11789994/River-cruise-ship-review-Tauck-Inspire.html", "country": "US", "title": "River cruise ship review: Tauck Inspire", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 2, "title_full": "River cruise ship review: Tauck Inspire - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T22:03:00.000+03:00", "replies_count": 1, "uuid": "ba537d1d97a7cd4c668891dfb8baccdad8bc2a0f"}, "author": "Pat Richardson", "url": "http://www.telegraph.co.uk/travel/cruises/riversandcanals/11789994/River-cruise-ship-review-Tauck-Inspire.html#post-0", "ord_in_thread": 0, "title": "River cruise ship review: Tauck Inspire", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Overall rating 9/10 One of two new Inspiration-class river ships (there are also five Jewel-class vessels) Inspire is on a par with most European river ships in terms of size. However she has fewer, larger cabins and one of the highest staff-to-guest ratios on Europe’s rivers. • Danube river cruise guide Style/character 10/10 Plush and polished the ship delivers a luxe hotel ambience. Cruising is all-inclusive, staff are attentive, fellow (mostly American) passengers were friendly and the dress code is relaxed. Cruise directors deliver a carefully curated experience on board and ashore, which removes any potential wrinkles. The ship's reception area Cabins 10/10 Contemporary and elegant, all suites and cabins have mood and task lighting, generous storage, TV on demand, a minibar and coffee-maker, plus robes and fresh flowers. Beds have hypoallergenic pillows and bathrooms feature fittings by Grohe and Villeroy & Boch, heated floors and wall cabinets with doors mirrored inside and out. There are 22 suites measuring 300 sq-ft, which can accommodate three people. Those on the two uppermost decks have French balconies. The lowest deck has both smaller cabins, each with a high-set, shallow window, and innovative split-level light-filled loft cabins, with extensive windows stretching the full height of the deck above. A lift serves all decks except the sun deck. At your leisure 9/10 A resident pianist plays in the Panorama lounge/bar which has a small dance floor. Facilities run to a small library (more destination books would increase guests’ enjoyment of towns and sites with rich history and culture), a spa with steam room and sauna, a small fitness centre and massage room and a salon. There’s also a putting green and Jacuzzi, plus bikes for use ashore. Excursions 9/10 Pre-tour “discovery briefings” provide background detail for expert-led small-group shore excursions. Exclusive events, such as dinner at Reichenstein Castle in the Rhine valley, are also organised. Food and drink 9/10 Imaginative canapés are served with drinks during cocktail hour. Food was outstanding and beautifully presented. Excellent wines are offered with lunch and dinner. The open-seating Compass Rose restaurant serves an extensive breakfast buffet and lunch, complemented by menu options. Dinners begin with an amuse-bouche and run to four courses. Arthur’s, a relaxed alternative lunch and dinner venue, with limited indoor and outdoor seating, also serves an early risers’ breakfast and has a 24-hour hot-drinks station. Room-service breakfast is available in suites; all guests can order room-service snacks. Compass Rose restaurant Value for money 9/10 Wi-Fi is complimentary. At some ports, free buses shuttle guided and independent explorers back to the ship at staggered times. MS Inspire is cruising the Rhine and Moselle between Amsterdam and Basel from April to October 2016. From £2,830pp for a seven-night itinerary and from £3,155pp for 12 nights (0800 810 8020; tauck.co.uk ). Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-09-30T22:03:00.000+03:00", "crawled": "2015-09-30T21:11:20.574+03:00", "highlightTitle": ""}