{"organizations": [], "uuid": "cf8ab5d39b655330addcd9629a2993b88e8f4363", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.theprovince.com", "main_image": "http://www.theprovince.com/cms/binary/11332089.jpg", "site_section": "http://rss.canada.com/get/?F7504", "section_title": "The Province - Travel", "url": "http://www.theprovince.com/travel/Concerns+grow+about+hikers+behaving+badly+Appalachian+Trail/11332087/story.html", "country": "CA", "title": "Concerns grow about hikers behaving badly on Appalachian Trail", "performance_score": 0, "site": "theprovince.com", "participants_count": 0, "title_full": "Concerns grow about hikers behaving badly on Appalachian Trail", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T22:51:00.000+03:00", "replies_count": 0, "uuid": "cf8ab5d39b655330addcd9629a2993b88e8f4363"}, "author": "", "url": "http://www.theprovince.com/travel/Concerns+grow+about+hikers+behaving+badly+Appalachian+Trail/11332087/story.html", "ord_in_thread": 0, "title": "Concerns grow about hikers behaving badly on Appalachian Trail", "locations": ["Baxter State Park", "Newton", "Mt. Katahdin", "Maine", "Ma."], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Alanna Durkin", "Jesse Metzler"], "text": "By Alanna Durkin, The Associated Press Jesse Metzler, 19, of Newton, Ma., celebrates on the top of a sign marking the northern terminus of the Appalachian Trail at the summit of Mt. Katahdin in Baxter State Park, Maine. \nBAXTER STATE PARK, Maine — When Jackson Spencer set out to tackle the Appalachian Trail, he anticipated the solitude that only wilderness can bring — not a rolling, months-long frat party. \nShelters where he thought he could catch a good night’s sleep while listening to the sounds of nature were instead filled with trash, graffiti and people who seemed more interested in partying all night, said Spencer, who finished the entire trail last month in just 99 days. \n“I wanted the solitude. I wanted to experience nature,” he said. “I like to drink and to have a good time, but I didn’t want that to follow me there.” \nSpencer, or “Mission” as he is known to fellow thru-hikers, confronted what officials say is an ugly side effect of the increasing traffic on the Georgia-to-Maine footpath every year: More people than ever causing problems. \nAt Maine’s Baxter State Park, home to the trail’s final summit on Mount Katahdin, officials say thru-hikers are flouting park rules by openly using drugs and drinking alcohol, camping where they aren’t supposed to, and trying to pass their pets off as service dogs. Hundreds of kilometres away, misbehaving hikers contributed to a small Pennsylvania community’s recent decision to shutter the sleeping quarters it had offered for decades in the basement of its municipal building. A group of section-hikers pose for a photo on a logging road outside Baxter State Park before continuing on the Appalachian Trail to Mt. Katahdin, in background. Caroline Roy, of Robertville, New Brunswick, her daughter Jolene 10, and Maxime, 12, prepare lunch outside a small store near Baxter State Park,in Maine, one day before hiking to the summit of Mt. Katahdin. Appalachian Trail thru-hiker Karl Berger rests at a campsite in Maine’s Baxter State Park, a day before completing the 3522-km hike. Berger’s beard attests to the months he spent hiking the Appalachian Trail. \nRon Tipton, executive director of the Conservancy, said the vast majority of thru-hikers are respectful and on the trail for the right reasons. He said he believes that the sharp increase in hikers has simply made it more challenging to deal with the behaviour of a few. \nHis group has implemented several initiatives to deal with the surge in trail use, such as encouraging people to start the path at different spots to better distribute hikers. It also recently held a meeting with Baxter officials to address the concerns about hiker behaviour and is dedicated to resolving the issues, Tipton said.", "external_links": [], "published": "2015-09-01T22:51:00.000+03:00", "crawled": "2015-09-02T00:56:17.192+03:00", "highlightTitle": ""}