{"organizations": [], "uuid": "c81874b2bc2d2f1b8551ab14f29c9d4de5e5ce2b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.forbes.com", "main_image": "{{meta.image}}", "site_section": "http://www.forbes.com/travel/", "section_title": "Forbes - Travel Information and Travel News - Forbes.com", "url": "http://www.forbes.com/sites/ewanspence/2015/09/28/how-many-iphone-6s-did-apple-sell/", "country": "US", "title": "iPhone 6S Activations 'Down Forty Percent' Against iPhone 6", "performance_score": 0, "site": "forbes.com", "participants_count": 1, "title_full": "iPhone 6S Activations 'Down Forty Percent' Against iPhone 6", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T23:32:00.000+03:00", "replies_count": 0, "uuid": "c81874b2bc2d2f1b8551ab14f29c9d4de5e5ce2b"}, "author": "Ewan Spence", "url": "http://www.forbes.com/sites/ewanspence/2015/09/28/how-many-iphone-6s-did-apple-sell/", "ord_in_thread": 0, "title": "iPhone 6S Activations 'Down Forty Percent' Against iPhone 6", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Now that all the noise and bluster of the iPhone 6S and iPhone 6S Plus launch is over, just how well have Apple's latest smartphones performed out of the gate? Mobile Marketing technologists Fiksu note the iPhone 6S Plus is following a similar level of user activations to last year's iPhone 6 Plus, but the smaller iPhone 6S is lagging behind the iPhone 6 rate by forty percent.[caption id=\"attachment_21194\" align=\"\" width=\"1024\"] Relative iPhone Activation Rate From Launch (data and image: fiksu.com)[/caption]With the phablet form factor smartphone growing at the same level this year compared to last year, there's an obvious correlation of users who prefer the larger screens as a proportion of the buying audience. As users come to buy a new large-screened device the similar pricing will push people towards the 6S Plus - this is not a market for people looking for a bargain, so the reduced price on the 6 Plus is less of a factor. The iPhone 6S Plus is attracting the phablet faithful, but there's no acceleration or greater demand from last year.Alternatively Apple might simply be constraining the stock levels of the 6S Plus to the same level as the 6 Plus.[caption id=\"attachment_21136\" align=\"\" width=\"1024\"] Apple iPhone 6S (image: Ewan Spence)[/caption]The iPhone 6S adoption rate of 1.8% compares poorly to the iPhone 6 adoption rate of 1.1%. There's an argument that says the iPhone 6S is not as successful as the iPhone 6, but I think the real indicator is not the comparison to the iPhone 6, but the iPhone 5S. As people come off their two-year contracts and look for a new smartphone, how many are choosing the iPhone 6S?With the iPhone 5S achieving a 0.7% adoption rate, and the iPhone 6S on 1.8%, more people are switching to Apple in this two-year contract cycle. With the iPhone 6 and the iPhone 6S addressing different pools of consumers each year, Apple is continuing to build its user base with the 6S, although it is still slightly down on the iPhone 5 to iPhone 6 rate. How this translates to market share remains to be seen, but the raw data look promising.[gallery2012] Fiksu's data comes from monitoring the level of activations and handsets in circulation through analysis of app usage.( Now read my review of the iPhone 6S ).", "external_links": ["https://dashboard.fiksu.com/iphone_since_launch", "https://www.fiksu.com/"], "published": "2015-09-28T23:32:00.000+03:00", "crawled": "2015-09-28T18:53:40.160+03:00", "highlightTitle": ""}