{"organizations": [], "uuid": "02c5df1985be7703cc99677975478465abad8142", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64337/american-airlines-goes-pink-purpose-october", "country": "US", "title": "American Airlines Goes Pink For A Purpose In October", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "American Airlines Goes Pink For A Purpose In October", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T16:42:00.000+03:00", "replies_count": 0, "uuid": "02c5df1985be7703cc99677975478465abad8142"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/64337/american-airlines-goes-pink-purpose-october", "ord_in_thread": 0, "title": "American Airlines Goes Pink For A Purpose In October", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Employees fight breast cancer together by raising awareness American Airlines Goes Pink For A Purpose In October     \nAmerican Airlines and its more than 100,000 employees tomorrow will launch Be Pink, the employee-led breast cancer awareness initiative that takes place each October during Breast Cancer Awareness Month. Raising awareness about breast cancer and helping raise money to finance breast cancer research through Susan G. Komen® is a critical mission for team members since breast cancer accounts for one in nearly one in three cancers diagnosed in the U.S. \nAll month, American's customers will have the opportunity to join employees' efforts to promote awareness and action against breast cancer. Customers who make a minimum $25 donation to American's Miles for the Cure® program will earn 20 AAdvantage® miles, instead of 10, for each dollar contributed. Donations can be made at aa.com/bepink. Customers can also expect to experience Be Pink during their journey. They will see many of American's employees wearing Be Pink accessories – ties, socks, scarves – as part of their uniform as one of the many employee fundraisers. They can also select special Be Pink-branded items, including lemonade served onboard aircraft and Be Pink menu items served in select Admirals Club lounges. This fall will mark the 21st year that American has presented the American Airlines Celebrity Golf and Tennis Weekend. The event will be held later this month and has raised more than $11.5 million for Komen since its inception in 1995. American has supported the fight against breast cancer for more than 30 years and is the Official Airline of Susan G. Komen. In 2014, American raised more than $1 million to support the cause through the generosity of employees, customers and corporate contributions. Customers can visit aa.com/bepink to learn more about joining the company's efforts to create a world without breast cancer. \nSuzanne George's story American's involvement in the fight against breast cancer is especially meaningful this year to employee Suzanne George, a 26-year reservations agent.Last spring, doctors diagnosed George's daughter Sarah, 27, with one of the most aggressive and least-researched forms of the disease – inflammatory breast cancer (IBC). It had already spread to her liver and bones by the time it had been discovered. \nGeorge and her daughter sought help at the world's only research center that specializes in IBC – the Morgan Welch Inflammatory Breast Cancer Research Program and Clinic at The University of Texas MD Anderson Cancer Center in Houston, which was founded in part with grant money from American through Susan G. Komen. \n\"The very clinic that had oversight of our daughter's treatment was supported by this Komen grant, so American's charitable support of Komen had a direct bearing on Sarah's care,\" George said. In August, less than one year after starting chemotherapy treatment at the clinic, Sarah had an x-ray that showed her tumors no longer showed a significant cancer presence. While her mother knows Sarah's fight is not over, she is encouraged by this small victory. \"During all the past years participating in Be Pink, I never could have imagined that my daughter's very survival could rest on cutting-edge breast cancer research supported by my American family,\" George said. \"I am humbly and sincerely grateful for American and Komen's support for the IBC clinic.\" \nAbout Susan G. Komen® Susan G. Komen is the world's largest breast cancer organization, funding more breast cancer research than any other nonprofit while providing real-time help to those facing the disease. Since its founding in 1982, Komen has funded more than $889 million in research and provided $1.95 billion in funding to screening, education, treatment and psychosocial support programs serving millions of people in more than 30 countries worldwide. Komen was founded by Nancy G. Brinker, who promised her sister, Susan G. Komen, that she would end the disease that claimed Suzy's life. \nAbout American Airlines American Airlines Group (NASDAQ: AAL) is the holding company for American Airlines and US Airways. Together with regional partners, operating as American Eagle and US Airways Express, the airlines operate an average of nearly 6,700 flights per day to nearly 350 destinations in more than 50 countries. American is a founding member of the oneworld alliance, whose members and members-elect serve nearly 1,000 destinations with 14,250 daily flights to 150 countries. This year American topped Fortune Magazine's list of best business turnarounds and its stock was added to the S&P 500 index.", "external_links": [], "published": "2015-09-30T16:42:00.000+03:00", "crawled": "2015-09-30T21:51:03.548+03:00", "highlightTitle": ""}