{"organizations": [], "uuid": "7c15c0ef7162b137003b45b8b94a0e1b4db47803", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.wopular.com", "main_image": "", "site_section": "http://www.wopular.com/rss/sections/11334", "section_title": "RSS: travel", "url": "http://www.wopular.com/meet-helene-darroze-worlds-best-female-chef", "country": "US", "title": "Meet Helene Darroze, world's best female chef", "performance_score": 0, "site": "wopular.com", "participants_count": 1, "title_full": "Meet Helene Darroze, world's best female chef", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T17:47:00.000+03:00", "replies_count": 0, "uuid": "7c15c0ef7162b137003b45b8b94a0e1b4db47803"}, "author": "senh", "url": "http://www.wopular.com/meet-helene-darroze-worlds-best-female-chef", "ord_in_thread": 0, "title": "Meet Helene Darroze, world's best female chef", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "BING NEWS: Meet Helene Darroze, world's best female chef On this month's episode of Culinary Journeys we follow French chef Helene Darroze to Edinburgh, where she samples a traditional Scottish dish -- haggis. Show premieres September 4 on CNN International at 1630 BST/1730 CET and 2330 BST/0030 CET. Learn more ... 09/3/2015 - 6:00 pm | View Link Meet Hélène Darroze, the single mom who's the world's best female chef She's the culinary expert whose calm cooking style inspired the character of Chef Colette in the hit animated film Ratatouille and now Hélène Darroze has been immortalized again, named as the world's best female chef. The French phenom, who is head chef ... 06/9/2015 - 1:00 pm | View Link Darroze named top female chef A FRENCH chef has spoken of her “honour” at being named world’s best female chef 2015. Hélène Darroze, a judge on French broadcaster M6’s reality culinary show Top Chef and who is also said to have inspired the tough-but-warm-hearted chef Colette ... 04/24/2015 - 11:01 pm | View Link Top female chefs: meet London's kitchen queens as the Savoy Grill appoints its first ever female head chef Recently voted the world’s best female chef in the World’s 50 Best awards (worlds50best.com), Hélène Darroze runs a Michlein-starred restaurant in Paris as well as two-Michelin starred Hélène Darroze at The Connaught (the-connaught.co.uk). 04/24/2015 - 5:04 am | View Link Meet CERN’s new director general, Fabiola Gianotti: the most intelligent woman in the world One of the world’s most distinguished physicists ... I know it is not always the case that women get the top jobs and some of my female colleagues did encounter problems. Science is not a perfect world for women. But my gender has not affected me.", "external_links": [], "published": "2015-09-08T17:47:00.000+03:00", "crawled": "2015-09-08T19:26:02.764+03:00", "highlightTitle": ""}