{"organizations": [], "uuid": "6d5c0d8de8d7b3564d4d744ef7e9f3aebd132383", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29991516/cirrus-aircraft-introduces-cirrus-perspective-touch-by-garmin-for-vision-sf50", "country": "US", "title": "Cirrus Aircraft Introduces Cirrus Perspective Touch™ by Garmin® for Vision SF50®", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Cirrus Aircraft Introduces Cirrus Perspective Touch™ by Garmin® for Vision SF50® - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "6d5c0d8de8d7b3564d4d744ef7e9f3aebd132383"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29991516/cirrus-aircraft-introduces-cirrus-perspective-touch-by-garmin-for-vision-sf50", "ord_in_thread": 0, "title": "Cirrus Aircraft Introduces Cirrus Perspective Touch™ by Garmin® for Vision SF50®", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Cirrus Aircraft\nDULUTH, Minn. , Sept. 9, Cirrus Aircraft today introduced a new era of avionics designed specifically for the new Vision SF50 Personal Jet: Cirrus Perspective Touch by Garmin. Created in collaboration with Garmin International Inc., this revolutionary new touchscreen-based flight deck sets the new standard in performance, personalization, safety and ease of use for operators.\nCirrus Perspective Touch incorporates the latest turbine-class flight deck technologies into a newly designed, pilot-friendly touchscreen interface that was custom built for the Vision Jet cockpit. The avionics suite includes dual oversized widescreen flight displays with multi-pane capabilities and offers the following standard or optional features: synthetic vision, real-time weather radar, a digital automatic flight control system, electronic stability control while hand-flying, automatic pressurization scheduling, automated system alerts, graphical depictions of aircraft system status, integrated weight and balance, global datalink weather, satellite phone and text messaging, enhanced runway awareness, integrated backup instrument display and more. The three landscape touchscreen controllers give pilots easy to understand, quick access to flight and systems information in a thoughtful, ergonomically inspired panel layout. All of these features, combined with Williams International's FJ33 Full Authority Digital Engine Control (FADEC), result in Cirrus Perspective Touch setting the new standard for turbine flight decks.\n\"Cirrus Perspective Touch is the latest example of our pursuit of transformational innovation, state of the art safety and the unique creativity in functional design that sets Cirrus apart,\" said Pat Waddick , President of Innovation and Operations at Cirrus Aircraft. \"Every single Cirrus ever delivered has had Garmin avionics on board. Not only does that partnership continue with the Vision Jet, but with Cirrus Perspective Touch we are taking integration and the pilot-airplane interface to a level never before seen in general aviation. Our owners and operators are going to be stunned at the capability and intuitive operation of this flight deck.\"\nPersonalization and ease of use are hallmarks of Cirrus Perspective Touch. The new flight deck enables pilots to personalize the layout of the Primary Flight Display (PFD), Multifunction Display (MFD) and touchscreen controllers based on their personal preferences for individual phases of flight. The inclusion of three touchscreen controllers accessible by the pilot, as compared to one or two, increases the speed at which a wide range of aircraft systems and functions can be accessed. Unique to Cirrus Perspective Touch is quick access to three separate modes on each touchscreen controller, which simplifies the pilot's ability to both input and retrieve flight information by reducing the need for multiple sub-menus. The icon-based user interface on the touchscreen controllers gives pilots the same familiarity they have with their smartphones and tablet devices, including the popular QWERTY keyboard layout for data entry.\n\"Simply put this avionics suite is intuitively designed, user-friendly and will provide an exceptional flying experience for any pilot,\" said Todd Simmons , President of Customer Experience at Cirrus Aircraft. \"The premium turbine capabilities of this flight deck and ease of interfacing between pilot and airplane is remarkable. We are so excited to share Cirrus Perspective Touch with the general aviation community and our Vision SF50 pilots,\" concluded Simmons.\n\"Cirrus Perspective Touch by Garmin combines industry-leading features with our latest technology to provide Cirrus customers an elite flight deck experience, to make flying both safer and more enjoyable,\" said Carl Wolf , Garmin Vice President of Aviation Marketing and Sales. \"The Garmin / Cirrus Aircraft strategic relationship continues to find new ways to innovate and delight our mutual customers.\"\nThe Vision SF50 Personal Jet continues its march towards first customer delivery. The program recently achieved Type Inspection Authorization (TIA), an important milestone on the path to FAA Type Certification. Three conforming test aircraft fly a wide array of flight test profiles in the skies above the Duluth, Minnesota -based company on a daily basis. The Cirrus Airframe Parachute System® (CAPS®), which will be standard on every Vision SF50, has successfully completed two phases of testing and enters the third and final phase in the upcoming weeks.\nFor more information visit cirrusaircraft.com .\nAbout Cirrus Aircraft\nCirrus Aircraft is a recognized leader in general aviation. Its all-composite line of personal aircraft - the SR20, SR22 and the turbocharged SR22T - incorporate innovative and advanced performance, electronic and safety technologies, including Cirrus Perspective™ by Garmin® avionics and the unique Cirrus Airframe Parachute System® (CAPS®). To date, total time on the worldwide Cirrus Aircraft SR-series fleet surpassed seven million flight hours with 107 people returned to their families as a direct result of CAPS being a standard safety feature on all Cirrus aircraft. The Cirrus Vision SF50®, with over 550 production positions reserved, will provide a new personal and regional business transportation solution: the personal jet. The Vision Center in Knoxville, TN will be the flagship location for all Cirrus Aircraft Customer Experience activities including sales, delivery, training, maintenance, support, personalization, fixed base operations and more. All Cirrus aircraft are made in the U.S. with a direct sales force in North America and authorized sales centers covering export markets in 60 countries around the world. Cirrus Design Corporation d/b/a Cirrus Aircraft is wholly owned by China Aviation Industry General Aircraft Co., Ltd (CAIGA). Cirrus, Perspective, Perspective Touch, Vision, Vision SF50 and CAPS are trademarks of Cirrus Industries, Inc. or its subsidiaries. All other brands, product names, company names, or trademarks are the properties of their respective owners. All rights reserved. For additional information on Cirrus and its products please visit cirrusaircraft.com .\nPhoto - http://photos.prnewswire.com/prnh/20150909/264955\n releases/cirrus-aircraft-introduces-cirrus-perspective-touch-by-garmin-for-vision-sf50-300140072.html\n ", "external_links": ["https://photos.prnewswire.com/prnvar/20150909/264955", "http://photos.prnewswire.com/prnh/20150909/264955", "http://www.xmlnews.org/ns/", "http://cirrusaircraft.com/innovation/perspective-touch/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG97522&Transmission_Id=201509091235PR_NEWS_USPR_____CG97522&DateId=20150909", "http://cirrusaircraft.com/", "http://www.prnewswire.com/news-releases/cirrus-aircraft-introduces-cirrus-perspective-touch-by-garmin-for-vision-sf50-300140072.html"], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T19:59:03.717+03:00", "highlightTitle": ""}