{"organizations": [], "uuid": "c96c6a0bce4bd129856f2d8358d4adfd7b7a379d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/smartertravel/headshot.jpg", "site_section": "http://www.huffingtonpost.com/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/smartertravel/10-new-rules-for-finding_b_8161038.html", "country": "US", "title": "10 New Rules for Finding Cheap Flights", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "10 New Rules for Finding Cheap Flights", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T00:16:00.000+03:00", "replies_count": 0, "uuid": "c96c6a0bce4bd129856f2d8358d4adfd7b7a379d"}, "author": "SmarterTravel", "url": "http://www.huffingtonpost.com/smartertravel/10-new-rules-for-finding_b_8161038.html", "ord_in_thread": 0, "title": "10 New Rules for Finding Cheap Flights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Early boarding (an alternative to an advance seat assignment on some airlines). Preferred extra-legroom seating. Waived ticket change fee. No or minimal same-day standby fee for earlier flight. \nNote any airlines on which you are trying to pile up miles, or if have frequent flyer status or a credit card that covers some or all of these options. \nRELATED: World's Scariest Airports Narrow Your Search Quickly \nBecause you have to check more sources than ever before, you need to limit the workload as much as you can. Start your search with an aggregator to identify the feasible schedules and flight options. There's no point in looking at Southwest if you want to fly to Charleston, WV, Pittsburgh, or Shreveport, for example, because it doesn't fly there or anywhere close. \nBut don't ignore the outliers. Some search systems do not identify routes and schedules of Allegiant and Southwest. Chances are, however, that if Allegiant is a possibility, you know about it—and it's probably your only nonstop option . Expect a Connection \nYou will often find that your cheapest option is for a connecting itinerary rather than a nonstop. From my home airport in Medford, Oregon, for example, a mid-September round-trip fare to San Francisco is cheaper via Seattle ($240, five hours and five minutes, 1,031 total miles) than on a nonstop ($413, one hour and 18 minutes, 329 total miles). \nIf you check peak season transatlantic fares, you may well find that the cheapest option is via Kiev, Moscow, or Istanbul. Most cases aren't as extreme as these, but you have to decide whether you'd accept a connecting itinerary, with all the extra time, risks, and hassles , to knock some big dollars off your cost. \nRELATED: 7 Airfare Booking Mistakes You're Probably Making You Can't Rely on the Aggregators \nYou need to compare the all-up costs of taking the trip you want, including extras. Unfortunately, the familiar aggregators and online travel agencies you used to rely on are no longer able to find the cheapest ticket that includes the combination of the extras you want. So, for each feasible itinerary, you have to check fares and extra fees on each airline's website. Look at both the lowest fares and the optional bundled fares, look up the fees for any unbundled extras, and note any extras your frequent flyer status or credit card cover. The Lowest Fare Isn't Always the Cheapest \nThe airline with the lowest base fare is not necessarily the cheapest after you figure in the extras you want. The most obvious case in point is Southwest: If you intend to check a bag or bags, round-trip, its no-charge policy for two bags gives it a minimum $50 cushion over any competitor that charges the usual $25 per bag each way. Similarly, you may find that some airlines' bundles result in a lower total cost than others' individually priced fares and extras. \nRELATED: 7 Secrets of Ultralow Airfares Buy and Cancel \nIf you find what looks like a good deal early in your search, you might want to go ahead and \"buy,\" knowing that as long as you're looking more than a week in advance, you can cancel within 24 hours without penalty. Then keep on looking for a better deal. Quality Matters \nThis one doesn't show up on many lists, but it can be important. There are noticeable product quality differences in coach/economy among airlines. \nCarriers like JetBlue , Virgin America , and Alaska are niche players that compete on quality along with price. Flying on one of those lines may well be worth a few bucks more than flying on any of the \"big three\" giant network airlines or a low-fare airline. In Europe, Turkish has a somewhat similar reputation. \nOn the other hand, Spirit , Frontier , and Allegiant are quality bottom-feeders. Most people would probably choose to fly them only if fares or schedules are much better than options available on other lines. Ryanair is the equivalent in Europe. Air Transat (some planes), Meridiana, and XL Airways are bottom-quality transatlantic operations. \nRELATED: What You Should Know Before Flying Spirit Airlines Seniors Must Check Southwest \nTravelers age 65 or over should always check Southwest. It's the only North American airline with useful senior fares. Time was, seniors could usually get a lower Southwest fare with an any-age ticket than on the senior fare, but now those low any-age tickets sell out well in advance, and the senior fares look better all the time. Avoid Penalty Fees On many airlines—especially low-fare airlines—fees for checked bags, carry-on bags, seat assignments, printing a boarding pass, and other functions escalate as you progress from initial purchase to boarding the flight. \nOn Spirit, for example, if you want to check a bag, you pay $30 when you first book, $35 if you pay online after the initial booking, $40 during online check-in, and $50 at the airport. You can print a boarding pass free at home, but pay $2 at an airport kiosk or $10 at an agent station. Other low-fare lines follow similar pricing systems. \nClearly, once you have identified what you want in the way of extras, pay for them as soon as feasible. There's no reason to wait until you have to pay what amounts to a \"delay of game\" penalty. \nRELATED: 9 Worst Airline Ripoffs Airfare Sales Are Back \nAfter several years of inactivity, you can see some indications that limited-time airfare sales are back. Typically, you have only a short time—maybe even just a few days or a week—to buy promotionally priced tickets, but several months to fly. \nThe return of sales, however, poses something of a quandary: Do you buy up to three months in advance, as some old rules advocate, or sit around waiting for a sale? We have no ready answer there. The best advice: When you see a really good deal, pounce on it. More from SmarterTravel", "external_links": [], "published": "2015-09-19T00:16:00.000+03:00", "crawled": "2015-09-19T00:48:48.044+03:00", "highlightTitle": ""}