{"organizations": [], "uuid": "232e4953fcd4eaa78a6a59dd0ba713975fa4b788", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29997596/raben-group-implements-hub-location-with-ubisense", "country": "US", "title": "RABEN Group Implements Hub Location with Ubisense", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "RABEN Group Implements Hub Location with Ubisense - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "232e4953fcd4eaa78a6a59dd0ba713975fa4b788"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29997596/raben-group-implements-hub-location-with-ubisense", "ord_in_thread": 0, "title": "RABEN Group Implements Hub Location with Ubisense", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Ubisense Group Plc\nCAMBRIDGE, England , September 10,\nRaben Netherlands enhances Hub platform to smart Hub\nUbisense, a leader in enterprise location intelligence solutions, today reported the completion of a new customer project in the logistics sector.\nUsing Ubisense RTLS hardware and Location Platform the Cologne based reseller VLS Engineering equipped Raben Group main Hub location in the Netherlands with a cutting-edge video infrastructure.\nRaben installed around one hundred cameras in- and outside the platform. Managers now have a full one hundred percent coverage of all major loading and unloading areas, storage locations, and entrances.\nThe aim was to improve logistics processes, to increase the safety of goods handled, and completely document all the services.\nThe company uses the Ubisense location intelligence solutions to structure the cameras' data streams, to index it, and to make searchable their contents.\nThe system puts a marker onto the video stream and records place and timecode any time an employee scans any barcode. Next the VLS solution links video recording, dataset, and barcode within the warehouse management system.\nIf an employee needs to find a specific cargo he types the barcode into a search window. Then the video system automatically provides an image of the last barcode scan. Starting at this image the employee can watch the recordings and follow the cargo's way through the freight centre.\n\"We can now see in high detail the loading and unloading of our clients consignments on the docks. With one hundred percent coverage of the handling areas, we are now able to monitor any cargo from inbound all the way to the outbound and it's loading on the departing truck\", says Steven Vossenaar, Quality & Risk Manager, Raben Netherlands B.V.\n\"Our first goal was to improve processes and efficiency within the warehouses. Second we can prove to our clients which consignments received us in what state. And we can ensure them that we preceded their goods appropriate, handled them carefully and loaded everything on the truck correctly. This system is our documentation for secure and efficient processes. This really differentiates us from our competitors. The video system brings us on top of the bill, we are now leading in this area of the market.\"\n\"A dataset alone is no real proof for accurate processes. That is a weak point of warehouse management systems. But a video recording is a documentation that proofs everything arrived as it should have,\" says Udo Rieger , Director VLS Engineering GmbH. \"Our focus is to visualise interfaces at the liability transition points. We enable our customers to proof and document what happened to each package from arrival to reloading in their freight centre.\"\nTo do so VLS connects its video technology and Ubisense's enterprise location intelligence. \"The ROI of our solutions lies between twelve and sixteen month depending on the amount and value of the transported goods,\" Rieger carries on.\n\"With increasing pressure to streamline operations, reduce cost and improve effectiveness and quality, businesses around the globe are looking for new and innovative ways to leverage technology,\" says Adrian Jennings , Vice President Industry Strategy, Ubisense. \"Ubisense is helping companies to track high value assets and drive significant operational improvements, while allowing for increased operational complexity. The VLS solution for the logistics sector is enabling companies like Raben to do exactly that.\"\nBenefits by VLS location intelligence solutions based on Ubisense are:\nimproving process chains introduction and monitoring of new and transparent processes customers get proof of quality improved documentation at points of liability transfer reduced errors and improved delivery rates reduced insurance costs educating employees' awareness of resources and goods\nVLS Engineering develops software-based production and process visualization solutions for the logistics industry. We are the inventors of \"Visual Location Management System\" (VLMS). Global logistics companies rely on our solutions for visualization, analysis and documentation of dynamic processes and the corresponding interface between people and technology.\nRaben Group has been rendering services on the logistics market for over 80 years. It offers comprehensive logistics services - contract logistics, road transport: domestic and international, including to Eastern Europe . The Group also provides services for fresh products which require temperatures from 0 to 6 degrees in the whole logistics chain, full truck load transports, intermodal transports, as well as sea and air freight. The Group has branches in 10 countries of Europe and approx. 1,000,000 m 2 of warehouse capacity.\nUbisense is a global leader in real time enterprise location intelligence solutions. The company's expertise and solutions enable companies to improve operational effectiveness, increase efficiency and boost profitability. Latest location technology offers companies endless possibilities.\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=enUK201509108907&Transmission_Id=201509100527PR_NEWS_USPR_____enUK201509108907&DateId=20150910", "http://www.xmlnews.org/ns/"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-10T13:27:49.040+03:00", "highlightTitle": ""}