{"organizations": ["Michael Smith Celeb Travel"], "uuid": "de42f6d4615239d44b514ba5bb62a55359b03e9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.edmontonsun.com", "main_image": "http://storage.edmontonsun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297746856341_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.edmontonsun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.edmontonsun.com/2015/09/10/opening-inn-at-bay-fortune-a-dream-come-true-for-chef-michael-smith", "country": "CA", "title": "Opening Inn at Bay Fortune a 'dream come true' for chef Michael Smith", "performance_score": 0, "site": "edmontonsun.com", "participants_count": 0, "title_full": "Opening Inn at Bay Fortune a 'dream come true' for chef Michael Smith", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T22:39:00.000+03:00", "replies_count": 0, "uuid": "de42f6d4615239d44b514ba5bb62a55359b03e9f"}, "author": "", "url": "http://www.edmontonsun.com/2015/09/10/opening-inn-at-bay-fortune-a-dream-come-true-for-chef-michael-smith", "ord_in_thread": 0, "title": "Opening Inn at Bay Fortune a 'dream come true' for chef Michael Smith", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Celeb Travel \nMichael Smith can't contain his excitement about his newest project: reinventing the Inn at Bay Fortune in Prince Edward Island. \n\"Opportunity knocked over the winter\" and the chef and TV personality purchased the 17-room inn, which was built in 1913. \n\"The biggest thing now for me is this new inn project and really reorganizing my life because it is a dream come true and it is a labour of love and I really, really enjoy being back in that world,\" Smith says. \n\"While I'm not the actual chef of the property -- we've got a great chef and a great team -- I'm intimately engaged on a daily basis with what's going on, really enjoying noodling the details, thinking it through and how can we make it special and unique. \n\"We really do have global ambitions for the project. We want it to be one of Canada's very best.\" \nOur gardens are coming in nicely, thanks to our farmers Jeff and Carey! #InnStyle #FireWorksFeast @chefmichaelsmith Posted by The Inn at Bay Fortune on Thursday, July 16, 2015 \nEarly in his career, Smith worked at the inn, focusing on local and regional fare. The first TV series he hosted, \"The Inn Chef,\" was filmed there and his first cookbook of the same name was published in 2000. \nDespite a late construction start, due to heavy snowfall and late spring on the Island, the place opened in late June. \n\"We kind of built it on the fly and jumped into the deep end of the pool,\" says Smith. \"We've been sold out ever since, which comes with its own challenges.\" \nGardeners were hired to relaunch the organic farm and grow all the vegetables for the inn -- the salad served the previous evening contained 56 ingredients, Smith boasts. \nFireWorks is the name of the restaurant and method of cooking. \n#InnStyle Posted by The Inn at Bay Fortune on Friday, June 26, 2015 \n\"We've built a 25-foot-long wood-burning fire-breathing beast that has every form of fire known to man in it. There's seven ways to cook with fire,\" Smith says, including rotisserie, smokehouse, grill and open hearth. \nFireWorks offers guests a communal family-style \"feast\" experience, which Smith says is \"a celebration of Prince Edward Island, of course, of our farm, of our cooks and the fires and everything.\" \nPrior to dinner, appetizer stations are set up around the farm, garden and outdoor fire pit. Fortune Bay oysters grown in front of the inn are shucked and served in the old kitchen where Smith filmed \"The Inn Chef.\" Dinner is served at communal cherry butcher block tables with a view of the bay. \nIn the past, the inn -- unequipped for winter -- was not open past Thanksgiving, but Smith has plans to open weekends through the fall after the holiday. Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions . Top stories", "external_links": [], "published": "2015-09-10T22:39:00.000+03:00", "crawled": "2015-09-11T02:57:04.520+03:00", "highlightTitle": ""}