{"organizations": [], "uuid": "a578d8c21945694579f73fdd396cdeae35682d0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.vogue.com", "main_image": "http://www.vogue.com/wp-content/uploads/2015/09/19/03-khloekardashian-armenia-trip1.jpg", "site_section": "http://www.vogue.com/living/", "section_title": "Living: Weddings, Interior Design, Food, Travel, and Parties - Vogue", "url": "http://www.vogue.com/13349888/travel-guide-kardashians-armenia", "country": "US", "title": "6 Places the Kardashians Visited in Armenia’s Capital", "performance_score": 0, "site": "vogue.com", "participants_count": 1, "title_full": "6 Places the Kardashians Visited in Armenia’s Capital - Vogue", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T17:00:00.000+03:00", "replies_count": 0, "uuid": "a578d8c21945694579f73fdd396cdeae35682d0f"}, "author": "Brooke Bobb", "url": "http://www.vogue.com/13349888/travel-guide-kardashians-armenia", "ord_in_thread": 0, "title": "6 Places the Kardashians Visited in Armenia’s Capital", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By now we’ve all seen the photos: Kim Kardashian West and Khloé Kardashian meeting with Armenian prime minister Hovik Abrahamyan , Kim hugging a crying old lady who’d waited for three days to meet her, and, as a final stop just outside of the country, the epic baptism of little North West at the birthplace of Jesus (because, where else would she be baptized?). Tonight Keeping Up With the Kardashians returns to E!, and the episode revolves around Kimye, North, and Khloé’s first trip to their ancestral homeland.\nBack in April, they visited Armenia’s capital city of Yerevan, where they toured around with relatives (their late father Robert Kardashian’s family originated there) and paid their respects at the centennial commemoration of the tragic Armenian Genocide. After immersing themselves in the local culture and learning about their heritage, Kanye slipped in a surprise free public concert, during which he proceeded to jump in a giant pond and get the show shut down. That particular pond and the other sites we’ll see them visit tonight are worth noting if your future travels find you in Yerevan. You may not be greeted by sobbing fans or sit at a dinner table with the prime minister, but here are the seven places from KUWTK’ s Armenian episode that mere mortals can visit, too.\nMother Armenia Statue\nWearing their signature curve-hugging attire in neutral colors, Khloé, Kim, and their kousins posed in front of this beautiful monument in Yerevan’s Victory Park. Mother Armenia is the female personification of the country and replaced the statue of Stalin that was removed in the spring of 1962. It symbolizes peace through strength.\nThe Marriott Yerevan\nOne of the most fabulous hotels in Yerevan, the Marriott boasts a pretty spectacular exterior with grand arched windows and a faint pink hue from the rose-and-white Armenian tufa stones that make up the facade. Located on Republic Square in the heart of the city and surrounded by government buildings, the National Gallery and History Museum, and the verdant Shahumyan Park, this hotel is where Kim, Kanye, North, and Khloé stayed during their trip. There are views of the square and of the beautiful Mount Ararat, as well as five restaurants, a gym, and a spa.\nLebanon Tavern\nMakeup artist Mario Dedivanovic posted an Instagram of incredibly yummy-looking food from this local restaurant, where he ate with Khloé, Kim, and their two cousins. Menu items include fried potato, spinach filo, and fattoush.\nDolmama\nAnother restaurant visited by the clan, Dolmama is one of the most highly respected and best-reviewed eateries in the city. It has a lovely outdoor courtyard and a quaint interior, making this a fine place to enjoy a bottle of wine and local fare.\nMegerian Carpets\nThe emporium Megerian Carpets, where locals threw a dinner party for the Kardashians, is one of the most famous rug companies in the country. It has been open since 1917, creating locally woven rugs in intricate designs.\nKarapi Lich\nThis is where the infamous Kanye pond jump happened . Or shall we say swan dive? Karapi Lich translates to Swan Lake in English, and it’s a small artificial lake located across from the opera in downtown Yerevan. The name pays homage to two swans that made a home on the water but later inexplicably disappeared, to the dismay of many locals. Perhaps they had an inkling of Yeezy’s imminent arrival.", "external_links": ["http://www.dailymail.co.uk/tvshowbiz/article-3035865/Elderly-woman-waits-three-days-meet-Kardashian-idol-finally-handing-flowers.html", "http://www.dolmama.am/", "http://www.lebanontavern.com/", "http://instidy.com/makeupbymario/p/961019624703122326_178976781", "http://www.people.com/article/kim-kardashian-khloe-kardashian-armenia-pose-mother-armenia-statue-instagram-photo", "http://www.etonline.com/news/166186_kim_kardashian_posts_pics_of_north_west_baptism_on_her_second_birthday/", "http://www.people.com/article/kim-kardashian-khloe-kardashian-meet-armenian-prime-minister", "http://www.marriott.com/hotels/travel/evnmc-armenia-marriott-hotel-yerevan/", "http://www.mayrhayastan.am/", "http://www.hollywoodreporter.com/news/kanye-west-throws-a-free-788411", "http://www.eonline.com/shows/kardashians", "http://megeriancarpet.am/"], "published": "2015-09-20T17:00:00.000+03:00", "crawled": "2015-09-21T20:14:58.164+03:00", "highlightTitle": ""}