{"organizations": [], "uuid": "de9d904c4be22ad568a4d34efa88708a01451751", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/10/gulf-air.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/gulf-air-in-talks-with-airbus-group-on-future-fleet-requirement/", "country": "US", "title": "Gulf Air in Talks with Airbus Group on Future Fleet RequirementTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Gulf Air in Talks with Airbus Group on Future Fleet RequirementTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "de9d904c4be22ad568a4d34efa88708a01451751"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/gulf-air-in-talks-with-airbus-group-on-future-fleet-requirement/", "ord_in_thread": 0, "title": "Gulf Air in Talks with Airbus Group on Future Fleet RequirementTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Gulf Air in Talks with Airbus Group on Future Fleet Requirement\nA meeting held today between the Kingdom of Bahrain’s Minister of Transportation and Telecommunications H.E. Kamal bin Ahmed Mohamed, national carrier Gulf Air’s A/Chief Executive Officer Mr. Maher Salman Al Musallam, Chief Strategy and Marketing Officer, Airbus Group Mr. Marwan Lahoud and Managing Director Airbus Middle East Mr. Fouad Attar saw discussions on the airline’s future narrow and wide body fleet requirements – up to 50 aircraft in total.\nBahrain’s Minister of Transportation and Telecommunications H.E. Kamal bin Ahmed Mohamed said: “Gulf Air is a strategically important, key national infrastructure asset, connecting the Kingdom of Bahrain globally and supporting the country’s long term aspirations for economic development and diversification. We have seen considerable positive progress achieved by Bahrain’s national carrier on both an operational and financial level since the airline embarked on a comprehensive restructuring in 2013.\nOptimizing Gulf Air’s fleet is an ongoing process and a critical component of its current and long term strategic business direction.”\nCommenting on their discussions, Mr. Marwan Lahoud said: “Airbus has been a long term, committed partner of Gulf Air’s since 1992 and while we are delighted to have had Bahrain’s national carrier utilize the Airbus family for its developing fleet requirements to date we also anticipate a fruitful and mutually beneficial relationship going forward.”\nGulf Air currently operates an all-Airbus fleet composed of 28 combination wide narrow and wide body aircraft that serve the airline’s network of 43 destinations.", "external_links": [], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T23:07:22.799+03:00", "highlightTitle": ""}