{"organizations": [], "uuid": "16e6f510bf4f59042371a0555a97525cd5b1a391", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/download-91-300x99.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/software-industry-veteran-prajval-parthasarathy-has-joined-heat-software-as-senior-vice-president-of-engineering/", "country": "US", "title": "Software Industry Veteran Prajval Parthasarathy has Joined HEAT Software as Senior Vice President of EngineeringTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Software Industry Veteran Prajval Parthasarathy has Joined HEAT Software as Senior Vice President of EngineeringTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "16e6f510bf4f59042371a0555a97525cd5b1a391"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/software-industry-veteran-prajval-parthasarathy-has-joined-heat-software-as-senior-vice-president-of-engineering/", "ord_in_thread": 0, "title": "Software Industry Veteran Prajval Parthasarathy has Joined HEAT Software as Senior Vice President of EngineeringTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Software Industry Veteran Prajval Parthasarathy has Joined HEAT Software as Senior Vice President of Engineering\nHEAT Software, the leading provider of Hybrid Service Management and Unified Endpoint Management (UEM) software, announced today that software industry veteran Prajval Parthasarathy has joined the company’s executive team in a newly created position, Senior Vice President of Engineering, reporting to President and CEO Jonathan Temple.\nParthasarathy will leverage his extensive software industry experience to help drive HEAT Software’s product execution. He is responsible for the development, test and continuous delivery of HEAT Software’s extensive portfolio of integrated product lines including service management and unified endpoint management solutions. Prior to joining HEAT Software, Parthasarathy spent over 15 years in several roles at CA Technologies where he managed large and distributed global teams. Most recently he was responsible for all aspects of engineering for the company’s CA Cloud Service Management (CSM) product line.\n“I am thrilled that Prajval will be joining our team,” said Temple. “As our product strategy continues to evolve, so does the need to grow our products in line with the company’s vision. Prajval’s proven track record in delivering successful service management solutions and driving operational excellence will be a tremendous asset to our organization, and we look forward to having him on board.”\n“It is an honor to join the HEAT Software team,” said Parthasarathy. “I am excited to support the mission to deliver HEAT’s unique value proposition of uniting both service management, endpoint management and endpoint security across both SaaS and on-premises environments. HEAT provides a great platform for product innovation and it is the delivery on this innovation that will help our customers become more productive and efficient than ever before.”\nSubsequently, Udo Waibel, former Chief Technology Officer, will take the role of Chief Product Officer where he will be responsible for overall product strategy, product management and assume a critical role in the Company’s on-going corporate development endeavors.\nSource:-HEAT Software", "external_links": [], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T20:15:16.756+03:00", "highlightTitle": ""}