{"organizations": ["Rae Wilson Popular Stories Cars For Sale"], "uuid": "70468c186970a736ed8db22f657800a751e662a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.thereporter.com.au", "main_image": "http://media.apnarm.net.au/img/media/images/2015/09/22/55-3179716-qld150815julius1_fct908x681x68.0_ct300x300.jpg", "site_section": "http://feeds2.feedburner.com/ThereportercomauTravel", "section_title": "thereporter.com.au: Travel", "url": "http://www.thereporter.com.au/news/hero-amongst-maasai-men-offers-glimpse-rwanda-life/2783837/", "country": "AU", "title": "A hero amongst Maasai men offers glimpse into Rwanda life", "performance_score": 0, "site": "thereporter.com.au", "participants_count": 0, "title_full": "A hero amongst Maasai men offers glimpse into Rwanda life", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T17:00:00.000+03:00", "replies_count": 0, "uuid": "70468c186970a736ed8db22f657800a751e662a2"}, "author": "", "url": "http://www.thereporter.com.au/news/hero-amongst-maasai-men-offers-glimpse-rwanda-life/2783837/", "ord_in_thread": 0, "title": "A hero amongst Maasai men offers glimpse into Rwanda life", "locations": ["East Africa", "Rwanda"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rae Wilson", "Julius Leteele"], "text": "A hero amongst Maasai men offers glimpse into Rwanda life Rae Wilson | 22nd Sep 2015 8:10 PM Rae Wilson Intrepid tour leader Julius Leteele (left) during an overland trip through East Africa. Contributed photo: By Rae Wilson Popular Stories Cars For Sale \nJULIUS Leteele can still remember the moment he became a hero in his tribe. \nHe became revered, someone whispered about among other young boys for generations to come, for his bravery and his manhood. \nIt was his spear that pierced the lion, near the ribs, and marked his fate as a tribal leader. \nJulius, then about 15, was among 20-30 teenage boys hunting the great beast in northern Kenya. \nTo kill a male lion, with its impressive mane denoting his superiority in a pride, was a rite of passage in the Maasai tribe then. \nWhat followed was Julius' circumcision in front of the tribe's men, without a whimper allowed to utter from his mouth. They also used a knife and fire to etch life-long tribal markings across his body. \nThen his transition to manhood, and his fate as a hero and a leader, was sealed. \nThe other boys did not miss out on the experience. Pride of lions in Lake Nakuru National Park in Kenya, East Africa. Contributed photo: By Rae Wilson \nOnce the spear stopped the majestic cat in its tracks, everyone leapt forward to finish the job and thereby become a Maasai man. \nThey also joined the circumcision ceremony but they could not achieve the same status as Julius. \nThe 39 year old, who I was lucky enough to have as my tour leader on an Intrepid tour through East Africa, was one of 11 children. \nHis dad had two wives, polygamy being acceptable among the Maasai, so he grew up with two mums. \nIt was a culture where arranged marriages were normal and the bride's family got a dowry. \nJulius disappointed his mum when he turned down an arranged marriage in his village near Buffalo Springs - Samburu county - about 250km north of Nairobi. \nHe had met his love while at university. \nMarrying an educated girl meant his parents had to pay more - nine cows, two camels and 200L of local beer made from sausage tree - for the union. \nBut he had never fitted into the nomadic farming life of the Maasai people. Intrepid tour leader Julius Leteele (right) during an overland trip through East Africa. Pictured with the cook and driver. Contributed photo: By Rae Wilson \nHis father forgave him the time he lost a goat but he could not when Julius broke one's leg. \nThe youngster was trying to practice his aim, throwing stones, because it was important training for his later lion-killing endeavours. \nHis dad was known for his ability to fix broken animals but when a stone snapped a hind leg, it was beyond repair. \nJulius' parents considered him naughty and as punishment sent him to school. \nHe was the only one in his family to attend school. \n\"I was the unlucky one but later on I was the lucky one,\" he said. \nSchool involved sitting amid about 20 other children under an acacia tree - synonymous with the African landscape. He was about nine when he started so he had a bit to catch up on. \nThey didn't have paper or pens so they would write their words or maths equations in the dirt. \nThis meant the wind would often blow away the dirt and erase the work that had been done. \nJulius described it as a different take on the dog ate my homework excuse. \nIf the equation was too hard, he could blow the dirt and pretend his hard work had been ruined. Sunrise on a hot air balloon ride in the Serengeti in Tanzania, East Africa. Contributed photo: By Rae Wilson \nBut, he said, if he had been cheating a little by copying someone else's work on a difficult task, the wind would work against him. \nSecondary school was more formalised, sent away to a boarding school 200km away. \nThough it was hard to be so far from his family, it equipped him for university and then life in the tourism industry. \nJulius - who now prefers baggy jeans and t-shirts rather than his traditional attire still seen on nomadic Maasai - can speak seven languages. \nHe spends a lot of time away from his family but in a country suffering from 40% unemployment, he still thinks himself lucky. \nHe was able to complete that education because an Italian family sponsored him through World Vision. \nJulius can now provide for his siblings, his wife and his three children. \nWhen asked whether he's spinning a tall tale about his tribal status, he says a trip to his house with the lion's head on the wall would be proof enough. \nBut Julius says - with a mixture of pride and humility - the belief would come before you even got to his house because his community still showers him with praise and offer a hero's welcome return. \nFACTBOX \nWHAT: Intrepid's Gorillas, Chimps and Game Parks tour (tour guides rotate) \nWHERE: Kenya, Uganda, Rwanda", "external_links": [], "published": "2015-09-21T17:00:00.000+03:00", "crawled": "2015-09-22T20:47:11.354+03:00", "highlightTitle": ""}