{"organizations": [], "uuid": "8dd5262afb6dc2b87d747c0e1358bba7ade976a4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/German_Unity-Day.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/frankfurt-set-to-celebrate-25-years-of-german-unity/", "country": "US", "title": "Frankfurt set to celebrate 25 years of German Unity - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Frankfurt set to celebrate 25 years of German Unity - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "8dd5262afb6dc2b87d747c0e1358bba7ade976a4"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/frankfurt-set-to-celebrate-25-years-of-german-unity/", "ord_in_thread": 0, "title": "Frankfurt set to celebrate 25 years of German Unity - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Frankfurt set to celebrate 25 years of German Unity\nThis year’s official ceremony commemorating the Day of German Unity will be held in Frankfurt from 02nd to 04th October with a celebration attracting young and old from the four corners of the republic. Taking place throughout downtown Frankfurt, this three-day festival will feature a colourfully diversified programme of events, with countless highlights guaranteed to appeal to people of all ages and walks of life. The event area will stretch from the banks of the River Main across St Paul’s Square to the Zeil pedestrian promenade. The festival’s centrepiece will no doubt be the so-called “country mile”, set up on both sides of the river. Here, Germany’s 16 federal states will be presenting themselves to the general public, with the offer range including everything from sightseeing attractions and historical highlights to culinary delights and live-music performances. Best of all, the programme is absolutely free of charge.\nMusic will be at the centre of attention at the Frankfurt stage, situated at the Hauptwache. The programme on offer here will include world music, jazz, rock, pop and techno as well as various forms of artistry. The main national stage at Opera Square, meanwhile, will present live performances by artists such as the entertainer Roger Cicero, the rapper “Cro”, and singers Sarah Connor and Rea Garvey.\nOn the northern bank of the River Main, various emergency services and security organisations will be demonstrating their skills and expertise along the “Blue-Light Mile”, while sporting associations and a special initiative called “Deutschland bewegt” (“Germany moves”) will be on show at the Zeil promenade and Konstablerwache, offering fitness checks and demonstrations of new forms of sport.\nThere’ll also be plenty of events, concerts, special activities and exhibitions taking place away from the festival’s main stages, all dedicated to Germany’s reunification.\nFrom 28th September to 04th October, for example, visitors will have the chance to participate in a unique light and sound show set scenically before Frankfurt’s impressive skyline. (9:00 pm to 11:00 pm). Aptly named “Crossing Borders“ (“Grenzen überwinden”), this show will feature 23 symbolic bridges spanning the River Main, reminding not only of the formerly divided Germany but also celebrating the future of peaceful and democratic co-existence.\nA number of large-scale photographs by Barbara Klemm will be on show at various public buildings throughout Frankfurt (mid-September to start of October), highlighting notable moments in the history of the two Germanys. Written history on the subject will be provided by way of various information columns dating from 1990 to 2015. Set up at various plazas and squares throughout Frankfurt and the Rhine-Main region, each of these two-and-a-half-metre pillars describes significant political, social and cultural events of a particular year. The absolute highlight of this trip through time is certain to be the comprehensive exhibition on show at St Paul’s Square in Frankfurt.\nMeanwhile, the renowned Städel Museum will be presenting the works of 27 German artists in a special exhibition entitled “The 80s. Figurative Painting in West Germany”. On show until 18th October, this exhibition puts on display some 100 works created by artists such as Ina Barfuss, Werner Büttner and Albert Oehlen, to name just a few. Elsewhere, the Eintracht Museum will be taking a closer look at 15 East German athletes who escaped to West Germany (until 15th October), telling their vivid stories in German, English and Spanish.", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T11:38:11.370+03:00", "highlightTitle": ""}