{"organizations": [], "uuid": "2d24711729143d32c6b76a6cacfe620e3120fc9e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.richmond.com", "main_image": "http://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/8/52/852620c2-09fb-50c2-ba7b-59fa34e926c8/55e0d9bdc2e29.image.jpg", "site_section": "http://www.richmond.com/search/?q=&t=article&l=25&d=&d1=&d2=&s=start_time&sd=desc&c[]=travel*&f=rss", "section_title": "Richmond Times-Dispatch - travel", "url": "http://www.richmond.com/ap/travel/article_88b516bd-b4d2-58c5-a295-4b911b939bf6.html", "country": "US", "title": "Bleisure Bits: Check out Tucson's scenic Sabino Canyon", "performance_score": 0, "site": "richmond.com", "participants_count": 1, "title_full": "Bleisure Bits: Check out Tucson's scenic Sabino Canyon", "spam_score": 0.0, "site_type": "news", "published": "2015-08-30T05:30:00.000+03:00", "replies_count": 0, "uuid": "2d24711729143d32c6b76a6cacfe620e3120fc9e"}, "author": "BETH J. HARPAZ | The Associated Press", "url": "http://www.richmond.com/ap/travel/article_88b516bd-b4d2-58c5-a295-4b911b939bf6.html", "ord_in_thread": 0, "title": "Bleisure Bits: Check out Tucson's scenic Sabino Canyon", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Associated Press Bleisure Bits: Check out Tucson's scenic Sabino Canyon \nThis April 24, 2015 photo shows visitors at an overlook at a tram shuttle stop in Sabino Canyon Recreation Area, a park not far from downtown Tucson, Ariz. For visitors who are pressed for time, the park offers a quick, easy-to-access look at spectacular desert scenery with mountains all around in every season, just steps from the parking lot. For those with more time to visit, there's a tram tour and numerous hiking trails. (AP Photo/Beth J. Harpaz) The Associated Press Bleisure Bits: Check out Tucson's scenic Sabino Canyon \nThis April 24, 2015 photo shows flowers blooming amid tall saguaro cactus and a mountain backdrop in Sabino Canyon Recreation Area not far from downton Tucson, Ariz. For visitors who are pressed for time, the park offers a quick, easy-to-access look at spectacular desert scenery with mountains all around in every season, just steps from the parking lot. For those with more time to visit, there's a tram tour and numerous hiking trails. (AP Photo/Beth J. Harpaz) The Associated Press Bleisure Bits: Check out Tucson's scenic Sabino Canyon \nThis April 24, 2015 photo shows flowers blooming amid tall saguaro cactus and a mountain backdrop in Sabino Canyon Recreation Area not far from downton Tucson, Ariz. For visitors who are pressed for time, the park offers a quick, easy-to-access look at spectacular desert scenery with mountains all around in every season, just steps from the parking lot. For those with more time to visit, there's a tram tour and numerous hiking trails. (AP Photo/Beth J. Harpaz) The Associated Press Bleisure Bits: Check out Tucson's scenic Sabino Canyon \nThis April 24, 2015 photo shows tall saguaro cactus growing in Sabino Canyon Recreation Area, a park not far from downtown Tucson, Arizona. For visitors who are pressed for time, the park offers a quick, easy-to-access look at spectacular desert scenery with mountains all around in every season, just steps from the parking lot. For those with more time to visit, there's a tram tour and numerous hiking trails. (AP Photo/Beth J. Harpaz) The Associated Press Bleisure Bits: Check out Tucson's scenic Sabino Canyon \nThis April 24, 2015 photo shows visitors at an overlook at a tram shuttle stop in Sabino Canyon Recreation Area, a park not far from downtown Tucson, Ariz. For visitors who are pressed for time, the park offers a quick, easy-to-access look at spectacular desert scenery with mountains all around in every season, just steps from the parking lot. For those with more time to visit, there's a tram tour and numerous hiking trails. (AP Photo/Beth J. Harpaz) The Associated Press Bleisure Bits: Check out Tucson's scenic Sabino Canyon \nThis April 24, 2015 photo shows tall saguaro cactus growing in Sabino Canyon Recreation Area, a park not far from downtown Tucson, Arizona. For visitors who are pressed for time, the park offers a quick, easy-to-access look at spectacular desert scenery with mountains all around in every season, just steps from the parking lot. For those with more time to visit, there's a tram tour and numerous hiking trails. (AP Photo/Beth J. Harpaz) If you go \nSabino Canyon Recreation Area: 17 miles from downtown Tucson, Ariz. Visitor center is open 8 a.m. to 4:30 p.m. The $5 parking fee is required even when the visitor center is closed; use self-pay stations; www.fs.usda.gov/recarea/coronado/recarea/?recid=80532 \nSabino Canyon Tram Tours: Tram tours are Monday to Friday, 9 a.m. to 4 p.m., departing on the hour; weekends and some holidays, departures every 30 minutes from 9 a.m. to 4:30 p.m. Schedule varies by season so check website for details; http://sabinocanyon.com . Adults, $8; children 3-12, $4. Night tours offered June 29, June 30 and July 1 at 9 p.m. by prepaid reservation only, with additional night tours in September, October and November. ADVERTISEMENT Bleisure Bits: Check out Tucson's scenic Sabino Canyon Associated Press | \nTUCSON, Ariz. — On a quick trip to Tucson, I had a few hours to get a look at some classic desert scenery, but not enough time (or energy) for a big hike before catching a flight home. A friend suggested Sabino Canyon, 17 miles from downtown Tucson. It proved to be the perfect fast and easy way to sample Arizona’s beauty without a lot of fuss. \nFor the time-crunched traveler, the best thing about Sabino is that the nature trails begin just steps from the parking lot. I strolled the well-marked footpaths and within just a few minutes, I’d seen towering saguaro cactus, spectacular mountain backdrops and a variety of other vegetation and scenery. \nI even had time to take a tram shuttle that offers a narrated tour on a loop drive. The tram round-trip is 45 to 50 minutes total, but there are also a series of hop-on, hop-off stops if you have time to explore or hang out. When you’re ready to go, just catch the next shuttle that comes through. A favorite spot for visitors is a stop by a creek with a tree-shaded area. \nMy visit in late spring happened to coincide with that brief time of year when many cactus plants were covered with gorgeous colorful flowers, and the weather, while warm, was not unbearably hot. But one of the great things about Sabino Canyon is that even though the visitor center is only open 8 a.m. to 4:30 p.m., the grounds never close. With summer sunrises before 6 a.m. and sunsets near 7 p.m., there’s plenty of daylight for business travelers to drop by first thing in the morning or late in the day, even if they’re tied up in meetings during regular business hours. You can take a jog, a stroll or just a quick selfie with a cactus in the background (watch out for thorns!). \nIntrepid locals visit Sabino at all hours to avoid the midday heat, even making nighttime visits by flashlight. “What we typically see early in the morning and later in the evening are the local folks who come to walk for exercise or ride their bikes,” said Heidi Schewel, spokeswoman for the U.S. Forest Service’s Coronado National Forest, which includes Sabino Canyon. \nSabino also attracts visitors from around the globe. “It’s world-class scenery,” Schewel said. \nA few things to keep in mind: Allow 40 minutes for the 17-mile drive from downtown Tucson. Summer temperatures can climb to more than 100 degrees. Be sure to wear sunscreen and a hat and drink plenty of water. Beware of nocturnal wildlife, including venomous snakes. “A lot of them will come out at night to warm themselves on the pavement of the road, so people need to be watching where they’re going, but you can see them in plenty of time ahead of you,” Schewel said. “We just urge people to be careful where they put their hands and feet. Use common sense and have a great time.”", "external_links": [], "published": "2015-08-30T05:30:00.000+03:00", "crawled": "2015-09-01T02:31:50.753+03:00", "highlightTitle": ""}