{"organizations": [], "uuid": "1ce031f55054a821b76b5bf2d7364a3a06c2393b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30147723/maersk-teams-with-att-to-track-and-monitor-cold-shipping-containers", "country": "US", "title": "Maersk Teams With AT&T To Track And Monitor Cold Shipping Containers", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Maersk Teams With AT&T To Track And Monitor Cold Shipping Containers - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "1ce031f55054a821b76b5bf2d7364a3a06c2393b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30147723/maersk-teams-with-att-to-track-and-monitor-cold-shipping-containers", "ord_in_thread": 0, "title": "Maersk Teams With AT&T To Track And Monitor Cold Shipping Containers", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " AT&T Inc.\nGlobal Shipping Company Views Conditions of Perishable Goods with AT&T&#39;s IoT Technology\nDALLAS , Sept. 30, 2015 /PRNewswire/ -- A.P. Moller-Maersk Group, owner of one of the world's largest shipping lines, is using AT&T * Internet of Things (IoT) technology to connect its refrigerated containers. The agreement between Maersk and AT&T is one of the largest Industrial IoT deployments of its kind.\nMaersk is working with AT&T to track and monitor the condition of refrigerated containers with perishable goods. Before, onsite supply chain managers would spend time manually checking the condition of each container. Maersk now has near-real time visibility into the conditions of each refrigerated container at almost any part of its journey during the supply chain. Their shipping supervisors can monitor mechanical performance to help ensure the equipment is in proper working condition.\n\"Every day we're responsible for shipping perishable goods around the world,\" said Maersk Line's Vice President and Head of Assets & Deployments, Amdi Krogh . \"AT&T's technology helps us improve the level of services we provide, helping ensure they are optimized and arrive in the proper condition – no matter the length of the journey.\"\n\"We help companies better manage their delivery process and offer service their customers can depend on,\" said AT&T's Regional Vice President for Europe , the Middle East and Africa , John Vladimir Slamecka . \"One of the largest shipping container companies in the world can keep its customers informed about the location and condition of each shipment, helping them operate more efficiently and giving them peace of mind about their cargo.\"\nMaersk has connected over 290,000 of its refrigerated containers to the AT&T network. Each unit uses a remote container device (RCD) that has a 3G High Temperature SIM card, a GPS unit, a ZigBee radio and antenna, and multiple interfaces for connecting into the refrigerated container's controller. The RCD can operate with two-way connectivity from just about anywhere in the world.\nAT&T develops IoT technology for industries such as supply chain, insurance, industrial asset tracking and smart cities. The solutions include smart meter management, connected vehicles, smart city street and traffic lights.\nFor more information on AT&T Industrial IoT Solutions, visit www.att.com/m2m .\n*AT&T products and services are provided or offered by subsidiaries and affiliates of AT&T Inc. under the AT&T brand and not by AT&T Inc.\nAbout Maersk Line\nMaersk Line is the world's largest container shipping company, known for reliable, flexible and eco-efficient services. It provides ocean transportation in all parts of the world, serving its customers through 374 offices in 116 countries. Maersk Line employs 7,100 seafarers and 25,500 land-based employees and operates 619 container vessels.\nMaersk Line markets its services through the Maersk Line, Safmarine and SeaLand (Intra-Americas) brands. It is the holding company for MCC Transport (Intra-Asia), Seago Line (Intra-Europe) and Mercosul ( Brazil ).\nMaersk Line is part of the Maersk Group, headquartered in Copenhagen, Denmark . The Group employs 89,207 people in around 130 countries. 2014 revenue: USD 48 billion .\nAbout AT&T\nAT&T Inc. (NYSE:T) helps millions around the globe connect with leading entertainment, mobile, high speed Internet and voice services. We're the world's largest provider of pay TV. We have TV customers in the U.S. and 11 Latin American countries. In the U.S., our wireless network offers the nation's strongest LTE signal and the most reliable 4G LTE network . We offer the best global wireless coverage*. And we help businesses worldwide serve their customers better with our mobility and secure cloud solutions.\nAdditional information about AT&T products and services is available at http://about.att.com . Follow our news on Twitter at @ATT, on Facebook at http://www.facebook.com/att and YouTube at http://www.youtube.com/att .\n© 2015 AT&T Intellectual Property. All rights reserved. AT&T, the Globe logo and other marks are trademarks and service marks of AT&T Intellectual Property and/or AT&T affiliated companies. All other marks contained herein are the property of their respective owners.\nReliability and signal strength claims based on nationwide carriers' LTE. Signal strength claim based ONLY on avg. LTE signal strength. LTE not available everywhere.\n*Global coverage claim based on offering discounted voice and data roaming; LTE roaming; voice roaming; and world-capable smartphone and tablets in more countries than any other U.S. based carrier. Coverage not available in all areas. Coverage may vary per country and be limited/restricted in some countries.\nLogo - http://photos.prnewswire.com/prnh/20140408/CG99935LOGO\n releases/maersk-teams-with-att-to-track-and-monitor-cold-shipping-containers-300151061.html\n ", "external_links": ["http://www.att.com/gen/landing-pages?pid=3309", "http://www.att.com/m2m", "http://about.att.com/", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnvar/20140408/CG99935LOGO", "http://www.facebook.com/att", "http://www.att.com/network/", "http://www.youtube.com/att", "http://photos.prnewswire.com/prnh/20140408/CG99935LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG15221&Transmission_Id=201509300101PR_NEWS_USPR_____CG15221&DateId=20150930", "http://www.prnewswire.com/news-releases/maersk-teams-with-att-to-track-and-monitor-cold-shipping-containers-300151061.html"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T09:14:59.397+03:00", "highlightTitle": ""}