{"organizations": [], "uuid": "57f22265357144fa3d5d5e8d8b071cb773e673fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.stuff.co.nz", "main_image": "http://www.stuff.co.nz/etc/designs/ffx/nz/stuff/social-media-logos/stuff-180x180.jpg", "site_section": "http://www.stuff.co.nz/rss/travel", "section_title": "Stuff.co.nz - Travel", "url": "http://www.stuff.co.nz/travel/72494004/Civil-Aviation-Authority-investigation-on-drone-near-miss-to-take-days", "country": "AU", "title": "Civil Aviation Authority investigation on drone near miss to take days", "performance_score": 0, "site": "stuff.co.nz", "participants_count": 1, "title_full": "Civil Aviation Authority investigation on drone near miss to take days", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T10:57:00.000+03:00", "replies_count": 0, "uuid": "57f22265357144fa3d5d5e8d8b071cb773e673fa"}, "author": "Ashleigh Stewart", "url": "http://www.stuff.co.nz/travel/72494004/Civil-Aviation-Authority-investigation-on-drone-near-miss-to-take-days", "ord_in_thread": 0, "title": "Civil Aviation Authority investigation on drone near miss to take days", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Civil Aviation Authority investigation on drone near miss to take days ASHLEIGH STEWART Last updated 20:57, September 28 2015 \nIt could be days before it becomes clear what happened in a near miss between a drone and a commercial plane in Christchurch. \nThe pilot of an Air New Zealand A320 en route from Christchurch to Auckland reported seeing the \"sizeable\" red-coloured drone pass close to the aircraft at an altitude of 6000 feet (1800 metres) in air space at Kaiapoi, north of the city, about 5.45pm Friday. \n\"Based on the information to hand at this time it raises significant safety concerns,\" Civil Aviation Authority (CAA) director Graeme Harris said at the time. \n\"We are very concerned that [a drone] pilot appears to have allowed their aircraft to fly in such close proximity to a passenger aircraft. The [drone] should not have been anywhere near the jet. It simply shouldn't have been in that airspace.\" \nOn Monday, a CAA spokesman said its safety investigators were \"currently in the information gathering phase\". \nThis included interviewing people who were working on Friday afternoon, specifically pilots. \n\"The A320 Pilot reported seeing drone so we are not prepared to speculate on what people or organisations think or don't think at this stage. We are concerned with gathering the facts. I expect it will be a few more days at least before we have anything more specific,\" he said. \nHe urged any member of the public to \"come forward if they aware of a large drone operating the Kaiapoi area last Friday\". \nAnonymous messages can be left after hours on 0508 4SAFETY (0508 472 338). \nAn Air New Zealand spokeswoman said the airline had \"nothing further to add at this stage\". \nSince Friday, debate has raged about whether the drone was a drone at all and whether regulations on RPAS [remotely piloted aircraft systems] in New Zealand should be tightened. \nNew Zealand Air Line Pilots' Association (NZALPA) air traffic control director Jon Brooks said the union was concerned about the \"very loose\" regulations around RPAS. \n\"Incidents such as this put those controllers and pilots in stressful and potentially harmful situations,\" he said. \nOne commenter suggested it may be an FPV Wing, which \"would explain the size, colour and the pilot's ability to see it at a far enough distance to avoid it\". \n\"If it was a large drone and it was that high, it was built and flown by somebody who knows what they are doing and therefore would know enough about the rules to know they were breaking the law,\" he said. \nAnother suggested it could not be a drone, at such a height. \n\"[One thousand] feet (304 metres) is about the highest I've heard of a drone achieving, otherwise the person on the controller would start to lose control.\" - Stuff", "external_links": [], "published": "2015-09-28T10:57:00.000+03:00", "crawled": "2015-09-28T14:46:37.854+03:00", "highlightTitle": ""}