{"organizations": [], "uuid": "871c70eed3c13c6f339d9bfa94e98671065c485a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gohawaii.about.com", "main_image": "http://f.tqn.com/y/gohawaii/1/S/i/H/5/kauai-underground-guide-001.jpg", "site_section": "http://z.about.com/6/g/gohawaii/b/index.rdf", "section_title": "About Hawaii Travel", "url": "http://gohawaii.about.com/od/bookstore/tp/guides_kauai.htm", "country": "US", "title": "Top 10 Kauai Guidebooks", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Top 10 Kauai Guidebooks", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T23:25:00.000+03:00", "replies_count": 0, "uuid": "871c70eed3c13c6f339d9bfa94e98671065c485a"}, "author": "", "url": "http://gohawaii.about.com/od/bookstore/tp/guides_kauai.htm", "ord_in_thread": 0, "title": "Top 10 Kauai Guidebooks", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expert Videos \nThe Garden Isle of Kauai calls to all those who look for a quiet place for peaceful relaxation as well as those who want to explore and challenge nature at its finest, with lush rainforests, majestic waterfalls and the only navigable river in Hawaii. \nHere are our picks for some of the best guidebooks to the island of Kauai. Kauai Underground Guide. Lenore & Mirah Horowitz \nNow in its 19th printing, this book is superb for anyone who really wants to learn about Kauai and find the best beaches, activities, restaurants, tours, adventures. shopping and accommodations. \nA free Hawaiian music CD is included. More » Moon Handbooks Kaua'i. Jade Eckardt 2. Moon Handbooks: Kauai \nThe 2012 edition of Moon Handbooks: Kauai is written by Jade Eckardt. The Moon handbooks are the best overall guidebooks on each island of Hawaii. \nThe book is loaded with accommodation and dining options, as well as an in-depth look at the culture and history of the Garden Isle. More » Beaches of Kaua`i and Ni`ihau. John R. K. Clark \nA guide tot he beaches around the island, describing setting, special features, amenities, and available activities. Also includes photos, detailed maps, and general and specific cautions. \nThis is by far the best book about the beaches of these two islands. More » Frommer's Kauai. Jeanette Foster 4. Frommer's Kauai \nMeticulously researched by one of Hawaii's most noted journalists, this is one of the most reliable, up-to-date, and comprehensive guides to Kauai. \nWhether you want to learn how to surf, hike through Waimea Canyon, play a challenging round of golf, snorkel with sea turtles, or simply kick back with a mai tai to watch the sunset, you can design the perfect trip with Frommer's Kauai. More » Kauai Trailblazer. Jerry and Janine Sprout \nFilled with detailed directions to help you find special places off the beaten track, Kauai Trailblazer is a must read for outdoor enthusiasts who want to really appreciate the island of Kauai. More » Kauai Trails. Kathy Morey 6. Kaua'i Trails: Walks, Strolls, and Treks on the Garden Island \nKauai is the most popular of the Hawaiian islands for backpacking and hiking. \nThis book explores the miles of seldom-trod trails through areas of magnificent natural beauty. It covers immense waterfalls, untrammeled golden beaches, dense banks of ferns dotted with wild orchids, and more. More » Paradise Family Guides Kauai. Pamela Y. Brown 7. Paradise Family Guides Kaua'i: The Most Complete Guide to Family Fun & Adventure \nThis 2005 guide to the Garden Island of Kauai is hard to find, but well worth the effort for families traveling to Kauai. \nThe book includes descriptions of popular island sights and kid-friendly attractions including zoos, aquariums, museums, luaus, and lei-making and hula-dancing classes. \nThere are recommendations on more than 100 lodgings, many of which provide extra living space, cooking facilities and baby-sitting information. It includes restaurant reviews that list menu items so parents can be sure that their children's favorite foods are available. More » The Ultimate Kauai Guidebook. Andrew Doughty 8. The Ultimate Kauai Guidebook \nWritten by the same folks who brought you Hawaii: The Big Island Revealed, this is a good book on the Garden Isle of Kauai. \nThe Kindle edition was recently revised in 2014. Beware, however, of recommendations to enter private property or protected areas. More » Robert Stone. Day Hikes on Kauai 9. Day Hikes on Kauai \nDay Hikes on Kauai is a concise guide to 55 incredible hikes, from coastline paths to mountain vistas. \nThese day hikes include waterfalls, swimming holes, coastal hideaways, canyons, lush jungles, plunging cliffs and some of the island's most spectacular scenery. \nThe hikes accommodate all levels of experience - from easy strolls to moderately strenuous ridge trails. More » Hidden Kauai: Including Hanalei, Princeville, and Poipu. Ray Riegert 10. Hidden Kauai: Including Hanalei, Princeville, and Poipu \nIn Hidden Kauai, award-winning travel writer Ray Riegert balances coverage of Kauai's growing travel facilities — including the resorts, condos and restaurants around Poipu and Lihue — with extensive details on the island's many natural attractions, adventure activities, and still-undiscovered sites. \nThe guide is packed with beach descriptions (36 in all), plus outdoor activities including 35 surfing spots, 23 snorkeling and scuba havens, 32 fishing areas, 7 sea kayaking routes, and 27 hikes. More » Related Articles", "external_links": [], "published": "2015-09-04T23:25:00.000+03:00", "crawled": "2015-09-08T10:00:58.287+03:00", "highlightTitle": ""}