{"organizations": [], "uuid": "c05c7109e0458fc48b397f497657c9151a70a663", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattlepi.com", "main_image": "http://www.seattlepi.com/img/pages/article/opengraph_default.png", "site_section": "http://www.seattlepi.com/lifestyle/travel/", "section_title": "Travel: Air, Land and Sea Guides and Resources - seattlepi.com", "url": "http://www.seattlepi.com/news/article/Corps-Court-take-up-contentious-SC-cruise-6534533.php", "country": "US", "title": "Corps, Court take up contentious SC cruise terminal", "performance_score": 0, "site": "seattlepi.com", "participants_count": 1, "title_full": "Corps, Court take up contentious SC cruise terminal - seattlepi.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "c05c7109e0458fc48b397f497657c9151a70a663"}, "author": "seattlepi.com", "url": "http://www.seattlepi.com/news/article/Corps-Court-take-up-contentious-SC-cruise-6534533.php", "ord_in_thread": 0, "title": "Corps, Court take up contentious SC cruise terminal", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "CHARLESTON, S.C. (AP) — The U.S. Army Corps of Engineers is sorting through hundreds of comments and the South Carolina Court of Appeals has set arguments for later this year in the ongoing dispute over a proposed $35 million passenger cruise terminal in Charleston.\nThe South Carolina Ports Authority envisions the terminal in a renovated waterfront warehouse and wants a federal permit to place five additional clusters of pilings beneath the structure where there are now more than 1,000.\nOpponents went to court challenging an initial permit issued in 2012 and a federal judge threw it out, saying regulators had not considered the larger impact of the terminal on historic Charleston.\nPreservation, conservation and community groups opposed to the new terminal, first proposed five years ago, worry it will cause more congestion and pollution and hurt property values in the city.\nThe Ports Authority has now applied for a new permit and the Corps received about 250 comments before the public comment period closed last week. Corps spokesman Sean McBride said the comments will be considered before deciding whether a full environmental impact statement, which can take a year, should be compiled.\nThe Ports Authority provided 40,000 pages of documents to the Corps.\n\"If these 40,000 pages show anything, it is that a project of this magnitude, and at this location, will have a significant impact on the human environment,\" said a comment filed with the Corps by attorneys for the Southern Environmental Law Center which represents two groups opposing the terminal.\nThe attorneys suggested alternatives be considered, including renovating the existing terminal or building the new terminal in North Charleston, upriver from the planned site. They also said that shore power — electric power to the ship so the cruise liners aren't idling in port using fuel oil — is feasible and there should be an updated study on the impact cruises will have on traffic in the historic district.\nAn authority spokeswoman said the agency had no comment on the filing.\nMcBride said that until all the comments are reviewed, it's too early to say if, or when, an environmental impact statement might be compiled.\nMeanwhile, a challenge to a state permit is set to be heard by the Court of Appeals later this year. The court notified attorneys this month it plans to hear oral arguments the second week in December.\nA state administrative law judge upheld the state permit for the pilings last year, saying the opponents lacked standing to appeal.\nThe judge found that opponents failed to present \"specific, admissible facts to support their allegations and statements\" of harm to Charleston posed by the planned terminal. His decision was then appealed by terminal opponents.", "external_links": ["http://ap.org/schemas/03/2005/apcm", "http://ap.org/schemas/03/2005/apnm"], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T16:40:18.663+03:00", "highlightTitle": ""}