{"organizations": [], "uuid": "9690f9d5d00a4c8da73db6233567355c14687584", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.arabianbusiness.com", "main_image": "http://www.arabianbusiness.com/incoming/article605026.ece/BINARY/Mana-Al-Suwaidi.jpg", "site_section": "http://www.arabianbusiness.com//industries/travel-hospitality/?service=rss", "section_title": "Arabian Business - Travel & Hospitality", "url": "http://www.arabianbusiness.com/strong-history-bright-outlook--role-of-india-in-dubai-s-tourism-future-605027.html", "country": "US", "title": "Strong history, bright outlook: the role of India in Dubai's tourism future", "performance_score": 0, "site": "arabianbusiness.com", "participants_count": 0, "title_full": "Strong history, bright outlook: the role of India in Dubai's tourism future", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T00:08:00.000+03:00", "replies_count": 0, "uuid": "9690f9d5d00a4c8da73db6233567355c14687584"}, "author": "", "url": "http://www.arabianbusiness.com/strong-history-bright-outlook--role-of-india-in-dubai-s-tourism-future-605027.html", "ord_in_thread": 0, "title": "Strong history, bright outlook: the role of India in Dubai's tourism future", "locations": ["Dubai", "India"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Strong history, bright outlook: the role of India in Dubai's tourism future Article By Mana Al Suwaidi Saturday, 5 September 2015 1:08 AM \nThe recent visit to the UAE by Indian Prime Minister Narenda Modi highlighted and celebrated a resilient and meaningful relationship between our two nations. It was a visit that was 34 years in the making and one that highlighted and outlined both the strong historical ties and the future opportunities we have yet to explore and expand. \nIndia has historically been Dubai’s largest trading partner. Indian firms have long established operations within the emirate, using our location as both headquarters and hub for the wider Middle Eastern region and increasingly, as a gateway into Africa. Following and supporting this trade relationship and the presence of these businesses is a strong Indian community, which embodies the spirit of entrepreneurialism and diversity that Dubai is known for globally today. \nAs a proud Emirati I have grown up with a close understanding of the contribution the Indian community has made to the development of Dubai. The emirate’s Indian expatriate residents have helped to bolster and build Dubai’s infrastructure, education and health sectors; strengthen our economic competitiveness; and contribute to building a dynamic and robust civil society. This community, which is consistently growing in their professional profile, have also become strong ambassadors for the emirate, both when returning to or visiting India, and when hosting their friends and family who travel to Dubai to spend time with them. \nAmong the agreed areas of cooperation between India and the UAE during prime minister Modi’s stay were points relating to economic growth in both countries, as well as security, entrepreneurialism, energy, education sector growth, and the strengthening of cultural exchange. Of course, a substantial contributor to economic growth is the continual advancement of the tourism sector, and India has long been a significant contributor with more than 1 million Indians now visiting the emirate annually for leisure or business tourism purposes, or to see and spend time with friends and relatives. \nAs announced in May 2013, Dubai’s Tourism Vision for 2020 aims to welcome 20 million tourists per year by 2020. Due to the work of Dubai Tourism and its partners in both the public and private sectors, we are well on track to reach that target, demonstrated by the fact that we welcomed over 13.2 million international overnight visitors in 2014 alone, and at present, are enjoying an annual average growth rate of 8 percent over the past five years — significantly higher than the global average of 4.7 percent. \nIn the last few years, a lot has been done to stimulate growth in new source markets, and while the importance of these markets cannot be understated, protecting and increasing visitor numbers from long-standing source markets such as India remains a key focus. \nAccording to visitor statistics for the first half of 2015, Dubai saw an approximate 25 percent increase in year-on-year overnight visitors from India — growing from 639,000 for the first half of 2014, to 798,000 overnight visitors for the same period in 2015. \nThe historical ties combined with unparalleled connectivity, represented by the over 1,700 flights a month between Dubai and cities in India, are leveraged by the work of Dubai Tourism and our partners as we continue to position Dubai as a must-experience destination for India’s outbound tourists. In line with this focus, we recently partnered with leading UAE premium-experience travel website, Musafir.com, to run a joint campaign to promote Dubai among Indian travellers, and earlier this year hosted a group of top Indian wedding planners, a delegation of more than 35 Indian MICE trade officials and media, and MasterChef India — just one of a number of productions that use Dubai as a stage. As television and films are so popular in India, they are crucial channels through which to deliver our message. \nIt is not just first time visitors that we seek to attract — India is one of our biggest markets for repeat visitors, due to the reasons listed above combined with a short flight time of around four hours and a plethora of events and festivals that are designed to appeal to Indian families and couples. Dubai Shopping Festival, Dubai Food Festival and Dubai International Film Festival regularly showcase a wealth of Indian talent and last month Dubai Festivals and Retail Establishment, an agency of Dubai Tourism, hosted a large group of Indian journalists to experience this year’s Dubai Summer Surprises, promoting the emirate as a summer destination for Indian families and a stop-over for those flying further afield. These events, coupled with a variety of music concerts featuring Indian singers and entertainers and, of course, the hosting of sporting events such as the Indian Premier League cricket matches in 2014, ensure that there is no shortage of entertainment tailored to our Indian residents and guests. \nGovernmental legislation — such as the August 2014 announcement of the UAE multi-entry cruise visa — combined with continual enhancements to Dubai’s events and festivals calendar and the wider destination offering, including a healthy pipeline of hotel developments and leisure attraction enhancements, will maintain the rate of repeat visitors welcomed from India. \nIt is important to never stop challenging ourselves to keep growing, and the 2016 opening of Dubai Parks and Resorts’ Bollywood Parks Dubai presents another opportunity that we must leverage to full advantage. \nIn line with the spirit of cooperation that exists between the two nations and the contribution of Indians to the growth of Dubai, we are looking forward to attracting more Indian visitors and their families for longer and towards sharing a bright future that mirrors the bright history that our two countries share.", "external_links": [], "published": "2015-09-05T00:08:00.000+03:00", "crawled": "2015-09-05T01:31:44.282+03:00", "highlightTitle": ""}