{"organizations": [], "uuid": "ee55428398e0df4f3d95e2830d9c0e044bfc9c1f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/unnamed43.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/give-your-grandparent-the-opportunity-to-travel-with-british-airways-wingstoadream-contest/", "country": "US", "title": "Give Your Grandparent The Opportunity To Travel With British Airways’ #Wingstoadream ContestTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Give Your Grandparent The Opportunity To Travel With British Airways’ #Wingstoadream ContestTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "ee55428398e0df4f3d95e2830d9c0e044bfc9c1f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/give-your-grandparent-the-opportunity-to-travel-with-british-airways-wingstoadream-contest/", "ord_in_thread": 0, "title": "Give Your Grandparent The Opportunity To Travel With British Airways’ #Wingstoadream ContestTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Give Your Grandparent The Opportunity To Travel With British Airways’ #Wingstoadream Contest\nTravel, fairy tale stories, fond memories and grandparents. What is the common thread that binds them together? It’s the unconditional love that our grandparents shower on us.\nBritish Airways invites you on a journey with your most loved grandparent to create new memories, travelling together through the streets of London, reminiscing good old times with them.\nBritish Airways is delighted to share that today it has added a brand new Boeing 787 Dreamliner to its family. The aircraft that touched down in London today will be set to take off for Delhi on 25 October 2015. Delhi will be the first city across British Airways’ global to welcome the Dreamliner offering customers a whole new level of comfort and luxury.\nTo celebrate this occasion, British Airways has launched a Twitter and Facebook contest inviting the youth of India to win seats for themselves along with their most loved grandparent for a unique trip to London.\nTo take part in this contest, you must share an image of your grandparent using #wingstoadream on British Airways’ Twitter handle, @British_Airways or Facebook page (British Airways’ Official Page). Share a recent fun picture of your grandparent or from your childhood, with a short caption on why you think you should be on the first flight to London from New Delhi on the new Boeing 787 Dreamliner.\n25 lucky participants will win two return World Traveller (economy) tickets each for themselves and their grandparent, on the first Boeing 787-9 Dreamliner flight from New Delhi to London scheduled for 26 October 2015. The contest is now live and ends on 5 October 2015 at 11:59 pm IST.\nBritish Airways spokesperson Moran Birger, British Airways’ regional commercial manager, South Asia said: “We have been flying to India for over 90 years and continue to seek opportunities to engage with our customers in unique ways. We urge everyone in India to actively participate in this contest and have the opportunity to create everlasting memories with their grandparent.\n“Delhi is the first city globally for British Airways to welcome the brand new aircraft that is fitted with a brand First cabin. We, at British Airways, are constantly looking for opportunities to provide our Indian customers excellent value for money with an unparalleled service that they have come to expect from us.”\nThe 787s are the most technologically advanced aircraft in British Airways’ fleet. British Airways’ Boeing 787-9 Dreamliner is 20ft longer than its 787-8 predecessor (of which the airline has eight), with World Traveller (economy), World Traveller Plus (premium economy), Club World (business class) and a new First class cabin – a first for the airline’s 787 fleet.\nSource:- British Airways", "external_links": [], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T15:45:05.309+03:00", "highlightTitle": ""}