{"organizations": [], "uuid": "58041f9aabd1e5583e86da6f91ad3b536b2954a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gochicago.about.com", "main_image": "http://f.tqn.com/y/gochicago/1/S/j/E/-/-/2976563497_ae48c83553_o.jpg", "site_section": "http://z.about.com/6/o/m/gochicago_t2.xml", "section_title": "About.com Chicago Travel: What's Hot Now", "url": "http://gochicago.about.com/od/alcaponegangstertours/tp/chicago_gangster_tours.htm", "country": "US", "title": "Inside Al Capone's Chicago", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Inside Al Capone's Chicago", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T14:05:00.000+03:00", "replies_count": 0, "uuid": "58041f9aabd1e5583e86da6f91ad3b536b2954a6"}, "author": "", "url": "http://gochicago.about.com/od/alcaponegangstertours/tp/chicago_gangster_tours.htm", "ord_in_thread": 0, "title": "Inside Al Capone's Chicago", "locations": ["Chicago"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Al Capone"], "text": "Union Station \nUnion Station, a hub for the Metra and Amtrak rail lines, is known for the famous shootout scene in the movie The Untouchables . And while the incident was entirely made up by Hollywood -- especially the \"baby carriage\" nod to The Battleship Potemkin -- Chicago gangster fact and fiction are so blurred at this point it's made it a stopping point on a tour of \"gangster history.\" Address: Canal Street between Adams and Jackson More » Valentine's Day Massacre Site \nOn February 14, 1929, seven gangsters were shot and killed at a garage in Chicago's Lincoln Park neighborhood in what became known as the \"Saint Valentine's Day Massacre.\" While it was never proven, it's commonly believed that the men were murdered by members of Al Capone's gang, or hit men hired by Capone. The killers tricked the gangsters into letting them in by dressing as police officers. The main intended target, \"Bugs\" Moran, escaped injury when the \"go ahead\" signal was mistakenly given early and Moran had not arrived at the garage yet. Unfortunately a visit to the site is just to have an \"I was there\" moment, as the original building is long gone. Address: 2122 N. Clark Street, Chicago Tommy Gun's Garage Tommy Gun's Garage is a unique interactive dinner theater, set in the era of Chicago gangsters. The entire space is decorated as a 1920s \"speakeasy\" and features a sit-down dinner as well as a musical show with \"gangsters\" and \"flappers\" performing tunes from composers of the era like George Gershwin and Cole Porter. The cheese factor is high here, but if you can let your inhibitions down a bit it makes for a fun time. Address: 2114 S. Wabash, Chicago Phone: 312-225-0273", "external_links": [], "published": "2015-09-28T14:05:00.000+03:00", "crawled": "2015-09-29T00:11:59.344+03:00", "highlightTitle": ""}