{"organizations": [], "uuid": "d3d353a051ff247a8dac0351a87167814cdb5aa7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63503/arrivalguides-gaining-momentum-340-major-influential-travel-bran", "country": "US", "title": "ArrivalGuides Gaining Momentum with 340 Major, Influential Travel Brands now as Distribution Partners", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "ArrivalGuides Gaining Momentum with 340 Major, Influential Travel Brands now as Distribution Partners", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T16:45:00.000+03:00", "replies_count": 0, "uuid": "d3d353a051ff247a8dac0351a87167814cdb5aa7"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/63503/arrivalguides-gaining-momentum-340-major-influential-travel-bran", "ord_in_thread": 0, "title": "ArrivalGuides Gaining Momentum with 340 Major, Influential Travel Brands now as Distribution Partners", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ArrivalGuides Gaining Momentum with 340 Major, Influential Travel Brands now as Distribution Partners Original, timely global, travel, tourism, business news and research: \nSep 08, 2015 eTN Exclusive: Unique and original, timely, global breaking news: \nFounded in 2004, ArrivalGuides started its’ life in Gothenburg, Sweden as the brainchild of Magnus Aideborn after he recognized a need in the marketplace. Magnus’s vision was to create the world’s largest supplier of destination content to distributors using a very simple CMS platform flexible enough for destinations to upload relevant and interesting content, and easy enough for distribution partners to implement as a solution to their customers. \nJust 10 years later, Aideborn’s dream has been realized with over 550 destination partners and travel experts uploading content on a frequent basis, including inspiring photos, videos and copy, which is distributed to over 340 major, global travel brands around the world including international airlines, OTA’s, cruise companies, search engines, inflight entertainment systems, travel agencies and tour operators. \nLately momentum for this product has reached fever pitch with some of the world’s most recognized brands and influential travel service partners coming on board as distribution partners, including rentalcars.com, SAS, AirBerlin, and AAA, the largest motor club and leisure travel organization serving North America with over 54 million members. \nAideborn, CEO of ArrivalGuides says, “Partnering with AAA, and many of the world’s most recognized brands in the tourism and travel industry speaks to the quality of information provided by ArrivalGuides. Arriving at this place in the timeline of our business has been exciting.” \nWhen asked how success was achieved in a relatively short space of time, Aideborn replied, “We created a very simple to use CMS which is very attractive to destinations who understand the importance of content distribution. This included built-in reminders which we call the ‘freshness factor’ to ensure that destinations are providing the latest and most up-to-date information about their destination.” \n“Destinations find the information layout and multiplatform presentation appealing and with our simple API, it allows them to integrate our products seamlessly into their current websites and other digital interfaces and communications including apps, booking confirmations, newsletters, Smart TV app and more. Our product is increasing brand loyalty and sales for our distribution partners, and we are about to do extra refinements to our platform to make our platform even more valuable to distribution partners, so watch this space.” \n“The guides are seen by destinations and distributors alike as an instrument to increase visitor engagement by providing key information during the planning and in-destination stages. There are many examples where distributors are attaching ArrivalGuides to every communication during the visitor journey.” \n“The link to the downloadable PDFs is one of the top drivers for clicks”, said Hayley Kerruish, Email Marketing Manager of Webjet and ZUJI Australia/NZ. “Integrating free destination guide information into our post-booking emails has improved our customer’s booking experience. We see a real demand for this information, driving CTR up, and we truly appreciate the ever expanding content ArrivalGuides delivers.” \nAideborn understood from early on that working with destinations meant providing a product which would deliver multiple benefits. Aideborn stated, “We wanted ArrivalGuides to be the premium platform for downloadable content guides and mobile app products. Destinations told us they needed us to help them create revenue streams, so we developed a ticketing solution giving the destination the ability to generate revenue through the sale of tickets for events, attractions and transportation, plus an and an ad revenue solution, allowing the destination to sell advertising in their guide to their member base.” \nAviva Pearson, President of ArrivalGuides said, “Our product is a self-fulfilling prophecy because as we grow our destination partners, our library of guides expands, which attracts more distributors. We never lose sight of providing quality and strive to ensure that our product is the most accessible and informative destination information on the market. Our latest partnerships with AAA and WMS have placed us in a position that most companies strive for from the outset. We have many more opportunities ahead of us, including some exciting new partners, which will preserve our place as the leader in destination content distribution.” Source: ArrivalGuides", "external_links": [], "published": "2015-09-08T16:45:00.000+03:00", "crawled": "2015-09-08T18:49:14.817+03:00", "highlightTitle": ""}