{"organizations": [], "uuid": "6ca5a9daec6c5158e8a192d21737d7ae3a41471f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://www.telegraph.co.uk/template/ver1-0/i/telegraphFacebook.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-23.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/promotions/termsandconditions/11886127/england-wales-tickets-prize-draw-terms-and-conditions.html", "country": "US", "title": "England v Wales tickets prize draw: Terms and Conditions", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "England v Wales tickets prize draw: Terms and Conditions - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T01:31:00.000+03:00", "replies_count": 0, "uuid": "6ca5a9daec6c5158e8a192d21737d7ae3a41471f"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/promotions/termsandconditions/11886127/england-wales-tickets-prize-draw-terms-and-conditions.html", "ord_in_thread": 0, "title": "England v Wales tickets prize draw: Terms and Conditions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MasterCard – Rugby World Cup 2015 England v Wales Tickets – Prize Draw Terms and Conditions 1. This prize draw is open to residents of the United Kingdom (England, Scotland, Wales and Northern Ireland) aged 18 years or over, except employees of Telegraph Media Group Limited and its group companies (“Promoter”), and MasterCard Europe sprl (“MasterCard”), their families, agents or anyone else professionally associated with the draw. 2. Details of how to enter form part of the terms and conditions. It is a condition of entry that all rules are accepted as final and that the competitor agrees to abide by these rules. The decision of the judges is final and no correspondence will be entered into. 3. To enter this prize draw, entrants must visit: www.telegraph.co.uk/promotions/competitions and complete the required fields on the entry form. Entry is restricted to one per person and once submitted, entries cannot be amended in any way. 4. Late, illegible, incomplete, defaced or corrupt entries or entries sent through agencies and third parties will not be accepted. No responsibility can be accepted for lost entries and proof of despatch will not be accepted as proof of receipt. The winners will be drawn at random from all entries received by the closing date. The winners’ names and counties can be obtained by sending a stamped addressed envelope to MasterCard – RWC 2015 England v Wales Tickets Prize Draw Winners, SPARK, Telegraph Media Group, 111 Buckingham Palace Road, London SW1W 0DT within one month after the closing date of the prize draw. 5. All entries must be received by 09:00 on Thursday, September 24, 2015. 6. The winners will be contacted by the Promoter by telephone by 11am on Tuesday, September 24, 2015. Should the Promoter be unable to contact a winner by this deadline or should a winner be unable to accept their prize, the Promoter reserves the right to award that prize to an alternative winner, drawn in accordance with these terms and conditions. 7. The prizes as described are available on the date of publication. Should a prize become unavailable, a substitute of equal value will be provided. 8. Two winning entrants will each receive two tickets to England v Wales at Twickenham on September 26, 2015 at 8pm. 9. Each winner and his/her guest(s) as applicable agree to comply with the terms and conditions applicable to the issue and use of tickets from time to time (as available and set out at https://tickets.rugbyworldcup.com/staticpages/termsandconditions.aspx or such other webpage as determined by Rugby World Cup Limited (“RWCL”) from time to time) and all applicable RWCL, the tournament organiser (England Rugby 2015, “ER2015”) and venue owner or operator rules and regulations relating to access to Rugby World Cup venues and any other areas associated with Rugby World Cup (including any terms of accreditation determined by RWCL). Further each winner and his/her guest(s) acknowledge that he/she may be required to enter into a direct acknowledgement and/or agreement with RWCL and/or ER2015 concerning use of the tickets and compliance with ticket terms and conditions prior to receiving the prize. 10. Any winners and/or guest(s) shall not, while using any Rugby World Cup tickets, display or publicize any political slogans or homophobic language, images of a lewd or explicitly sexual nature, images containing logos of competitors and overt brand sponsorship or anything else deemed to be ambush marketing or an abuse of the Rugby World Cup, content which is defamatory, obscene, illegal, vulgar, offensive or otherwise unsuitable or infringes others’ rights (including intellectual property rights) or reflects negatively upon any of RWCL or the Rugby World Cup. Each entrant agrees and acknowledges that any breach of this clause 10 will cause significant damage and loss to RWCL. 11. The prizes do not include travel to or from the event, accommodation, food and drink personal expenditure or incidental costs. 12. The prizes are subject to availability, non transferable and there are no cash alternatives. 13. The winners may be required to participate in reasonable publicity on behalf of MasterCard and the Promoter. 14. Entrants’ data will be used for the purpose of administration of this prize draw and in accordance with the permissions granted or withheld at the point of entry. The Promoter may pass personal information relating to prize winners to RWCL and/or ER1015 (and any of their service providers or agents) for the purposes of monitoring the distribution and use of Rugby World Cup tickets and related experiences and, in the event of a suspected breach of any terms and conditions, rules or regulations of RWCL and/or ER2015 relating to the use of such tickets and/or experiences, investigating and taking action against such winners. 15. This promotion is run by the Promoter with the permission RWCL. Accordingly the Promoter is responsible for the operation of and all matters and concerns relating to the promotion, not RWCL or any other persons involved in the staging of Rugby World Cup 2015 (including ER2015) and World Rugby (formerly the International Rugby Board), all of whom shall not be responsible for or liable to entrants in any way whatsoever in connection with this promotion. 16. Events may occur that render the prize draw itself or the awarding of the prizes impossible due to reasons beyond the control of the Promoter. Accordingly the Promoter may, at its absolute discretion, vary or amend the promotion and the entrant agrees that no liability shall attach to the Promoter as a result thereof. 17. The Telegraph is responsible for the administration of the promotion, which includes the publication and adjudication of the prize draw. Provision of the prizes is the responsibility of MasterCard and its agents. 18. These Terms and Conditions are to be interpreted in accordance with English law and any dispute arising out of these Terms or their subject matter is subject to the exclusive jurisdiction of the English Courts. Promoter: Telegraph Media Group Limited, 111 Buckingham Palace Road, London SW1W 0DT. telegraph.co.uk Follow @telegraph", "external_links": ["https://tickets.rugbyworldcup.com/staticpages/termsandconditions.aspx"], "published": "2015-09-24T01:31:00.000+03:00", "crawled": "2015-09-23T22:43:40.698+03:00", "highlightTitle": ""}