{"organizations": [], "uuid": "8030884d18adeb0f6cfa2386176b62e63fd5574a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03433/Fresh_Australian_v_3433276k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-11.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/australian-food-wine/11851877/australias-best-food-markets.html", "country": "US", "title": "Local produce key to Australia’s best food markets", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Local produce key to Australia’s best food markets - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T19:32:00.000+03:00", "replies_count": 0, "uuid": "8030884d18adeb0f6cfa2386176b62e63fd5574a"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/travel/australian-food-wine/11851877/australias-best-food-markets.html", "ord_in_thread": 0, "title": "Local produce key to Australia’s best food markets", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "There is pretty much nothing Australia cannot grow or produce. Less than 10 per cent of its retail food is imported and two-thirds of its land is given over to farming. Head to the many spectacular city food markets and you will be amazed by the sheer variety and richness on offer from both land and sea. Canberra, Capital Territory The area around Australia’s capital is abundant with fruit and veg reflected in the Capital Region Farmers Market at Exhibition Park, Canberra, one of the biggest and most authentic markets in the country regularly attracting more than 100 stallholders. Another institution for showcasing produce is Fyshwick Fresh Food Markets just south of the city centre. Three Seeds cooking school hosts regular demonstrations. Sydney, New South Wales Australian farming effectively began in this state and Sydney is Australia’s biggest, hungriest city, packed with food markets at the weekend. Chief among them is Eveleigh Market an award-winning, undercover Saturday market at Carriageworks selling everything from weekly dependables to buffalo mozzarella, edible flowers and heirloom tomatoes. If you love seafood, try Sydney Fish Market where you can take behind-the-scenes tours, learn to prepare fish and tuck into the freshest of catches prepared right in front of you. Darwin, Northern Territory Though the most sparsely populated state, the Northern Territory is also very diverse ethnically and the source of some of Australia’s most exotic food, such as mangoes and passionfruit. In Darwin’s northern suburbs, colourful Rapid Creek market is one of the city’s oldest and busiest, boasting huge variety including aubergines, okra, Asian fruits, herbs and spices. Running April to October the popular Mindil Beach Markets attracts locals to buy produce and graze on goods such as crocodile burgers and tropical passionfruit and dragonfruit sorbets, then watch the sun set on the eponymous beach. Queensland This huge north-eastern state has the highest proportion of land area in Australia dedicated to agriculture in the shape of crops, fruit and cattle. Located on the city’s waterfront, sprawling Port Douglas Markets in Anzac Park has stalls selling everything from locally caught seafood to pineapples. Further south, the state capital of Brisbane has no shortage of markets. Jan Powers Farmers Markets offers a huge variety of stalls and produce across four locations – New Farm, Queen Street, Manly Harbour and Mitchelton. On Saturdays, Brisbane MarketPlace in Rocklea is a magnet for foodies looking for fresh produce, deli food and cuisine. Melbourne, Victoria Half of Aussie farms are given over to cattle and Victoria is a key state, especially the area known as Gippsland. Inevitably it’s a major centre of the country’s dairy industry too, with high-quality cheese, butter, cream and yogurt. On top of that it’s one of the key wine regions of Australia. In Melbourne, head to Queen Victoria Market which has been running since 1878 and is one of the largest in the southern hemisphere. No secrets here, it’s simply packed with stalls laden with fantastic fresh produce, deli foods and drinks. Perth, Western Australia Littered with great surf beaches, the Margaret River region produces award-winning wines as well as top-quality produce. State capital Perth has a number of farmers’ markets, notably Midland Farmers Market every Sunday on Old Great Northern Highway and City Farm Organic Growers Market selling organic local fare every Saturday. One of the state’s finest and best-known markets can be found just outside the city in a fine old Victorian building on Fremantle’s waterfront . It’s filled with all manner of traders serving fresh meat and veg, deli-style wares, bread, drink and various attractions in which to lose yourself. Tasmania The island’s cool climate gives its home-grown produce a special twist. In the capital Hobart, open-air Salamanca Market is an institution for fresh vegetables at the weekend. If you want meat and seafood, the covered Fresh Central Markets in Moonah, open Wednesday to Sunday, is the place to go. Sunday’s Farm Gate Market (farmgatemarket.com.au) has great meat stalls offering free-range Berkshire pork, game meats and rare-breed beef plus some of the great artisan cheeses for which the island is known. In the north of the island, Launceston Harvest Market is a weekly collective of all-Tasmanian stallholders selling wares including organic cider, marinated olives and cold-pressed walnut oil. Discover Australia with Etihad Airways, voted the World’s Leading Airline at the World Travel Awards. Etihad offers daily flights from London, Manchester and Edinburgh via Abu Dhabi to Sydney, Melbourne, Brisbane and Perth from just £655 per person. Terms and conditions apply. You may also be interested in: • Food festivals for all in Australia • A Taste of Australia with Donna Hay • The best destination for food and wine Looking for a gourmet getaway? Find inspiration for your next foodie holiday at telegraph.co.uk/tasteofaustralia", "external_links": [], "published": "2015-09-11T19:32:00.000+03:00", "crawled": "2015-09-11T14:29:39.543+03:00", "highlightTitle": ""}