{"organizations": [], "uuid": "4eaec5256c4cc70d2d051db6914e2a0c407745a1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "buyingbusinesstravel.com", "main_image": "", "site_section": "http://buyingbusinesstravel.com/rss.xml", "section_title": "Buying Business Travel", "url": "http://buyingbusinesstravel.com/feature/2524749-destination-kazakhstan", "country": "IE", "title": "Destination: Kazakhstan", "performance_score": 0, "site": "buyingbusinesstravel.com", "participants_count": 0, "title_full": "Destination: Kazakhstan", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T16:47:00.000+03:00", "replies_count": 0, "uuid": "4eaec5256c4cc70d2d051db6914e2a0c407745a1"}, "author": "", "url": "http://buyingbusinesstravel.com/feature/2524749-destination-kazakhstan", "ord_in_thread": 0, "title": "Destination: Kazakhstan", "locations": ["Astana", "Western Europe", "Kazakhstan", "London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Tom Newcombe Fri"], "text": "0 comments Tom Newcombe Fri, 25 Sep 2015 13:47 Follow @thomasnewcombe Looking from the aircraft window as I fly into Kazakhstan’s capital city Astana, I’m struck by how vast and desolate the landscape is. There is little evidence of human activity and few distinguishing landmarks. The land­locked country could fit the whole of Western Europe inside it with room to spare, and has a population only twice the size of London.\nThe region was for centuries an im­portant trading point on the Silk Road between the West and Asia, and is now a major oil and gas producing nation: the Kashagan oilfield in the northern Caspian Sea is one of the world’s biggest oil finds in almost three decades.\nKazakhstan gained independence after the dissolution of the Soviet Union in 1991 and has since seen change happen at a rapid pace, with the country striving to step out from behind the ‘Iron Curtain’ and become a major business destina­tion. This is something that Katya Sowa, sales director at The Ritz-Carlton in the country’s second major city, Almaty, be­lieves can happen. “The country has great potential for investment and an excellent opportunity to become the regional hub of central Asia.”\nShe adds that, despite its wealth, and because the country is new, it still needs huge improvements if it is to reach its potential. “While there is still much to be done in terms of development, efforts are being made towards improving the situation. Kazakhstan needs to get into the ranking of top tourist destinations, not only as a strategy, but in terms of infrastructure development, environmen­tal safety and meeting the challenges of upcoming international events.”\nA clear winner \nThe country has been governed by 75-year old president and former steelworker Nursultan Nazarbayev for a quarter of a century. In April he won the country’s election with 97.7 per cent of the vote after a 95 per cent turnout rate. Kazakhstan’s increasingly marginalised opposition did not field a candidate in the election. The two other contenders, seen as pro-government, scored less than 3 per cent between them.\nDuring Nazarbayev’s time as president, the country’s economic growth has soared, especially since the turn of the century – its GDP growth is among the highest in the world since 2001, and GDP per capita has grown from US$700 in 1993 to US$12,000 today.\nInevitably, this is driving growth in busi­ness travel to the region. Charles Wong is a director in Carlson Wagonlit Travel’s Partners Network and believes when it comes to business travel in Kazakhstan the signs are all positive. He cites Expo 2017, which will be held in Astana and is expected to see more than two million visitors, and says the country is geographi­cally central for travellers from EMEA and APAC . “There are a number of ambi­tious projects designed to improve the infrastructure such as the new highway between western China and Europe,” Wong says, adding that CWT has seen an increase in bookings of 20 per cent over the past year, and this has included many major firms from pharma, IT and the construction sectors, as well as oil and gas.\nTo help attract more business travel spend, Kazakhstan is making progress in developing major trading partners in the UK and around the world. In 2013, David Cameron became the first serving British prime minister to visit the oil-rich nation and this year Kazakhstan’s prime minister, Karim Massimov, visited the UK.\nTrade links were further enhanced this year with the announcement that the government is introducing 15-day visa-free travel for citizens of 19 countries until 2017, when the scheme will be reviewed.\nAs demand for business travel to Kazakhstan grows, so does the need for infrastructure, especially accommodation. In 2014 there were just under 50,000 rooms – a rise of 13,000 in two years and, accord­ing to Kazakhstan’s tourist board, 73 new hotels will be commissioned over the next three years in Astana.\nAssel Mamazhanova, chairman of Kazakhstan’s tourism committee, ac­knowledges the need for improvements: “Kazakhstan is a large country and unfortunately the current transportation system and infrastructure is not in a good condition. But it’s something we realise needs to change and plans have started to improve it.”\nThe country’s growing popularity is something Paul East, chief operating officer at Wings Travel Management, be­lieves could affect demand in the future and make managing travel to the area easier. “The route network into Kazakhstan is already developed and will continue to grow as their infrastructure does – we have clients electing for direct and indirect flights to get there. However, in regards to hotels, there’s a wide range but they can be on the expensive side because of demand.”\nPublic image \nThe Ritz-Carlton’s Sowa says despite the boom in development the country still has an “image problem” and that must start to change and visitors need to begin seeing the positive side to Kazakhstan. “One of the main problems is lack of awareness,” says Sowa. “People still equate Kazakhstan with countries such as Uzbekistan, Kyrgyzstan and Af­ghanistan. But the standard of living and the pace of development here is differ­ent. Kazakh hospitality, like the Kazakh landscape, has no comparison anywhere in the world, and our goal is to tell and show this to the outside world.”\nThe country has a chance to enhance its image over the next few years as it hosts a number of key events, such as Universiade 2017 and Expo 2017.\nFuelling flights \nThe country’s national airline, Air Astana, (see review, p123) currently flies three-times weekly from London to the capital and on to Almaty. It also operates direct flights from other major European business destinations, such as Frankfurt and Am­sterdam. Air Astana CEO Peter Foster (see panel, p119) says: “From 2009 and up until the Crimean crisis of last summer, the airline experienced extremely strong growth – and even with the crisis, there is still growth in the Kazakhstan economy. A lot of that has been fuelled by investments and projects launched by the government to build infrastructure, and generate jobs and investments in what is a difficult period in terms of oil commodity prices.”\nAir Astana recorded a net profit of US$8.3 million for H1 this year, against a loss of US$36.4 million in the first half of 2014. Passenger numbers for the period were also up by 4 per cent to 1.82 million.\nMamazhanova says that improving the airports at Astana and Almaty is “crucial” to increasing business tourism. He adds: “At the moment there is a lot of construction at Astana with the new terminal due to be completed next year, and in Almaty the government is currently tendering for the reconstruction of part of the airport or a completely new one – that decision is still being processed.”\nAstana and Almaty \nIn 1997 the government replaced Almaty with Astana as the country’s capital city – the word meaning “the capital” in Kazakh. It’s a poster child for modern rich-city design, with buildings created by some of the world’s leading architects such as Norman Foster, and Adrian Smith + Gordon Gill.\nHowever, the difference between Foster’s redevelopment of Berlin’s Reichstag and Astana’s Khan Shatyr is pronounced – designed as a ‘lifestyle centre with world-class shopping’ , the building resembles a lopsided circus tent from the outside, while inside features include a miniature monorail and even a beach.\nEverywhere you look, the design is big, garish and shiny, with Dubai-style archi­tecture rising from the northern steppe. The presidential palace is an over-sized White House, topped with a spired, blue-and-gold dome.\nAnother Foster landmark is the US$58 million Palace of Peace and Accord. The building, made up of five storeys of triangular glass, was specifically designed to host a major congress this year. The complex is designed to accommodate large events, with the opera hall seating 1,500 people, as well as conference and banqueting halls.\nWings’ East sees Astana’s architecture as an attraction for the country. “Astana is very impressive, like a capital of an empire. Large avenues, big monuments, modern architecture, a lot of space and big shopping malls with major international brands,” he says. “This is also the general overview we have received from clients, and doing business there will only become easier over time as a more stable environment evolves.”\nAlmaty has a more Soviet-style feel than Astana. It may have lost its capital status but the city, located close to the Chinese border, is the larger of the two and chief conduit for the oil, gas and mineral resources.\nMajor hotels chains, such as Inter­continental, Ritz-Carlton and Holiday Inn, can accommodate for small meetings and larger events. The convention centre in the Saltanat WorldHotel has a spacious ballroom for up to 1,000 people and the Green Ballroom offers space for a further 300.\nBoth cities are undergoing significant transformation, and this can only be positive for the country’s future. Wings’ East adds: “As the economy grows so does the country. And with more and more com­panies entering Kazakhstan and starting to do business, it is putting itself on the world map.”", "external_links": [], "published": "2015-09-25T16:47:00.000+03:00", "crawled": "2015-09-25T18:01:50.184+03:00", "highlightTitle": ""}