{"organizations": [], "uuid": "80c0df2d159b6cb1ed3a1d363217ba0ccb21a3eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28665-ibis-styles-birmingham-airport-nec-hotel-opens", "country": "US", "title": "Ibis Styles Birmingham Airport NEC hotel opens", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Ibis Styles Birmingham Airport NEC hotel opens", "spam_score": 0.0, "site_type": "news", "published": "2015-09-07T18:30:00.000+03:00", "replies_count": 0, "uuid": "80c0df2d159b6cb1ed3a1d363217ba0ccb21a3eb"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28665-ibis-styles-birmingham-airport-nec-hotel-opens", "ord_in_thread": 0, "title": "Ibis Styles Birmingham Airport NEC hotel opens", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ibis Styles Birmingham Airport NEC hotel opens Ibis Styles Birmingham Airport NEC hotel opens Details Created   16:30 Hotel design transports guests to the swinging sixties Paying tribute to its location in the transport centre of England and the jet set era of the Swinging Sixties, the new ibis Styles Birmingham Airport NEC hotel is now complete and ready to welcome its first guests. Whether you’ve flown in from somewhere exotic or your journey is just taking off, the new ibis Styles Birmingham Airport NEC offers a stylish hub to touch down for the night. As is synonymous with the ibis Styles brand, the hotel’s design tells the story of its city location and echoes its distinct personality. The hotel is full of Brummie character and serious swing, from bears on bicycles (the city’s mascot) to loved-up lady sailors. \nIbis Styles is the boutique budget brand from the ibis family. Whilst ibis budget and ibis Hotel offer standardised features, fixtures and fittings, the ibis Styles brand enjoys greater flexibility when it comes to its uniquely designed hotels. As a result guests can experience all the fun, quirky elements of a boutique property with the quality assurances of a large and well-established hotel brand. Each ibis Styles hotel boasts its own distinct design, great location and ‘all-inclusive’ offer at a great price with loads of little extras! Inge Van Ooteghem, SVP Operations Economy and Budget Hotels, comments: “We are delighted to open ibis Styles Birmingham Airport NEC – a hotel that gives a retro nod to the era when travel was funky and a little bit cheeky too. We want our guests to experience the vibrancy and character of Birmingham from within the hotel walls, whether they are taking off on their holidays or doing business in the city.” “This is the second new opening for ibis Styles in as many weeks, with a further two hotels coming to Haydock and Barnsley in September. Ibis Styles is a growing economy brand in the UK, which places design and style, alongside comfort and quality, at its heart. It’s always exciting to see how the unique story and personality of each hotel will unfold and be embraced by guests.” Anchored in the heart of England, Birmingham has been a UK transport hot spot for decades. The original Mini Cooper was doing laps of the spaghetti junction long before heading out on any Italian Jobs, and here is where the cars were build too. Birmingham also has the busiest UK airport and train station outside of London, and more canals than Venice. It’s also a city that’s been perpetually in motion since long before Cliff was setting off on his Summer Holidays in a red double decker bus. You don’t have to be a mod to appreciate the sixties inspired design scheme, featuring cool greys permeated with orange, turquoise and lime. Colourful polka dots pop up in places, while spaghetti junction has been reimagined as a custom design on the carpets. Furnishings and lighting follow the space age shapes of the era and vivid prints of iconic industrial Birmingham structures hang on the walls. Guests can check in to the lounge bar, styled as an aeroplane wing, perching on diner style seating. Little passengers will love hopping on board a toy car, plane or double-decker bus, and jet-lagged guests can refuel over at the old petrol pump come coffee machine. Related articles", "external_links": [], "published": "2015-09-07T18:30:00.000+03:00", "crawled": "2015-09-08T02:31:01.674+03:00", "highlightTitle": ""}