{"organizations": [], "uuid": "fb0025b771d9ab2a5d3bca604a5b8a315b2722f5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://www.independent.co.uk/incoming/article10505336.ece/binary/original/millennium-stadium-cardiff.jpg", "site_section": "http://www.independent.co.uk/travel/uk/", "section_title": "The Independent | UK Travel news | UK Breaks and UK Holiday Reports ", "url": "http://www.independent.co.uk/travel/48-hours-in/cardiff-travel-tips-where-to-go-and-what-to-see-in-48-hours-10507343.html", "country": "GB", "title": "Cardiff travel tips: Where to go and what to see in 48 hours - 48 Hours In", "performance_score": 0, "site": "independent.co.uk", "participants_count": 1, "title_full": "Cardiff travel tips: Where to go and what to see in 48 hours - 48 Hours In - Travel - The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "fb0025b771d9ab2a5d3bca604a5b8a315b2722f5"}, "author": "Victoria Trott", "url": "http://www.independent.co.uk/travel/48-hours-in/cardiff-travel-tips-where-to-go-and-what-to-see-in-48-hours-10507343.html", "ord_in_thread": 0, "title": "Cardiff travel tips: Where to go and what to see in 48 hours - 48 Hours In", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Travel essentials\nWhy go now?\nOnce best known as the world's largest coal port and the birthplace of Dame Shirley Bassey, Cardiff is now renowned for its revived Victorian shopping arcades, craft beer pubs, blossoming arts scene and world-class collection of Impressionist art. It's also the home of Doctor Who.\nThe Welsh capital is one of 11 British cities hosting Rugby World Cup matches ( rugbyworldcup.com ), which run until 31 October. Six pool matches, starting with Ireland v Canada today, and two Quarter Finals, will be held at the 74,000-seat Millennium Stadium (1) on Westgate Street (0870 013 8600; millenniumstadium.com ).\nTouch down\nTrains to Cardiff Central station (2) are operated by First Great Western from London Paddington, Southampton, and Bristol, Arriva Trains Wales from Manchester, and CrossCountry from Birmingham and Nottingham (08457 484950; nationalrail.co.uk ). National Express (0871 781 8181; nationalexpress.com ) runs coaches from around the UK to Sophia Gardens (3).\nCardiff airport (01446 711 111; cardiff-airport.com ) is 12 miles west of the city in Rhoose in the Vale of Glamorgan, with train and bus links to the city centre. The airport is served by Flybe (0871 700 2000; flybe.com ) from Edinburgh, Glasgow and Jersey; Eastern Airways (0870 366 9100; easternairways.com) from Aberdeen and Newcastle; and Links Air (0844 800 2411; linksair.co.uk ) from Norwich and Anglesey.\nGet your bearings\nCardiff city centre grew up on the east side of the River Taff, and you can find out all about its development at The Cardiff Story (4), housed in the Grade II-listed Old Library in The Hayes (029 2078 8334; cardiffstory.com ; 10am-4pm daily except Sunday; free).\nAround the other side of the building on Working Street is a tourist information point (5). Cardiff's main tourist information centre (029 2087 3573; visitcardiff.com ; daily 10am-6pm) is located in the Wales Millennium Centre (6) in Cardiff Bay, a 10-minute bus journey south of the centre.\nThe Millennium Stadium (1) is opposite Cardiff Central (2). The main shopping area, focused on Queen Street (7) and the St David's Centre (8), is east of the station. To the north are Cardiff Castle (9) and the National Museum Cardiff (10).\nCheck in\nThe best address in town is the five-star St David's Hotel (11) at Havannah Street in Cardiff Bay (029 2045 4045; thestdavidshotel.com ). On the waterfront, the angular, contemporary building has an award-winning marine spa. Doubles from £99, room only.\nThe Royal Hotel (12), at 88 St Mary Street (029 2055 0750; royalhotelcardiff.com ), is where Captain Scott and his crew ate their last meal before their fateful trip to the Antarctic in 1910. The 60 bedrooms have had a boutique makeover and doubles start at £49.95, room only.\nOn the west side of the River Taff, in a Victorian townhouse, The River House (13) at 59 Fitzhamon Embankment (029 2039 9810; riverhousebackpackers.com ) offers the city's best budget accommodation. Doubles from £37, B&B.\nClick here to see a bigger image of the map\nDay one\nA walk in the park\nAfter exploring Cardiff Castle (9), a Victorian Gothic fantasy (029 2087 8100; cardiffcastle.com ; daily 9am-6pm (to 5pm from November to February; £12), stroll next door to its former garden, Bute Park (14). Named after the third Marquess of Bute, whose family built the 19th-century pile around its Norman predecessor, the 130-acre green space is famous for its tree collection. Find out about the park's wildlife and history at the Education Centre before picking up a leaflet for a self-led trail.\nLunch on the run\nAt the entrance to Bute Park, in the crenelated West Lodge on Castle Street, is Pettigrew Tea Rooms (15) (029 2023 5486; pettigrew-tearooms.com ). Best known for its delicious cakes, Pettigrew is also open daily for breakfast and light lunches, including a ploughman's made with Welsh ham and cheese (£8).\nWindow shopping\nThe most interesting shopping in Cardiff is to be found in the Victorian arcades off St Mary Street. In Castle Arcade, Madame Fromage (16) in unit 18 (029 2064 4888; madamefromage.co.uk ) has more than 150 cheeses including around 40 from Wales.\nArt lovers should head to Morgan Arcade, where Fountain Fine Art (17) in units 6-8 (029 2034 1449; fountainfineart.com ; closed Sunday and Monday) represents 45 leading Welsh artists, sculptors and printmakers. Also here is Spillers (18), in unit 27 (029 2022 4905; spillersrecords.co.uk ; closed Sunday), which claims to be the world's oldest record shop.\nA five-minute walk south to West Canal Wharf brings you to Jacobs antiques market (19) (029 2039 0939; jacobsmarket.co.uk ; open Wednesday to Saturday) where 30 stalls stock furniture, comics, vintage clothes and more.\nAn aperitif\nCardiff's craft beer scene is booming and the place to sup is Urban Tap House (20) at 25 Westgate Street (029 2039 9557; urbantaphouse.co.uk ), which is owned by the Newport-based Tiny Rebel brewery. Try Cwtch (Welsh for \"cuddle\"), a Welsh red ale, voted Champion Beer of Britain at the 2015 Great British Beer Festival. The pub, housed in a Grade II-listed red-brick Victorian building opposite the Millennium Stadium (1), also serves the best burgers in town.\nDining with the locals\nIn a former bank vault, The Potted Pig (21) at 27 High Street (029 2022 4817; thepottedpig.com ; closed Sunday evening and Monday) has a modern British menu with French and New York influences. Try the char- grilled pigeon with poached pear (£7) followed by wild Welsh mullet with samphire and cockles (£18), before relaxing on the leather Chesterfield with a Brecon Special Reserve (£3.50) from the 30-strong gin collection.\nPark House (22) at 20 Park Place (029 2022 4343; parkhouserestaurant.co.uk ; open Wednesday to Saturday, plus Sunday lunchtime) is a Grade I-listed building that was designed by William Burges, the architect behind Cardiff Castle. The wine list was voted AA Wine List of the Year for Wales 2013-14, and the menu is overseen by Michelin- starred chef Roger Jones. On the current seasonal menu are iced beetroot parfait (£12), Little Haven lobster (£36) and a seven-course taster menu (£69).\nCardiff Castle borders Bute Park, its former garden Day two\nTake A Ride\nTake the No 6 Baycar bus (£1.80 for an adult single or £3.60 for an all-day pass, exact change only) from the stop outside Wyndham Arcade (23) to Cardiff Bay.\nOut to brunch\nGet off the Baycar at the bottom of Lloyd George Avenue (24) and head for The Pure Kitchen (25) in The Flourish development (029 2049 3348; thepurekitchen.co.uk ). This health-food café is open from 7.30am on weekdays and from 9am at weekends. The breakfast menu, served until 11.30am, includes a chicken, chorizo and bacon omelette (£5.99), melon and berries (£4.99), and paleo steak and eggs (£8.25).\nTake a hike\nFormerly the notorious Tiger Bay, Cardiff's dock area has been redeveloped over the past 20 years into a pleasant waterside space. Check out the Welsh crafts at Craft in the Bay (26) in The Flourish (029 2048 4611; makersguildinwales.org.uk ), before crossing the road to the armadillo-shaped Wales Millennium Centre (6) (029 2063 6464; wmc.org.uk ), the country's leading arts centre, where there are usually some free performances at weekends.\nNext door is the Richard Rogers-designed Senedd (27), the home of the National Assembly, which can only be visited by pre-booked groups. Continuing along the waterfront, the Norwegian Church Arts Centre and Café (28) (029 2087 7959; norwegianchurchcardiff.com ) is where writer Roald Dahl was baptised. It will play a part next year in the centenary celebrations of his birth.\nFinally, you come to the Doctor Who Experience (29) (0844 801 3663; doctorwho.tv/events ; opening times vary; £14), the visitor attraction for the sci-fi TV series which is filmed in the BBC studios opposite.\nStroll back the way you came to Mermaid Quay – a development of shops, bars and chain restaurants. Sample one of the local Brains beers in Terra Nova (30) (029 2045 0947; terranovacardiff.com ), then pick up some Welshcakes from Fabulous Welshcakes (31) at 14 Bute Street (029 2045 6593; fabulouswelshcakes.co.uk ). Jump on the Aquabus (32) (029 2034 5163; aquabus.co.uk ; £4 one way) back to the city centre via the River Taff.\nCultural afternoon\nEnd your day at National Museum Cardiff (10) in Cathays Park (029 2039 7951; museumwales.ac.uk/cardiff ; closed Mondays; free). The collection of Impressionist and Post- Impressionist art was donated to the nation by coal-money heiresses the Davies sisters in the 1950s.", "external_links": ["http://museumwales.ac.uk/cardiff", "http://doctorwho.tv/events"], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T15:31:21.226+03:00", "highlightTitle": ""}