{"organizations": [], "uuid": "e22822197be2e4eba0b00a336f79122b29cc6760", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bootsnall.com", "main_image": "", "site_section": "http://feeds.bootsnall.com/bna/articles/", "section_title": "BootsnAll Travel Articles", "url": "http://www.bootsnall.com/articles/15-09/is-hitchhiking-unethical.html", "country": "US", "title": "Is Hitchhiking Unethical?", "performance_score": 0, "site": "bootsnall.com", "participants_count": 1, "title_full": "Is Hitchhiking Unethical?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T11:03:00.000+03:00", "replies_count": 0, "uuid": "e22822197be2e4eba0b00a336f79122b29cc6760"}, "author": "admin", "url": "http://www.bootsnall.com/articles/15-09/is-hitchhiking-unethical.html", "ord_in_thread": 0, "title": "Is Hitchhiking Unethical?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Is Hitchhiking Unethical? By Pamela MacNaughtan on September 22nd, 2015 With a backpack hanging from your shoulders, you extend your arm and raise your thumb, hoping a local driver will stop and agree to give you a ride to your desired destination. Maybe you’re hitchhiking because you’re low on travel funds, or perhaps it’s because there are no public transportation options available. Or maybe you’re hitchhiking in search of adventure. Whatever your reason, are you hitchhiking ethically? “…is it ethical to hitchhike without giving back to those who offer you a ride?” Hitchhiking, for the most part, is about getting from point A to point B without paying money, but when your travelling in poor countries, is it ethical to hitchhike without giving back to those who offer you a ride?\nBack in the day hitchhiking was commonplace, there were not many cars on the road, and gas was hard to come by. In North America people hitchhiked out of necessity, they were simply too poor to own a car, and there was no other way to get to their destination; aside from walking. That’s not the case today, in our current society cars are more common, and gas is generally easy to find, hitchhiking out of necessity is no longer common practice in North America. Are you being frugal? Or, selfish? There are countries where hitchhiking is more common, but similar to post war North America, the need to hitchhike is due to a lack of public transportation options, and in a way, hitchhiking is part of the local culture. If you’re on the side of the road, looking for a ride, in some cultures it is considered rude to not pick you up, but are you hitchhiking out of necessity, or are you doing it because you don’t want to spend money on a bus? “…there is a fine line between being frugal and selfish.” When we set off to travel the world, we don’t always think about the ethics of what we’re doing, and that is something we need to change. I get that as a hitchhiker you want to travel without spending a lot of money, most of us do, but there is a time and a place to be frugal. Travelling the world is a privilege, one that few can afford, and while the idea of travelling the world for free sounds ‘cool’, there is a fine line between being frugal and selfish.\nHitchhiking, instead of taking a local bus, because you don’t want to spend money (even though you have the money to spend), and not offering the driver some form of payment is not only selfish, but it’s unethical. Planning a RTW Adventure? Sign up for the free e-course > Their cultural realities When travelling in some second world, and many third world, countries, you are richer than the majority of the locals you are interacting with. Many will never leave their own country, travel is a fantasy that will never become a reality. Food can be scarce, their homes are probably worse than your bedroom, and things like vehicles and gas are luxuries that few can afford.\nIf a local chooses to pick up a hitchhiker they are doing it out of kindness, often not thinking about the added cost in fuel, due to the added weight in the vehicle. It’s not something one thinks about when they see someone in need on the side of the road, but that doesn’t means it’s okay to take advantage of their kindness without offering some form of payment. Hitchhiking is an opportunity to give, not just take Hitchhiking gives one an opportunity to give back, to make a positive impact on the lives of those who help you on the road. It’s an opportunity to learn about a new culture, make friends, and connections. “…think about the people helping you out, and find a way to help them in return.” If you’re strapped for cash, you can still make a positive impact with the locals who offer you a ride. Carry small bottles of vodka when in Russia, Central Asia, and Mongolia. Have a couple packs of cigarettes in Eastern Europe. By food and drinks for the driver along the way in Asia or Africa. They are many ways we can give back, all it requires is for you to think about the people helping you out, and finding a way to help them in return. This is how hitchhiking began, and it’s what’s missing from hitchhiking in today’s society.\nAs travellers we have an opportunity to learn about the world around us, to give back, and to share our experiences with others. Coasting through life doesn’t benefit anyone, including yourself, and while you can get away with it when you’re younger, as you get older you realize how much of a knob you were, and wish you had done more. “If you’re planning to hitchhike during your travels, do so ethically.” If you planning to hitchhike during your travels, do so ethically. Think about the country you’re visiting, and the life of the locals. Find ways to give back to those who help you out, take time to connect with them. Your experiences will be far richer, and your stories more interesting. And who knows, maybe you’ll find yourself along the way.\nCheck out the following articles and resources to help plan your travel budget:", "external_links": [], "published": "2015-09-22T11:03:00.000+03:00", "crawled": "2015-09-22T17:43:36.713+03:00", "highlightTitle": ""}