{"organizations": [], "uuid": "4c237a92eb40fdf5fca837cf24f0ba0272c8a605", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chicagotribune.com", "main_image": "http://www.trbimg.com/img-55ef6e7b/turbine/ct-trav-0920-midwest-events-20150903", "site_section": "http://feeds.chicagotribune.com/chicagotribune/travel/", "section_title": "Travel - Chicago Tribune", "url": "http://www.chicagotribune.com/lifestyles/travel/ct-trav-0920-midwest-events-20150903-story.html", "country": "US", "title": "Polka time in Galena just one of the Midwest fests", "performance_score": 0, "site": "chicagotribune.com", "participants_count": 1, "title_full": "Polka time in Galena just one of the Midwest fests", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T02:27:00.000+03:00", "replies_count": 0, "uuid": "4c237a92eb40fdf5fca837cf24f0ba0272c8a605"}, "author": "Phil Marty", "url": "http://www.chicagotribune.com/lifestyles/travel/ct-trav-0920-midwest-events-20150903-story.html", "ord_in_thread": 0, "title": "Polka time in Galena just one of the Midwest fests", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Polka time in Galena just one of the Midwest fests Galena Galena/Jo Daviess County Convention & There will be polka lessons and dancing plus German food and beer at Galena's Oktoberfest. There will be polka lessons and dancing plus German food and beer at Galena's Oktoberfest. (Galena/Jo Daviess County Convention &) By Phil Marty Chicago Tribune \nIllinois \nOct. 3 : Galena Oktoberfest. If you've always wanted to learn to polka, here's your chance. There will be polka lessons and dancing for those already in the know. Also, wiener dog races, German food, beer and more. 815-331-0180, www.galenaoktoberfest.com . Miles from Chicago: 165 Illinois ( Phil Marty ) \nSept. 25-27 : International Route 66 Mother Road Festival, Springfield. More than a thousand classic cars will cruise the streets the opening night, and the rest of the weekend will include car displays, competitions, live music, food and more. 866-783-6645, www.route66fest.com . Miles from Chicago: 210 \nIndiana \nSept. 24-27 : Lotus World Music & Arts Festival, Bloomington. Musicians from across the globe will perform, and there will be workshops and artisan exhibits. 812-336-6599, www.lotusfest.org . Miles from Chicago: 230 \nOct. 2-3 : Bavarian Beer Bash, Vevay. Craft breweries from Indiana, Kentucky and Ohio will offer more than 35 beers. There's also a homebrew competition and lots of live music. www.bavarianbeerbash.com . Miles from Chicago: 290 \nIowa \nOct. 10-11 : Scenic Drive Festival, Van Buren County. The Villages of Van Buren hold this festival each year during fall color time. Throughout the county there will be special events including antiques and collectibles sales, food vendors, fine art sales, live music, museum tours and much more. 800-868-7822, http://tinyurl.com/pmgkaut . Miles from Chicago: 300 \nMichigan 0 \nSept. 24-27 : Hell's Half Mile Film & Music Fest, Bay City. Independent films will be screened, and there's the opportunity to connect with the filmmakers. There will also be a variety of live music performances. www.hhmfest.com . Miles from Chicago: 320 \nSept. 26 : 2nd Annual Hops 'n' Highlands Microbrew Festival, Harbor Springs. This is the second year for Boyne Highlands resort to put on this fest. More than 40 Michigan microbreweries will serve upward of 150 beers. There will also be food trucks and live music, and there will be ziplining and free scenic chairlift rides. http://tinyurl.com/pun97kv . Miles from Chicago: 375 \nOct. 2-4 : Northwood University International Auto Show, Midland. This show has been going on for 50 years. There will be more than 500 vehicles on display, representing more than 65 manufacturers. There's also a classic car show the final day. http://tinyurl.com/qykg3lj . Miles from Chicago: 300 \nMissouri \nOct. 1-31 : Maple Leaf Festival, Carthage. This is the 49th year for this fest. Among activities during the monthlong celebration are a quilt show, live music, a bike tour, tractor show, model railroad show and a marching band festival. http://tinyurl.com/ngx5zpq . Miles from Chicago: 570 \nWisconsin \nSept. 26-27 : Geneva Lakes Boat Show, Fontana. People bring boats from all over the country for this annual show that features vintage and classic boats. Boats will be on display both days, and at 4 p.m. Saturday, there's a boat parade. 630-802-2698, www.genevalakesboatshow.com . Miles from Chicago: 85 \nSept. 26-27 : Maker Faire Milwaukee. Bearing some resemblance to a science fair, this event showcases inventors and makers exhibiting what they've produced and sharing their knowledge in a broad range of areas. There will also be workshops. www.makerfairemilwaukee.com . Miles from Chicago: 90 \nOct. 3-4 : 36th Annual Cranberry Fest, Eagle River. Lots of cranberry-related treats to buy, of course, as well as cranberry bog and winery tours, an antique market, farmers market, entertainment and a weaving and fiber artist show. http://tinyurl.com/qauxpe8 . Miles from Chicago: 330", "external_links": [], "published": "2015-09-09T02:27:00.000+03:00", "crawled": "2015-09-09T20:49:03.040+03:00", "highlightTitle": ""}