{"organizations": [], "uuid": "832f3a651b905b827076001f34884ffc88062603", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bostonglobe.com", "main_image": "http://c.o0bg.com/rf/image_585w/Boston/2011-2020/2015/08/31/BostonGlobe.com/Travel/Images/Black%20porgy%202.jpg", "site_section": "http://www.bostonglobe.com/lifestyle/travel", "section_title": "Travel - The Boston Globe", "url": "http://www.bostonglobe.com/lifestyle/travel/2015/09/05/tank-away-not-too-late-soak-beach-vibe-niantic/mmu6EvMnoNj2kfzxJHT8hO/story.html", "country": "US", "title": "Not too late to soak up the beach vibe in Niantic", "performance_score": 0, "site": "bostonglobe.com", "participants_count": 1, "title_full": "Not too late to soak up the beach vibe in Niantic - The Boston Globe", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "832f3a651b905b827076001f34884ffc88062603"}, "author": "Gary Santaniello", "url": "http://www.bostonglobe.com/lifestyle/travel/2015/09/05/tank-away-not-too-late-soak-beach-vibe-niantic/mmu6EvMnoNj2kfzxJHT8hO/story.html", "ord_in_thread": 0, "title": "Not too late to soak up the beach vibe in Niantic", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\nJonathan Wiggs/Globe Staff\nThe Book Barn sells used books and has two locations in Niantic.\nBy Gary Santaniello Globe correspondent September 05, 2015\nThe Nehantic tribe fished and gathered shellfish here, and English settlers sent fishing boats to the Georges Bank for halibut and cod from wharves jutting into Niantic Bay in the 1800s. Now, the crescent-shaped bay backs up to Main Street in Niantic, a village in the town of East Lyme. In the half-mile between where Pennsylvania Avenue intersects with Main Street and the Frosty Treat at the crest of the hill leading to Crescent Beach, there’s everything you need for a low-key summer sojourn. And the only chains you’ll find are a Dunkin’ Donuts and a small Subway storefront.\nSTAY\nShielded from the street, behind a small office building in the heart of the village, the Niantic Inn (345 Main St., 860-739-5451, thenianticinn.com , from $139) offers 24 studio and efficiency rooms in a quiet setting. You can walk to all you need from here. The Inn at Harbor Hill Marina (60 Grand St., 860-739-0331, www.innharborhill.com , from $220), overlooking the mouth of the Niantic River, has 16 individually designed guest rooms in a former Victorian home and a newer building, some of which include balconies and fireplaces. Chain motels abound at Exit 74 off Interstate 95, three miles away.\nDINE\nContinue reading below\nUnder different names and owners, Main Street Grille (252 Main St., 860-739-5000, www.mainstreetgrillenianticct.com , $12-18) has operated at the same location since 1955. It has the best selection of fresh seafood in the village, but plenty of meat and pasta dishes, too. The two-level deck in the back offers views of the water for diners. Across the street, The Black Sheep (247 Main St., 860-739-2041, www.theblacksheepniantic.com , $9-24) evokes a traditional Irish pub, with a tin ceiling, a mahogany bar, cozy dining nooks and a wonderful Shepherd’s Pie ($13). The Spice Club (239 Main St., 860-451-8121, thespiceclubct.com , $11-18) has built a steady clientele for its Thai/Japanese fare, some of it fiery, since it opened three years ago. Pizza and grinders are staples of the southeastern Connecticut diet, and this stretch of Main Street provides plenty of options, as well as dozens of benches for al fresco eating. Giuliano’s Bakery (284 Main St., 860-739-5495, giulianosbakeryniantic.com ) is well known for its Italian pastries and its grinders, the bread for which is baked on site. Guliano’s also sells Sicilian pan pizza by the slice. Devotees of the thin slice can get their fix at Ray’s New Haven Style Pizza (211 Main St., 860-739-4020, www.rayspizzaniantic.com ) just down the street. Its selection of seafood pizza includes the Deluxe (shrimp, clams, and calamari). Café SoL (346 Main St., 860-739-2933, www.cafesolniantic.com ) has wonderful breakfast and lunch sandwiches, as well as a shady outdoor patio.\nJonathan Wiggs/Globe Staff\nThe Hole in the Wall is a railroad underpass that lets people safely get access to the shore.\nDURING THE DAY\nThe waters of Long Island Sound are the siren song until the weather turns cold. McCook Point Park offers two beaches separated by a shady bluff perfect for picnics, strolling, and taking in the sound from Fisher’s Island to Montauk. At the other end of Main Street, “Amtrak Beach” is a half-mile stretch of sand and boardwalk between the railroad tracks and the water, part of Cini Park. From the same parking lot, the Black Hawk II (860-739-9296, www.blackhawksportfishing.com ) makes daily trips into Long Island Sound, where bluefish, striped bass, blackfish, and porgies are plentiful in season.\nNiantic Bay Bicycles (8 Methodist St., 860-691-0757, www.nianticbaybicycles.com ) stocks bikes for all riding levels and ages. The Crescent Beach and Black Point neighborhoods, with shoreline access and quiet streets, are close by.\nClouds or rain? No problem. There’s an eclectic mix of shops and boutiques on Main Street, and the Children’s Museum of Southeastern Connecticut (409 Main St., 860-691-1111, www.childrensmuseumsect.org , $7; children under 1 and members, free), an interactive learning and play area with nautical themes, will keep small kids entertained.\nFrom crafts festivals to fireworks, LobsterFest to Halloween Parade , there’s something going on most weekends. Check out www.discovereastlyme.com for an up-to-date schedule.\nAFTER DARK\nA local institution, Niantic Cinemas (279 Main St., 860-739-6929, www.nianticcinema.com ) shows first-run movies on three screens. Post-show, food, drink, shops, and the Book Barn Downtown (an annex of southeastern Connecticut’s largest and best used bookstore located a mile to the west) are steps away. So is Gumdrops & Lollipops Candy Shoppe (334 Main St., 860-739-7800, www.gumdropsnlollipops.net ), which makes more than 40 flavors of ice cream and 50 varieties of fudge on-site. Frosty Treat (440 Main St., 860-739-4647, www.frostytreatfun.com ) has been around since the ’60s and is open until 10 p.m. on weekends. And if you still don’t want to call it a night, the Black Sheep features live music on weekends year-round.\nGary Santaniello can be reached at gsantaniello@mac.com .", "external_links": ["http://www.innharborhill.com/", "http://www.mainstreetgrilleniantic.com/", "http://www.linkedin.com/shareArticle?mini=true&url=http%3A%2F%2Fwww.bostonglobe.com%2Flifestyle%2Ftravel%2F2015%2F09%2F05%2Ftank-away-not-too-late-soak-beach-vibe-niantic%2Fmmu6EvMnoNj2kfzxJHT8hO%2Fstory.html%3Fevent%3Devent25&title=Niantic", "http://giulianosbakeryniantic.com/", "http://thenianticinn.com/index.php", "http://www.gumdropsnlollipops.net/", "http://www.rayspizzaniantic.com/", "http://www.cafesolniantic.com/", "https://www.pinterest.com/pin/create/button/?url=http%3A%2F%2Fwww.bostonglobe.com%2Flifestyle%2Ftravel%2F2015%2F09%2F05%2Ftank-away-not-too-late-soak-beach-vibe-niantic%2Fmmu6EvMnoNj2kfzxJHT8hO%2Fstory.html%3Fevent%3Devent25&media=//c.o0bg.com/rw/Boston/2011-2020/2015/09/01/BostonGlobe.com/Travel/Images/03052008_05niantic2-6509825.jpg&description=The", "http://nianticbaybicycles.com/", "http://twitter.com/intent/tweet?text=Niantic", "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Flifestyle%2Ftravel%2F2015%2F09%2F05%2Ftank-away-not-too-late-soak-beach-vibe-niantic%2Fmmu6EvMnoNj2kfzxJHT8hO%2Fstory.html%3Fevent%3Devent25&t=Niantic", "http://www.facebook.com/sharer.php?u=http%3A%2F%2Fwww.bostonglobe.com%2Flifestyle%2Ftravel%2F2015%2F09%2F05%2Ftank-away-not-too-late-soak-beach-vibe-niantic%2Fmmu6EvMnoNj2kfzxJHT8hO%2Fstory.html%3Fevent%3Devent25%3Fevent%3Devent25&tNiantic", "http://thespiceclubct.com/"], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-05T23:39:41.544+03:00", "highlightTitle": ""}