{"organizations": [], "uuid": "9e4e1ab24151f330420572d4dab482d917372b17", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.beaumontenterprise.com", "main_image": "http://ww1.hdnux.com/photos/40/33/30/8500768/9/rawImage.jpg", "site_section": "http://www.beaumontenterprise.com/life/travel/collectionRss/Life-Travel-Heds-7477.php", "section_title": "Life Travel Heds", "url": "http://www.beaumontenterprise.com/travel/article/Exploring-outside-while-in-Europe-6470470.php", "country": "US", "title": "Exploring outside while in Europe", "performance_score": 0, "site": "beaumontenterprise.com", "participants_count": 1, "title_full": "Exploring outside while in Europe", "spam_score": 0.0, "site_type": "news", "published": "2015-08-28T06:01:00.000+03:00", "replies_count": 0, "uuid": "9e4e1ab24151f330420572d4dab482d917372b17"}, "author": "Rick Steves", "url": "http://www.beaumontenterprise.com/travel/article/Exploring-outside-while-in-Europe-6470470.php", "ord_in_thread": 0, "title": "Exploring outside while in Europe", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "gallery_overlay_open_thumbs|article-gallery-6470470|article-gallery-6470470|0 Image 1 of 2 \nIn Barcelona, locals still join hands and dance the everyone's-welcome \"sardana\" in front of the cathedral almost every Sunday. Photo: Cameron Hewitt, Rick Steves' Europe In Barcelona, locals still join hands and dance the... Image 2 of 2 \nWannabe vocalists can perform to a crowd at Berlin's Wall Park, which has what must be the world's largest karaoke stage Photo: Rick Steves Wannabe vocalists can perform to a crowd at Berlin's Wall Park,... Exploring outside while in Europe 1 / 2 gallery_thumbs_close|article-gallery-6470470|article-gallery-6470470|0  6470470|article-gallery-6470470|0 \nAfter spending the springs and summers of the last several decades in Europe, it seems to me that, more and more, the culture is celebrated outdoors. \nCities and towns everywhere are competing to attract tourists; there is more than enough music, drink, theater and fun to keep these concerts and festivals going and growing. Make it a point in your travels to enjoy the scene outdoors — by day and by night. Here are a few random examples of how to put this cultural sparkle into your next trip. \nI don’t build my travel itineraries around festivals, but I’m constantly happening upon fun events. When I check into a hotel, I always ask, “What’s happening tonight?” This spring I was in Florence the night before May Day during a huge blowout called “ Notte Bianca ” ( White Night ). All the museums had free admission and were open late, restaurants were hopping, music and dancing filled the streets, and everyone was outside. \nOver the years I’ve learned that when you hit an unexpected festival, rather than stay in your hotel room and complain about the noise, the best response is to get out in the streets and make them even noisier. \nIt’s easy to join in the hubbub in Barcelona, where neighborhood festivals jam the calendar. People congregate on the central “Times Square” of the city, Placa de Catalunya, to watch soccer matches on the big screen, to demonstrate, to celebrate, and to enjoy outdoor concerts and festivals. When you visit, make it a point to watch or participate in the patriotic sardana dance, held in front of the cathedral on Sundays at noon (except in August). \nGathering in circles and holding hands, dancers raise their arms — slow-motion, “Zorba the Greek”-style — as they hop and sway gracefully to the music. The band consists of a long flute, tenor and soprano oboes, strange-looking brass instruments, and a tiny bongo-like drum called a tambori. For some, the sardana is a highly symbolic, politically charged action representing Catalan unity — but for most it’s just a fun chance to kick up their heels. \nDuring my last visit to Scotland, I was lucky enough to catch a Highland Games festival in the Perthshire village of Kenmore on the one day a year it takes place (others happen across Scotland every summer weekend; see Visit Scotland’s Highland Games Guide). On the banks of Loch Tay, the open field was filled with families having a delightful time watching games of tug-of-war, gunnysack races, marching bands of kilted pipers, and Highland dancing. \nWhile dancers impatiently and anxiously awaited their time with the bagpiper onstage, the big boys took turns tossing big things: Stones, hammers and cabers — logs the size of small telephone poles — were sent end over end, to the delight of those gathered. \nOne of my new favorite outdoor sights is the Mauerpark (“Wall Park”) in Berlin, where a large stretch of the Berlin Wall has been preserved as a memorial to the victims of the Cold War. Last summer, on a sunny Sunday afternoon, I watched as people enthusiastically spray-painted wild and crazy graffiti art onto the concrete barricade — once a “death strip” patrolled by border guards determined to keep communist East Germany separate from the West. \nNow hundreds gather, everyone from children gleefully swinging on playground equipment to flea market shoppers, to a would-be Sinatra singing “New York, New York” at a huge karaoke party. On the remains of a horrible wall, freedom is dancing — and the outdoor action feels like a celebration of life. \nIn Vienna, the crowd is a little more refined, but no less enthusiastic. Every spring and fall you can enjoy opera and ballet performances under the stars via live broadcasts on a huge LED screen outside the Vienna State Opera . In July and August, opera-related films are projected in front of the Neo-Gothic facade of City Hall. At twilight, the park in front fills with thousands of people enjoying a food circus of 24 simple stalls. \nThere’s not a paper plate or plastic cup anywhere — just real plates and glasses, as Vienna wants the quality of eating to be as refined as its music. A kid on a tiny green truck toddles by, reminding me this is a multigenerational scene. These events are free, with the purpose of developing people’s appreciation of classical music and high culture — both of which city officials want to keep entwined with Vienna’s image. \nNo matter where you travel in Europe in the summer, outdoor events are a cultural carnival — and a wonderful way to mix it up with locals. Any culture has plenty to share. When an outside opportunity presents itself, make it a habit to say “yes.” \nRick Steves writes European travel guidebooks and hosts travel shows on public television. E-mail: rick@steves.com Top Stories", "external_links": [], "published": "2015-08-28T06:01:00.000+03:00", "crawled": "2015-09-02T04:51:37.480+03:00", "highlightTitle": ""}