{"organizations": [], "uuid": "9588f4ba9d59fa99d941a0ba63d692588fbe9d46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://feeds.feedburner.com/Eturbonews-TravelAndTourismIndustryNews", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64308/us-travel-community-welcomes-faa-patch-urges-comprehensive-bill", "country": "US", "title": "US travel community welcomes FAA patch, but urges comprehensive bill", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "US travel community welcomes FAA patch, but urges comprehensive bill", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T23:44:00.000+03:00", "replies_count": 0, "uuid": "9588f4ba9d59fa99d941a0ba63d692588fbe9d46"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64308/us-travel-community-welcomes-faa-patch-urges-comprehensive-bill", "ord_in_thread": 0, "title": "US travel community welcomes FAA patch, but urges comprehensive bill", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US travel community welcomes FAA patch, but urges comprehensive bill     \nWASHINGTON, DC - US Travel Association President and CEO Roger Dow today released the following statement applauding the passage of HR3614, the Airport and Airway Extension Act, which continues funding for the Federal Aviation Authority (FAA) through March 31, 2016: \n\"The U.S. Travel community is grateful to Chairman Shuster, Ranking Member DeFazio and leaders in both chambers for ensuring that the operations of the FAA continue without interruption. \n\"But Congress as a whole needs a new approach to transportation policy. We cannot continually apply a Band-Aid to an air travel system that is hemorrhaging dollars for the U.S. economy In 2013 alone, passengers avoided 38 million trips due to infrastructure-related flying hassles, costing the economy more than $35 billion. \n\"FAA reauthorization represents an opportunity to bolster and revitalize passenger air travel in this country, but only if the measure takes a comprehensive approach to the problems in the system. A transformational bill will only live up to its name if it improves the weakest links in the system, tackling infrastructure and fostering choice for travelers by restoring air travel competition. \n\"We appreciate the dynamics at play on Capitol Hill nowadays, so we have crafted an airport modernization proposal that addresses this critical issue by coupling a tax cut on flyers with a long-overdue adjustment to the Passenger Facility Charge. It's the closest thing to a win-win you're going to find in Washington in this day and age. We urge Congress to give it a look when this temporary measure expires in March.\"", "external_links": [], "published": "2015-09-29T23:44:00.000+03:00", "crawled": "2015-09-30T00:35:30.502+03:00", "highlightTitle": ""}