{"organizations": [], "uuid": "bb4a5f987b2c68d48033791a511e94de57acb024", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03426/theinternB_3426783k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-14.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/goodlife/11839119/Apprenticeships-arent-just-for-the-young.html", "country": "US", "title": "Apprenticeships aren't just for the young", "performance_score": 1, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Apprenticeships aren't just for the young - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T15:00:00.000+03:00", "replies_count": 0, "uuid": "bb4a5f987b2c68d48033791a511e94de57acb024"}, "author": "Saffron Alexander", "url": "http://www.telegraph.co.uk/goodlife/11839119/Apprenticeships-arent-just-for-the-young.html", "ord_in_thread": 0, "title": "Apprenticeships aren't just for the young", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Once thought to be the territory of school leavers and those under 25, the concept of internships and apprenticeships is undergoing a change - albeit very slowly. While work placements for anyone over the age of 25 may seem like a pipe dream in the real world, Hollywood seems to be enthralled by the idea. This months', ' The Intern ' will see Robert De Niro starring as a 70-year-old widower who becomes a senior intern at an online fashion website and 2013's, similarly named, ' The Internship ' saw Vince Vaughn and Owen Wilson play middle-aged, recently redundant, salesmen who quickly learn the world doesn't cater to them anymore. For a growing number of people, an internship (often unpaid) or an apprenticeship is seen as a necessary and vital step towards employment . The days of walking into a job immediately after graduating are long gone and with more middle-aged workers opting to train for a second career, the young aren't just competing amongst themselves for jobs anymore, and experts say older workers are at a disadvantage. Vaughn and Wilson compete for an internship at Google Photo: Film Stills Mike Thompson, Director of Apprenticeships at Barclays, says those over a certain age can often find it difficult to find work: \"Once out of work, older workers face a much tougher task to find the opportunities to get back into full employment again.\" This is something 52-year-old Angela Bovell knows only too well: \"If you've been out of the job search for a while, it can be upsetting to be suddenly thrown back in,\" Angela says, \"it's demoralising when you keep on searching but nothing comes up. \"It used to upset me when I saw all these amazing jobs being advertised, but they were all for youngsters. They don't say it in the advertisement of course, but they don't want people my age.\" The traditional stereotypes of people over 50 no longer apply. It is never too late to learn new skills, take on new challenges and live life to the full Minister for Pensions, Baroness Altmann Angela is currently enrolled on the Barclays 'Bolder Apprenticeship Programme' - a scheme designed to \"extend opportunities\" and provide \"support for adults over the age of 24 wishing to get back into the workplace.\" After months of searching for a job, Angela says she cried when she received the phone call accepting her onto the programme: \"When my job advisor initially told me there was an apprenticeship that was available for the over 50s, I thought someone was playing a joke on me. I thought it must be a mistake - apprentices are for the young. \"After my initial shock went down, I applied and was called in for an interview. When they told me I'd got the job, I cried - they were happy tears, but I did cry. I kept asking them if they were sure, or if they'd made a mistake somehow. Things like this are unheard of for people my age.\" Angela at work at Barclays But, while rare, work placement schemes for older people are not unheard of. The government's provisional estimate for the number of over 45s expected to undergo an apprenticeship this year sits at over 40,000 - with over 2000 of this people being over 60. Last year, former skills minister Matthew Hancock said that encouraging older workers to apply for apprenticeships could help strengthen the economy : \"Demand from employers for adult apprenticeships is growing, because they help people of all ages, including the over 50s, to get and hold down skilled jobs.\" Despite the call for the over 45s to look towards less traditional methods of employment and an increasing amount of employers offering \"older apprenticeships\", Angela says not only are the opportunities rare, people don't know about them in the first place. \"There's definitely a demand for schemes like this. Since starting at Barclays, I've had people come up to me and say they want to do something like it, so it's a shame not more companies offer them. In the rare cases there are things like this available for people my age, they aren't well known. \"My daughter, who is looking for a job, told her advisor about me being on an apprenticeship and they didn't believe her. People don't know that older people can do apprenticeships as well.\" Minister for Pensions, Baroness Altmann applauds the practice of starting an apprenticeship in later life: \"Having a diverse workforce - including an age diverse workforce - enables a business to reflect its customer base; to better understand and better serve its whole range of clients. \"As we can look forward to living longer, we need to re-think what 'old' looks like - the traditional stereotypes of people over 50 no longer apply. It is never too late to learn new skills, take on new challenges and live life to the full.\" Robert De Niro plays a 70-year-old working at a vibrant online fashion website Photo: Film Stills In the upcoming 'The Intern', much of the comedic element rests on the visual gag of seeing Robert De Niro 's 70-year-old character amongst his considerably younger coworkers. In the real world, it's not that bad. \"Pretty much everyone is younger than me,\" says Angela, \"either in their twenties or thirties, but I've never had to worry about being the oldest person around. I was given training, learnt the terminology, and was also taught to be digital savvy. I also get on with young people anyway. I have two children in their twenties and thirties, so I can adapt. My age has never seen like a problem to me on this apprenticeship.\" Angela describes the experience as an \"amazing opportunity\" and encourages others her age to seek out apprenticeships - something experts are asking as well. Based on current employer plans, the government estimate that, within the next ten years, we will need to fill 13.5 million job vacancies, but only seven million young people will leave school or college during that time. Mr Thompson says offering apprenticeships for older workers will help \"provoide opportunities to unlock the talent that is being underutilised across all age brackets.\" @telegoodlife", "external_links": [], "published": "2015-09-14T15:00:00.000+03:00", "crawled": "2015-09-14T10:18:12.391+03:00", "highlightTitle": ""}