{"organizations": [], "uuid": "e50c15aeb63a3e6351e96544e5dacc780eea6fcb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2015/08/26/12927461/cozmo2-three-quarter-grizzly-fullsize.jpg", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/cozsmo_2_laptop_bag/leather_briefcase/prweb12927461.htm", "country": "US", "title": "WaterField Designs Unveils the American-Made, All-leather Cozmo 2.0 Laptop Briefcase", "performance_score": 1, "site": "prweb.com", "participants_count": 1, "title_full": "WaterField Designs Unveils the American-Made, All-leather Cozmo 2.0 Laptop Briefcase", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "e50c15aeb63a3e6351e96544e5dacc780eea6fcb"}, "author": "Heidi Marzke", "url": "http://www.prweb.com/releases/cozsmo_2_laptop_bag/leather_briefcase/prweb12927461.htm", "ord_in_thread": 0, "title": "WaterField Designs Unveils the American-Made, All-leather Cozmo 2.0 Laptop Briefcase", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "WaterField Designs , an innovative leader in custom laptop sleeves, bags and cases for digital-minded professionals, announces the Cozmo 2.0: an elegant, all-leather laptop briefcase . Thoughtfully designed details enhance the Cozmo’s functionality and comfort for professionals—from the padded laptop sleeve compartment and rolling suitcase slot to the off-set, ergonomically-friendly shoulder strap. An impeccably-crafted business attaché , the full-grain leather Cozmo 2.0 not only stands up on its own, but also stands out in a crowd. “We wanted to make the IDEAL business briefcase , and I think we’ve come really close,” explained owner Gary Waterfield. \"You can stow your laptop in the padded laptop compartment and have plenty of room for lots more gear. The dual leather handles are super comfortable and the off-set removable shoulder strap makes the bag feel weightless.”\nThe Cozmo 2.0 demonstrates WaterField’s commitment to artisanal American craftsmanship . Every stitch is precise. The Cozmo’s naturally-tanned, distressed, full-grain leather—sourced from a US Tannery—is soft and luxurious. A deep outside front pocket secures shut with a leather tab and classic metal screw stud. Waterproof zippers add to the sleek, modern lines of the handsome briefcase. A stiff (hidden) plate lines the bottom of the bag giving it structure to stand on its own.\nAdditional features address professionals’ daily needs. Dual zippers open the main compartment wide for easy access to the interior. A gold liner brightens the main compartment as if someone “turned a light on” inside. A padded laptop compartment lines one side; on the other, two internal hanging pockets add organization capability, and a key tether keeps keys or a pouch at hand in a hurry. Comfortable dual leather handles and an off-set, removable shoulder strap allow users to carry the Cozmo briefcase- or messenger-bag- style. The off-set strap keeps the bag from bouncing around and creates a weightless feel. A slide-through strip lines the exterior of the rear outside pocket allowing business travelers to slide the Cozmo onto a rolling suitcase.\nAvailability & Pricing\nThe Cozmo 2.0\nPrice: —$369. Full-sized—$389.\nTwo sizes: Compact—fits up to 13” laptop. Full-sized—fits up to 15” laptop.\nDimensions: Compact—14~16 x 11.5 x 4 inches; 2.4 lbs. Full-sized: 15.5~18 x 12.5 x 4.75; 2.9 lbs.\nMaterials: Naturally-tanned, full-grain, leather, metal stud closure, YKK waterproof zippers.\nColors: Chocolate or black.\nAvailable from the WaterField Designs' online store.\nMade to order and ships within 5 business days.\nAbout WaterField Designs\nWaterField Designs is an innovative San Francisco designer and manufacturer of bags and cases for tech-savvy consumers who want to stylishly and responsibly transport their technology. WaterField manufactures custom-fitted, high-quality cases and bags for a full-range of laptop computers, smartphones, tablets, gaming devices and other digital gear. All products are manufactured to exacting standards entirely in San Francisco. More information at “ Our Story .”", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuc2ZiYWdzLmNvbS9wcm9kdWN0cy9jb3ptby0yLWxhcHRvcC1iYWc=", "https://www.sfbags.com/collections/sleeves", "https://www.sfbags.com/collections/briefcases", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5zZmJhZ3MuY29t", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuc2ZiYWdzLmNvbS8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuc2ZiYWdzLmNvbS9jb2xsZWN0aW9ucy9icmllZmNhc2Vz", "https://www.sfbags.com/", "https://www.sfbags.com/products/cozmo-2-laptop-bag", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuc2ZiYWdzLmNvbS9wYWdlcy9hYm91dC11cw==", "https://www.sfbags.com/pages/about-us", "http://www.prweb.net/Redirect.aspx?id=aHR0cHM6Ly93d3cuc2ZiYWdzLmNvbS9jb2xsZWN0aW9ucy9zbGVldmVz"], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T15:28:11.904+03:00", "highlightTitle": ""}