{"organizations": [], "uuid": "dfd24199f2d8cf572747dc0f002b7097fe36587d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/news/lawmakers-make-stonewall-inn-a-national-park/ar-AAeziBy", "country": "US", "title": "Lawmakers: Make Stonewall Inn a national park", "performance_score": 0, "site": "msn.com", "participants_count": 1, "title_full": "Lawmakers: Make Stonewall Inn a national park", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T03:00:00.000+03:00", "replies_count": 0, "uuid": "dfd24199f2d8cf572747dc0f002b7097fe36587d"}, "author": "VERENA DOBNIK, Associated Press", "url": "http://www.msn.com/en-us/travel/news/lawmakers-make-stonewall-inn-a-national-park/ar-AAeziBy", "ord_in_thread": 0, "title": "Lawmakers: Make Stonewall Inn a national park", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Lawmakers: Make Stonewall Inn a national park Associated Press 12 hrs ago By VERENA DOBNIK, Associated Press © AP Photo/Richard Drew, File FILE - This May 29, 2014 file photo shows The Stonewall Inn, in New York's Greenwich Village. New York Sen. Kirsten Gillibrand and U.S. Rep. Jerrold Nadler annnounced Sunday, Sept. 20, 2015, that they will lead a campaign to designate Stonewall Inn as the first national park honoring LGBT history. The tavern was the scene of a 1969 uprising at a key moment for the nascent gay rights movement. NEW YORK — Two New York legislators are leading a campaign to designate Stonewall Inn as the first national park honoring LGBT history.\nSen. Kirsten Gillibrand and U.S. Rep. Jerrold Nadler made their announcement Sunday in front of the Greenwich Village tavern that was the scene of a 1969 uprising at a key moment for the nascent gay rights movement.\n\"When we look at our country, we have recognized women's rights, civil rights, all kinds of rights,\" Gillibrand said. \"The time has come to give this part of our history an imprimatur of national importance.\"\nThe two Democrats were joined by other elected officials and members of the National Parks Conservation Association and the Human Rights Campaign.\nNational parks can only be created by an act of Congress. They include sites of cultural or historic importance.\nGillibrand says she and Nadler are first asking President Barack Obama to declare Stonewall a monument. A congressional vote on park status would come later.\nGillibrand credited gay-rights activists for spurring action on giving greater recognition to the historic tavern raided by police more than four decades ago, triggering violent protests.\nDuring his second inauguration in 2013, Obama mentioned Stonewall and the struggle for LGBT equality as being on a par with women's and civil rights.\nStonewall would be the first park representing the gay community, but the fight isn't over, Gillibrand said.\n\"Same-sex couples don't have the same adoption rights, or the same federal benefits,\" she said. \"There's more work to do.\"\n ", "external_links": ["http://www.ap.org/"], "published": "2015-09-21T03:00:00.000+03:00", "crawled": "2015-09-22T05:39:38.981+03:00", "highlightTitle": ""}