{"organizations": [], "uuid": "e76ac455e5f660182f259100b6e96c09fb192ac2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30099649/bechtel-and-network-rails-reading-station-project-wins-major-uk-rail-award", "country": "US", "title": "Bechtel and Network Rail's Reading Station Project Wins Major UK Rail Award", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Bechtel and Network Rail's Reading Station Project Wins Major UK Rail Award - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "e76ac455e5f660182f259100b6e96c09fb192ac2"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30099649/bechtel-and-network-rails-reading-station-project-wins-major-uk-rail-award", "ord_in_thread": 0, "title": "Bechtel and Network Rail's Reading Station Project Wins Major UK Rail Award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Bechtel\nTeam Commended for \"Collaborative Working and Careful Planning\"\nLONDON , Sept. 23, Bechtel and Network Rail's work on Reading Station, one of the busiest railway stations outside London , has been honored with the 'Project of the Year' award at the UK rail industry's prestigious National Rail Awards. The seven-year Reading Station Area Redevelopment (RSAR) program has improved the track layout and doubled the station's capacity, allowing it to carry up to 30 million passengers a year, forecast by 2030. Reading Station was formally opened by Her Majesty Queen Elizabeth II last year. The redevelopment program was completed earlier this month a year ahead of schedule and under budget.\n\"This program was extremely complex given that we were working on an operational rail system. Careful planning and dedication ensured that we were able to get the job done right and safely,\" said Ailie MacAdam , general manager – Europe and Africa , for Bechtel's global infrastructure business. \"Collaboration between Network Rail, train operators, passengers and other stakeholders was essential to the success of Reading Station's transformation.\"\nThe National Rail Awards' judges praised the effectiveness of the program management, commenting, \"Overall, this has been a very impressive project, completed under budget and a year earlier than originally planned\". They also added, \"Collaborative working and careful planning were seen as key factors in this achievement.\"\n\"Reading Station and the surrounding area was one of the worst bottlenecks on the British railway network and has now been completely transformed through this program of works,\" said Robbie Burns , Network Rail's regional director for infrastructure projects, Western and Wales . \"Despite the difficult nature of this project, with work taking place on an operational railway and design changes along the way, the fact that this program has been delivered ahead of schedule and under budget is a real achievement.\"\nBechtel was selected by Network Rail in 2009 to provide project management services for the £3.1 billion Crossrail and Reading program, which aims to upgrade key parts of the UK rail system. A global leader in the rail industry, Bechtel has successfully delivered some of the largest and most complex rail projects in the world, including the Channel Tunnel, High Speed 1, San Francisco BART system and the Athens Metro. It is currently working on Crossrail and Vauxhall Underground Station, both in London , the Riyadh Metro, and the Rio de Janeiro Metro, and recently completed the Dulles Metrorail extension outside Washington, D.C.\nAbout Bechtel:\nBechtel is among the most respected engineering, project management, and construction companies in the world. We stand apart for our ability to get the job done right-no matter how big, how complex, or how remote. Bechtel operates through four global business units that specialize in infrastructure; mining and metals; nuclear, security and environmental; and oil, gas, and chemicals. Since its founding in 1898, Bechtel has worked on more than 25,000 projects in 160 countries on all seven continents. Today, our 58,000 colleagues team with customers, partners, and suppliers on diverse projects in nearly 40 countries. www.bechtel.com\nMedia contacts:\nJane Griffin\nT: +44 207 651 7907\nC: +44 7919 210640\njegriffi@bechtel.com\nLogo - http://photos.prnewswire.com/prnh/20130124/SF47758LOGO\n releases/bechtel-and-network-rails-reading-station-project-wins-major-uk-rail-award-300147960.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/bechtel-and-network-rails-reading-station-project-wins-major-uk-rail-award-300147960.html", "http://photos.prnewswire.com/prnvar/20130124/SF47758LOGO", "http://www.bechtel.com/", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20130124/SF47758LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=DC10023&Transmission_Id=201509231348PR_NEWS_USPR_____DC10023&DateId=20150923"], "published": "2015-09-23T03:00:00.000+03:00", "crawled": "2015-09-23T23:16:44.644+03:00", "highlightTitle": ""}