{"organizations": [], "uuid": "f33e056a7a2a5741ff807a84096da426a259b687", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/download-41.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/a-fresh-passion-for-india/", "country": "US", "title": "A fresh passion for IndiaTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "A fresh passion for IndiaTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "f33e056a7a2a5741ff807a84096da426a259b687"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/a-fresh-passion-for-india/", "ord_in_thread": 0, "title": "A fresh passion for IndiaTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A fresh passion for India\nThis year four British artists took themselves off as a group to Varanasi in India to capture the light, heat, people, buildings and landscapes and something of the way in which India seduces the visitor. The result is a stunning contemporary look at this most fascinating of Indian cities which is on view as an exhibition in London this October alongside a TV documentary that has also been made of their trip.\nThe stunningly vibrant works of Ken Howard, Patrick Cullen, Peter Brown and Neale Worley, were mostly done while painting en plein air. The result proves afresh that India captivates. Travelling together with their paints and easels the four artist friends worked in Varanasi exclusively and the results of the trip will be on show from Oct 13th to Nov 7th at the Indar Pasricha Gallery at 22 Connaught St, London. The collection of glowing works range in price from £700 to £20,000.\nThe four artists chose Varanasi as their subject as it is among the world’s oldest continually inhabited cities. After visiting this fabled city American author Mark Quote: : “It is older than history, older than tradition, older even than legend, and looks twice as old as all of them put together.” In the 19th and the first half of the 20th centuries Varanasi was considered by Europeans to be almost an abomination, misunderstood by them and a cultural threat, it is now seen as a city which is the accumulation of millennia of religious culture, a culture that is more understood.\nGallery owner, Indar Pasricha, says of this exhibition: “These four modern artistic Musketeers have been going to India as a group for years, bringing back images of the people, the ghats, the grand landscapes, the cities, and this year they have captured Varanasi in paint.”\nIndar who left India for Britain when he was seven years old says the works have reintroduced him to his motherland. “The work is very British yet the spirit of India is so evident in the paint and every brushstroke. You have Patrick Cullen’s colour, capturing the extraordinary kaleidoscopic palette of India; Ken Howard’s use of light and reflection; Peter Brown’s tangible sense of place, the dust, the mayhem – you can almost smell the street; and Neale Worley’s portraits which capture the grace and poise that is such a striking feature of so many Indians.”\nThis contemporary British tribute to India is led by a fantastic image of burning ghats on the Ganges river at dusk by Patrick Cullen which won a prize at this year’s Lynn Painter Stainers competition. The picture is alive despite the fact that it illustrates bodies being consumed in flame. He says: “For us India is all about light and colour and the incredible variety of subjects. It’s about the energy and the movement wherever you look. And above all it’s the sense of life flowing through everything, even through death. I was trying to capture the Hindu belief in death being just a part of the great continuous cycle of life. The fire that illuminates the darkening scene burns more brightly as the daylight fades. The fire is the fire of life. It burns continuously throughout every night and on into the dawn of each new day. And this has been going on for millenia.”", "external_links": [], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T18:02:42.748+03:00", "highlightTitle": ""}