{"organizations": [], "uuid": "aff02053444e8293a3c83aae598b1f98fa9f908d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://i.huffpost.com/gen/3468206/images/o-DAMIAN-GADAL-FLICKR-facebook.jpg", "site_section": "http://www.huffingtonpost.com/tag/travel-tips/feed", "section_title": "Travel Tips on Huffington Post", "url": "http://www.huffingtonpost.com/us-news-travel/top-6-experiences-in-sout_b_8198870.html", "country": "US", "title": "U.S. News Travel: Top 6 Experiences in Southern California", "performance_score": 0, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "U.S. News Travel: Top 6 Experiences in Southern California", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T22:01:00.000+03:00", "replies_count": 0, "uuid": "aff02053444e8293a3c83aae598b1f98fa9f908d"}, "author": "U.S. News Travel", "url": "http://www.huffingtonpost.com/us-news-travel/top-6-experiences-in-sout_b_8198870.html", "ord_in_thread": 0, "title": "U.S. News Travel: Top 6 Experiences in Southern California", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "reddit \nSand, surf and spectacular scenery are just a few reasons why Southern California lures travelers seeking a laid-back beach getaway. Beyond the picturesque shorelines across Malibu, Newport and Santa Monica , there are troves of can't-miss sights in Los Angeles , Orange County, Santa Barbara and San Diego , like Paramount Pictures, Anaheim- Disneyland and Balboa Park. But if you've already witnessed the glitz and glamour of Hollywood, the California cool vibes of Santa Barbara and the natural splendors of San Diego, carve out some time for checking out lesser-known gems without hordes of other travelers at your side. From surfing with pros in Malibu to horseback riding in Santa Barbara, here are six memorable So Cal experiences you won't want to miss. \nHorseback riding \nEmbracing Santa Barbara's fresh air and unique terrain on horseback is an excellent way to get a feel for its low-key seaside setting. There are plenty of horseback riding operators throughout the area. If you want to surround yourself in the Central Coast's tranquil landscape, book a horseback riding expedition with Santa Barbara Beach Horseback Rides, which offers guided rides along Butterfly Beach or along the bluffs that weaves past upscale mansions and celebrity homes. \nKayaking in Channel Islands National Park \nWhile you'll have no shortage of shoreline to choose from in Southern California, if you would rather take in the scenery by sea, you can kayak through Channel Islands National Park, which includes a chain of five islands off the coast of Santa Barbara. Tour companies like Channel Islands Outfitters offer guided kayak expeditions throughout Channel Islands National Marine Sanctuary and take participants to pristine snorkeling spots in sea caves along Scorpion Marine Reserve on Santa Cruz Island. \nJet ski on the ocean \nSouthern California boasts plenty of popular spots for jet skiing. Enjoy skimming the waves and keeping eyes peeled for dolphins and sea lions as you ski along Newport Beach Harbor. Balboa Water Sports, a reputable water sports company, offers hourly rentals and guided jet ski tours to Laguna Beach, passing through spots like Corona Del Mar, Emerald Bay and Crystal Cove. \nStand-up paddleboarding \nFor a memorable stand-up paddleboarding experience, head to Orange Country, where you can paddle through the harbors of Huntington Beach or Newport Beach on your own or with a professional surfer while taking in stunning water views. McKinnon Surfboards caters to novices and experienced paddlers alike with individual and group classes in both harbors to learn expert techniques and tricks for handling wake waves. Once you've learned the basics, you can try your hand at SUP (stand-up paddleboard surfing), which offers a challenging aerobic workout. \nCatch a professional surfing tournament \nHuntington Beach is also known as Surf City U.S.A. thanks to its plentiful beaches, laid-back vibes, consistently warm temperatures and ideal surfing conditions. Throughout the year, Huntington Beach hosts more than 50 surfing competitions. This past June, Huntington Beach hosted The Epic Big Board Ride, a competition where 66 former US Open surfers rode the \"largest surfboard\" along the south side of Huntington Beach pier to celebrate International Surfing Day. \nTake surf lessons with a pro surfer \nWhether you're an amateur or an experienced surfer, with tips from the experts in Malibu and Seal Beach, you'll be riding the waves in no time. The Malibu Pier is a popular spot for surfing with miles of pristine coastline and mild year-round temperatures. If you've ever dreamed of trying the sport for yourself, there is no shortage of groups willing to give you lessons. Learn to Surf LA offers private sessions with certified instructors throughout the year in Santa Monica and Zuma Beach in Malibu. \nDayvee Sutton is a two-time Emmy Award-winning journalist, public speaker and entrepreneur. She is the founder of www.daily-affair.com , where she and her team write about lifestyle topics. Follow @dayveesutton on Facebook , Twitter and Instagram . \nFollow U.S. News Travel on Twitter: www.twitter.com/USNewsTravel More:", "external_links": [], "published": "2015-09-25T22:01:00.000+03:00", "crawled": "2015-09-26T02:56:38.624+03:00", "highlightTitle": ""}