{"organizations": [], "uuid": "3d97a6cadb9cb691cbd9159a7322d8236acf1d45", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "goafrica.about.com", "main_image": "", "site_section": "http://z.about.com/6/o/m/goafrica_t2.xml", "section_title": "About.com Africa Travel: What's Hot Now", "url": "http://goafrica.about.com/library/bl.mapfacts.namibia.htm", "country": "US", "title": "Namibia Map and basic facts", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Namibia Map and basic facts", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T14:04:00.000+03:00", "replies_count": 0, "uuid": "3d97a6cadb9cb691cbd9159a7322d8236acf1d45"}, "author": "", "url": "http://goafrica.about.com/library/bl.mapfacts.namibia.htm", "ord_in_thread": 0, "title": "Namibia Map and basic facts", "locations": ["Angola", "Southern Africa", "South Atlantic Ocean", "South Africa", "Namibia"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Map and Basic Facts about Namibia Location: Namibia lies in Southern Africa, bordering the South Atlantic Ocean, between Angola and South Africa.\nLand Boundaries: Angola 1,376 km, Botswana 1,360 km, South Africa 967 km and Zambia 233 km. \nGeography: Size 825,418 sq km, slightly more than half the size of Alaska, US. The terrain is mostly high plateau with the Namib Desert along coast and the Kalahari Desert in east. Namibia has a desert climate, it is hot, dry and rainfall is very sparse and erratic. The lowest point is the Atlantic Ocean at 0 m and the highest point is at Konigstein which measures 2,606 m. Namibia is the first country in the world to incorporate the protection of the environment into its constitution. Some 14% of the land is protected, including virtually the entire Namib Desert coastal strip. \nPopulation: Almost 2 million people live in Namibia, it is one of the most sparsely populated countries in the world. Life expectancy is around 40 years. Birth rate is on average 4.6 per woman. 21% of the population is believed to have HIV/AIDS. Literacy rate is just over 84%. \nLanguages: English 7% (official), Afrikaans is actually the common language of most of the population including about 60% of the white population. German is spoken by 32% of the population. Indigenous languages include Oshivambo, Herero and Nama. \nEthnic Groups: Black 87.5%, white 6% and mixed 6.5%. About 50% of the population belong to the Ovambo tribe and 9% to the Kavangos tribe. Other ethnic groups are: Herero 7%, Damara 7%, Nama 5%, Caprivian 4%, Bushmen 3%, Baster 2%, and Tswana 0.5% \nReligion: Christian 80% to 90% (Lutheran 50% at least) and indigenous beliefs 10% to 20%. \nPolitical History: South Africa occupied the German colony of South-West Africa during World War I and administered it as a mandate until after World War II, when it annexed the territory. In 1966 the Marxist South-West Africa People's Organization (SWAPO) guerrilla group launched a war of independence for the area that was soon named Namibia, but it was not until 1988 that South Africa agreed to end its administration in accordance with a UN peace plan for the entire region. Namibia won its independence in 1990 and has been governed by SWAPO since. Hifikepunye Pohamba was elected president in November 2004 in a landslide victory replacing Sam Nujoma who led the country during its first 14 years of self rule. \nEconomic Overview: The economy is heavily dependent on the extraction and processing of minerals for export. Mining accounts for 20% of GDP. Rich alluvial diamond deposits make Namibia a primary source for gem-quality diamonds. Namibia is the fourth-largest exporter of nonfuel minerals in Africa, the world's fifth-largest producer of uranium, and the producer of large quantities of lead, zinc, tin, silver, and tungsten. The mining sector employs only about 3% of the population while about half of the population depends on subsistence agriculture for its livelihood. Namibia normally imports about 50% of its cereal requirements; in drought years food shortages are a major problem in rural areas. A high per capita GDP, relative to the region, hides the great inequality of income distribution; nearly one-third of Namibians had annual incomes of less than $1,400 in constant 1994 dollars, according to a 1993 study. The Namibian economy is closely linked to South Africa with the Namibian dollar pegged to the South African rand. Privatization of several enterprises in coming years may stimulate long-run foreign investment. Mining of zinc, copper, and silver and increased fish production led growth in 2003.", "external_links": [], "published": "2015-09-26T14:04:00.000+03:00", "crawled": "2015-09-26T15:59:39.457+03:00", "highlightTitle": ""}