{"organizations": [], "uuid": "042f0dd412cc4aec748a65d2d2fe45f264f46563", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.articlesfactory.com", "main_image": "", "site_section": "http://www.articlesfactory.com/rss/travel.xml", "section_title": "Recent Travel Articles", "url": "http://www.articlesfactory.com/articles/travel/travelling-around-singapore-using-the-public-transport-service.html", "country": "US", "title": "Travelling around Singapore using the public transport service", "performance_score": 0, "site": "articlesfactory.com", "participants_count": 1, "title_full": "Travelling around Singapore using the public transport service", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T05:18:00.000+03:00", "replies_count": 0, "uuid": "042f0dd412cc4aec748a65d2d2fe45f264f46563"}, "author": "MARTIN H LUTHER-2015-09-14T03:18:36-0400", "url": "http://www.articlesfactory.com/articles/travel/travelling-around-singapore-using-the-public-transport-service.html", "ord_in_thread": 0, "title": "Travelling around Singapore using the public transport service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  14, 2015 \nSingapore is known to be one of the best and the easiest cities in the world to get around for the ordinary travelers. This is because of the amazingly efficient and comprehensive public transport system of the city. \nSingapore is quite successful in building their public transport a cheap and viable option for all backpackers. Though in other terms the city is seen as quite expensive, but the transportation system here sticks to a reasonable budget that fits every traveller’s pocket. In a general point of view, this model of transport system should be followed by all the other big cities in the world. \nIn the city getting around the public transport system is quite easy and does not take a long time to get the hang of. But at the same time it can be a little scary for the average traveler who knows very little about the place and may only be spending a day or two in the city. \nSo to help you out with the tactic of navigating your way around this stunning country, here are a few tips and guidelines: \nThe way you should pay for your transportation in Singapore: The popular EZ Link cards- \nThe best and coolest way to pay for the transport service in Singapore is to buy one EZ link cards from any MRT station. The EZ cards are basically pre-paid contactless cards that you need to tap onto a scanner and use to pay for your journey on any bus, MRT or LRT service as well as for most of the taxis. These cards can even be used to pay for other services and goods at many of the Singapore malls and restaurants. \nOther places to buy these cards are the TransitLink ticket offices or at one of the passenger service centers in any MRT station. After the receipt of the card you can start using it immediately. Another place to buy these cards are the 7 - Eleven store or SingPost outlets where you would need to pay a nominal surcharge. There can also be some concessions for certain groups. You can just use any general ticket machine or the TransitLink machine which is found in most of the SMRT stations to top-up your card. A manned ticket office, online, any 7 - eleven store or a post office are also some of the options of getting your card refilled. The Singapore tourist passes- There is another option, the Singapore Tourist Passes with which you can enjoy unlimited basic MRT and bus rides within Singapore. These passes are available only at selected TransitLink offices within some MRT stations. But you must also keep in mind that the basic bus services do not include night buses. \nThe tourists can also avail a Singapore Tourist Pass Plus, which is just the same card, but with an extra Funvee open top bus tour and free Bubble Jet ride around the Singapore Bay area. \nThese passes come with various promotional offers and discounts that you may avail in various stores and services. \nNow it entirely depends on which payment option you choose to get the transport service in Singapore. The right choice would depend on your length of stay in Singapore and how frequently you plan to use the public transport.   from ArticlesFactory.com ABOUT THE AUTHOR \nMartin Luther has travelled to different countries in the world. His travel experience brought him the knowledge that the transport service in Singapore is quite popular world-wide. It is known to be easily available, cost-efficient and advanced at the same time.", "external_links": [], "published": "2015-09-14T05:18:00.000+03:00", "crawled": "2015-09-14T10:20:16.718+03:00", "highlightTitle": ""}