{"organizations": [], "uuid": "32d54ce01f78685d95e5d97eefbd0acef2df50aa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/08/MCEC-300x139.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/mice-news/", "section_title": "MICE Travel | Meeting | Incentive | Conference | Exhibition | business travellers | MICE destinations | MICE industry | MICE tourism | Outbound MICETravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mcec-serves-up-new-executive-chef/", "country": "US", "title": "MCEC serves up new Executive ChefTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "MCEC serves up new Executive ChefTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "32d54ce01f78685d95e5d97eefbd0acef2df50aa"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/mcec-serves-up-new-executive-chef/", "ord_in_thread": 0, "title": "MCEC serves up new Executive ChefTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "MCEC serves up new Executive Chef Published on : Thursday, September 10, 2015\nFollowing an international search, Melbourne Convention and Exhibition Centre (MCEC) Chief Executive Peter King today announced the appointment of MCEC’s new Executive Chef – Peter Haycroft.\nSetting an exciting stage for future food and beverage offerings at MCEC, Peter joins the team after 14 successful years with EPICURE at the Melbourne Cricket Ground, most recently as the Director of Culinary Operations where he managed nearly 350 staff and drove the development of the EPICURE food philosophy and cuisine.\nHaving worked in various senior roles at some of the world’s premier hotel kitchens including Hyatt and Accor, Peter brings over 35 years of experience, expertise and leadership to MCEC’s award-winning and high-performing kitchen team, which operates the largest kitchen in the Southern Hemisphere.\nIn announcing this exciting appointment, MCEC Chief Executive Peter King said: “MCEC is a world leader in the business events industry and our food philosophy and kitchen expertise is one of the primary reasons for us establishing such a great reputation. Peter’s appointment is the recognition of the start of an investment strategy in Food and Beverage that will see us progress to a new level.\n“Our philosophy ‘made fresh, in house, by hand’ is at the heart of everything we do, and this proved to be a great match for Peter. This, combined with his passion, creativity and award-winning background, makes Peter an excellent choice for this role,” Mr King said.\nThe Executive Chef appointment rounds out an expert and progressive culinary team which, under Peter’s guidance, will play an integral part in the future launch of exciting new retail offerings within MCEC.\nMCEC’s commitment to working directly with local suppliers, producers and winemakers to source the freshest seasonal produce from across Victoria will continue to drive the venue’s overarching strategy.\nSpeaking of his appointment, Peter said: “I draw inspiration from my past peers, travelling and my family, and I am constantly challenging my ability to think outside the box.\n“I pride myself on my ability to create inspiring dishes utilising locally-sourced, fresh and sustainable produce. The similarities between the business philosophies at MCEC and my personal values are inspiring and I am absolutely delighted to take up this position,” Mr Haycroft said.\nPeter’s outstanding ability has produced a career that has been industry-recognised and awarded, most recently achieving ‘Venue Caterer of the Year’ at the Restaurant & Catering Awards for Excellence for his work in leading the team at the MCG in 2014. He also helped guide the MCG to success in the MEA Corporate Social Responsibility Award (Victoria) in 2014-15 and the Clubs Australia Gold Medal, National Chefs Table Competition in 2011.\nRecognised as Australasia’s Leading Meetings and Conference Centre in 2012, 2013 and 2014 by the prestigious World Travel Awards, MCEC connects people with incredible spaces, leading technology, creative food and wine and people with the skills and experience to deliver exceptional experiences.", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T01:19:59.917+03:00", "highlightTitle": ""}