{"organizations": [], "uuid": "be6d75087648b8b9dda274bdd4541359eebc9c27", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/09/19/10/2C7EB72E00000578-0-image-a-8_1442653275202.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3240964/Tourist-dies-falling-steps-Taj-Mahal-trying-selfie.html", "country": "GB", "title": "Tourist dies after falling down steps at the Taj Mahal 'while trying to take a selfie'", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 9, "title_full": "Tourist dies after falling down steps at the Taj Mahal 'while trying to take a selfie' | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T17:07:00.000+03:00", "replies_count": 8, "uuid": "a75b19002d35b6121c90faf6fb3e4d9fbde498cd"}, "author": "John Hutchinson for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3240964/Tourist-dies-falling-steps-Taj-Mahal-trying-selfie.html#post-0", "ord_in_thread": 0, "title": "Tourist dies after falling down steps at the Taj Mahal 'while trying to take a selfie'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "21 shares 9\nView\ncomments\nA Japanese tourist who was attempting to take a selfie at the Taj Mahal has died after he fell down some steps and suffered a heart attack.\nSixty-six-year-old Hideto Uedo was believed to have been taking a photograph at the Royal Gate when the incident occurred.\n'He was rushed in an ambulance to the hospital but he could not be revived,' Sushant Gaur told AFP.\nJapanese tourist Hideto Uedo has died after falling when trying to take a selfie\n'A post mortem was carried out and the cause of death is heart attack. We have duly informed the Japanese embassy about the unfortunate incident.'\nMr Ueda was accompanied by three others as well as a local guide when he collapsed just after climbing up the stairs at the white marble tomb, said the officer in charge of the tourist police station in Agra.\n Perth, the unlikely hipster hotspot: A guide to the coolest... The secret to a great holiday in Ibiza? Go in September,... Diving into shark-infested waters: What swimming with the... Now THAT'S a first impression: The world's most spectacular... 21 shares\nThe BBC Quote: d an eyewitness, Sagar Singh, as saying the tourist fell while taking a selfie at the Taj Mahal's Royal Gate.\nThe Telegraph reports that another member of the group fractured their leg after also falling down the stairs.\nMr Uedo was visiting the Royal Gate at the Indian landmark when he collapsed\nTHE DANGER OF THE SELFIE The rise of selfie photography in some of the world's most beautiful, and dangerous, places is sparking a range of interventions aimed at combating risk-taking that has resulted in a string of gruesome deaths worldwide.\nThe act of taking a picture of oneself with a mobile phone, placing the subject centre-stage, has exploded in popularity in recent years, with everyone from Britain's Queen Elizabeth II to U.S. President Barack Obama joining in.\nBut the selfie has also inspired a spate of risk taking, pushing the boundaries of safety and decorum, whether by dangling from a skyscraper or posing with live explosives.\nSeveral governments and regulatory bodies have now begun treating the selfie as a serious threat to public safety, leading them to launch public education campaigns reminiscent of those against smoking and binge drinking.\nThe Taj - India's top tourist attraction - was built by Mughal emperor Shah Jahan as a tomb for his beloved wife Mumtaz Mahal, who died giving birth in 1631. It attracts about 12,000 visitors a day.\nEarlier this month a Melbourne woman died after plummeting more than 200 metres from a tourist rock in Norway after taking photographs.\nKristi Kafcaloudis, 24, was with a group of people at the mountain tourist spot Trolltunga in Norway's south west when she asked someone to take a photo on the edge of the jutted rock on Sunday.\nShe lost her balance on the rock formation and tumbled 200 to 300 metres to her death, Norway's TV2 reports.\n'Many people wanted to step out to be photographed, and there was a queue. When it was her turn, she stepped over some rocks at the rock face. But she walked too far to the right and fell,' Terje Kvalvik from Hardanger Police said.\nA search team had to hike for several hours before they could reach her body before transferring it to a nearby hospital.\nTrolltunga is a rock formation 700 metres above lake Ringedalsvatnet in Norway's south west.\nRead more: Tourist dies at India's Taj Mahal ‘while taking a selfie’ - Telegraph Kvinnelig student omkom etter fall fra Trolltunga - TV2.no", "external_links": ["http://dailym.ai/1Ol3Xdh", "http://www.tv2.no/2015/09/06/nyheter/trolltunga/fallulykke/7342673", "http://www.telegraph.co.uk/travel/destinations/asia/india/11875218/Tourist-dies-at-Indias-Taj-Mahal-while-taking-a-selfie.html"], "published": "2015-09-19T17:07:00.000+03:00", "crawled": "2015-09-19T15:28:31.413+03:00", "highlightTitle": ""}