{"organizations": [], "uuid": "44a85bcde5d23d38d9287644cf39adb1768d02da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29978306/china-zenix-forms-strategic-partnership-with-jac-to-penetrate-electric-powered-commercial-vehicle-market-in-china", "country": "US", "title": "China Zenix Forms Strategic Partnership with JAC to Penetrate Electric-Powered Commercial Vehicle Market In China", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "China Zenix Forms Strategic Partnership with JAC to Penetrate Electric-Powered Commercial Vehicle Market In China - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T03:00:00.000+03:00", "replies_count": 0, "uuid": "44a85bcde5d23d38d9287644cf39adb1768d02da"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29978306/china-zenix-forms-strategic-partnership-with-jac-to-penetrate-electric-powered-commercial-vehicle-market-in-china", "ord_in_thread": 0, "title": "China Zenix Forms Strategic Partnership with JAC to Penetrate Electric-Powered Commercial Vehicle Market In China", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " China Zenix Auto International Limited\nZHANGZHOU, China , Sept. 8, 2015 /PRNewswire/ -- China Zenix Auto International Limited (NYSE: ZX) (\"Zenix Auto\" or \"the Company\"), the largest commercial vehicle wheel manufacturer in China by sales volume in both the aftermarket and OEM market, today announced that it has entered into a strategic partnership with Anhui Jianghuai Automobile Co., Ltd. (\"JAC\"), the third largest commercial vehicle manufacturer in China , to penetrate the electric-powered commercial vehicle market. Zenix Auto is currently the largest wheel supplier to JAC, and JAC is the Company's largest OEM customer.\nThe Chinese government has established a goal of putting 5 million electric-powered vehicles on the road by the end of 2020 to help alleviate urban smog and reduce petroleum imports. Among the world's largest crude importers, Chinese crude imports increased by 7.5% to 6.59 million barrels per day in the first half of 2015 as China's large economy continued to expand. Government incentives to increase the use of electric-powered vehicles include free license plates, tax incentives for qualified vehicles and building a nationwide network of charging stations.\nRecognizing the significant sales potential for this market, JAC has focused its recent research and development efforts on the creation of electric-powered vehicles. JAC plans to become the No.1 brand of electric-powered commercial vehicles in China , with electric-powered vehicles representing 30% of its total production and sales by 2025.\nThe new JAC-Zenix Auto partnership includes both technology and marketing initiatives to increase the partners' respective market share in the Chinese commercial vehicle markets, including the burgeoning electric-powered vehicle segment. Zenix Auto will focus its research and development efforts on creating advanced steel wheels for JAC's high-end, light-duty trucks. In addition, Zenix Auto's aluminum alloy wheels will become one of the preferred aluminum wheels for JAC heavy-duty trucks. As the research and development collaboration generates improved wheels and cost savings, Zenix Auto will further increase its share of wheels supplied to JAC. Zenix Auto will leverage its extensive national marketing and service network to deliver improved customer service to JAC's customers and enhance the sales and brand recognition of JAC's new electric-powered vehicles.\nMr. Jianhui Lai , chairman and chief executive officer of Zenix Auto, commented, \"We are excited to further increase the percentage of our wheels used by JAC through this new partnership. We are already the largest wheel supplier to JAC, providing 100% of the wheels for JAC's heavy-duty trucks and approximately 50% of the wheels for its light-duty trucks. Our expanded relationship with JAC further acknowledges the superiority of China Zenix's technologies, the high-quality of our advanced wheels, our ability to provide new customer solutions through enhanced research and development, and our comprehensive service capabilities. We will receive priority consideration from JAC for new orders in addition to building overall market share of our wheels in the Chinese electric vehicle market.\"\nAbout China Zenix Auto International Limited\nChina Zenix Auto International Limited is the largest commercial vehicle wheel manufacturer in China in both the aftermarket and OEM market by sales volume. With a large intellectual property portfolio, the Company offers more than 510 series of tubed steel wheels, tubeless steel wheels, and off-road steel wheels in the aftermarket and OEM markets in China and internationally. The Company's customers include large PRC commercial vehicle manufacturers, and it also exports products to over 80 distributors in more than 30 countries worldwide. With five large, strategically located manufacturing facilities in multiple regions across China , the Company has an aggregate annual production capacity of approximately 15.5 million units of steel wheels as of June 30, 2015 . For more information, please visit: www.zenixauto.com/en .\nSafe Harbor\nThis announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"confident\" and similar statements. The Company may make written or oral forward-looking statements in its periodic reports to the SEC, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees. Statements that are not historical facts, including statements about the Company's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties. A number of factors could cause actual results to differ materially from those contained in any forward-looking statement. Further information regarding these risks is included in our filings with the SEC. The Company does not undertake any obligation to update any forward-looking statement, except as required under applicable law. All information provided in this press release and in the attachments is as of the date of the press release, and the Company undertakes no duty to update such information, except as required under applicable law.\nFor more information, please contact\nInvestor Contact:\nKevin Theiss\nGrayling\nTel: +1-646-284-9409\nEmail: kevin.theiss@grayling.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/china-zenix-forms-strategic-partnership-with-jac-to-penetrate-electric-powered-commercial-vehicle-market-in-china-300138921.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["http://www.zenixauto.com/en", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/china-zenix-forms-strategic-partnership-with-jac-to-penetrate-electric-powered-commercial-vehicle-market-in-china-300138921.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=CN95670&Transmission_Id=201509080730PR_NEWS_USPR_____CN95670&DateId=20150908"], "published": "2015-09-08T03:00:00.000+03:00", "crawled": "2015-09-08T15:23:39.392+03:00", "highlightTitle": ""}