{"organizations": ["Europe Starwood", "Starwood", "Leisure Industries"], "uuid": "d61452a9679f494559de8aaa62342627eb6b5b8c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ft.com", "main_image": "http://im.ft-static.com/content/images/f087e31f-bc40-4bea-911f-2c21fb21fd08.img", "site_section": "http://www.ft.com/rss/companies/travel-leisure", "section_title": "Travel & Leisure", "url": "http://www.ft.com/cms/s/0/cc8d090c-4fbe-11e5-8642-453585f2cfcd.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "country": "US", "title": "Starwood brings Tribute chain to Europe", "performance_score": 0, "site": "ft.com", "participants_count": 0, "title_full": "Starwood brings Tribute chain to Europe", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T02:13:00.000+03:00", "replies_count": 0, "uuid": "d61452a9679f494559de8aaa62342627eb6b5b8c"}, "author": "", "url": "http://www.ft.com/cms/s/0/cc8d090c-4fbe-11e5-8642-453585f2cfcd.html?ftcamp=published_links%2Frss%2Fcompanies_travel-leisure%2Ffeed%2F%2Fproduct", "ord_in_thread": 0, "title": "Starwood brings Tribute chain to Europe", "locations": ["Europe", "UK"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Malcolm Moore"], "text": "Starwood targets UK and Europe for growth with Tribute chain Malcolm Moore, Leisure Industries Correspondent Comments Great North Hotel \nStarwood Hotels & Resorts is bringing its first new hotel chain in nine years to Europe as it looks for ways to accelerate its lacklustre growth . \nStarwood has signed the Great North Hotel in London’s King’s Cross as a Tribute hotel — a new franchise that sees independent hotel owners pay between 4 per cent to 6 per cent of their room revenues to Starwood in return for access to the group’s booking system, marketing and its Starwood Preferred Guest loyalty scheme. More Dalian Wanda buys Ironman triathlon group \nThe Tribute model, which was launched in Miami in April, allows Starwood to rapidly expand at minimal marginal cost. It hopes to have 100 hotels signed up within the next five years. \nStarwood’s former chief executive, Frits van Paasschen, departed abruptly in February after criticism that the hotel company was not expanding as fast as its rivals. Starwood added 7,000 new rooms in 2014, just 2 per cent growth. \nIn recent weeks, Paulson & Co and Och-Ziff, two American hedge funds , have become Starwood’s largest shareholders, raising pressure on the owner of the Sheraton and W Hotels chains to find a successful route back to growth or to sell itself. \nJeremy Robson, the owner of the Great Northern Hotel, said the Tribute franchise was attractive to him because it is a far cheaper way to sell rooms than by generating online buzz or going through the online travel agents, such as Expedia and Booking.com, which charge high commissions. \n“We spend £300,000 a year on search engine optimisation and pay-per-click,” said Mr Robson. “Around 45 per cent of my room sales are through the online travel agents and they take 20-21 per cent commission. We like them, but they are expensive.” \nMr Robson said the deal would see his gross cost of sales per room drop from 18 per cent to 12.5 per cent. “Even if we do not achieve a higher room rate, I am nearly 6 percentage points up on half my income.” \n“The Great Northern Hotel has been established for two years,” said Mr Robson. “We are trading well. But if Tribute had been available earlier I would have done a deal then.” \nThe UK hotel will be the second property in Starwood’s Tribute chain. The group plans that between a third and half of Starwood’s Tribute hotels will open in Europe, where the proportion of independent hotels is higher. Starwood already has 10 other hotels in the UK. \nAdam Aron, interim chief executive of Starwood, has prioritised the rollout of Tribute, while other hotel chains, such as Hilton and Marriott, have launched similar schemes, spying an opportunity to wean independent hotels off their dependence on online travel agency bookings. \n“We have a loyalty programme that is highly desirable,” said Michael Wale, the head of Starwood in Europe. “We know that 50 per cent of our bookings come through SPG members and they pay a 20 per cent premium. They also spend more when they stay with us. You can go through the online travel agents but you cannot know the customers in the same way.” \nAt the same time, Starwood is imposing few demands on its new franchisees. “You do not need to fulfil all the rules of our nine other brands, on room size and so on, but we will be monitoring guest satisfaction,” Mr Wale added. Copyright The Financial Times Limited 2015. You may share using our article tools. Please don't cut articles from FT.com and redistribute by email or post to the web.", "external_links": [], "published": "2015-09-01T02:13:00.000+03:00", "crawled": "2015-09-01T12:25:08.128+03:00", "highlightTitle": ""}