{"organizations": [], "uuid": "cd9379242e139ea10d65884d3a94b18da620268b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30139057/global-food-trendologist-christine-couvelier-and-travelocityca-unveil-the-hottest-destinations-in-culinary-travel", "country": "US", "title": "Global food trendologist, Christine Couvelier and Travelocity.ca unveil the hottest destinations in culinary travel", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Global food trendologist, Christine Couvelier and Travelocity.ca unveil the hottest destinations in culinary travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "cd9379242e139ea10d65884d3a94b18da620268b"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30139057/global-food-trendologist-christine-couvelier-and-travelocityca-unveil-the-hottest-destinations-in-culinary-travel", "ord_in_thread": 0, "title": "Global food trendologist, Christine Couvelier and Travelocity.ca unveil the hottest destinations in culinary travel", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Travelocity.ca\nLos Angeles and Lima, Peru top the list of culinary destinations for 2015\nTORONTO , Sept. 29, 2015 /CNW/ - It's no secret that food and travel go hand-in-hand and memories of food are often some of the fondest after a vacation. In fact, the majority of Canadians (75 per cent) agree that food is important when selecting a trip destination i . As food-centric vacations become increasingly popular, Travelocity.ca has re-connected with global culinary trendologist, Christine Couvelier to uncover the top culinary destinations for 2015 and the hottest trends to hit the plate.\nChristine has over 20 years of experience in food and has travelled the globe to become an expert in delicious destinations. Last year destinations like San Francisco , New York City and San Sebastian, Spain topped the list for innovation in food.\n\"With a rapidly growing global interest in culinary tourism, we're noticing fun, new food trends emerge,\" says Travelocity.ca spokesperson and Global Food Trendologist, Christine Couvelier . \"After carefully researching the unique things various regions are doing with food, we have selected the cream of the crop, representing the cutting edge of culinary tourism.\"\nTop Five Culinary Travel Destinations and Trends:\nLos Angeles, California – Home to Hollywood , Los Angeles is not only known for their star sighting but also for their trend topping food. One of the biggest trends this year, and something that is all the rage in Tinseltown, is communal dining. Sharing a large table with a group of friends and strangers envelops you in a warm sense of community while you enjoy some great food and good conversation. Montreal, Quebec - This year, Montreal is getting back to its roots and focusing on the pride of sharing tastes and traditions. What's more French-Canadian than smoked meat? Fresh bagels and cheeses are also a must-try when visiting this taste of Europe here in Canada . Chicago, Illinois - Dining in Chicago is a marathon, not a sprint. Sweet heat is the trend of the year for the Windy City and it's being taken seriously. Restaurants are serving up dishes like achiote-marinated suckling pig in banana leaves or poached papaya with olive oil crisped crumbs. London, England - London is one of the gastronomic capitals of the world; it's no surprise it made its way to our top five culinary destinations list. This year it's all about the vegetables! Vegetarians take note - vegetables as the star of the plate is what's hot in London . Chefs around the city are combining flavours and textures to keep all eyes on the veggies. Lima, Peru – A culinary destination to explore, Lima is focusing on the origin and terroir of chocolate this year. While Peru is well known for a delicious ceviche, chocolate tours are really grabbing the attention of travelers. A visit to one (or all) of the specialty chocolate boutiques in Lima will leave you drooling over the endless combinations like chocolate with Pisco or passion fruit for example.\nRounding out the top ten culinary destinations are Charleston , North Carolina and Austin, Texas where low and slow cooking and the food truck craze are all the rage. Portland, Oregon is leading the charge in craft beers while Sydney, Australia is destination number nine for their adventurous dishes with seaweed. Finally Tokyo, Japan takes the final spot in the Travelocity.ca top ten culinary destinations for the uprising trend of fermenting.\nAbout Travelocity\nTravelocity wants to inspire you to \"Go & Smell the Roses!\" and is dedicated to being your kindred spirit – a travel companion and a travel instigator, roaming the world beside you while helping make your traveling experience memorable with innovative apps, competitive prices and 24/7 customer service. Based in Dallas, Texas , Travelocity is owned by Expedia, Inc., one of the world's largest travel companies, with an extensive brand portfolio that includes many of the world's leading online travel properties.\n© 2015 Travelscape, LLC. All rights reserved. Travelocity, the Star Design and Go & Smell the Roses are trademarks of Travelscape, LLC. All other trademarks and logos are property of their respective owners. CST# 2056372-50", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T14:48:42.362+03:00", "highlightTitle": ""}