{"organizations": [], "uuid": "b30911218a44268022819a2874a773993097b6fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/c", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30091906/new-vento2-probe-captures-data-a-mile-deep-in-the-ocean", "country": "US", "title": "New VentO2 Probe captures data a mile deep in the ocean", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "New VentO2 Probe captures data a mile deep in the ocean - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "b30911218a44268022819a2874a773993097b6fe"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30091906/new-vento2-probe-captures-data-a-mile-deep-in-the-ocean", "ord_in_thread": 0, "title": "New VentO2 Probe captures data a mile deep in the ocean", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " MarqMetrix\nSEATTLE , Sept. MarqMetrix® Inc., a leading company in the optical sensor industry has developed a new technology with the VentO2 Probe, an oxygen sensor designed to meet the needs of researchers studying the geochemistry of deep-sea hydrothermal vents, where oxygen is considered a master variable in the biological and geological setting.\nLast week, the VentO2 Probe was successfully deployed more than a mile deep on the Axial Seamount Expedition 2015 to measure the dissolved oxygen in hydrothermal fluids emitting from this active underwater volcano.\nMarqMetrix company principals, Dr. Charles Branham and Dr. Giora Proskurowski , led a NSF funded project with the University of Washington School of Oceanography to develop this state of the art optical deep-sea oxygen sensor. MarqMetrix has developed a long line of optical sensing BallProbes® for use across industries and has applied that knowledge and innovation to this latest device.\n\"The VentO2 Probe expands the ability to measure oxygen in extreme environments that are not readily adaptable for measurement,\" said Proskurowski. \"Not only will this help researchers understand the chemistry of our deep ocean environments, but it will allow us to test environments where humans cannot travel.\"\nThe probe-style interface can touch surfaces directly for precise measurement in exact locations, a unique feature that commercially available sensors do not offer today. Additionally, the VentO2 Probe is more stable in high UV light conditions and can be used in temperatures up to 300 degrees Fahrenheit, and because of the slim design, can be used in spatially sensitive areas.\nWhile it may seem futuristic, this technology will help scientists discover if life and organisms can exist outside of the earth.\n\"The deep dark environments of the ocean, where there is no sunlight and no photosynthesis, are very similar to those of early earth or the moons of Jupiter,\" said Proskurowski. \"Because we can actually go to the deep ocean, this device opens the door to studies of life viability on other plants and ultimately prove theories.\"\nComing back down to earth, this device will have practical uses in testing for oxygen depletion in coastal environments, and monitoring the environment around ocean fish farms with the potential to warn farmers of unsafe anoxic conditions.\nFor more information about the VentO2 Probe visit MarqMetrix at www.marqmetrix.com .\nAbout MarqMetrix\nMarqMetrix uses patented technology and multi-disciplinary expertise to solve complex applied and industrial challenges to maximize efficiency, sustainability and profitability. The company offers optical measurement research, development and consulting services to commercial and government clients.\nFounded in Seattle in 2012, the company was established by Brian Marquardt to take his Raman BallProbe™, a light-sensing device with a unique spherical sampling lens, outside of a laboratory setting into real-world applications.Today, the MarqMetrix team conducts groundbreaking work in a cutting-edge laboratory with state-of-the-art equipment for optical, chemical and biological measurement and testing. The company works with recognizable global brands representing the oil and gas, energy, chemical, aerospace, food and agricultural and medical industries.\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/new-vento2-probe-captures-data-a-mile-deep-in-the-ocean-300147407.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/new-vento2-probe-captures-data-a-mile-deep-in-the-ocean-300147407.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA09085&Transmission_Id=201509221700PR_NEWS_USPR_____LA09085&DateId=20150922", "http://www.xmlnews.org/ns/", "http://www.marqmetrix.com/"], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-23T03:08:06.269+03:00", "highlightTitle": ""}