{"organizations": [], "uuid": "730f3a88fa12c0632bfc78feb73835fcfea5e360", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nytimes.com", "main_image": "http://static01.nyt.com/images/2015/09/24/t-magazine/24tmag-spaceage-slide-IUH9/24tmag-spaceage-slide-IUH9-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Travel.xml", "section_title": "NYT > Travel", "url": "http://www.nytimes.com/2015/09/24/t-magazine/paris-art-space-age-galerie-thaddaeus.html?partner=rss&emc=rss", "country": "US", "title": "Art Matters: In a New Group Show, Artists Look to the Sky", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Art Matters: In a New Group Show, Artists Look to the Sky", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T23:28:00.000+03:00", "replies_count": 0, "uuid": "730f3a88fa12c0632bfc78feb73835fcfea5e360"}, "author": "AMY VERNER", "url": "http://www.nytimes.com/2015/09/24/t-magazine/paris-art-space-age-galerie-thaddaeus.html?partner=rss&emc=rss", "ord_in_thread": 0, "title": "Art Matters: In a New Group Show, Artists Look to the Sky", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "In a New Group Show, Artists Look to the Sky By AMY VERNER Continue reading the main story Since space exploration has only existed for some 60 years, any artist working before 1950 would be unfamiliar with the visual vocabulary of rockets, shuttles and astronauts. So it follows that “Space Age,” the latest group show at Galerie Thaddaeus Ropac in Pantin, northeast of central Paris , is resolutely contemporary. The show’s 30 works, some newly commissioned, span five decades and offer a vast range of depictions, from a standing diptych by Robert Longo in which the Russian astronaut Valentina Tereshkova (the first woman in space) faces a starry abyss, to a duo of James Rosenquist canvases covered in galactic brightly colored geometries. The newer of his fractal works features a rotating mirror bordered with the words “an intrinsic existence”: selfie or self-reflection, take your pick. Whereas Not Vital’s stainless steel moon sucks viewers into its cratered, spherical surface, Lee Bull engulfs her suspended debris in fog. The gallery’s in-house curator, José Castañal, notes how the theme launches visitors into various orbits — contemplative, metaphoric and mythological — depending on how deep they choose to go. “The works are all complementary; none excludes another,” he says. Three new paintings from Jules de Balincourt seem like they could be pages from an illustrated children’s book, until you notice titles like “Space Investors” and “The Spectacle of Space and Other Fallacies.” “We’re all thinking about concepts we’ve never experienced,” Castañal says. But one artist whose foundation the gallery represents, Robert Rauschenberg, got close — twice. In 1969, he was invited by NASA to witness the Apollo 11 launch; and in 1984, he was among 70 artists who visited the Discovery. The gallery team sourced the issue of Life magazine from that year that quotes him expressing interest in space as a “purely aesthetic indulgence.” The photo that accompanies the article echoes a Rauschenberg work on view (and for sale) for the first time in the show: a 1992 acrylic print of the shuttle on mirrored aluminum. Whether by design or not, patterns emerge across the four giant halls, which originally served as a heating systems factory. The works from Alex Katz and Jack Pierson located closest to the entry establish the wonderment of flight and the heavens beyond. In separate halls, “The Crawler,” Tom Sachs’s ambitious foamcore rendering of the Space Shuttle Challenger (among his first space-inspired endeavors) and Ilya and Emilia Kabakov’s shrouded, fallen angel ringed by yellow caution tape, both suggest that the excitement can sometimes be leveled by failure. And Anselm Kiefer, who will be honored with a retrospective at the Centre Georges Pompidou in November, titled his rocket-and-rubble installation from 1991 “Das Grab in den Lüften” (“The Grave in the Sky”). The artist was on site to mount the work, which hasn’t been on view for nearly 20 years and required significant restoration. Thaddaeus Ropac points out that the artistic impulse to represent space dates back beyond the 20th century. “Ever since the Tower of Babel, there has always been the urge to go up. But ’69 changed everything,” he says. And indeed, two years later, Richard Artschwager made “Rocket,” which reduces the liftoff to a grainy, grayscale image. Despite the creative license, it’s unmistakably identifiable, the same way Sylvie Fleury’s glittery pink fiberglass rocket gives the form a certain kitschy thrust. Noticeably, “Space Age” does not flip the gallery template from white walls to black. “This would have been unfair to the artists,” says Ropac. “There would be no way to show such opposite languages other than to keep it neutral. It would have been too gimmicky.” The show, loosely pegged to last year’s 50th anniversary of European Cooperation in Space, coincidentally pairs well with the Louvre’s “ A Brief History of the Future ,” which also opens this week. Castañal, for his part, says there was so much more he wished to include. “We could have invited 20 more artists and 20 after that,” he says. Apparently, an 18,000-square-foot gallery wasn’t big enough: “The space was our only limitation.” \n“Space Age” is on view Sept. 27-Dec. 23 at Galerie Thaddaeus Ropac Pantin, ropac.net . Loading...", "external_links": [], "published": "2015-09-24T23:28:00.000+03:00", "crawled": "2015-09-25T02:26:44.567+03:00", "highlightTitle": ""}