{"organizations": [], "uuid": "c623bcdeb19385c914ec4a7e50b5f54578104161", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelmarketreport.com", "main_image": "", "site_section": "http://www.travelmarketreport.com/rss/articlefeed.ashx?type=0", "section_title": "Travel Market Report RSS Feed", "url": "http://www.travelmarketreport.com/articles/Bohan-OShaughnessy-and-Perelman-On-Building-Your-Business?articleid=18231", "country": "US", "title": "Bohan, O’Shaughnessy, and Perelman: On Building Your Business", "performance_score": 0, "site": "travelmarketreport.com", "participants_count": 0, "title_full": "Bohan, O’Shaughnessy, and Perelman: On Building Your Business", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "c623bcdeb19385c914ec4a7e50b5f54578104161"}, "author": "", "url": "http://www.travelmarketreport.com/articles/Bohan-OShaughnessy-and-Perelman-On-Building-Your-Business?articleid=18231", "ord_in_thread": 0, "title": "Bohan, O’Shaughnessy, and Perelman: On Building Your Business", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Daniel McCarthy", "Perelman", "Bohan"], "text": "Bohan, O’Shaughnessy, and Perelman: On Building Your Business by Daniel McCarthy / September 09, 2015 \nPic: Gloria Boham speaking at ASTA's Global Convention in Washington D.C. last week. \nWASHINGTON – Three of the travel industry’s most driven and successful business owners offered up business advice at the ASTA Global Convention’s Entrepreneur Insight panel last week. Omega World Travel CEO Gloria Bohan, TripScope founder and CEO Katelyn O’Shaughnessy, and Seth Perelman, founder of Automated Travel Systems (ATS) and BookingBuilder Technologies, shared their success stories. Among the topics discussed were their individual and unique paths to winning in the travel industry, what inspired them, and how they went about reaching their goals. \nIn the end, said ASTA CEO and president Zane Kerby, “We need more Gloria Bohans in this industry.” Bohan on 43 years of success Gloria Bohan’s road to ownership of one of the flagship travel agencies in the country started with a honeymoon on Cunard’s Queen Elizabeth II. A schoolteacher at the time, Bohan noticed that the agents onboard stayed in the best cabins, and she couldn’t believe how happy they seemed. “My husband said, ‘If you can’t beat them, why not join them?’” she said. Bohan opened the first Omega World Travel, an independent storefront agency, in 1972. She drummed up business by going door to door, looking for clients and gathering information. But soon her entrepreneurial spirit took over. She started offering promotions like two-for-one airline coupons, opened the industry’s first 24-hour reservation center, and established the first agency consortium, Radius. The list of accomplishments that Bohan and Omega have assembled are too many to count. Among them, Omega was the first private agency to manage government travel, the first to install airline reservation terminals on client premises, the first to install an automated low-fare quality-control system. But more than anything, Bohan is proud of the entrepreneurial spirit that drove her to build her business. “If you have a company or if you have your own company that you are starting yourself, I think it’s very important to realize that you want to keep that entrepreneurial spirit going in others,” she said. “[It’s been a] fun time, a rapid time, and I’m always happy to help entrepreneurs.” \nO’Shaughnessy: Up from humble beginnings Katelyn O’Shaughnessy took a roundabout route into travel, but once she got her feet wet in the industry, she couldn’t get enough of it. \n“I did started my journey as a travel agent,” she said. “I come from very humble beginnings.” \nHer secret to success? Refusing to take no as an answer. Despite being rejected three times for an interview, O’Shaughnessy finally got her foot in the door at the L.A.-based Travel Store, one of the more prestigious agencies in the country. Within a few months she saw an opportunity to create something that would help make her job—and the jobs of other agents—easier. But when she founded TripScope, a technology platform that takes the human element of offline agents and puts it online, it was nowhere near an immediate success. It took her three months to become the first female to have her company brought into Amplify, an incubator that helps new startups—and shortly thereafter, she beat out other top travel CEOs and executives at Phocuswright’s Travel Innovation Summit. “I remember thinking at the time, I may not have gone to M.I.T., I’m not an engineer, but I know my market and I know travel better than any of these guys,” O’Shaughnessy said. Shaking up the status quo Seth Perelman, who won the first-ever ASTA Entrepreneur of the year award at the conference, had that same desire to innovate. He dropped out of college to pursue his entrepreneur goal. “I’ve always believed in shaking up the status quo; I’ve always believed we could be different; I’ve always believed in doing my own thing, doing it my own way, and making things possible,” he said. In 1990, Perelman started Automotive Travel Systems with the idea of putting the customer first. “It was always about much more than profit, breaking new ground taking care of customers, doing things we knew were impossible,” he said. He eventually received backing from investor Carl Icahn, but his desire only grew. Then it took Perelman a year of calling Southwest three times a week to get them to partner with him. Along the way he also founded BookingBuilder Technologies, a point-of-sale quality assurance tool, and led the way for innovation in travel technology. \nSo don’t let the delays and the difficulties get you down, the panel said. Hang tough and follow your dream. But she still needed funding. It took 184 pitches to Silicon Valley venture capitalists before she got the backing she needed to go ahead and make her idea a reality. “[I owe it all to] entrepreneurial insight and making it happen,” she said, “and I believe everyone is capable of doing this.” 0", "external_links": [], "published": "2015-09-09T03:00:00.000+03:00", "crawled": "2015-09-09T06:18:51.902+03:00", "highlightTitle": ""}