{"organizations": [], "uuid": "0991d421c8b717b35c97c630193f511236db2ad4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30023750/css-alliance-llc-completes-sample-containers-readies-for-new-contracts-and-hires-new-ceo", "country": "US", "title": "CSS Alliance LLC Completes Sample Containers, Readies for New Contracts and Hires New CEO", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "CSS Alliance LLC Completes Sample Containers, Readies for New Contracts and Hires New CEO - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "0991d421c8b717b35c97c630193f511236db2ad4"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30023750/css-alliance-llc-completes-sample-containers-readies-for-new-contracts-and-hires-new-ceo", "ord_in_thread": 0, "title": "CSS Alliance LLC Completes Sample Containers, Readies for New Contracts and Hires New CEO", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " CSS Alliance LLC\nNEW YORK , Sept. 14, 2015 /PRNewswire/ - CSS Alliance (OTC:APRE) is pleased to announce that the company has successfully finished its first sample containers and is ready to start taking orders for its products. The sample containers have been delivered to Intermobile Container's headquarters and are ready for showing customers. The company has commenced the process of taking new orders and sales contracts for its containers. The response to the new container has been extraordinary and the company is receiving inquiries both domestically and overseas. CSS will announce new contracts for containers as they are completed.\nThe company is also pleased to announce that they have hired a seasoned veteran to run the company. Mr. Ray Fite , shall become the new APRE President as James Hennig has stepped down from APRE. Garland Fite will be the new President of CSS Alliance and CEO of Aperture Health Inc. Mr. Fite will take over the organization and lead it to push new licensing agreements and grow revenues.\n\"I was attracted by the company's vision to build a sustainable management services and manufacturing organization both domestically and internationally.\" Fite said. \"I believe that by offering these types of services to small and medium sized companies, they can compete with bigger companies, due to their reduced operational costs. Along with that, I'm excited to work on various licensing agreements to build the companies' revenue stream as well.\"\nFite comes to CSS Alliance with over 40 years of experience managing companies and running large organizations. Most recently, Fite worked in Hawaii developing several movie projects as well as a large film studio.. His experience in Manufacturing, Casino's, Automotive Services, Security, film business and Publishing will help Mr. Fite in making an easy transition into his current position with CSS Alliance..\nMr. Fite will finish up his duties in Hawaii and move to corporate headquarters within the next 2 weeks to take over all operations.\n\"I intend to apply my vast experience and skills to the task of developing new opportunities in order to both sustain CSS's mainstay (Manufacturing Services) and to take full advantage of new opportunities. Our plans are to grow this company into a small but powerful company for both the business itself and more importantly for its shareholders.\nAbout CSS:\nCSS Alliance LLC (\"CSS\") is a management services organization specializing in manufacturing. CSS has signed an agreement to manage Intermobile Container's, and manufacturing of their specialized container products on a multi-year basis. CSS will be managing this manufacturing on a worldwide basis. This supply system eliminates multiple handling and as a result saves money by decreasing costs, product deterioration, liability, and time. Moreover, this device is an intermobile designed system that can be integrated on rail, truck and barges without changing a thing. The projected target for these container's is to sell or lease over 100,000 units as soon as possible worldwide. The result of this will mean that CSS will manage multiple domestic and international manufacturing of these containers.\nSafe Harbor Act: This release includes forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 that involve substantial risks and uncertainties. You can identify these forward-looking statements by words such as \"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"should,\" \"will,\" \"would\" or similar words. The statements that contain these or similar words should be read carefully because these statements discuss our future expectations, or state other forward-looking information. We believe that it is important to communicate our future expectations to our investors. Nonetheless, the Company is not obligated to revise or update any forward-looking statements in order to reflect events or circumstances that may arise after the date of this release.\n ", "external_links": ["http://www.xmlnews.org/ns/", "http://rt.prnewswire.com/rt.gif?NewsItemId=TO00497&Transmission_Id=201509140830PR_NEWS_USPR_____TO00497&DateId=20150914"], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T16:46:50.313+03:00", "highlightTitle": ""}