{"organizations": [], "uuid": "0c615df0a93d596cd0c614c92e4ac93ee649b270", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gosouthamerica.about.com", "main_image": "http://f.tqn.com/y/gosouthamerica/1/S/_/Z/2/15960132608_b8dcca69f7_k.jpg", "site_section": "http://z.about.com/6/g/gosouthamerica/b/index.rdf", "section_title": "About South America Travel", "url": "http://gosouthamerica.about.com/od/arcitiesbuenosaires/fl/The-Best-Places-To-Party-In-Buenos-Aires.htm", "country": "US", "title": "The Best Places To Party In Buenos Aires", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "The Best Places To Party In Buenos Aires", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T00:00:00.000+03:00", "replies_count": 0, "uuid": "0c615df0a93d596cd0c614c92e4ac93ee649b270"}, "author": "", "url": "http://gosouthamerica.about.com/od/arcitiesbuenosaires/fl/The-Best-Places-To-Party-In-Buenos-Aires.htm", "ord_in_thread": 0, "title": "The Best Places To Party In Buenos Aires", "locations": ["Buenos Aires"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Luis Lozano"], "text": "(c) Luis Lozano \nThe capital of Argentina is one of the most cosmopolitan and wealthy cities in South America , and as you would expect from such a city, there is a lively and exciting nightlife with some amazing spots to party. \nThere are some great super clubs that attract DJs from across the world, while there are also plenty of more intimate venues playing a wide variety of different types of music. It is worth noting that the city usually gets lively quite late, so heading to a bar at midnight and getting to a club at 2am is not out of the ordinary. Pacha \nUnder the same umbrella as the other clubs of the same name found in London, New York and Ibiza, this is one of the best party spots in the city and certainly hasn't cut any corners when it comes to the speakers and the light shows on the dance floors. \nInternational names are frequently on the bill at Pacha in Buenos Aires , while those who like to party until the early morning can actually watch the sun come up on a beautiful roof terrace with views over the Costanera Norte district of the city. Crobar \nAnother of the big clubs in the city, Crobar is found in the Palermo Parks area , and also has an on site restaurant which means that the area opens up for dinner and then allows guests to stay until late at the nightclub. \nThe location is beneath a railway bridge to prevent any noise complaints from the neighbors, and the club regularly has a techno night most Friday nights, while there is also a large LGBT crowd that attends the club on a Saturday. Bahrein \nFor those looking for a bit more of a retro atmosphere, Bahrein is a club that is set over three floors, with the dance room in the basement, and also a very cool cocktail lounge and a floor playing 80s and 90s music in the Funky Room. There is plenty of space on the large dance floors in this venue, although the popular music choices will often fill those floors. Floreria Atlantico \nThis speakeasy type bar is one of the most stylish in the city, and located in a basement beneath the florist's shop, which will often confuse visitors coming to the bar for the first time. There is an international flavor to the cocktail list with international classics standing side by side with the Criollo cocktails that are representative of modern Argentina, and for the discerning drinker this is a great place to start your party. Club Namunkura \nThis weekly event is held on a Saturday night, and is famous for the hosts who   spectacular drag queens that you will meet in the city. The club gained some notoriety after hosting a private party for Madonna and her new boyfriend, while visitors will find that the music mix of disco and house hits is blended with some of the more unusual 90s tracks that have been long forgotten in dusty record collections. Niceto Club \nOne of the more bohemian clubs in the city, this club always draws a good crowd and the lavish events such as Club 69 which is held on Thursday nights with artistic displays, showgirls, drag queen shows and video art. Other nights see an interesting blend of music with hip-hop, cumbia and reggae combining to make for a very interesting evening with great beats. Jet \nDrawing a fashionable upmarket crowd, this club is a little more selective about its clientele, and is certainly not the type of place where you can rock up in jeans and sneakers. Dress to impress and you can share a dance floor with some of the city's trendsetters, where commercial house, electro and lounge are spun on the decks.  ", "external_links": [], "published": "2015-09-30T00:00:00.000+03:00", "crawled": "2015-09-30T07:41:32.290+03:00", "highlightTitle": ""}