{"organizations": ["National Park Service", "Hoover Dam", "Dragoon Corridor"], "uuid": "142b59008bd8a6539cbba8fb6d07a3fd6856d07c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.24-7pressrelease.com", "main_image": "http://www.24-7pressrelease.com/images/icon-247pressrelease.jpg", "site_section": "http://rss.24-7pressrelease.com/rss/business_travel.xml", "section_title": "Press Release and Top Business   Travel News From 24-7 Press Release Newswire", "url": "http://www.24-7pressrelease.com/press-release/grand-canyon-helicopter-tours-announces-endofsummer-sale-412558.php", "country": "US", "title": "Grand Canyon Helicopter Tours Announces End-of-Summer Sale", "performance_score": 0, "site": "24-7pressrelease.com", "participants_count": 0, "title_full": "Grand Canyon Helicopter Tours Announces End-of-Summer Sale", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T10:00:00.000+03:00", "replies_count": 0, "uuid": "142b59008bd8a6539cbba8fb6d07a3fd6856d07c"}, "author": "", "url": "http://www.24-7pressrelease.com/press-release/grand-canyon-helicopter-tours-announces-endofsummer-sale-412558.php", "ord_in_thread": 0, "title": "Grand Canyon Helicopter Tours Announces End-of-Summer Sale", "locations": ["Colorado River", "Las Vegas", "Lake Mead", "Las Vegas Strip", "East Rim", "Arizona", "South Rim", "Flagstaff", "AZ", "North Rim", "Tusayan"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  Grand Canyon Helicopter Tours Announces End-of-Summer Sale Ready to fly Grand Canyon? Take helicopter tour! Special deals for the final days of summer. Select Las Vegas and South Rim flights marked down. Seats are limited. Book now. LAS VEGAS, NV, September 14,   To kick off the waning days of Summer 2015, Grand Canyon Helicopter Tours will for a limited time only cut prices on a select number of tours from Las Vegas, NV, and South Rim, AZ. Departure Points As noted, departures are from Las Vegas and South Rim. Times are daily and on the hour. Vegas travelers should note that no Vegas helicopter fly direct to the South Rim because it's too far. The Vegas flight that's marked down is the air-only basic tour. It goes over Lake Mead, Hoover Dam, the Colorado River and the Grand Canyon before turning back to Las Vegas. Total tour time is four hours. There's a deluxe version of this tour. Instead of a hotel transfer via mini van, it uses a stretch limousine. Further, the tour departs conveniently from the Las Vegas Strip, which means travelers will get an extended tour over Vegas on the return. Best Helicopter All deluxe tours use the superior EcoStar 130. This aircraft is 25 percent larger than the one used on standard tours. The benefits of the extra size include stadium-style seating and a 180-degree wraparound windshield for massive panoramic views. Travelers who want to explore more of the Canyon are welcome to consider booking a landing tour. Such tours go to the bottom or the top of the National Park. The most popular is the one that goes to the base for a Champagne picnic. The Champagne tour can easily be upgraded to include a boat ride on the Colorado River and VIP tickets to the Grand Canyon Skywalk, which is the world-famous glass bridge that lets travelers walk 70 feet over the edge. South Rim This rim, which is 270-plus miles from Vegas, is located in northern Arizona near Flagstaff. Only air tours are offered here as the National Park Service has banned bottom-landings due to noise restrictions. Travelers can pick from a 30-minute or a 50-minute flight. For certain, the shorter flight is cheaper and a limited number of seats will be marked down for sale. It flies from the South Rim to the North Rim and back via the Dragoon Corridor, the widest and deepest section of the Canyon. However, it's the 50-minute flight that's the better value. It flies the same route as the shorter tour as well as over everything up to the Park's East Rim. By the time the flight is completed, a traveler will have seen up to 75 percent of the Park. RSVP The end of summer is one of the busiest times of year at the National Park. As such, it's strongly recommended that visitors book helicopter tours in advance and online. For best seats and prices, the rule of thumb is to book a flight at least a week or so in advance. The best deals are on the Internet. This is because travelers are rewarded with discounts by self-serving their booking. Do note that in order to qualify for the Internet discount rate, one must complete the transaction online. Failure to do so might result in a higher fare. Deals To take advantage of the summer sale, go here for helicopter tours from Las Vegas: http://www.grandcanyonhelicopters.org/las-vegas/ Go here for tours that originate from the South Rim in Arizona: http://www.grandcanyonhelicopters.org/south-rim/About Grand Canyon Helicopter Tours Grand Canyon Helicopter Tours is a leading discounter of flights to the National Park from Las Vegas, NV, and Tusayan, AZ. The Las Vegas-based company was launched in 2010 and has been at the forefront of offering the best rates on these amazing air tours. The company also operates a number of information websites crafted for independent travelers and cutting-edge travel agencies. The firm's flagship website is grandcanyonhelicopters.org, which is dedicated to rating and ranking the top air-tour companies in the business. It can be accessed at: http://www.grandcanyonhelicopters.org/las-vegas/ # # #", "external_links": [], "published": "2015-09-14T10:00:00.000+03:00", "crawled": "2015-09-14T17:26:40.905+03:00", "highlightTitle": ""}