{"organizations": [], "uuid": "6546fb9ccab7e734b4a4b831274f930519c84a97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/08/fcb4031f073f4daab17380e95bd817e6-1200x630.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/nation-world/investigators-georgia-officer-likely-shot-by-other-officers/", "country": "EU", "title": "Man and officer wounded, dog killed in police address mix-up", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Man and officer wounded, dog killed in police address mix-up | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T21:20:00.000+03:00", "replies_count": 0, "uuid": "6546fb9ccab7e734b4a4b831274f930519c84a97"}, "author": "RAY HENRY", "url": "http://www.seattletimes.com/nation-world/investigators-georgia-officer-likely-shot-by-other-officers/", "ord_in_thread": 0, "title": "Man and officer wounded, dog killed in police address mix-up", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "ATLANTA (AP) — A man shot by police officers who went to the wrong Atlanta house ran bleeding outside where a neighbor heard him asking, “Why did they come in my house? Why did they shoot me? Why did they shoot my dog?”\nIt happened Monday night when officers arrived at the wrong Atlanta address after a report of suspicious activity, shot homeowner Christopher McKinley, killed his dog and “likely” shot a fellow officer, leaving him seriously wounded, authorities said Tuesday.\nThe bloody misunderstanding began when DeKalb County police received a report of a possible burglary at a one-story residence near an intersection in southeast Atlanta. Lacking an exact address, the officers were sent in the dark to a neighborhood where many of the single-story homes look similar.\nThree officers found a home they thought matched a description provided by a 911 caller, but were unable to make contact with anyone inside, according to a statement from the Georgia Bureau of Investigation. They entered the home through an unlocked rear door and two officers fired their guns at a dog, killing it.\n McKinley, 36, was also shot in the leg by police, GBI officials said. Officer Travis Jones was shot in the hip and listed in serious condition at Grady Memorial Hospital. The GBI released the names of the two wounded men Tuesday evening.\n“Early investigation indicates that the injured officer was likely shot accidentally by one of the other officers on the scene,” GBI officials said in a statement.\nHowever, GBI spokesman Scott Dutton said it was too early to determine exactly who fired the gunshots. Dutton said he did not know if anyone in the home was armed besides the police. GBI officials said there is no evidence residents there had committed any crimes.\nMcKinley returned home early Tuesday, limping and wearing hospital scrubs, but declined to comment.\nTama Colson, who lives two doors down from the home where the shooting erupted, said she was coming home from a walk when she saw police cars speed past and soon heard a series of gunshots.\nColson told The Associated Press that as she rounded the corner, she saw her wounded neighbor and his wife fleeing their home. McKinley’s wife was screaming, Colson said, and he was yelling: “They shot me and they shot my dog!”\nColson said her neighbor had a bullet wound a couple of inches above his right knee.\nShe said she knelt beside him in the yard and used a shirt to staunch the bleeding as he told her what happened.\n“He told me they were in the house watching television when they heard something in the backyard,” Colson said. “The husband gets up to check, opens the door and he just sees shooting. He gets hit and his dog is dead.”\nShe said police never questioned McKinley while she was there helping him.\nDerek Perez told The AP that he reported the suspicious person, but at a different house than the one police entered. He said he was walking his dog when he saw a man knock on a neighbor’s door and then just stand in the yard. He said he then heard a loud noise, a dog barking and didn’t see the man anymore. There had been break-ins in the neighborhood recently, so he called 911, he said.\nBob Gilman, who lives nearby, said he heard police sirens Monday night, went outside and saw his neighbor sitting on the driveway, wounded. Gilman said police officers escorted him away before he could ask what had happened. He was stunned that officers had opened fire.\n“If they say they had the wrong address, that’s very frightening,” Gilman said.\nThe wounded man’s dog, a brindle boxer, was large, playful and would run up to people. Gilman said the dog never attacked others. The wounded man’s home had been hit by previous break-ins, and the man told Gilman that he owned a shotgun and a handgun.\nDeKalb County Police Chief Cedric Alexander said his agency would normally investigate a non-fatal shooting. But given the complicated circumstances, he said he asked the GBI to lead the probe involving his own officers’ actions.\nAlexander acknowledged Monday night that DeKalb officers responded to the wrong home. All three officers — identified by the GBI as Jones, Quhanna Lloyd and Timothy Harden — have been placed on administrative leave.\nPolice officers have mistakenly forced their way inside homes before in Atlanta, at least once with deadly consequences.\nIn 2006, Atlanta police officers killed a 92-year-old woman during a botched drug raid at her house.\n___\nBynum reported from Savannah, Georgia. Associated Press reporter Kate Brumback in Atlanta contributed to this report. Follow Ray Henry on Twitter: http://twitter.com/rhenryAP\nRAY HENRY RUSS BYNUM", "external_links": ["http://twitter.com/rhenryAP"], "published": "2015-09-01T21:20:00.000+03:00", "crawled": "2015-09-02T05:21:18.536+03:00", "highlightTitle": ""}