{"organizations": [], "uuid": "dfe1447125c0a211af65b79d85e945219f53be12", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/zvycxj3l6p4ootcdqxmg.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/norwegians-sales-team-takes-off-in-pursuit-of-uk-growth/", "country": "US", "title": "Norwegian’s sales team takes off in pursuit of UK growthTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Norwegian’s sales team takes off in pursuit of UK growthTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T03:00:00.000+03:00", "replies_count": 0, "uuid": "dfe1447125c0a211af65b79d85e945219f53be12"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/norwegians-sales-team-takes-off-in-pursuit-of-uk-growth/", "ord_in_thread": 0, "title": "Norwegian’s sales team takes off in pursuit of UK growthTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Norwegian’s sales team takes off in pursuit of UK growth\nNorwegian, Europe’s third largest low-cost carrier, today announces the appointment of Dominic Tucker as Head of Sales UK who joins Mitchell Hawes, Sales Manager UK&I to bolster the fast-growing airline’s sales capacity and cement its growth in the UK.\nTucker and Hawes bring over 30 years’ combined sales experience to strengthen the awareness of Norwegian’s expansive UK network which now serves 34 destinations worldwide from London, Birmingham, Manchester and Edinburgh.\nThe new UK-based sales team will focus on communicating the benefits for passengers flying business and leisure with Norwegian – including free Wi-Fi, a generous loyalty programme and a range of flexible fares to primary airports across Europe.\nNorwegian is also working to increase awareness of its low-cost, long-haul services on the airline’s brand new B787-8 Dreamliners, the only carrier to offer low-cost travel from the UK to the US. Tucker and Hawes will also be tasked with promoting the carrier’s long-haul premium cabin, targeting UK business travellers who will benefit from new daily services from London to New York and Los Angeles from October 2015.\nTucker joins Norwegian from British Airways where he spent 14 years in a number of commercial roles including revenue management, alliance sales and account management. He also worked in consumer sales, growing revenue for the airline’s long-haul and short-haul operations. Meanwhile, Hawes has an extensive travel background having worked for Norwegian for over five years and previously worked in similar roles at Middle East Airlines, GF and TV-am. He was also a travel consultant at the BBC.\nLars Sande, SVP of Sales and Distribution at Norwegian said: “This is an exciting time for Norwegian as the UK is a strategically important market for our international expansion. As we introduce new routes and state-of-the art aircraft, this is the right time to enhance our sales presence in the UK. Dominic and Mitchell understand the complexities of the UK travel market and have close working relationships with trade partners and tourist boards in order to create mutual sales opportunities.\n“Their comprehensive industry knowledge will prove invaluable for Norwegian as they will continuously engage with partners across all segments to maximise lucrative opportunities. I am delighted to have our strong sales team in place so that we can ensure Norwegian is the UK travellers’ airline of choice.”\nStephen Cooper also joins Norwegian as Partner Account Manager UK who will grow the number of UK-based partner companies for Norwegian’s popular loyalty programme, Norwegian Reward. Cooper will be based in London after he was appointed from Avios where he worked as a Senior Partner Manager. The 3.4 million members of Norwegian Reward can earn CashPoints on all flights, hotel bookings, car rentals and more, which can help reduce the cost of future flights, seat reservations or checked baggage.\nTucker is married with a young son while Hawes has two young children and a wife who works in the FMCG industry, which to his benefit, satisfies his guilty pleasure of an occasional glass of wine.\nNorwegian in the UK:\nNorwegian first launched UK flights in 2003 and is Europe’s third largest low-cost airline. The carrier operates from London Gatwick, Edinburgh, Birmingham and Manchester Airports to 34 destinations worldwide.\nNorwegian is the third largest airline at London Gatwick, with 3.4 million yearly passengers as of June 2015, and with 130 pilots and 300 cabin crew working from its Gatwick base In 2014, Norwegian introduced the UK’s first low-cost, long haul flights to the U.S. flying directly from Gatwick to New York, Fort Lauderdale and Los Angeles Norwegian is the only airline to offer free inflight WiFi on UK flights to 29 European destinations The airline has one of the youngest aircraft fleets in the world with an average age of four years, including next-generation Boeing 787 Dreamliners and Boeing 737-800s Norwegian has been voted ‘Europe’s best low-cost carrier’ by passengers for three consecutive years at SkyTrax World Airline Awards, and was also the first airline to be awarded the ‘World’s best low-cost long-haul airline’ in 2015 by SkyTrax.\nSource:- Norwegian Airlines", "external_links": [], "published": "2015-09-22T03:00:00.000+03:00", "crawled": "2015-09-22T21:12:16.383+03:00", "highlightTitle": ""}