{"organizations": [], "uuid": "7391b5120638c5a5c3a6d068515f7263d12cff1a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dispatch.com", "main_image": "http://www.dispatch.com/content/graphics/2015/09/02/z-04_W_BROAD_CONSTRUCTION_CLH.JPG", "site_section": "http://dispatch.com//content/syndication/lae_travel.xml", "section_title": "The Columbus Dispatch Travel Feed", "url": "http://www.dispatch.com/content/stories/local/2015/09/02/Labor-Day-travel-will-be-worst-ever.html", "country": "US", "title": "Holiday forecast: Labor Day travel will be worst ever", "performance_score": 0, "site": "dispatch.com", "participants_count": 0, "title_full": "Holiday forecast: Labor Day travel will be worst ever", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T19:39:00.000+03:00", "replies_count": 0, "uuid": "7391b5120638c5a5c3a6d068515f7263d12cff1a"}, "author": "", "url": "http://www.dispatch.com/content/stories/local/2015/09/02/Labor-Day-travel-will-be-worst-ever.html", "ord_in_thread": 0, "title": "Holiday forecast: Labor Day travel will be worst ever", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Rick Rouan"], "text": "More Articles By Rick Rouan The Columbus Dispatch • Wednesday September 2, 2015 12:39 PM \nExpect plenty of company from fellow travelers trying to hold on to the last vestiges of summer if you’re planning to take a trip for Labor Day weekend. \nThe AAA Auto Club is predicting that 1.5 million Ohioans will be among the 35.3 million people jamming highways and slowing security lines at airports as they take trips that are at least 50 miles from home this weekend. That’s the highest number of people expected to travel during the holiday weekend since 2008. \n“A lot of people are staying within Ohio,” said Kimberly Schwind, spokeswoman for AAA Ohio. “It seems for a long weekend that 4-to-6 hour range, if you’re going to drive, is what we’re going to see.” \nHigher travel volumes are expected even as people come to grips with a stock market downturn that has left retirement accounts and other investments ailing and gas prices that are subsiding after an August spike. \nSchwind said in some cases people are taking longer trips as well, with spending on trips up by 40 percent, though most will drive to their destinations. \nAbout 88 percent of Ohio travelers will drive to their weekend destinations between Thursday and Monday, up slightly over the national average. Gas prices have stabilized since a mid-August spike to around $3 a gallon because of refinery problems in Whiting, Ind. Last year, the average price for a gallon of regular gas in Ohio was $3.49 during Labor Day weekend, Schwind said. As of Wednesday, it was $2.29. \nThat means highways will be clogged, especially in dense construction zones where orange barrels block off lanes for summer work. \n“It’s extremely imperative that you slow down and pay attention,” said Matt Bruning, spokesman for the Ohio Department of Transportation. “There are changes to traffic patterns that you may be familiar with but other people driving through the state are not familiar with. That can lead to confusion.” \nBruning said major interchange redesigns at I-270 intersections with Rts. 33 and 23 on the north end will be bottlenecks for travelers trying to get out of Columbus. \nFor local travelers heading north into Michigan for the weekend, the Toledo area will be a challenge with several major construction projects under way, he said. \nMany Ohioans, though, are going south, according to AAA. The auto club attributes some of the 1.8 percent increase in Ohioans traveling this weekend to those driving or riding motor coaches to Blacksburg, Va., to watch the Ohio State University Buckeyes’ first football game of the season Monday against the Virginia Tech Hokies. \nSome are going even farther. The average trip duration is up by 20 percent over 2014 to 5.3 days, according to AAA. \nPeople booking trips at Bexley Travel Service are looking for a last hurrah for the summer before settling in for the fall and winter, said Martin Adler, the company’s president. \n“They all want to go where there’s water, where there’s a beach, the Carolinas, Florida, down in that neck of the woods,” he said. “It’s warm enough where you don’t have to go too far south.”", "external_links": [], "published": "2015-09-02T19:39:00.000+03:00", "crawled": "2015-09-02T19:48:16.659+03:00", "highlightTitle": ""}