{"organizations": [], "uuid": "bb9201ce22c8b06468eedd7139f264d55139826d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.seattletimes.com", "main_image": "http://static.seattletimes.com/wp-content/uploads/2015/09/e7e2e93a-4dbe-11e5-b347-3edc386e869a-1200x630.jpg", "site_section": "http://www.seattletimes.com/", "section_title": "The Seattle Times | Local news, sports, business, politics, entertainment, travel, restaurants and opinion for Seattle and the Pacific Northwest. ", "url": "http://www.seattletimes.com/life/travel/port-townsend-your-way-a-weekend-of-culture-history-or-outdoors-fun/", "country": "EU", "title": "Port Townsend your way: A weekend of culture, history or outdoors fun", "performance_score": 0, "site": "seattletimes.com", "participants_count": 1, "title_full": "Port Townsend your way: A weekend of culture, history or outdoors fun | The Seattle Times", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T14:00:00.000+03:00", "replies_count": 0, "uuid": "bb9201ce22c8b06468eedd7139f264d55139826d"}, "author": "Moira Macdonald", "url": "http://www.seattletimes.com/life/travel/port-townsend-your-way-a-weekend-of-culture-history-or-outdoors-fun/", "ord_in_thread": 0, "title": "Port Townsend your way: A weekend of culture, history or outdoors fun", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "As tourists, we often wear different hats, and I’m not just talking about baseball caps and floppy sunwear: Sometimes, you want a weekend full of arts and culture; sometimes, an immersion in local history sounds just right; sometimes (well, not me, but some of you), it’s all about the out-of-doors.\nPort Townsend, long my favorite Washington weekend destination, offers something for all of these tastes — plus a scenic waterfront setting. If you haven’t been recently, it might be time to go again, whatever your flavor of hat might be.\nFor culture vultures If you’ve always wanted to be addressed with the immortal words “Marlene Dietrich, your order is ready,” have I got a place for you.\nIf you go Port Townsend Special events in September Port Townsend Wooden Boat Festival: Running Sept. 11-13 this year, it features more than 300 wooden boats, live music, speakers, exhibitors and family activities.\n(Among the don’t-miss boats, if you’re a literature/history buff, is the newly renovated 1930s vessel Western Flyer, immortalized by writer John Steinbeck in “The Log from the Sea of Cortez.”)\nInfo: nwmaritime.org/events/wooden-boat-festival\nPort Townsend Film Festival: The 16th annual Port Townsend Film Festival takes over the town Sept. 25-27, with more than 80 films screened.\nSpecial guests include actor Chris Cooper, who will speak at a screening of “Adaptation” (for which Cooper won a 2002 Oscar), and Beau Bridges, who will introduce the made-in-Seattle film “The Fabulous Baker Boys,” in which he starred. For information and schedules, see ptfilmfest.com or call 360-379-1333.\nTraveler’s tip Many (though not all) Port Townsend restaurants and businesses are closed Mondays and Tuesdays.\nGetting there Port Townsend is on the northeast tip of the Olympic Peninsula. It’s roughly two hours by car from Seattle, including a short Edmonds-Kingston ferry ride ( wsdot.wa.gov/ferries ).\nMore information Port Townsend tourism website: enjoypt.com\nMovie lovers have long flocked to Port Townsend’s Rose Theater (235 Taylor St.), an enchanting former vaudeville house that’s been serving up art-house hits, blockbusters and uncannily good popcorn since the 1990s. Two years ago, operator Rocky Friedman opened up a third screen: the beautiful, unique Starlight Room, on the third floor of the historic building next door.\nA joint operation between the Rose and the Silverwater Cafe downstairs (which provides food — an assortment of tasty small bites — and beer/wine/cocktails from an elegant bar), the Starlight Room is home to an eclectic variety of programming, watched from a softly colorful assortment of comfy vintage armchairs and sofas. I caught Hitchcock’s matchless thriller “Rear Window” there, on a sunny August evening with a houseful of dressed-up patrons, and learned that a glass of prosecco goes quite nicely with popcorn. Next time, I’ll order a food plate, just for the fun of being assigned a movie-star name for pickup (but note that there’s no food/drink minimum). The Starlight Room is open most nights; check rosetheatre.com/starlight-room to see what’s booked.\nStrolling Port Townsend’s main street on a sunny afternoon, you’ll find art everywhere (I spotted, in the window of an art-supply store, a stunning Victorian dress made entirely of plastic bread bags) — and, more or less across the street from each other, two wonderful bookstores. The Writers’ Workshoppe (820 Water St., 360-379-2617, writersworkshoppe.com ) follows the tradition of the Imprint Bookstore, which operated in this location for 30 years before its owners retired last year. In addition to being a well-stocked general bookstore, it’s also a center for writers, offering workshops, classes and clever T-shirts. (I quite liked one that read “Careful or you’ll end up in my novel.”)\nWatch a film in old-fashioned comfort at The Starlight Room, an upstairs screening room run by Port Townsend’s Rose Theater and the Silverwater Cafe. (Steve Ringman/The Seattle Times) Just a paperback’s toss away is another local institution: William James Bookseller (829 Water St., 360-385-7313), which specializes in used and out-of-print books, and whose ever-reaching shelves invite endless browsing.\nIf you’re feeling in need of a little culinary art, try the perfect scones at Pippa’s Real Tea (636 Water St., 360-385-6060, pippasrealtea.com ), a refreshingly unfrilly tearoom with a courtyard garden and a thoughtful assortment of newspapers and magazines (which you won’t need, as surely you’ve just bought a good book).\nLater in the day, consider the craft cocktails at Cellar Door (downstairs at 940 Water St., 360-385-6959, cellardoorpt.com ); the Bramble, a mixture of gin, lemon, blackberry thyme syrup and soda tasted pleasantly like liquid jam with a kick. And dinner — or any meal — at the farm-to-table Sweet Laurette Cafe & Bistro (1029 Lawrence St., 360-385-4886, sweetlaurette.com ), in its pretty French-country-style dining room, is always a treat.\nStepping back in time You really don’t need to make any effort at all to connect with history in Port Townsend. Just stroll pretty much any street and gawk at the 19th-century architecture. The friendly staff at the Jefferson Museum of Art & History (540 Water St., 360-385-1003, jchsmuseum.org ) will provide you with a handy free map listing 56 historic homes and landmarks, most of them within easy walking distance. While there, pop into the museum, housed in the 1892 former City Hall (still equipped with its original jail); exhibits of art and artifacts change regularly.\nA Port Townsend treasure is Rothschild House (corner of Franklin and Taylor streets, 360-385-1003, j chsmuseum.org/Sites/RothschildHouse.html ), an 1868 home perched on an uptown bluff. Built by early Port Townsend merchant D.C.H. Rothschild (who opened a general store downtown, the Kentucky Store, on the site of what’s now the Nifty Fifties diner), it was meticulously maintained by his daughter Emilie for many decades, keeping its original furniture, Victorian wallpaper and household goods.\nAfter her death in the 1950s, her younger brother gave the house and its contents to the Washington State Parks and Recreation Commission; it’s now open daily for tours May through September. This is no flamboyant mansion, but a comfortable, sensible-looking family home; walking through the quiet rooms, you can get a sense of the lives of those who once gazed out those windows. Look closely for details: the dining-room chairs gnawed by a resident pet parrot; the elaborate wallpaper even on the ceilings; the worn spot in the living-room rug where someone must have spent countless hours rocking.\nStreet music is played to a backdrop of historic buildings on the corner of Taylor and Water Streets in downtown Port Townsend. (Steve Ringman/The Seattle Times) And you can spend the night immersed in history at my favorite Port Townsend lodging: The Bishop Victorian Hotel (714 Washington St., 360-385-6122, bishopvictorian.com ), housed in an 1890s structure that was originally an office building. Later it became an apartment house, and an all-suite hotel by the 1980s. The antique-filled rooms, with modern bathrooms and unobtrusive kitchenettes, are comfortable without being fussy; and the location, just a block off downtown’s main street, means that you can park your car and leave it there all weekend.\nGetting outdoors Even if you, like me, are generally happier with your feet on concrete, you may still be unable to resist the charms of lovely Chetzemoka Park (off Jackson Street uptown, enjoypt.com/play/parks-beaches/ ), a half-mile stroll from downtown. The city’s first public park, it opened in 1904, named for a Klallam Indian leader instrumental to Port Townsend’s early history. Its green lawns feature trellises, bridges and garden paths along which you can imagine Victorian ladies trailing their lace frocks; for the more hardily dressed, walking trails wind along the bluff.\nMy own favorite — and only — Port Townsend hike involves walking up the historic Haller Fountain steps that take you from downtown to uptown (yes, it’s a hike; there’s always somebody gasping at the top, often me). Pause halfway and look back down toward the water; framed by leaves, it’s one of the prettiest views in town. If you’re uptown on a Saturday, don’t miss the Farmers Market on Tyler Street between Lawrence and Clay (9 a.m.-2 p.m., April-December, jcfmarkets.org ), complete with fresh produce, flowers, food stalls and crafts (including, last time I was there, earrings made from local mushrooms, which for me qualifies as an interaction with nature).\nMorgan Gilbert works on a wooden dinghy at Port Townsend’s Northwest Maritime Center. (Steve Ringman/The Seattle Times) Those looking to do more than just gaze at all that water might want to head to the Northwest Maritime Center (431 Water St., 360-385-3628, ext. 104, nwmaritime.org ), where rumor has it that you can take classes in boating, sailing, boatbuilding and other maritime skills. You can also rent paddleboards, kayaks and bicycles at Port Townsend Paddle Sports (at the Northwest Maritime Center and in nearby Fort Worden State Park; 360-379-3608, ptpaddlesports.com ); tours are available, too. At Fort Worden ( parks.wa.gov/511/Fort-Worden ), take long walks on the beaches or in the woods. Or you can just collapse on a bench somewhere and appreciate the view, at the end of a perfect weekend in Port Townsend.\nMoira Macdonald: mmacdonald@seattletimes.com or 206-464-2725. On Facebook: facebook.com/heymoira", "external_links": ["http://www.nwmaritime.org/events/wooden-boat-festival/", "http://www.enjoypt.com/play/parks-beaches/", "http://www.wsdot.wa.gov/ferries/", "http://www.parks.wa.gov/511/Fort-Worden", "http://www.rosetheatre.com/starlight-room", "http://jcfmarkets.org/", "http://www.jchsmuseum.org/Sites/RothschildHouse.html"], "published": "2015-09-04T14:00:00.000+03:00", "crawled": "2015-09-06T11:23:41.136+03:00", "highlightTitle": ""}