{"organizations": [], "uuid": "bf2cbb61a99f7d2f8bc6d0b2fcb2795834c07fc0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03453/US_Flags_3453097k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-25.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/finance/economics/11890939/Spending-boom-pushes-US-to-brink-of-interest-rate-rise.html", "country": "US", "title": "Spending boom pushes US to brink of interest rate rise", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 4, "title_full": "Spending boom pushes US to brink of interest rate rise - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T23:10:00.000+03:00", "replies_count": 3, "uuid": "742ff75182d352f48fbbf0fdb2b123dd29b40b0e"}, "author": "Mehreen Khan", "url": "http://www.telegraph.co.uk/finance/economics/11890939/Spending-boom-pushes-US-to-brink-of-interest-rate-rise.html#post-0", "ord_in_thread": 0, "title": "Spending boom pushes US to brink of interest rate rise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "A consumer spending blitz helped the US economy grow faster than expected in the second quarter of the year, adding to the raft of evidence that policymakers will raise interest rates by the end of the year. In its final estimate for economic growth, the US commerce department calculated the economy grew by 3.9pc on an annualised measure, up from a previous estimate of 3.7pc. The boom was driven by an increase in consumer spending, business investment, and stronger exports. Bright spots included the construction industry and household consumption, which rose by 3.6pc compared with an initial estimate of 3.1pc. The figures show the economic activity in the US has surged after meagre 0.6pc growth in the first three months of the year. Although economists expect moderate expansion in the second half of 2015, growth is set to remain robust. Federal Reserve chairman Janet Yellen said on Thursday the central bank is poised to fire the starting gun on a rate rise in the coming months. Her comments come a week after the Fed's rate-setters refrained from hiking rates for the first time in eight years at its September meeting. However, more recent economic data for September are set to give Ms Yellen pause for thought. The US services sector slowed to a three-month low this month, dropping to 55.6, according to an influential gauge of the country's growth engine. The purchasing manager's index (PMI) suggests GDP growth will now slow to 2.2pc in the third quarter, said Christoper Williamson at Markit, who help compile the survey. \"Unless business confidence revives, GDP growth could slow further in the fourth quarter, possible quite markedly, as optimism is now running at one of the lowest levels seen since the global financial crisis\", said Mr Williamson. “With warning lights about growth flashing and prices falling at the fastest rate for at least six years, the survey data, there’s a strong argument for the Fed to hold off hiking interest rates.” telegraph.co.uk Follow @telegraph The Telegraph Investor Transfer your Isas - buy & sell funds for free Find out more »", "external_links": [], "published": "2015-09-25T23:10:00.000+03:00", "crawled": "2015-09-25T18:37:49.634+03:00", "highlightTitle": ""}