{"organizations": [], "uuid": "1ce644d4636deef674590bdb1c3fc82d65f008bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63615/brazil-confirms-support-carnival-seychelles-tourism-minister", "country": "US", "title": "Brazil confirms support of carnival to Seychelles Tourism Minister", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Brazil confirms support of carnival to Seychelles Tourism Minister", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T23:10:00.000+03:00", "replies_count": 0, "uuid": "1ce644d4636deef674590bdb1c3fc82d65f008bb"}, "author": "eTN Editor", "url": "http://www.eturbonews.com/63615/brazil-confirms-support-carnival-seychelles-tourism-minister", "ord_in_thread": 0, "title": "Brazil confirms support of carnival to Seychelles Tourism Minister", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Brazil confirms support of carnival to Seychelles Tourism Minister   \nSep 10, 2015 Danniel Okamoto, Brazil Carnival; Stephane Perard, Emirates; Minister Alain St.Ange & Gisele Abrahao eTN   \nAlain St.Ange, the Seychelles Minister responsible for Tourism and Culture, who is on a working visit in Sao Paolo in Brazil as he heads to Colombia for the 21st General Assembly of the UNWTO (United Nations World Tourism Organization) met yesterday, Wednesday, September 9, with Danniel Okamoto of Momo King Carnival of Brazil Organization. \nAlso at the meeting were Stephane Perard, the Emirates Brazil Area Manager, and Gisele Abrahao from the head at the Seychelles Tourism Board's Brazil Office. \nThe meeting was to seek the continued support from Brazil for the annual “Carnaval of Carnavals” that is staged in Seychelles in April and where Brazil is represented by a strong and colorful delegation. Brazil is also eager to see more support from airlines flying from Brazil to the mid-ocean paradise islands of the Seychelles, and Emirates was approached to become the partner airline for the Brazilian Carnival delegation. \nDanniel Okamoto, who personally heads the Brazilian delegation to Seychelles annually, used the meeting to show to the Seychelles Minister their very own film on the Brazilian's participation at the annual carnival in Seychelles. \"The film that is used by the Brazilian Carnival Group for publicity and PR purposes depicts the beauty of the Seychelles and the diversity of the Seychellois people,\" said Gisele Abrahoa of the Seychelles Tourism Board Brazil Office. \n\"We shall continue to support the carnival in Seychelles, and we want to work to see Brazil represented by a bigger delegation every year,\" said Danniel Okamoto as he sought the support of the island's Minister St.Ange to find some twenty Seychellois to be trained by the Brazilian carnival choreographer to join their delegation during the next carnival in Seychelles. \"Brazil would provide the carnival costumes to match that are used by the Brazilians,\" said Danniel Okamoto. \nMinister Alain St.Ange of the Seychelles expressed his appreciation for the support by Brazil and said that the carnival in Seychelles remains a unique event, as it is the only carnival where all the best and most popular carnivals parade side by side followed by cultural troupes from the Community of Nations. \"We wanted to stage an event that would help the world to unite and spread the key words of peace and security, words so needed in today's troubled world. The carnival in Seychelles continues to rally more and more delegations annually at an event where religious beliefs, color of the skin, and political affiliations play no part,\" said Minister St.Ange. \nPHOTO: Danniel Okamoto, Brazil Carnival; Stephane Perard, Emirates; Minister Alain St.Ange & Gisele Abrahao, Seychelles Tourism Board Brazil Office. \nSeychelles is a founding member of the International Coalition of Tourism Partners (ICTP) . Source: Seychelles Ministry of Tourism and Culture", "external_links": [], "published": "2015-09-10T23:10:00.000+03:00", "crawled": "2015-09-10T23:30:48.920+03:00", "highlightTitle": ""}