{"organizations": [], "uuid": "5c5e03eab0c0569088667fb2ab18cedf7114fcb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.msn.com", "main_image": "", "site_section": "http://www.msn.com/en-us/travel", "section_title": "Travel - msn", "url": "http://www.msn.com/en-us/travel/news/the-biggest-beef-in-air-travel-lost-luggage/ar-AAdW2XI", "country": "US", "title": "The biggest beef in air travel: lost luggage", "performance_score": 0, "site": "msn.com", "participants_count": 4, "title_full": "The biggest beef in air travel: lost luggage", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 3, "uuid": "294cd9eb0f7c1c26778f856a98e5f3a5bafa5f33"}, "author": "Black couple uses housing law to sue over slurs, threats", "url": "http://www.msn.com/en-us/travel/news/the-biggest-beef-in-air-travel-lost-luggage/ar-AAdW2XI#post-0", "ord_in_thread": 0, "title": "The biggest beef in air travel: lost luggage", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The biggest beef in air travel: lost luggage Relaxnews (AFP) 20 hrs ago © REX What is the biggest problem you face in air travel? After scouring through the laundry list of customer complaints posted on their site, airline consultancy group Skytrax has released a ranking of the top passenger beefs in 2015 when it comes to air travel. And more than delayed flights and sky-high air fare prices, lost baggage has been named the top passenger complaint.\nFor the unfortunate travelers who’ve experienced the drama of waiting by the baggage carrousel and watching the crowds thin as everyone else spies their bag and rolls away, the results come as no surprise.\nAfter lost baggage, delays and uncomfortable seats round out the top three complaints.\nThe list, editors say, is meant to reflect a change in trends or the types of complaints. And while lost baggage may top the ranking, good news is that the overall trend in the number of mishandled bags is actually dropping.\nBecause according to the latest report released this spring by air transport IT specialist SITA, while global passenger numbers are rising, the rate of mishandling dropped by an impressive 61 percent globally in 2014 as compared to 2007.\nThe rate of mishandled bags was 7.3 bags per thousand passengers in 2014.\nThe airline industry also recorded its all-time baggage handling success rate in 2013, when lost and damaged bags dropped to 6.96 bags per thousand flyers.\nStill, the results of the list serve as a reminder that flyers should refrain from packing personal valuables and fragile items in their checked luggage such as laptop computers, money, urgent medications and jewelry.\nThe results also serve as a reminder to airlines that the best way to manage delays -- the second biggest beef on the list -- is to keep customers constantly informed.\nHere are the top 10 complaints that plagued the airline industry in 2015, according to Skytrax:\n1. Lost luggage\n2. Delayed flights\n3. Uncomfortable airline seats\n4. Hidden charges\n5. Customer service\n6. Cabin cleanliness\n7. Refunds\n8. Booking terms and conditions\n9: Airline meals\n10. Change of aircraft\n ", "external_links": ["http://pinterest.com/pin/create/button/?url=http%3a%2f%2fwww.msn.com%2f03%2fen-us%2fAAdW2XI%3focid%3dsp&media=http%3a%2f%2fimg-s-msn-com.akamaized.net%2ftenant%2famp%2fentityid%2fAAdWDpG.img&description=What+is+the+biggest+problem+you+face+in+air+travel%3f+-+REX"], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-06T02:52:38.242+03:00", "highlightTitle": ""}