{"organizations": [], "uuid": "281270e5221afeead8e43198299920d3d64ddbd0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.foxnews.com", "main_image": "http://a57.foxnews.com/global.fncstatic.com/static/managed/img/0/0/werwerewr345435fdss.jpg", "site_section": "http://www.foxnews.com/travel/", "section_title": "Travel News, Videos &amp; Vacation Guides for Planning Your Trip | Fox News", "url": "http://www.foxnews.com/travel/2015/09/29/5-airport-wi-fi-hacks-need-to-know/", "country": "US", "title": "5 airport Wi-Fi hacks you need to know", "performance_score": 0, "site": "foxnews.com", "participants_count": 2, "title_full": "5 airport Wi-Fi hacks you need to know | Fox News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 1, "uuid": "4cbf98465563cf0923c7f03cdf1ccb5a3227e649"}, "author": "FoxNews.com", "url": "http://www.foxnews.com/travel/2015/09/29/5-airport-wi-fi-hacks-need-to-know/#post-0", "ord_in_thread": 0, "title": "5 airport Wi-Fi hacks you need to know", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Published September 29, 2015 FoxNews.com livefyre Email Print Learn how to get past that airport internet access paywall. (iStock)\nAirport terminals may be adding snazzy new amenities like better shopping and high-end dining but when it comes to travel, flyers really just one thing: to zone out online.\nWhile most major airports across the country offer Wi-Fi access, getting connected isn’t always free. In some places, it could cost as much as $8 for a day pass using services like Boingo—but who stays at an airport all day?\nThankfully, computer geniuses across the country have figured out ways to bypass paywalls and other tricks to getting online without having to forgo the money for your pre-flight snack.\nCheck out the best airport hacks to get you connected to free Wi-Fi:\n1. Fool the Boingo paywall\nNo one wants to pay extra for something they could get for free. And while Boingo offers limited Wi-Fi access in some terminals, it's not free everywhere. But according to Road Warrior Voices, it is possible to bypass the service’s paywall.\nAfter connecting to the network, refrain from clicking “Get Online Now.” Instead choose “The Good Stuff” and click on one of the sites that are free to browse, usually pages like Wikipedia, LinkedIn, and a few retail sites. If it's your lucky day, you can fool the system and get through that pesky paywall to browse other sites to your heart’s content.\n2. The hacker’s URL trick\nType in a desired site and add “?.jpg” to the end of the URL before pressing Enter. It’s an oldie but a goodie and may not work at airports with more advanced systems-- or on more complex websites.\n3. Get a “brand new” computer\nIf you’re browsing for free and don’t want to shell out cash for extra time, there’s a sneaky trick to fool the powers that be. Networks know who you are based on a device’s Media Access Control (MAC) address and will try to shut you down if you reach the limit. If you run out of time, you can either download a new MAC address from Technitium MAC Address Changer (for Windows) or Linkliar (for OS X), according to Thrillist. This will fool the network into thinking you’re using a different computer and you can restart your browsing session.\n4. Enlist the help of travelers before you\nWell-meaning web browsers around the world who have figured out wireless passwords from airport terminals or VIP lounges often leave comments behind on Foursquare relaying pertinent info to the masses. Of course, those could be changed by the time you reach a destination, but it’s always a worth a shot.\n5. The time traveler\n For airports that impose a time limit on their free Wi-Fi packages, there’s another relatively simple work around. Before your window has run out, reset the clock on your device—for at least an hour—reboot and try to get back on.", "external_links": ["https://github.com/halo/LinkLiar", "https://www.thrillist.com/travel/nation/6-ways-to-get-free-airport-wi-fi", "http://technitium.com/tmac/", "http://roadwarriorvoices.com/2015/07/05/4-easy-hacks-to-get-free-wi-fi-at-any-airport/"], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T07:23:06.673+03:00", "highlightTitle": ""}