{"organizations": [], "uuid": "f6cc2439e50c20c91316d6141354bdff3b705155", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.scmp.com", "main_image": "http://cdn3.scmp.com/sites/default/files/styles/620x356/public/2015/09/09/aaa_gallery_lead_image_shutterstock_209647441.jpg?itok=XBNuCzH1", "site_section": "http://scmp.com//rss/37/feed", "section_title": "South China Morning Post - Travel & Leisure feed", "url": "http://www.scmp.com/lifestyle/travel-leisure/article/1856663/ultimate-new-lightweight-cameras-travel-photography", "country": "HK", "title": "The ultimate new lightweight cameras for travel photography", "performance_score": 0, "site": "scmp.com", "participants_count": 1, "title_full": "The ultimate new lightweight cameras for travel photography", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T13:00:00.000+03:00", "replies_count": 0, "uuid": "f6cc2439e50c20c91316d6141354bdff3b705155"}, "author": "pauljbuck", "url": "http://www.scmp.com/lifestyle/travel-leisure/article/1856663/ultimate-new-lightweight-cameras-travel-photography", "ord_in_thread": 0, "title": "The ultimate new lightweight cameras for travel photography", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get your FREE LuxeHomes Property Outlook – August 2015 now! The ultimate new lightweight cameras for travel photography image 1 \nRelying only on a smartphone for taking photos can be liberating, especially when travelling. Not only is there less to carry – especially for those who are used to lugging around a bulky DSLR camera – but being able to instantly share your photos is irresistible. But have you noticed something? Your photos aren’t as good as they used to be. They’re not as sharp or as colourful, nor are they as creative. You may also discover while swiping through your phone that you have virtually no decent photos taken at night, or in the low light of dusk and dawn in what photographers call the “golden hour”. \nIn the past couple of years there has been a collective realisation that the DSLR camera still has a lot going for it, but if only it could be shrunk to pocket size. That demand has given birth to a new generation of lightweight compact cameras with full manual controls and super-zoom lenses. They do almost everything a bulky DSLR can, but weigh far less for easier travel. \nFor amateur photographers wanting full control of their images, there is no substitute for manual settings. The latest luxe compact manuals from Sony, Canon and Panasonic offer full control over exposure, aperture and shutter speed, though all have their individual quirks. \nSo what should you look for? Consider the lens, which is fixed. Can it manage a wide-angle 24mm shot? How about optical zoom? If it reaches over 70mm you will get reasonably close to your subject, but anything less than 100mm isn’t trying hard enough. Forget megapixels, which can be misleading and don’t compare well across sensor sizes and different technologies, and instead consider whether you need to film in Ultra HD 4K video resolution. It boasts four times the detail of Full HD, and if your current television can’t display it, your next almost certainly will. \nIf you plan to travel, always look for a built-in viewfinder. As well as being easier in strong sunlight, looking through a viewfinder instead of at a glaring LCD screen will save you so much battery power, which could be crucial if you’re in a remote destination. It also helps do away with nightly recharges. However, the priority features with all of these cameras are that they have adjustable manual controls, and an easy-to-use design that puts dials and shortcut buttons within easy reach. The three frontrunners are all different, but difficult to split. \nJust updated is the fourth version of the original DSLR killer, the Sony Cybershot RX100 IV (HK$7,290, sony.com.hk ), which is as focused on video as on photos. Not only is it able to record video in slo-mo and in Ultra HD 4K quality, but stills can be grabbed from the video, too. However, its 2.9x optical zoom, f/1.8 24-70mm lens won’t get you as close to the action as the others. \nThe highlight is a pop-up electronic viewfinder that helps save battery while on the move, and uses a superbly clear OLED screen inside. All of this weighs a mere 298g. \nSomehow even lighter at just 281g is the Canon PowerShot G7 X. This 20.3 megapixel G7 X (HK$4,680, canon.com.hk ) is a pocket-sized camera with noticeably more zoom. Its 4.2x optical zoom, f1.8-2.8 24-100mm lens is twice as powerful as the Sony, so it’s ideal for both close-ups and wide angle. Its exposure compensation dial and full manual controls are handy, though perhaps its biggest advantage over the Sony is an angled, LCD touch screen on the rear, which is rare. It tilts to allow selfies, which may or may not appeal, though there is no built-in viewfinder on the G7 X. That’s a serious oversight, and it means that the G7 X struggles to compete with the Sony on true travel-grade versatility, but it’s unbeatable on zoom and price. \nLarger than the Canon and Sony, the Panasonic Lumix DMC-LX100 (HK$8,490, panasonic.hk ) is nevertheless hugely appealing. Overlook its 12.8 megapixel rating; the DMC-LX100 is built around a Four Thirds sensor that’s larger than the other two, so low-light images are actually brighter. Retro manual dials for exposure compensation, shutter speed, and an aperture ring on the f3.1x optical zoom f1.7-2.8 24-75mm lens make quick alterations easy. There is also an electronic viewfinder and a good smartphone remote app, but this isn’t just about an easy-to-use design. The 4K video capture makes the DMC-LX100 incredibly advanced, too, but at 397g it is a comparatively bulky option for travel. \nWhich one of these three reborn manual compacts will suit your travel style best depends on what you like to photograph, but they all have one thing in common; after a decade of being a slave to your smartphone, they put you back in control. Share", "external_links": [], "published": "2015-09-09T13:00:00.000+03:00", "crawled": "2015-09-09T13:37:09.353+03:00", "highlightTitle": ""}