{"organizations": [], "uuid": "b040bd68e85eb597a021f8e4aa36a93686f82591", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dailymail.co.uk", "main_image": "http://i.dailymail.co.uk/i/pix/2015/09/05/09/2BFD109700000578-0-image-a-26_1441443070808.jpg", "site_section": "http://www.dailymail.co.uk/travel/index.rss", "section_title": "Travel | Mail Online", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3223254/The-dirtiest-surfaces-plane-revealed.html", "country": "GB", "title": "Travelmath reveal the dirtiest surfaces on a plane", "performance_score": 0, "site": "dailymail.co.uk", "participants_count": 67, "title_full": "Travelmath reveal the dirtiest surfaces on a plane | Daily Mail Online", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T16:52:00.000+03:00", "replies_count": 71, "uuid": "8383d34352e8006b57a29d370f3627e88af1d49f"}, "author": "Chris Kitching for MailOnline", "url": "http://www.dailymail.co.uk/travel/travel_news/article-3223254/The-dirtiest-surfaces-plane-revealed.html#post-0", "ord_in_thread": 0, "title": "Travelmath reveal the dirtiest surfaces on a plane", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "163 shares 91\nView\ncomments\nGermophobes may want to scrub their tray tables before they tuck into a meal or rest their head the next time they’re on a plane.\nResearch has revealed that they are the dirtiest surfaces on a plane – with more germs being found on tray tables than toilets and seatbelt buckles combined.\nThose were the findings of a microbiologist, who swabbed various surfaces that are repeatedly touched or handled by travellers to reveal the dirtiest places at the airport and on the plane.\nPassengers should wipe down their tray tables when they board and never let their food touch the surface\nA microbiologist collected samples at five unnamed airports and on four planes (the airlines were not identified) in research conducted by Travelmath , an online trip calculator.\nThe samples were sent to a lab to estimate the total bacteria population per square inch. The values, in colony-forming units (CFU), are the median of the tests.\nThe study found tray tables have 2,155 CFU per square inch, far more than the lavatory flush button (265 CFU), overhead air vent (285 CFU) and seatbelt buckle (230 CFU).\n Mother's anger at Thomson after she claims the holiday... Leaping from a sculpture to jumping over a huge courgette!... 'If I were to die anywhere, I'd die there': McBusted pop... Inside the church of hooded statues: Haunting photos reveal... 163 shares At the airport, drinking fountain buttons were found to be the dirtiest surfaces, with 1,240 CFU.\nBathroom stall locks had 70 CFU.\nIf there is a positive finding from the study it’s that all 26 samples from airports and planes tested negative for the presence of fecal coliforms such as E. coli.\nIn a statement, Travelmath said airports and planes are dirtier than a person’s home. It added: ‘Surprisingly, it is the one surface that our food rests on – the tray table – that was the dirtiest of all the locations and surfaces tested.\n‘Since this could provide bacteria direct transmission to your mouth, a clear takeaway from this is to eliminate any direct contact your food has with the tray table.\n‘It’s also advisable to bring hand sanitizer for any other dirty surface you may touch along your journey.’\nTravelmath said bathrooms ranked lower because they are sanitised more frequently, while tray tables tend to be wiped down at the end of the day.\nIn comparison, tests of household items by the US National Science Foundation found that a pet bowl has a staggering 306,000 CFU per square inch, while pet toys have 19,000 CFU.\nResearch also found that countertops had 361 CFU and toilet seats had 172 CFU, while mobile phones had 27 CFU and a banknote had five CFU.\nHOW TO STAY HEALTHY ON A PLANE Planes can harbour all kinds of hidden bacteria, so before you sit down and make yourself comfortable for your flight, it's always worth cleaning the area. As well as spritzing the drop-down tray table, spray the armrests and seatbelt fastenings.\nAlthough the cabins are cleaned by airlines, 2014 findings by the Auburn University in Alabama, revealed that disease-causing bacteria can survive for up to a week inside plane cabins, on surfaces such as tray tables, seat pockets, armrests and window shades.\nDrink lots of water: Wellness manager and nutritionist at Grace Belgravia, Katie Greenall, says, 'It is tough to get the balance right, you want to remain hydrated but don't want to drink so much that you are constantly queuing for the loo. A good indication of adequate hydration is having smooth, hydrated lips. I would advise between one and two cups of water per hour.' Always ask the air stewardess for more if you need it or buy bottles in the airport, after security, to take onto the flight. Avoid fizzy water which is thought to interfere with digestion and could make you more uncomfortable. Always make sure that you sanitise your hands before and after visiting the loo, especially if hot running water and soap is unavailable. Public toilets on planes, in airports, on cruise ships and in hotels are shared by many people, and it’s always best to err on the side of caution. A study by Aquaint in 2014 found that faecal matter is present on a staggering 26 per cent of hands in the UK. Do not walk around barefoot on planes, as carpets do not get cleaned regularly and can be teaming with bacteria. Use a nose spray: There's nothing worse than a dry nose on a long haul flight. At between 30,000 and 35,000ft humidity is well below the 15 per cent required to keep nasal passages moist. A dry nose and throat disrupts the body's natural drainage system which moves viruses and bacteria down to the stomach to be flushed away. Using nasal sprays from brands such as Otrivine and Sterimar can help keep things flowing and important mucus membranes moist. Bring your own blankets: That blanket you are snuggling up to has probably been rubbed up against, wiped and sat on by a number of passengers already. Flight attendant Sara Keagle says that in her airline's economy class, freshly washed blankets and pillows are only supplied to the first flights of the day. After that, they are folded up and then reused. It's a practice that's common across many airlines. Don't chance it, bring your own. Wipe down your luggage: A suitcase will be handled by many people when travelling abroad, not to mention carted over many different floors and pavements. Before you place your case on your hotel bed to unpack, give the handles, wheels and base a wipe down with some sanitiser sprayed on a tissue or cloth. Spritz yourself: For long delays in airports, it’s great to keep yourself feeling fresh. Sanitised water can be sprayed directly on to skin to freshen it up, and it’s kind to even the most sensitive and delicate skin. Read more: Airline Hygiene Exposed", "external_links": ["http://www.travelmath.com/feature/airline-hygiene-exposed/", "http://dailym.ai/1UysN8l", "http://pubads.g.doubleclick.net/gampad/ads?sz="], "published": "2015-09-05T16:52:00.000+03:00", "crawled": "2015-09-05T19:41:16.066+03:00", "highlightTitle": ""}