{"organizations": [], "uuid": "38b6857c7bbd0f267691873b253070f2acf6ff8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/arenas-and-conference-centres/29040-spring-ball-season-has-sprung-at-the-royal-icc", "country": "US", "title": "Spring ball season has sprung at the Royal ICC", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Spring ball season has sprung at the Royal ICC", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T17:00:00.000+03:00", "replies_count": 0, "uuid": "38b6857c7bbd0f267691873b253070f2acf6ff8d"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/arenas-and-conference-centres/29040-spring-ball-season-has-sprung-at-the-royal-icc", "ord_in_thread": 0, "title": "Spring ball season has sprung at the Royal ICC", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Spring ball season has sprung at the Royal ICC Spring ball season has sprung at the Royal ICC Details Category: Arenas and Conference Centres   15:00 It’s all about the glitz and glamour this spring at the Royal International Convention Centre (Royal ICC) as ball season hits Brisbane’s newest convention centre. The Royal ICC has been the venue of choice for a number of prestigious black tie events including the Ray White Awards Dinner and UQ Engineering Ball 2015, still to come this spring is the UQU International Ball, Frontline Appeal Dinner and Wesley Mission Gala Dinne \nMore than 22,000 meals will be served by the Royal ICC chefs this spring ball season, with award-winning produce selected directly from the Royal Queensland Food and Wine Show (RQFWS) on offer. Royal ICC Executive Chef, Sean Cummings, said Royal ICC guests were treated to award-winning food and wine using some of the best produce in the nation. “The stereotypical ‘chicken or beef’ options that have dominated convention centre menus for years are a far cry from the critically acclaimed food on offer here at the Royal ICC”, he said. “We pride ourselves in using the best of the best produce sourced locally and from our connection with farmers through the Ekka and Royal Queensland Food and Wine Show. “Royal ICC guests have the choice of tasting award-winning produce on our menus including the 2015 winner of Australia’s best steak, the AACo Darling Downs Wagyu, the award-winning JBS Australia ‘Swift Premium Striploin’ from Western Queensland, the freshest local seafood and a selection of trophy winning wines and cheeses.” It’s been a star studded month with the Royal International Convention Centre (Royal ICC) playing host to iconic entrepreneur Sir Richard Branson for the prestigious Titans of Real Estate conference and Michelle Bridges for the Entrepreneurs’ Unconvention. The Royal ICC is located 1.5km from Brisbane’s CBD at the Brisbane Showgrounds, one of the city’s most prominent events precincts. Latest news", "external_links": [], "published": "2015-09-25T17:00:00.000+03:00", "crawled": "2015-09-25T17:12:03.319+03:00", "highlightTitle": ""}