{"organizations": [], "uuid": "4bf18d55a567c91f5158c6d5ba97f78d90e80276", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.independent.co.uk", "main_image": "http://static.independent.co.uk/s3fs-public/thumbnails/image/2015/09/17/14/agenda-safestay.jpg", "site_section": "http://www.independent.co.uk/travel", "section_title": "Travel | The Independent", "url": "http://www.independent.co.uk/travel/news-and-advice/harry-potter-halloween-in-house-scottish-ski-school-and-private-lounges-travel-agenda-10507232.html", "country": "GB", "title": "Harry Potter Halloween, in-house Scottish ski school, and private lounges: Travel agenda | News & Advice", "performance_score": 0, "site": "independent.co.uk", "participants_count": 1, "title_full": "Harry Potter Halloween, in-house Scottish ski school, and private lounges: Travel agenda | News & Advice | Travel | The Independent", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T18:05:00.000+03:00", "replies_count": 0, "uuid": "4bf18d55a567c91f5158c6d5ba97f78d90e80276"}, "author": "independent.co.uk", "url": "http://www.independent.co.uk/travel/news-and-advice/harry-potter-halloween-in-house-scottish-ski-school-and-private-lounges-travel-agenda-10507232.html", "ord_in_thread": 0, "title": "Harry Potter Halloween, in-house Scottish ski school, and private lounges: Travel agenda | News & Advice", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Stay safe\nSafestay has opened its second London hostel, in Holland Park. The bright, 368-bed hostel is housed within the East Wing of the original Jacobean Holland House, and its 1950s extension. There is also a private courtyard, and a garden. Dorm beds start at £15, and private rooms from £75. safestay.com\nPotter around\nTo celebrate Halloween and half term, the Warner Bros Studio Tour is hosting a special two-week feature on the darker aspects of the Harry Potter films, from 16 October to 1 November. Visitors will be able to practice their duelling techniques after learning how the films' fight scenes were made. wbstudiotour.co.uk\nGlacier trek\nVillage Ways has a new private trek in the Indian Himalayas. Heading towards Sukhram Glacier accompanied by community porters, guides and mules, the five-day trek is part of a 15-night itinerary. Accommodation is in guest houses, tents and mountain huts. The price excluding flights is £2,037pp, based on two travelling – cheaper for larger groups. villageways.com\nOh Canada\nLow-cost airline WestJet is launching its first direct flights from Gatwick, serving six Canadian cities. The new services, which start next spring, will connect London with Toronto (pictured), Vancouver, Calgary, Edmonton, Winnipeg and St John's. westjet.com\nA new private lounge is set to open in Gatwick's South Terminal on 23 September\nLounge about\nA new private lounge opens in Gatwick's South Terminal on 23 September. Guests of Clubrooms from No1 Lounges will be given a complimentary fast track through security, while in the four-room lounge they will receive unlimited Prosecco, hot food, and more. Lounge access costs £37.50pp. no1lounges.com\nSki Scotland\nNatural Retreats CairnGorm Mountain will launch an in-house ski school this winter. The Snow School will offer sessions for both adults and children, including one-to-one lessons for under-fives. A day of lessons, including ski pass and ski hire, costs £99 for adults and from £57 for children. cairngormmountain.org\nJacket in\nBergans of Norway has a new range of waterproof jackets for the autumn/winter season. The jackets are made from lightweight fabric and come in a range of colours. The Storen model is designed with rock climbers and cyclists in mind, with an extended back for maximum coverage during activity. Prices start at £180. bergans.com\nFly to Vienna\nAustrian Airlines is now flying from Manchester to Vienna. It is the only daily service between the two cities, although the airline is competing with Jet2, which operates the same route three times a week. Austrian's outbound flight departs at 1.10pm and the return at 9.50am. austrian.com", "external_links": [], "published": "2015-09-18T18:05:00.000+03:00", "crawled": "2015-09-30T11:33:28.851+03:00", "highlightTitle": ""}