{"organizations": [], "uuid": "01172a5661b792016f70d9af79928b6ae3368328", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.huffingtonpost.com", "main_image": "http://s.huffpost.com/contributors/college-tourist/headshot.jpg", "site_section": "http://www.huffingtonpost.co.uk/feeds/verticals/travel/index.xml", "section_title": "Travel - The Huffington Post", "url": "http://www.huffingtonpost.com/college-tourist/the-10-lessons-to-learn-f_b_8056918.html", "country": "US", "title": "The 10 Lessons to Learn from Traveling", "performance_score": 1, "site": "huffingtonpost.com", "participants_count": 1, "title_full": "The 10 Lessons to Learn from Traveling", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T10:16:00.000+03:00", "replies_count": 0, "uuid": "01172a5661b792016f70d9af79928b6ae3368328"}, "author": "College Tourist", "url": "http://www.huffingtonpost.com/college-tourist/the-10-lessons-to-learn-f_b_8056918.html", "ord_in_thread": 0, "title": "The 10 Lessons to Learn from Traveling", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "By College Tourist ; Author: Nicole Darian, University of Iowa \nWhat The Real World Won't Teach You \nContrary to popular belief, traveling can teach you more than a classroom, job, or relationship ever will. I've found that people's definitions of \"the real world\" vary quite a bit. For me, the real world means packing up and leaving your comfort zone, the familiar, your safe place, and experiencing unknown things - a new place, new people who may not understand you, unfamiliar customs, the list goes on. Traveling is being in the real world, and here are 10 vital lessons that it will teach you. \n1) To be more patient \nBeing American and from a big city, the fast-paced lifestyle is inevitably engrained in me. Waiting for anything - food at a restaurant, lines for the restroom, even waiting for a professor or boss to email me back - drives me crazy. The biggest lesson I've learned through my travels and backpacking is that it's okay to wait and have lag time, and if something happens to go wrong, to be patient when seeking help. Though it seems that way, traveling isn't at all luxurious like advertisements and glamorous Instagram accounts make it out to be. Your flight gets cancelled because the pilot is sick and you're stuck in the airport, you catch a stomach bug and you're on bedrest, your bus is late, you get on the wrong train, bad weather will minimize outdoor activities - it happens on every trip, and trust me, it builds character. If things always went smoothly, the adventure wouldn't exist. Patience is truly a virtue and you'll learn to tackle the circumstances as they come, which will make you appreciate the experience even more. \n2) To leave your comfort zone \nPeople don't enjoy traveling because it means leaving behind what's comfortable for them, whether it's their group of friends, air-condition, their favorite foods, pets, the list goes on. Just getting on a plane and going is the first step. It's exhilarating to forget what's familiar for a bit and expand your horizons. Once you do, there is no better feeling than taking on unfamiliar territory and making it familiar. All it takes is pulling the trigger, and you'll come home with endless stories. \n3) To be more curious \nI recently listened to a TED Radio Hour podcast called \"From Curiosity to Discovery\" and I loved every second of it. Fully understanding something that was once just an idea makes traveling so worth while. Being in new territory will probe new ideas and curiosities - what the local customs are, the local food, what language is spoken, and religious practices. Traveling and interacting with locals and natives will give you a better understanding, and therefore turning these curiosities into discoveries. This will then make you hungry to learn more, ask questions, and completely immerse yourself into a new place. \n4) To appreciate other cultures \nIt's easy to question and judge cultures that are different than yours. Traveling or living somewhere completely different gives you a new perspective that's different from just hearing or reading about it. The act of being somewhere new allows you to fully immerse yourself and appreciate that new place, from the people, the language, the clothing, and everything in between. Taking the time to come out of your shell and interact with the local culture is the way to experience and appreciate it fully. Again, this can't be taught, only experienced. \n5) To live simply \nBelieve it or not, you can survive with very, very little and get by just fine. Most people around the world do. Traveling extensively forces you to pack so lightly that you'll go home overwhelmed by how much you actually own. Not only that, but sleeping in rundown guesthouses, hostels with bed bugs, and tents pitched anywhere that you can find space really isn't the end of the world, you just learn to live with it. Steering away from lavish meals on the town and fancy cocktails on outdoor patios is another experience you may have to sacrifice while traveling if you want to save enough to travel longer. As a result, you'll come home and realize that you don't need anything more than the essentials to survive. \n6) To make friends with strangers \nIf you're traveling alone, you'll be desperate for human interaction. And guess what? Every other traveler is too! I've found it extremely rare to come across another traveler who isn't eager to hear your story, where you've been, for how long, and your opinions and advice. You can seriously build a global network even if you're traveling for just a few days. It's a beautiful thing to say that you're friends with people around the planet, and you're all bonded by one common trait: love for adventure and new experiences. If you're traveling alone, you'll never really be alone, as there will always be someone wanting to tag along for an activity or just sitting next to other travelers on public trans. This is definitely my favorite part about traveling. \n7) ...but to also embrace your solo travel experience \nAdmittedly, traveling alone does get lonely. You're constantly saying goodbye to new friends who are going to different places, having to leave a new place that you've mastered and made familiar and taking on new territory with minimal information, and sometimes no one to talk about the amazing day you had sightseeing with. Learning to eat meals in restaurants, go to bars, or walking around a new city alone takes some getting used to, but it's really okay to do these things alone. Being alone and having time to reflect on your experiences will help you appreciate them more, and you won't be distracted by outside opinions. You also won't have to deal with conflict of interests or compromising on activities! It's the best, and you will come home with a new sense of independence. \n8) To try new things \nWe're going to be forced to come out of our shells no matter what. Doing what we're used to at home doesn't always work when we travel so we have to adjust. Pick up the language and try not to stick with what's familiar. Try a restaurant serving ethnic food and avoid the touristic restaurants with equivalent food from home. Take public transportation and learn the system, it's not difficult after the first couple of times. Sign up for an outdoor activity that you might not get the opportunity to do at home like hiking, sailing, or flying in a helicopter. New places means new opportunities, so try not to pass them up. \n9) To think creatively \nSometimes it takes a little thinking outside of the box to get by. No wifi for directions? The restroom you entered is merely a hole in the ground? The buses to your next planned destination are all booked? There are always alternatives, and bumps in the road should never keep people from traveling. Studies show that people who travel think more creatively and are better at adjusting to new situations. Again, traveling isn't full of glitz and glamour as it's portrayed. there will always be something to overcome, forcing us to be creative. \n10) To find beauty in small things \nReturning from a trip, a study abroad experience, or a weekend away feels rejuvenating once we return. New perspective is gained. A home cooked meal will mean so much more to you because you missed it for so long. The person who smiled at you on the street becomes your best friend. Seeing a statue or monument in your hometown will remind you of the one you saw abroad. It's really the small things that give us joy in life, and they're usually free. Traveling is one way to learn this. \nRead more student travel stories at The College Tourist Follow College Tourist on Instagram and Facebook \nFollow College Tourist on Twitter: www.twitter.com/collegetourist More:", "external_links": [], "published": "2015-09-02T10:16:00.000+03:00", "crawled": "2015-09-02T10:21:09.145+03:00", "highlightTitle": ""}