{"organizations": [], "uuid": "9bb7e7ea0446afdfb26ce1b61881edb0af26c809", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ttgasia.com", "main_image": "", "site_section": "http://www.ttgasia.com/RSS/rss_feed.xml", "section_title": "Latest Travel Trade Breaking News", "url": "http://www.ttgasia.com/article.php?article_id=25778", "country": "", "title": "[Sponsored Post] Appeal of ASEAN destinations draws Chinese buyers to ATF 2016", "performance_score": 0, "site": "ttgasia.com", "participants_count": 1, "title_full": "[Sponsored Post] Appeal of ASEAN destinations draws Chinese buyers to ATF 2016", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "9bb7e7ea0446afdfb26ce1b61881edb0af26c809"}, "author": "Singapore, September 2, 2015", "url": "http://www.ttgasia.com/article.php?article_id=25778", "ord_in_thread": 0, "title": "[Sponsored Post] Appeal of ASEAN destinations draws Chinese buyers to ATF 2016", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "[Sponsored Post] Appeal of ASEAN destinations draws Chinese buyers to ATF 2016 Singapore, September 2, 2015 A GROUP of 30 Chinese buyers from the Greater China Region, inclusive of China, Hong Kong and Taiwan, are expected to attend ATF 2016. Due to the proximity of both regions, many Chinese travellers have set their sights on South-east Asian destinations for their leisure and incentive trips. Confirmed hosted buyer Chow Keng Fong, general manager of Poloair Holidays Shanghai, China who organised an incentive trip for 65 people in January to Bangkok and Chiangmai, says that Thailand is one of the ASEAN countries that is popular among Chinese travellers in terms of its attractions, shopping and culinary experiences. “With demand at hand, ATF is ever more so an important travel industry event and I find it very relevant to our business expansion plan. The event will allow me to gather new knowledge of products and services in the region, network with industry players and search for new business partners,” remarked Chow. Liu Hui, general manager of Chengdu Great Expectations MICE Company, Chengdu, China, another confirmed hosted buyer, agreed that participating at ATF 2016 will provide the opportunity to learn more about innovative products and services from local travel agencies in the ASEAN region. Explains Liu, “As we create packages comprising of travel, MICE, and golf activities for our clients, we want to know more about ASEAN’s tourism resources, connect with local suppliers and build a working relationship with them.” A total of 400 hosted buyers from around the world are expected to attend the three-day ATF TRAVEX event that runs from January 20-22, 2016 in Manila. Click here to see who our buyer applicants want to meet. Book a booth now before the early bird promotion ends on September 15, 2015. For more information about exhibiting, email atfsellers@ttgasia.com or visit www.atfphilippines.com/Exhibitor.php.", "external_links": [], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T18:18:30.399+03:00", "highlightTitle": ""}