{"organizations": [], "uuid": "16fede4210ea2c498b46bc5fc5517472b1900131", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ajc.com", "main_image": "http://media.cmgdigital.com/shared/img/photos/2015/09/14/54/40/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-0.jpg", "site_section": "http://www.ajc.com/s/life/", "section_title": "Life | Atlanta lifestyle, people, health, travel | AJC | www.ajc.com", "url": "http://www.ajc.com/ap/ap/top-news/northern-california-wildfire-kills-1-destroys-400-/nndy6/", "country": "US", "title": "Ferocious wildfire devastates California mountain town", "performance_score": 0, "site": "ajc.com", "participants_count": 1, "title_full": "Ferocious wildfire devastates California mountain town | www.ajc.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T15:51:00.000+03:00", "replies_count": 0, "uuid": "16fede4210ea2c498b46bc5fc5517472b1900131"}, "author": "JANIE HAR and JUSTIN PRITCHARD", "url": "http://www.ajc.com/ap/ap/top-news/northern-california-wildfire-kills-1-destroys-400-/nndy6/", "ord_in_thread": 0, "title": "Ferocious wildfire devastates California mountain town", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Earlier this summer, this small mountain town north of San Francisco opened its modest high school to residents fleeing an unusually ferocious wildfire nearby.\nNow it is Middletown itself that has been evacuated — and gutted — by another blaze that shocked firefighters with its strength and speed.\nThe town's small cluster of shops and cafes was spared, but behind them erratic winds sent flames zigzagging down leafy streets, torching some houses and sparing others. On Monday, some residents returned to find their homes reduced to concrete foundations, chimney stacks and rubble.\nA wildfire burns across a hillside in Middletown, Calif., on Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses. (AP Photo/Elaine Thompson) One woman wept and embraced her mother as they stood near among blackened appliances and twisted metal where their family home used to be. Nearby, beige houses trimmed in white remained untouched.\n\"I'm in shock. I want to cry. I'm looking at my neighbors' places, and they're all gone, and I'm still here,\" homeowner Jim Maurer said. \"We're just shaking our heads.\"\nOver the weekend, the blaze killed an elderly, disabled area resident who was trapped in her home.\nA firefighter stands near a wildfire in Middletown, Calif., on Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses. (AP Photo/Elaine Thompson) The fire and another in the Gold Rush country of the Sierra Nevada foothills, about 120 miles to the southeast, are the worst of a dozen burning in the state. Between them, they have destroyed 535 homes and hundreds of other structures and displaced 23,000 people, Mark Ghilarducci, director of the Governor's Office of Emergency Services, told reporters.\nCiting dry conditions from four years of drought, Ghilarducci called this summer's fires some of the most volatile he's seen in 30 years of emergency response work.\nThe fire that marauded through Middletown and other parts of rural Lake County, less than 100 miles north of San Francisco, was burning nearly unchecked, despite fire crews' efforts.\nFirefighters prepare to create a firebreak near a home in Middletown, Calif., on Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses. (AP Photo/Elaine Thompson) Since starting Saturday, it has consumed more than 95 square miles and injured four firefighters. An unknown number of residents were unaccounted for. Some might be safe; emergency personnel and law enforcement planned to go to their last known locations once the danger subsides.\nWhile the destruction of Middletown was not complete, it was widespread.\nThe town's two-stoplight commercial strip was largely spared. Hardester's Market & Hardware was open Monday — Grant Hardester, one of the owners, was running the lights on a generator and taking IOUs to regulars who had not evacuated.\nFirefighters create a firebreak near a home in Middletown, Calif., on Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses. (AP Photo/Elaine Thompson) \"Just to be able to buy something has lifted people's spirits and solved some problems,\" Hardester while a customer loaded two shopping carts with gasoline cans, ice, paper plates and water.\nIt was on the streets behind Middletown's shops and cafes where the capricious devastation unfolded.\nOn their rampage, flames destroyed some homes but left others standing. In many cases, firefighters made the difference. Sometimes it was simply the whims of the wind.\nFirefighters create a firebreak near a home in Middletown, Calif., on Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses. (AP Photo/Elaine Thompson) One two-story apartment complex of about 50 units was gutted, blackened cars with melted tires sitting near washers and driers and the skeletons of metal chairs. Yet a colorful play structure was untouched, and two lots away stood eight homes, behind a white picket fence.\n\"There was kind of a randomness of it because the wind was so erratic,\" Cal Fire Chief Dave Shew said as he stood in the apartment complex's ashes. \"Some good firefighting activity saved structures; there just weren't enough people to save all of them.\"\nAbout 15 miles to the northwest, the town of Cobb — population 1,700 — was badly damaged.\nSheep cross a road in front of emergency vehicles in Sheep Ranch, Calif., Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, destroying homes and sending residents fleeing. (AP Photo/Rich Pedroncelli) Adam Bailey returned home to survey the damage. He hoped to search for a relative's engagement ring, but the ash was too hot. He lost his beloved Ford pickup, the first thing he ever took out a loan on, but his family was safe — and for that he was thankful.\nElsewhere, the fire damaged or destroyed landmarks.\nIt devastated Harbin Hot Springs, a clothing optional retreat in the mountains between Middletown and Cobb. The area also is home to a string of geothermal power sites known as The Geysers, which use underground steam to generate electricity. Five of the 14 plants were affected, including power lines and wooden towers which held cooling water, said Brett Kerr, spokesman for Calpine Corp. which runs the facilities.\nA California Department of Corrections and Rehabilitation inmate work crew builds a containment line ahead of a wildfire in Sheep Ranch, Calif., Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, destroying homes and sending residents fleeing. (AP Photo/Rich Pedroncelli) Though the flames also spread into northern Napa County, but the region's famous wine valley was not threatened. Standing in the way were peaks as high as 4,300 feet.\nCalifornia has seen about 6,000 wildfires this year — about 1,500 more than this time last year.\nLake County has been particularly hard-hit. In late July, a wildfire east of Clear Lake destroyed 43 homes as it spread across more than 100 square miles. It was that fire that saw Middletown's high school serve as an evacuation shelter.\nA wildfire burns along a ridge near Sheep Ranch, Calif., Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, destroying homes and sending residents fleeing. (AP Photo/Rich Pedroncelli) As firefighters drew close to surrounding the blaze, another fire erupted Aug. 9 several miles from the community of Lower Lake.\nJim Walsh was at the Napa County Fairgrounds on Monday morning sitting around a card table with other evacuees. It was the third time this summer he had to flee Lower lake.\nThis time he left with clothing, camping gear, his dog and his drones.\nA California Department of Corrections and Rehabilitation inmate work crew walks through Sheep Ranch, Calif., on the way to battle a fire, Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, destroying homes and sending residents fleeing. (AP Photo/Rich Pedroncelli) \"My house, I hope, is standing,\" he said.\nEast of Fresno, California's largest wildfire marched away from the Sierra Nevada's Giant Sequoia trees, some of which are 3,000 years old, fire spokesman Dave Schmitt said. The fire, which was sparked by lightning July 31, has charred 211 square miles and was nearly 40 percent contained.\n___\nA motorcycle sits among burnt remains from a wildfire in Middletown, Calif., Sunday Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, destroying homes and sending residents fleeing. (Kent Porter/The Press Democrat via AP) MANDATORY CREDIT Pritchard reported from Los Angeles. Contributing to this report were Haven Daley in Middletown, Elaine Thompson in Cobb, Don Thompson in Sacramento, Kristin J. Bender and Paul Elias in San Francisco, and John Antczak in Los Angeles.\nA vehicle passes the burnt remains of a truck, destroyed by a wildfire, next to Highway 26 near Mokelumne Hill, Calif., Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, destroying homes and sending residents fleeing. (AP Photo/Rich Pedroncelli) A kitchen stove sits among the remains of home, Sunday, Sept. 13, 2015, destroyed by a fire near Mokelumne Hill, Calif. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, destroying homes and sending residents fleeing. (AP Photo/Rich Pedroncelli) Adam Bailey, left, looks through the still smoldering remains of his home as his father-in-law Joel Miller looks on Monday, Sept. 14, 2015, in Cobb, Calif. Bailey escaped the flames with his baby Saturday, just before flre roared through the neighborhood of about two dozen homes. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) Power lines continue to burn along Highway 175 outside Middleton, Calif., Monday, Sept. 14, 2015, Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) A truck passes the remains of a car destroyed from an earlier wildfire in Middleton, Calif., Monday, Sept. 14, 2015, Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) Calif., Gov. Jerry Brown discuss the state's wildfire situation during a news conference at the Governor's Office of Emergency Services in Rancho Cordova, Calif., Monday, Sept. 14, 2015. An explosive wildfire burned largely unchecked Monday after incinerating hundreds of homes and other buildings throughout rural communities north of California's Napa Valley, leaving at least one person dead and sending tens of thousands fleeing down flame-lined streets. A second massive blaze, less than 200 miles away, destroyed 135 homes as it spread through the Sierra Nevada. (AP Photo/Rich Pedroncelli) Adam Bailey sends ash flying as he sifts through the still-smoldering remains of his home Monday, Sept. 14, 2015, in Cobb, Calif. Bailey escaped the flames with his baby Saturday, just before flre roared through his neighborhood of about two dozen homes. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) A line of burned-out vehicles remain in a development of where about two dozen homes were destroyed two days earlier, Monday, Sept. 14, 2015, in Cobb, Calif. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) Firefighters create a firebreak near a home in Middletown, Calif., on Sunday, Sept. 13, 2015. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses. (AP Photo/Elaine Thompson) Deanna Hingst, right, looks on as her mother, Shirley Leuzinger, leans on friend Mike Walton as as they stand at the Leuzinger family's destroyed home Monday, Sept. 14, 2015, in Middletown, Calif. Walton lost his own home to a wildfire a decade earlier and was now helping the family with their recent loss. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) Deanna Hingst puts her arms on a massive tree and weeps outside the ashen remains of her family's home after finding the tree singed but apparently still healthy Monday, Sept. 14, 2015, in Middletown, Calif. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) Thomas Campbell, left, of the Governor's Office of Emergency Services, looks over a map of the Valley Fire, burning north of San Francisco, at the OES State Operations Center in Rancho Cordova, Calif., Monday, Sept. 14, 2015. The fire burned largely unchecked Monday after incinerating hundreds of homes and other building throughout rural communities north of California's Napa Valley, leaving at least one person dead and sending tens of thousand fleeing from the flames. (AP Photo/Rich Pedroncelli) Deanna Hingst puts her arms on a massive tree and weeps outside the ashen remains of her family's home after finding the tree singed but apparently still healthy Monday, Sept. 14, 2015, in Middletown, Calif. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) A video operator uses a mask as protetion against smoke and ash while filming the remains of an apartment building lost in a wildfire two days earlier, Monday, Sept. 14, 2015, in Middletown, Calif. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson) Calif., Gov. Jerry Brown, left, discuss the state's wildfire situation as Mark Ghilarducci, right, director of the Governor's Office of Emergency Services, looks on during a news conference at OES headquarters in Rancho Cordova, Calif., Monday, Sept. 14, 2015. An explosive wildfire burned largely unchecked Monday after incinerating hundreds of homes and other building throughout rural communities north of California's Napa Valley, leaving at least one person dead and sending tens of thousand fleeing from the flames. (AP Photo/Rich Pedroncelli) Deanna Hingst weeps as she looks at her family's destroyed home after finding Christmas decorations still intact in a small storage unit in back Monday, Sept. 14, 2015, in Middletown, Calif. Two of California's fastest-burning wildfires in decades overtook several Northern California towns, killing at least one person and destroying hundreds of homes and businesses and sending thousands of residents fleeing highways lined with buildings, guardrails and cars still in flames. (AP Photo/Elaine Thompson)", "external_links": ["http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/4f/db/980016c075fb435889787dca108450ce-c4cc16502ad341bc8f14404bc597b354-1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/32/b9/980016c075fb435889787dca108450ce-daa576f563024d458d68a58a762d3ec8-2.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/73/51/980016c075fb435889787dca108450ce-daa576f563024d458d68a58a762d3ec8-7.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/72/4d/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-4.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/03/42/980016c075fb435889787dca108450ce-daa576f563024d458d68a58a762d3ec8-8.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/52/e9/980016c075fb435889787dca108450ce-cb02430fdf194327a2eefe7d17ba0be1-5.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/40/9a/980016c075fb435889787dca108450ce-daa576f563024d458d68a58a762d3ec8-3.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/d3/08/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-8.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/96/70/980016c075fb435889787dca108450ce-daa576f563024d458d68a58a762d3ec8-10_1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/44/1d/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-5.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/0e/73/980016c075fb435889787dca108450ce-c4cc16502ad341bc8f14404bc597b354-2.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/94/3a/980016c075fb435889787dca108450ce-97a9f26e68ba44879897396507fdd91b-3_1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/74/8b/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-9.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/a0/c7/980016c075fb435889787dca108450ce-97a9f26e68ba44879897396507fdd91b-2.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/de/15/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-3_1.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/6e/c2/980016c075fb435889787dca108450ce-97a9f26e68ba44879897396507fdd91b-11.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/f7/f8/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-2.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/eb/2f/980016c075fb435889787dca108450ce-daa576f563024d458d68a58a762d3ec8-5.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/9d/c0/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-7.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/b3/71/980016c075fb435889787dca108450ce-c4cc16502ad341bc8f14404bc597b354-5.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/54/40/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/1c/dd/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-11.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/3c/b7/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-6.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/a6/f2/980016c075fb435889787dca108450ce-daa576f563024d458d68a58a762d3ec8-0.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/a3/80/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-10.jpg", "http://media.cmgdigital.com/shared/lt/lt_cache/thumbnail/600/img/photos/2015/09/14/e3/81/980016c075fb435889787dca108450ce-3e94f2f4f6ac4230bf2bd0cabc43e1f8-1_1.jpg"], "published": "2015-09-14T15:51:00.000+03:00", "crawled": "2015-09-15T03:11:18.528+03:00", "highlightTitle": ""}