{"organizations": [], "uuid": "a1b0b7329ca88d3754f99f36dce191de18ff09d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03398/pretty-lady-relaxi_3398797k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-14.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/volvo-business/small-business-advice-ideas/11785275/what-would-wtd-rejection-mean-for-smes.html", "country": "US", "title": "What would rejection of Working Time Directive mean for SMEs?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "What would rejection of Working Time Directive mean for SMEs? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T18:22:00.000+03:00", "replies_count": 0, "uuid": "a1b0b7329ca88d3754f99f36dce191de18ff09d7"}, "author": "The Telegraph", "url": "http://www.telegraph.co.uk/sponsored/business/volvo-business/small-business-advice-ideas/11785275/what-would-wtd-rejection-mean-for-smes.html", "ord_in_thread": 0, "title": "What would rejection of Working Time Directive mean for SMEs?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get small business advice at telegraph.co.uk/volvo Phil Foster is the chief executive of Bolton-based Love Energy Savings , a company that compares energy prices and helps business energy customers to get out of expensive gas and electricity contracts and find more affordable ones. He asks: What does David Cameron's possible rejection of the Working Time Directive mean for SMEs? Business writer Hazel Davis replies: In the United Kingdom it is actually the Working Time Regulations (WTR) that implement the Working Time Directive (WTD) and that mainly provide workers (not just employees) with welfare and equality of treatment protections by stipulating minimum rest breaks, daily and weekly rest and the maximum average working week. For example, under an employment contract employees can opt out of a maximum average of 48 hours’ weekly working time (and employees should not suffer detriment for not opting out). Also stipulated is the entitlement to 11 hours’ daily rest and the weekly day off as set out in the directive with some flexibility over how they’re used, entitlement to a minimum 20-minute break where the daily working time is more than six hours and entitlement to 28 days’ paid holiday annually and rules on how to make the calculations. There are various exceptions and exclusions for certain workers, derogations for young workers under 18 and further provisions for night workers for firms to comply with. The Government wants to reduce as many regulatory barriers to employing people, thereby ensuring we can compete in the global marketplace, not just a European one, and that the regulation in place actually supports growth and innovation. Any SME owner will attest to times when they have had to hope staff will work longer out of the goodness of their hearts, knowing they aren’t being paid handsomely. For all its necessities, legislation that imposes a maximum allocation of working hours is an obvious burden and laws such as this could restrict wider economic growth and place limitations on people who are happy to put in extra time each week. Neil Buck is managing director of The Personnel Dept , an outsourced HR management and employment law services company. He adds: Greasing the wheels of the economy is the main reason for such a move, which is understandable on the face of it given our current economic woes. However, I would question whether the regulations in this case are a barrier, burden or a huge headache to the majority of SMEs anyway. The opt-out already grants the worker and employer flexibility and even if we did away with the WTR, staff would still need breaks and rest periods, on a daily, weekly and annual basis, and employers should have a continued moral duty to protect young workers and night workers. This means they remain as healthy, productive and able to work as possible and that is in itself a benefit of the WTD, not a barrier or burden. It gives an even playing field for all workers. It currently gives an equality of treatment at work. It means we have an engaged workforce who know they have certain rights that are in their interests, and ultimately the interests of their employers. The lack of clarity and confusion with things such as “on call” time and accruing annual leave during long-term sickness absence etc has largely stemmed from case-law interpretation and judgments. I accept some minor things could and should be improved and clarified and made easier for SMEs and the likelihood is that any change to the regulations would be improvement-tinkering rather than a wholescale rejection. That would at least be a relief and indeed welcomed. Rejecting the WTD entirely would mean the economic wheels could come off and would actually lead to more problems, especially if employers took advantage and reduced holiday entitlement, insisted on more working hours each day or week, granted fewer breaks and so on. I fear sickness absence would go through the roof, cost the NHS more and SMEs, not to mention the economy, would suffer greatly in the long term. There are also the consequences of contracts of employment to consider here. Most of the provisions under the WTD/WTR have become entrenched and perceived “rights” would still be expected by employees. Contracts and handbooks have clauses relating to protections on holiday and working hours etc. Rejecting the WTD/WTR and any consequent altering of employment law may mean changing employment contracts on a wide scale (which can’t be done unilaterally) leaving the real possibility of termination of employment followed by re-employment on the revised terms, which runs the risk of litigation and further costs for employers. There could be mutiny ahead. • One way to incentivise your staff is with the right company car, financed in the best way for your business. Contact the Volvo Car Business Centre on 0345 600 4027 or visit volvocars.co.uk", "external_links": [], "published": "2015-09-14T18:22:00.000+03:00", "crawled": "2015-09-14T14:18:29.894+03:00", "highlightTitle": ""}