{"organizations": [], "uuid": "4c855a2f7207962b5aa6864bb7a8a2921150d21f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/unnamed-127.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/chinese-mega-star-fronts-new-video-to-promote-safer-driving-in-new-zealand/", "country": "US", "title": "Chinese mega-star fronts new video to promote safer driving in New ZealandTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Chinese mega-star fronts new video to promote safer driving in New ZealandTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "4c855a2f7207962b5aa6864bb7a8a2921150d21f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/chinese-mega-star-fronts-new-video-to-promote-safer-driving-in-new-zealand/", "ord_in_thread": 0, "title": "Chinese mega-star fronts new video to promote safer driving in New ZealandTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese mega-star fronts new video to promote safer driving in New Zealand Published on : Tuesday, September 29, 2015\nChinese celebrity Huang Lei is lending his voice and influence to spread the word about safer driving in New Zealand to his millions of fans in China.Huang Lei, star of China’s number one reality show ‘Dad, Where are we going?’ is fronting a new five minute video, filmed in New Zealand during a visit earlier this year.\nTourism New Zealand, in partnership with Air New Zealand, seized the opportunity to use Huang Lei’s visit as a way to get a serious message across about driving conditions in New Zealand – something the celebrity himself was more than happy to help with.\n“Huang Lei’s commitment to the safety of his family meant he was happy to deliver our key messages as part of his trip – that whilst self-driving is a great way to see New Zealand, driving here is very different to driving in China and visitors should consider carefully if it is the right choice for them,” says Tourism New Zealand Chief Executive Kevin Bowler.“Leveraging off the profile of influential individuals such as Huang Lei is an effective way to share these messages with a really big audience of potential visitors to New Zealand.\n“Not only is Huang Lei an actor, he is also a director, singer, screenwriter and university teacher. He has a social media following of 20 million and the teaser to the programme filmed while the family were in New Zealand, 20 years in love, generated over 2.8 million views.”In the driving video, filmed near Kaikoura, Huang Lei speaks in his own words and style, of the key differences to driving in New Zealand.\nHe includes things he considers critical for Chinese drivers to understand – the need to keep left, the need for caution on New Zealand’s windy roads and to be careful to pull off the road completely before stopping to take photographs.\nAir New Zealand will screen the video from November on its new ‘Driving in New Zealand’ inflight entertainment channel available on international flights.Air New Zealand Chief Executive Officer Christopher Luxon says the airline is pleased to be partnering with Huang Lei and Tourism New Zealand to deliver driver safety information to inbound passengers.\n“We are committed to playing our part in improving road safety and ensuring visitors have a safe and enjoyable experience while in New Zealand,” says Mr Luxon.It will also be distributed through all Tourism New Zealand owned channels in China and through public relations activity.\nThis is the latest step made by Tourism New Zealand to convey important information to people considering visiting New Zealand and a self-driving holiday.“We know that driving in New Zealand is unique and that visitors may be unprepared for much of what awaits them, particularly in terms of our roads and driving conditions. We are committed to doing what we can to get potential visitors to consider this before driving in New Zealand and to keep them and others as safe as possible,” says Kevin.\nSource:-Tourism New Zealand", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T03:48:56.804+03:00", "highlightTitle": ""}