{"organizations": [], "uuid": "2788fa99f078c95d03242c490878e0020c0534bf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.freepressjournal.in", "main_image": "http://www.freepressjournal.in/wp-content/uploads/2015/09/bundi-300x200.jpg", "site_section": "http://freepressjournal.in/?cat=1231&feed=rss2", "section_title": "Free Press Journal » Travel", "url": "http://www.freepressjournal.in/a-blissful-travel-at-bundi/", "country": "IN", "title": "A blissful travel to Bundi", "performance_score": 0, "site": "freepressjournal.in", "participants_count": 1, "title_full": "A blissful travel to Bundi", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T08:00:00.000+03:00", "replies_count": 0, "uuid": "2788fa99f078c95d03242c490878e0020c0534bf"}, "author": "FPJ Bureau", "url": "http://www.freepressjournal.in/a-blissful-travel-at-bundi/", "ord_in_thread": 0, "title": "A blissful travel to Bundi", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home / Latest News / Travel / A blissful travel at Bundi A blissful travel at Bundi — By FPJ Bureau | Sep 04, 2015 05:00 pm In order to experience a royal entourage in India, a place that easily pops up in mind is Rajasthan. The beauty of this state is never missed. One such integral part of Rajasthan is the city of Bundi. It is situated in the Hadoti region and is particularly known for its distinct architecture displayed in its forts and palaces. In order to reach Bundi you can take flights to Jaipur airport which is 220 km from Bundi. Bundi also has a small railway station in its southern part. This station is connected by trains from Agra and Kota. Bundi is one of the less explored but traditionally and culturally rich places and has many attractions a tourist looks for. A visit here will create an authentic experience as you go back in time. Taragarh Fort It is also known as ‘Star Fort’ and is the most exquisite structures of the city. It was constructed in the year 1354 on a steep hill facing the city. The fort has become a popular tourist joint over the years. It contains three tanks which never run out of water. There are three gates to enter this gigantic beauty and each of them has a distinctive name- Lakshmi Pol, Phuta Darwaza and Gagudi Ki Phatak. The fort also has tunnels which were of great significance during the war, however tourists are not allowed here. Visiting the fort is recommended who wish to get a sneak peak in the history of Rajasthan. The experience is truly marvelous. Taragarh FortPicture credits: webs.wichita.edu Bundi Palace This lavish traditional symbol is situated on the hillside adjacent to Taragarh Fort. The Chitrashala of picture gallery is open for all. The palace is a perfect example of extraordinary art which creates a time travel to witness the history of this palace. There are certain parts of the palace which are not open for tourists, but the rest is worth a visit. Bundi PalacePicture credits: www.lateralmovements.com Nawal Sagar It is a square shaped artificial lake in the centre of Bundi. The lake is dedicated to Varuna, the god of water. The lake is easily visible from Taragarh Fort. There is a temple admist the lake which is half submerged. In order to get there you need to take a boat. The lake displays a clear reflection of the city which will leave you stunned. Nawal SagarPicture credits: www.cleartrip.com Dabhai Kund It is also known as the Jail Kund. It has amazing carvings on the steps which take you down to the water level. It is considered to be one of the largest kunds in Bundi. The kunds are nothing but steep wells constructed by kings who resided here. The Dabhai Kund was constructed by Prithviraj Chauhan. It is a glorious destination for tourists coming here. Dabhai KundPicture credits: gutfan.blogspot.com Chaurasi Khambon Ki Chhatri Another major attraction in Bundi is the Chaurasi Khambon Ki Chhatri. Chaurasi means 84 and as the name suggests, the structure has 84 pillars. It was constructed in 1740 by Rao Anirudh Singh who was a famous Rajput. The interior of this place has a Shiva Lingam. The designs and patterns are quite intricate and exhibit the skilled work of artisans who worked here to make it look astounding. Chaurasi Khambon Ki ChhatriPicture credits: indiantouristplacetop10.blogspot.com Sukh Mahal It is located on the banks of Jait Sagar and is also known as Sukh Sagar. Built during the era of Umed Singh its main objective was to provide activities of the princess to be done freely. The palace has a colorful backdrop of lush greenery which is a visual treat for visitors. Sukh MahalPicture credits: mharorangilorajasthan.wordpress.com Raniji Ki Baori It is the largest baori of Bundi. Baoris are step wells which have intricate carvings. Raniji Ki Baori is around 46 m deep and was built in the year 1699 by Rani Nathavatji. Raniji Ki BaoriPicture credits: www.hadotitours.com Ratan Daulat It is another grand monument in Bundi which stands firm as a symbol to the achievements of great Rajputs. Ratan Daulat was built by Raja Rao Ratan Singh who was a noble and brave Rajput king. This structure has gorgeous architecture which includes a stable that can accommodate nine horses. Tourists require prior permission from the authorities before making a visit here. Ratan DaulatPicture credits: www.esamskriti.com Jait Sagar Lake Jait Sagar Lake is one such place where excursions can be done. It is located 3 km from Bundi and is a natural beauty with an earthy landscape. The lake was built by Jaita Meena and has mountains on all sides with hues of yellow and ochre. The lake has a fountain which is a viewpoint for tourists. Jait Sagar LakePicture credits: www.hoparoundindia.com India is a country with rich cultural heritage and it is up to us to protect our culture and not let it turn into ruins. Free Press Journal requests its readers to take the initiative of protecting our heritage and prevent it from getting destroyed in the process of Urban Development. Story compiled with inputs from:", "external_links": [], "published": "2015-09-04T08:00:00.000+03:00", "crawled": "2015-09-04T18:37:05.526+03:00", "highlightTitle": ""}