{"organizations": [], "uuid": "0be1c3ed00a9abd519aeadc089ee6325a9d5ca7b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03444/downton_3444475k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-19.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/culture/tvandradio/downton-abbey/11873974/Downton-Abbey-Lady-Marys-best-suitors.html", "country": "US", "title": "Downton: Who are Lady Mary's best and worst suitors?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Downton: Who are Lady Mary's best and worst suitors? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T19:00:00.000+03:00", "replies_count": 0, "uuid": "0be1c3ed00a9abd519aeadc089ee6325a9d5ca7b"}, "author": "Vicki Power", "url": "http://www.telegraph.co.uk/culture/tvandradio/downton-abbey/11873974/Downton-Abbey-Lady-Marys-best-suitors.html", "ord_in_thread": 0, "title": "Downton: Who are Lady Mary's best and worst suitors?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Engaged thrice, caught in sex scandals twice and married once, Lady Mary of Downton Abbey has had a colourful time of it as Yorkshire’s most eligible bachelorette. As Downton returns with the not-so-merry widow considering another serious relationship, we look back over Mary’s eager suitors and ask you to vote on who really was, or might be, her best match. Kemal Pamuk The pouting Turkish diplomat , recognising that his and Mary’s families would oppose marriage, suggested a quickie instead. Although taking Mary’s cherry required that Pamuk reap the whirlwind of such an illicit act and drop dead in a sort of instant karma situation, think how beautiful their children would have been. Evelyn Napier Always a bridesmaid, rich and handsome Napier was overlooked both times he tried to catch Mary’s eye, mainly for making the fatal error of taking along with him more charismatic men – Pamuk and Charles Blake. Still, the fact Napier admitted to Cora he was duller than the others made him charmingly self-deprecating, a rare quality among the self-satisfied toffs Mary usually goes for. Sir Richard Carlisle The newspaper tycoon had rebound written all over him after Mary lost Matthew Crawley to Lavinia Swire. True, his jealousy and manhandling of Mary made you imagine their marriage would descend into George and Martha-style recriminations and fisticuffs, but the self-made Carlisle didn’t get rich by being nice. And Mary needs a strong other half. Matthew Crawley Although a relationship between the posh goddess and the mild-mannered lawyer from Manchester was hard to fathom initially, Mary warmed to him once he became stinking rich, as you do. Over time, their love affair became more believable as Matthew tempered her frostiness and Mary made him sexier. • Downton's greatest romances Charles Blake God loves a trier. Blake was kept at arm’s length by Mary despite being keen, handsome, rich, titled, discreet, willing to get mucky in a pig sty (that’s not a euphemism – he and Mary actually rescued pigs together) and able to maintain near-Wildean levels of banter. How Mary could have preferred Gillingham is more of a mystery than what happened to Bates’s limp. She should be so lucky. Lord Gillingham He seemed to have won the battle for Mary’s heart thanks largely to being tall and titled. We admired Tony’s forward-thinking suggestion they get to know each other with an illicit roll in the hay in Liverpool, even if it did backfire when she dumped him. Gillingham does rather come across as the Edwardians’ Tim Nice But Dim. On the other hand, he’s rich enough and sexy as hell . Henry Talbot A new and improved version of Gillingham, the dark and tall Talbot turned Mary’s head in last year’s Christmas special when he showed himself a witty dance partner with a sleek motor who – a masterstroke on his part – didn’t seem all that interested in her. If only Talbot would rethink the race car career in deference to Mary’s first husband’s demise, he’d be eminently suitable. telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-09-19T19:00:00.000+03:00", "crawled": "2015-09-20T10:41:27.017+03:00", "highlightTitle": ""}