{"organizations": [], "uuid": "6df02ffd9d4a25a48672eeb13f6f80b3220ff721", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources3.news.com.au/images/2015/09/02/1227509/934319-d74d32fc-512d-11e5-af2f-e6e8604c3982.jpg", "site_section": "http://www.adelaidenow.com.au/travel/world", "section_title": "World Travel | Overseas and International World Travel | The Advertiser", "url": "http://www.adelaidenow.com.au/lifestyle/relationships/jo-thornely-recaps-the-bachelor-episode-11/story-fni0dpr0-1227509937217", "country": "US", "title": "The Bachelor: Jo Thornely recaps episode 11 | The", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "The Bachelor: Jo Thornely recaps episode 11 | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T04:54:00.000+03:00", "replies_count": 0, "uuid": "6df02ffd9d4a25a48672eeb13f6f80b3220ff721"}, "author": "Jo Thornely", "url": "http://www.adelaidenow.com.au/lifestyle/relationships/jo-thornely-recaps-the-bachelor-episode-11/story-fni0dpr0-1227509937217", "ord_in_thread": 0, "title": "The Bachelor: Jo Thornely recaps episode 11 | The", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "IT’S episode 11 of The Bachelor , with coaching junior sports, parasailing skorts, and Nina out of sorts.\nI think I’m going to vomit.\nBy now we all know how the opening scenes go. First we take a sweeping look at the Womansion ...\nThis show has a mansion in it, FYI Source: Channel 10\n... then we hang around in the lounge room drinking super-realistic tea ...\nMmm, I love Onglish Brickfast Source: Channel 10\n... then Osher comes in and does this:\nSecretly flips the bird. I mean brings an envelope. Source: Channel 10\nOsher’s envelope has a group date in it, and we finally find out what this show is all about.\nBalls. I mean sport. I mean what? Source: Channel 10\nSam wants to see how the girls adapt to certain situations. And by “certain situations” he means “children”. In the distance, there is the sound of tiny, thundering footsteps.\nOr possibly twelve ovaries exploding simultaneously. Source: Channel 10\nEach girl has to coach the kids in a specific sport, with varying degrees of success.\nSnezana’s motherly nurturing facilitates the skilled smashing of hurdles.\nSarah, who hasn’t played with a child since she was one and claims that “balls in general are not really my thing” fails to inspire the next generation of T-Ballers.\nHeather is to cricket and rapport with children what Donald Trump is to natural-looking hair.\nRachel, ex-champion of the 100 metres, 200 metres, long jump, high jump and probably the Olympics, has all the maternal warmth of a buried doorknob, and brings a holistic approach to playing soccer.\nJust put everything on the field in the goal. Everything. Source: Channel 10\nLana is, in life as in basketball coaching, inoffensive and sweet with an undulating wall of syrupy hair that prevents her from being too uninteresting.\nFinally Nina, entrusted with rugby tackling skills, is such an endearing and enthusiastic natural that I want to go to the park with her myself.\nCome at me bro Source: Channel 10\nWell done bro Source: Channel 10\nThe real winner on the day, though, is this kid, who already knows the rules of soccer thank you very much and needs his own show:\nThe Bachelor: Girl’s Germs. Source: Channel 10\nWhile we transition to the next date, can we just go back and look at Lana’s hair? Seriously, it’s like molten chocolate in a vacuum.\nWhat? Oh right, sorry. The next date. Source: Channel 10\nThe next date is a single one, which almost everyone thinks should be Nina’s.\nIt is not Nina’s.\nThat’s fine. It’s fine. I’m totally fine. Source: Channel 10\nIt is Lana’s.\nYAAAAY! Heather: OMG GOD CAN I TOUCH IT Source: Channel 10\nThe first thing you need to know about the date is that Lana is wearing a skort.\nHalf skirt. Half shorts. All controversial. Source: Channel 10\nThe second thing you need to know is that Sam and Lana go parasailing, entrusting their lives to a giant emoji.\nHow’s that fear of heights going, mate. Source: Channel 10\nThe third thing you need to know is that when you go for dinner, drinks and a private one-man concert, it’s a bit less awkward for everybody when you’re singing about waking up next to someone in bed if you hide the guitar amp behind a couple of pot plants.\nBut only a bit. Source: Channel 10\nThey dance. They speak some Spanish. They feed each other. They spend their time together talking about how it feels to spend time together.\nOne of them gives the other one a rose and a kiss on the cheek. It’s lovely, but it will probably be a bit more interesting if we just stare at Lana’s hair some more.\nBut only a bit. Source: Channel 10\nShould we check in on Nina? Let’s see how Nina’s doing. She’s the tough one in the house, right?\nNaw. Her gooey centre is leaking out of her face. Source: Channel 10\nNow, before we get to the cocktail party, can we talk about the fact that Heather rolled in something sticky and then walked through a room full of grandmas?\nGet off my lawn, dude. Source: Channel 10\nThe cocktail party is tense, not helped by the fact that Lana arrives halfway through with a rose.\nExcuse me waiter, my Parmigiana’s gone cold. Source: Channel 10\n“So what did you guys get up to?” asks Lana, after gushing about her date.\n“I put on a dress”, answers Nina, biting through her own jaw.\nShould we check in on Nina? Let’s see how Nina’s doing.\nOne technological advance away from having laser-eyes. Source: Channel 10\nSam, who can feel the weirdness in the air, locks his Furrow of Concern into overdrive.\nPICTURE 21\nHe’s concerned that this rose ceremony is going to be a great farce. Source: Channel 10\nWhether or not the rose ceremony is a great farce, it certainly gives great face, from Nina’s ever-present tongue thing:\nShe was born on a pirate ship Source: Channel 10\nTo Snezana’s sublime side-eye.\nTextbook. Source: Channel 10\nOsher, resplendent in a reinforced basalt suit, ushers Sam into the ceremony, and the first half of the roses are distributed to Snezana and Heather without incident.\nSuddenly though, Sam becomes visibly distressed, either because these decisions are getting more serious, or because he’s concerned that he may be about to monumentally waste our time.\nOr he remembered he left the iron on. Source: Channel 10\nHe picks a rose up. He puts a rose down. He WALKS OUT OF THE ROOM. Who does he think he is, Emily?!\nPerhaps it’s a good time to check in on Nina? Let’s see how Nina’s doing.\nYou and us both, babes. Source: Channel 10\nSam finds Osher deep in the Womansion’s bowels and they have a long, convoluted talk. Kind of.\nBasically it goes like this:\nSam: “This is really hard”\nOsher: “Yep”\nThis is your basic ‘suck it up princess’ face right here. Source: Channel 10\nSam re-enters the Rosatorium, wipes a drop of unnecessary drama juice from his eye, magics three roses out of thin air, and lets the girls know that nobody leaves tonight.\nNobody except, y’know, for our faith in humanity and lust for eliminations. That’s already halfway home in an Uber, and Australia just entered the Guiness Book Of Records for Highest Number Of Television Viewers All Swearing At Once .\nLet’s check in on Rachel. Rachel, how do we feel about this?\nExactly. Source: Channel 10\nJo Thornely doesn’t get enough attention at her day job, so she writes for various outlets, takes up way too much bandwidth on the internet, and loves it when you explain her jokes back to her on Twitter. Jo will be faithfully recapping The Bachelor for news.com.au. Follow her on Twitter @JoThornely\n The big Bachelor shock", "external_links": ["http://resources2.news.com.au/images/2015/09/02/1227509/936614-dc20802c-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/936146-da193742-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/935854-d9d5269c-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources0.news.com.au/images/2015/09/02/1227509/936200-da9c1df6-512d-11e5-af2f-e6e8604c3982.jpg", "http://www.news.com.au/lifestyle/relationships/jo-thornely-recaps-the-bachelor-episode-11/story-fnet0gly-1227509937217", "http://resources0.news.com.au/images/2015/09/02/1227509/935568-d794cdf6-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/936254-db20657a-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources1.news.com.au/images/2015/09/02/1227509/934425-d8616726-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources0.news.com.au/images/2015/09/02/1227509/936280-db64ea92-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/935646-d822241c-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources1.news.com.au/images/2015/09/02/1227509/934373-d7db5c94-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/936782-d63ccae4-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources3.news.com.au/images/2015/09/02/1227509/936083-d995b854-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources0.news.com.au/images/2015/09/02/1227509/936308-dbde1624-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/936666-d5ba6356-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources1.news.com.au/images/2015/09/02/1227509/936005-d9162508-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/936226-dad84d30-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources0.news.com.au/images/2015/09/02/1227509/935672-d8a8ee02-512d-11e5-af2f-e6e8604c3982.jpg", "https://twitter.com/jothornely", "http://resources2.news.com.au/images/2015/09/02/1227509/935750-d9513ada-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources3.news.com.au/images/2015/09/02/1227509/937191-d74d32fc-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/936386-dc654108-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources3.news.com.au/images/2015/09/02/1227509/936731-d5fca662-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/936822-d6823d36-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources3.news.com.au/images/2015/09/02/1227509/937111-d6c3b28e-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/935698-d8e295f8-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/936562-dba5b400-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources1.news.com.au/images/2015/09/02/1227509/937137-d705a810-512d-11e5-af2f-e6e8604c3982.jpg", "http://resources2.news.com.au/images/2015/09/02/1227509/935906-da5ba1d6-512d-11e5-af2f-e6e8604c3982.jpg"], "published": "2015-09-03T04:54:00.000+03:00", "crawled": "2015-09-02T14:54:39.398+03:00", "highlightTitle": ""}