{"organizations": [], "uuid": "f2979a808212beddc687764c8fe30875917ee6e9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63805/angama-maras-out-africa-luxury-lodge-most-romantic-safari-experi", "country": "US", "title": "Angama Mara's 'Out of Africa' Luxury Lodge: is this the Most Romantic Safari Experience in the World?", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Angama Mara's 'Out of Africa' Luxury Lodge: is this the Most Romantic Safari Experience in the World?", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T11:13:00.000+03:00", "replies_count": 0, "uuid": "f2979a808212beddc687764c8fe30875917ee6e9"}, "author": "Assignment Editor", "url": "http://www.eturbonews.com/63805/angama-maras-out-africa-luxury-lodge-most-romantic-safari-experi", "ord_in_thread": 0, "title": "Angama Mara's 'Out of Africa' Luxury Lodge: is this the Most Romantic Safari Experience in the World?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Angama Mara's 'Out of Africa' Luxury Lodge: is this the Most Romantic Safari Experience in the World?   \nSep 16, 2015 eTN   \nAngama Mara has already appeared on the hottest luxury hotel opening list of 2015. This safari lodge, which has recently opened, is destined to rise above all others with creators, Steve and Nicky Fitzgerald, firmly giving it the imprimateur of a couple who have opened more than 50 luxury safari lodges across sub Saharan Africa and India. \nAngama Mara is set on the edge of the Oloololo Escarpment, on one of the most sought-after parcels of land on the entire continent - the very site where some of the most romantic scenes from Out of Africa were filmed. This luxury lodges comprises two separate and intimate camps, each encompassing just 15 tented guest suites. \nThe most outstanding game viewing is on show all year round in the Mara Triangle. Guests access the reserve via a private track where they can witness one of the continent's most dramatic events, a Mara River crossing. Inspired by the Swahili word for 'suspended in mid-air,' Angama Mara virtually floats 1,000 feet above the Great Rift Valley where, every morning, hot air balloons sail past the 30-foot-wide floor-to-ceiling glass fronts of each tented suite. \nAt the lodge's Pavilion, set between the two camps, is the Fitness Room, a 40-foot-long swimming pool, a curated gallery of African craft, clothing and jewellery, and a sun-filled studio where Maasai women work at beading bespoke items. \nAngama Mara offers guests a mix of thrilling adventure and laid-back relaxation, complete with safaris in open game-viewers at one's leisure and lovely things to do in and around the lodge such as an intimate picnic - Out of Africa style - with a wicker basket, checked blanket, Stanley flask, Champagne on ice and cucumber sandwiches. This experience is only to be found at Angama Mara. For those guests who love the movie or are hopeless romantics, this is surely the highlight of any stay? \nWithout wanting to turn the traditional game drive completely on its head, the Angama Mara guiding team felt it might be time to shake things up a little: the team struck on the idea of crafting game drives around the guest. Guests are asked where they have been; what they have seen; what their great passions are; what they would like to do and when they would like to do it; and for how long they would like to be on a game drive at any one time – and game drives are structured accordingly.", "external_links": [], "published": "2015-09-16T11:13:00.000+03:00", "crawled": "2015-09-16T11:38:57.324+03:00", "highlightTitle": ""}