{"organizations": [], "uuid": "7973465b1462cde2a03d8bbd36c9bb8045b3b2d7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.express.co.uk", "main_image": "http://cdn.images.express.co.uk/img/dynamic/133/590x/activity-travel-festival-charity-food-ballet-art-theatre-Kirsten-Jones-607993.jpg", "site_section": "http://www.express.co.uk/posts/rss/132/travel", "section_title": "Daily Express :: Travel Feed", "url": "http://www.express.co.uk/travel/activity/607993/Best-things-to-do-this-week-27-September", "country": "IE", "title": "From ballet to charity campaign and delicious food: The best things to do this week", "performance_score": 0, "site": "express.co.uk", "participants_count": 0, "title_full": "From ballet to charity campaign and delicious food: The best things to do this week", "spam_score": 0.0, "site_type": "news", "published": "2015-09-27T02:01:00.000+03:00", "replies_count": 0, "uuid": "7973465b1462cde2a03d8bbd36c9bb8045b3b2d7"}, "author": "", "url": "http://www.express.co.uk/travel/activity/607993/Best-things-to-do-this-week-27-September", "ord_in_thread": 0, "title": "From ballet to charity campaign and delicious food: The best things to do this week", "locations": ["London"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From ballet to charity campaign and delicious food: The best things to do this week From ballet to charity campaign and delicious food: The best things to do this week BAKE a cake, enjoy a new ballet and celebrate the taste of the capital at the London Restaurant Festival this week. PUBLISHED: PUBLISHED: 00:01, Sun, Sep 27, 2015 PH \nGO TO \nGet yourself a slice of seventh heaven with a month-long celebration of eating out in London. More than 350 establishments will take part in the seventh London Restaurant Festival, which starts on Thursday and sees eateries across the city offering a range of cuisines and dishes created by some of the country’s leading chefs. See londonrestaurantfestival.com . PH \nTAKE PART \nThe great British booze challenge gets under way this week as Macmillan launches its Go Sober for October campaign. The charity wants people to ditch drink and raise cash for cancer patients. \nThe campaign, which starts on Thursday, challenges people to abstain from alcohol for 31 days, benefit from hangover-free days and donate funds to the charity. For information, see gosober.org.uk . PH \nDO \nBritish bakers are going public this week to raise funds for seriously ill children. \nBakers across the country will be taking part in Craft Bakers’ Week, in conjunction with Make-A-Wish UK, which grants magical wishes to ill children, to host a range of tastings, promotions and competitions. Visitors will also see their favourite bread, cakes and sweet treats being made. \nCraft Bakers’ Week starts tomorrow and runs until Saturday. To find a participating bakery in your area, visit craftbakersweek.co.uk . PH \nSEE \nNorthern Ballet takes its adaptation of George Orwell’s novel 1984 to Nottingham’s Theatre Royal from Tuesday to Saturday. Choreographed by former Royal Ballet dancer Jonathan Watkins, the lead roles are taken by Tobias Batley and Martha Leebolt, while the score is written by Tony-nominated composer Alex Baranowski and played by the Northern Ballet Sinfonia. \nAdult tickets cost from £15. See trch.co.uk . Related articles", "external_links": [], "published": "2015-09-27T02:01:00.000+03:00", "crawled": "2015-09-27T11:38:16.642+03:00", "highlightTitle": ""}