{"organizations": [], "uuid": "a465dbb2e6465c7ac2b35941481ef069c8beb0bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30062038/johnson-controls-announces-global-workforce-reductions", "country": "US", "title": "Johnson Controls announces global workforce reductions", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Johnson Controls announces global workforce reductions - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-18T03:00:00.000+03:00", "replies_count": 0, "uuid": "a465dbb2e6465c7ac2b35941481ef069c8beb0bb"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30062038/johnson-controls-announces-global-workforce-reductions", "ord_in_thread": 0, "title": "Johnson Controls announces global workforce reductions", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Johnson Controls\nTargeting $250 million in annual cost savings\nMILWAUKEE , Sept. 18, 2015 /PRNewswire/ -- Johnson Controls, (NYSE: JCI), announced today it is planning to reduce its global salaried workforce by as many as 3,000 people, or 2.5% of total employees, through comprehensive initiatives designed to ultimately deliver up to $250 million in annual cost savings. These actions will occur over the next two years.\nIn its third quarter earnings announcement, the company announced it was initiating a comprehensive cost saving program to address existing costs. Productivity improvements continue to be realized through the ongoing implementation of the Johnson Controls Operating System (JCOS) which is lowering annual operating expenses through standardization, simplification and waste reduction across the company.\n\"As we continually adapt to our changing business portfolio, there is significant opportunity across the company for us to reduce costs, simplify processes and increase our speed and agility,\" said Alex Molinaroli , chairman and CEO. \"The steps we are taking now will enable a more competitive, sustainable cost structure for Johnson Controls as we continue to move the company forward.\"\nFORWARD-LOOKING STATEMENT\nJohnson Controls, Inc. has made statements in this document that are forward-looking and, therefore, are subject to risks and uncertainties. All statements in this document other than statements of historical fact are statements that are, or could be, deemed \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. In this document, words such as \"may,\" \"will,\" \"expect,\" \"intend,\" \"estimate,\" \"anticipate,\" \"believe,\" \"should,\" \"forecast,\" \"project\" or \"plan\" or terms of similar meaning are also generally intended to identify forward-looking statements. Johnson Controls cautions that these statements are subject to numerous important risks, uncertainties, assumptions and other factors, some of which are beyond the Company's control that could cause actual results to differ materially from those expressed or implied by such forward-looking statements. These factors include timing of the announced actions, required regulatory approvals that are material conditions for proposed actions to conclude, as well as other factors discussed in Item 1A of Part I of Johnson Controls' most recent Annual Report on Form 10-K for the year ended September 30, 2014. Shareholders, potential investors and others should consider these factors in evaluating the forward-looking statements and should not place undue reliance on such statements. The forward-looking statements included in this document are only made as of the date of this document, and Johnson Controls assumes no obligation, and disclaims any obligation, to update forward-looking statements to reflect events or circumstances occurring after the date of this document.\nAbout Johnson Controls:\nJohnson Controls is a global diversified technology and industrial leader serving customers in more than 150 countries. Our 170,000 employees create quality products, services and solutions to optimize energy and operational efficiencies of buildings; lead-acid automotive batteries and advanced batteries for hybrid and electric vehicles; and seating components and systems for automobiles. Our commitment to sustainability dates back to our roots in 1885, with the invention of the first electric room thermostat. Through our growth strategies and by increasing market share we are committed to delivering value to shareholders and making our customers successful. In 2015, Corporate Responsibility Magazine recognized Johnson Controls as the #14 company in its annual \"100 Best Corporate Citizens\" list. For additional information, please visit http://www.johnsoncontrols.com or follow us @johnsoncontrols on Twitter.\nCONTACT:\nFraser Engerman\n414-524-2733\nfraser.engerman@jci.com\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/johnson-controls-announces-global-workforce-reductions-300145271.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CG05575&Transmission_Id=201509180800PR_NEWS_USPR_____CG05575&DateId=20150918", "http://www.prnewswire.com/news-releases/johnson-controls-announces-global-workforce-reductions-300145271.html", "http://www.xmlnews.org/ns/", "http://www.johnsoncontrols.com/"], "published": "2015-09-18T03:00:00.000+03:00", "crawled": "2015-09-18T15:22:55.216+03:00", "highlightTitle": ""}