{"organizations": [], "uuid": "d5aac1d1c0aeac1bfa4d6567214e6bf72ba5b896", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/unnamed12-300x171.png", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/celebrate-world-tourism-day-with-wtm-africa/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+travelandtourworld-travelandtourismnews+%28Travel+And+Tour+World%29", "country": "US", "title": "Celebrate World Tourism Day with WTM Africa - Travelandtourworld.comTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Celebrate World Tourism Day with WTM Africa - Travelandtourworld.comTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "5f5bef23901650f47c8208e312570c3dda68f5fc"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/celebrate-world-tourism-day-with-wtm-africa/", "ord_in_thread": 0, "title": "Celebrate World Tourism Day with WTM Africa - Travelandtourworld.comTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Celebrate World Tourism Day with WTM Africa  \nAs we approach World Tourism Day this Sunday, a global initiative driven by United Nations World Tourism Organisation (UNWTO), WTM Africa seeks to raise awareness of the importance of tourism on the African continent.\nThe international focus this coming World Tourism Day, is to highlight the opportunities tourism create globally via the 1 Billion Tourists, 1 Billion Opportunities campaign. The aim is to illustrate the impact tourism has on creating a better world, better opportunities and a successful future for communities socially, politically and culturally.\nAccording to UNWTO, “Every time we travel, for whatever reason, we are part of a global movement; a movement that has the power to drive inclusive development, create jobs and build the sustainable societies we want for our future; a movement that builds mutual understanding and can help us safeguard our shared natural and cultural heritage.”\nUN Secretary-General Ban Ki-moon describes this momentous day saying, “This year´s World Tourism Day highlights the global potential of tourism for socio-economic development. With more than one billion international tourists now traveling the world each year, tourism has become a powerful and transformative force that is making a genuine difference in the lives of millions of people.”\nIn 2016, WTM® Africa is striving to further enhance strategic relationships between African companies and international businesses, both inbound and outbound, so as to grow Africa’s position universally as one of the leading continents in tourism growth and development.\nThe official festivities will take place in Burkina Faso, and this is a wonderful opportunity to highlight Africa’s presence on the global tourism platform. “Tourism forms an integral part of Africa’s economy and is steadily becoming one of the leading drivers for economic growth across the continent. Tourism leads to job creation, community upliftment and social development. We look forward to celebrating this important day,” says Chardonnay Marchesi, General Manager of World Travel Market Africa", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T18:35:55.245+03:00", "highlightTitle": ""}