{"organizations": [], "uuid": "f48f1d1e85ef5d66dcba0e68b6d4dea75f2b2541", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48528/c", "section_title": "Travel &amp; Leisure - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30144472/source1-purchasing-named-as-florida-company-to-watch", "country": "US", "title": "Source1 Purchasing Named as Florida Company to Watch", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Source1 Purchasing Named as Florida Company to Watch - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "f48f1d1e85ef5d66dcba0e68b6d4dea75f2b2541"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30144472/source1-purchasing-named-as-florida-company-to-watch", "ord_in_thread": 0, "title": "Source1 Purchasing Named as Florida Company to Watch", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Source1 Purchasing\nBOYNTON BEACH, Fla. , Sept. 29, 2015 /PRNewswire/ -- Source1 Purchasing, a leading national purchasing services organization for the lodging, leisure, restaurant and gaming industries, has been named a 2015 Florida Companies to Watch winner. Recently announced by GrowFL, the award honors 50 select second-stage companies from throughout the state for developing valuable products and services, creating quality jobs, enriching communities, and broadening new industries throughout Florida .\nSource1 is among 50 statewide companies expected to see significant growth over the next several years, and was selected from more than 500 nominees for Florida Companies to Watch SM , a statewide program managed by economic development group GrowFL, in association with the Edward Lowe Foundation.\n\"We're honored to have been named a winner,\" said Scott Hoffmire , President and CEO, Source1 Purchasing. \"Respected awards like these are the real differentiators for businesses. Our clients know when they work with Source1, they're working with a successful, growing business. Not only because we say so, but because others do as well.\"\nSource1's management team, competitive market position and strong community involvement were among several factors that put them in contention for the award.\n\"These stand-out companies are all led by entrepreneurs, and have demonstrated their capacity and intent to grow,\" said Dr. Tom O'Neal , executive director of the Florida Economic Gardening Institute and associate vice president for the University of Central Florida's Office of Research and Commercialization. \"They also all have critical intellectual property or a niche position that gives them a competitive edge in their markets,\" he said.\nThe 50 companies named the 2015 Florida Companies to Watch generated a total of more than $1.2 billion in revenue and added nearly 1,000 employees between 2011 and 2014. Together, the companies project a 23 percent increase in revenue and 19 percent increase in job growth in 2015. Companies named to the list will be officially recognized November 5 at the Hard Rock Live, Universal CityWalk, Orlando .\nFounded in 1997, Source1 Purchasing is a purchasing services organization with $7 billion in purchasing power. Source1 specializes in providing cost management, savings, and operational efficiencies for lodging, leisure, restaurant and gaming industries, helping operators increase profits through purchasing. The award-winning Source1 team creates solutions that empower operators of all sizes to reduce costs, ensure consistent product quality, and achieve higher customer satisfaction. For more information visit www.source1purchasing.com or call (877) 717-5566.\nLogo - http://photos.prnewswire.com/prnh/20150716/237743LOGO\n releases/source1-purchasing-named-as-florida-company-to-watch-300151044.html\n ", "external_links": ["http://www.source1purchasing.com/", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20150716/237743LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=FL15183&Transmission_Id=201509291612PR_NEWS_USPR_____FL15183&DateId=20150929", "http://www.prnewswire.com/news-releases/source1-purchasing-named-as-florida-company-to-watch-300151044.html", "http://photos.prnewswire.com/prnvar/20150716/237743LOGO"], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-30T01:27:11.044+03:00", "highlightTitle": ""}