{"organizations": [], "uuid": "f8db4387fffc2a6ee77392a4afae9a9a9a0d484c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64249/w-hotels-worldwide-debut-serbia-w-belgrade", "country": "US", "title": "W Hotels Worldwide to debut in Serbia with W Belgrade", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "W Hotels Worldwide to debut in Serbia with W Belgrade", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T20:20:00.000+03:00", "replies_count": 0, "uuid": "f8db4387fffc2a6ee77392a4afae9a9a9a0d484c"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64249/w-hotels-worldwide-debut-serbia-w-belgrade", "ord_in_thread": 0, "title": "W Hotels Worldwide to debut in Serbia with W Belgrade", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "W Hotels Worldwide to debut in Serbia with W Belgrade   \nSep 28, 2015   \nBELGRADE, Serbia - Starwood Hotels & Resorts Worldwide, Inc today announced an agreement with Belgrade Waterfront LLC to debut the iconic W brand in Serbia with the opening of W Belgrade and The Residences at W Belgrade. Scheduled to open in 2019, W Belgrade will set the pace in Serbia’s thriving hospitality scene, bringing the ultimate in insider access to its cosmopolitan capital and its dynamic river front. The landmark W project will be located in the heart of Belgrade Waterfront, a new one million square meter community including retail outlets, restaurant and bars, offices, public parks and leisure attractions. \n“We are thrilled to establish our relationship with Belgrade Waterfront LLC and introduce the W Hotels’ brand energetic DNA to Serbia, especially into Belgrade,” said Michael Wale, President, Starwood Hotels & Resorts, Europe, Africa and Middle East. “The Serbian capital is an exciting emerging city and a burgeoning tourist destination in Europe. We look forward to attracting both local and international guests to W Belgrade and this spectacular new city hub.” \nCentrally located on the two kilometer long public waterfront edge overlooking the Sava River, W Belgrade will feature 120 stylish guest rooms and suites. The hotel will ignite the city with its electrifying style and a full calendar of exclusive W Happenings, showcasing the latest in design, fashion and music. The hotel will also offer an all-day dining venue, a destination bar and W Living Room (the W brand’s take on the staid hotel lobby where guests can mix and mingle). Other facilities will include an Away® Spa, FIT® state-of-the-art fitness facility and a glamorous WET® pool deck and bar. Guests can also expect the W brand’s signature Whatever/Whenever® service philosophy, providing guests whatever they want, whenever they want it. W Belgrade will feature more than 450 square meters of ultra-modern meeting and event space. \n“Welcoming a leading hotel brand shows tourist potential for both Belgrade and Serbia,” Nikola Nedeljkovic, General Manager, Belgrade Waterfront. “Starwood Hotels & Resorts shares the same values as Belgrade Waterfront in providing an unmatched lifestyle choice for its residents and guests. As the first hospitality project in Belgrade Waterfront, W Belgrade is ideally situated in a prime waterfront setting near the River Sava, next to the first two BW Residences residential towers. We are delighted that W Hotels will help us contribute to an influx of tourism to the capital.” \n“W Hotels continues to expand into some of the most exciting and vibrant destinations around the world,” said Bart Carnahan, Senior Vice President, Acquisitions & Development, Starwood Hotels & Resorts, Europe, Africa & Middle East. “The signing of this landmark W project in Belgrade underscores our commitment to growing this illustrious brand in both emerging and established markets.” \nThe Residences at W Belgrade will offer 165 luxurious branded residential apartments ranging from 55 to 100 square meters, spanning across two towers. Residents will enjoy access to the facilities and services at W Belgrade. \nBelgrade Waterfront will also feature world-class residences and offices, Belgrade Mall, educational institutions and modern healthcare amenities. BW Residences, which is adjacent to W Belgrade Hotel & Residences, is scheduled for groundbreaking on September 27, 2015, kicking off the construction of the first building at Belgrade Waterfront.", "external_links": [], "published": "2015-09-28T20:20:00.000+03:00", "crawled": "2015-09-28T20:31:25.264+03:00", "highlightTitle": ""}