{"organizations": [], "uuid": "330fd95e64aee95c94f9a67c281221f5d5b9a673", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30117227/double-digit-new-car-sales-growth-expected-in-september-2015-according-to-kelley-blue-book", "country": "US", "title": "Double-Digit New-Car Sales Growth Expected In September 2015, According To Kelley Blue Book", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Double-Digit New-Car Sales Growth Expected In September 2015, According To Kelley Blue Book - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "330fd95e64aee95c94f9a67c281221f5d5b9a673"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30117227/double-digit-new-car-sales-growth-expected-in-september-2015-according-to-kelley-blue-book", "ord_in_thread": 0, "title": "Double-Digit New-Car Sales Growth Expected In September 2015, According To Kelley Blue Book", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Kelley Blue Book\nVolkswagen Group Underperforms Industry Following Crisis; October and Beyond Could Prove Worse\nIRVINE, Calif. , Sept. 25, New-vehicle sales are expected to increase 12 percent year-over-year to a total of 1.39 million units in September 2015 , resulting in an estimated 17.5 million seasonally adjusted annual rate (SAAR), according to Kelley Blue Book www.kbb.com , the only vehicle valuation and information source trusted and relied upon by both consumers and the automotive industry. At 1.39 million units this will be the highest September sales volume since 2006.\nExpect big increases across the industry in September, with the average gains from manufacturers in the double digits. Including Labor Day sales with September totals this year is one reason for the big jump, but the underlying demand for new vehicles remains strong. With the average age of vehicles on the road increasing, used-car prices on the rise and financing still inexpensive, it looks like new-car sales will continue to increase in the near future.\n\"While the Volkswagen scandal will have a negative impact on sales, the affected models represent less than a quarter of their portfolio, and some dealers have already depleted their stock of those units,\" said Alec Gutierrez , senior analyst for Kelley Blue Book. \"The larger issue is the hit the automaker's brand image and perceived trustworthiness, which may affect sales of their other models. We think the effects on September sales won't be too bad for Volkswagen Group's combined sales, but October and beyond could be another story.\"\nKey Highlights for Estimated September 2015 Sales Forecast:\nIn September, new light-vehicle sales, including fleet, are expected to reach 1,390,000 units, up 11.9 percent from September 2014 and down 11.7 percent from August 2015 . The seasonally adjusted annual rate for September 2015 is estimated to be 17.5 million, up from 16.4 million in September 2014 and down from 17.7 million in August 2015 . Retail sales are expected to account for 86.7 percent of volume in September 2015 , up from 85.5 percent in September 2014 . Ford Motor Company Continues Gains on Truck, Van Segments; Korean Brand Strength Attributed to Fleet Sales\nFord Motor Company should have another solid month of growth, with gains coming from the truck and van segments. The Ford Transit van is proving to be a success in the U.S., pushing the brand's van volume up 27 percent this year.\nIn addition, Hyundai and Kia could see some major sales improvements, with projected growth of 18 percent from this time last year, despite having product portfolios leaning heavily toward the declining car segment. However, some of the strength is attributed to the rise in the automaker's fleet sales, which are up 24 percent for the year.\nSales Volume 1\nMarket Share 2\nManufacturer\nSep-15\nSep-14\nYOY %\nSep-15\nSep-14\nYOY %\nGeneral Motors (Buick, Cadillac, Chevrolet, GMC)\n246,000\n223,437\n10.1%\n17.7%\n18.0%\n-0.3%\nFord Motor Company (Ford, Lincoln)\n205,000\n179,518\n14.2%\n14.7%\n14.4%\n0.3%\nToyota Motor Company (Lexus, Scion, Toyota)\n190,000\n167,279\n13.6%\n13.7%\n13.5%\n0.2%\nFiat Chrysler (Chrysler, Dodge, FIAT, Jeep, RAM)\n188,000\n169,890\n10.7%\n13.5%\n13.7%\n-0.1%\nAmerican Honda (Acura, Honda)\n135,000\n118,223\n14.2%\n9.7%\n9.5%\n0.2%\nNissan North America (Infiniti, Nissan)\n116,000\n102,955\n12.7%\n8.3%\n8.3%\n0.1%\nHyundai-Kia\n114,000\n96,638\n18.0%\n8.2%\n7.8%\n0.4%\nVolkswagen Group (Audi, Volkswagen, Porsche)\n48,000\n44,520\n7.8%\n3.5%\n3.6%\n-0.1%\nTotal 3\n1,390,000\n1,242,506\n11.9%\n-\n-\n-\n1 Historical data from OEM sales announcements\n2 Kelley Blue Book Automotive Insights\n3 Includes brands not shown\nCompact Utility Continues Streak as Most Popular Segment; Trucks Climb on F-150 Availability\nFor the second month in a row, the compact utility segment will be the most popular. In September, sales in this segment have flourished as U.S. gas prices approach the low $2 range nationally, and year-to-date sales are up 14 percent.\n\"September also should be a strong month for truck sales, fueled by the low gas prices and the increased availability of the aluminum-bodied F-150,\" said Gutierrez. \"The F-Series hit 70,000 units in August for the first time this year, and should show continued improvement this month.\"\nSales Volume 1\nMarket Share\nSegment\nSep-15\nSep-14\nYOY %\nSep-15\nSep-14\nYOY %\nCompact SUV/Crossover\n203,000\n155,285\n30.7%\n14.6%\n12.5%\n2.1%\nFull-Size Pickup Truck\n199,000\n173,127\n14.9%\n14.3%\n13.9%\n0.4%\nMid-Size Car\n197,000\n176,256\n11.8%\n14.2%\n14.2%\n0.0%\nCompact Car\n183,000\n165,880\n10.3%\n13.2%\n13.4%\n-0.2%\nMid-Size SUV/Crossover\n153,000\n135,188\n13.2%\n11.0%\n10.9%\n0.1%\nTotal 2\n1,390,000\n1,242,506\n11.9%\n-\n-\n-\n1 Kelley Blue Book Automotive Insights\n2 Includes segments not shown\nThere are 25 sales days in September 2015 , compared to 24 sales days in September 2014 . All percentages are based on raw volume, not daily selling rate.\nTo discuss this topic, or any other automotive-related information, with a Kelley Blue Book analyst on-camera via the company's on-site studio, please contact a member of the Public Relations team to book an interview.\nFor more information and news from Kelley Blue Book's KBB.com, visit www.kbb.com/media/ , follow us on Twitter at www.twitter.com/kelleybluebook (or @kelleybluebook), like our page on Facebook at www.facebook.com/kbb , and get updates on Google+ at https://plus.google.com/+kbb .\nAbout Kelley Blue Book ( www.kbb.com )\nFounded in 1926, Kelley Blue Book, The Trusted Resource® , is the only vehicle valuation and information source trusted and relied upon by both consumers and the automotive industry. Each week the company provides the most market-reflective values in the industry on its top-rated website KBB.com, including its famous Blue Book® Trade-In Values and Fair Purchase Price, which reports what others are paying for new and used cars this week. The company also provides vehicle pricing and values through various products and services available to car dealers, auto manufacturers, finance and insurance companies, and governmental agencies. Kelley Blue Book's KBB.com ranked highest in its category for brand equity by the 2015 Harris Poll EquiTrend ® study and has been named Online Auto Shopping Brand of the Year for four consecutive years. Kelley Blue Book Co., Inc. is a Cox Automotive company.\nLogo - http://photos.prnewswire.com/prnh/20121108/LA08161LOGO\n releases/double-digit-new-car-sales-growth-expected-in-september-2015-according-to-kelley-blue-book-300149260.html\n ", "external_links": ["http://www.kbb.com/van-minivan/", "http://www.kbb.com/new-cars/", "http://photos.prnewswire.com/prnh/20121108/LA08161LOGO", "http://www.kbb.com/kia/", "http://www.xmlnews.org/ns/", "http://www.facebook.com/kbb", "http://photos.prnewswire.com/prnvar/20121108/LA08161LOGO", "http://www.kbb.com/ford/vans-minivans/", "http://rt.prnewswire.com/rt.gif?NewsItemId=LA12200&Transmission_Id=201509251314PR_NEWS_USPR_____LA12200&DateId=20150925", "http://www.kbb.com/pickup-truck/", "http://www.kbb.com/hyundai/", "http://www.kbb.com/used-cars/", "http://www.twitter.com/kelleybluebook", "http://www.prnewswire.com/news-releases/double-digit-new-car-sales-growth-expected-in-september-2015-according-to-kelley-blue-book-300149260.html", "https://plus.google.com/+kbb", "http://www.kbb.com/media/", "http://www.kbb.com/", "http://www.kbb.com/car-news/all-the-latest/best-compact-crossover-suvs/2000010090/", "http://www.kbb.com/ford/"], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-26T00:16:01.840+03:00", "highlightTitle": ""}