{"organizations": [], "uuid": "1e00740c668ddd68ca65d69021af6732c6c2e38b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/63650/mandarin-oriental-announces-new-celebrity-fan", "country": "US", "title": "Mandarin Oriental announces new celebrity fan", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Mandarin Oriental announces new celebrity fan", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T21:12:00.000+03:00", "replies_count": 0, "uuid": "1e00740c668ddd68ca65d69021af6732c6c2e38b"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/63650/mandarin-oriental-announces-new-celebrity-fan", "ord_in_thread": 0, "title": "Mandarin Oriental announces new celebrity fan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Mandarin Oriental announces new celebrity fan   \nSep 11, 2015 Award-winning French actress, Isabelle Huppert   \nHONG KONG - Mandarin Oriental’s multi-million dollar global advertising campaign “He’s a Fan/She’s a Fan”, continues to gather ‘fans’ from around the world. The latest addition is the award-winning French actress, Isabelle Huppert. \nThe campaign is designed to raise Mandarin Oriental’s brand awareness globally in print and in digital media, by elegantly connecting Mandarin Oriental’s well-recognized symbol - the fan - with international celebrities who regularly stay at the Group’s hotels. In appreciation of their support, the Group makes a donation to each celebrity’s individual choice of charity. Huppert’s favorite charities to which Mandarin Oriental is making a donation are The Watermill Centre, which supports the performance arts, and APREC, a foundation for cancer research. \nWell-known portrait photographer Mary McCartney, photographs each celebrity in a location of their choice which, for them, best represents a feeling of well-being. Fittingly, Huppert chose to be photographed in a townhouse close to Mandarin Oriental, Paris. \nAn extremely talented and accomplished actress, Huppert has had sixteen films in the Festival de Cannes's official competition – more than anyone else, and is only one of four actors to have won the Best Interpretation Awards twice – for Violette in 1978 and The Piano Teacher in 2001. Equally, she is the most nominated actress for the prestigious national film award of France, the César Award, with twelve nominations for ‘Best Actress’ and two nominations for ‘Best Supporting Actress.’ \nHuppert is a particular fan of Mandarin Oriental, Boston and is also looking forward to visiting the Group’s newest resort, Mandarin Oriental, Marrakech. With a busy and varied filming schedule, she appreciates the attention to detail and calm efficiency that she finds whenever she stays at Mandarin Oriental. \n“The award-winning campaign continues to make a strong statement about the Group in a simple and luxurious manner, and we are delighted to welcome Isabelle Huppert as our newest ambassador,” said Jill Kluge, Mandarin Oriental Hotel Group’s Director of Brand Communications. “By focusing on celebrities who clearly appreciate the finer things in life, we have been able to show the quality of our hotels in a far more interesting way than traditional hotel advertising,” she added. \nIsabelle Huppert joins Mandarin Oriental's 28 existing fans: Lucy Liu, Morgan Freeman, Cecilia Bartoli, Caterina Murino, Sir Peter Blake, Lin Chiling, Karen Mok, Kevin Spacey, Christian Louboutin, Sophie Marceau, IM Pei, Michelle Yeoh, Jane Seymour, Kenzo Takada, Jerry Hall, Vanessa Mae, Vivienne Tam, Barry Humphries, Frederick Forsyth, Darcey Bussell, Bryan Ferry, Liam Neeson, Dame Helen Mirren, Maggie Cheung, Sigourney Weaver, Sir David Tang, Hélène Grimaud and Sa Ding Ding.", "external_links": [], "published": "2015-09-11T21:12:00.000+03:00", "crawled": "2015-09-11T20:41:58.614+03:00", "highlightTitle": ""}