{"organizations": [], "uuid": "ca263edf7d7e50aef2cebfb0ffb6c97389d2072a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ottawasun.com", "main_image": "http://storage.ottawasun.com/v1/dynamic_resize/sws_path/suns-prod-images/1297748593147_ORIGINAL.jpg?quality=80&size=100x", "site_section": "http://www.ottawasun.com/travel/rss.xml", "section_title": "Top Travel stories", "url": "http://www.ottawasun.com/2015/09/16/charlevoix-little-known-region-one-of-quebecs-undiscovered-gems", "country": "CA", "title": "Charlevoix: Little known region one of Quebec’s undiscovered gems [Photos]", "performance_score": 0, "site": "ottawasun.com", "participants_count": 0, "title_full": "Charlevoix: Little known region one of Quebec’s undiscovered gems [Photos]", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T07:00:00.000+03:00", "replies_count": 0, "uuid": "ca263edf7d7e50aef2cebfb0ffb6c97389d2072a"}, "author": "", "url": "http://www.ottawasun.com/2015/09/16/charlevoix-little-known-region-one-of-quebecs-undiscovered-gems", "ord_in_thread": 0, "title": "Charlevoix: Little known region one of Quebec’s undiscovered gems [Photos]", "locations": ["Charlevoix", "Quebec"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Fall Getaways \nThe Charlevoix region of Quebec was a favourite destination of the Group of Seven, whose iconic painters drew inspiration from the surrounding Laurentian mountains, pastoral farms, domineering St. Lawrence River and charming villages seen for miles thanks to soaring church spires. \nIts natural beauty has also moved poets and musicians and perhaps a bit more surprisingly the circus. \nAbout an hour northeast of Quebec City, the region — hollowed out by a huge meteorite a few million years back — is the perfect size to explore for just a few days or a longer period given the wide variety of cultural and outdoor adventures. \nEasily reached by car, you can also tour by train with the Charlevoix Light Rail Transit , which starts in Quebec City. \nThe train hugs the shore of the St. Lawrence River for 125 enthralling km as you roll through scenic towns and have a front row seat to whatever might be happening on the adjacent river. Keep your eyes peeled as you could very well see seals and whales — belugas, fin and minkes are in abundance — as you rattle down the line. \nOur recent tour started in the utterly charming town of Baie-Saint-Paul, perhaps the artistic heartland of the area. \nChock full of art galleries and boutiques, the town is also the birthplace of Cirque du Soleil. \nIf you were to visit in the 1980s, you might have been entertained by Les Echassiers de Baie-Saint-Paul (the Baie-Saint-Paul Stiltwalkers), a street theatre group that juggled, played music and breathed fire. \nFrom those humble beginnings came the circus group, which has long since since moved on to fame and fortune around the world. \nBut the spirit of the troupe lives on in one of its newest and most eclectic hotels. \nLe Germain Hotel Charlevoix , formerly Hotel La Ferme, was built by Daniel Gaulthier, a founder of Cirque du Soleil. \nSet on farmland along the shore of the St. Lawrence, the hotel gives a cheeky and stylish nod to its rural inspirations, including life-size artistic renderings of cows and pigs, and barnboard designs throughout. \nIn keeping with its place on the region’s flavour trail, the hotel also draws inspiration from the terroir. Herbal gardens dot the property to service its restaurants and a public farmer’s market is hosted on the grounds once a week. \nThe hotel is also a stop on the Charlevoix LRT, offering easy access to Baie-Saint-Paul. \nGiven the wonderful restaurants at the hotel or in town, not to mention candy and gelato shops, some exercise would not be out of order. \nKayaks and bicycles are for rent up and down the St. Lawrence River and some spectacular hiking is not far at Parc National des Grands-Jardin . \nWith the tallest peaks east of the Rockies, there is scenic hiking for novices or for those with nerves of steel. \nLiterally. \nGuides will lead you on an adventure that includes inching your way on a cliff face “via ferrata.” In English, the iron road means you don a helmet and get suited up for a harness that will keep you tethered to the mountain by a steel cable. \nIt’s not for everyone, but even if you choose to see the sights without the vertigo it’s still a spectacular area to hike. \nYou might then head to the coastal town of La Malbaie where you can catch a boat to go whale watching. The day we went out in a Zodiac, we saw untold numbers of seals and whales, easily spotted as the river was as smooth as glass. \nThere were no dramatic breeches as the marine mammals were intent on eating, but the sheer number in view was exhilarating. \nAnother option is to hop on a free ferry for a short ride to the Isle-aux-Coudres, a beautiful island full of blooming wild flowers. It’s easy to bike around with stops along the way that could include Les Moulins de L’Isle-aux-Coudres, a working watermill, or a visit to Cidrerie Vergers Pedneaultto to taste some regional cider offerings. \nBack in La Malbaie, you could pamper yourself with fine dining, golf and spectacular scenery at the 116-year-old Le Manoir Richelieu . \nThe Fairmont hotel also makes the most of regional food products and guests can sign up to tag along as its executive chef visits the nearby farms that supply the hotel. \nPerhaps the hotel’s most unique offering is the Observatoire de l’Astrobleme de Charlevoix , housed in the old clubhouse at the golf course. \nAlong with a spectacular view, the observatory offers up a 3D scale model of the Charlevoix region and the impact of that meteorite from days gone by, specialized telescopes and knowledgeable staff to explain it all. \nAfter spending a few exhilarating days in the region, it’s clear the Group of Seven were onto something. Reader's comments » \nBy adding a comment on the site, you accept our terms and conditions . Sponsored Links", "external_links": [], "published": "2015-09-20T07:00:00.000+03:00", "crawled": "2015-09-20T08:11:25.994+03:00", "highlightTitle": ""}