{"organizations": [], "uuid": "3283ab2cc6b2d611e5666ef821eec105f5fee3d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-09/PR_208702.jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094357193/Empire-Aviation-Group-becomes-first-Middle-East-company-to-be-awarded-Air-Operator-Certificate-by-San-Marino-Civil-Aviation-Authority?src=RSS", "country": "US", "title": "Empire Aviation Group becomes first Middle East company to be awarded Air Operator Certificate by San Marino Civil Aviation Authority", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Empire Aviation Group becomes first Middle East company to be awarded Air Operator Certificate by San Marino Civil Aviation Authority | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "3283ab2cc6b2d611e5666ef821eec105f5fee3d9"}, "author": "Press", "url": "http://www.menafn.com/1094357193/Empire-Aviation-Group-becomes-first-Middle-East-company-to-be-awarded-Air-Operator-Certificate-by-San-Marino-Civil-Aviation-Authority?src=RSS", "ord_in_thread": 0, "title": "Empire Aviation Group becomes first Middle East company to be awarded Air Operator Certificate by San Marino Civil Aviation Authority", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Dubai-based Empire Aviation Group (EAG) subsidiary - Empire Aviation San Marino - has been awarded an Air Operator Certificate (AOC) for aircraft management and charter by the Civil Aviation Authority of the Republic of San Marino. EAG has become the first aviation company from the Middle East to be awarded an AOC by San Marino, where the company has already opened a dedicated office with several aircraft in the AOC pipeline for 2015-2016. \n\nThe San Marino AOC enables Empire Aviation's registered aircraft to perform worldwide commercial air operations, regardless of the aircraft base. EAG also holds a United Arab Emirates AOC and the company currently manages a fleet of 25 business jets with bases in Dubai, Oman, Nigeria, India and Hong Kong. \n\nThe CAA presented the AOC to Empire Aviation San Marino at a recent ceremony held in San Marino, attended by the EAG Executive Directors, Paras Dhamecha and Steve Hartley.\n\nCommenting on the new AOC, Paras Dhamecha, Executive Director of Empire Aviation Group, said: \"We are delighted to become the first Middle East aviation company to be granted an AOC by the San Marino CAA. It represents the beginning of the next stage in the company's evolution and will support the development of our worldwide commercial operations for managed aircraft based outside the UAE. It gives us the flexibility to base and charter our managed aircraft from anywhere in the world. We are already looking at our first aircraft under the San Marino AOC and expect to announce details of this, in the very near future.\" \n\nThe Republic of San Marino is a member State of the International Civil Aviation Organization (ICAO), a specialized agency of the United Nations, created to promote the safe and orderly development of international civil aviation throughout the world. San Marino is also member state of the European Civil Aviation Conference (ECAC).\n\nIng. Marco Conti, Director General of San Marino CAA, commented: \"The CAA congratulates Empire Aviation on becoming the first company from the Middle East to be awarded an AOC. We are delighted to welcome Empire Aviation to the San Marino Aircraft Registry and look forward to supporting the company's international development and expansion.\" \n\nEmpire Aviation Group has rapidly expanded its international operations over the last two years, with the group's first fully fledged overseas branch in Bangalore, India; a dedicated US aircraft sales office in Scottsdale, Arizona, USA; and operations being set up in the Far East. \n\nAbout Empire Aviation Group (EAG) \nEAG (www.empire.aero) is a one-stop shop for integrated private aviation services, offering aircraft sales, aircraft management, aircraft charter, and aircraft finance and insurance. Since formation in 2007, the company has successfully grown revenues and profit substantially every year. Today, the company has more than 120 staff and operates one of the region's largest managed fleets of business jets, with more than 20 aircraft under management, in the Middle East, Africa and India. Operating out of Dubai International Airport, the company focuses on a distinctive asset management approach to private aviation and has assembled a highly experienced team of aviation specialists, led by an experienced owner/management team. Air Works India Eng. Pvt Ltd became a strategic investor in Empire Aviation Group in 2012 and Empire Aviation India was established as a division of Air Works to replicate the aircraft management services of Empire Aviation Group for aircraft owners in India. EAG opened a dedicated aircraft sales office in the US, in 2014. www.empire.aero", "external_links": [], "published": "2015-09-28T03:00:00.000+03:00", "crawled": "2015-09-28T15:28:46.219+03:00", "highlightTitle": ""}