{"organizations": [], "uuid": "1f6742bf64c0e8d908625e458ba4e73a7ff71f36", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://resources0.news.com.au/images/2015/09/10/1227520/601504-8db1a16c-5747-11e5-ade8-2efb76e8d469.jpg", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/world-travel/excavation-of-rome-home-shows-city-bigger-than-thought/story-e6frfqbr-1227520601387?from=public_rss", "country": "IL", "title": "Discovery changes what we know about Rome", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "Discovery changes what we know about Rome", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T04:11:00.000+03:00", "replies_count": 0, "uuid": "1f6742bf64c0e8d908625e458ba4e73a7ff71f36"}, "author": "", "url": "http://www.news.com.au/travel/world-travel/excavation-of-rome-home-shows-city-bigger-than-thought/story-e6frfqbr-1227520601387?from=public_rss", "ord_in_thread": 0, "title": "Discovery changes what we know about Rome", "locations": ["Rome"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "What are these? A view of a 6th-century B.C. residence that was discovered in Rome. Source: AP \nTHE discovery of a 6th-century B.C. residence under a palazzo in central Rome proves the ancient city was much bigger than previously thought, archaeologists say. \nOfficials said the area on the Quirinale Hill had long been thought to have only been used as a necropolis, with ancient Rome’s residential zone further south and centred around the Roman Forum. A partial view of a 6th-century B.C. residence. Source: AP \nBut archaeologists excavating a palazzo on the hill said they discovered a well-preserved rectangular home, complete with wooden supports and a roof, proving that the area was also used for residential purposes. The area on the Quirinale Hill had long been thought to have only been used as a necropolis. Source: AP \nThe ANSA news agency quoted excavation chief Mirella Serlorenzi as saying the discovery “means that Rome at the start of the 6th century was much bigger than what we thought and wasn’t just centred around the Forum.” It shows the area wasn’t just centred around the Forum. Source: AP \nUnfortunately, the news comes amid fears that Rome, the Eternal City, is on the “ verge of collapse ”. \nDespite being one of the 10 biggest cities in Europe, receiving more than 10 million foreign visitors annually, the city almost went bankrupt last year with its streets a shambles, basic services in tatters and the main airport is partially closed. What else is left to be discovered? Source: AP \nOTHER RECENT GREAT DISCOVERIES \n• Mexico \nThe Rome discovery comes just days after authorities confirmed the existence of a series of ancient tunnels in Mexican colonial city of Puebla . \n“In the urban narrative or urban legends there was word of the tunnels in Puebla, but nobody knew where they were, they had never been seen,” Sergio Vergara Bermejo, manager of the Cultural Heritage and Historical Center of Puebla, told El Universal. \nThe secret passageways could date back to around 500 years. \nAnd the tunnels are just the start of what has been uncovered in Mexico lately. Last August, archaeologists located two ancient Mayan cities that were lost for centuries under thick vegetation in a Mexican jungle. \nUnearthed in the southeast of the Mexican state of Campeche, the cities were barely accessible to the research team. But the challenging journey reaped great rewards, with the discovery of the ruins of a pyramid, palace, altars and a huge doorway, Discovery News reported. \nThe cities of Lagunita and Tamchen had been first been discovered by archeologist Eric Von Euw in the 1970s, however he didn’t specify their location and they remained quite the mystery Mayan cities have been uncovered, including this “monster” mouth doorway. Picture: ZRC SAZU Source: Supplied \n• The UK \nHidden remains of an extraordinary neolithic monument that could be unique in the world were found buried beneath the ground, about 1.5km from Stonehenge this week. \nMore than 4500 years ago, at least 90 huge stone monoliths lined an impressive “arena” that may have been used for religious rites or solstice rituals. \nNow lying on their sides covered by three feet of earth, they remained undiscovered until archaeologists equipped with ground-penetrating radar probed the area around the famous stone circle on Salisbury Plain. \nThe stones, some measuring nearly four and a half metres, were placed along the south-eastern edge of what later became the Durrington Walls “superhenge”— a circular enclosure ringed by a ditch and bank that at nearly 1.5km across is the largest earthwork of its kind in the UK. 'Superhenge' unearthed near Stonehenge 1:40 \nA larger version of Stonehenge has been found one mile from the site of the famous Wiltshire monument. Sky News 08 Sep 2015 News \nAlso, just a month ago a hidden tunnel complex that formed the UK’s first line of defence in World War II opened to the public after six decades buried as a forgotten time capsule. \nThe underground labyrinth is located inside the White Cliffs of Dover, an iconic symbol of England on its south-eastern tip and a natural coastal defence at the closest point to continental Europe. \nAnd it’s not the only incredible underground discovery in the UK recently. The medieval city of Old Sarum in Salisbury, which dates back to the 12th century, was known to have been a bustling hive of activity, and the home of an ancient hill fort and military outpost. \n• China", "external_links": [], "published": "2015-09-10T04:11:00.000+03:00", "crawled": "2015-09-10T04:29:19.009+03:00", "highlightTitle": ""}