{"organizations": [], "uuid": "1208ef6c7c65d4cd5c301e1229b8411759967c3e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://menafn.com/images/shared/menafnlogo_sm.gif", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094359172/Sharjah-set-to-promote-tourism-landmarks-in-Russia-Armenia-Georgia-and-Kazakhstan?src=RSS", "country": "US", "title": "Sharjah set to promote tourism landmarks in Russia Armenia Georgia and Kazakhstan", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Sharjah set to promote tourism landmarks in Russia Armenia Georgia and Kazakhstan | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T03:00:00.000+03:00", "replies_count": 0, "uuid": "1208ef6c7c65d4cd5c301e1229b8411759967c3e"}, "author": "Emirates News Agency (WAM)", "url": "http://www.menafn.com/1094359172/Sharjah-set-to-promote-tourism-landmarks-in-Russia-Armenia-Georgia-and-Kazakhstan?src=RSS", "ord_in_thread": 0, "title": "Sharjah set to promote tourism landmarks in Russia Armenia Georgia and Kazakhstan", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN - Emirates News Agency (WAM)) SHARJAH 29th September 2015 (WAM) -- Following successful participation in a promotional tour to Kazakhstan Uzbekistan and Azerbaijan in the Commonwealth of Independent States organised earlier this month by the National Council of Tourism and Antiquities Sharjah Commerce and Tourism Development Authority SCTDA has announced another series of road-shows to Russia Armenia Georgia and Kazakhstan from September 29th to October 2nd. \nDuring the tour SCTDA will promote Sharjah's latest tourism developments under the Sharjah Tourism Vision 2021 that aims to attract 10 million tourists by 2021. \nThe delegation for the road show is headed by Khalid Jasim Al Midfa Director General of SCTDA includes representatives from Air Arabia Sharjah Airport Travel Agency SATA Copthorne Hotel Sharjah Ramada Sharjah Golden Tulip Hotel Apartments and Khalidiya Travel and Tourism. A number of workshops and meetings will be organised with representatives and decision makers in the travel tourism and hospitality sectors in the cities of Almaty Moscow Yerevan and Tbilisi. \nCommenting on the participation Khalid Jasim Al Midfa said that the promotional tours are part of the authority's strategy to shed light on the diversity of Sharjah's tourism product in order to strengthen its position as a leading global tourist destination. The road shows will help attract a large number of tourists to Sharjah from key markets around the world apart from the emerging markets that contribute to the huge tourist inflow to the emirate every year. \nAl Midfa noted that the tour comes as Sharjah is preparing for another season of remarkable cultural and recreational events and festivals which have enabled the emirate to occupy a leading position on the global events map. The most notable of these events include the Sharjah International Book Fair in November Sharjah Water Festival F1 World Powerboat Championship and Aquabike Championship in December and Sharjah Light Festival in February in addition to the launch of a number of tourism and cultural projects. \"Several major tourism projects are under way in line with the Sharjah Tourism Vision 2021\" he added. \nAl Midfa said the Commonwealth of Independent States constitutes the top market for Sharjah tourism. \"The Emirate of Sharjah is an attractive destination for tourists from these markets with its variety of museums cultural centres and family facilities in addition to the advanced tourism infrastructure upscale hotels and international restaurants. Besides the picturesque beaches on the emirate's eastern coast are popular for sports and leisure activities.\" \nThe road shows begin with the first stop at Almaty in Kazakhstan followed by the Russian capital Moscow. The tour then proceeds to Yerevan the capital of Armenia which will be a first time visit for the delegation from the emirate. The tour will conclude with a road-show in the city of Tbilisi the capital of Georgia. \n\n\nWAM/AAMIR/Moran", "external_links": [], "published": "2015-09-29T03:00:00.000+03:00", "crawled": "2015-09-29T22:54:38.067+03:00", "highlightTitle": ""}