{"organizations": [], "uuid": "e42fd6dd9d5d697f915a7d5d0dc54d820ba4f2c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28771-center-parcs-strengthens-events-team-with-new-national-account-manager", "country": "US", "title": "Center Parcs strengthens events team with new National Account Manager", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Center Parcs strengthens events team with new National Account Manager", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T16:45:00.000+03:00", "replies_count": 0, "uuid": "e42fd6dd9d5d697f915a7d5d0dc54d820ba4f2c7"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/latest-appointments/28771-center-parcs-strengthens-events-team-with-new-national-account-manager", "ord_in_thread": 0, "title": "Center Parcs strengthens events team with new National Account Manager", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Center Parcs strengthens events team with new National Account Manager Center Parcs strengthens events team with new National Account Manager Details Category: Appointments   14:45 Center Parcs Conferences & Events has bolstered its events team with the appointment of Daniel Elliott as National Account Manager, as it targets a 17% increase in corporate events this year. As National Account Manager, Daniel will be responsible for driving business that comes into the Center Parcs Conference & Events division from a direct perspective. He will primarily work with large, corporate businesses across the UK, but will also work with SME’s and unique stand-alone businesses to highlight the benefits of booking an event at a Center Parcs location. \nWithin his role, Daniel will also support and work alongside the Business Development Managers at each Village, driving local sales and building strong local ties that involve the immediate community and surrounding areas. Daniel joins Center Parcs with a background in the travel industry, having most recently held the position of Sales Development Manager at Thomas Cook with a focus on growing and driving business into the national retail network of UK & Ireland travel stores. Prior to this, he held business development roles in tour operating, commercial divisions and online hotel booking companies. On his new role, Daniel Elliott commented: “I am really excited to be further spreading the word among partners, businesses and event organisers that our state of the art meetings, events and conference spaces are the perfect alternative to the traditional hotel or purpose-built location. Center Parcs may not be a destination that sits right at the top of an event organisers list of potential venues, and there is a lot of work still to be done in continuing to promote Center Parcs as an event location, but I am looking forward to the challenge. “In the short time I have been with the business, I have already held several client showcase events and we have conducted dozens of site visits. To be with potential clients, many of whom are experiencing Center Parcs for the first time, and to showcase our unique spaces in such a beautiful forest setting is already proving to be a real buzz for all concerned.” Ryan Gray, Head of Sales, added: “We are thrilled to welcome Daniel Elliott to the team as we look to target an ambitious 17% increase in corporate events at Center Parcs this year. We are already well on the way to hitting this target following a record year to date with growth fuelled by the opening of our flagship Venue at Woburn Forest, which has seen unprecedented demand. With Daniel joining the business we are now able to use his expertise to really focus on large, corporate businesses who may not be aware of just what we have on offer for business events at Center Parcs. Not only can we offer high quality meeting facilities, we have the advantage of being able to provide targeted teambuilding activities in our fantastic woodland settings to stimulate, motivate and inspire delegates.” Related articles", "external_links": [], "published": "2015-09-11T16:45:00.000+03:00", "crawled": "2015-09-11T17:44:05.762+03:00", "highlightTitle": ""}