{"organizations": [], "uuid": "5f186525295efe9f6d6760934ee8d955b4b641e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.baltimoresun.com", "main_image": "http://www.trbimg.com/img-5601a756/turbine/la-na-nn-tsa-transgender-20150921", "site_section": "http://www.baltimoresun.com/travel/rss2.0.xml\r", "section_title": "Travel - Baltimore Sun", "url": "http://www.baltimoresun.com/travel/la-na-nn-tsa-transgender-20150921-story.html", "country": "", "title": "Transgender woman says TSA detained, humiliated her over body 'anomaly'", "performance_score": 0, "site": "baltimoresun.com", "participants_count": 1, "title_full": "Transgender woman says TSA detained, humiliated her over body 'anomaly'", "spam_score": 0.0, "site_type": "news", "published": "2015-09-22T21:33:00.000+03:00", "replies_count": 0, "uuid": "5f186525295efe9f6d6760934ee8d955b4b641e7"}, "author": "James Queally", "url": "http://www.baltimoresun.com/travel/la-na-nn-tsa-transgender-20150921-story.html", "ord_in_thread": 0, "title": "Transgender woman says TSA detained, humiliated her over body 'anomaly'", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "American Airlines \nA transgender woman said she was detained and harassed at an Orlando, Fla., airport security checkpoint Monday by Transportation Safety Administration agents after a body scanner detected an \"anomaly\" on her. \nShadi Petosky, who runs a Los Angeles interactive entertainment studio, said she was trying to fly out of Orlando International Airport but was stopped after entering the scanner. \nIn her tweets about the situation , Petosky said that TSA agents calibrated the scanner for a woman, and the machine flagged an anomaly -- \"my penis.\" \nInterested in the stories shaping California? Sign up for the free Essential California newsletter >> \nShe said she \"disclosed [her] reality immediately,\" but the situation quickly escalated: Over the course of 40 minutes, Petosky said, officials patted her down twice, \"fully disassembled\" her luggage and put her in an empty room with an officer holding the door. \nAt one point, she said, an agent told her to \"get back in the machine as a man or it was going to be a problem.\" \nThe ordeal caused her to miss her flight, she said. \nIn a statement released early Tuesday morning, the TSA defended its officers' actions. After reviewing security footage, the TSA \"determined that the evidence shows our officers followed TSA's strict guidelines.\" \nAt least two additional TSA supervisors were called to the scene, the agency said. \nCalls to the airport press office were not returned. A spokeswoman for the Orlando Police Department declined to comment. \nAn American Airlines spokesman told The Times that Petosky would be placed on a new flight free of charge, though Petosky said on Twitter that an airline worker at the airport had charged her card. \nAccording to the TSA website , transgender travelers should \"use the name and gender that appears on their government-issued ID when making flight reservations and at the security checkpoint.\" They can ask for a private screening if they feel uncomfortable going through the process in front of other travelers. \nPetosky declined to discuss the matter by phone on Monday, saying she was still struggling to make flight arrangements. \nA close friend of hers, Los Angeles resident Jen Richards, said such incidents are not uncommon for transgender people at airports. In fact, Richards said, she's experienced it herself.", "external_links": [], "published": "2015-09-22T21:33:00.000+03:00", "crawled": "2015-09-23T00:56:27.128+03:00", "highlightTitle": ""}