{"organizations": [], "uuid": "032cf9e35b662b74d42117509e64cef6a079e48a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.adelaidenow.com.au", "main_image": "http://resources0.news.com.au/images/2015/09/30/1227550/861176-660172d6-6729-11e5-91d3-28f7a697e8f4.jpg", "site_section": "http://www.adelaidenow.com.au/travel/world/asia", "section_title": "Asia | Asian Holidays and World Travel | The Advertiser", "url": "http://www.adelaidenow.com.au/business/companies/eleven-bosses-fall-on-their-swords-as-wage-exploitation-scandal-rocks-the-convenience-store-chain/story-fnkjkokr-1227550861257", "country": "US", "title": "7 Eleven wage scal: Chairman Russ Withers and CEO Warren Wilmot resign | Business News | Business and Finance News | |", "performance_score": 0, "site": "adelaidenow.com.au", "participants_count": 1, "title_full": "7 Eleven wage scandal: Chairman Russ Withers and CEO Warren Wilmot resign | Business News | Business and Finance News | | The Advertiser", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T22:24:00.000+03:00", "replies_count": 0, "uuid": "032cf9e35b662b74d42117509e64cef6a079e48a"}, "author": "Staff writers", "url": "http://www.adelaidenow.com.au/business/companies/eleven-bosses-fall-on-their-swords-as-wage-exploitation-scandal-rocks-the-convenience-store-chain/story-fnkjkokr-1227550861257", "ord_in_thread": 0, "title": "7 Eleven wage scal: Chairman Russ Withers and CEO Warren Wilmot resign | Business News | Business and Finance News | |", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "HEADS are rolling at 7-Eleven Australia as the fallout from the company’s wage scandal continues.\nThe company’s chairman, billionaire Russ Withers, and chief executive Warren Wilmot have fallen on their swords over the alleged underpayment of international students.\nThe pair have resigned as the company battles to recover from the blow to its reputation by the worker exploitation scandal, which has reportedly seen banks refuse to lend to new franchisees.\nIn a written statement to news.com.au, Mr Withers said he had decided to bow out as chairman earlier than planned after receiving Mr Wilmot’s resignation.\n“Mr Wilmot offered his resignation following the recent realisation of the extent to which 7-\nEleven franchisees had underpaid workers,” the statement said.\n“Mr Wilmot acknowledged it would be difficult for him to play a central role in navigating the company through the current challenges it faces, given his longstanding executive role, and that a new independent chief executive was appropriate in the current circumstances.”\n7-Eleven's outgoing chairman Russ Withers and chief executive Warren Wilmot are pictured with the company’s general manager of operations Natalie Dalbo at a Senate Committee hearing last Thursday. Source: AAP\nBoard member Michael Smith, a highly regarded member of Australia’s business community, has been appointed the company’s new chairman, while retail industry veteran Bob Baily will serve as interim chief executive.\nAs a former chairman of the prestigious Australian Institute of Company directors, Mr Smith could well be the best placed person to steer 7-Eleven through the chaos.\nHe told Fairfax Media that he had been “horrified” by the extent of the alleged wage fraud and exploitation of workers at 7-Eleven, which he said “appears” to be happening at half of the chain’s 620 stores.\n“We’re very fortunate to have someone with Michael’s credentials and track record on the\nboard and able to step into this role,” Mr Withers said.\nBob Baily has been appointed 7-Eleven’s interim chief executive. Source: News Limited\nMr Smith said 7-Eleven was working to establish the true extent of the underpayment of staff by franchisees and implement appropriate remedies, including refining the franchise’s business model — which has been criticised as unsustainable.\nMr Baily is a former chairman of the Australian Association of Convenience Stores and has held senior executive roles and directorships with companies including the Good Guys, The Swan Brewery Company, SPC Foods and Best Friends Pet Holdings, which he co-founded.\nMr Withers will remain chairman of the group holding company, that has as its investments\n7-Eleven and Starbucks together with real estate and a share portfolio.\nThe company recently appointed former ACCC chairman Professor Allan Fels to chair an independent panel to identify underpaid workers and ensure they are repaid.\n 7-Eleven bosses fall on their swords", "external_links": ["http://resources2.news.com.au/images/2015/09/30/1227550/860286-9e62d9dc-672c-11e5-91d3-28f7a697e8f4.jpg", "http://resources3.news.com.au/images/2015/09/30/1227550/861203-a8491f72-6729-11e5-91d3-28f7a697e8f4.jpg", "http://www.news.com.au/finance/business/eleven-bosses-fall-on-their-swords-as-wage-exploitation-scandal-rocks-the-convenience-store-chain/story-fnkgdftz-1227550861257", "http://www.smh.com.au/business/workplace-relations/7eleven-russ-withers-resigns-from-board-ceo-warren-wilmot-also-stands-down-20150930-gjxw28.html"], "published": "2015-09-30T22:24:00.000+03:00", "crawled": "2015-09-30T09:29:51.415+03:00", "highlightTitle": ""}