{"organizations": [], "uuid": "70c18945193a054e4e13a1cb5a0091d335a6cf01", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29940364/virtual-cockpit-in-cars-edges-closer-to-reality-as-hybrid-instrument-clusters-are-set-to-be-the-standard-beyond-2020", "country": "US", "title": "Virtual Cockpit in Cars Edges Closer to Reality as Hybrid Instrument Clusters Are Set to be the Standard Beyond 2020", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Virtual Cockpit in Cars Edges Closer to Reality as Hybrid Instrument Clusters Are Set to be the Standard Beyond 2020 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "70c18945193a054e4e13a1cb5a0091d335a6cf01"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29940364/virtual-cockpit-in-cars-edges-closer-to-reality-as-hybrid-instrument-clusters-are-set-to-be-the-standard-beyond-2020", "ord_in_thread": 0, "title": "Virtual Cockpit in Cars Edges Closer to Reality as Hybrid Instrument Clusters Are Set to be the Standard Beyond 2020", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Frost & Sullivan\nNext-gen instrument clusters will enable comprehensive display of information for drivers in the centre stack, finds Frost & Sullivan\nLONDON , Sept. 2, 2015 /PRNewswire/ -- Modernisation efforts are sweeping through the instrument cluster (IC) space as automakers in North America and Europe strive to provide consumers with a unique driving experience. Analogue gauges in cars will become obsolete by 2021, giving way to hybrid and fully digital ICs with flexible designs that facilitate personalisation. Next-generation ICs will feature customisable dials and advanced liquid-crystal-display (LCD) quantum dot displays containing detailed, relevant information. Original equipment manufacturers (OEMs) and tier I suppliers are also working on integrating the centre stack into the IC, thus displaying all necessary data in the driver's line of sight and reducing distraction.\nNew analysis from Frost & Sullivan, Rise of Virtual Cockpits in Cars ( https://www.frost.com/mb36 ), finds that the IC market in North America and Europe is expected to clock a compound annual growth rate (CAGR) of 2.2 percent from 2014 to 2021, with digital IC expected to reach a CAGR of approx. 26 percent by 2021. While the \"virtual cockpit\" will be limited to premium-segment vehicles, fully digital clusters that will be standard in about 20 percent of cars will also be offered as an option on medium-segment cars.\nFor complimentary access to more information on this research, please visit: http://ow.ly/RkXpz .\n\"Hybrid ICs, which include both analogue and digital components, will become a standard feature in most vehicle segments and platforms post 2017,\" said Frost & Sullivan Automotive and Transportation Senior Research Analyst Ramnath Eswaravadivoo . \"Hybrid ICs will continue to grow popular as the decreasing prices of graphic processors and control units make the integration of 3D graphics into hybrid ICs feasible.\"\nBy 2021, about 82.2 percent of cars shipped across Europe and North America are expected to be deployed with hybrid ICs, and the other 17.8 percent are expected to be fully digital ICs.\nThe falling costs of LCD panels and related electronics are turning fully digital ICs into an affordable alternative too. Low- and medium-end OEMs prefer digital clusters that lower distraction by displaying only the information that the driver currently requires. Moreover, digital ICs can dynamically change the information shown as the driver shifts from one mode to another, and OEMs can add new functionalities into a digital cluster by merely changing the software.\nWith digital ICs gaining traction, the need for software tooling is also heating up. However, the increasing instances of software failures could slow down adoption in North America and Europe .\n\"Constant software upgrades will be crucial to improve customer retention,\" observed Eswaravadivoo. \"In addition, as the use of software drastically goes up, OEMs must expand their services and collaborate closely with technology enablers to manage the issue of cybersecurity.\"\nNevertheless, the advantages of fully digital ICs far outweigh the challenges, and OEMs are working to capitalise on all the benefits that the technology can offer.\nRise of Virtual Cockpits in Cars (MB36-18) is a Strategic Insight that is part of the Automotive & Transportation ( http://ww2.frost.com/research/industry/automotive-transportation ) Growth Partnership Service program. The study analyses the potential of analogue, hybrid, and fully digital ICs following extensive interviews with market participants. It details display technologies and the information that is most likely to be incorporated in ICs of the future, reviews current models, and benchmarks user interface suppliers.\nAbout Frost & Sullivan\nFrost & Sullivan, the Growth Partnership Company, works in collaboration with clients to leverage visionary innovation that addresses the global challenges and related growth opportunities that will make or break today's market participants.\nOur \"Growth Partnership\" supports clients by addressing these opportunities and incorporating two key elements driving visionary innovation: The Integrated Value Proposition and The Partnership Infrastructure.\nThe Integrated Value Proposition provides support to our clients throughout all phases of their journey to visionary innovation including: research, analysis, strategy, vision, innovation and implementation. The Partnership Infrastructure is entirely unique as it constructs the foundation upon which visionary innovation becomes possible. This includes our 360 degree research, comprehensive industry coverage, career best practices as well as our global footprint of more than 40 offices. For more than 50 years, we have been developing growth strategies for the global 1000, emerging businesses, the public sector and the investment community. Is your organisation prepared for the next profound wave of industry convergence, disruptive technologies, increasing competitive intensity, Mega Trends, breakthrough best practices, changing customer dynamics and emerging economies?\nContact Us: Start the discussion\nJoin Us: Join our community\nSubscribe: Newsletter on \"the next big thing\"\nRegister: Gain access to visionary innovation\nContact:\nKatja Feick\nCorporate Communications – Europe\nP: +49 (0) 69 / 77 0 33 43\nE: katja.feick@frost.com\nTwitter: @Frost_Sullivan or @FS_Automotive\nFacebook: FrostandSullivan\nLinkedin: Future of Mobility – A Frost & Sullivan Forum\nhttp://www.frost.com\n releases/virtual-cockpit-in-cars-edges-closer-to-reality-as-hybrid-instrument-clusters-are-set-to-be-the-standard-beyond-2020-300135851.html\n ", "external_links": ["https://twitter.com/Frost_Sullivan", "http://www.frost.com/", "http://ow.ly/RkXpz", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/virtual-cockpit-in-cars-edges-closer-to-reality-as-hybrid-instrument-clusters-are-set-to-be-the-standard-beyond-2020-300135851.html", "http://ww2.frost.com/research/industry/automotive-transportation", "https://www.linkedin.com/grp/home?gid=4480787", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Register", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Contact", "http://rt.prnewswire.com/rt.gif?NewsItemId=DA91123&Transmission_Id=201509020730PR_NEWS_USPR_____DA91123&DateId=20150902", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=PRFooter", "https://twitter.com/FS_Automotive", "https://www.facebook.com/FrostandSullivan", "http://www.frost.com/prod/servlet/register-form.pag?refpage=http%3A//www.frost.com/prod/servlet/frost-home.pag&SRC=Join", "https://www.frost.com/mb36"], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T15:26:26.516+03:00", "highlightTitle": ""}