{"organizations": [], "uuid": "2d39151e97b73f14d8d4aae50ac07b1452b547a2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2013/02/27/12932631/logo.png", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/JeanetteBunn/TravelToGo/prweb12932631.htm", "country": "US", "title": "Jeanette Bunn Travel To Go President Highlights Best Cirque Shows in Vegas", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Jeanette Bunn Travel To Go President Highlights Best Cirque Shows in Vegas", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "2d39151e97b73f14d8d4aae50ac07b1452b547a2"}, "author": "Media Relations", "url": "http://www.prweb.com/releases/JeanetteBunn/TravelToGo/prweb12932631.htm", "ord_in_thread": 0, "title": "Jeanette Bunn Travel To Go President Highlights Best Cirque Shows in Vegas", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Cirque du Soleil is an international organization that produced its first show in 1984 in Quebec. Since then, the company has grown to over 1,300 artists and 4,000 total employees around the world. In 2014, 15 million people saw a Cirque du Soleil show, and with seven of them in residence in Las Vegas, there are several opportunities. Let Jeanette Bunn of Travel To Go recommend and plan a fantastic evening of entertainment, awe, and athletic ability. 1. O – Inspired by the concept of infinity and the elegance of water’s pure form, the creators of O strive to pay tribute to the art of theater. They create an environment where anything is possible and where the drama of life happens before the audience’s very eyes. This show features world-class acrobats, synchronized swimmers, divers, and other characters performing in, on, and above the water. This breath-taking experience is featured at the Bellagio.\n2. Mystere – This show combines the raw athleticism of the human body with high-energy acrobatics and amazing imagery, making it a classic Cirque du Soleil creation. Loosely based on the “life is a mystery” theme, this show features characters such as Black Widow, the praying mantis who destroys the visions and dreams of her victims and La Belle, the timeless and fleeting mystery of beauty. This show premiered in December of 1993 and has been housed at Treasure Island ever since.\n3. Ka – Ka shows the coming of age story of young man and woman as they encounter love and conflict. Ka is the fire that can unite or separate, destroy or illuminate. This is one of Cirque’s most technologically advanced shows, and definitely more well known for its straightforward story, instead of the abstract themes the other shows follow. With over 80 artists from the around the world, Ka is definitely a sight to be seen, and it has been playing at the MGM Grand since its premier in 2004.\n4. Zarkana – Jeanette Bunn, Travel To Go President , says Zarkana is a traditional Cirque masterpiece, featuring acrobats, aerialists, jugglers, high wire and trapeze artists on the grand stage at the ARIA Resort & Casino. Experience this spirited journey through an abandoned theater as a magnificent circus comes to life. Watch as craziness and chaos in a twisted vortex give way to a true celebration.\nA night of amazing entertainment is ready and waiting, contact Travel To Go to arrange tickets, secure accommodations, and all other vacation needs.\nhttp://www.traveltogo.com\n###\nTravel To Go\n7964 B Arjons Drive\nSan Diego, CA 92126, USA\nPhone: (800) 477-6331\nPress release distributed by JW Maxx Solutions, a leader in content management solutions and part of a family of companies that includes Enterate Ahora .", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2p3bWF4eHNvbHV0aW9ucy5jb20v", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy5lbnRlcmF0ZWFob3JhLmNvbS5teC8=", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50cmF2ZWx0b2dvLmNvbQ==", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2plYW5ldHRlYnVubi5vcmcv", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL2plYW5ldHRlYnVubnRyYXZlbHRvZ28uaW5mby8="], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T10:07:18.844+03:00", "highlightTitle": ""}