{"organizations": [], "uuid": "167816097f655ef64ff14e902b1a47db872d241e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prbuzz.com", "main_image": "", "site_section": "https://www.prbuzz.com/travel.html", "section_title": "Travel", "url": "https://www.prbuzz.com/travel/347305-poundtravel-uk-introduces-poundtravel-club-with-free-membership.html", "country": "US", "title": "PoundTravel.uk Introduces PoundTravel Club With Free Membership", "performance_score": 0, "site": "prbuzz.com", "participants_count": 1, "title_full": "PoundTravel.uk Introduces PoundTravel Club With Free Membership", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "167816097f655ef64ff14e902b1a47db872d241e"}, "author": "prbuzz.com", "url": "https://www.prbuzz.com/travel/347305-poundtravel-uk-introduces-poundtravel-club-with-free-membership.html", "ord_in_thread": 0, "title": "PoundTravel.uk Introduces PoundTravel Club With Free Membership", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "PoundTravel.uk is dedicated to providing some of the best travel deals around, including cheap hotel rooms, low cost flights and great cruise offers. Now, Pound Travel as seen at http://poundtravel.uk is introducing the PoundTravel Club, a select group that offers access to discounted travel packages from worldwide providers.\nThe PoundTravel Club offers different destination choices for travelers at exotic locations around the world at the lowest possible prices. Membership is free and entitles participants to access the website's online cost examination apparatus, which allows them to utilize the booking motor to locate the least expensive options for travel. These searches take place over an extensive variety of providers and administrators, instantly providing members with the most options possible for travel. Club membership also entitles participants to select offers and rebates as well as discovering the least expensive options for all types of travel. With membership discounts, travelers can save significant amounts on all travel bookings.\nPoundTravel is able to keep its costs low by purchasing bulk deals on travel options to a wide range of destinations. Suppliers are eager to deal with the company to offer low-cost net booking direct to customers. Club members are guaranteed to find the lowest prices, unique travel discounts and other benefits, all in an easy-to-use booking search format. Members of the PoundTravel Club will find the lowest costs on airfare, hotel rooms, ground transportation, cruises and many other travel options.\nFor more information or to sign up for a free PoundTravel Club Membership, see the website.\nAbout PoundTravel:\nPoundTravel is one of the web's most versatile and cost-effective solutions for planning national and international travel. As a premier provider of travel planning services to the UK and beyond, the company offers free membership in the PoundTravel Club for anyone who wants to save on bookings for flights, hotels, cruises and more.\nContact:\nContact Person: Danyel Naq\nCompany: PoundTravel.uk\nAddress: London, UK\nEmail: This email address is being protected from spambots. You need JavaScript enabled to view it.\nWebsite: http://poundtravel.uk", "external_links": [], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T19:41:34.443+03:00", "highlightTitle": ""}