{"organizations": [], "uuid": "3ce6d71e877744b019001b664119c20a1039538b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "gohawaii.about.com", "main_image": "http://f.tqn.com/y/gohawaii/1/S/h/a/4/natural_wonders_008.jpg", "site_section": "http://z.about.com/6/o/m/gohawaii_t2.xml", "section_title": "About.com Hawaii Travel: What's Hot Now", "url": "http://gohawaii.about.com/od/haleakala/p/haleakalasummit.htm", "country": "US", "title": "Visiting the \"House of the Sun\" - the Haleakala...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "Visiting the \"House of the Sun\" - the Haleakala...", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T14:05:00.000+03:00", "replies_count": 0, "uuid": "3ce6d71e877744b019001b664119c20a1039538b"}, "author": "", "url": "http://gohawaii.about.com/od/haleakala/p/haleakalasummit.htm", "ord_in_thread": 0, "title": "Visiting the \"House of the Sun\" - the Haleakala...", "locations": ["Hawaii", "Maui"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["John Fischer"], "text": "Expert Videos Haleakala, the House of the Sun, on the island of Maui, one of Hawaii's Natural Wonders. Photo by John Fischer, licensed to About.com \nHaleakalā, \"The House of the Sun\", is a dormant volcano and the tallest peak on Maui, reaching 10,023 feet above sea level. \nMany believe that Haleakalā Crater resembles the surface of the moon or, more likely, Mars with its red hue. \nThe crater, or more correctly called the depression, is large enough to hold the entire island of Manhattan. It is 7.5 miles long, 2.5 miles wide and 3000 feet deep. The crater includes its own mini-mountain range of nine cinder cones. The largest of these is over 1000 feet high. Reasons to Visit the Haleakalā Summit Area \nSome visitors go to Haleakalā National Park to see the sun rise over the crater . Others go to hike and camp in the interior. Still others experience the thrill of a bike ride down the long and winding road from the park entrance to Paʻia on Maui's North Shore . \nDress warmly. The temperatures at the summit are about 32 degrees cooler than at sea level. The winds make it feel even cooler. Diverse Ecology \nBe sure to take the time to appreciate the views as you drive along Haleakalā Crater Road. You will pass through a diverse ecosystem with forests of eucalyptus and jacaranda. You can see amazing wildflowers and cattle grazing on the mountainside. \nNear the summit you may see the ʻahinahina ( Haleakalā silversword ) and nene ( Hawaiian goose ). \nWhatever the reason, a drive to summit of Haleakalā is not to be missed. Getting There \nThe summit and adjacent Haleakalā National Park Visitor Center is located 37 miles and two hours southeast of Kahului, Maui . Maps and directions are available in every free Drive Guide available throughout Maui. Season and Hours of Operation \nThe park is open year-round, 24 hours a day, 7 days a week, except for severe weather closure. \nThe Park Headquarters Visitor Center at the 7000 ft. level is open daily from 8:00 a.m. to 3:45 p.m. \nThe Haleakalā Visitor Center at the 9740 ft. level is open sunrise to 3:00 p.m. It is closed on December 25 and on January 1. Entrance Fees \nAn admission fee of $15.00 per vehicle is charged at the park entrances. Motorcyclists are charged $10.00. Bicyclists and hikers on foot are charged $8.00 each. Credit cards are not accepted. Annual Haleakalā passes are available. The National Parks annual passes are honored. \nOne-time entrance fees are valid (with receipt) for re-entry into both the Summit and Kipahulu areas of the park for three days. An entrance fee only is required for those camping within the park except for wilderness cabin rental fees. Visitor Centers and Exhibits \nThe Park Headquarters Visitor Center and the Haleakalā Visitor Center are open daily and year round subject to staff availability. \nAll visitor centers have cultural and natural history exhibits. The Hawaii Natural History Association offers books, maps, and posters for sale. \nNaturalists are on duty during business hours to answer questions and help you make the most of your visit. Educational programs are offered regularly. Weather and Climate \nThe weather at the summit of Haleakalā National Park is unpredictable and can change quickly. Be prepared for a variety of conditions. \nTemperatures in the summit area commonly range between 32°F and 65°F. The wind-chill can dramatically drop the temperature below freezing any time of year. \nIntense sunlight, thick clouds, heavy rain, and high winds are possible at any time. Health and Safety Concerns at the Summit \nThe high altitude at the summit may complicate health conditions and cause breathing difficulties. Pregnant women, young children, and those with respiratory or heart conditions should consult their doctors prior to visiting. \nTo help avoid problems, be sure to walk slowly at high elevation. Drink lots of water to avoid dehydration. Check in often with elderly friends or relatives to make sure they're doing okay. Turn back and seek medical aid if you have health concerns. Food, Supplies and Accommodations \nThere are no facilities to purchase food, gasoline, or supplies in the park. Be sure to bring whatever food and other supplies you need before you enter the park. Wilderness camping, car-access camping and wilderness cabins are available at the summit area. Other Concessions and Opportunities \nSeveral private companies operate tours within the park. They include downhill biking from near the park entrance, horseback tours of the wilderness, and guided hikes. \nCheck the activities desks at hotels and resorts, or one of the numerous free publications for more details. Related Articles", "external_links": [], "published": "2015-09-05T14:05:00.000+03:00", "crawled": "2015-09-05T16:02:22.013+03:00", "highlightTitle": ""}