{"organizations": [], "uuid": "fc27836ece737bbe1a3b0cf409d0af70037b8558", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rocketnews.com", "main_image": "", "site_section": "http://www.rocketnews.com/category/travel/feed/", "section_title": "» Travel", "url": "http://www.rocketnews.com/2015/09/cultural-london-top-events-and-exhibits-this-fall/", "country": "US", "title": "Cultural London: Top events and exhibits this fall", "performance_score": 0, "site": "rocketnews.com", "participants_count": 1, "title_full": "Cultural London: Top events and exhibits this fall", "spam_score": 0.0, "site_type": "news", "published": "2015-09-20T09:47:00.000+03:00", "replies_count": 0, "uuid": "fc27836ece737bbe1a3b0cf409d0af70037b8558"}, "author": "Editor", "url": "http://www.rocketnews.com/2015/09/cultural-london-top-events-and-exhibits-this-fall/", "ord_in_thread": 0, "title": "Cultural London: Top events and exhibits this fall", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Ushio Shinohara’s “Doll Festival” (1966), part of the upcoming “The World Goes Pop” exhibition at London’s Tate Modern. (Photo: The Tate Modern Museum) \nWhich of the world’s museums is the most Googled? It’s London’s Science Museum. \nI recently spent an hour in the museum’s permanent exhibit of information technology through the ages and I can see why. I don’t think a full day would have done it justice, let alone the whole museum, which would probably take a full week to go through properly. \nBut London’s Museum of Science is just one of over 200 museums in the British capital, one reason why London’s cultural institutions — museums, theaters, performance venues — received 18 million overseas visitors last year. And this autumn there’s a staggering number of blockbuster exhibits and performances in the city, part of London’s Autumn Season of Culture. \nIn fact, the season is so full it’s hard to know where to begin, but here are some highlights: \nThe Museum of London \nThe big draw this season will be “The Crime Museum Uncovered.” Over the past 140 years London’s Metropolitan Police has maintained a private “museum” of crime artifacts, used to assist and train detectives in past and future investigations. This exhibit explores the darker side of London’s underworld from Jack the Ripper to the Great Train Robbery. But don’t be alarmed, London is now a very safe city! museumoflondon.org.uk \nThe Tate Modern \n“The World Goes Pop,” on view from Sept. 17 to Jan. 24, won’t be your typical Pop Art exhibit. Over 200 works from the ’60s and ’70s will feature lesser-known artists, many from behind the Iron Curtain, Iran, Cuba, Peru, Japan and Europe, with a decidedly political and anti-consumer theme. From Nov. 11 to April 3, “Alexander Calder: Performing Sculpture” will be the U.K.’s largest ever exhibition of the artist’s work. tate.org.uk \nLondon’s Design Museum explores bicycle design in its “Cycle Revolution” exhibit. This folding bike is entirely designed and manufactured in England. (Photo: Brompton Cycles) \nThe Design Museum \nBicycle culture, anyone? Everything from bikes of all stripes, safety, clothing, equipment and more will be displayed in “Cycle Revolution” from Nov. 18 to June 30. The theme is where bicycling has been and where it’s going from a design point of view. designmuseum.org \nThe National Portrait Gallery \nIt closes on Oct. 18, but “Audrey Hepburn: Portraits of an Icon” celebrates the actor’s career with 70 seldom-seen photographs along with showings of her films. Whether you like art or not, visit the museum’s Portrait Restaurant; it’s one of those rare places that offers gorgeous views of a city with gorgeous food. npg.org.uk \nThe Barbican \nThe big event this season, if you haven’t already heard, is Benedict Cumberbatch starring in Hamlet . Most seats, not surprisingly, are sold out, but for each performance 100 seats at $15 are available on the day of each performance. Just be prepared to queue up overnight (or over a couple of nights; bring your sleeping bag) to nab them. If you don’t feel like camping out, there’s much more going on, including performances by the Royal Shakespeare Company and the London Symphony Orchestra. Another upcoming highlight: a terrific exhibit heralding the careers of designers Charles and Ray Eames at the Barbican Art Gallery. barbican.org.uk \nYuri Gagarin before a flight aboard the Vostok spacecraft. April 12, 1961. From the exhibit “Cosmonauts: Birth of the Space Age.” (Photo: London Science Museum) \nThe Science Museum \nAnyone interested in the extra-terrestrial will want to visit “Cosmonauts: Birth of the Space Age,” on view through March 13. Visitors can view a lunar lander, rockets, landing modules, and a MIR space station shower among scores of other full-size and model artifacts from the Russian space program. sciencemuseum.org.uk \nThe Royal Academy of Arts \nThe first major institutional survey of Chinese artist Ai Weiwei’s work in the U.K. runs from Sept. 19 to Dec. 13. From Jan. 30 to April 20, “Painting the Modern Garden: Monet to Matisse” will be on view, with over 120 works, including 35 Monets and other masterpieces by Klee, Klimt and Kandinsky. royalacademy.co.uk \nCultural London: Practical tips \nDownload the London Official City Guide on iTunes or the Android version . Locate the Tutorial to plan your day in London step by step by adding locations and things you want to visit; the app will guide you from place to place with travel times and offline directions. Very handy, it’s part of the VisitLondon.com website. \nAnother hugely helpful resource for London’s vibrant cultural scene is CultureWhisper.com . The site alerts you to upcoming events far in advance, provides reviews, and lets you plan and book. There’s a free 10-day trial or you can join for £7 (about $11) per month. \nAlthough almost all of London’s museums are free, special exhibits require a separate admission, generally ranging from $20 to $25. \nIf you’re a frequent visitor and avid culture maven, consider signing up for memberships to your favorite museums and performance venues. That way you’ll get priority ticket reservations and admission to special exhibits that might otherwise be sold out on your visit. In addition you’ll get a discount (usually 10%) in gift shops and restaurants. \nTry to avoid Oct. 17 to Oct. 25, and other periods when English schools go on term break; museums and other venues will be especially crowded with school groups and parents with children. \nMost importantly, plan ahead. Don’t just expect to show up and get into exhibits with timed entries or prime seats (or any seats in some cases) to top shows and concerts.", "external_links": [], "published": "2015-09-20T09:47:00.000+03:00", "crawled": "2015-09-20T10:31:21.161+03:00", "highlightTitle": ""}