{"organizations": [], "uuid": "4fab2e8f40f2ef3063c1e95d5f2669f5cf32e5fb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.azcentral.com", "main_image": "http://www.gannett-cdn.com/-mm-/432ca1d02255d118e99129d43a881f4b73ac585f/c=0-29-2017-1168&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/25/Phoenix/Phoenix/635787972968289006-plane-4-1-.jpg", "site_section": "http://www.azcentral.com/travel-explore/", "section_title": "Phoenix Arizona Travel Guide, Hotels, Sightseeing - azcentral.com ", "url": "http://www.azcentral.com/story/travel/2015/09/25/sky-harbor-airport-considering-uber-lyft/72400538/", "country": "US", "title": "Sky Harbor mulling Uber, Lyft service", "performance_score": 0, "site": "azcentral.com", "participants_count": 5, "title_full": "Sky Harbor mulling Uber, Lyft service", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T22:41:00.000+03:00", "replies_count": 6, "uuid": "eea8b2742a439fad186bcf1f5dcbc0c8cd4d2724"}, "author": "azcentral.com", "url": "http://www.azcentral.com/story/travel/2015/09/25/sky-harbor-airport-considering-uber-lyft/72400538/#post-0", "ord_in_thread": 0, "title": "Sky Harbor mulling Uber, Lyft service", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Passengers at more than two dozen airports around the country can hail an Uber or a Lyft driver to take them to their home, office or hotel, bypassing traditional options such as taxis and shuttle services.\nPhoenix Sky Harbor International Airport hopes to offer the popular ride-sharing service, but the timetable is murky because officials are in the earliest stage of negotiations, a process that has been lengthy and contentious in other cities.\nUber and Lyft are fast-growing transportation services operated by independent drivers using their own vehicles. Patrons order rides via smartphone app, and the fare is generally less expensive than a taxi. The companies are aggressively trying to expand into the lucrative airport pickup business and have made inroads in the past year in San Francisco, San Diego, Denver, Dallas and other cities. Los Angeles International Airport will become the largest airport to offer the option starting this fall.\nAZCENTRAL\nUber available at Sky Harbor Airport -- for a price\nSky Harbor, the nation's 10th largest airport by passenger boardings, hopes to join the list because it's a service travelers are coming to expect. (Passengers already can take Uber, Lyft and similar rides to the airport and, in some cases, take Uber from the airport. See story on the cover of today's Travel & Explore section.)\n\"They're quite popular and I think there's a segment of the public that wants to see this, and we also want to see this happen here at Sky Harbor,'' Steve Grubbs, the airport's deputy aviation director for operations, told the Phoenix Aviation Advisory Board this month. \"We just want to make sure it's done prudently and responsibly.''\nBy the numbers A look at ground-transportation options at Phoenix Sky Harbor International Airport, which is studying whether to allow broad use of popular ride-share services such as Uber and Lyft. Uber drivers already offer rides from Sky Harbor, mainly through its pricier luxury division, which includes Uber Select, Uber Black and Uber SUV.\n• 650 companies.\n• 5,000 drivers.\n• 3,500 vehicles.\n• 2.6 million annual trips from the airport.\nHere’s how the 2.6 million breaks down:\n• Taxis: 753,000 annual trips.\n• SuperShuttle: 206,000 annual trips.\n• Prearranged car services with permits: 750,000 trips.\n• Courtesy hotel shuttles, intercity shuttles and charter buses: 850,000 trips.\nSource: Phoenix Sky Harbor International Airport.\nArizona instituted regulations for ride-sharing companies in July, but Sky Harbor officials want to add extra measures to protect passengers and the airport. They also want to make sure the car services don't gain an unfair advantage over existing transportation providers, such as taxis, Super Shuttle and sedan services, which together log 2.6 million trips a year from the airport.\nThe airport has been talking with Uber and Lyft for the past few months to develop an operating agreement that will cover everything from fees to driver background checks.\nNegotiations have reached an impasse over background checks. Sky Harbor, which is owned by the city, wants independent drivers for Uber, Lyft and other so-called transportation network companies to undergo the same fingerprint-based background check and security-threat assessment that other Sky Harbor transportation providers undergo. State regulations require a background check for ride-sharing drivers, but it is done by name, which is the standard at Uber and Lyft.\nSky Harbor officials believe the fingerprint test is more thorough. Uber and Lyft representatives say the results are not always up to date and can wrongly disqualify drivers. They tout their extensive background checks, which cover everything from driving records to criminal history.\nThe background-check debate has come up repeatedly in other cities but Uber and Lyft have generally prevailed.\nGrubbs told the aviation advisory board, which will make a recommendation to the Phoenix City Council on whether to allow ride-sharing services to pick up passengers at Sky Harbor, that 2 percent of the 1,500 drivers who underwent the airport's fingerprint test between March 2014 and Sept. 15 of this year were disqualified after passing a name-based background check.\nAssistant Aviation Director Chad Makovsky said the 31 applicants were disqualified for a range of criminal activities, including drugs, criminal impersonation, felony theft, money laundering and armed robbery.\nUber and Lyft are armed with their own stats.\nAZCENTRAL\nTravel hack: Tips to organize your itineraries\nSteve Thompson, Uber's general manager in Arizona, said \"dozens'' of people who have received a Sky Harbor badge to provide ground transportation failed Uber's background check when they applied to also drive for Uber.\nAn estimated 10 to 15 percent of those who apply to be an Uber driver fail the background test, he said.\nThe San Francisco-based company says at least 600 people who drove taxis in San Diego, Los Angeles and San Francisco, cities that require a fingerprint background check, were disqualified from becoming Uber drivers last year because they failed the company's background check. The disqualifying offenses included assault and battery, rape and DUI.\nTimothy Burr Jr., Lyft's government relations manager, said fingerprint background checks are an unnecessary expense that adds no value. The airport charges drivers $39 for its fingerprint background check.\n\"Fingerprints are a regulatory burden that bring an increased cost, as well as create barriers to entry for many drivers,'' he told the aviation advisory board.\nEd Maldonado, a criminal defense attorney who sits on the aviation advisory board, said he uses Uber and Lyft frequently. But he is put off by the companies' resistance to fingerprinting.\nAZCENTRAL\nUA, Uber partner on self-driving cars\n\"What's the undue burden?'' he asked at the board's meeting this month. \"I don't ever get to go apply for a job and say, 'Oh, I don't want to do what you're requiring me to do here so let me work here anyway.' \"\nTo resolve the impasse, Sky Harbor has offered to enter into a pilot program with one or more companies for six to 12 months. During that period, ride-sharing drivers who want to pick up passengers at the airport would undergo the fingerprint test in addition to their company's test.\nThe airport would track the results from the different background checks — drivers who fail the fingerprint test could not pick up at the airport — and compare the findings to determine whether the fingerprint test is more thorough.\nGrubbs offered to waive the $39 fingerprint fee during the pilot program.\n\"We think that our fingerprint standard is better than a named-based one, and I think they have good reasons ... why they think their name-based (system) is a better standard or just as good of a standard,'' Grubbs said. \"But we'd like to put it to the test.''\nThe airport would make recommendations to the advisory board based in part on the test results. Similar programs are underway at airports in San Diego, San Antonio and San Jose. Only San Jose requires fingerprints, although San Antonio gives travelers the option of choosing a driver who has been fingerprinted.\nNeither Uber nor Lyft has committed to the proposed program at Sky Harbor but both said they are willing to continue discussions.\nAZCENTRAL\nSome Uber drivers seek policy change to allow tips\nEven if the background-check differences are resolved, other issues remain. A big one: the financial terms of any long-term agreement with ride-sharing services. Taxis and Super Shuttle, which have contracts to pick up passengers and get premium curbside space, pay significantly more to serve the airport than companies and drivers who simply hold permits, such as luxury sedans, limos and shuttle companies. Insurance-coverage limits are also considerably higher for taxis and Super Shuttle.\nTaxi companies pay about $15,000-$16,000 per year per cab under the current contract, versus $400 a year per car for permitted providers. As a result, taxis and Super Shuttle, which account for one-third of trips from the airport, generate 86 percent of the airport's ground-transportation revenues. That needs to be leveled out, Grubbs said. Companies like Uber and Lyft would be considered permitted providers, and the amount they and others pay would likely change under a new operating agreement.\nApache Taxi company owner Abbas A. Naini called the difference in fees and other costs huge.\n\"I think competition is a very, very healthy thing for all of us to have,'' he said. \"I really like Uber. They give great service to people. What bothers me is (the lack of) a level playing field.''\nDavid Gryp, a 30-year-old bank trust officer who lives in Phoenix, has used Uber to get home from Sky Harbor and is a fan. He takes one of Uber's luxury vehicles, many of which can operate at Sky Harbor because the drivers have gone through the permitting process on their own or because the drivers are already permitted with other companies. He most recently took an Uber SUV home after his honeymoon in Florida. The tab was $35.\nHis favorite part about Uber: requesting a ride through the app as soon as he lands.\n\"I press it and they’re coming,'' he said.\nAZCENTRAL\nUber to add 300 jobs with Phoenix support center", "external_links": ["http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/38d294a5fa4bceec5773ca40068c583d9d22dd34/c=1660-0-5436-3776/local/-/media/2015/06/11/Phoenix/B9317686910Z.1_20150611214202_000_GQ7B28081.1-0.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/3a4e30f72c36a2bf0570da0b4d8c68285adcbc96/c=0-398-3883-2592&r=x1683&c=3200x1680/local/-/media/Phoenix/2015/03/11/B9316569775Z.1_20150311205737_000_GL3A6OPK9.1-0.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/70261845367a788a3f907a9f1f073a9c7298db27/c=408-0-2856-2448/local/-/media/2015/08/28/Phoenix/B9318537257Z.1_20150828152517_000_GSLBOC395.1-0.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/d6a5bc18442105a096490e66634d7abdc56a6f98/c=0-0-1414-1414/local/-/media/2015/09/25/Phoenix/Phoenix/635787792106813645-ThinkstockPhotos-509082299.jpg", "http://www.gannett-cdn.com/-mm-/9065941e142eb769bb76794c742e08d1e14ee558/r=300/http/www.gannett-cdn.com/-mm-/08ca1b6bef90ffe560234830912ca52270462e67/c=0-497-4926-3280&r=x1683&c=3200x1680/local/-/media/2015/09/25/Phoenix/Phoenix/635787985140891035-PNIBrd2-09-02-2015-Republic-1-B004--2015-09-01-IMG-GTY-451551318-I-FIN-1-1-1UBPT1G5-L668666027-IMG-GTY-451551318-I-FIN-1-1-1UBPT1G5-1-.jpg"], "published": "2015-09-25T22:41:00.000+03:00", "crawled": "2015-09-29T06:52:05.788+03:00", "highlightTitle": ""}