{"organizations": [], "uuid": "421eabb4f7bb044118ea99f950e64ef7d440adef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30044220/hub-group-appoints-donald-g-maltby-president-and-chief-operating-officer", "country": "US", "title": "Hub Group Appoints Donald G. Maltby President and Chief Operating Officer", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Hub Group Appoints Donald G. Maltby President and Chief Operating Officer - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "421eabb4f7bb044118ea99f950e64ef7d440adef"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30044220/hub-group-appoints-donald-g-maltby-president-and-chief-operating-officer", "ord_in_thread": 0, "title": "Hub Group Appoints Donald G. Maltby President and Chief Operating Officer", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Hub Group, Inc.\nOAK BROOK, Ill. , Sept. 16, 2015 /PRNewswire/ -- Hub Group, Inc. (NASDAQ: HUBG) announced that Donald G. Maltby has been appointed President and Chief Operating Officer, effective today. Mr. Maltby replaces Mark A. Yeager , who resigned on August 8, 2015 .\nDavid P. Yeager , Hub's Chairman and Chief Executive Officer, stated, \"I am very pleased that Don has chosen to take on the role of President and Chief Operating Officer. He is a hard worker and a strategic thinker with deep knowledge of the logistics industry as well as Hub's business and culture. I look forward to working with him to drive our company forward.\"\nMr. Maltby has been providing consulting services to Hub's Board of Directors since January 2015. He was Chief Strategy Officer for Hub from May 2014 until January 2015. Previously, Mr. Maltby served as Chief Supply Chain Officer from January 2011 until May 2014. Mr. Maltby has held several other positions at Hub since joining the company in 1990, including Executive Vice President-Logistics Services, President of Hub Online, the company's e-commerce division, and President of Hub Cleveland. Prior to joining Hub, Mr. Maltby served as President of Lyons Transportation, a wholly owned subsidiary of Sherwin Williams Company. In his career at Sherwin Williams from 1981 to 1990, Mr. Maltby held a variety of management positions including Vice-President of Marketing and Sales for the Transportation Division. Mr. Maltby has been in the transportation and logistics industry since 1976, holding various executive and management positions. Mr. Maltby received a Masters in Business Administration from Baldwin Wallace College in 1982 and a Bachelor of Science degree from the State University of New York in 1976.\nAbout Hub Group\nHub Group is a transportation management company providing intermodal, truck brokerage and logistics services throughout North America. A top 50 publicly-traded company in the Chicago area, Hub Group, which has over 2,500 employees and $3.6 billion in revenue, focuses on solutions that offer customers better control of their supply chain while also controlling their costs. For more information, visit www.hubgroup.com .\n releases/hub-group-appoints-donald-g-maltby-president-and-chief-operating-officer-300143666.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=CG03160&Transmission_Id=201509160905PR_NEWS_USPR_____CG03160&DateId=20150916", "http://www.hubgroup.com/", "http://www.xmlnews.org/ns/", "http://www.prnewswire.com/news-releases/hub-group-appoints-donald-g-maltby-president-and-chief-operating-officer-300143666.html"], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T17:44:28.925+03:00", "highlightTitle": ""}