{"organizations": [], "uuid": "928295b853b43804bf5e0dc4c2ead7d68a5029ce", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29931570/auto-recalls-expected-to-rise-through-2016-yet-few-have-product-safety-and-recall-analytics-programs", "country": "US", "title": "Auto Recalls Expected to Rise through 2016, Yet Few Have Product Safety and Recall Analytics Programs", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Auto Recalls Expected to Rise through 2016, Yet Few Have Product Safety and Recall Analytics Programs - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-01T03:00:00.000+03:00", "replies_count": 0, "uuid": "928295b853b43804bf5e0dc4c2ead7d68a5029ce"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29931570/auto-recalls-expected-to-rise-through-2016-yet-few-have-product-safety-and-recall-analytics-programs", "ord_in_thread": 0, "title": "Auto Recalls Expected to Rise through 2016, Yet Few Have Product Safety and Recall Analytics Programs", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Deloitte\nNEW YORK , Sept. 1, 2015 /PRNewswire/ -- While many auto executives (42.3 percent) expect more industry recalls in 2015 and 2016, just 8 percent use advanced predictive analytics to help prevent, prepare for, and manage recalls, according to a recent online poll from Deloitte . Nearly one-quarter (23 percent) have no operational product safety and recall anticipatory analytic capabilities.\n\"The essential paradox is this: today's vehicles are among the highest quality ever produced from a safety and reliability standpoint; innovations in technology have accelerated such that manufacturers can now identify emerging safety and quality issues much sooner than before; and, regulatory scrutiny of the auto industry has increased dramatically during the past 12-18 months,\" said Robert Biskup , Deloitte Advisory director, Deloitte Financial Advisory Services LLP, and former automotive industry chief compliance officer. \"While adequate early warning systems seem within reach, not all are taking advantage.\"\nDerek Snaidauf , Deloitte Advisory senior manager in advanced analytics, Deloitte Transactions and Business Analytics LLP, added, \"Many automakers still take a manual, rearview-mirror approach to vehicle quality and safety. But, leading OEMs are starting to adopt innovative analytic capabilities like proactive sensing for early issue identification and command centers for campaign management. By cross-source correlating internal and external data sources, employing specialized advanced analytics, and leveraging interactive visualizations, these companies can improve customer satisfaction, vehicle safety, and brand perceptions. They also can realize significant reductions in their total cost of quality spend.\"\nMost respondents (90.8 percent) indicated that recalls are impacting the working relationships between suppliers and original equipment manufacturers (OEMs).\n\"Because the stakes are so high in recall management, it now makes even more sense for traditional automakers and those within their supply chains - particularly new industry entrants - to consider investing in predictive analytics capabilities that can help detect trouble earlier,\" said Bruce Brown , principal and U.S. automotive and off-highway consulting practice leader, Deloitte Consulting LLP. \"Once in place, those competencies can also facilitate richer collaboration and communication between involved parties in times of investigation or crisis.\"\nOne of the biggest challenges to OEM-supplier collaboration in preventing, preparing for and managing recall-related events was ineffective communication channels (21.7 percent).\nAbout the online poll\nMore than 760 professionals from sectors including banking and securities; investment management; technology; automotive; retail and distribution; and, process and industrial products responded to polling questions during a June 17, 2015 webcast, titled \"Recall Readiness and Management in the Automotive Industry . \" Responses from only the 78 auto sector participants were analyzed for this press release. Click here to listen to the Deloitte Dbriefs webcast.\nAbout Deloitte's Automotive Practice\nDeloitte's automotive practice is recognized as a leader in understanding top trends and issues of the automotive industry. Deloitte has more than 220 automotive clients in the United States alone, representing some of the world's largest manufacturers, suppliers, dealers, finance companies and aftermarket businesses. With more than 400 American automotive practitioners, Deloitte serves more than 80 percent Fortune 500 automotive companies.\nAs used in this document, \"Deloitte\" means Deloitte LLP and its subsidiaries. \"Deloitte Advisory\" means Deloitte & Touche LLP, Deloitte Financial Advisory Services LLP, and Deloitte Transactions and Business Analytics LLP.. \"Deloitte Consulting\" means Deloitte Consulting LLP. Deloitte Transactions and Business Analytics LLP and Deloitte Consulting LLP are not certified public accounting firms. These entities are separate subsidiaries of Deloitte LLP. Please see www.deloitte.com/us/about for a detailed description of the legal structure of Deloitte LLP and its subsidiaries. Certain services may not be available to attest clients under the rules and regulations of public accounting.\nLogo - http://photos.prnewswire.com/prnh/20120803/MM52028LOGO-a\n releases/auto-recalls-expected-to-rise-through-2016-yet-few-have-product-safety-and-recall-analytics-programs-300135792.html\n ", "external_links": ["http://www.prnewswire.com/news-releases/auto-recalls-expected-to-rise-through-2016-yet-few-have-product-safety-and-recall-analytics-programs-300135792.html", "http://www2.deloitte.com/us/en/services/advisory.html", "http://www.xmlnews.org/ns/", "http://www2.deloitte.com/us/en/pages/dbriefs-webcasts/events/june/2015/dbriefs-recall-readiness-and-management-in-the-automotive-industry.html", "http://www.deloitte.com/us/about", "http://photos.prnewswire.com/prnh/20120803/MM52028LOGO-a", "http://photos.prnewswire.com/prnvar/20120803/MM52028LOGO-a", "http://www2.deloitte.com/us/en/profiles/brubrown.html", "http://rt.prnewswire.com/rt.gif?NewsItemId=NY90923&Transmission_Id=201509010930PR_NEWS_USPR_____NY90923&DateId=20150901", "http://www2.deloitte.com/us/en/pages/manufacturing/topics/automotive.html", "http://www2.deloitte.com/us/en/profiles/rbiskup.html", "http://www.slideshare.net/DeloitteUS/deloitte-auto-poll-product-safety-recall-analytics"], "published": "2015-09-01T03:00:00.000+03:00", "crawled": "2015-09-01T17:57:07.020+03:00", "highlightTitle": ""}