{"organizations": [], "uuid": "921dab9a3d82f2f110d44eede597cfd600563c1b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2013/07/South-African-Tourism1.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/for-too-long-has-african-tourism-narrative-been-restricted-to-a-few-destinations-and-safaris/", "country": "US", "title": "For too long has African tourism narrative been restricted to a few destinations, and SafarisTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "For too long has African tourism narrative been restricted to a few destinations, and SafarisTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T03:00:00.000+03:00", "replies_count": 0, "uuid": "921dab9a3d82f2f110d44eede597cfd600563c1b"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/for-too-long-has-african-tourism-narrative-been-restricted-to-a-few-destinations-and-safaris/", "ord_in_thread": 0, "title": "For too long has African tourism narrative been restricted to a few destinations, and SafarisTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For too long has African tourism narrative been restricted to a few destinations, and Safaris\nFor too long has African tourism narrative been restricted to a few destinations, and Safaris. A new online platform presents Africa to global travelers like they’ve never seen it before.Hip Africa the first and only definitive guide to the best spots to eat, sleep and play in Africa’s most sought after destinations, launched last week with 5 initial key cities: Lagos, Accra, Nairobi, Dakar and Johannesburg.\nHip Africa is set to take off as the go-to brand for high end travel in Africa, which transcends the old safari narrative, offering up the continent as a viable place for city breaks, great restaurants, arts and culture, and a swathe of boutique and luxury hotels.\nAfrica has emerged in recent years as one of the fastest growing regions for hotel development, with 50,000 hotels in the pipeline: a topic will be the subject of panel discussions, networking and deal making at the high profile Africa Hotel Investment Forum taking place in Addis Ababa 30th September – 1st October.\nThis activity is reflective of a wider trend: Africa’s emergence as the last tourism frontier, with a growing number of internationals visiting the continent year on year, and the upsurge of intra-Africa travel.\nGlobal travel accounts for almost 10% of global GDP, and is an industry that enjoys year on year uninterrupted growth. Africa’s tourism take off is inevitable.Hip Africa speaks to a sophisticated audience from Europe to the US, Asia, and most importantly across Africa itself – both business and leisure travelers.\nHip Africa showcases a carefully selected list of hotels and ‘hip spots’ – including restaurants, art galleries, museums, shopping spots and escapes – with high quality photography and editorially independent reviews.\nIt is London based, however its content is provided by a team of journalists, photographers, and movers and shakers on the ground across Africa, keeping readers in the know and up to date.“We aim to inform our readers, and give them the practical tools for visiting and moving around what is arguably the most exciting continent in the world,” says Ruby Audi, the Ghanaian/British founder.Hip Africa will soon be unveiling a number of new cities, on every corner of the continent, and will eventually cover over 30 destinations in 20 countries.\nSource:- African Tourism", "external_links": [], "published": "2015-09-16T03:00:00.000+03:00", "crawled": "2015-09-16T18:03:45.015+03:00", "highlightTitle": ""}