{"organizations": [], "uuid": "a0452b283a4686517409bc1824f51a22df088f25", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03450/radooncottagefire_3450806k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-23.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/cottages/11851994/Radoon-Rock-Cornwall-review.html", "country": "US", "title": "Radoon, Rock, Cornwall: review", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Radoon, Rock, Cornwall: review - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T01:44:00.000+03:00", "replies_count": 0, "uuid": "a0452b283a4686517409bc1824f51a22df088f25"}, "author": "Cathy Stebbings", "url": "http://www.telegraph.co.uk/travel/destinations/europe/uk/cottages/11851994/Radoon-Rock-Cornwall-review.html", "ord_in_thread": 0, "title": "Radoon, Rock, Cornwall: review", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Telegraph expert rating: 9/10 Radoon is the ultimate family holiday home. Perfectly located for water sports and the fabulous restaurants of Rock and Padstow, this eco-build offers light, airy and practical space for families to share. Downstairs bedrooms and the vast social areas upstairs take full advantage of the Cornish light afforded by floor-to-ceiling glass and views across the Camel Estuary. The large garden is a treat for children and dogs. Sleeps 12 in 6 bedrooms. Location: 8/10 The north Cornish coast offers sailing, water sports, surfing at Polzeath and miles of stunning coastal walks. Radoon offers outstanding value for money The house stands in an acre of well-maintained garden off the main road that runs through the village. Solid gates and a high fence offer privacy with plenty of parking. Radoon is a couple of minutes walk to the sailing club, the quay and the open beach beyond. The busy fishing town of Padstow is a five-minute ferry trip from the quay. Polzeath is a 10 minute drive or a three-mile walk away. Style & character: 9/10 Built in 2006 as a sustainable eco-build, Radoon is an imposing yet practical space: high ceilings, wooden floors and floor-to-ceiling windows make it bright and light. A vast open-plan kitchen-diner is connected to the equally enormous sitting area via an interior bridge. Between the two, a large deck offers outdoor dining in summer. A fabulous glass and steel balcony runs the length of the house, looking across the estuary. Huge sofas, love seats and bean bags provide ample fireside seating. Downstairs the bedrooms are a little sterile, but spotlessly clean and brightened by quirky patchwork quilts made by the owner’s mother. Radoon, in Rock, features quilts made by the owner's mother The decor is a little tired but modern and comfortably homely. Facilities: 9/10 Radoon is well-equipped for family life. A vast cloakroom downstairs has pegs and storage for everyone. The adjacent laundry room houses the interesting ground source heat pump, which provides the house with all of its hot water (there’s plenty of it) and winter warmth. Bathrooms are clean and serviceable, bedrooms immaculate. Upstairs, the vast kitchen, with its acres of granite worktop, hosts a large Aga, enough cutlery and plates for a wedding, massive fridge space and a separate pantry. A large games room above the garage is a bonus, with table tennis, table football and more sofas. The garden has a large lawn, borders of palm, lavender and agapanthus, as well as a separate barbecue area and volleyball net. Value for money: 10/10 Outstanding: house from £1,545 in low season; rising to £3,850 in high. Family friendly: 9/10 Perfect for all generations, children old and young, and dogs. Eating Rock is small but has an outstanding butcher, baker, fishmonger and deli. It is also home to some excellent pubs and restaurants, including the famous St Enedoc Hotel, Nathan Outlaw’s Michelin-starred HQ. Rick Stein’s culinary empire is just across the water in Padstow, where he competes with Paul Ainsworth. Access for guests with disabilities? None Details Rock, PL27 6JZ 01208 869090 www.latitude50.co.uk Telegraphtravel Follow @telegraphtravel", "external_links": [], "published": "2015-09-24T01:44:00.000+03:00", "crawled": "2015-09-23T22:43:57.153+03:00", "highlightTitle": ""}