{"organizations": [], "uuid": "0cf249e1b63f915fda69469884f097a440a39f97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/29940912/optima-batteries-announces-first-annual-ultimate-film-festival", "country": "US", "title": "OPTIMA® Batteries Announces First-Annual Ultimate Film Festival", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "OPTIMA® Batteries Announces First-Annual Ultimate Film Festival - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-02T03:00:00.000+03:00", "replies_count": 0, "uuid": "0cf249e1b63f915fda69469884f097a440a39f97"}, "author": "cbs8", "url": "http://www.cbs8.com/story/29940912/optima-batteries-announces-first-annual-ultimate-film-festival", "ord_in_thread": 0, "title": "OPTIMA® Batteries Announces First-Annual Ultimate Film Festival", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " OPTIMA Batteries\nEnthusiasts Nationwide Invited to Submit Original Content; Winners to Be Unveiled During SEMA Show\nMILWAUKEE , Sept. 2, OPTIMA ® Batteries, the global leader in high-performance automotive and marine batteries and digital battery chargers, is leading the charge to gather and celebrate the most exciting and powerful performance automotive content in the world with the OPTIMA Ultimate Film Festival. Beginning today through October 5 , automotive enthusiasts are invited to submit their unique and compelling automotive content to the OPTIMA Ultimate Film Fest panel of judges and for the chance to be featured in an upcoming MAVTV episode.\nEntries can be submitted as short-form or action films, vying for the \"Best in Show\" and \"Best Action Cam\" awards, respectively. Three areas of criteria will guide judges in selecting the best films, including compelling storytelling, authenticity and creativity – films should take a unique approach, be grounded in filmmaking and share true individual experiences.\n\"This initiative is about celebrating everything that makes the automotive performance industry great – emotional highs and lows, hold-on-to-your-hats performance and never-before-seen perspectives from passionate enthusiasts,\" said Cam Douglass , marketing director at OPTIMA Batteries. \"Now is the time for enthusiasts to show us what they're made of, and we can't wait to see the action and creativity in the submissions.\"\nFinalists' films will be announced in late October, with an exclusive screening event on November 5, 2015 during the SEMA Show at the House of Blues, where industry peers will vote in real-time to select the winners. Selected filmmakers will receive two general admission tickets to the event. Films shown at the event will also be included in a one-hour TV special broadcast by MAVTV in 2016.\n\"As popularity for our 'OPTIMA's Search for the Ultimate Street Car' series on MAVTV continues to grow, we recognized enthusiasts everywhere are craving action-packed stories from colleagues and peers,\" said Douglass. \"We're thrilled to be spearheading this competitive initiative that will curate and celebrate the type of exciting, branded content making waves in the industry.\"\nInitial plans are underway to expand the program to qualifying Film Festival events in 2016, culminating in a final competition during SEMA. For official rules, FAQs and full list of submission criteria details, visit www.optimafilmfest.com . Also, visit OPTIMA Batteries on Facebook and Twitter to join the conversation.\nAbout OPTIMA ® Batteries\nOPTIMA ® YELLOWTOP ® , REDTOP ® and BLUETOP ® batteries are available through leading battery distributors globally. When looking for OPTIMA Batteries consumers should look for the unique, colored-top and SIX PACK™ design which OPTIMA is known throughout the world. In 2012, OPTIMA added to its product line with the innovative OPTIMA ® Chargers Digital 1200 Battery Charger for all automotive and marine batteries. To find out more information or purchase OPTIMA products consumers may visit www.optimabatteries.com . Consumers can also call 1-888-8OPTIMA (1-888-867-8462) for additional information.\nJohnson Controls Power Solutions is the global leader in lead-acid automotive batteries and advanced batteries for Start-Stop, hybrid and electric vehicles. Our 50 manufacturing, recycling and distribution centers supply more than one-third of the world's lead-acid batteries to major automakers and aftermarket retailers. Through our innovations we are building the advanced battery industry for hybrid and electric vehicles. We were the first company in the world to produce lithium-ion batteries for mass-production hybrid vehicles. Our commitment to sustainability is evidenced by our world-class technology, manufacturing and recycling capabilities.\nLogo - http://photos.prnewswire.com/prnh/20150901/263026LOGO\nTo view the original version on PR Newswire, visit: http://www.prnewswire.com/news-releases/optima-batteries-announces-first-annual-ultimate-film-festival-300136651.html\n©2015 PR Newswire. All Rights Reserved.", "external_links": ["https://twitter.com/OptimaBatteries", "http://www.xmlnews.org/ns/", "http://photos.prnewswire.com/prnh/20150901/263026LOGO", "https://www.facebook.com/optimabatteries", "http://www.prnewswire.com/news-releases/optima-batteries-announces-first-annual-ultimate-film-festival-300136651.html", "http://www.optimafilmfest.com/", "http://www.optimabatteries.com/", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG92167&Transmission_Id=201509020805PR_NEWS_USPR_____CG92167&DateId=20150902", "https://photos.prnewswire.com/prnvar/20150901/263026LOGO"], "published": "2015-09-02T03:00:00.000+03:00", "crawled": "2015-09-02T16:36:09.403+03:00", "highlightTitle": ""}