{"organizations": [], "uuid": "f7b519b9c405023b6d5c962b114d8c08b0d75eac", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150923SyrianRefugeeMeeting.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/09/23/reversal-costa-rica-accept-syrian-refugees", "country": "US", "title": "Costa Rica now will accept Syrian refugees after president reverses course", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "Costa Rica now will accept Syrian refugees after president reverses course", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T19:25:00.000+03:00", "replies_count": 0, "uuid": "f7b519b9c405023b6d5c962b114d8c08b0d75eac"}, "author": "Zach Dyer", "url": "http://www.ticotimes.net/2015/09/23/reversal-costa-rica-accept-syrian-refugees", "ord_in_thread": 0, "title": "Costa Rica now will accept Syrian refugees after president reverses course", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "From: To: \nInterior Vice Minister Carmen Muñoz, left, meets with demonstrators urging action from the government on Syrian refugees, on Sept. 22, 2015. (Courtesy Casa Presidencial) \nIn a presidential flip-flop, Casa Presidencial announced Tuesday that Costa Rica will begin accepting refugee applications from Syrians fleeing a brutal and horrific war back home. \nThe statement, which followed a meeting with protesters advocating on behalf of refugees, was a reversal from President Luis Guillermo Solís’ earlier remarks that Syrian refugees would not find acceptance in Costa Rica. \nVice Minister of the Interior Carmen Muñoz met with members of Costa Rica’s Muslim community, including Syrians, after a small demonstration took place outside Casa Presidencial on Tuesday urging the government to accept Syrians fleeing the civil war. \nDemonstrators held signs reading, “We have family in Syria, what would you do for your family?” and the now iconic image of Aylan Kurdi, the 3-year-old Syrian boy photographed facedown on a Turkish beach after drowning in an attempt to reach Europe with his family. According to figures from the U.N. High Commission for Refugees, the war has turned more than 3.8 million Syrians into refugees , and an additional 7.6 million people are internally displaced as a result of the four-year conflict. #EnDesarrollo Afueras de Casa Presidencial: Reducido grupo pide a @luisguillermosr apoyo a refugiados sirios. pic.twitter.com/jJJIfoU96C \n— ameliarueda (@ameliarueda) September 22, 2015 \n“Costa Rica is recognized internationally for its democratic tradition and respect for human rights. It has been a destination country for people who seek protection from conflict areas in their place of birth. In this spirt, and amid the situation in Syria, we will process the applications these citizens present,” Solís said, according to a statement from Casa Presidencial. \nThe president’s words are a reversal on comments he made on Sept. 11, when he told reporters that Costa Ricans and Syrians do not share a common culture or religion, and he doubted the refugees would successfully integrate into Costa Rican society. \n“I don’t want a humanitarian gesture to end up with us building ghettos in Costa Rica ,” Solís said, according to the news website AmeliaRueda.com. \nAccording to immigration figures, 38 people of Syrian origin currently have legal resident status in Costa Rica because of connection with Costa Ricans. Four refugee applications are pending, and six visas are being processed based on family reunification. The number of Muslims in Costa Rica may be small, but San José does have a mosque and Islamic culture center . \nCosta Rica has a strong history of accepting conflict refugees, mostly from Latin America. In addition to Ecuador, Costa Rica is the largest receiver of refugees in Latin America. The vast majority of the refugees in Costa Rica – 76 percent – are from Colombia. After Colombians are Cubans (8 percent) and Venezuelans (3 percent). \nCosta Rica has seen a spike in refugee applications during the last year, especially from people fleeing violence in Central America’s Northern Triangle. So far in 2015 the government has approved 115 refugee requests. Contact Zach Dyer at zdyer@ticotimes.net", "external_links": [], "published": "2015-09-23T19:25:00.000+03:00", "crawled": "2015-09-23T19:47:35.760+03:00", "highlightTitle": ""}