{"organizations": [], "uuid": "9eec05dfba5ecd01c0ff18d41dbe5e9eff721063", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "tourist2townie.com", "main_image": "http://tourist2townie.com/wp-content/uploads/Istanbul-FoodPorn-Dolma1.jpg", "site_section": "http://feeds.feedburner.com/tourist2townie/feed/", "section_title": "Travel Deeper with Gareth Leonard | Tourist2Townie.com | RSS Feed", "url": "http://tourist2townie.com/travel-deeper/istanbul-food-porn-with-local-models/", "country": "US", "title": "Istanbul Food Porn (with local models)", "performance_score": 0, "site": "tourist2townie.com", "participants_count": 1, "title_full": "Istanbul Food Porn (with local models)", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T16:33:00.000+03:00", "replies_count": 0, "uuid": "9eec05dfba5ecd01c0ff18d41dbe5e9eff721063"}, "author": "Gareth", "url": "http://tourist2townie.com/travel-deeper/istanbul-food-porn-with-local-models/", "ord_in_thread": 0, "title": "Istanbul Food Porn (with local models)", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Istanbul Food Porn (with local models) Istanbul Food Porn (with local models) In Travel Deeper by Gareth Leave a Comment \nThe Internet loves two things: food porn and attractive women. So, while living in Istanbul , where the delicious food and beautiful women are plentiful, I decided to bring the two together for one ridiculously seductive food porn video to get everybody horngry. \nTo make this happen, I teamed up with my good friend (and Turkish food expert) Guney from Walks of Turkey , and we spent the day with three local beauties (Anna, Anastasia and Ivana), eating our way around the Kadıköy neighborhood… \nEnjoy responsibly. \nIn case you’d like to follow along at home, here’s a few of the featured Turkish treats from the video… \nKebab – You can find these meaty carousels hanging outside shop windows all over Istanbul. They usually come in two forms; chicken or “meat,” and can be served in a wrap, sandwich or by itself on a plate. \nRoasted Chestnuts & Corn – The lingering smell from the roasting chestnuts adds another element of attraction to the city streets, and the perfectly grilled corn on the cob is a great walking snack. \nDondurma – These cheeky Turkish tricksters leave you screaming for ice cream as they dangle the delicious treat in front of you for a few minutes before handing it over. The ice cream itself is good, but the spectacle is better. \nPide – Turkish Pizza is shaped differently, but tastes just as good as any pizza you’ve ever had in your life. \nIskender kebap – Sliced meat served with greek yogurt, hot peppers, tomatos, a light tomoto sauce and topped with a hot buttery finished. It’s different, but delicious. \nİmam Bayıldı – Stuffed eggplant that is out of this world. I don’t even like eggplant and I love this dish. Caramelized onions, tomatoes and meat with raisins and traditional Middle Eastern spices(cinnamon, nutmeg, clove, allspice). \nSimit – Soft pretzel with sesame seeds, covered in grape seed oil and toasted. Try it outside the Blue Mosque with Nutella and thank me later. \nBörek – The delicious filo dough pastry stuffed with spinach, meat and/or cheese that serves as the perfect quick breakfast for Istanbulites on the move. \nMeats & Cheeses – Istanbul has so many delis that offer a variety of cured meats, olives and cheeses. My personal favorite… the Buffalo cheese with honey (in the middle of the plate). \nDolma – Tasty stuffed grape leaves that will make your face do funny things. These are my preferred appetizer on the planet. \nKibbeh – bulgur (cracked wheat) stuffed with minced onions and finely ground lean beef, lamb, goat or camel meat with Middle Eastern spices (cinnamon, nutmeg, clove, allspice) and fried. \nÇay – Turkish tea served at every meal, every day, every moment, every cigarette, and for every occasion. \nMidye Dolması – Muscles that are stuffed with rice, seasoned and then put back into their shell. You scoop out the muscle with the top shell and shovel it into your face. Little stands are setup all over Istanbul and you pay per muscle. They’re delicious and cheap, and the perfect late night post-bar snack! \nKokoreç – Wound lamb intestines grilled on a spit, chopped with herbs and spices, and then added to a bread roll to form a sandwich. It’s grainy and chewy and not my favorite. Many Turkish people love this sandwich though, so it’s good to try… once. \nKarisik Izgara – A traditional mixed grill served with rice, onions, peppers and tomatoes. The meat is usually skewered steak, chicken, and Adana Kebab (ground spiced meat). \nAyran – Yogurt milk. It is thick and tart, helps with digestion, and makes you real sleepy, real fast. \nCotton Candy – You all know this one, I just like the photo. Side note, the guy was making the cotton candy out of his trunk… so that’s either really cool or really creepy – you decide. \nTurkish Delight – A cubed family of gelatin confections served in a variety of different colors and flavors and many made with pistachios, chopped dates, and other nuts. \nBaklava = Heaven. \nIstanbul is the greatest food city I have ever been to. Thanks to the incredibly diverse culture and rich history, flavors from all over the world have collided here. \nI highlighted just a few of the many traditional Turkish dishes that you should try, so get out there and create some food porn of your own! \nSome of my other favorite Turkish food, not mentioned in this video, includes; Lahmacun, Köfte, Menemen and Su Böreği. \nCheck out more Traditional Turkish Food here and here . \nIf you’re going to Istanbul, do a Food Tour with Güney from Walks of Turkey . \nLast thing… be sure to subscribe to the T2T YouTube Channel for more videos coming every week! Leave a Comment", "external_links": [], "published": "2015-09-04T16:33:00.000+03:00", "crawled": "2015-09-04T18:19:37.139+03:00", "highlightTitle": ""}