{"organizations": [], "uuid": "177055fef512e182e10d2395e9edf74b9fbbf1fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.news.com.au", "main_image": "http://cdn.newsapi.com.au/image/v1/39745ee4437f77c335dd4a9c3524a89d", "site_section": "http://feeds.news.com.au/public/rss/2.0/news_travel_3325.xml", "section_title": "News.com.au | Travel", "url": "http://www.news.com.au/travel/travel-advice/japanese-hiker-climbs-everest-with-just-one-finger/story-fnndib5x-1227548662808?from=public_rss", "country": "IL", "title": "‘I wanted to come back alive’", "performance_score": 0, "site": "news.com.au", "participants_count": 0, "title_full": "‘I wanted to come back alive’", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T04:10:00.000+03:00", "replies_count": 0, "uuid": "177055fef512e182e10d2395e9edf74b9fbbf1fc"}, "author": "", "url": "http://www.news.com.au/travel/travel-advice/japanese-hiker-climbs-everest-with-just-one-finger/story-fnndib5x-1227548662808?from=public_rss", "ord_in_thread": 0, "title": "‘I wanted to come back alive’", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email a friend \nA JAPANESE climber who lost all his fingers to frostbite except one has become the first person to attempt to scale Mount Everest since the Nepal earthquake. \nNobukazu Kuriki took on the world’s highest mountain to help revive the region’s mountaineering industry, which took a gigantic blow when avalanches caused by the quake killed nearly 8900 people in April. \nThe 33-year-old, whose only digit is a thumb, made the journey alone, without bottled oxygen or a rope, during the challenging autumn season. \nDevastatingly, he was forced to give up just before the summit at the South Col, writing on his Facebook page on Sunday morning that he had realised continuing would mean death. \n“I left the final camp (7600-6600m) a little after 8pm on 26th for summit push,” he wrote to the 140,000 fans who had been following his live updates. “I tried hard taking all my energy, but it took too much time to move in deep, deep snow. It was his fifth attempt to reach Mount Everest’s highest peak in six years. Source: The climber realised that to summit would mean death. Source: He lost his fingers to frostbite in -20C temperatures on Everest in 2012. Source: \n“I realised if I kept going, I wouldn’t be able to come back alive, so I decided to descend. Thank you so much for all your support. I appreciate you all from bottom of my heart.” \nMost of the 120 climbers who have been killed on Everest died in the “death zone”, above 8000m, where the air becomes thinner and there is little oxygen to breathe. The mountain is 8848m high. \nThis was Kuriki’s fifth attempt to reach Mount Everest’s highest peak in the past six years, the BBC reported. In 2012, he lost all of his fingers and one thumb after spending two days in a snow hole at 8230m in temperatures lower than -20C. \nHe now finds it hard to complete simple tasks including tying his shoelaces and gripping an ice axe. “I do feel nervous and afraid,” he told Reuters after arriving in Nepal . “This is only natural before attempting the challenge of climbing Everest, particularly after the earthquake and at this time of year.” \nUS-born Nepal climbing expert Elizabeth Hawley saidit showed how desperate the government was to revive the industry that it was promoting a “crazy” man to convince the world it was safe. \nThe Nepalese ambassador in Japan had sent a message in advance of his final push, the UK Telegraph reported. “We are anxiously waiting for your success so that we can celebrate here in Tokyo,” Madan Bhattarai said. The 33-year-old was eventually thwarted by the deep snow. Source: \nThe Nepalese ambassador in Japan had sent a message in advance of his final push, the UK Telegraph reported. “We are anxiously waiting for your success so that we can celebrate here in Tokyo,” Madan Bhattarai said. He had hoped to help revive Nepal’s struggling mountaineering industry. Source: \nKuriki had been following the route of the first successful Everest climb by Edmund Hillary and Tenzing Norgay in 1953, but in the more narrow and dangerous late autumn window rather than the spring. He said he saw it as a “purer” form of climbing. \nAng Tshering Sherpa, who runs one of the biggest Everest trekking organisations, called the climb “very risky and dangerous” because of strong winds and possible avalanches in the colder autumn weather. Only three expeditions have succeeded in autumn in the past 15 years, according to the Himalayan Database and no one else will attempt the climb this year. \nBy the time Kuriki reached camp 1 at 6000m, it was complete white-out, and he was forced to return to base camp and wait out the weather before his doomed attempt on the summit. \nThe industry is important to the Nepalese economy, with climbers paying $A55,000 to $A120,000 for guided tours. There are now fears adventure-seekers may increasingly choose to climb Everest from the Chinese side because of concerns about the instability of the Khumbu Icefall. \nA team of sherpas, known as the Icefall Doctors, will this week begin to rebuild the route through the moving glacier. \nAs for Kuriki, whether you think he’s foolish or incredibly brave, judging by the determination he’s shown so far, it seems likely he will make a sixth attempt. \nWhen he does, the whole world will be willing him to succeed.", "external_links": [], "published": "2015-09-29T04:10:00.000+03:00", "crawled": "2015-09-29T04:18:36.943+03:00", "highlightTitle": ""}