{"organizations": [], "uuid": "1e3ac6c78fe812bd9411f13db7bd3ceb530b9767", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "airtravel.about.com", "main_image": "http://f.tqn.com/y/default/travel/S/200243294-001.jpg", "site_section": "http://z.about.com/6/o/m/airtravel_t2.xml", "section_title": "About.com Air Travel: What's Hot Now", "url": "http://airtravel.about.com/od/delayscanceledbumping/tp/airlinestrikesadvice.htm", "country": "US", "title": "When an Airline Strikes - Labor Disruptions,...", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "When an Airline Strikes - Labor Disruptions,...", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T14:01:00.000+03:00", "replies_count": 0, "uuid": "1e3ac6c78fe812bd9411f13db7bd3ceb530b9767"}, "author": "", "url": "http://airtravel.about.com/od/delayscanceledbumping/tp/airlinestrikesadvice.htm", "ord_in_thread": 0, "title": "When an Airline Strikes - Labor Disruptions,...", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Expert Videos Whenever a strike is looming at an airline, passenger anxiety naturally increases. The uncertainty not only is among passengers, but extends to airline employees as well. In effect, if you call an airline even hours before a possible strike you are likely to be told that the company line is business as usual. 1. An Airline Agent's Experience with a Strike \nI worked in reservations when the airline I work for last had a strike. Even minutes before the threat of a strike, we were not updated. Phone lines were flooded with calls, at that point the airline was not offering options. I was left apologizing for not having more information, but as far as I was aware the airline was operating. \nHours later - the airline was not operating as usual. Passengers were stranded, agents struggled to rebook passengers on other airlines during a peak travel time. Service was disrupted - some rebooked passengers now had 4 flights when they originally had one non-stop. \nThe airline I work for did have agreements with other airlines to accept tickets / MCOs (miscellaneous charge orders), if you could find space. 2. What is an airline obligated to do during a strike? \nNothing. There are no provisions guaranteeing you anything in the case of a labor disruption. Sometimes there is advance notice that a strike might occur, other times it is a wildcat strike such as a sick-in where airline employees call in sick en masse. That being said, airlines will usually try to do something for its passengers.﻿ 3. What will an airline try to do during a strike for its most frequent flyers? If you are a top tier frequent flyer member, the airline is probably working on rebooking your travel before you even reach an agent. The airline wants to maintain its most loyal passengers and will try and accommodate them first. 4. What an airline may to do during a strike - Rebooking on other airlines During a strike, an airline will often rebook on partner airlines, space permitting. You will be waiting a long time on the phone or at the airport, but an airline will turn to partner airlines as a strike lingers. An airline may offer to rebook on non-partner airlines. This usually does not occur until all partner airline options have been exhausted. When I was rebooking passengers we eventually got the go-ahead to use any airlines as long as there was a ticketing agreement with them. One awful rebooking involved San Francisco to Amsterdam and ended up with connections in Denver, Chicago, Boston and London on 3 airlines. 5. Possible passenger options during a strike - Rebooking without fees Although airlines are not obligated to do anything during a strike, they will usually loosen their ticket rules. If a strike does not affect all flights then you are likely to be able to standby for other flights without fees, thus arrive at the airport early. In the same vein, you may be able to rebook for later travel dates without fees. And if a strike drags on, refunds without penalties are often offered. Unfortunately, the airline may not offer many options, save rebooking you on their next available flight if yours cancels. In the days after 9/11, some passengers could not be accommodated for days after their original flights on 9/11 and 9/12. 6. Information during a strike An airline may simply post their policies / news on their website as circumstances change. It is always a good idea during a strike to check the airline's website. 7. What should you do to protect yourself during an airline strike? If you are flexible with your travel dates, call to see if you can rebook. Strikes often mean that you can change your ticket for future travel without fees. If you do not need to travel and the strike is longer, call for a refund. A strike that drags on will lead an airline to permit refunds without fees as even after flights are back to normal there is likely to be a huge backlog of disrupted passengers. Check if your travel insurance covers labor disruptions. Check for partner airlines check to see if there is space on them, and see if you can rebook as it may be allowed by the striking airline. As a last resort (expensive), book a refundable ticket on another airline. You can refund the ticket if you do not end up requiring it. 8. Strikes and low cost or charter airlines It may be a generalization but low cost and charter airlines are likely to have less options since they don't usually have ticketing agreements with other airlines, and may have less service to the destination you are traveling to. Related Articles", "external_links": [], "published": "2015-09-10T14:01:00.000+03:00", "crawled": "2015-09-10T22:19:15.105+03:00", "highlightTitle": ""}