{"organizations": [], "uuid": "ea9f1ad325c93bd391028bd51642c3fff8a7b0b1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.rocketnews.com", "main_image": "", "site_section": "http://www.rocketnews.com/category/travel/feed/", "section_title": "» Travel", "url": "http://www.rocketnews.com/2015/09/tea-ceremonies-around-the-world/", "country": "US", "title": "Tea ceremonies around the world", "performance_score": 0, "site": "rocketnews.com", "participants_count": 1, "title_full": "Tea ceremonies around the world", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T21:57:00.000+03:00", "replies_count": 0, "uuid": "ea9f1ad325c93bd391028bd51642c3fff8a7b0b1"}, "author": "Editor", "url": "http://www.rocketnews.com/2015/09/tea-ceremonies-around-the-world/", "ord_in_thread": 0, "title": "Tea ceremonies around the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Posted on September 9, 2015 by Editor \nAmerica doesn’t really have what you’d call a tea drinking culture, save for the sweet tea sipping crowd down South. In fact, it wasn’t until recently that Americans started fully embracing tea beyond the iced variety, thanks in large part to a slew of studies purporting the many health benefits of drinking tea (full of antioxidants, tea lowers your risk for cancer and heart disease, increases metabolism, and more). But around the globe, tea has been an important part of life for hundreds of years, complete with serving ceremonies and rituals elevating the beverage to an art form. Take a look at how five cultures celebrate tea. \nJapanese tea ceremony (also called the Way of Tea) \nThe tea: There are two varieties of matcha (powdered green tea) in this ceremony: thin tea (called usucha) and thick tea (called koicha), which requires about three times as much tea to the equivalent amount of water as sucha. \nThe ceremony: Influenced by Zen Buddhism, the Japanese tea ceremony brings people together in the spirit of harmony and respect. Expect the more formal ceremony to last several hours, with the tea served in fine pottery, porcelain and lacquer, along with a traditional light meal (called tenshin) or kaiseki (a multi-course meal of seasonal specialties). \nWhere to find it here: The Kitano New York Hotel’s Michelin-rated Japanese restaurant, Hakubai , offers a thin tea ceremony on traditional tatami mats with shoji screens throughout the day. Led by tea master Fujuko Sasaki, the ceremony includes a traditional tenshin, complete with sashimi, soup, grilled fish, steamed egg custard and pickles. \nChinese tea ceremony (also called the Art of Tea) \nThe tea: Oolong teas are the primary teas used. \nThe ceremony: Influenced by Taoism, this ritual called Gōngfu Chá (meaning tea with great skill) involves the ceremonial preparation and presentation of the tea leaf in half a dozen clay tea pots and cups, served in a bamboo box. The clay is so porous it absorbs the oils of the teas, so eventually you won’t need to add tea to the pot to enjoy a cup. There is no food involved. \nWhere to find it here: Mandarin Oriental Las Vegas offers a very authentic Gōngfu Chá between 2 p.m. and 5 p.m. reservations are requested. The purple clay used in their unglazed Yixing pots comes from an area outside Shanghai and are filled with Imperial Spring Dragonwell tea. Hangzhou, China is just your cup of tea \nEnglish afternoon tea ceremony \nThe tea: A variety of teas are offered during afternoon tea, though black tea is common with milk and sometimes lemon or sugar. \nThe ceremony: Legend has it that in 1865, the 7th Duchess of Bedford, the lady-in-waiting to Queen Victoria, experienced a sinking feeling in the middle of one afternoon and asked her footman to deliver all the tea making equipment with some bread and butter to her private room at The Langham Hotel in London. She found this new meal so satisfying and enjoyable that she soon started inviting her special friends to join her for Afternoon Tea, which evolved to include elaborate selections of sandwiches, scones, muffins, cakes, biscuits, gâteaux and fruit desserts. \nWhere to find it here: Many posh hotels in the USA now offer afternoon tea, though history buffs will revel in the original at the Langham hotels in Boston, Chicago and Pasadena, Calif. The Afternoon Tea by Wedgwood — each hotel serves a combination of teas produced by Wedgwood and their own Langham Blend — is served post-lunch, from 2 p.m. to 6 p.m., on their exclusive Langham Rose pattern china on tiered silver and brass serving trays, often with a glass of Champagne. \nTea in Turkey \nThe tea: Turkish tea (cay) is loose leaf black tea brewed in a copper kettle called a samovar. The tea can range from light to dark, and is poured and lighted with hot water to the individual drinker’s taste. Though sugar and lemon are sometimes added, milk is never used. \nThe ceremony: Though the Turks don’t have an official tea ceremony per se, tea is considered an art in the country — it’s the most commonly drunk hot drink, and is served every morning with breakfast. Likewise, the practice of serving tea is a cornerstone of Turkish hospitality. \nWhere to find it here: Head to Ankara in Washington, D.C. for a bona fide Turkish tea service, complete with samovar and tulip-shaped glasses, which are so common in Turkey they’re actually a unit of measure in recipes. Offered as part of the restaurant’s Turkish breakfast, weekend brunch, and with lunch and dinner, the tea is often served with pastries and light foods like poagca , a homemade crescent shaped roll filled with cheese. \nRussian tea \nThe tea: Black tea, often sweetened with raw sugar cubes and spiked with lemon, is most prevalent in Russia, though green tea is gaining in popularity. \nThe ceremony: The Russian tea ceremony is more symbolic than technical, as it’s not drunk at a particular time of day; rather tea is the drink of choice throughout the day and a symbol of friendship. Thanks to a treaty with China where tea was traded for furs, tea has now become the national drink of Russia, often served in fine bone china cups or glass tea holders (called podstakannik ), along with cookies ( pryaniks ), mini bagels ( sushki ), Blini (crepes), sandwiches with fish, caviar, meat and cheese, cakes and jam. \nWhere to find it here: Named for the sharing of tea among friends and family, Russian Tea Time in Chicago offers an authentic tea presentation throughout the day, plus an Afternoon Tea Time daily (2:30 p.m. to 4:30 p.m.), where guests can choose a tea to be served with a tier of savory mini sandwiches, crepes and desserts.", "external_links": [], "published": "2015-09-09T21:57:00.000+03:00", "crawled": "2015-09-09T22:52:12.149+03:00", "highlightTitle": ""}