{"organizations": [], "uuid": "99372a03ce21baf2a73c05688915ad8b66b3ef61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "theplanetd.com", "main_image": "http://theplanetd.com/images/How-to-pack-for-antarctica-cruise-e1442766159761.jpg", "site_section": "http://theplanetd.com/feed/", "section_title": "The Planet D: Adventure Travel Blog", "url": "http://theplanetd.com/pack-for-antarctica-cruise/", "country": "US", "title": "How to Pack for an Antarctica Cruise", "performance_score": 0, "site": "theplanetd.com", "participants_count": 1, "title_full": "How to Pack for an Antarctica Cruise", "spam_score": 0.0, "site_type": "news", "published": "2015-09-21T12:00:00.000+03:00", "replies_count": 0, "uuid": "99372a03ce21baf2a73c05688915ad8b66b3ef61"}, "author": "Dave and Deb", "url": "http://theplanetd.com/pack-for-antarctica-cruise/", "ord_in_thread": 0, "title": "How to Pack for an Antarctica Cruise", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "  No Comments » • Antarctica , How to pack for a Trip When going on an Antarctica Cruise, one would think that you need to pack a ton of travel gear and clothing. However, you may find that when you pack for an Antarctica Cruise, you can bring far less than you’d expect. \nWhen we went to Antarctica with Quark Expeditions, we were worried that we’d be bogged down with heavy parkas, rubber boots, and everything in between. It’s the frozen continent after all. You need to be prepared for any situation, but when you go on an Antarctic Expedition, you need to pack much less than you ever expected. How to Pack for an Antarctica Cruise: Tips to get you Started Packing for an Antarctica Cruise \nThe first thing you need to think about is layering. When the Antarctic Cruise season gears up, it’s summertime in Antarctica. But summertime in Antarctica isn’t the same as summertime in the rest of the world. It’s still chilly. Temperatures during the day hovered around zero and once in a while at the height of a calm and sunny afternoon, we may have hit 5 degrees Celcius for a short time. You’ll find that you’ll be peeling off and putting on layers often. 50% off Flash Sale! \nQuark is having a huge Sale on Antarctica Cruises right now! If you are thinking of exploring the 7th continent, now’s the time save up to $7948 per person on select polar voyages. Or take advantage of this 5-day Flash Sale. Act fast to save 50% on select voyages booked between Sept 21-25, 2015. Packing suggestions \nWhen choosing a bag for Antarctica, we suggest a duffel or rolling duffel. You want to keep things light. A duffel bag lets you stuff everything into it easily and doesn’t take up a lot of weight. You will have to change plane (and airports) in Beunos Aires. When you go on the lighter plane to Ushuaia, you’re bags will be weighed. So the lighter the bag, the more you can fit inside. Although after you read our packing list, you’ll find that you won’t need to pack a lot inside your bag. Packing Camera Gear for Antarctica can be difficult. \nThe heaviest part of your Antarctica Cruise packing will be your photography gear. Check out our post on Quark Expeditions: What Photography Gear to Pack for An Antarctic Cruise. You will want a day bag to take on shore and zodiac excursions. A waterproof bag for your camera gear and extra layers is recommended. Start with your base layer \nWe love merino wool base layer by Icebreaker: \n2 merino wool long sleeve shirts. \nIf you want to pack really light, You really only need one as merino wool dries quickly and repels odour. You can wear the same pair of long johns for days without smelling! But seriously, why would you want to do that? Mid Layers Mid Layers are great for kayaking \nEve though we were hiking and kayaking to keep our blood pumping, it was still cold on the continent and a mid layer helped to keep us cozy and warm. When you are sitting on zodiacs, (which you do a lot to explore icebergs, whales and leopard seals) you will be cold. That mid layer will do wonders to keep out the chill. Staying warm is important on and off of the boat. \n2 different weights of mid layers for our tops – A heavy fleece sweater for the times we were sitting on the zodiac and a lighter weight wool sweater for the times we were hiking or kayaking . We wore this over our base layers. \nWool is excellent for wicking away sweat and moisture and we highly recommend it. \n1 mid layer bottoms. Fleece pants overtop our wool long johns worked perfectly when sitting in the zodiac and on cold kayaking days. Even though you are working hard kayaking, that water is cold. It’s nearly 2 degrees below zero! Your butt gets very chilly and the fleece pants add an extra layer of warmth. Outer Layers Parka’s kept us warm and dry when were exploring the continent. \nCheck with your expedition company to see if they supply waterproof parkas. The beauty of going with Quark is that they give all passengers their waterproof and warm parkas to use and keep after the Antarctica Cruise. You don’t have to pack coat at all! \nQuark Expeditions Parkas (and other polar expedition companies) have a detachable mid fleece liner and a waterproof outer shell. If you want to keep things really light, you don’t even have to bring the heavier fleece jacket we mentioned above because this parka does it for you! However, at times we found the fleece liner in the parka to be a bit too warm, so we unzipped it and wore our own fleece jacket. The Mid-Later Fleece really came in handy when the weather turned. \nSo, if you choose the right expedition company, you can leave the parka and fleece jacket at home keeping your packing very light indeed. Note: The parkas are yours to keep, but if you don’t want to carry them back on the flight, Quark donates their parkas to the indigenous people of the Arctic. When we travelled to Greenland, we saw many a local wearing bright yellow coats. \nWaterproof Pants: This is the one outer item that you must pack. You will be climbing in and out of zodiacs when you go to shore. You’ll be splashed by rogue waves and it may snow a lot while you are out on the zodiac and you will get wet. You must pack waterproof, gortex pants. Waterproof pants were our best friends on the trip. \nIf you’re company doesn’t supply a parka, we’re big fans of Canada Goose Parkas . They’ll do the trick and you’ll have it for life. We use our Canada Goose parkas for all outdoor winter expeditions and treks. \nGet yourself a Canada Goose Hybridge down jacket for your mid layer. This is actually wonderful. I wear it everywhere and would like to add that this should be in the mid layer section above as well. Boots \nDon’t bother bringing any heavy winter boots with you, you don’t want to wear your own boots on the continent. They will be covered in Penguin guano and will smell forever! \nUse the lined rubber boots provided on the ship. Seriously you’ll thank me. Most Antarctica Cruises lend passengers rubber boots to use during the expedition. The will fit you up at the beginning of the cruise and they will be yours to keep for the duration of the cruise. So happy that Quark Expeditions provided rubber boots. \nHiking boots ( We’re fans of Merrel ) or shoes for the times you are on deck of the ship. You will spend a lot of time outside on the ship of your Antarctica Expedition because Antarctica is so darn beautiful! There will be times when you will go through the Lemaire Channel and spend the entire day outside watching the landscape unfold and there will be times when you will eat out on deck. Bring along a pair of non-slip shoes or hiking boots for safety outside. \nPack another pair of shoes for indoors unless you want to live in your outdoor shoes, that will do just fine. Closed toed and non slip are preferable for indoors. It gets rocky especially while crossing the Drake Passage. You want something for support so you can leave the flipflops at home this trip. \nSo, you’ve now just eliminated boots, parkas and a heavy fleece jacket. It’s a pretty light suitcase indeed. Socks: This is something we didn’t skimp on. We like our feet to be warm. Warm socks were so important especially when kayaking. \n1-2 Pairs of liner socks 3 pairs of heavy wool thermal socks to wear over liner socks 2 pairs of thick wool socks to wear with shoes or hiking boots on deck and to wear under heavy socks on a very cold day. Hats and gloves and accessories Lived my Canada Goose Aviator hat. \n2 warm hats of different weights: Sometimes it will be warmer out and you won’t want that heavy lined winter hat, but sometimes it will be freezing so you will want something warmer. Pack a hat that covers your ears and is snug to your head. You don’t want it blowing off in the wind. I’m a fan of the Canada Goose Aviator’s Hat \n2 pairs of waterproof gloves: We always say two pairs because it’s good to have back ups. \n1 pair of mittens: for the really cold days, I liked wearing mittens with a pair of liner gloves out on the zodiac. I couldn’t take photos with my gloves on anyway, so I’d just pop the mittens off to snap some shots. With mittens, I made sure they were waterproof and wore liner gloves with them. Fleece Dickies kept our neck warm the whole time. \n2 Fleece Dickies: Necks can get cold so bring along a dicky or buff. I’m not a fan of scarves as they can get caught on things, but a dickie is snug to your neck and can keep your chin warm too. I bring two because sometimes you are out 2-3 times a day, if it’s built up with snow, or dew from your breath, you may want to wear a warm and dry on on the next excursion. Never underestimate the importance of good sunglasses. \n2 pair Sunglasses: It’s important to protect your eyes. Bring 2 pairs of UV sunglasses. We are huge fans of Switch Sunglasses, we can switch out lenses easily depending on the light and the day. We always say 2 because it’s important to have a backup. I’ve broken sunglasses on other expeditions and been grateful of having a back up plan. Clothing on board \nOur Antarctica Cruise was one of the posh-ist cruises in the South on board the beautiful Sea Spirit.We had 4 course dinners with linen table clothes every night. But this cruise does not require a formal night. An Antarctica Cruise in a relaxed cruise. You are going to be on board with a bunch of adventurers and well-travelled people. Leave the formal wear at home and go to dinner in something comfortable and warm. Comfortable and warm. That is how we roll. \nHowever, we have heard that there are some more luxury liners starting to cruise to Antarctica, they may have a formal night, so just check with your expedition company before you go. It won’t be the same as a formal night to the Caribbean though, a jacket may be all the men need and maybe a skirt for woment. \nWe lived in cargo or hiking pants. Nobody will care or notice if you wear the same thing over and over. So pack light. \n2 pairs of pants 2 shirts: Collared shirts for the men, something smart for the ladies. 2 sweaters 2 T-Shirts \nDon’t forget your bathing suit to do the polar plunge! The Sea Spirit also had an on board hot tub that was perfect to relax in after a long day outside. Woo Hoo! A leap of faith! \nYou don’t need a lot of clothes for an Antarctica Cruise. You spend most of your days outside exploring the continent be it on zodiac, kayak or hiking. At night you will be too exhausted to stay up late and will just have enough time to dine and enjoy a night cap before turning in for that early morning wakeup call. Dress comfortably and warm and have fun! Toiletries \nSunscreen: Yes the sun is strong even in Antarctica Chapstick Moisturizer: Your skin will be dry in Antarctica Other things you may not think of packing \n-Quark Expeditions’ the Sea Spirit had a lot of plugs for charging camera batteries, but not all ships are created equal, so bring a power bar so you can charge everything at once. You don’t want to miss out on one single picture. \nExtra camera – Have a good backup camera. More than one person had a camera stop working due to being out in the wet and cold. Have a backup camera so your trip isn’t ruined. Tip: Bring large ziplock bags to seal your camera in before you enter the ship. That way your camera will warm naturally without forming condensation. Photography is an entire other post for antarctica travel, we posted a link at the top of the page to an article we wrote for Quark Expeditions, but you can also check out what photography gear we brought with us to the 7th continent here. \nRemember, Quark Expeditions is having a huge sale where you can save up to $7894 per person on select Antarctica Voyages, 25% off other bookings. Details here! and Happy Antarctica Travels! Or book within the next 5 days and save 50% on select voyages!", "external_links": [], "published": "2015-09-21T12:00:00.000+03:00", "crawled": "2015-09-21T16:23:29.794+03:00", "highlightTitle": ""}