{"organizations": [], "uuid": "3d2914c48476d5c15e879d358fcb513e4fc2063e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/06/american-airlines-300x166.jpeg", "site_section": "http://www.travelandtourworld.com/news/article/category/airlines/", "section_title": "Airline News| Travel and Tour WorldTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/american-airlines-to-webcast-presentation-at-cowen-and-companys-8th-annual-global-transportation-conference/", "country": "US", "title": "American Airlines To Webcast Presentation At Cowen And Company's 8th Annual Global Transportation ConferenceTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "American Airlines To Webcast Presentation At Cowen And Company's 8th Annual Global Transportation ConferenceTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-03T03:00:00.000+03:00", "replies_count": 0, "uuid": "3d2914c48476d5c15e879d358fcb513e4fc2063e"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/american-airlines-to-webcast-presentation-at-cowen-and-companys-8th-annual-global-transportation-conference/", "ord_in_thread": 0, "title": "American Airlines To Webcast Presentation At Cowen And Company's 8th Annual Global Transportation ConferenceTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "American Airlines To Webcast Presentation At Cowen And Company’s 8th Annual Global Transportation Conference\nLow-cost airline Norwegian has increased the amount of rewards companies can earn on all flights. Flights to long-haul destinations are also now included for the first time offering a huge boost to business travellers using Norwegian’s links to key business destinations like New York, LA and Boston.\nNorwegian offers some of the most generous reward schemes in the skies, allowing passengers and companies to earn CashPoints which can be used to make cost savings on all Norwegian flights at any time.The level of CashPoints companies can earn has now been increased in Norwegian’s two corporate agreements for companies to sign up to at Norwegian.com:\nThe Corporate Bonus scheme, where companies earn rewards for all flights booked by the company, their employees or through their travel agency. Rewards on the Corporate scheme have now been increased allowing companies to earn 12% CashPoints on Premium and Economy Flex tickets to all destinations.\nThe Direct Discount scheme, where companies can enjoy an immediate discount applied to every flight a company books. The Discount scheme has now been increased, allowing companies to earn an 8% discount on Premium and Economy Flex tickets to all destinations.\nLars Sande, SVP of Sales and Distribution at Norwegian said: “No other airline can offer a compelling low-cost business travel proposition like Norwegian. Our business customers can enjoy brand new aircraft equipped with free WiFi on all European flights and we fly direct to the world’s top business destinations including London, New York and Berlin at affordable fares.\n“With this in mind, we are making business travel even more accessible by increasing the number of rewards companies can earn. By also allowing businesses to earn rewards from flying long haul to cities like Boston from May 2016, companies can benefit from their loyalty and remain productive while flying high with us.”\nSource: – American Airlines", "external_links": [], "published": "2015-09-03T03:00:00.000+03:00", "crawled": "2015-09-03T18:24:05.778+03:00", "highlightTitle": ""}