{"organizations": [], "uuid": "5ea4a6b98499bf6e74a59794b4a7f3f5bee0dc3d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.hindustantimes.com", "main_image": "http://www.hindustantimes.com/Images/2015/5/053d3050-9806-416a-b307-bedb55acf0a5MediumRes.JPG", "site_section": "http://feeds.hindustantimes.com/HT-Fashion", "section_title": "Latest Fashion and Travel Gossip, Sex & Relationships and Art & culture, Health & Wellness, other Life And Style news", "url": "http://www.hindustantimes.com/brunch-stories/here-s-how-stars-segue-into-style-divas-with-the-right-gown/article1-1387487.aspx", "country": "US", "title": "Here's how stars turn into style divas with the right gown", "performance_score": 0, "site": "hindustantimes.com", "participants_count": 0, "title_full": "Here's how stars turn into style divas with the right gown", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T18:02:00.000+03:00", "replies_count": 0, "uuid": "5ea4a6b98499bf6e74a59794b4a7f3f5bee0dc3d"}, "author": "", "url": "http://www.hindustantimes.com/brunch-stories/here-s-how-stars-segue-into-style-divas-with-the-right-gown/article1-1387487.aspx", "ord_in_thread": 0, "title": "Here's how stars turn into style divas with the right gown", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "| Updated: Sep 06, 2015 10:25 IST \nThe scene: the Festival de Cannes 2015. The red carpet has been rolled out, the paparazzi have assembled, the stars have begun to arrive – waving, smiling, blowing kisses at the cameras. In the midst of it all, someone quite unfamiliar on the international scene makes an appearance. Wearing a baby pink strapless gown with a peplum waist and a fishtail back, she walks in coyly. All heads turn towards her and the air buzzes with the sound of a thousand clicking shutters. (Photo courtesy: Nimrat Kaur - Monisha Jaising; Deepika Padukone - Gaurav Gupta; Richa Chadda - Getty Images; Bipasha Basu - Rocky S) Richa Chadda, of offbeat roles in Gangs of Wasseypur, Fukrey and Masaan , who never figured on the style radar before – except for the time she wore a hideous black dress and irked the fashion police – suddenly ends up grabbing the headlines the next day. And for all the right reasons. A new fashionista is born! \n“We never expected her to carry off that gown with such elan,” says Indian designer Rocky S. But this wasn’t the first time that a gown on the red carpet had made a style icon out of a previous nobody. In 2000, at a time when stars would make red carpet appearances in casual dresses and boring pantsuits, American actress Halle Berry wore a stunning white Valentino gown to the Golden Globes. The tables turned, the dress became a game-changer and Berry ended up bagging the role of the next Bond girl in Die Another Day . Since then, the gown has become the outfit of choice for almost all red carpet appearances. And the red carpet itself has become, as the New York Times put it, “a billboard for designers, who reap hundreds of thousands of dollars in free advertising, and turn unfamiliar names like Elie Saab and Naeem Khan into covetable luxury brands”. Indian designer duo Gauri & Nainika would know. It was their baby pink gown on Richa Chadda at Cannes that cemented their reputation as one of the most sought-after labels for elaborate bespoke gowns in the country. Speaking to Brunch , Gauri Karan recalls the time a decade or so ago when gowns were still a foreign concept and the Indian red carpet only saw saris and lehengas. “When we first did a show of red carpet gowns in 2005 or ’06, everyone asked us ‘Who’s going to wear these in India?’ In fact, some people in the media didn’t even cover the show because they said it wasn’t relevant to this country,” she laughs. “But then the mindsets started changing. People started becoming aware of international names and trends, thanks to social media and overseas travel. Global brands began making a foray into India.” Stylists were still not a phenomenon and fuelled by coverage of all the red carpet success stories abroad, Indian actresses started approaching these designers in person. “I remember Bipasha Basu had seen a gown in a magazine. She was going abroad and wanted something international,” Gauri says. “When we did some gowns for Aishwarya Rai, she was awed. ‘We don’t get such clothes in India,’ she told us. Bipasha and Aishwarya were in fact the first stars in India to start wearing gowns on the red carpet.” Rocky S was one of the first to jump onto the bandwagon and make some memorable gowns for the red carpet. One of his earliest such creations was a sexy red drape gown for Bipasha at the 2007 IIFA Awards in Sheffield, UK. “The whole red carpet scene has changed so much in the last four-five years. It’s become like a fashion forecast for the masses,” he says. “Earlier people used to follow what actors wore in movies, now they follow what they wear on the red carpet. The whole dynamic has changed; now more than the fashion weeks or the movies, it’s the red carpet where brands and trends are more vigorously promoted. Most of our actresses now become fashion icons because of the red carpet, not because of their films.”Aishwarya Rai is perhaps the biggest such icon to have emerged from the international red carpets of Cannes. Her many looks at the film festival over the years have been scrutinised, dissected, analysed and written about by fashion vultures. Her outfits have been dismissed, condemned, praised and glorified, all in equal measure. Sonam Kapoor, Deepika Padukone, Priyanka Chopra are a few other movie stars who’ve been elevated to the status of fashionistas because of their red carpet appearances. And their outfits have managed to catch the fancy of the masses, so much so that you can spot a Sonam gown at a cocktail party, a Deepika rip-off at a reception or an Aishwarya hit at a poolside gala. But celebrity stylist Rick Roy has a word of caution, “I have seen people wearing strange gowns at weddings. You will find women wearing churas and gowns on a holiday! Know your body type, know what works for you, know the occasion and then choose something. Just because Bipasha is wearing it or Deepika is wearing it, doesn’t mean that you have to. It might not work for you. So don’t just ape the trends blindly.” \nSo does the gown flatter everyone? Can every body type carry off the gown? Should everyone wear a gown just because it’s in vogue? Rocky says, “Appearing on the red carpet doesn’t necessarily mean you have to wear a gown. You really need to have the height, the body language, the personality to wear a gown.” Rick Roy agrees, “I always choose outfits according to the body type. I have styled Kangana, and I have just started working with Vidya. They all have different body types. It might be very trendy to wear a gown but I’d still give an actor a sari if that works for her and makes her look great and comfortable rather than following the trend blindly.” However, his contemporary, stylist Ami Patel, begs to differ, “I think the gown can flatter a large number of body types, because there are so many kinds of cuts. There’s the peplum if you think you’re too heavy around the midriff, there’re silhouettes that flow from below the bust, the princess cut, etc. As long as you’re not obese, a gown should work.” Designer Gaurav Gupta, who is becoming quite the rage for his cocktail dresses and gowns, agrees, “I even make gowns for XXL! It’s more about the personality and we customise our gowns for different body types. One of my gowns that Deepika wore from my Light Fall collection was a particularly huge success. There was a woman with a 44 bust size who ordered it and looked smashing in it.” \nWhile the jury is still out on that, the experts are unanimous about what makes for the perfect red carpet gown. “The red carpet is all about making an impact,” says stylist Nitasha Gaurav. “So the gown needs to have a certain drama that comes from either the colour, the silhouette, the surface detailing or the fabric.” Rocky adds, “It has to have the right sex appeal. It can be showing a lot of back, a little cleavage, can have a train behind. But it definitely has to be floor length, unless you want to show off your legs, in which case it can have a slit.” For Rick Roy, the right gown is about four things: the kind of event it is meant for, the fit, finish and fall. “Half the things that are called gowns are really just long dresses. A gown is more like an exquisite couture piece that is made to measure and hand finished.”Many designers are now departing from these standards and Indianising the gown in terms of silhouettes, fabric and drapes. Monisha Jaising, who is known for her dramatic gowns, has an affinity towards using Indian fabrics like Banarasi and Kanjivaram silks in her red carpet gowns. Besides the thigh-high slits and sexy backless numbers that she’s known for, Jaising also does 3D appliqué embellished gowns, jersey drapes and cut-out monotones. Gaurav Gupta too uses sari references in the silhouettes of his gowns. “If an international eye were to see our gowns, they’d be able to make out an ancient referencing of draping that comes from Indian draping techniques,” he says. Designer Sonaakshi Raaj has taken the fusing of the Western gown with Indian elements to another level with her sari gowns. Sonam Kapoor, Deepika Padukone, Chitrangada Singh and several others have her sari gowns in their closets. “Celebs go for the fit I give to the outfits and because of the innovations I have to offer. I love experimenting and that’s what even celebs like; they do not want to have the same style statement throughout,” says Raaj. Designer Komal Sood too agrees with this trend, “I feel the sari and gown are very close to each other in essence. I’d love to launch a line of glamorous sari gowns.”Whatever the style, the cut, the silhouette or the fabric, one thing is for sure. The gown is the look for the red carpet. And it is here to stay. \nFollow @satarupapaul on Twitter From HT Brunch, September 6Follow us on twitter.com/HTBrunchConnect with us on facebook.com/hindustantimesbrunch Tags", "external_links": [], "published": "2015-09-04T18:02:00.000+03:00", "crawled": "2015-09-06T18:05:17.339+03:00", "highlightTitle": ""}