{"organizations": [], "uuid": "aa30701fe8fd83ff4527f4d576df8e9729ceb428", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eglobaltravelmedia.com.au", "main_image": "http://www.eglobaltravelmedia.com.au/wp-content/uploads/2015/09/unnamed-729-300x200.jpg", "site_section": "http://www.eglobaltravelmedia.com.au/feed/", "section_title": "Global Travel Media", "url": "http://www.eglobaltravelmedia.com.au/vietnams-first-five-star-all-inclusive-cruises-awarded-for-outstanding-performance/", "country": "US", "title": "Vietnam’s First Five Star All-Inclusive Cruises Awarded for Outstanding Performance", "performance_score": 0, "site": "eglobaltravelmedia.com.au", "participants_count": 1, "title_full": "Vietnam’s First Five Star All-Inclusive Cruises Awarded for Outstanding Performance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-29T17:55:00.000+03:00", "replies_count": 0, "uuid": "aa30701fe8fd83ff4527f4d576df8e9729ceb428"}, "author": "Chisa Boonmee", "url": "http://www.eglobaltravelmedia.com.au/vietnams-first-five-star-all-inclusive-cruises-awarded-for-outstanding-performance/", "ord_in_thread": 0, "title": "Vietnam’s First Five Star All-Inclusive Cruises Awarded for Outstanding Performance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Email \nA new way of experiencing Nha Trang Bay, Emperor Cruises( www.emperorcruises.com ) touched the hearts of the cruise lovers and received a prestigious award from the Annual Guide Awards 2015. \nThe prestigious Annual Guide Awards that was held last Saturday, September 19, 2015, at the Gem Centre in Ho Chi Minh City proved once again that Vietnam’s travel industry has been moving forward and improving in the last decades ever since the country opened up to tourism. With hundreds of travel and hospitality industry leaders from all over the country attending the event, the Guide Awards was nothing but a night full of new ideas and inspiration to fuel up the country’s future vision. \nEmperor Cruises ( www.emperorcruises.com ), Vietnam’s first and only five star all-inclusive cruises to operate in Nha Trang Bay, has been highly recognised and named as “The Best Cruises in Nha Trang Bay, Vietnam” by this years Guide Awards organised by the Viet Nam Economic Times which was held last weekend. Bringing sophisticated travellers to experience the undiscovered wonders of Nha Trang Bay, now everyone can explore the vast oceans and the hidden gems that Nha Trang have always had through the Emperor Cruises’ Discovery Day Cruises and the Sunset Cocktail & Dinner Cruises with five star services. And by the end of the year, travellers can soon experience Nha Trang Bay and Ninh Van Bay even further and longer through the Overnight Cruises & the 3D2N Emperor’s Hideaway exploring both bays in one itinerary. \n“It has been a rollercoaster for all of us at Emperor Cruises ever since the beginning of the journey,” said Mr. Allister Esguerra, Director of Sales & Marketing of the Emperor Cruises. “But of course, as a market disruptor, we have to be prepared with any challenge that may arise anytime. Fortunately for us, we have been very blessed by having the right people in their right positions at the right time. Our team at Emperor Cruises I can say is one of the best group of people in the service industry in Nha Trang City. And we are now preparing everything for the arrival of the Overnight Cruises by the end of the year” , added by Allister. \nWith the new award in hand given by the Annual Guide Awards, the Emperor Cruises team is now excited to work harder and reach the international scene in the months to come by joining the travel trade shows such as the ITB-Asia in Singapore held in October 2015 and the WTM-London in November 2015. The team is now preparing everything to showcase the beauty of Nha Trang Bay as an emerging cruise destination for luxury travellers in Southeast Asia; creating a new market segment for cruising aside from the world famous Ha Long Bay in the north and the Mekong River in the south. Share this:", "external_links": [], "published": "2015-09-29T17:55:00.000+03:00", "crawled": "2015-09-29T21:21:57.076+03:00", "highlightTitle": ""}