{"organizations": [], "uuid": "6ecdae3458ca90d5bccf16b9abecd35bb7937781", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/airportairline/28684-oman-air-become-presenting-sponsor-for-the-nbo-golf-classic-grand-final", "country": "US", "title": "Oman Air become Presenting Sponsor for the NBO Golf Classic Grand Final", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Oman Air become Presenting Sponsor for the NBO Golf Classic Grand Final", "spam_score": 0.0, "site_type": "news", "published": "2015-09-08T16:15:00.000+03:00", "replies_count": 0, "uuid": "6ecdae3458ca90d5bccf16b9abecd35bb7937781"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/airportairline/28684-oman-air-become-presenting-sponsor-for-the-nbo-golf-classic-grand-final", "ord_in_thread": 0, "title": "Oman Air become Presenting Sponsor for the NBO Golf Classic Grand Final", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Oman Air become Presenting Sponsor for the NBO Golf Classic Grand Final Oman Air become Presenting Sponsor for the NBO Golf Classic Grand Final Details Category: Airport & Airline   14:15 Oman Air has announced that the airline will become the Presenting Sponsor for the forthcoming NBO Golf Classic Grand Final. This will be the third year that Oman Air has committed to the prestigious European Challenge Tour tournament as a Presenting Sponsor and Official Airline. After two hugely successful years, the National Bank of Oman Golf Classic, which was the penultimate event on the European Challenge Tour Schedule, has been elevated to become the season-ending NBO Golf Classic Grand Final, which is open only to the top 45 players on the Road to Oman Rankings and is set to be played on November 4-7 at the stunning Almouj Golf, The Wave in Muscat, Oman. \nOman Air has now announced their commitment to the NBO Golf Classic Grand Final as a Presenting Sponsor and Official Carrier for the tournament. The airline will be transporting the 45 qualifiers, their management, caddies and supporters from all over the world to Muscat. “We are honoured and privileged to be the Presenting Sponsor for this prestigious tournament,” said Oman Air Paul Gregorowitsch. “The NBO Golf Classic Grand Final has certainly put the Sultanate on the world golf and tourism map and has created an opportunity for Oman business and tourism to benefit from the exposure the event has brought. Our involvement in the Grand Final is consistent with our support of sport in the Sultanate as an Official Partner to the Oman Football Association. We will be continuing that support through various unique sporting activities in the public village during the NBO Grand Final.” Ahmed Al Musalmi, CEO of NBO, commented: “We are delighted to welcome Oman Air as Presenting Sponsor. They have shown considerable support for the past three years to our commitment to the tournament which has created considerable advantages to international business, tourism and golf for Oman. “The overwhelming success of the National Bank of Oman Golf Classic in 2013 and 2014, helped create the introduction of the Road to Oman Rankings, which has added to the global promotion of the Sultanate as a must-visit business, tourism and golf destination. The Road to Oman has taken in 25 tournaments in 19 different countries worldwide, mixing historic tournaments such as the Barclays Kenya Open and the Rolex Trophy with newer events in developing golfing nations such as Slovakia, Turkey and China. Its global reach has provided a boost to Oman’s golf tourism, showcasing all the benefits Oman has to offer. “We have achieved all this while remaining committed to our National Omani golfers who will compete in the 36-hole NBO Omani Championship, which will be played in conjunction with the NBO Golf Classic Grand Final.” The triumphant winner of the 2015 NBO Golf Classic Grand Final will receive a first prize cheque for $52,800 while the top 15 players on the Road to Oman Rankings following the conclusion of the Muscat event will be promoted to play on next season’s European Tour. The leading player on the Rankings will receive not only the honour of being crowned European Challenge Tour Number One, but a $32,500 share of a $65,000 Bonus Pool for the top three, plus an engraved Rolex watch. As well as Oman Air the 2015 NBO Golf Classic Grand Final is supported by Shangri-La Barr Al Jissah Resort & Spa, Tanuf Water, Wicked Tents and Al Turki. Related articles", "external_links": [], "published": "2015-09-08T16:15:00.000+03:00", "crawled": "2015-09-08T16:43:04.941+03:00", "highlightTitle": ""}