{"organizations": [], "uuid": "ffeb965ea858cfafe105a0e56c641dc5bd8fb494", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/hotel/28969-intercontinental-amstel-amsterdam-small-changes-of-great-importance", "country": "US", "title": "InterContinental Amstel Amsterdam - small changes of great importance", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "InterContinental Amstel Amsterdam - small changes of great importance", "spam_score": 0.0, "site_type": "news", "published": "2015-09-23T12:30:00.000+03:00", "replies_count": 0, "uuid": "ffeb965ea858cfafe105a0e56c641dc5bd8fb494"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/hotel/28969-intercontinental-amstel-amsterdam-small-changes-of-great-importance", "ord_in_thread": 0, "title": "InterContinental Amstel Amsterdam - small changes of great importance", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "InterContinental Amstel Amsterdam - small changes of great importance InterContinental Amstel Amsterdam - small changes of great importance Details Category: Hotel   10:30 The InterContinental Amstel Amsterdam is an imposing and striking building on the banks of the beautiful Amstel river. The hotel first opened its doors in 1867, and with its high ceilings, monumental staircase and shimmering chandeliers, has been praised ever since for its regal presence and homely warmth. This prestigious hotel is located in the capital city of the Netherlands close to the financial and cultural center. \nThe Royal Carre theatre and the Hermitage Amsterdam museum are situated within walking distance from the hotel. While the Rijksmuseum, the Van Gogh Museum, the Concertgebouw, the Stedelijk Museum, Amsterdam's most luxurious shopping street P.C. Hooftstraat and the Anne Frank House are a short taxi ride away. Green Globe has congratulated the InterContinental Amstel Amsterdam on its recent recertification in recognition of the dedication by management and staff to sustainable practices. Anita Bos, General Manager at the InterContinental Amstel Amsterdam said, “The future lies in our own hands. That's why we shouldn't, for example, condone waste and take steps ourselves for running our business responsibly. It's not a case of doing something substantial, many small changes are just as important.\" The hotel works with Green Engage, IHG’s in-house global sustainability program to devise green strategies that encompass the hotel’s overall management and operations. The IHG Green Engage online system measures energy, waste and water use. This information is then used by hotel management to set reduction targets for each area. To reduce electricity consumption, an energy saving building management system (P.R.I.V.A.) is in place that also manages air treatment. In addition, the property utilizes LED lighting, 90% of kitchen equipment is induction based and the hotel building itself has insulated double glazed windows. Adjustable taps in guest rooms for reduce water consumption. And the hotel encourages guests to participate in its linen and towel reuse initiative to lower water and energy usage. To limit the property’s impact on the environment, waste is separated in eight different ways. And non-recyclable garbage is compressed in waste compactors thereby reducing landfill volume and transportation costs. Furthermore, the hotel uses the ICOVA group to collect and process waste in a responsible way. “Together with the team I am delighted that we received a re-certification for the Green Globe program. During the year we have participated in several sustainability programs. Last May we proudly started our inaugural Worm Hotel in our Garden that remained here for several months. It is a special local project that emphasizes the importance of healthy soil,” added Anita Bos. The Worm Hotel program promotes the benefits of worm farming that produces soil rich in nutrients from ordinary organic vegetable waste. By participating in this project the Worm Hotel at the InterContinental Amstel Amsterdam provides just one example of what needs to happen on a larger worldwide scale. Related articles", "external_links": [], "published": "2015-09-23T12:30:00.000+03:00", "crawled": "2015-09-23T13:00:50.032+03:00", "highlightTitle": ""}