{"organizations": [], "uuid": "926bf638a64be123d844be5738df333d07dd740c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.nationmultimedia.com", "main_image": "http://www.nationmultimedia.com/new/2015/09/16/travel/images/30268897-01_big.jpg", "site_section": "http://www.nationmultimedia.com/home/rss/travel.rss", "section_title": "NationMultimedia.com - Travel", "url": "http://www.nationmultimedia.com/travel/Buffaloes-on-the-run-30268897.html", "country": "TH", "title": "Buffaloes on the run", "performance_score": 0, "site": "nationmultimedia.com", "participants_count": 0, "title_full": "Buffaloes on the run", "spam_score": 0.0, "site_type": "news", "published": "2015-09-15T21:00:00.000+03:00", "replies_count": 0, "uuid": "926bf638a64be123d844be5738df333d07dd740c"}, "author": "", "url": "http://www.nationmultimedia.com/travel/Buffaloes-on-the-run-30268897.html", "ord_in_thread": 0, "title": "Buffaloes on the run", "locations": ["THAILAND"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Home » travel » Buffaloes on the run AROUND THAILAND THE NATION September 16, 2015 1:00 am \nBuffaloes on the run You'll be surprised - and terrified - at the beasts' terrific speed but poor sense of direction. Buffaloes on the run Thai water buffaloes might not be as aggressive as Spanish bulls but they can certainly give the bulls a good run for their money and they're a lot more fun. Chon Buri province, about an hour’s drive east of Bangkok, is hosting its annual Buffalo Races from October 24-26. Race day is October 26 when. beefy buffaloes, skinny buffaloes and white buffaloes will race against each other over a 100-metre-long grassy strip, leaving a huge cloud of dust in the air. You'll be surprised - and terrified - at the beasts' terrific speed but poor sense of direction. Spirit of the sea Hua Hin, Prachuap Khiri Khan Province celebrates the spirit of the sea on September 26-27 with a little-known rite that has been practised in local Chinese and fishing communities for more than 100 years. The ceremony pays homage to lives lost to the sea and is centred on San Chaomae Taptim, the revered shrine in the resort town - where local fishermen build a \"boat of fortune\". Cultural shows will take place at night before the fishermen release the boat into the sea.. Seafood sensations Cha-Am, the much-loved beach town in Phetchaburi province, is now playing host to the annual seafood extravaganza known as \"Kin Hoy Duu Nok Took Muak\". Running through to Saturday, it features freshly fished mussels, oysters, lobster, squid and red snapper in a variety of dishes - often simply steamed with herbs or pan-fried - guaranteeing you will eat more than you deserve! The festival also offers squid hunting and bird watching to improve the digestion. Cha-Am is about two hours drive to Bangkok’s South. Training deal inked with Boeing Thai Airways International recently signed a pilot training agreement with Boeing, under which Boeing Flight Services, a business unit of Boeing Commercial Aviation Services, will provide flight training for the Thai Airways International's 787-8 fleet at Boeing's Singapore campus. The deal will provide the airline with training for nearly 50 crewmembers by the end of the year. Thai Airways took delivery of its sixth B787-8 in August and is waiting delivery of two 787-9s in 2017. 191 Viewed", "external_links": [], "published": "2015-09-15T21:00:00.000+03:00", "crawled": "2015-09-16T03:57:43.638+03:00", "highlightTitle": ""}