{"organizations": [], "uuid": "eced16ee19d0c6f1624a58ba304e7d40ae925c41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/Guinness-Storehouse.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/global-travel-news/", "section_title": "GLOBAL TRAVEL NEWSTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/guiness-storehouse-is-named-europes-leading-tourist-attraction/", "country": "US", "title": "Guiness Storehouse is named Europe’s Leading Tourist AttractionTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Guiness Storehouse is named Europe’s Leading Tourist AttractionTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "eced16ee19d0c6f1624a58ba304e7d40ae925c41"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/guiness-storehouse-is-named-europes-leading-tourist-attraction/", "ord_in_thread": 0, "title": "Guiness Storehouse is named Europe’s Leading Tourist AttractionTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Guiness Storehouse is named Europe’s Leading Tourist Attraction\nThe GUINNESS STOREHOUSE® has been named ‘Europe’s leading tourist attraction’ in the prestigious World Travel Awards. Hailed as ‘the Oscars of the travel industry,’ and decided by an open vote, the award was presented to the Guinness Storehouse last weekend at the European Gala Ceremony in Forte Village, Sardinia which was attended by hundreds of tourism and hospitality leaders from across the world.\nShortlisted alongside some of Europe’s most historic and recognisable attractions including the Acropolis, Athens; Buckingham Palace, England; La Sagrada Familia, Spain; Ribeira do Porto, Portugal; the Roman Colosseum, Italy and the Eiffel Tower, France; it was Ireland’s top tourist spot that won the largest public vote.\nNow in its 22nd year, the World Travel Awards is widely acknowledged across the globe as the ultimate travel accolade.\nCommenting at the Awards Ceremony, Chris Frost of the World Travel Awards said: “For 22 years the World Travel Awards have been recognising the very best consumer experiences across the globe; from Hotels, and Resorts, to Airlines and Destinations. This year some of the most fantastic attractions in Europe were shortlisted. The Guinness Storehouse is one of these. To win this category is a real achievement and a testimony to the Guinness Storehouse as a global brand.”\nAs Europe’s leading tourist attraction, The Guinness Storehouse is now put forward for the World Travel Awards Grand Final, where it is in the running to be named as the world’s leading tourist attraction. Other attractions in the running will be announced in the coming weeks as regional ceremonies take place.\nSince opening its doors in 2000, the Guinness Storehouse, a seven storey treasure trove of all things Guinness, has welcomed in excess of 13 million visitors.\nThe Guinness Storehouse is the Home of Guinness, where you will learn about the incredible brand history stretching over 250 years. Visitors to the Guinness Storehouse can discover what goes into the making of each and every pint, learn how to pour the perfect pint in the Guinness Academy, step into the wonderful world of Guinness advertising in the newly opened advertising exhibit and enjoy the best 360 degree view of Dublin city in the Gravity Bar, the highest bar in Dublin city.\nSource:- Ireland", "external_links": [], "published": "2015-09-11T03:00:00.000+03:00", "crawled": "2015-09-11T09:07:51.401+03:00", "highlightTitle": ""}