{"organizations": [], "uuid": "05051141884cb55e312a67a6e16e02820c72da76", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30023711/fall-for-connecticut-with-brilliant-foliage-display-expected-along-with-seasonal-fairs-and-culinary-delights", "country": "US", "title": "'Fall for Connecticut' with Brilliant Foliage Display Expected Along with Seasonal Fairs and Culinary Delights", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "'Fall for Connecticut' with Brilliant Foliage Display Expected Along with Seasonal Fairs and Culinary Delights - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T03:00:00.000+03:00", "replies_count": 0, "uuid": "05051141884cb55e312a67a6e16e02820c72da76"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30023711/fall-for-connecticut-with-brilliant-foliage-display-expected-along-with-seasonal-fairs-and-culinary-delights", "ord_in_thread": 0, "title": "'Fall for Connecticut' with Brilliant Foliage Display Expected Along with Seasonal Fairs and Culinary Delights", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " Connecticut Office of Tourism\nWith the longest fall foliage season in New England that lasts into early November, Connecticut offers a spectacular backdrop for fun, adventure, vibrant photos and endless memories\nHARTFORD, Conn. , Sept. 14, As autumn approaches, the Connecticut Office of Tourism extends an invitation to \"fall for Connecticut \" with an amazing fall foliage display expected and a range of attractions from leaf peeping in a Berkshire Balloons hot air balloon in Plainville to family fun in corn mazes at Lyman Orchards in Middlefield to taking in discounted fall theatre performances and toasting the season with signature cocktails throughout the state. Connecticut offers the perfect overnight or day trip this season with so much to see and do within short proximity.\n\"Call us biased, but we think Connecticut has the most beautiful fall foliage in the country,\" said Randy Fiveash , director, Connecticut Office of Tourism. \"And, with the distinct advantage of the longest foliage season in New England that lasts into early November, there's plenty of time to explore the state and enjoy hundreds of festivals, events, seasonal activities and several new attractions.\"\nAccording to Connecticut state foresters, the state is poised to present a brilliant display of colors in an ideal foliage season this year with the peak period spanning from October 3 through November 14. For an up-to-date look at regional breakouts throughout the season, visitors can also plan ahead by checking out The Connecticut Department of Energy and Environmental Protection's (DEEP's) Foliage Report Map .\nConnecticut offers classic attractions that are favorites for families and welcomes numerous new attractions, destinations and activities across the state this season and beyond.\nNew Fall Finds in Connecticut\nThe Connecticut Signature Cocktail Trail: Cheers to the new season! Travelers can savor some of the best signature cocktails this fall, courtesy of the new Connecticut Signature Cocktail Trail that incorporates recommendations from visitors and locals. Grand Reopening of The Wadsworth Atheneum Museum of Art in Hartford : America's oldest public art museum has been undergoing a major renovation since 2010. Aimed to improve the visitor's experience, the project has renewed the museum's historic structures and added 17 new galleries. September 19, 2015 will be the grand finale of the museum's renewal project -the public unveiling and centennial celebration. Grace Farms in New Canaan Opens to the Public: This public park will celebrate the grand opening of its new SANNA River project on October 9 . It will include a 700-seat amphitheater, a library, dining and living room. Thompson Speedway Motorsports Park in Thompson Celebrates 75 th Year Anniversary: As part of the facility's 75 year anniversary celebration, Thompson Speedway Motorsports Park will be holding their 2015 Championship Awards Banquet at Mohegan Sun in Uncasville on Saturday, December 5 . As part of the Awards Banquet cars will be brought into the hall on Saturday morning, and will be on display throughout the awards ceremony. Classic Fall Favorites in Connecticut\nTake in a spectacular theatre performance (Statewide): Now in its second year, the Connecticut Office of Tourism and Flagship Producing Theatres have teamed up to host Play! in CT Fall Theatre Festival during all of October. With a full slate of comedies, dramas, and musicals to choose from, there is something for every theatergoer. Visit the dedicated website ( www.playinct.org ) to book discounted tickets, check out nearby hotels and review a curated list of some of the state's finest restaurants. Climb into fall at Gillette Castle State Park ( East Haddam ) : The park features wooded hiking trails and broad vistas over the woods to see all the colors of the autumn season. The patio at the castle offers a view of the lower Connecticut River Valley featuring a spectacular array of color. Enjoy food and entertainment at a Connecticut country fair (Statewide): Throughout the state, popular agricultural fairs showcase the significance of local farming while bringing the community together for family-fun events, activities, entertainment, live music, handmade crafts, delicious fair food and more. Take in the breathtaking color along The Merritt Parkway (Route 15) : The foliage along the drive is lush any time of year, but it's especially magnificent during peak fall color. Sit back and let someone else drive while you take in the color aboard the Essex Steam Train and Riverboat ( Essex ): Take a 2 1/2 hour old-fashioned steam train and riverboat ride through the Connecticut River Valley. Guests will enjoy a bursting array of red, orange, yellow and gold foliage as they tour the countryside and the Connecticut River. Enjoy fall color at high altitude with Berkshire Balloons ( Plainville ): Berkshire Balloons offers hot air balloon rides daily year round, but they're particularly popular during foliage season. You can even schedule a romantic private couple's flight so you and your loved one can watch the beautiful fall unfold together. See the fall foliage from a unique perspective at Tree Climb Connecticut (Manchester & Coventry): Tree Climb Connecticut offers two kinds of tree climbing classes for those aged 7 to 70. During the class, students will learn to safely tree-climb, sit on branches to get the best views of the fall landscape and then climb down. Explore the trails of the Dinosaur State Park ( Rocky Hill ) : If you're looking to take your family for some leaf peeping, this is the place to be. Beyond the gorgeous views, your kids will love hiking along the wooded trails of the park and seeing Jurassic-period dinosaur tracks that date back 200 years. Take the family apple picking at Lyman Orchards ( Middlefield ): A favorite destination year-round – from country corn mazes to hayrides, pumpkin picking outings and freshly baked apple pies, there is so much to see and do for the whole family. The award-winning Connecticut still revolutionary campaign is continuing in the fall and winter of 2015, building on previous successes since the campaign launched in 2012. Featuring two new television spots and ongoing support through engaging digital creative, the advertisements playfully communicate through unique pairings of identifiable destinations the idea that escaping to Connecticut offers travelers a diverse balance of activities without having to drive too far.\nAbout The Connecticut Office of Tourism\nThe Connecticut Office of Tourism, a division of the State of Connecticut Department of Economic and Community Development (DECD), developed the Connecticut still revolutionary strategic marketing initiative to build pride among residents and bolster the state's reputation as a business and tourism destination. The brand expresses Connecticut's unique ability to offer multi-dimensional experiences through unexpected pairings of destinations within a short drive – from exciting and relaxing to historic and innovative to culture and nature-oriented. Tourism is a $14-billion industry in the state of Connecticut and supports more than 118,000 jobs including 80,000 direct tourism industry jobs statewide, representing 5.3 percent of all employment in the state. For more information, visit www.CTvisit.com and join the Connecticut still revolutionary community on social media via on Facebook , Twitter , Pinterest , YouTube and Instagram .\nLogo - http://photos.prnewswire.com/prnh/20150225/177828LOGO\n releases/fall-for-connecticut-with-brilliant-foliage-display-expected-along-with-seasonal-fairs-and-culinary-delights-300142152.html\n ", "external_links": ["http://www.ctvisit.com/farms-and-gardens/lyman-orchards/summary/5075", "https://twitter.com/CTvisit", "http://www.ctvisit.com/dontmiss/details/7328", "http://www.ctvisit.com/properties/summary?propertyid=1542", "https://www.facebook.com/VisitConnecticut", "http://ctvisit.com/dontmiss/details/191", "http://www.ctvisit.com/", "http://www.youtube.com/user/ConnecticutTourism", "http://photos.prnewswire.com/prnh/20150225/177828LOGO", "http://rt.prnewswire.com/rt.gif?NewsItemId=CG00136&Transmission_Id=201509140900PR_NEWS_USPR_____CG00136&DateId=20150914", "http://www.gracefarms.org/", "http://www.ctvisit.com/getaways/map/city-meets-country-on-route-15/139", "http://www.ctvisit.com/parks-and-forests/gillette-castle-state-park/summary/1469", "https://thewadsworth.org/grandreopening/", "http://photos.prnewswire.com/prnvar/20150225/177828LOGO", "http://www.ctvisit.com/hot-air-balloons/berkshire-balloons/summary/1856", "http://www.prnewswire.com/news-releases/fall-for-connecticut-with-brilliant-foliage-display-expected-along-with-seasonal-fairs-and-culinary-delights-300142152.html", "http://www.ctvisit.com/dontmiss/details/48341", "http://www.pinterest.com/visitct/", "http://www.playinct.org/", "http://www.thompsonspeedway.com/events/championship-awards-banquet", "http://www.ctvisit.com/entertainment/essex-steam-train-and-riverboat/summary/3522", "http://www.xmlnews.org/ns/", "http://instagram.com/ctvisit", "http://www.ctvisit.com/dontmiss/details/49341", "http://www.depdata.ct.gov/forestry/foliage/foliagemap.htm"], "published": "2015-09-14T03:00:00.000+03:00", "crawled": "2015-09-14T16:47:42.740+03:00", "highlightTitle": ""}