{"organizations": [], "uuid": "7df155f0320e56be1dad5a008643709fead030c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.dallasnews.com", "main_image": "http://www.dallasnews.com/lifestyles/travel/columnists/lynn-o_rourke-hayes/20150926-annarbor.ece/BINARY/original/ANnArbor", "site_section": "http://www.dallasnews.com/travel/traveldeals/", "section_title": "Dallas-Fort Worth Travel News and Destinations - News for Dallas, Texas ", "url": "http://www.dallasnews.com/lifestyles/travel/columnists/lynn-o_rourke-hayes/20150926-apple-themed-travel-destinations-are-ripe-for-the-picking.ece", "country": "US", "title": "Apple-themed travel destinations are ripe for the picking", "performance_score": 0, "site": "dallasnews.com", "participants_count": 1, "title_full": "Apple-themed travel destinations are ripe for the picking | Dallas Morning News", "spam_score": 0.0, "site_type": "news", "published": "2015-09-26T23:03:00.000+03:00", "replies_count": 0, "uuid": "7df155f0320e56be1dad5a008643709fead030c0"}, "author": "O'Rourke Hayes", "url": "http://www.dallasnews.com/lifestyles/travel/columnists/lynn-o_rourke-hayes/20150926-apple-themed-travel-destinations-are-ripe-for-the-picking.ece", "ord_in_thread": 0, "title": "Apple-themed travel destinations are ripe for the picking", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Need another reason to love fall? Consider all the ways and places to celebrate apple season.\n1. Yakima, Wash. In 1904, the Johnson brothers accepted the new railroad’s offer to check out the Yakima Valley to plant fruit trees. More than 100 years later, the family still shares their Honeycrisp, Pink Lady, Ambrosia and Red Delicious crops with visitors who relish fresh-off-the-tree apples.\nBaked goods, including pies and quiche, can also be savored by those who venture to this highly productive agricultural region, which is also known for hops and wine.\nContact: johnsonorchardsfruit.com ; yakimavalleytourism.com\n2. Ann Arbor, Mich. Check out the rosy red apples at the local farmers market, where growers from nearby display their handpicked gems. If you love cider and warm, apple-infused baked goods, you’ll also want to stop by the region’s oldest continuously operating cider mill. The family-owned Dexter Cider Mill presses and blends multiple varieties of apples and serves delicious treats with a smile.\nContact: dextercidermill.com ; visitannarbor.org\n3. Harvard, Ill. More than 3,000 trees, in nine varieties, were planted in groups to create a 4-acre apple maze at Royal Oak Farm sure to delight families. Your clan can sample Cortlands, Granny Smiths and other varieties as you stroll down the wide aisles and learn about what it takes to grow and harvest apples.\nStop along the way for educational games, climbing areas and music stations. The maze, part of a 120-acre orchard, appears as a Red Delicious apple with green leaves when viewed from the air.\nContact: royaloakfarmorchard.com\n4. Bayfield, Wis. Heralded as one of the best in Wisconsin, this scenic town’s annual apple festival celebrates Bayfield’s agricultural heritage. You won’t want to miss the grand parade, cider and candy-apple tastings. Work off the extra calories from the plethora of pies, tarts and breads by exploring the biking and hiking trails that offer stellar views of Lake Superior. The festival is Oct. 2-4.\nContact: bayfield.org\n5. Orange County, N.Y. Apple lovers can plan a fall trip to this Hudson Valley region, just 50 miles from Manhattan, where 25 varieties of apples grow on more than 1,000 acres. Stop by Apple Dave’s for luscious fruit plus live music and puppet shows beside scenic ponds and rose gardens.\nThe family-friendly Lawrence Farms Orchard offers carriage rides and the chance to pet farm animals. Or visit the cider tasting room at Soons Orchards. Consider the Warwick Apple Fest, scheduled for Oct. 4, for live entertainment, children’s rides and an apple pie contest.\nContact: orangetourism.org\nLynn O’Rourke Hayes is the editor of familytravel.com.", "external_links": [], "published": "2015-09-26T23:03:00.000+03:00", "crawled": "2015-09-28T06:45:11.156+03:00", "highlightTitle": ""}