{"organizations": ["E.U.", "Crete Half Marathon Greece", "Syros City Trail Race", "Hydra", "Spetses Mini Marathon Closing", "Spetses Mini Marathon", "Porto Katsiki", "Kathisma", "EU", "CNN"], "uuid": "52e8f4fff566f1d4307d0b2be080a347f0721397", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/150923151414-greecerunning21-large-169.jpg", "site_section": "http://rss.cnn.com/rss/cnn_travel.rss", "section_title": "CNN.com - Travel", "url": "http://edition.cnn.com/2015/09/25/travel/greece-islands-running-races/index.html?eref=rss_travel", "country": "US", "title": "Gloriously sweaty Greek island escapes", "performance_score": 0, "site": "cnn.com", "participants_count": 0, "title_full": "Gloriously sweaty Greek island escapes", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T19:12:00.000+03:00", "replies_count": 0, "uuid": "52e8f4fff566f1d4307d0b2be080a347f0721397"}, "author": "", "url": "http://edition.cnn.com/2015/09/25/travel/greece-islands-running-races/index.html?eref=rss_travel", "ord_in_thread": 0, "title": "Gloriously sweaty Greek island escapes", "locations": ["Greece", "Athens", "Cretan", "Lefkada", "Argostoli", "France", "Thrapsano", "Serifos", "U.S.", "Crete Half Marathon", "Ermopouli", "Runningreece", "Syros Island", "Germany", "Lixouri", "Aegean Sea", "Saronic"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": ["Maria Michalopoulou", "Serifos", "Petros Bouchoris", "Hydra", "Marina Coutarelli", "Bouchoris", "Egremni", "Ermopouli", "Houmeri", "Lefkada", "Robert Karalis", "Marissa Tejada", "Voni"], "text": "CNN Leadership <div class=\"banner\" id=\"cnn_300x250_sync_freewheel-rail_0_banner\"><span id=\"cnn_300x250_sync_freewheel-rail_0\" class=\"_fwph\"><form id=\"_fw_form_cnn_300x250_sync_freewheel-rail_0\" style=\"display:none\"><input type=\"hidden\" name=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" id=\"_fw_input_cnn_300x250_sync_freewheel-rail_0\" value=\"ptgt=s&envp=g_js&w=300&h=250&slau=300x250_sync&adUnit=300x250_sync\"></form><span id=\"_fw_container_cnn_300x250_sync_freewheel-rail_0\" class=\"cn-shingle__ad\"></span></span></div> Running the Greek islands By Marissa Tejada, for CNN Updated 1312 GMT (2012 HKT) September 25, 2015 9 photos: Running the Greek islands New wave of tourism – Among new ways crisis-hit Greece is attracting more visitors is by staging sports events on its islands. Running, swimming and other races offer new ways to explore the country's beautiful isles. Hide Caption 1 of 9 9 photos: Running the Greek islands Post-race beers – The 10-kilometer Syros City Trail Race takes in the Cycladean island's hills as well as a maze of marble stairs in the heart of the historic neoclassical town of Ermopouli. Hide Caption 2 of 9 9 photos: Running the Greek islands Crete Half Marathon – It'll take more than faith to get around the Crete Half Marathon. The race on Greece's largest island is expected to attract 2,500 runners. Hide Caption 3 of 9 9 photos: Running the Greek islands Serifos Sunset Race – The tiny island of Serifos, in the heart of the Cyclades group, is the setting for a September race now in its third year. The race sees runners hit the trails as the sun sets over the Aegean Sea. Hide Caption 4 of 9 9 photos: Running the Greek islands Spetses Mini-Marathon – Now in its fifth year, the Spetses Mini Marathon welcomes thousands of international participants. It's now recognized as the most popular Greek island sporting event. Hide Caption 5 of 9 9 photos: Running the Greek islands All ages – Many island races have proved so popular they've added extra events, including runs for children. Hide Caption 6 of 9 9 photos: Running the Greek islands Syros Island – \"Race events allow travelers to discover places they never heard of,\" says Petros Bouchoris, founder of the Runningreece website. \"Imagine you can run over much of an island as its natural landscape unfolds before you.\" Hide Caption 7 of 9 9 photos: Running the Greek islands Hydra – Vehicles are forbidden on Hydra, in the Saronic island group, making its roads idea for runners. But its mountainous landscape is the preferred destination for Greece's trail runners. Hide Caption 8 of 9 9 photos: Running the Greek islands International popularity – Where race line-ups once had zero international competitors, the dozen or so events held across some of the country's best known destinations now pull in thousands from abroad, including runners from the U.S., France and Germany. Hide Caption Greek island getaways are about beach lounging and sleeping in, right? That's just lazy thinking. Racing down ancient trails, cycling over rolling landscapes and swimming competitively across open seas add up to a travel experience that's winning in crisis-ridden Greece. \"In a competitive tourism market, the Greek island race circuit is growing,\" says Petros Bouchoris, founder of Runningreece , the first English-language website to offer up-to-date competition information and race destination tourism packages across Greece. Where race line-ups once had zero international competitors, the dozen or so events held across some of the country's best known destinations now pull in thousands from abroad, including runners from the U.S., France and Germany. \"Race events allow travelers to discover places they never heard of,\" Bouchoris adds. \"Imagine you can run over much of an island as its natural landscape unfolds before you.\" The Spetses Mini-Marathon, now in its fifth year, is the oldest in the circuit. It started as a one-day event with 700 Greek participants. This October, it will welcome more than 10,000 participants with 40% traveling from abroad. \"We started the island race trend and we're proud of the growth,\" says founder Marina Coutarelli. She adds that this year English will be the event's primary language for the first time. 'Bigger and better' \"We started the island race trend and we're proud of the growth. We have the synergy between the public and private sector and locals to make the Spetses event bigger and better each year.\" Robert Karalis, organizer of the first island race in Syros, says he welcomed 120 participants earlier this month. \"Numbers will come. We think success comes from putting it together. In the end, we connect the small island communities to a new concept of tourism in Greece. They love to participate, volunteer and cheer on the runners. It's a very local experience and a different feeling from the city races.\" \"Greece should invest heavily in sport tourism, especially in the islands,\" says Maria Michalopoulou who is co-organizing the upcoming Serifos Sunset Race. \"Islands like Serifos, for example, are marked with historic, even ancient, hiking trails and paths perfect for adventurous sporty tourists to discover. Developing island race tourism is at the starting line, and we believe the possibilities are infinite.\" Here are the top Greek island competitions to watch out for: Serifos Sunset Race On one of the last weekends of the summer, as the warm sun sets over the Aegean Sea, runners will be appreciating the view from a route bordering the island's rocky landscape, untouched bays and wild beaches -- an EU Natura 2000 protected site. Now in its third year, the event has expanded to include swimming races. There's also a children's race. \"Despite rescheduling our race due to the snap elections, we hope to get 200 participants, which is four times the turnout from the first year,\" says co-organizer Maria Michalopoulou. www.serifosrace.com ; September 27-29, 2015 Kefalonia Two Capital Challenge Now in its second year, the Kefalonia Two Capital Challenge Race takes runners along a 32-kilometer stretch that curves around the Ionian island's central bay. The route starts in the city's capital of Argostoli and ends in the main square of the second largest city of Lixouri. A five-kilometer race and children's races are also scheduled. www.gyrakefalonias.blogspot.gr ; October 3, 2015 Crete Half Marathon Greece's largest island will welcome more than 2,500 runners for the first Crete Half Marathon race. The route passes through several scenic Cretan villages, including Thrapsano, Voni, Galata and Houmeri. The run is the latest addition to a roster of annual organized races including a children's race, and five- and 10-kilometer races. www.cretehm.com ; October 4, 2015 Spetses Mini Marathon Closing in on its fifth year, the Spetses Mini Marathon is set to welcome thousands of international participants in what has become the most popular Greek island sporting event. The three-day competition includes a series of runs, children's events and swimming competitions. \"We've gained a loyal following of athletes and we're proud to have more than 350 volunteers. The support is tremendous,\" says founder Marina Coutarelli. www.spetsesmarathon.com ; October 9-11, 2015 Hydra's Trail Event Hydra's traffic-free (vehicles are forbidden) and mountainous landscape is the preferred destination for Greece's trail runners. At Hydra's Trail Event, athletes can compete in a long-distance 25.6-kilometer race that heads up Hydra's tallest peak, Eros, which reaches 590 meters. Hydra's Trail also organizes a 7.5-kilometer race, a 3.9-kilometer downhill race and children's races. www.hydrastrail.gr ; next event: April 2016 Lefkada Green Half Marathon The flat scenic route of Lefkada's annual Green Half Marathon is ideal for long-distance runners seeking a new personal best. The route includes a 17-kilometer stretch through the Lagoon of Lefkada, an E.U. protected Natura 2000 site. It also runs past the island's award-winning beaches including Porto Katsiki, Egremni and Kathisma. Also popular are the children's race and five- and 10-kilometer races. www.greenhalfmarathon.gr ; next event: May 2016 Syros City Trail Race The Syros City Trail Race gives competitors a chance to huff it up hills as well as a maze of marble stairs in the heart of Ermopouli's historic neoclassical town. The 10-kilometer race consists of 3,700 steps. \"It was a big challenge!\" says co-organizer Robert Karalis. \"A Greek island race is designed uniquely for that island. So, in Syros combating hills and climbing steps is part of the experience.\" www.syroscitytrail.gr ; next event: September 2016 Marissa Tejada is an author, travel writer and freelance journalist based in Athens, Greece. She tweets at @tejadamarissa More from CNN Travel", "external_links": [], "published": "2015-09-25T19:12:00.000+03:00", "crawled": "2015-09-25T20:29:58.535+03:00", "highlightTitle": ""}