{"organizations": [], "uuid": "c48030f53b9285fb209a2005d3aef0881250c360", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.bangkokpost.com", "main_image": "http://www.bangkokpost.com/media/content/20150917/c1_696764_150917064837_620x413.jpg", "site_section": "http://www.bangkokpost.com/rss/data/travel.xml", "section_title": "Bangkokpost.com : Travel", "url": "http://www.bangkokpost.com/travel/in-thailand/696764/a-dairy-farm-diary", "country": "TH", "title": "A dairy farm diary", "performance_score": 0, "site": "bangkokpost.com", "participants_count": 0, "title_full": "A dairy farm diary", "spam_score": 0.0, "site_type": "news", "published": "2015-09-16T23:47:00.000+03:00", "replies_count": 0, "uuid": "c48030f53b9285fb209a2005d3aef0881250c360"}, "author": "", "url": "http://www.bangkokpost.com/travel/in-thailand/696764/a-dairy-farm-diary", "ord_in_thread": 0, "title": "A dairy farm diary", "locations": ["Saraburi"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Although often overlooked, visitors to Saraburi may want to visit this significant agricultural site 17 Sep 2015 at 03:47 570 viewed 0 comments NEWSPAPER SECTION: LIFE | WRITER: PICHAYA SVASTI \nGrass fields. - + When it comes to the Muak Lek district of Saraburi and the nearby Pak Chong district of Nakhon Ratchasima, many immediately think of waterfalls, farms, vineyards, milk, steak and curry puffs. Although a large proportion of tourists flock to privately-owned farms and theme parks in the area, they may not know of the country's first dairy farm, despite its importance for agriculture and agro-tourism in Thailand. \nLocated on land plots covering 2,700 rai on both sides of Mittraphap Road, the Thai-Danish Dairy Farm and Training Centre has a lot to offer visitors. Tourists can choose between one-hour farm tours and 2.5-hour farm tours. Activities range from visiting grass fields and forests to milking cows and feeding calves. Saneh Phlaengchantuek, a guide at the farm, said: \"The farm is the brainchild of Their Majesties the King of Thailand and King Frederick IX of Denmark after the King and Queen of Thailand visited Denmark in 1960.\" \nOn Jan 16, 1962, the King of Thailand and King Frederick IX of Denmark inaugurated the Thai-Danish dairy farm. In 1971, the farm and training centre became one of the state enterprises under the Ministry of Agriculture and Cooperatives and became known as the Dairy Farming Promotion Organisation of Thailand (DPO), which works for dairy industry support and development. \n\"At first, the farm imported and raised Red Dane cattle, which are reddish brown. Thais, therefore, started calling them woadaeng, meaning red cows. Each Red Dane yields 7-8kg of milk per day. At present, more than 400 in this farm are mostly Jersey cows, which yields 15kg of milk per day each. Our champion provides 52kg of milk per day,\" the guide noted. \nAt one point, the Thai-Danish Dairy Farm and Training Centre used to have more than 2,000 cows -- this was when there was no other dairy farm in Thailand. It later educated local farmers to run dairy farms and would buy raw milk from them while still producing milk. \nIt currently buys 600 tonnes of raw milk out of a total 2,800 tonnes of raw milk that is produced nationwide, which accounts for only 48% of the total demand. Many milk factories have to therefore import milk powder to produce milk products. However, all of the milk and dairy products from this farm under the brands Thai-Denmark Milk and woadang are fresh. \nThe Burmese Rosewood forest. \nThis farm is in a very suitable location for dairy farming, as it is on a plain and surrounded by mountains, with plenty of water and good weather. It is situated about 200m above sea level. The soil is fertile and the average volume of rainwater is between 1,000-1,100mm per year. The average temperature here is 26C. After the briefing, our group boarded a farm tour tram. A few minutes later, we reached a big rock containing fossils of water plants dating to 250 million years ago. This proves that the area had once been under water. On the left side of this route are organic vegetable farms, while the hills on the right side have numerous kinds of herbs. \nThe next stop for us was the farm's grass fields covering 1,000 rai, which is a popular location for shooting television series and movies, especially those about love. \nThis grass field yields Guinea, Star, Ruzi and Yacon grass and Hamata beans for cows to eat. Each rai yields about 6,000kg of grass and beans per year. The excess is preserved and kept as silage and hay. \nWe then went to a view point, which is the highest area of the farm. Looking forward, we saw the farm's first milking facility from a distance. \nAfter that, we travelled through the Burmese Rosewood forest that has more than 10,000 naturally growing trees. It is considered one of the country's most abundant Burmese Rosewood forests. Several of these trees are so big it needs three people to hold hands in circle around them. The DPO tries its best to conserve the forest and grow more trees. Every year, Forestry Department officials come to collect seeds to distribute to the public so that they may grow elsewhere. \nUnfortunately, this forest will soon become a thing of the past since it has been marked for land expropriation under a motorway project, according to the guide. \nIn the farm's nature camp zone is a natural fountain that runs into the Muak Lek Stream that originates from Khao Yai National Park and divides Muak Lek and Pak Chong. \nFinally, it was time for the highlight of the day -- milking a cow and feeding calves. Visitors will then be able to observe the making of fertiliser from milk; enjoy a lasso and cowboy show; and visit a small zoo with sheep, goats, camels, ostriches, along with other animals. All that is left to do is, of course, buy delicious fresh milk and yoghurt for yourself, family and friends. The fee for the one-hour tour is 120 baht for adults, 100 baht for university students, 70 baht for children and free for kids whose height is under 90cm. Fees for the 2.5-hour tour, which includes looking at fossils and enjoying the view point, forest and fountains, including the regular programme is 150 baht for adults, 130 baht for university students and 100 baht for children and students. Visit ww.dpo.go.th or www.facebook.com/farmkonom or call the farm on 036-345-188 or 036-344-926. \nA visitor milks a cow. Tell us what you think about this article Like dislike 5 people liked / 0 people disliked it Share this article", "external_links": [], "published": "2015-09-16T23:47:00.000+03:00", "crawled": "2015-09-20T10:24:55.020+03:00", "highlightTitle": ""}