{"organizations": [], "uuid": "94c7391d4ab77f1f9446d59d67fc04f85a3a7e53", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.menafn.com", "main_image": "http://www.menafn.com/updates/pr/2015-09/online_e1b45cf4-abbc-4f66-8fa5-7aea6e2e3ac98ac2588d44ca69fe147a8dc13bb1899f.jpg", "site_section": "http://www.menafn.com/rss/menafn_Hospitality_Tourism.xml", "section_title": "MENAFN.com Travel & Tourism", "url": "http://www.menafn.com/1094354014/Muta-Products-is-Ending-its-Special-Promotion-this-Friday?src=RSS", "country": "US", "title": "Muta Products is Ending its Special Promotion this Friday", "performance_score": 0, "site": "menafn.com", "participants_count": 1, "title_full": "Muta Products is Ending its Special Promotion this Friday | MENAFN.COM", "spam_score": 0.0, "site_type": "news", "published": "2015-09-25T03:00:00.000+03:00", "replies_count": 0, "uuid": "94c7391d4ab77f1f9446d59d67fc04f85a3a7e53"}, "author": "Press", "url": "http://www.menafn.com/1094354014/Muta-Products-is-Ending-its-Special-Promotion-this-Friday?src=RSS", "ord_in_thread": 0, "title": "Muta Products is Ending its Special Promotion this Friday", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(MENAFN Press) Muta Products is Ending its Special Promotion this Friday Only 24 hours left to buy the Muta Bike Lights set for only 14.97 \nPDF to JPEG Converter TimeZone Converter PDF to JPEG Converter Online PR News – 24-September-2015 – Muta Products already a well-known 5* seller on Amazon for bicycle lights is announcing the end of its special promotion on Friday September 25. The Muta Bike Lights Set became very popular amongst bike lovers who expressed their appreciation by leaving 5* reviews. Below you can read some of the product reviews customers wrote on our Amazon page.\nWow... what a great bike light. This is one bright white light from Muta Products. It is great that it has an adjustable focus as well! This light comes with a slide in AAA adapting kit just in case you do not have an L-Ion battery. By Nina\nThis is the neatest bike light ever! I got this Ultra Bright LED Bicycle Light by Muta Products for my son who loves to bike and camp. He has a 4 year old daughter so his biking activities frequently occur after dark so this is perfect for him.By INfireman's wife\nThis has got to be one of the smartest things I have seen in a long time. We live out in the middle of nowhere and my son is always riding his bike up and down the road (we don't have neighbors so its fine) but once it becomes dark he has to come in. Now we don't have to worry about that with this Best Bike Lights LED set. Not only do we have a flash light for the front of his bike he also gets a drink holder for his water bottle and he gets a back light. By Sunshine\nWe are very pleased of how customers received our product. We feel that we achieved our goal of providing a safe and comprehensive bicycle set for all kinds of cyclists whether they are beginners or experienced. said Michael Hartman CEO of Muta Products.\nTo buy the Muta Bike Lights Set at a discounted price please visit Amazon page http://www.amazon.com/Lights-front-Bonus-Bottle-Holder/dp/B010CZZ6SI/ref=zg_bs_194531011_55.\nAbout Muta Products\nMuta Products is a new company run by young and enthusiastic people who are committed to adding value to the market of bicycle accessories in its efforts to help more people live a healthy life. The company estimates that it will be a significant key-player in the market.", "external_links": [], "published": "2015-09-25T03:00:00.000+03:00", "crawled": "2015-09-25T17:57:39.552+03:00", "highlightTitle": ""}