{"organizations": [], "uuid": "6a1ecdfc5fc6b069b94d87637abc6e49debe8fc1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.ticotimes.net", "main_image": "http://www.ticotimes.net/wp-content/uploads/2015/09/150911CubaChurch.jpg", "site_section": "http://www.ticotimes.net/feed", "section_title": "Tico Times | Costa Rica Information | Travel | Real Estate | Hotel", "url": "http://www.ticotimes.net/2015/09/13/for-pope-francis-an-unfinished-mission-in-cuba", "country": "US", "title": "For Pope Francis, an unfinished mission in Cuba", "performance_score": 0, "site": "ticotimes.net", "participants_count": 1, "title_full": "For Pope Francis, an unfinished mission in Cuba", "spam_score": 0.0, "site_type": "news", "published": "2015-09-14T01:01:00.000+03:00", "replies_count": 0, "uuid": "6a1ecdfc5fc6b069b94d87637abc6e49debe8fc1"}, "author": "Robin Kazmier", "url": "http://www.ticotimes.net/2015/09/13/for-pope-francis-an-unfinished-mission-in-cuba", "ord_in_thread": 0, "title": "For Pope Francis, an unfinished mission in Cuba", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "For Pope Francis, an unfinished mission in Cuba NICK MIROFF | THE WASHINGTON POST 2 hours ago From: To: \nAmailia Lopez, 18, sits alone on a pew in the back of Our Lady of Charity, a Roman Catholic church in Havana in January. Sarah L. Voisin/The Washington Post \nHAVANA — Pope John Paul II’s groundbreaking trip to Cuba in 1998 made such an impression on the Rev. Jorge Mario Bergoglio that he wrote a book about it. \nBergoglio’s “Dialogues between John Paul II and Fidel Castro” was published that same year, just a few months after he was named archbishop of Buenos Aires. The book fell quickly into obscurity but since then it has led many to assume Bergoglio — now Pope Francis — was present in Cuba for John Paul II’s visit. He was not. \nBefore he lands in the United States on Sept. 22, Francis will arrive in Havana on Sept. 19 for a four-day, three-city tour of Cuba that will put a spotlight on his political and diplomatic skills as never before. His challenge: to accelerate the process of reconciliation between the United States and Cuba charted by John Paul II and push the Castro government to hasten and deepen the pace of change on the island. \nPHOTOS: Cuba as it was – A glimpse of life before the US arrives \nOn Friday the Castro government announced it would pardon 3,522 prisoners ahead of Francis’ arrival as a “humanitarian” gesture. The amnesty did not appear to extend to jailed political activists, but rights groups said they were trying to determine if any of their comrades would be freed. \nThe government made a similar gesture prior to Pope Benedict’s 2012 visit, freeing nearly 3,000 inmates, and several hundred were released when John Paul II made his trip. \nFrancis’s book about that 1998 visit remains an essential window into the Pope’s thinking about the long U.S.-Cuba standoff and the broader ideological divide it came to symbolize in his native Latin America and around the world. \nThe book was critical of Cuba’s version of authoritarian socialism, but it echoed John Paul II’s call for an end to the punitive U.S. trade embargo. It urged dialogue instead, and the soft-landing approach famously expressed in John Paul II’s appeal for Cuba to “open itself to the world, and for the world to open itself to Cuba.” \nSeventeen years later, that approach has become official White House policy — with guidance from Pope Francis . \nPresident Barack Obama bids farewell to Pope Francis following a private audience at the Vatican, March 27, 2014. (Official White House Photo by Pete Souza) High stakes \nThe pope’s role as an intermediary and peace broker between the Obama administration and the communist government of Raúl Castro will be a major theme of his Cuba trip, which the Vatican says will focus on families and Cuban youth. \n“I think the pope wants to be in places where there is conflict, and he knows that the time has come for the United States and Cuba to overcome their differences,” said the Rev. Roberto Betancourt, the priest at Havana’s Our Lady of Regla church, in an interview. \nBy devoting so much time to Cuba prior to his arrival in the United States, Francis will almost certainly add momentum to the push for Congress to lift Kennedy-era trade sanctions against the island, as President Obama has called for. \nRelated: With embassy open in Havana, U.S. diplomats face a changing mission \nLess clear is how far the pope will be willing to press the Cuban government to embrace democratic reforms to the tightly controlled, one-party system Fidel and Raúl Castro have ruled for the past 56 years. \nMany will be watching for Francis to deliver the kind of tough messages he has directed at the global capitalists he blames for the world’s inequalities. A gentler hand for Cuba’s communists would almost certainly reinforce the perception among conservatives that Francis is a liberal with Marxist sympathies. Conservative dissent is brewing inside the Vatican \nHis career in Argentina — and his 1998 book — belie that view, describing socialism as an “anthropological misreading” of human nature that fails to address man’s spiritual needs, mistakenly believing that the state is the solution to all of society’s problems. \n“Cuba and other nations need to transform some of their institutions and especially their policies, substituting corrupt, dictatorial and authoritarian governments for democratic and participatory ones,” he wrote in the book’s conclusion. “The free participation of citizens in public life, the guarantee of civil and human rights, are an imperative condition for the full human development of all people.” \nRelated: Pope Francis: It’s ‘pure scandal’ that women earn less than men for the same work \nDuring the 18 months of secret talks between U.S. and Cuban negotiators leading up to last December’s announcement that the two countries would restore relations , Francis sent personal letters to Obama and Raúl Castro and hosted high-level meetings at the Vatican. \nJust as importantly, Francis provided Obama the political cover to make sweeping changes to U.S. policy over fierce objections from Cuban American lawmakers. \nOriginally billed as a “stopover,” Francis’s trip on the island will be far more, amounting to nearly half of his time away from Rome. \nHe will be on unfamiliar ground, at least geographically. Federico Wals, a close confidant of Francis and his former press aide in Argentina, confirmed it will be the 78-year-old pope’s first time in Cuba. U.S. bishops say it will be his first trip to the United States as well. \nFrancis will address the U.S. Congress and the United Nations and celebrate Mass at the Basilica of the National Shrine of the Immaculate Conception and in Madison Square Garden, as well as the closing Mass for the World Meeting of Families in Philadelphia, during his Sept. 22 to 27 trip to D.C., New York and Philadelphia. \nBut first Francis will land in Havana and celebrate Mass on Sept. 20 in the city’s Plaza of the Revolution, flanked by a giant portrait of militant atheist (and fellow Argentine) Ernesto “Che” Guevara. \nGovernment buses will bring tens of thousands of Cubans to the square. It is the same place where Pope Benedict spoke during his 2012 visit, and Pope John Paul II in 1998. \nFour-year-old Angeline Viciedo, left, smiles as she watches her 3-month-old sister, Alejandra Salazar, baptized at Our Lady of Charity, a Roman Catholic church in Havana. Sarah L. Voisin/The Washington Post An itinerary and an agenda \nThe church in Cuba has come a long way since then. Christmas and Good Friday are once more national holidays. Religious believers are no longer stigmatized or barred from the Communist Party. The church has received government permission to build new cathedrals for the first time in nearly 60 years. The steady rehabilitation of the church in Cuba’s civic life has made it the only major institution on the island not under government control. \nYet Cuba’s priests say freedom of worship and freedom of religion are not the same. The island remains the most restrictive environment in the Americas for the church. There are no K-12 Catholic schools, and the church does not have its own television or radio broadcasts. \nRelated: Cuban artist pushes boundary between art and politics, and pays a price \nMany here will be watching to see what sort of new concessions Francis may secure from the Castros. The church would like to open a Catholic university and recover properties confiscated by the government in the early 1960s, including the Jesuit prep school, Colegio Belén, attended by Fidel and Raúl Castro. It is now a military academy. \nFrancis’ Cuba itinerary will include a mix of public events and closed-door meetings, including a likely encounter with the 89-year-old Fidel Castro, according to Vatican officials cited in several reports. \nFrancis will also celebrate Mass in Holguín and Santiago de Cuba, the two largest cities in eastern Cuba, and visit the Our Lady of Charity of El Cobre basilica, the island’s most sacred Catholic shrine. Is Cuba on the verge of major political reform? \nCuban President Raúl Castro, 84, has said he plans to be at the pope’s side throughout the trip. After an hour-long private meeting with Francis at the Vatican in May, Castro told reporters he was so impressed with the pope that he was considering a return to the church. \nSuch effusive praise for Francis, and his sky-high popularity here, have left the Cuban government perhaps more exposed than ever to potential public criticism from the pope. As with other papal visits, Francis’s travels around the island are expected to receive streaming coverage from Cuba’s state media, giving him a powerful platform to address the Cuban people directly. \n“It would be a disappointment if the pope doesn’t say in Cuba what he has said in Rome and elsewhere around the world: that all the ideologies of the 20th century have ended up in dictatorships,” said dissident and Catholic intellectual Dagoberto Valdés, editor of the magazine Convivencia , in an interview. \nFrancis arrives in Cuba at a critical moment, Valdes said. “We have normalized diplomatic relations with the United States, but what we need is the normalization of democratic relations between the Cuban government and the Cuban people.” \nPHOTOS: Cuba, US reopen embassies to end 54-year estrangement \nCuban dissidents have requested a meeting with Francis during his visit, asking him to help free jailed dissidents. Rights activists on the island say there are 71 political prisoners in Cuban jails, though their list includes militant Castro opponents serving time for violent attacks. \nMany Castro opponents say Cuba’s church and its leader, Cardinal Jaime Ortega, have been too accommodating to the communist government. Ortega has met regularly with Raúl Castro in recent years, after negotiating the release of more than 100 jailed activists, most of whom left for Spain. \nBut Ortega has avoided a confrontational approach, preferring to work quietly to carve out a greater role for the church in Cuba’s spiritual and public life. \nLike Francis, Ortega is 78 and past the mandatory retirement age for bishops. The two men are kindred spirits in a sense, as survivors of violent Cold War-era ideological conflicts that split their nations in two. \nFrancis preached reconciliation after the Argentine Dirty War that left at least 10,000 dead between 1976 and 1983. Ortega preaches it today across the still-bitter divide of the Florida Straits. \nIt was Ortega who approached the Argentine just before the papal conclave in 2013, when Francis delivered a brief but pointed speech to the College of Cardinals about the evangelical mission of the church, criticizing a Catholic hierarchy he said was “sick” with insularity. \nOrtega was so impressed that he approached his colleague to ask for a copy. Francis handed over some notes and gave Ortega permission to publish the remarks. For many Vatican observers, it was that speech that got Francis elected. \nRead more coverage of Cuba and Pope Francis . \n© 2015 , The Washington Post", "external_links": [], "published": "2015-09-14T01:01:00.000+03:00", "crawled": "2015-09-14T03:07:30.903+03:00", "highlightTitle": ""}