{"organizations": [], "uuid": "e8b8838bf0212fab8ba5a322dcf77f7d869784b4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.usatoday.com", "main_image": "http://www.gannett-cdn.com/-mm-/de1764ee93ff68994ec61e8bcd34eed12f49304c/c=0-308-2100-1494&amp;r=x633&amp;c=1200x630/local/-/media/2015/09/04/USATODAY/USATODAY/635769665991111118-Aitutaki-1---CREDIT-ALL-TO-AITUTAKI.jpg", "site_section": "http://www.usatoday.com/travel/", "section_title": "Travel News, Tips, and Guides - USATODAY.com", "url": "http://www.usatoday.com/story/travel/hotels/2015/09/04/beach-hotels-resorts/71700854/", "country": "US", "title": "Amazing beach resorts around the world", "performance_score": 0, "site": "usatoday.com", "participants_count": 1, "title_full": "Amazing beach resorts around the world", "spam_score": 0.0, "site_type": "news", "published": "2015-09-04T21:50:00.000+03:00", "replies_count": 1, "uuid": "fa98059b15c1d5f865eb809f5761388a8c7fb576"}, "author": "", "url": "http://www.usatoday.com/story/travel/hotels/2015/09/04/beach-hotels-resorts/71700854/#post-0", "ord_in_thread": 0, "title": "Amazing beach resorts around the world", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "The Ritz-Carlton Grand Cayman is located on famous Seven Mile Beach. Ritz-Carlton Grand Cayman Fullscreen The luxe hotel is divided into two buildings. One faces a lagoon, the other faces the ocean. Ritz-Carlton Grand Cayman Fullscreen It’s a glamorous property, but it’s extremely family friendly. Ritz-Carlton Grand Cayman Fullscreen The Harbour Village Beach Club in Bonaire is tucked away on a 4-acre private peninsula, among lush tropical gardens and a silky white-sand beach. Harbour Village Beach Club Fullscreen It’s the perfect jumping-off point for diving at the pristine coral reef and a shipwreck just 50 yards from shore. Harbour Village Beach Club Fullscreen The Hilton Bora Bora Nui Resort and Spa is a favorite among the celebrity crowd. Hilton Bora Bora Nui Resort and Spa Fullscreen The overwater bungalows dotting the shore are stunning. Hilton Bora Bora Nui Resort and Spa Fullscreen Rooms feature Indonesian mahogany canopy beds, Italian marble bathtubs and chirping geckos on the balconies. Hilton Bora Bora Nui Resort and Spa Fullscreen When you want some alone time, request a trip to Motu Tapu, the resort’s own private island. Hilton Bora Bora Nui Resort and Spa Fullscreen The suites at The Mulia in Bali offer private butler service, plenty of space and an extensive room-service list. The Mulia Fullscreen The Oasis pool is flanked by massive statues. The Mulia Fullscreen There are three other equally impressive pools on property. The Mulia Fullscreen Opt for a poolside cabana for some shade or grab lounge chairs right on Nusa Dua beach. The Mulia Fullscreen If overwater bungalows are what you are after, you’ll be head over heels for Likuliku Lagoon in Fiji. Likuliku Lagoon Fullscreen Book way in advance though, these rooms are very popular. Likuliku Lagoon Fullscreen When you’re ready to explore, ask for a tour of the Mamanuca Island chain where the snorkeling is superb and photos are to die for. Likuliku Lagoon Fullscreen You want to be outdoors as much as possible in Hawaii, and Disney’s Aulani Hawaii Resort on Oahu makes that easy. David Roark, Disney Destinations Fullscreen It’s right on Ko Olina beach and offers a slew of classes and activities. David Roark, Disney Destinations Fullscreen Elbow Beach is on a long stretch of southern Bermuda’s shoreline. Elbow Beach Fullscreen The resort has 50 acres' worth of hyper-manicured lawns and gardens. Elbow Beach Fullscreen The Bird of Paradise cottage at Elbow Beach. Elbow Beach Fullscreen The Aitutaki Lagoon Resort & Spa in the Cook Islands deserves to be high on your bucket list. The Aitutaki Lagoon Resort & Spa Fullscreen On Motu Anita, the only private island resort in the Cook Islands, each room is a bungalow. The Aitutaki Lagoon Resort & Spa Fullscreen A bungalow at the Aitutaki Lagoon Resort & Spa. The Aitutaki Lagoon Resort & Spa Fullscreen Like this topic? You may also like these photo galleries: Replay Autoplay Show Thumbnails Show Captions Last Slide Next Slide On Motu Anita, the only private island resort in the Cook Islands, each room is a bungalow. (Photo: The Aitutaki Lagoon Resort & Spa)\n304 CONNECT 90 TWEET 15 LINKEDIN 2 COMMENT EMAIL MORE Labor Day marks the final summer fling for many U.S. beach resorts, as they go dormant after the holiday weekend. If you just can't wait till next year for your sun and sand fix, you may find these exotic beach resorts worth a winter splurge.\nThe Aitutaki Lagoon Resort & Spa, Cook Islands\nThis surreal Polynesian-style escape deserves to be high on your bucket list. On Motu Anita, the only private island resort in the Cook Islands, each room is a bungalow. Start the day with a ukulele lesson or perhaps a coconut-tree climbing show, lei-making or hula dancing lessons. Or snorkel in the coral lagoon. Back at the bungalow, rinse off in the outdoor shower and head to the evening dance show for a traditional feast cooked in the umu kai earth oven on the beach. Choose from mahi-mahi, yellowfin tuna or wahoo and fill up on mango, passionfruit and pawpaw galore. aitutakilagoonresort.com\nHilton Bora Bora Nui Resort and Spa, Bora Bora\nThis resort is a favorite among the celebrity crowd. So it comes as no surprise that The Bachelorette , Amazing Race and Keeping Up With the Kardashians have all filmed there. As you might guess, the overwater bungalows dotting the shore are stunning (plus, you can have room service breakfast delivered by outrigger canoe each morning). But the 1,000-square-foot mountaintop villas are equally amazing. Rooms feature Indonesian mahogany canopy beds, Italian marble bathtubs and chirping geckos on the balconies. When you want some alone time, request a trip to Motu Tapu, the resort’s own private island. It used to belong to Polynesian Queen Teriimaevarua in the late 1800s. But these days guests get to enjoy it with a private chef who prepares a feast at a picnic table set in the water. The fish will tickle your toes as you chow down on grilled lobster, shrimp, shark steak and tuna sashimi. Afterward, your playground is the coral reef just a few flipper kicks away. hilton.com/frenchpolynesia\nHarbour Village Beach Club, Bonaire\nIt’s no surprise that the exclusive Harbour Village scores award after award, year after year. It’s tucked away on a 4-acre private peninsula, among lush tropical gardens and a silky white-sand beach. Plus, it’s the perfect jumping-off point for diving at the pristine coral reef and a shipwreck just 50 yards from shore. Keep your eyes peeled for turtles. Bonaire has three of the world’s seven species. In fact, 138 baby Hawksbills hatched on the hotel’s private beach last year. Villas have secluded lanais and double hammocks perfect for nuzzling up to a loved one. After a day on the beach, continue relaxing at the full-service spa for reflexology, aromatherapy or a therapeutic massage. Come evening, head to La Balandra Restaurant and Bar (designed in the likes of an antique ship), where the only noise is the occasional yacht passing through the kaleidoscope of blue and green waters. Or sign up for a florescent night dive. harbourvillage.com\nThe Mulia, Bali\nWith the comforts of this luxe hotel right on the Indian Ocean, you can be downright sloth-like for days on end. The beachside suites offer private butler service, plenty of space and an extensive room-service list. Once you are ready to venture out of your room, the comfort continues. First, make a beeline toward the turquoise water. On the way you’ll see an epic swimming pool flanked by massive statues (plus, there are three other equally impressive pools on property). Opt for a poolside cabana for some shade or grab lounge chairs right on Nusa Dua beach. Then, start your to-do list: Skim the water’s surface via paddle board or kayak, then top it off with an aqua aerobics class. When hunger hits, dine at Table8, a signature Oriental restaurant serving authentic Cantonese and Szechuan delicacies. Be sure to order tea; it’s an event. A kung fu tea master will stop by your table with a long-nosed brass kettle pouring hot water from afar. themulia.com\nRitz-Carlton Grand Cayman, Grand Cayman\nLocated on famous Seven Mile Beach, this AAA five-diamond property will have you at hello. Upon arrival you’ll see a welcome area resembling an island cottage where a stack of chocolate-chip cookies and fruit punch awaits. The luxe hotel is divided into two buildings. One faces a lagoon, the other faces the ocean. Connecting the buildings is a long, lovely corridor packed with local art. Once you are beachside, activities include boogie boarding, snorkeling and scuba diving. Afterward, snag one of the floating water hammocks where an aqua butler will wade over to bring your drink of choice. Kids and adults will enjoy the Ambassadors of the Environment program, created by Jean-Michel Cousteau, for its kayak trips through the mangroves and night snorkeling excursions. It’s a glamorous property, but it’s extremely family friendly. You can stargaze alongside an astronomer, enjoy a movie night or schedule a kids’ tuck-in, which involves milk, cookies and story time. ritzcarlton.com\nDisney’s Aulani Hawaii Resort, Oahu\nYou want to be outdoors as much as possible in Hawaii, and Aulani makes that easy. It’s right on Ko Olina beach and offers a slew of activities like sand-sculpting classes, hikes in the nearby bamboo forests and outrigger canoe rides, so you can travel like the ancient Hawaiians did. You can even sign up for a three-hour surfing lesson hosted by local firefighters. When you have run out of energy, the spa offers 150 therapies, including traditional Thai massages and Kapa‘i massages, which relieves muscle tension and conditions the skin — and teens have their own spa. The hotel also has the only outdoor hydrotherapy garden on the island. Call it a day with a mai tai in the 'Olelo Room lounge or at a Hawaiian storytelling session around the beachside fire pit. resorts.disney.go.com/aulani-hawaii-resort\nLikuliku Lagoon, Fiji\nIf overwater bungalows are what you are after, you’ll be head over heels for this tranquil South Pacific hideaway. Book way in advance though, these rooms are very popular. Even Lenny Kravitz has stayed in one. Settle into your room, which has a bathtub for two and glass panels in the floor that give you a view of the candy-colored fish below. When you’re ready to explore, ask for a tour of the Mamanuca Island chain where the snorkeling is superb and photos are to die for. This is where Castaway was filmed, and there is a \"Help Me\" sign spelled out in rocks. Be sure to also make a pitstop on Namotu, a small isle that Kelly Slater loves for its giant waves. likulikulagoon.com\nElbow Beach, Bermuda\nThis boutique getaway is on a long stretch of southern Bermuda’s shoreline. And, yes, the sand really is pink. Outside, it’s 50 acres' worth of hyper-manicured lawns and gardens. Inside, the Caprice Cottage has high ceilings, wooden balconies and French doors. Settle into your enormous room and enjoy the enclosed terrace garden. Or head toward the water. Chances are you can grab a solar-powered cabana; there are 84 of them — each perched over the water with glass floor panels. Activities range from golf to horseback rides to nature hikes. And with four restaurants to choose from, you’ll have your pick of everything from Spanish tapas to Mediterranean-inspired seafood. Consider renting a scooter to explore nearby hidden caves or go shopping in Hamilton. Or, if you want bragging rights, charter The Venetian, a 100-foot super yacht. elbowbeachbermuda.com\n304 CONNECT 90 TWEET 15 LINKEDIN 2 COMMENT EMAIL MORE Read //usat.ly/1Uxitxq TOP VIDEOS", "external_links": ["http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769663485875000-Harbour-Village-2---CREDIT-ALL-TO-HARBOUR-VILLAGE.jpg", "http://www.gannett-cdn.com/-mm-/a5e00be98251552013cc840f7e1aafa04cc4c894/c=0-358-2757-1915&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769663506623266-Harbour-Village---CREDIT-ALL-TO-HARBOUR-VILLAGE.jpg", "http://www.gannett-cdn.com/-mm-/a3b86086a14b6407d10db96aa371947c90e8a113/c=0-0-1855-1395&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769677140262054-Aitutaki-2---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/-mm-/ec687aa8427567fcee72e8346cfbcd11f992874c/c=0-604-4888-7121&r=383&c=0-0-380-510/local/-/media/2015/09/04/USATODAY/USATODAY/635769666333691510-Elbow-Beach-1---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769664346070028-Likuliku-1---CREDIT-ALL-TO-LIKULIKU.jpg", "http://www.gannett-cdn.com/-mm-/6df1f8cb078ff67e824b7123a6c23d3bf5ee9d7e/c=0-0-1987-1494&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769665991111118-Aitutaki-1---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/-mm-/2600052ac725e520385fbec25014cda7d36b83e3/c=0-0-1593-1198&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769664209100272-Likiliku-2.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769662457821820-Hilton-Bora-Bora-Nui-4.jpg", "http://www.gannett-cdn.com/-mm-/0e975db38a25a09936e6d331d48fca5761b78282/c=310-0-5162-3648&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769664709086682-Mulia-Resort---CREDIT-ALL-TO-THE-MULIA.jpg", "http://www.gannett-cdn.com/-mm-/753075ab2917ba1140b5ff26181c5124f7d50f85/c=0-156-2097-1341&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769663898344288-Ritz-7.jpg", "http://www.gannett-cdn.com/-mm-/836bc7e2a66265bddc8d1275b4ad2fdd6be926a8/c=0-71-1376-848&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769662404157132-Hilton-Bora-Bora-Nui-3.jpg", "http://www.gannett-cdn.com/-mm-/088a147b70fb767bde12947fb05440e628d3fcdf/c=218-0-1811-1198&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769664439203222-Aulani-2---Credit-David-Roark-Disney-Destinations.jpeg", "http://www.gannett-cdn.com/-mm-/09e45b62a3254051120ac7888979cc9cdc8f4c58/c=14-0-2134-1198&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769664439203222-Aulani-2---Credit-David-Roark-Disney-Destinations.jpeg", "http://www.gannett-cdn.com/-mm-/d0b0d876cf064f2b2952d873e759a0842d38decd/c=0-0-1862-1400&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769663898344288-Ritz-7.jpg", "http://www.gannett-cdn.com/-mm-/9b3248cf3abd84496af306bc96dfd1c4476be83d/c=0-308-2100-1494&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769665991111118-Aitutaki-1---CREDIT-ALL-TO-AITUTAKI.jpg", "https://twitter.com/intent/tweet?url=http%3A//usat.ly/1Uxitxq&text=Amazing%20beach%20resorts%20around%20the%20world&via=usatoday", "http://www.gannett-cdn.com/-mm-/e74c5071db9824baea5069f79eaf256f3ccd2d7a/c=119-0-1981-1400&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769663859967796-Ritz-9.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769663898344288-Ritz-7.jpg", "http://www.gannett-cdn.com/-mm-/c264bcdc5be7e5cac3f946f4d0335d2f417a142a/c=218-0-1811-1198&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769664439203222-Aulani-2---Credit-David-Roark-Disney-Destinations.jpeg", "http://usat.ly/1Uxitxq", "http://www.gannett-cdn.com/-mm-/42cbb213938e9a157704d86ed2965aafc1d39285/c=0-0-1593-1198&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769664208788268-Likiliku-3.jpg", "http://www.gannett-cdn.com/-mm-/40db8c00b6bf4e777bb5cef6f57442a5e822aab6/c=94-0-1568-1108&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769664346070028-Likuliku-1---CREDIT-ALL-TO-LIKULIKU.jpg", "http://www.gannett-cdn.com/-mm-/f334bcc0af37b515b41b5c7cff4884f07ec726fa/c=0-9-2694-3601&r=1083&c=0-0-1080-1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769662706645010-Hilton-BOra-Bora-Nui-6.jpg", "http://www.gannett-cdn.com/-mm-/0031ea8def57e2c7c100bd58777a0ee31f9a335d/c=105-0-1696-1196&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769666267234658-Aitutaki-4---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/-mm-/42cbb213938e9a157704d86ed2965aafc1d39285/c=0-0-1593-1198&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769664209100272-Likiliku-2.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769677140262054-Aitutaki-2---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/-mm-/b049621823462efef6aa90791e5743d0b92d2da8/c=1479-0-3609-1601&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769665837917154-Aulani-1---Credit-David-Roark-Disney-Destinations.jpeg", "http://www.gannett-cdn.com/-mm-/1681cd67e3651355185bb382aa1cbb11bfe716fb/c=0-150-1796-1165&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769666267234658-Aitutaki-4---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/-mm-/1a140a72d807d179f327d9c1b05dffe94452a90f/c=188-0-3029-2136&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769662618971886-Hilton-BOra-Bora-Nui-5---Motu-Tapu.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769664709086682-Mulia-Resort---CREDIT-ALL-TO-THE-MULIA.jpg", "http://www.gannett-cdn.com/-mm-/995a9207e62dd83fa505b53201950b15225aeab2/c=0-423-4129-2756&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769663979309326-Mulia-Resort-5.jpg", "http://www.gannett-cdn.com/-mm-/1194f40270bdd470565842d4e419de0b09a1484e/c=0-316-4129-2649&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769663661221248-Mulia-Resort-3-1-.jpg", "http://www.gannett-cdn.com/-mm-/d8fd2f8243526b30520a7f9375b3e9b627ff1e85/c=234-0-3899-2756&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769663979309326-Mulia-Resort-5.jpg", "http://www.gannett-cdn.com/-mm-/76099b54e5e928429c39e281bcac42ef4edaba06/c=0-0-1987-1494&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769665991111118-Aitutaki-1---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769663979309326-Mulia-Resort-5.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769665837917154-Aulani-1---Credit-David-Roark-Disney-Destinations.jpeg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769664208788268-Likiliku-3.jpg", "http://www.gannett-cdn.com/-mm-/e08edaa6c4d2e43fefc43ee925fa4a7f9c360227/c=1479-0-3609-1601&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769665837917154-Aulani-1---Credit-David-Roark-Disney-Destinations.jpeg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769663851855692-Mulia-Resort-4.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769664757291300-Elbow-Beach-4---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/-mm-/34dbbf7c5197a17dd34b55f80e8af200466cd9a6/c=0-178-6739-3985&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769666970491674-Elbow-Beach-2---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/-mm-/7640bf41bf5ca8a71d89dd260e0a9809a0f83752/c=0-0-1855-1395&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769677140262054-Aitutaki-2---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/-mm-/45761e5302458734d66d85eb06d0cc4937a8cca2/c=0-210-4134-2546&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769663851855692-Mulia-Resort-4.jpg", "http://www.gannett-cdn.com/-mm-/a9d075f6ef1c21b8b0d231c9eecf7f1e99e9fd98/c=94-0-1568-1108&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769664346070028-Likuliku-1---CREDIT-ALL-TO-LIKULIKU.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769664439203222-Aulani-2---Credit-David-Roark-Disney-Destinations.jpeg", "http://www.gannett-cdn.com/-mm-/ac877fe55a1da28eb6c071f2da250624a6b1819b/c=105-0-1696-1196&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769666267234658-Aitutaki-4---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769665991111118-Aitutaki-1---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.hilton.com/frenchpolynesia", "http://www.gannett-cdn.com/media/", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769663859967796-Ritz-9.jpg", "http://www.gannett-cdn.com/-mm-/14891c26678ebd13b0d91d0c03016ce595de3028/c=234-0-3899-2756&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769663661221248-Mulia-Resort-3-1-.jpg", "http://www.gannett-cdn.com/-mm-/a8273830129f43981f096b499fa09464e4fa09c6/c=0-91-1795-1105&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769664209100272-Likiliku-2.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769662618971886-Hilton-BOra-Bora-Nui-5---Motu-Tapu.jpg", "http://www.gannett-cdn.com/-mm-/77d5761a530187739a10df3b45658ac5f2ea0b95/c=0-0-1862-1400&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769663898344288-Ritz-7.jpg", "http://www.gannett-cdn.com/-mm-/fc3a71d4b0e07fc21a4b55c0c0eab85fdad268f3/c=0-0-2482-1866&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769663485875000-Harbour-Village-2---CREDIT-ALL-TO-HARBOUR-VILLAGE.jpg", "http://www.gannett-cdn.com/-mm-/3939cf3b3211b5970a7c26a7c17dcaae79eb2669/c=0-9-2694-3601&r=383&c=0-0-380-510/local/-/media/2015/09/04/USATODAY/USATODAY/635769662706645010-Hilton-BOra-Bora-Nui-6.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769663661221248-Mulia-Resort-3-1-.jpg", "http://www.gannett-cdn.com/-mm-/be38d460ba2a9ebcf186e30ba7c909b8094f9cc8/c=0-73-499-355&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769664757291300-Elbow-Beach-4---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/-mm-/225858cf33b1977e17b370751aad6f5bc5d39734/c=0-0-472-355&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769664757291300-Elbow-Beach-4---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/-mm-/230887d7cb12300674aee8b74b1bf366edf413ad/c=310-0-5162-3648&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769664709086682-Mulia-Resort---CREDIT-ALL-TO-THE-MULIA.jpg", "http://www.linkedin.com/shareArticle?url=http%3A//usat.ly/1Uxitxq&mini=true", "http://www.gannett-cdn.com/-mm-/e9dcca1a74e4f1bce3be8318178580015f840c43/c=775-0-3609-1601&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769665837917154-Aulani-1---Credit-David-Roark-Disney-Destinations.jpeg", "http://www.gannett-cdn.com/-mm-/fb7168dc1a9e02e72d6cbcc1dfc6414ad4c60765/c=594-0-5293-3533&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769664425163042-Ritz-3.jpg", "http://www.gannett-cdn.com/-mm-/3951a52c680fc017d4222544d9ca3eafc6052de1/c=23-0-2736-2040&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769663506623266-Harbour-Village---CREDIT-ALL-TO-HARBOUR-VILLAGE.jpg", "http://www.gannett-cdn.com/-mm-/b937aa211100e66d0423aae68c4d76f0baac3536/c=726-0-6026-3985&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769666970491674-Elbow-Beach-2---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/-mm-/4ccb5ffa14e2f3421e0cb4927bdd9f45d7cf3b07/c=0-2007-2690-3527&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769662706645010-Hilton-BOra-Bora-Nui-6.jpg", "http://www.gannett-cdn.com/-mm-/7093fcd0491c401ac2dc16e00f343cad11a695fc/c=0-0-1224-920&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769662404157132-Hilton-Bora-Bora-Nui-3.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769666333691510-Elbow-Beach-1---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/-mm-/c9838d6b3eec540002a298cd23781f665cfc4c4e/c=0-53-2097-1238&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769663859967796-Ritz-9.jpg", "http://www.gannett-cdn.com/-mm-/489fe8ebecadeb6a6f549427e1972bf0b73b1362/c=0-4281-4888-7042&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769666333691510-Elbow-Beach-1---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/-mm-/ab4a85c305fb6faf956c361e84d614874c38d17e/c=119-0-1981-1400&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769663859967796-Ritz-9.jpg", "http://www.gannett-cdn.com/-mm-/ba37a3232fef00f77dd7d5d685032a459f640c54/c=0-0-1987-1494&r=x404&c=534x401/local/-/media/2015/09/04/USATODAY/USATODAY/635769665991111118-Aitutaki-1---CREDIT-ALL-TO-AITUTAKI.jpg", "http://resorts.disney.go.com/aulani-hawaii-resort", "http://www.gannett-cdn.com/-mm-/412ee8a09d724aeab0c2107495065fd5790e33c5/c=0-211-2095-1395&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769677140262054-Aitutaki-2---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/-mm-/2600052ac725e520385fbec25014cda7d36b83e3/c=0-0-1593-1198&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769664208788268-Likiliku-3.jpg", "http://www.gannett-cdn.com/-mm-/3167bdaa1c5c8ef41fe26cf7c3e2271a3618906e/c=188-0-3029-2136&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769662618971886-Hilton-BOra-Bora-Nui-5---Motu-Tapu.jpg", "http://www.gannett-cdn.com/-mm-/43b485ea9b4036b010ac0191def7b734bcc9013d/c=0-115-1660-1053&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769664346070028-Likuliku-1---CREDIT-ALL-TO-LIKULIKU.jpg", "http://www.gannett-cdn.com/-mm-/8a9d254421de34be3b83829bf4c6991c644bcd90/c=0-0-1224-920&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769662404157132-Hilton-Bora-Bora-Nui-3.jpg", "http://www.gannett-cdn.com/-mm-/6cec7300ad30882cbda0f3ca41a70efbca15ee6f/c=0-0-472-355&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769664757291300-Elbow-Beach-4---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/-mm-/14891c26678ebd13b0d91d0c03016ce595de3028/c=234-0-3899-2756&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769663851855692-Mulia-Resort-4.jpg", "http://www.gannett-cdn.com/-mm-/d8fd2f8243526b30520a7f9375b3e9b627ff1e85/c=234-0-3899-2756&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769663851855692-Mulia-Resort-4.jpg", "http://www.gannett-cdn.com/-mm-/5b93684962c3a5a58bca1470077ba31b8b1f0344/c=101-0-1322-918&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769662457821820-Hilton-Bora-Bora-Nui-4.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769662404157132-Hilton-Bora-Bora-Nui-3.jpg", "http://www.gannett-cdn.com/-mm-/d7ff7e0e325a078d6442ca1a91b30e9a7b2424a3/c=0-560-5465-3648&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769664709086682-Mulia-Resort---CREDIT-ALL-TO-THE-MULIA.jpg", "http://www.gannett-cdn.com/-mm-/67680b203cfd68ec5f02f9328df17819c57f3151/c=0-0-2781-1571&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769663485875000-Harbour-Village-2---CREDIT-ALL-TO-HARBOUR-VILLAGE.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769662706645010-Hilton-BOra-Bora-Nui-6.jpg", "http://www.gannett-cdn.com/-mm-/b40b61d47634069821ee4bd05cb4cd0e33185336/c=0-543-5293-3533&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769664425163042-Ritz-3.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769663506623266-Harbour-Village---CREDIT-ALL-TO-HARBOUR-VILLAGE.jpg", "http://www.gannett-cdn.com/-mm-/400151bbf2d8bf3785d4d4cecdc27eea75ea9bf1/c=0-0-2482-1866&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769663485875000-Harbour-Village-2---CREDIT-ALL-TO-HARBOUR-VILLAGE.jpg", "http://www.gannett-cdn.com/-mm-/d79f92892047208e1895be8cfd1996045b27643a/c=101-0-1322-918&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769662457821820-Hilton-Bora-Bora-Nui-4.jpg", "http://www.gannett-cdn.com/-mm-/34e2ea19923e04ca9f79be30a4fb23d8602f0218/c=0-160-3216-1977&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769662618971886-Hilton-BOra-Bora-Nui-5---Motu-Tapu.jpg", "http://www.gannett-cdn.com/-mm-/6c3ad5f2611f9e95f52112128082672362c4af9f/c=0-81-1322-828&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769662457821820-Hilton-Bora-Bora-Nui-4.jpg", "http://www.gannett-cdn.com/-mm-/b91ccc2ca439312b31652720a703e63823a56dbd/c=726-0-6026-3985&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769666970491674-Elbow-Beach-2---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769666970491674-Elbow-Beach-2---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769664209100272-Likiliku-2.jpg", "http://www.gannett-cdn.com/-mm-/d8fd2f8243526b30520a7f9375b3e9b627ff1e85/c=234-0-3899-2756&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769663661221248-Mulia-Resort-3-1-.jpg", "http://www.gannett-cdn.com/-mm-/a37a1acedb5576bdb0d54a96c7ed89d40f6541eb/c=594-0-5293-3533&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769664425163042-Ritz-3.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769664425163042-Ritz-3.jpg", "http://www.gannett-cdn.com/-mm-/14891c26678ebd13b0d91d0c03016ce595de3028/c=234-0-3899-2756&r=x1443&c=1920x1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769663979309326-Mulia-Resort-5.jpg", "http://www.gannett-cdn.com/-mm-/fa19a60674dbe0a86482d5fee29141881353a4ad/c=23-0-2736-2040&r=x513&c=680x510/local/-/media/2015/09/04/USATODAY/USATODAY/635769663506623266-Harbour-Village---CREDIT-ALL-TO-HARBOUR-VILLAGE.jpg", "http://www.gannett-cdn.com/-mm-/3d9e91d16f1375b77f4e823afc2de0f434fdeb63/c=0-604-4888-7121&r=1083&c=0-0-1080-1440/local/-/media/2015/09/04/USATODAY/USATODAY/635769666333691510-Elbow-Beach-1---CREDIT-ALL-TO-ELBOW-BEACH.jpg", "http://www.gannett-cdn.com/media/2015/09/04/USATODAY/USATODAY/635769666267234658-Aitutaki-4---CREDIT-ALL-TO-AITUTAKI.jpg", "http://www.gannett-cdn.com/-mm-/46e9c89d57098f7f47a423f90fab910ea2b99b27/c=0-137-1795-1151&r=x48&c=80x45/local/-/media/2015/09/04/USATODAY/USATODAY/635769664208788268-Likiliku-3.jpg"], "published": "2015-09-04T21:50:00.000+03:00", "crawled": "2015-09-08T03:27:48.987+03:00", "highlightTitle": ""}