{"organizations": [], "uuid": "d2c7da49c79da0d02953f1e4cc3db54c0b7d69f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/Los-Cabos-Beach-Golf-Resort.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/hotels/", "section_title": "Hotel News| Travel and Tour World | Online Hotel Industry News| Hospitality Industry News| Hotel Market TrendsTravelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hilton-los-cabos-beach-golf-resort-remembers-hurricane-odile-one-year-later/", "country": "US", "title": "Hilton Los Cabos Beach & Golf Resort Remembers Hurricane Odile One Year LaterTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Hilton Los Cabos Beach & Golf Resort Remembers Hurricane Odile One Year LaterTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "d2c7da49c79da0d02953f1e4cc3db54c0b7d69f2"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/hilton-los-cabos-beach-golf-resort-remembers-hurricane-odile-one-year-later/", "ord_in_thread": 0, "title": "Hilton Los Cabos Beach & Golf Resort Remembers Hurricane Odile One Year LaterTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hilton Los Cabos Beach & Golf Resort Remembers Hurricane Odile One Year Later\nLOS CABOS, Mexico and MCLEAN, Va. – Leading up to the one-year anniversary of Hurricane Odile, one of the most powerful hurricanes to ever strike the Baja California Peninsula in Mexico, Hilton Los Cabos Beach & Golf Resort is celebrating a new beginning. Following a year of recovery and renovation, today the hotel will recognize team members and welcome back guests for a reunion during which a short film commemorating the incredible restoration journey will be debuted. Hilton will also be broadcasting the event and other happenings on-property via a live video stream throughout the day.\n“What our team members did during Hurricane Odile – putting our guests first above everything – is something we’ll never forget at Hilton,” said Rob Palleschi, global head, full service brands, Hilton Worldwide. “Their resilience and winning spirit carried us through the storm and today we’re celebrating that our team is back in action making Hilton Los Cabos Beach & Golf Resort even better than it was before.”\nThanks to the overwhelming generosity of team members across Hilton Worldwide, guests and the public, Hilton Los Cabos Beach & Golf Resort team members were supported with basic needs to rebuild their homes and communities through the Hilton Worldwide Responds Fund which provided more than $500,000 in financial aid as well as in-kind donations and supplies:\nMore than 12,000 bottles and gallons of drinking water were delivered to team members, guests and surrounding hotels Two months of basic groceries were provided to more than 500 people Thirty-six team member homes were rebuilt Every one of the more than 350 team members kept their jobs and many were reskilled to help with the property rebuild, the second phase of which will be completed this month Guests donated hundreds of toys for team members’ children as well as 150 suitcases of clothing Team members with chronic illnesses were provided ongoing medical care Dozens of team members’ children were cared for in a day care created in the hotel ballroom\n“Hilton Los Cabos Beach & Golf Resort has been a jewel in the Hilton portfolio since it first opened more than a decade ago,” said Tom Potter, senior vice president, operations, Latin America & Caribbean, Hilton Worldwide. “The team’s dedication throughout the rebuilding process has shown us the true meaning of spreading the light and warmth of hospitality and we’re thrilled to be welcoming guests back once again to experience the breathtaking beauty of Los Cabos, Mexico.”", "external_links": [], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T01:35:49.693+03:00", "highlightTitle": ""}