{"organizations": [], "uuid": "3c5d66afa66b39a026921e2e245fd6250bf2c1eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/cq5dam.web_.press_.400.keepaspectratio11.jpeg", "site_section": "http://feeds.feedburner.com/travelandtourworld-travelandtourismnews", "section_title": "Travel and Tour World – Tourism, Airline, Destination, MICE, Gobal Travel Market, Hotel news that you will find only over here.", "url": "http://www.travelandtourworld.com/news/article/back-to-brunch-at-four-seasons-hotel-istanbul-at-the-bosphorus/", "country": "US", "title": "Back to Brunch at Four Seasons Hotel Istanbul at the Bosphorus", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Back to Brunch at Four Seasons Hotel Istanbul at the Bosphorus", "spam_score": 0.0, "site_type": "news", "published": "2015-09-09T17:32:00.000+03:00", "replies_count": 0, "uuid": "3c5d66afa66b39a026921e2e245fd6250bf2c1eb"}, "author": "Bicky", "url": "http://www.travelandtourworld.com/news/article/back-to-brunch-at-four-seasons-hotel-istanbul-at-the-bosphorus/", "ord_in_thread": 0, "title": "Back to Brunch at Four Seasons Hotel Istanbul at the Bosphorus", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "\"We are currently updating our website and doing maintenance. We apologize for the inconvenience.\"   Back to Brunch at Four Seasons Hotel Istanbul at the Bosphorus Back to Brunch at Four Seasons Hotel Istanbul at the Bosphorus   \nSet by the shores of beautiful Bosphorus, Aqua takes the brunch experience into an elaborate level every Sunday with selected dishes of Italian and Turkish cuisine as well as additional touches to the ambiance. With its convenient setting in Istanbul, brunch at Four Seasons Istanbul at the Bosphorus is an opportunity for families and friends to get together and savour delicious food with unprecedented Four Seasons service. A children’s play area with different types of entertainment makes it attractive also for families with kids. Live jazz by Purple Hand Band appeals to both eye and ear, making the whole experience even more memorable. \n\n\nThe buffet-style brunch features delicacies ranging from Italian antipasti to seafood, homemade pasta, risotto, cold cuts, sushi, local and international cheeses and freshly baked breads, as well as a rich variety of grill options. Supervised by Executive Chef Sebastiano Spriveri, the culinary team prepares delicious choices emphasising rich local flavours of Turkey, including the renowned doner. For guests preferring to eat light, the salad corner offers seasonal alternatives from Chef’s herb garden. The new dessert buffet is an eye-popping pleasure by itself, so those with a sweet tooth should make sure to leave room for sweets. \n\n\nThe Hotel’s brunch is available every Sunday from 12:30 to 3:00 pm beginning September 13, 2015, and the entire Aqua restaurant and a part of YALI Lounge transform to accommodate brunch guests, who may choose between indoor seating or dining al fresco on Aqua’s terrace, based on the season. Regular guests will notice several new stations such as a mocktail bar, Westernised barbeque items and a caviar station. The team also added some of İstanbul’s street food specialties including pide, rice pilaf, manti, gozleme and lokma.", "external_links": [], "published": "2015-09-09T17:32:00.000+03:00", "crawled": "2015-09-09T17:40:41.998+03:00", "highlightTitle": ""}