{"organizations": [], "uuid": "fda0d8e9100abe062b1da55236908b10222a1608", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/scotland/29048-aecc-claims-top-business-award", "country": "US", "title": "AECC claims top business award", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "AECC claims top business award", "spam_score": 0.0, "site_type": "news", "published": "2015-09-28T11:15:00.000+03:00", "replies_count": 0, "uuid": "fda0d8e9100abe062b1da55236908b10222a1608"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/scotland/29048-aecc-claims-top-business-award", "ord_in_thread": 0, "title": "AECC claims top business award", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "AECC claims top business award AECC claims top business award Details Category: Scotland Created on Monday, 28 September 2015 09:15 Aberdeen Exhibition and Conference Centre (AECC) have walked away with a prestigious business award at this year’s Northern Star Business Awards. AECC has been awarded Excellence in Health and Safety at the awards, which are organised by Aberdeen and Grampian Chamber of Commerce (AGCC) and celebrates the achievements of the corporate industry of the North-east. \nAECC’s in-house health and safety team operate a robust health and safety ethic and work by the mission, “To go beyond mere compliance with the law to achieve a positive health and safety culture that genuinely adds value to the services we supply to our customer.” AECC host around 600 events each year including most recently the biennial Offshore Europe, 50,000 m2 of exhibition space attracting around 60,000 delegates over the four day event and in June this year AECC hosted its first outdoor purpose built arena to welcome Elton John, which attracted 16,000 fans, almost four times the usual capacity of the indoor arena. It is events like these that showcase the expertise that lies within the in-house team. Fiona Mann, AECC Director of Operations and Safety said, “Winning this award is a great achievement for the team at AECC and we are delighted to receive this recognition for the hard work that the team have all practiced, to create a positive health and safety culture at the venue. We operate a robust health and safety policy and have a workforce that is fully engaged. In the last few years the levels of training and education have been increased which has had an extremely positive effect. Health and safety is core to the ethos of the company and we will continue to operate in this manner.” AECC were one of three finalists whose achievements were recognised at the ceremony held at AECC on Thursday (24th September) evening. Related articles", "external_links": [], "published": "2015-09-28T11:15:00.000+03:00", "crawled": "2015-09-28T11:57:30.903+03:00", "highlightTitle": ""}