{"organizations": [], "uuid": "8f810af56184fe2c501ea56f45c71ae359dfb47d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/07/horse-racing.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-and-air-serbia-to-help-revive-serbias-historic-horse-racing-legacy/", "country": "US", "title": "Etihad Airways and Air Serbia to help revive Serbia's historic horse racing legacyTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "Etihad Airways and Air Serbia to help revive Serbia's historic horse racing legacyTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "8f810af56184fe2c501ea56f45c71ae359dfb47d"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/etihad-airways-and-air-serbia-to-help-revive-serbias-historic-horse-racing-legacy/", "ord_in_thread": 0, "title": "Etihad Airways and Air Serbia to help revive Serbia's historic horse racing legacyTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Etihad Airways and Air Serbia to help revive Serbia’s historic horse racing legacy\nEtihad Airways has announced the signing of a joint agreement with AD Zobnatica and Air Serbia to sponsor a prestigious horse racing event, Prince Paul’s Cup – Zobnatica 2015, which will take place for the first time at the Zobnatica Hippodrome on 13 September 2015.\nThe Prince Paul’s Cup – Zobnatica 2015 will revive the horse racing sport in Zobnatica after nearly a decade. This year’s eight-race programme is being held in cooperation with the Belgrade Jockey Club, bringing history, tradition and expertise to the event.\nThe horse race day will be opened by HRH Princess Elizabeth Karađorđević, member of the Serbian Royal Family, and will include gallop and trotter races featuring top horses and renowned jockeys from the Eastern European region.\nUnder the deal, both airlines have secured naming rights to two signature flat gallop races, which will be named as ‘Etihad Milja’ and ‘Air Serbia-Jadran II’ respectively.\nPeter Baumgartner, Etihad Airways’ Chief Commercial Officer, said: “We are pleased to announce Etihad Airways’ first sports sponsorship in the region and one that underscores our deep commitment to the Serbian market and reflects the already strong bilateral ties between the UAE and Serbia.\n“Importantly, this is about rejuvenating horse racing in Serbia, which will enable us to come closer to our customers in the country. We are confident that the Prince Paul’s Cup will reach new heights and grow into one of the region’s premier race meetings.”\nDane Kondić, Chief Executive Officer of Air Serbia, said: “By helping revive this excellent tradition, we are not only supporting equestrian sport in Serbia, but more importantly, an initiative that will ultimately benefit the community by contributing to tourism and the wider local economy. Through this and other initiatives, we are also confident that the equestrian sport will once again find its place among the top sports in our country and proudly represent it at home and abroad.”\nWelcoming the deal, Saeed Al Suwaidi, Executive Director of Zobnatica, said: “We are excited about this partnership and are appreciative of the support provided by Air Serbia, Etihad Airways and Etihad Airways Partners to the horse racing sport. We will use this opportunity to rebuild this esteemed event and the surrounding area of Zobnatica.”\nZobnatica is located 150 kilometres from Belgrade, from where Etihad Airways and Air Serbia together offer double daily flights to Abu Dhabi. It is home to a renowned horse stable, which has a long and distinguished tradition of organising equestrian events for over 30 years. During that period, horse racing events enjoyed great popularity and international recognition, attracting thousands of enthusiasts from around the globe.\nOther highlights of the agreement include the display of Etihad Airways, Air Serbia and Etihad Airways Partners branding at various locations around the Zobnatica Hippodrome including the horse arena, gallop and trotter race track fences, food and beverage bars, VIP stage, horse farm and Zobnatica Tourist Resort.\nAdditional benefits include tickets and hospitality packages, as well as complimentary horse race event tickets for Gold and Platinum members of the Etihad Airways and Air Serbia frequent flyer programme.\nSource:- Etihad Airways", "external_links": [], "published": "2015-09-05T03:00:00.000+03:00", "crawled": "2015-09-05T14:06:24.421+03:00", "highlightTitle": ""}