{"organizations": [], "uuid": "6c40d697efa2260bdb9e34674a1adcb1629bf3fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "nymag.com", "main_image": "", "site_section": "http://feeds.feedburner.com/NymagcomTravel", "section_title": "nymag.com: Travel", "url": "http://nymag.com/travel/visitorsguide/17557/", "country": "US", "title": "Where to Stash Mom", "performance_score": 0, "site": "nymag.com", "participants_count": 1, "title_full": "Where to Stash Mom", "spam_score": 0.0, "site_type": "news", "published": "2015-09-06T13:01:00.000+03:00", "replies_count": 0, "uuid": "6c40d697efa2260bdb9e34674a1adcb1629bf3fd"}, "author": "Tara Mandy", "url": "http://nymag.com/travel/visitorsguide/17557/", "ord_in_thread": 0, "title": "Where to Stash Mom", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "(Photo: Courtesy of Four Seasons) \nMy West-Coast Deal-Maker Friend Who Needs a Killer Lobby Four Seasons Hotel 57 E. 57th St., nr. Madison Ave.; 212-758-5700 The preferred deal-clinch location. Ask for room 2303: It’s on a corner, so it gets extra light. And it’s wheelchair-accessible, so the room is slightly bigger, but there’s no bathtub (from $695). (Photo: Courtesy of Broadway @ Times Square) \nMy College-Age, Concert-Bound Brother and His Buddies Broadway @ Times Square Hotel 129 W. 46th St., nr. Sixth Ave.; 212-221-2600 Chip et al. are coming to town for a show at Irving Plaza. Stash them in the Broadway @ Times Square, where rates starting at $157 a night include a basic but clean room with a phone, coffeemaker, and flat-screen TV with onDemand, plus free Wi-Fi, gym, laundry, and a complimentary continental breakfast. The toiletries are severely limited, but the boys won’t be bathing anyway. (Photo: Todd Eberle/The Mark Hotel) \nMy Best Friend, His Wife, and Their Two Kids Who Want to Be Near the Museums The Mark Hotel 25 E. 77th St., nr. Madison Ave.; 212-744-4300 The once-stuffy aesthetic of this storied hotel has been replaced by a new, artsy type of Upper East Side style. And it’s more than a tad French, too, courtesy of designer Jacques Grange (rooms from $475). (Photo: Courtesy of New York Marriott Marquis) \nMy Midwestern Relatives Who Want to Be in Tourist Central New York Marriott Marquis 1535 Broadway, nr. 45th St.; 212-398-1900 Thanks to its nearly 2,000 rooms (from $284), a Times Square location, and familiar reputation, the Marriott Marquis has become a popular tourist destination, particularly for the Broadway-bound. (Photo: Courtesy of Gansevoort Hotel Group) \nMy 23-Year-Old Cousin and Her Best Friend Who Came to Party Gansevoort Meatpacking NYC 18 Ninth Ave., nr. 13th St.; 212-206-6700 Within stumbling distance of the Marquee, Le Bain, and the Griffin, the hotel’s Plunge Rooftop Bar + Lounge is a major breeding ground for Page Six items. Rooms (from $345) are small, teched-out, and trendy. The west-facing ones on the ninth or tenth floor (rooms 11, 12, 14, and 15 are farthest from the elevators) are quietest, should the partyers need to sleep in. (Photo: Courtesy of St. Regis Hotel) \nMy Boss’s Boss From the Main Office St. Regis Hotel 2 E. 55th  753-4500 The art of Fortune 500 ass-kissing is perfected here. A personal butler will remember the head honcho’s name and offer to unpack his belongings or draw him a bath. Plasma-screen TVs, Wi-Fi, and MP3 players, plus Remède amenities, the hotel’s signature bed linens, and gorgeous floral arrangements by Renny & Reed round out the cushiness (from $695). (Photo: Courtesy of 59th Street Bridge Suites) \nMy Parents Who Plan to Stay for a While After the Baby Is Born 59th Street Bridge Suites 351 E. 60th St., nr. First Ave.; 212-221-8300 Anyone on an extended stay will appreciate fully equipped kitchens, big closets, and ground-floor laundry facilities. There’s no room service, but the concierge is happy to coordinate in-house cleaning, laundry, and valet services for an additional charge, or help with with takeout and grocery deliveries. Studios start at $2,000 a month; request one overlooking the courtyard (it’s quieter). (Photo: Courtesy of City Club Hotel) \nMy Extremely Cool Newlywed Friends City Club Hotel 55 W. 44th St., nr. Sixth Ave.; 212-921-5500 Hotels often rely on frilly bed linens and a single red rose when playing up romance. The Grand Duplex suites here are subtly seductive: A white spiral staircase leads from a cozy living room up to a king bed and a chocolate-marble bathroom with a rain shower built for two (there’s also a private terrace). With room service supplied by Daniel Boulud’s DB Bistro Moderne, you can sate other hungers with the grilled branzino or dry-aged rib eye and a bottle of Domaine Tempier rosé ($200). Rooms start at $170. Related:", "external_links": [], "published": "2015-09-06T13:01:00.000+03:00", "crawled": "2015-09-09T18:50:29.029+03:00", "highlightTitle": ""}