{"organizations": [], "uuid": "3c66ecd95dc0a30bfb98b321e7912217ed0d4309", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.incentivetravel.co.uk", "main_image": "", "site_section": "http://incentivetravel.co.uk//?format=feed&type=rss", "section_title": "ITCM - Incentive Travel & Corporate Meetings", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28999-hampton-court-palace-hosts-inaugural-radio-times-festival", "country": "US", "title": "Hampton Court Palace hosts inaugural Radio Times Festival", "performance_score": 0, "site": "incentivetravel.co.uk", "participants_count": 1, "title_full": "Hampton Court Palace hosts inaugural Radio Times Festival", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T13:00:00.000+03:00", "replies_count": 0, "uuid": "3c66ecd95dc0a30bfb98b321e7912217ed0d4309"}, "author": "mich@girlracer.me.uk (Michelle Chenery)", "url": "http://www.incentivetravel.co.uk/news/venuesevents/28999-hampton-court-palace-hosts-inaugural-radio-times-festival", "ord_in_thread": 0, "title": "Hampton Court Palace hosts inaugural Radio Times Festival", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Hampton Court Palace hosts inaugural Radio Times Festival Hampton Court Palace hosts inaugural Radio Times Festival Details Category: Venues & Events   11:00 Hampton Court Palace will be the backdrop to the inaugural Radio Times Festival, which opens today (24 September) and runs until 27 September. Cared for by independent charity Historic Royal Palaces, the palace has become a go-to venue for high profile and popular events including the Hampton Court Festival, RHS Hampton Court Palace Flower Show, and newly launched BBC Good Food Festival. \nThe Radio Times Festival will celebrate the best of TV, radio and literature over one weekend with popular media personalities including Sir David Attenborough, Sir Bruce Forsyth, Paul Hollywood and David Walliams in attendance. The event is being run in association with Brand Events with 80 lively sessions including talks, interactive workshops, exhibits and screenings. For centuries, Hampton Court Palace has hosted magnificent events and parties that have helped shape Britain’s history. Today, events are hosted in a range of splendid state apartments and intimate spaces, which have an unrivalled place in our culture. Liz Young, Head of Events at Historic Royal Palaces, says: “In our 500th anniversary year, we’re delighted to host the inaugural Radio Times Festival in the grounds of Hampton Court Palace. Famously, Hampton Court was the setting for one of the greatest dramas in history - the reign of King Henry VIII - and the palace frequently appears in television documentaries and feature films. We look forward to welcoming some of the top talents of television, radio and literature to this exciting event – as this is a great testament to our success in hosting more events like the BBC Good Food Festival.” Ben Preston, Radio Times Editor, says: “I’m delighted to announce the first Radio Times Festival. What better place to celebrate broadcasting than at Hampton Court Palace - the true heart of this year’s outstanding drama Wolf Hall. For 92 years Radio Times has prided itself on telling readers when and where to find the very best television and radio. Now we’re hosting the first Radio Times Festival so you can meet and discover more from broadcasting’s most talented people. We have secured some of the best names for the festival, which contains 80 sessions, and we are confident that this event will be a huge success and capture the public’s imagination.” Chris Hughes, CEO of Brand Events, said: “Brand Events prides itself on creating the best consumer experiences that the UK has to offer and bringing to life already well established, credible brands. We are thrilled to be working with the Radio Times, one of the greatest media brands in Britain and in one of the most stunning settings. Audience experience is always at the forefront of what we do and with such an amazing line up we are going to make this festival a fully immersive and unforgettable one.” Situated amidst 750 acres of parkland, Hampton Court Palace was built by Cardinal Wolsey in 1515, and famously became home to King Henry VIII and several of his wives. In 1689, the palace was partly rebuilt by King William III and Queen Mary, who created a spectacular Baroque palace to rival Versailles in France. Historic Royal Palaces raises all its own funds, and income generated by private and corporate events at the palaces is reinvested into caring for these historic buildings, and keeping them open for the public to enjoy. The charity cares for five further historic royal residences: the Tower of London, the Banqueting House, Kensington Palace, Kew Palace, and Hillsborough Castle in Northern Ireland. Related articles", "external_links": [], "published": "2015-09-24T13:00:00.000+03:00", "crawled": "2015-09-24T13:38:10.334+03:00", "highlightTitle": ""}