{"organizations": [], "uuid": "bd68a8187dce28afba7f4a30da38019b7e74ec4f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2015/09/US-truckers.jpg", "site_section": "http://www.travelandtourworld.com/news/article/category/destination-news/", "section_title": "Destination News | Destination Marketing News | Destination Events News | Online Destination News | Travel Destination News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/us-truckers-offer-tips-to-labour-day-holidaymakers/", "country": "US", "title": "US truckers offer tips to Labour Day holidaymakersTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "US truckers offer tips to Labour Day holidaymakersTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-07T03:00:00.000+03:00", "replies_count": 0, "uuid": "bd68a8187dce28afba7f4a30da38019b7e74ec4f"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/us-truckers-offer-tips-to-labour-day-holidaymakers/", "ord_in_thread": 0, "title": "US truckers offer tips to Labour Day holidaymakersTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "US truckers offer tips to Labour Day holidaymakers Published on : Monday, September 7, 2015\nOn this Labour Day weekend 35.5 million travellers were expected to travel more than 50 miles for one final summer getaway, making it one of the busiest holiday weekends of the year. America’s Road Team, elite professional truck drivers with millions of accident-free miles, offered advice on how to navigate through highway traffic and arrive at your destination safely.\n“Labor Day Weekend typically means an increase in traffic as motorists try to squeeze in that last summer trip before kids go back to school and the weather gets cool,” said America’s Road Team Captain Richie Buitrago (Con-way Freight).\nTips include:\nPreparing your vehicle for long distance travel: Check your wipers and fluids. Have your radiator and cooling system serviced. Simple maintenance can prevent many of the problems that strand motorists on the side of the road. Planning ahead: Before you get on a highway, know your exit by name and number, and watch the signs as you near the off-ramp. Drivers making unexpected lane changes to exit often cause accidents. Do not cut in front of large trucks: Remember that trucks are heavier and take longer to make a complete stop, so avoid cutting quickly in front of them. Use a map or GPS: Surprisingly, few motorists plan their routes, even when driving through unfamiliar areas. Knowing the road is essential for safe driving – it allows you to anticipate lane changes and avoid a panicked search for directions. Leave early and avoid risks: Leave early and allow for delays in your travel schedule. Know your limitations: Don’t drive when tired, upset or physically ill. Be aware of trucks’ blind spots: When sharing the road with large trucks, be aware of their blind spots. If you can’t see the truck driver in his or her mirrors, then the truck driver can’t see you either. Buckle up: Safety belts are not a fashion statement – they save lives. Slow down: Chances of a crash nearly triples when driving faster than surrounding traffic. Abide by traffic rules: Follow traffic signs and signals – paying special attention to work zones is important during this high construction season. Keep extra water in your vehicle: Just as you keep a winter driving kit in your vehicle, it is important to be prepared when driving during the summer months. Keep plenty of extra water, sunscreen and non-perishable snacks in your car in case you are stranded. Pay Attention: Distracted driving is a leading cause of crashes. Looking away for even two seconds doubles the chances of an accident. Turn cell phones and PDAs off.\nThe America’s Road Team would like to remind the motoring public that from driveway to highway, safety requires patience and dedication.\nThe American Trucking Association (ATA) is the largest national trade association for the trucking industry. Through a federation of 50 affiliated state trucking associations, ATA is the voice of the industry America depends on most to move our nation’s freight.", "external_links": [], "published": "2015-09-07T03:00:00.000+03:00", "crawled": "2015-09-08T02:20:27.500+03:00", "highlightTitle": ""}