{"organizations": [], "uuid": "49a2ba060e7e17304326d96aaf564da6e8a0cd46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.eturbonews.com", "main_image": "", "site_section": "http://www.eturbonews.com/rss.xml", "section_title": "eTurboNews (eTN) - Original and unique global international news with a focus on travel and tourism", "url": "http://www.eturbonews.com/64128/choice-hotels-announces-expansion-cambria-hotels-suites-north-mi", "country": "US", "title": "Choice Hotels announces expansion of Cambria hotels & suites in North Miami Beach", "performance_score": 0, "site": "eturbonews.com", "participants_count": 1, "title_full": "Choice Hotels announces expansion of Cambria hotels & suites in North Miami Beach", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T05:10:00.000+03:00", "replies_count": 0, "uuid": "49a2ba060e7e17304326d96aaf564da6e8a0cd46"}, "author": "eTN Global Editor", "url": "http://www.eturbonews.com/64128/choice-hotels-announces-expansion-cambria-hotels-suites-north-mi", "ord_in_thread": 0, "title": "Choice Hotels announces expansion of Cambria hotels & suites in North Miami Beach", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Choice Hotels announces expansion of Cambria hotels & suites in North Miami Beach   \nSep 24, 2015 eTN   \nROCKVILLE, MD - Choice Hotels International, Inc announced it has signed an agreement with franchise partner CGI Merchant Group and 163rd St. Executive Center LLC to develop a new Cambria hotels & suites brand property in North Miami Beach, FL. The 165 room Cambria hotel will be located at the intersection of 163rd St. and 19th Ave and is expected to open in 2017. \n\"We continue to experience strong momentum in bringing the Cambria hotels & suites experience to new business and leisure travelers, and we're excited to announce our new hotel in North Miami Beach,\" said Michael Murphy, senior vice president, Upscale Brands, Choice Hotels International. \"This is a fantastic location with explosive growth, and we can't wait to bring our brand to travelers in this market.\" \n\"We are excited about our affiliation with the Choice Hotels Cambria brand,\" said Raoul Thomas CEO and founder of CGI Merchant Group, \"I have been observing the growth in the North Miami Beach market for several years and Cambria will make a great addition, sitting at the juncture of two of Miami's strongest retail and residential areas in Aventura and Bal Harbor.\" \nMr. Thomas expressed praises to Alejandro Araujo, principal of AFIN Developer Group for his efforts in assisting the execution of the Choice agreement. AFIN will play a role in the development of the 165 room hotel and 20,000 square feet of ground floor retail. \n\"The addition of the Cambria hotel & suites North Miami Beach property is an exciting addition to CGI's fast growing portfolio in South Florida and is consistent with CGI's strategy of partnering with top tier institutional partners,\" said Jeff Temple, senior partner at Morrison & Foerster LLP, counsel for CGI on this transaction and its entire commercial real estate portfolio. \"This project will add 165 additional rooms to CGI's hotel portfolio, including its Me Miami project currently under construction in Downtown Miami, and will be a nice complement to its retail and office properties located throughout South Florida.\" \nThe North Miami Beach area has become a popular destination because it offers something for everyone: beautiful beaches, fine dining, shopping destinations, hospitals and a robust business district. \nBeyond the obvious attractions for leisure travelers, North Miami Beach is also a popular choice for corporations, who see the eclectic city as a perfect meeting and conference destination to drive high attendance and satisfaction. \nDesigned as a business travel and leisure brand, all Cambria hotels are new-construction and feature a larger lobby to give guests a more social atmosphere; all-suite rooms that are larger than standard hotel rooms and include separate living, working and sleeping space; and the latest technology that allows guests to stay connected while they travel. \nLike all Cambria hotels & suites, the North Miami Beach property will feature other fine amenities such as a contemporary bistro, Social Circle™, serving a menu comprised of local specialties created by Chef Michael DeMaria; liquor, wine, beer and freshly prepared grab-and-go gourmet salads and sandwiches; and a barista bar. This property will also boast over 2,000 square feet of meeting space.", "external_links": [], "published": "2015-09-24T05:10:00.000+03:00", "crawled": "2015-09-24T07:55:51.673+03:00", "highlightTitle": ""}