{"organizations": [], "uuid": "315bbaf36c06236d4925d49b7197529dd2f743d6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.prweb.com", "main_image": "http://ww1.prweb.com/prfiles/2014/12/04/12991773/Ascent_Spa_Lobby.jpg", "site_section": "http://www.prweb.com/rss2/travel.xml", "section_title": "Lifestyle: Travel &amp; Tourism", "url": "http://www.prweb.com/releases/2015/10/prweb12991773.htm", "country": "US", "title": "Tenaya Lodge at Yosemite’s Ascent Spa Combines Nature and Nurture with an All-New Treatment Menu", "performance_score": 0, "site": "prweb.com", "participants_count": 1, "title_full": "Tenaya Lodge at Yosemite’s Ascent Spa Combines Nature and Nurture with an All-New Treatment Menu", "spam_score": 0.0, "site_type": "news", "published": "2015-09-30T03:00:00.000+03:00", "replies_count": 0, "uuid": "315bbaf36c06236d4925d49b7197529dd2f743d6"}, "author": "Erica Schlesinger", "url": "http://www.prweb.com/releases/2015/10/prweb12991773.htm", "ord_in_thread": 0, "title": "Tenaya Lodge at Yosemite’s Ascent Spa Combines Nature and Nurture with an All-New Treatment Menu", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When a long day of adventure or an extra-special getaway calls for some first-rate relaxation, Tenaya Lodge at Yosemite’s luxurious Ascent Spa delivers in High Sierra style… and now, more than ever. The Double Silver LEED-certified location is treating guests to an all-new menu , featuring a full suite of offerings – from soothing facials to full packages – inspired by the iconic, breathtaking Yosemite-Sierra. “The new menu was designed to expand our offerings and focus on the destination spa resort experience,” says Spa Director Heidi Clark. “We have reformatted our treatments in direct response to what our guests have asked for, including more skincare choices and treatment enhancements. Adding Ascent Spa to your itinerary is a must-do for guests to truly be immersed in all the Yosemite-Sierra Region has to offer. In addition to our existing products in the spa boutique, including local artisan products and an exclusive line by Kimberly Parry Organics, we have two new product lines, B. Kamins Skin Care and Tara Aromatherapy, which truly speak to our natural connection and sense of place.”\nInfused with locally sourced ingredients, Ascent’s Signature Renewals are the ultimate way to indulge at Tenaya. The soothing Firefall Body Renewal includes a moisturizing treatment to slough dry skin and bring out a healthy glow, while the Vernal Facial Renewal combines European technique with results-driven skincare to reduce fine lines and promote youthful, hydrated skin. Tired muscles are revived with the Bridalveil Massage Renewal, featuring embellishments for the oft-ignored hands, feet and scalp.\nThe menu also includes massage options like the Amethyst Relaxation, Obsidian Deep Tissue, River Rock Stone and Quartz Aromatherapy, which incorporates seasonal blends of essential oils. Specialized treatments like the Neck and Scalp Massage, Hiker’s Trek and Prenatal Massage pamper guests looking for an even more personalized, targeted experience.\nFacial Therapies like the Wildflower Cleansing, Dogwood Gentlemen’s Cleansing, Lupine Aromatherapy and Sage Anti-Aging refresh and restore with results in mind. Ascent has also incorporated new Specialty Facials, like Beyond Botox and Brightening treatments, to cleanse and tone on a deeper level. But all that luxury isn’t just reserved for the face – fresh Body Therapies are on the menu to treat guests head to toe. The Tenaya Lake Aromatherapy Scrub & Wrap uses antioxidant-infused, nature-based essential oils to nurture and smooth the skin and awaken the senses, while the Cathedral Lakes Detoxifying Wrap applies gentle ingredients to detoxify, hydrate and tone itchy, sensitive or dehydrated skin. Other choices include the Salt of the Earth ® Skin Therapy and Mirror Lake Skin Polish. Not to forget fingers and toes, Ascent has a number of mani/pedi selections, including rock-solid gel polish.\nWhen one treatment isn’t enough, Ascent has designed a number of new packages to deliver a full scope of relaxation. The Sugar Pine Spa Package includes a choice of two 60-minute treatments, a special Ascent gift and a $20 credit for a healthy lunch at Jackalope’s Bar & Grill, and the Sequoia Signature Renewal Package invites guests to experience two 90-minute Signature Renewal Specialties. The most comprehensive individual package, the Juniper Calm Spa Package, features a 60-minute Amethyst Relaxation Massage, a 60-minute Wildflower Cleansing Facial, a Tenaya mani/pedi and an Ascent gift. Finally, couples can find their Zen together with the Cedar Couples Spa Package, which offers a 60-minute Couples Amethyst Relaxation Massage, a 60-minute Wildflower Cleansing Facial for her and a 60-minute Dogwood Gentlemen’s Cleansing Facial for him.\nFocused on overall wellness, the Tenaya Lodge and Ascent Spa experience doesn’t stop at the spa. Fitness-minded guests can take advantage of Ascent’s comprehensive fitness area, steam rooms and saunas, take a lap in indoor or outdoor pools and hit the miles of trails surrounding the lodge by foot or by bike. And, those seeking a sound body and mind can find both at Tenaya’s third annual Yosemite Wellness & Spa Retreat , slated for January 15-17, 2016. Featuring expert speaker sessions, yoga and fitness classes, cooking lessons and even a whiskey pairing dinner, the retreat is an incredible way to reset and recharge in a way that works for each attendee’s unique needs.\nTo learn more about Ascent Spa and to experience its new menu firsthand, visit TenayaLodge.com/Spa .\nAbout Tenaya Lodge at Yosemite\nTenaya Lodge at Yosemite is an all-season resort framed by noble evergreen forest and a rich range of Sierra recreation. The lodge, set adjacent to Yosemite National Park’s South Gate at an elevation of 5,288 feet, offers 302 rooms, suites and mountain cottage accommodations. Tenaya Lodge offers easy access to Yosemite’s iconic attractions and many guests savor the alpine serenity of Ascent Spa at Tenaya Lodge. Resort dining options run the table from casual to candlelit at Sierra, Jackalope’s, Timberloft and Embers restaurants. For more information, visit TenayaLodge.com.\nAbout Delaware North\nDelaware North is one of the largest and most admired, privately-held hospitality companies in the world. Founded and owned by the Jacobs family for 100 years, it is a global leader in hospitality and food service with operations in the sports, travel hospitality, restaurants and catering, parks, resorts, gaming and specialty retail industries. Its portfolio includes high-profile venues ranging from sports stadiums, entertainment complexes, national parks, restaurants, airports, and some of the top regional casinos in the country. The company also owns a selection of award-winning destination resorts, as well as a series of premium restaurants and catering services that are leaders in the industry. Delaware North has annual revenue exceeding $3 billion with 60,000 employee associates serving half a billion guests in the United States, Canada, the United Kingdom, Australia, New Zealand, and Asia.\n###", "external_links": ["http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50ZW5heWFsb2RnZS5jb20vQXNjZW50LVNwYS1TZXJ2aWNlcy5hc3B4", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50ZW5heWFsb2RnZS5jb20vV2VsbG5lc3NTcGFSZXRyZWF0cy5hc3B4", "http://www.prweb.net/Redirect.aspx?id=aHR0cDovL3d3dy50ZW5heWFsb2RnZS5jb20vYXNjZW50LXNwYS5hc3B4"], "published": "2015-09-30T03:00:00.000+03:00", "crawled": "2015-09-30T15:25:43.200+03:00", "highlightTitle": ""}