{"organizations": [], "uuid": "cfbdcb8ce1ce382ed9889b4983a445343f88be92", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.cbs8.com", "main_image": "", "site_section": "http://www.cbs8.com/category/48532/travel", "section_title": "Travel - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "url": "http://www.cbs8.com/story/30005505/range-extenders-for-electric-vehicles-land-water-air-2015-2025", "country": "US", "title": "Range Extenders for Electric Vehicles Land, Water & Air 2015-2025", "performance_score": 0, "site": "cbs8.com", "participants_count": 1, "title_full": "Range Extenders for Electric Vehicles Land, Water & Air 2015-2025 - CBS News 8 - San Diego, CA News Station - KFMB Channel 8", "spam_score": 0.0, "site_type": "news", "published": "2015-09-10T03:00:00.000+03:00", "replies_count": 0, "uuid": "cfbdcb8ce1ce382ed9889b4983a445343f88be92"}, "author": "cbs8", "url": "http://www.cbs8.com/story/30005505/range-extenders-for-electric-vehicles-land-water-air-2015-2025", "ord_in_thread": 0, "title": "Range Extenders for Electric Vehicles Land, Water & Air 2015-2025", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": " ReportBuyer\nLONDON , Sept. 10, 2015 /PRNewswire/ -- We are in the decade of the hybrid electric vehicle despite the fact that most off road and underwater vehicles are pure electric. That includes most forklifts, golf cars and mobility vehicles for the disabled plus Autonomous Underwater Vehicles (AUVs) and personal submarines. Indeed, most electric aircraft are pure electric as well. The reason is that these are mainly small as are electric two-wheelers, which are also almost all pure electric. Small vehicles rarely need to travel long distances. In addition, these pure electric vehicles are often used where a conventional engine is banned as on lakes and indoors or where it is impracticable as with underwater vehicles. By contrast, half the electric vehicle market value lies in larger road vehicles, notably cars, and here the legal restrictions are weaker or non-existent and range anxiety compels most people to buy hybrids if they go electric at all.\nOver eight million hybrid cars will be made in 2025, each with a range extender, the additional power source that distinguishes them from pure electric cars. Add to that significant money spent on the same devices in buses, military vehicles, boats and so on and a major new market emerges. This unique report is about range extenders for all these purposes - their evolving technology and market size. Whereas today's range extenders usually consist of little more than off the shelf internal combustion engines, these are rapidly being replaced by second generation range extenders consisting of piston engines designed from scratch for fairly constant load in series hybrids. There are some wild cards like Wankel engines and rotary combustion engines or free piston engines both with integral electricity generation. However, a more radical departure is the third generation micro turbines and fuel cells that work at constant load. The report compares all these. It forecasts the lower power needed over the years given assistance from fast charging and energy harvesting innovations ahead. Every aspect of the new range extenders is covered.\nThis report profiles key developers, manufactures and integrators of range extenders for land, water and airborne electric vehicles. It gives ten year forecasts of the different types of electric vehicle and of range extenders by number, unit value and market value. Market drivers and the changing requirements for power output are analysed. Will shaftless range extenders with no separate electricity generator take over and when will that be? What fuels will be used and when? What are the pros and cons of each option and who are the leaders? It is all here.\nDownload the full report: https://www.reportbuyer.com/product/1938558/\nAbout Reportbuyer\nReportbuyer is a leading industry intelligence solution that provides all market research reports from top publishers\nhttp://www.reportbuyer.com\nFor more information:\nSarah Smith\nResearch Advisor at Reportbuyer.com\nEmail: query@reportbuyer.com\nTel: +44 208 816 85 48\nWebsite: www.reportbuyer.com\n releases/range-extenders-for-electric-vehicles-land-water--air-2015-2025-300141386.html\n ", "external_links": ["http://rt.prnewswire.com/rt.gif?NewsItemId=BR98613&Transmission_Id=201509101959PR_NEWS_USPR_____BR98613&DateId=20150910", "http://www.reportbuyer.com/", "http://www.prnewswire.com/news-releases/range-extenders-for-electric-vehicles-land-water--air-2015-2025-300141386.html", "http://www.xmlnews.org/ns/", "https://www.reportbuyer.com/product/1938558/"], "published": "2015-09-10T03:00:00.000+03:00", "crawled": "2015-09-11T04:45:10.896+03:00", "highlightTitle": ""}