{"organizations": [], "uuid": "2cd023e05a7f93d4a85f9d09784cef734cbc01ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.travelandtourworld.com", "main_image": "http://www.travelandtourworld.com/wp-content/uploads/2014/04/Routes-3737.jpg", "site_section": "http://www.travelandtourworld.com/", "section_title": "Global Travel And Tourism News | Travel B2B Magazine | Travel News -Travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/west-of-england-showcased-at-south-african-conference/", "country": "US", "title": "West of England showcased at South African conferenceTravelandtourworld.com", "performance_score": 0, "site": "travelandtourworld.com", "participants_count": 1, "title_full": "West of England showcased at South African conferenceTravelandtourworld.com", "spam_score": 0.0, "site_type": "news", "published": "2015-09-19T03:00:00.000+03:00", "replies_count": 0, "uuid": "2cd023e05a7f93d4a85f9d09784cef734cbc01ec"}, "author": "travelandtourworld.com", "url": "http://www.travelandtourworld.com/news/article/west-of-england-showcased-at-south-african-conference/", "ord_in_thread": 0, "title": "West of England showcased at South African conferenceTravelandtourworld.com", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "West of England showcased at South African conference Published on : Saturday, September 19, 2015\nBristol Airport has joined forces with Destination Bristol for the third year in succession to promote the West of England to airlines from across the globe at the world’s largest commercial aviation event in South Africa next week.\nThe World Route Development Forum takes place in Durban from 19-22 September and gives airports and tourism organisations the chance to meet with more than 250 airlines to discuss route opportunities.\nBristol and Bath will be represented on the VisitEngland stand in the international exhibition hall, showcasing eye-catching images of the West of England to 2,500 delegates from around the world. Since attending last year’s event in Chicago, Bristol Airport has secured services to 17 new destinations, contributing towards record passenger figures this summer. Wizz Air has also commenced operations at Bristol – the first time the airline has served the South West market.\nAs well as exploring potential new routes, the Airport’s focus is also on growing services to established destinations with existing carriers as it targets seven million passengers in 2016.\nHead of Aviation Development, Pete Downes, said:\n““Routes provides an invaluable opportunity to update airlines on the exciting developments at Bristol Airport. We’re proud to be flying the flag for the region, ensuring we deliver the increases in future connectivity that our growing regional economy needs. At the same time, the Destination Bristol team help bring the attractions of the area to life for airline executives, underlining the strong potential for inbound tourism.”\nHead of Tourism at Destination Bristol, Kathryn Davies, said:\n“Since joining the Bristol Airport team at Routes back in 2013, we have been able to form an effective partnership in exploiting the potential for inbound visits to Bristol, Bath and the wider region. This event gives us unrivalled access to airlines and to airports at the ‘other end’ of a flight route allowing us to maximise the potential for marketing support and growing the visitor economy.”\nLast month, passenger numbers topped three quarters of a million during a single calendar month for the first time, with a total of 768,587 passing through the terminal – up six per cent over the previous year.\nGrowth is the result of the enhanced flight and holiday programmes on offer this summer from the ‘big two’ tour operators – Thomas Cook and TUI Group (which operates the Thomson and First Choice brands) – as well as a raft of new services from scheduled airlines and increased load factors across all sectors (meaning flights are operating with more passengers on board).\nThomson Airways added a third aircraft to its Bristol-based fleet in May, opening up new destinations including Dubrovnik, Pula and Santorini, while Thomas Cook operates two Airbus A321s to a total of 20 destinations from the Airport. New easyJet flights to Bilbao, Isle of Man, Porto, Gibraltar, Lanzarote, Catania and Zante all commenced earlier this year. Wizz Air also entered the South West market for the first time in June, launching twice weekly flights to Katowice in Poland.\nInbound traffic also received a boost recently with the high profile opening of Banksy’s Dismaland in nearby Weston-super-Mare. The Rugby World Cup is also expected to boost inbound passenger numbers this autumn.\nAn enlarged departure lounge opened in July to help meet this growing demand, and work is already underway on a second major extension to the terminal building which will deliver significant improvements to the security search and arrivals areas next year.", "external_links": [], "published": "2015-09-19T03:00:00.000+03:00", "crawled": "2015-09-18T22:09:00.965+03:00", "highlightTitle": ""}