{"organizations": [], "uuid": "10dda679ea342c1136aa8f6e9187332126898ab1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.telegraph.co.uk", "main_image": "http://i.telegraph.co.uk/multimedia/archive/03427/royal-cucumber-san_3427364k.jpg", "site_section": "http://www.telegraph.co.uk/archive/2015-09-05.html", "section_title": "News Archive - News, sport and travel archive - Telegraph", "url": "http://www.telegraph.co.uk/foodanddrink/foodanddrinknews/11845020/Food-fit-for-royalty-what-does-the-Queen-really-like-to-eat.html", "country": "US", "title": "Food fit for royalty: what does the Queen really like to eat?", "performance_score": 0, "site": "telegraph.co.uk", "participants_count": 1, "title_full": "Food fit for royalty: what does the Queen really like to eat? - Telegraph", "spam_score": 0.0, "site_type": "news", "published": "2015-09-05T15:00:00.000+03:00", "replies_count": 0, "uuid": "10dda679ea342c1136aa8f6e9187332126898ab1"}, "author": "James Steen", "url": "http://www.telegraph.co.uk/foodanddrink/foodanddrinknews/11845020/Food-fit-for-royalty-what-does-the-Queen-really-like-to-eat.html", "ord_in_thread": 0, "title": "Food fit for royalty: what does the Queen really like to eat?", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Come now behind Palace walls where, twice a week, her Majesty Queen Elizabeth II flicks through a red leather-bound book of menu suggestions from the head chef to the royal household, Mark Flanagan. She ticks what she likes and draws a line through the rest. The ticks are likely to go to dishes which include either chocolate or ingredients from her farms. • Afternoon tea recipes with the royal seal of approval For instance, fillets of beef and venison from Sandringham and Balmoral are turned into Gaelic steak, served with a sauce of mushroom, cream and whisky. And just like millions of her subjects, she enjoys a Sunday roast after church – but it’s the well-done end slice of a joint which makes its way onto our monarch’s plate. The Queen doesn’t do rare. She relishes the strawberries grown at Balmoral, and the sweet-scented, white peaches that are nurtured in her greenhouses at Windsor Castle. I know all this because a pair of former chefs have given me a gastronomic primer on our nation’s ruler. They have spilt the royal beans. The Queen famously enjoys a gin and Dubonnet with plenty of ice • One would like a lamb burger: the Royal family's favourite foods Owen Hodgson worked in the Palace in the early Nineties and recalls: “When we cooked the Queen’s mushrooms we always added a smidgen of Marmite.” What culinary cleverness: mushrooms and Marmite are both rich in umami, that rich taste sensation found in comfort foods. This means the Queen’s mushrooms will be a deliciously savoury affair. • From Jaffa Cakes to wine, how royal warrants reflect our changing tastes Hodgson also recalls messing up a round of tuna sandwiches. “A chef told me off for serving the sandwiches with crusts. He then showed me how to make the perfect tuna sandwich: cutting the loaf lengthways, buttering both sides, adding the tuna-mayonnaise mixture and thinly sliced cucumber, with a crack of pepper. He then folded over the two lengths, removed the crusts and cut eight identical triangles. The Palace kitchen was all about the detail.” • Has the Royal Warrant lost its lustre? One chore is vivid in his memory. “I simmered rabbit, cooked down some chicken, then finely chopped the meat, sieved the stock and returned the meat.” Was he making a terrine for the Queen? “No,” he says. “It was the corgis’ dog food.” Meanwhile, Darren McGrady recalls a similar first job in the kitchens – peeling carrots for the Queen’s horses. “Each one had to be finger-length and peeled to perfection. If ever a horse bit the Queen’s finger, it was the chef’s fault for cutting them too short.” McGrady became personal chef to the Queen and then to Diana, Princess of Wales, and today he owns a fine dining catering company and personal chef service in Dallas, Texas. The business is called Eating Royally , also the title of his memoirs. He says, “Sadly, the Queen is not a foodie. She eats to live, unlike Prince Philip who loves to eat and would stand and talk food all day.” The Duke, incidentally, has long reigned over the Palace barbecue. For breakfast the Queen likes cereal – usually Special K – and fruit. McGrady reveals, “The Queen loved scrambled eggs with smoked salmon and a grating of truffle. But she was too frugal to ever order fresh truffles and only really enjoyed them at Christmas when the truffles were sent as a gift.” • Royal chef reveals the Queen's favourite meals As for snifters, she takes a gin and Dubonnet with a slice of lemon and a lot of ice, and enjoys wine and champagne. Of the chocolate… “She loves it,” says McGrady. Afternoon tea is a daily fixture, and often comes with chocolate perfection pie or chocolate biscuit cake, made with McVitie’s Rich Tea biscuits. As well as her favourite gin cocktail, her Majesty also enjoys wine and champagne She follows culinary tradition, too. It was Queen Victoria’s chef who created the recipe for the chocolate ganache sponge cake that is served at birthdays for the Queen and her family. Jam pennies – buttered bread with jam cut into circles the size of the old English penny – are still on the menu. She used to have them with Princess Margaret as children in the nursery. • One would like a lamb burger: the Royal family's favourite foods How does she stay so slim? “When she dines on her own,” says McGrady, “she’s very disciplined. No starch is the rule. No potatoes, rice or pasta for dinner. Just usually something like grilled sole with vegetables and salad.” McGrady adds that despite the kitchens belonging to the Queen, they were always short on equipment. “To this day,” he says, “the chefs still use copper pans that belonged to Queen Victoria.” telegraph.co.uk Follow @telegraph", "external_links": [], "published": "2015-09-05T15:00:00.000+03:00", "crawled": "2015-09-06T22:56:49.446+03:00", "highlightTitle": ""}