{"organizations": ["New Research Finds Wire Service", "New Research Finds Medallia Institute"], "uuid": "9eec9b8709e365e7ad0808e2b7ce582f392dccf6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.webwire.com", "main_image": "http://www.webwire.com/imgs/WebWire-Logo-200x200.gif", "site_section": "http://rssfeeds.webwire.com/WebWire-News-Travel", "section_title": "WebWire | News by Industry : Travel Industry", "url": "http://www.webwire.com/ViewPressRel.asp?aId=200189", "country": "US", "title": "Japanese Consumers Set the Bar for High Standards, While South Americans are the Easiest to Please, New Research Finds", "performance_score": 0, "site": "webwire.com", "participants_count": 0, "title_full": "Japanese Consumers Set the Bar for High Standards, While South Americans are the Easiest to Please, New Research Finds", "spam_score": 0.0, "site_type": "news", "published": "2015-09-24T15:00:00.000+03:00", "replies_count": 0, "uuid": "9eec9b8709e365e7ad0808e2b7ce582f392dccf6"}, "author": "", "url": "http://www.webwire.com/ViewPressRel.asp?aId=200189", "ord_in_thread": 0, "title": "Japanese Consumers Set the Bar for High Standards, While South Americans are the Easiest to Please, New Research Finds", "locations": ["Calif.", "Palo Alto"], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Wire Service Japanese Consumers Set the Bar for High Standards, While South Americans are the Easiest to Please, New Research Finds Medallia Institute study of over 10 million consumer ratings finds significant differences in customer expectations across the globe. Palo Alto, Calif. – WEBWIRE – Thursday, September 24, 2015 \nSouth American consumers give higher satisfaction scores than other cultural groups, while Japanese consumers are the toughest to please, according to a study released today by Medallia, a leading provider of customer experience management software. The study examined over 10 million customer feedback scores across 15 global languages to reveal how people from different cultures evaluate their experience with a business  a crucial consideration for companies that seek to understand and improve their quality of service in different regions. Results Overview Using a baseline of English speakers in America, the study examined customer satisfaction scores across a number of different language groups. It found a broad range of expectations for customers from different regions, with scores ranging from 12.54 points above the baseline (on a -100 to 100 scale) to 25.24 points below. The groups with the highest average satisfaction scores were: South American Spanish speakers: 12.54 points above the baseline Portuguese speakers in Brazil: 5.36 points above French Canadians: 4.93 points above Russian speakers: 4.35 points above \nThe groups with the lowest average satisfaction scores were: Japanese speakers: 25.54 points points below the baseline Dutch speakers: 19.4 points below Swedish speakers: 13 points below Chinese speakers: 11.5 points below \nThe strength of any customer relationship is strongly influenced by prevailing cultural expectations around factors like authenticity, timeliness and respect, said Dorian Stone, VP of Customer Experience Strategy and Marketing at Medallia. The better communication companies have with their customers, the better theyll be able to understand these factors and use that knowledge to deliver great experiences. Additional Findings The study also found that sharing a common language did not result in the same expectations. British English speakers were typically harder to please than Americans, giving satisfaction scores that on average were 5.58 points lower. Additionally, French consumers had higher expectations than French Canadians, grading their experiences 9.1 points lower, and Spanish speakers in Mexico gave average scores 12.03 points lower than their compatriots in South America. The study also found similarities in broader geographic regions. The six European language groups investigated in the study (British English, French, German, Dutch, Swedish and Italian) all rated their experiences lower on average than American English speakers  with Dutch speakers giving the lowest score of 19.4 points below the baseline. Meanwhile, both South American language groups gave higher average scores than Americans. Research and Ranking Methodology The Medallia Institute study examined over 10 million consumer scores across the hospitality industry, and covered 15 global language groups: American English, British English, Spanish (Mexico), Spanish (South America), Portuguese (Brazil), German, French (France), French (Canada), Swedish, Dutch, Italian, Russian, Korean, Chinese, and Japanese. The study examined consumer ratings both in a native speakers home country/region and abroad. Absolute scores for each language were measured based on the Net Promoter Score ®, a widely used measure of customer satisfaction. Scores could range from a low of -100 to a high of 100. Different groups scores were then compared by measuring each ones distance from the baseline provided by American English. About Medallia Medallia® is the Customer Experience Management company that is trusted by hundreds of the worlds leading brands. Medallia software enables companies to continually improve the customer experience by capturing customer feedback everywhere (including web, social, mobile, and contact center channels), understanding it in real time, and delivering insights and actions throughout the organizationfrom the C-suite to the frontline. Founded in 2001, Medallia has offices in Silicon Valley, New York, London, Paris, Hong Kong, Sydney and Buenos Aires. Learn more at www.Medallia.com . ©2015 Medallia, Inc. Medallia is a registered trademark of Medallia, Inc. Net Promoter, NPS, and Net Promoter Score are trademarks of Satmetrix Systems, Inc., Bain & Company, and Fred Reichheld", "external_links": [], "published": "2015-09-24T15:00:00.000+03:00", "crawled": "2015-09-24T17:29:16.190+03:00", "highlightTitle": ""}